{
  "id": "55.10",
  "url": "https://www.revisor.mn.gov/statutes/cite/55.10",
  "title": "55.10 LIABILITY; EXEMPTIONS.",
  "text": "When a safe deposit box shall have been hired from any licensed safe deposit company in the name of two or more persons, including a married couple, with the right of access being given to either, or with access to either or the survivor or survivors of the person, or property is held for safekeeping by any licensed safe deposit company for two or more persons, including a married couple, with the right of delivery being given to either, or with the right of delivery to either of the survivor or survivors of these persons, any one or more of these persons, whether the other or others be living or not, shall have the right of access to the safe deposit box and the right to remove all, or any part, of the contents thereof, or to have delivered to all or any one of them, or any part of the valuable personal property so held for safekeeping; and, in case of this access, removal, or delivery, the safe deposit company shall be exempt from any liability for permitting the access, removal, or delivery.\n[Repealed, 1Sp1985 c 14 art 13 s 14]\nNo safe deposit company shall be liable to any person by reason of having permitted access to a safe deposit box to an authorized agent of the tenant of such box, after the death of such tenant, until actual notice of such death has been received by the safe deposit company, nor shall any such company be liable to any person because of having granted access to any safe deposit box to any state or federal officer acting under authority of an order of any court of general jurisdiction.\n(a) Upon being furnished with satisfactory proof of death of a sole lessee or the last surviving co-lessee of a safe deposit box, an employee of the safe deposit company shall open the box and examine the contents in the presence of an individual who appears in person and furnishes an affidavit stating that the individual believes:\n(1) the box may contain the will or deed to a burial lot or a document containing instructions for the burial of the lessee or that the box may contain property belonging to the estate of the lessee; and\n(2) the individual is an interested person as defined in this section and wishes to open the box for any one or more of the following purposes:\n(i) to conduct a will search;\n(ii) to obtain a document required to facilitate the lessee's wishes regarding body, funeral, or burial arrangements; or\n(iii) to obtain an inventory of the contents of the box.\n(b) The safe deposit company may not open the box under this section if it has received a copy of letters of office of the representative of the deceased lessee's estate or other applicable court order.\n(c) The safe deposit company need not open the box if:\n(1) the box has previously been opened under this section for the same purpose;\n(2) the safe deposit company has received notice of a written or oral objection from any person or has reason to believe that there would be an objection; or\n(3) the lessee's key or combination is not available.\n(d) For purposes of this section, the term \"interested person\" means any of the following:\n(1) a person named as personal representative in a purported will of the lessee;\n(2) a person who immediately prior to the death of the lessee had the right of access to the box as a deputy;\n(3) the surviving spouse of the lessee;\n(4) a devisee of the lessee;\n(5) an heir of the lessee;\n(6) a person designated by the lessee in a writing acceptable to the safe deposit company which is filed with the safe deposit company before death; or\n(7) a state or county agency with a claim authorized by section 256B.15.\n(e) For purposes of this section, the term \"will\" includes a will or a codicil.\n(f) If the box is opened for the purpose of conducting a will search, the safe deposit company shall remove any document that appears to be a will and make a true and correct machine copy thereof, replace the copy in the box, and then deliver the original thereof to the clerk of court for the county in which the lessee resided immediately before the lessee's death, if known to the safe deposit company, otherwise to the clerk of the court for the county in which the safe deposit box is located. The will must be personally delivered or sent by registered mail. If the interested person so requests, any deed to burial lot or document containing instructions for the burial of the lessee may be copied by the safe deposit box company and the copy or copies thereof delivered to the interested person.\n(g) If the box is opened for the purpose of obtaining a document required to facilitate the lessee's wishes regarding the body, funeral, or burial arrangements, any such document may be removed from the box and delivered to the interested person with a true and correct machine copy retained in the box. If the safe deposit box company discovers a document that appears to be a will, the safe deposit company shall act in accordance with paragraph (f).\n(h) If the box is opened for the purpose of obtaining an inventory of the contents of the box, the employee of the safe deposit company shall make, or cause to be made, an inventory of the contents of the box, to which the employee and the interested person shall attest under penalty of perjury to be correct and complete. Within ten days of opening the box pursuant to this subdivision, the safe deposit company shall deliver the original inventory of the contents to the court administrator for the county in which the lessee resided immediately before the lessee's death, if known to the safe deposit company, otherwise to the court administrator for the county in which the safe deposit box is located. The inventory must be personally delivered or sent by registered mail. If the interested person so requests, the safe deposit company shall make a true and correct copy of any document in the box, and of the completed inventory form, and deliver that copy to the interested person. If the contents of the box include a document that appears to be a will, the safe deposit company shall act in accordance with paragraph (f).\n(i) If a box opened for the purpose of conducting an inventory, will search, or burial document search is completely empty, the safe deposit company need not follow the procedures above. Instead, the employee of the safe deposit company can complete an inventory of the box contents indicating the fact that the box contained nothing. The form must be signed by the employee and the interested person. If the interested person so requests, the safe deposit company may provide a copy of the completed inventory form to the interested person. The interested person shall then complete the documentation needed by the safe deposit company to surrender the empty box. If another interested person inquires about the box after it has been surrendered, the safe deposit company may state that the deceased renter had previously rented the box and that the box was surrendered because it was empty.\n(j) The safe deposit company need not ascertain the truth of any statement in the affidavit required to be furnished under this subdivision and when acting in reliance upon an affidavit, it is discharged as if it dealt with the personal representative of the lessee. The safe deposit company is not responsible for the adequacy of the description of any property included in an inventory of the contents of a safe deposit box, nor for conversion of the property in connection with actions performed under this subdivision, except for conversion by intentional acts of the company or its employees, directors, officers, or agents. If the safe deposit company is not satisfied that the requirements of this subdivision have been met, it may decline to open the box.\n(k) No contents of a box other than a will and a document required to facilitate the lessee's wishes regarding body, funeral, or burial arrangements may be removed pursuant to this subdivision. The entire contents of the box, however, may be removed pursuant to section 524.3-1201.",
  "repealed": false,
  "rules": [
    {
      "rule": {
        "and": [
          {
            "or": [
              {
                "==": [
                  {
                    "var": "access_right"
                  },
                  true
                ]
              },
              {
                "==": [
                  {
                    "var": "delivery_right"
                  },
                  true
                ]
              }
            ]
          },
          {
            "or": [
              {
                "==": [
                  {
                    "var": "person_count"
                  },
                  2
                ]
              },
              {
                "==": [
                  {
                    "var": "married_couple"
                  },
                  true
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "access_right": true,
          "delivery_right": false,
          "person_count": 2,
          "married_couple": false
        },
        {
          "access_right": false,
          "delivery_right": true,
          "person_count": 3,
          "married_couple": true
        },
        {
          "access_right": true,
          "delivery_right": true,
          "person_count": 1,
          "married_couple": false
        }
      ],
      "variables": [
        {
          "name": "access_right",
          "description": "Indicates if the right of access is given to either person."
        },
        {
          "name": "delivery_right",
          "description": "Indicates if the right of delivery is given to either person."
        },
        {
          "name": "person_count",
          "description": "The number of persons involved in hiring the safe deposit box."
        },
        {
          "name": "married_couple",
          "description": "Indicates if the persons are a married couple."
        }
      ],
      "consequences": [
        "Any one or more of these persons shall have the right of access to the safe deposit box and the right to remove all, or any part, of the contents thereof."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "authorized_agent"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "tenant_deceased"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "notice_of_death_received"
              },
              false
            ]
          }
        ]
      },
      "examples": [
        {
          "authorized_agent": true,
          "tenant_deceased": true,
          "notice_of_death_received": false
        },
        {
          "authorized_agent": false,
          "tenant_deceased": true,
          "notice_of_death_received": true
        },
        {
          "authorized_agent": true,
          "tenant_deceased": false,
          "notice_of_death_received": false
        }
      ],
      "variables": [
        {
          "name": "authorized_agent",
          "description": "Indicates if the person accessing the box is an authorized agent of the tenant."
        },
        {
          "name": "tenant_deceased",
          "description": "Indicates if the tenant of the box is deceased."
        },
        {
          "name": "notice_of_death_received",
          "description": "Indicates if the safe deposit company has received actual notice of the tenant's death."
        }
      ],
      "consequences": [
        "The safe deposit company shall not be liable for permitting access to the safe deposit box."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "proof_of_death_provided"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "sole_lessee"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "affidavit_provided"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "proof_of_death_provided": true,
          "sole_lessee": true,
          "affidavit_provided": true
        },
        {
          "proof_of_death_provided": false,
          "sole_lessee": true,
          "affidavit_provided": true
        },
        {
          "proof_of_death_provided": true,
          "sole_lessee": false,
          "affidavit_provided": false
        }
      ],
      "variables": [
        {
          "name": "proof_of_death_provided",
          "description": "Indicates if satisfactory proof of death of the sole lessee is provided."
        },
        {
          "name": "sole_lessee",
          "description": "Indicates if the deceased was the sole lessee or the last surviving co-lessee."
        },
        {
          "name": "affidavit_provided",
          "description": "Indicates if an affidavit is provided by an interested person."
        }
      ],
      "consequences": [
        "An employee of the safe deposit company shall open the box and examine the contents in the presence of the interested person."
      ]
    },
    {
      "rule": {
        "or": [
          {
            "==": [
              {
                "var": "letters_of_office_received"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "court_order_received"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "letters_of_office_received": true,
          "court_order_received": false
        },
        {
          "letters_of_office_received": false,
          "court_order_received": true
        },
        {
          "letters_of_office_received": false,
          "court_order_received": false
        }
      ],
      "variables": [
        {
          "name": "letters_of_office_received",
          "description": "Indicates if the safe deposit company has received a copy of letters of office of the representative of the deceased lessee's estate."
        },
        {
          "name": "court_order_received",
          "description": "Indicates if the safe deposit company has received a court order."
        }
      ],
      "consequences": [
        "The safe deposit company may not open the box."
      ]
    },
    {
      "rule": {
        "or": [
          {
            "==": [
              {
                "var": "box_previously_opened"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "objection_received"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "key_unavailable"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "box_previously_opened": true,
          "objection_received": false,
          "key_unavailable": false
        },
        {
          "box_previously_opened": false,
          "objection_received": true,
          "key_unavailable": false
        },
        {
          "box_previously_opened": false,
          "objection_received": false,
          "key_unavailable": true
        }
      ],
      "variables": [
        {
          "name": "box_previously_opened",
          "description": "Indicates if the box has previously been opened for the same purpose."
        },
        {
          "name": "objection_received",
          "description": "Indicates if the safe deposit company has received notice of an objection."
        },
        {
          "name": "key_unavailable",
          "description": "Indicates if the lessee's key or combination is unavailable."
        }
      ],
      "consequences": [
        "The safe deposit company need not open the box."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "box_opened_for_will_search"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "document_appears_to_be_will"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "box_opened_for_will_search": true,
          "document_appears_to_be_will": true
        },
        {
          "box_opened_for_will_search": false,
          "document_appears_to_be_will": true
        },
        {
          "box_opened_for_will_search": true,
          "document_appears_to_be_will": false
        }
      ],
      "variables": [
        {
          "name": "box_opened_for_will_search",
          "description": "Indicates if the box is opened for the purpose of conducting a will search."
        },
        {
          "name": "document_appears_to_be_will",
          "description": "Indicates if a document that appears to be a will is found."
        }
      ],
      "consequences": [
        "The safe deposit company shall remove the document, make a copy, replace the copy in the box, and deliver the original to the clerk of court."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "box_opened_for_burial_document"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "document_required_for_burial"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "box_opened_for_burial_document": true,
          "document_required_for_burial": true
        },
        {
          "box_opened_for_burial_document": false,
          "document_required_for_burial": true
        },
        {
          "box_opened_for_burial_document": true,
          "document_required_for_burial": false
        }
      ],
      "variables": [
        {
          "name": "box_opened_for_burial_document",
          "description": "Indicates if the box is opened for the purpose of obtaining a burial document."
        },
        {
          "name": "document_required_for_burial",
          "description": "Indicates if a document required for burial arrangements is found."
        }
      ],
      "consequences": [
        "The document may be removed and delivered to the interested person with a copy retained in the box."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "box_opened_for_inventory"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "inventory_completed"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "box_opened_for_inventory": true,
          "inventory_completed": true
        },
        {
          "box_opened_for_inventory": false,
          "inventory_completed": true
        },
        {
          "box_opened_for_inventory": true,
          "inventory_completed": false
        }
      ],
      "variables": [
        {
          "name": "box_opened_for_inventory",
          "description": "Indicates if the box is opened for the purpose of obtaining an inventory of the contents."
        },
        {
          "name": "inventory_completed",
          "description": "Indicates if an inventory of the contents is completed."
        }
      ],
      "consequences": [
        "The inventory must be delivered to the court administrator within ten days."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "box_empty"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "box_opened_for_inventory"
              },
              true
            ]
          }
        ]
      },
      "examples": [
        {
          "box_empty": true,
          "box_opened_for_inventory": true
        },
        {
          "box_empty": false,
          "box_opened_for_inventory": true
        },
        {
          "box_empty": true,
          "box_opened_for_inventory": false
        }
      ],
      "variables": [
        {
          "name": "box_empty",
          "description": "Indicates if the box is completely empty."
        },
        {
          "name": "box_opened_for_inventory",
          "description": "Indicates if the box is opened for the purpose of conducting an inventory."
        }
      ],
      "consequences": [
        "The safe deposit company need not follow the usual procedures and can complete an inventory indicating the box was empty."
      ]
    },
    {
      "rule": {
        "==": [
          {
            "var": "affidavit_statement_true"
          },
          true
        ]
      },
      "examples": [
        {
          "affidavit_statement_true": true
        },
        {
          "affidavit_statement_true": false
        }
      ],
      "variables": [
        {
          "name": "affidavit_statement_true",
          "description": "Indicates if the statements in the affidavit are true."
        }
      ],
      "consequences": [
        "The safe deposit company is discharged as if it dealt with the personal representative of the lessee."
      ]
    },
    {
      "rule": {
        "==": [
          {
            "var": "contents_removal_restricted"
          },
          true
        ]
      },
      "examples": [
        {
          "contents_removal_restricted": true
        },
        {
          "contents_removal_restricted": false
        }
      ],
      "variables": [
        {
          "name": "contents_removal_restricted",
          "description": "Indicates if the removal of contents is restricted to a will and burial documents."
        }
      ],
      "consequences": [
        "No contents other than a will and burial documents may be removed."
      ]
    }
  ]
}