{
  "id": "1.05",
  "url": "https://www.revisor.mn.gov/statutes/cite/1.05",
  "title": "1.05 WAIVER OF IMMUNITY FOR VIOLATIONS OF CERTAIN FEDERAL STATUTES.",
  "text": "An employee, former employee, or prospective employee of the state who is aggrieved by the state's violation of the Age Discrimination in Employment Act of 1967, United States Code, title 29, section 621, et seq., as amended, may bring a civil action against the state in federal court or in any other court of competent jurisdiction for such legal or equitable relief as will effectuate the purposes of the act.\nAn employee of the state who is aggrieved by the state's violation of the Fair Labor Standards Act of 1938, United States Code, title 29, section 201, et seq., as amended, may bring a civil action against the state in federal court or in any other court of competent jurisdiction for such legal or equitable relief as will effectuate the purposes of the act.\nAn employee, former employee, or prospective employee of the state who is aggrieved by the state's violation of the Family and Medical Leave Act, United States Code, title 29, sections 2601 to 2654, as amended, may bring a civil action against the state in federal court or in any other court of competent jurisdiction for such legal or equitable relief as will effectuate the purposes of the act.\nAn employee, former employee, or prospective employee of the state who is aggrieved by the state's violation of the Americans with Disabilities Act of 1990, United States Code, title 42, section 12101, as amended, may bring a civil action against the state in federal court or in any other court of competent jurisdiction for such legal or equitable relief as will effectuate the purposes of the act.\nAn employee, former employee, or prospective employee of the state who is aggrieved by the state's violation of the Uniformed Services Employment and Reemployment Rights Act, United States Code, title 38, sections 4301 to 4333, as amended, may bring a civil action against the state in federal court or another court of competent jurisdiction for legal or equitable relief that will effectuate the purposes of that act.",
  "repealed": false,
  "rules": [
    {
      "rule": {
        "and": [
          {
            "or": [
              {
                "==": [
                  {
                    "var": "employee_status"
                  },
                  "employee"
                ]
              },
              {
                "==": [
                  {
                    "var": "employee_status"
                  },
                  "former_employee"
                ]
              },
              {
                "==": [
                  {
                    "var": "employee_status"
                  },
                  "prospective_employee"
                ]
              }
            ]
          },
          {
            "or": [
              {
                "==": [
                  {
                    "var": "law_violated"
                  },
                  "Age Discrimination in Employment Act"
                ]
              },
              {
                "==": [
                  {
                    "var": "law_violated"
                  },
                  "Fair Labor Standards Act"
                ]
              },
              {
                "==": [
                  {
                    "var": "law_violated"
                  },
                  "Family and Medical Leave Act"
                ]
              },
              {
                "==": [
                  {
                    "var": "law_violated"
                  },
                  "Americans with Disabilities Act"
                ]
              },
              {
                "==": [
                  {
                    "var": "law_violated"
                  },
                  "Uniformed Services Employment and Reemployment Rights Act"
                ]
              }
            ]
          },
          {
            "==": [
              {
                "var": "aggrieved"
              },
              "true"
            ]
          }
        ]
      },
      "examples": [
        {
          "employee_status": "employee",
          "law_violated": "Age Discrimination in Employment Act",
          "aggrieved": "true"
        },
        {
          "employee_status": "former_employee",
          "law_violated": "Family and Medical Leave Act",
          "aggrieved": "true"
        },
        {
          "employee_status": "prospective_employee",
          "law_violated": "Americans with Disabilities Act",
          "aggrieved": "true"
        }
      ],
      "variables": [
        {
          "name": "employee_status",
          "description": "The status of the person as an employee, former employee, or prospective employee of the state."
        },
        {
          "name": "law_violated",
          "description": "The specific law that the state is alleged to have violated."
        },
        {
          "name": "aggrieved",
          "description": "Indicates whether the person is aggrieved by the state's violation of the law."
        }
      ],
      "consequences": [
        "The individual may bring a civil action against the state in federal court or any other court of competent jurisdiction for legal or equitable relief."
      ]
    }
  ]
}