{
  "id": "53B.75",
  "url": "https://www.revisor.mn.gov/statutes/cite/53B.75",
  "title": "53B.75 VIRTUAL CURRENCY KIOSKS.",
  "text": "(a) Before entering into an initial virtual currency transaction for, on behalf of, or with a person, the virtual currency kiosk operator must disclose in a clear, conspicuous, and easily readable manner all material risks generally associated with virtual currency. The disclosures must be displayed on the screen of the virtual currency kiosk with the ability for a person to acknowledge the receipt of the disclosures. The disclosures must include at least the following information:\n(1) virtual currency is not legal tender, backed or insured by the government, and accounts and value balances are not subject to Federal Deposit Insurance Corporation, National Credit Union Administration, or Securities Investor Protection Corporation protections;\n(2) some virtual currency transactions are deemed to be made when recorded on a public ledger, which may not be the date or time when the person initiates the transaction;\n(3) virtual currency's value may be derived from market participants' continued willingness to exchange fiat currency for virtual currency, which may result in the permanent and total loss of a particular virtual currency's value if the market for virtual currency disappears;\n(4) a person who accepts a virtual currency as payment today is not required to accept and might not accept virtual currency in the future;\n(5) the volatility and unpredictability of the price of virtual currency relative to fiat currency may result in a significant loss over a short period;\n(6) the nature of virtual currency means that any technological difficulties experienced by virtual currency kiosk operators may prevent access to or use of a person's virtual currency; and\n(7) any bond maintained by the virtual currency kiosk operator for the benefit of a person may not cover all losses a person incurs.\n(b) The virtual currency kiosk operator must provide an additional disclosure, which must be acknowledged by the person, written prominently and in bold type, and provided separately from the disclosures above, stating: \"WARNING: LOSSES DUE TO FRAUDULENT OR ACCIDENTAL TRANSACTIONS ARE NOT RECOVERABLE AND TRANSACTIONS IN VIRTUAL CURRENCY ARE IRREVERSIBLE. VIRTUAL CURRENCY TRANSACTIONS MAY BE USED BY SCAMMERS IMPERSONATING LOVED ONES, THREATENING JAIL TIME, AND INSISTING YOU WITHDRAW MONEY FROM YOUR BANK ACCOUNT TO PURCHASE VIRTUAL CURRENCY.\"\n(a) A virtual currency kiosk operator must disclose all relevant terms and conditions generally associated with the products, services, and activities of the virtual currency kiosk operator and virtual currency. A virtual currency kiosk operator must make the disclosures in a clear, conspicuous, and easily readable manner. The disclosures under this subdivision must address at least the following:\n(1) the person's liability for unauthorized virtual currency transactions;\n(2) the person's right to:\n(i) stop payment of a virtual currency transfer and the procedure to stop payment;\n(ii) receive a receipt, trade ticket, or other evidence of a transaction at the time of the transaction; and\n(iii) prior notice of a change in the virtual currency kiosk operator's rules or policies;\n(3) under what circumstances the virtual currency kiosk operator, without a court or government order, discloses a person's account information to third parties; and\n(4) other disclosures that are customarily provided in connection with opening a person's account.\n(b) Before each virtual currency transaction for, on behalf of, or with a person, a virtual currency kiosk operator must disclose the transaction's terms and conditions in a clear, conspicuous, and easily readable manner. The disclosures under this subdivision must address at least the following:\n(1) the amount of the transaction;\n(2) any fees, expenses, and charges, including applicable exchange rates;\n(3) the type and nature of the transaction;\n(4) a warning that once completed, the transaction may not be reversed;\n(5) a daily virtual currency transaction limit of no more than $2,000;\n(6) the difference in the virtual currency's sale price compared to the current market price; and\n(7) other disclosures that are customarily given in connection with a virtual currency transaction.\nBefore completing a transaction, a virtual currency kiosk operator must ensure that each person who engages in a virtual currency transaction using the virtual currency operator's kiosk acknowledges receipt of all disclosures required under this section via confirmation of consent. Additionally, upon a transaction's completion, the virtual currency kiosk operator must provide a person with a physical receipt, or a virtual receipt sent to the person's email address or SMS number, containing the following information:\n(1) the virtual currency kiosk operator's name and contact information, including a telephone number to answer questions and register complaints;\n(2) the type, value, date, and precise time of the transaction, transaction hash, and each virtual currency address;\n(3) the fees charged;\n(4) the exchange rate;\n(5) a statement of the virtual currency kiosk operator's liability for nondelivery or delayed delivery;\n(6) a statement of the virtual currency kiosk operator's refund policy; and\n(7) any additional information the commissioner of commerce may require.\nA virtual currency kiosk operator must issue a refund to a new customer for the full amount of all transactions made within the 72-hour new customer time period, as described in section 53B.69, subdivision 3b, upon request of the customer. In order to receive a refund under this subdivision, a customer must:\n(1) have been fraudulently induced to engage in the virtual currency transactions; and\n(2) within 14 days of the last transaction to occur during the 72-hour new customer time period, contact the virtual currency kiosk operator and a government or law enforcement agency to inform them of the fraudulent nature of the transaction.\n(a) There is an established maximum daily transaction limit of $2,000 for each new customer of a virtual currency kiosk.\n(b) The maximum daily transaction limit of an existing customer shall be decided by each virtual currency kiosk operator in compliance with federal law.",
  "repealed": false,
  "rules": [
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "transaction.type"
              },
              "initial"
            ]
          },
          {
            "==": [
              {
                "var": "disclosure.displayed"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "disclosure.acknowledged"
              },
              true
            ]
          },
          {
            "all": [
              {
                "var": "disclosure.content"
              },
              [
                {
                  "in": [
                    "virtual currency is not legal tender",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "transactions are recorded on a public ledger",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "value may be derived from market participants",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "acceptance of virtual currency is not guaranteed",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "volatility may result in significant loss",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "technological difficulties may prevent access",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "bond may not cover all losses",
                    {
                      "var": ""
                    }
                  ]
                }
              ]
            ]
          }
        ]
      },
      "examples": [
        {
          "transaction": {
            "type": "initial"
          },
          "disclosure": {
            "displayed": true,
            "acknowledged": true,
            "content": [
              "virtual currency is not legal tender",
              "transactions are recorded on a public ledger",
              "value may be derived from market participants",
              "acceptance of virtual currency is not guaranteed",
              "volatility may result in significant loss",
              "technological difficulties may prevent access",
              "bond may not cover all losses"
            ]
          }
        },
        {
          "transaction": {
            "type": "initial"
          },
          "disclosure": {
            "displayed": false,
            "acknowledged": true,
            "content": [
              "virtual currency is not legal tender"
            ]
          }
        },
        {
          "transaction": {
            "type": "initial"
          },
          "disclosure": {
            "displayed": true,
            "acknowledged": false,
            "content": [
              "virtual currency is not legal tender"
            ]
          }
        }
      ],
      "variables": [
        {
          "name": "transaction.type",
          "description": "The type of transaction being conducted, e.g., initial or subsequent."
        },
        {
          "name": "disclosure.displayed",
          "description": "Whether the required disclosures are displayed on the kiosk screen."
        },
        {
          "name": "disclosure.acknowledged",
          "description": "Whether the person has acknowledged receipt of the disclosures."
        },
        {
          "name": "disclosure.content",
          "description": "The content of the disclosures provided to the person."
        }
      ],
      "consequences": [
        "Proceed with the transaction"
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "disclosure.additional.displayed"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "disclosure.additional.acknowledged"
              },
              true
            ]
          },
          {
            "in": [
              "WARNING: LOSSES DUE TO FRAUDULENT OR ACCIDENTAL TRANSACTIONS ARE NOT RECOVERABLE",
              {
                "var": "disclosure.additional.content"
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "disclosure": {
            "additional": {
              "displayed": true,
              "acknowledged": true,
              "content": "WARNING: LOSSES DUE TO FRAUDULENT OR ACCIDENTAL TRANSACTIONS ARE NOT RECOVERABLE"
            }
          }
        },
        {
          "disclosure": {
            "additional": {
              "displayed": false,
              "acknowledged": true,
              "content": "WARNING: LOSSES DUE TO FRAUDULENT OR ACCIDENTAL TRANSACTIONS ARE NOT RECOVERABLE"
            }
          }
        },
        {
          "disclosure": {
            "additional": {
              "displayed": true,
              "acknowledged": false,
              "content": "WARNING: LOSSES DUE TO FRAUDULENT OR ACCIDENTAL TRANSACTIONS ARE NOT RECOVERABLE"
            }
          }
        }
      ],
      "variables": [
        {
          "name": "disclosure.additional.displayed",
          "description": "Whether the additional warning disclosure is displayed prominently."
        },
        {
          "name": "disclosure.additional.acknowledged",
          "description": "Whether the person has acknowledged receipt of the additional warning disclosure."
        },
        {
          "name": "disclosure.additional.content",
          "description": "The content of the additional warning disclosure."
        }
      ],
      "consequences": [
        "Proceed with the transaction"
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "transaction.type"
              },
              "subsequent"
            ]
          },
          {
            "==": [
              {
                "var": "disclosure.terms.displayed"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "disclosure.terms.acknowledged"
              },
              true
            ]
          },
          {
            "all": [
              {
                "var": "disclosure.terms.content"
              },
              [
                {
                  "in": [
                    "liability for unauthorized transactions",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "right to stop payment",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "right to receive a receipt",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "prior notice of policy changes",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "disclosure of account information to third parties",
                    {
                      "var": ""
                    }
                  ]
                }
              ]
            ]
          }
        ]
      },
      "examples": [
        {
          "transaction": {
            "type": "subsequent"
          },
          "disclosure": {
            "terms": {
              "displayed": true,
              "acknowledged": true,
              "content": [
                "liability for unauthorized transactions",
                "right to stop payment",
                "right to receive a receipt",
                "prior notice of policy changes",
                "disclosure of account information to third parties"
              ]
            }
          }
        },
        {
          "transaction": {
            "type": "subsequent"
          },
          "disclosure": {
            "terms": {
              "displayed": false,
              "acknowledged": true,
              "content": [
                "liability for unauthorized transactions"
              ]
            }
          }
        },
        {
          "transaction": {
            "type": "subsequent"
          },
          "disclosure": {
            "terms": {
              "displayed": true,
              "acknowledged": false,
              "content": [
                "liability for unauthorized transactions"
              ]
            }
          }
        }
      ],
      "variables": [
        {
          "name": "transaction.type",
          "description": "The type of transaction being conducted, e.g., initial or subsequent."
        },
        {
          "name": "disclosure.terms.displayed",
          "description": "Whether the terms and conditions are displayed on the kiosk screen."
        },
        {
          "name": "disclosure.terms.acknowledged",
          "description": "Whether the person has acknowledged receipt of the terms and conditions."
        },
        {
          "name": "disclosure.terms.content",
          "description": "The content of the terms and conditions provided to the person."
        }
      ],
      "consequences": [
        "Proceed with the transaction"
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "transaction.completed"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "receipt.provided"
              },
              true
            ]
          },
          {
            "all": [
              {
                "var": "receipt.content"
              },
              [
                {
                  "in": [
                    "operator's name and contact information",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "type, value, date, and time of transaction",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "fees charged",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "exchange rate",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "liability for nondelivery",
                    {
                      "var": ""
                    }
                  ]
                },
                {
                  "in": [
                    "refund policy",
                    {
                      "var": ""
                    }
                  ]
                }
              ]
            ]
          }
        ]
      },
      "examples": [
        {
          "transaction": {
            "completed": true
          },
          "receipt": {
            "provided": true,
            "content": [
              "operator's name and contact information",
              "type, value, date, and time of transaction",
              "fees charged",
              "exchange rate",
              "liability for nondelivery",
              "refund policy"
            ]
          }
        },
        {
          "transaction": {
            "completed": true
          },
          "receipt": {
            "provided": false,
            "content": [
              "operator's name and contact information"
            ]
          }
        },
        {
          "transaction": {
            "completed": false
          },
          "receipt": {
            "provided": true,
            "content": [
              "operator's name and contact information"
            ]
          }
        }
      ],
      "variables": [
        {
          "name": "transaction.completed",
          "description": "Whether the transaction has been completed."
        },
        {
          "name": "receipt.provided",
          "description": "Whether a receipt has been provided to the person."
        },
        {
          "name": "receipt.content",
          "description": "The content of the receipt provided to the person."
        }
      ],
      "consequences": [
        "Transaction is finalized"
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "customer.status"
              },
              "new"
            ]
          },
          {
            "<=": [
              {
                "var": "transaction.amount"
              },
              2000
            ]
          }
        ]
      },
      "examples": [
        {
          "customer": {
            "status": "new"
          },
          "transaction": {
            "amount": 1500
          }
        },
        {
          "customer": {
            "status": "new"
          },
          "transaction": {
            "amount": 2500
          }
        },
        {
          "customer": {
            "status": "existing"
          },
          "transaction": {
            "amount": 1500
          }
        }
      ],
      "variables": [
        {
          "name": "customer.status",
          "description": "The status of the customer, e.g., new or existing."
        },
        {
          "name": "transaction.amount",
          "description": "The amount of the transaction being conducted."
        }
      ],
      "consequences": [
        "Transaction is allowed"
      ]
    },
    {
      "rule": {
        "and": [
          {
            "==": [
              {
                "var": "customer.status"
              },
              "new"
            ]
          },
          {
            "<=": [
              {
                "var": "transaction.amount"
              },
              2000
            ]
          },
          {
            "==": [
              {
                "var": "refund.requested"
              },
              true
            ]
          },
          {
            "==": [
              {
                "var": "fraud.reported"
              },
              true
            ]
          },
          {
            "<=": [
              {
                "var": "time.since.last.transaction"
              },
              14
            ]
          }
        ]
      },
      "examples": [
        {
          "customer": {
            "status": "new"
          },
          "transaction": {
            "amount": 1500
          },
          "refund": {
            "requested": true
          },
          "fraud": {
            "reported": true
          },
          "time": {
            "since.last.transaction": 10
          }
        },
        {
          "customer": {
            "status": "new"
          },
          "transaction": {
            "amount": 1500
          },
          "refund": {
            "requested": false
          },
          "fraud": {
            "reported": true
          },
          "time": {
            "since.last.transaction": 10
          }
        },
        {
          "customer": {
            "status": "new"
          },
          "transaction": {
            "amount": 1500
          },
          "refund": {
            "requested": true
          },
          "fraud": {
            "reported": true
          },
          "time": {
            "since.last.transaction": 20
          }
        }
      ],
      "variables": [
        {
          "name": "customer.status",
          "description": "The status of the customer, e.g., new or existing."
        },
        {
          "name": "transaction.amount",
          "description": "The amount of the transaction being conducted."
        },
        {
          "name": "refund.requested",
          "description": "Whether the customer has requested a refund."
        },
        {
          "name": "fraud.reported",
          "description": "Whether the customer has reported the transaction as fraudulent."
        },
        {
          "name": "time.since.last.transaction",
          "description": "The time in days since the last transaction occurred."
        }
      ],
      "consequences": [
        "Issue a refund"
      ]
    }
  ]
}