{
  "id": "53B.69",
  "url": "https://www.revisor.mn.gov/statutes/cite/53B.69",
  "title": "53B.69 DEFINITIONS.",
  "text": "For purposes of sections 53B.70 to 53B.74, the following terms have the meanings given them.\n\"Control of virtual currency,\" when used in reference to a transaction or relationship involving virtual currency, means the power to execute unilaterally or prevent indefinitely a virtual currency transaction.\n\"Exchange,\" used as a verb, means to assume control of virtual currency from or on behalf of a person, at least momentarily, to sell, trade, or convert:\n(1) virtual currency for money, bank credit, or one or more forms of virtual currency; or\n(2) money or bank credit for one or more forms of virtual currency.\n\"Transaction hash\" means a unique identifier made up of a string of characters that act as a record of and provide proof that the transaction was verified and added to the blockchain.\n\"New customer\" means a consumer transacting at a kiosk in Minnesota who has been a customer with a virtual currency kiosk operator for less than 72 hours. After a 72-hour period has elapsed from the day of first signing up as a customer with a virtual currency kiosk operator, the customer will be considered an existing customer and no longer subject to the new customer transaction limit described in section 53B.75, subdivision 5, paragraph (a).\n\"Existing customer\" means a consumer transacting at a kiosk in Minnesota who has been a customer with a virtual currency kiosk operator for more than a 72-hour period. A new customer will automatically convert to an existing customer after the 72-hour period of first becoming a new customer. An existing customer is subject to the transaction limits described in section 53B.75, subdivision 5, paragraph (b).\n\"Transfer\" means to assume control of virtual currency from or on behalf of a person and to:\n(1) credit the virtual currency to the account of another person;\n(2) move the virtual currency from one account of a person to another account of the same person; or\n(3) relinquish control of virtual currency to another person.\n\"United States dollar equivalent of virtual currency\" means the equivalent value of a particular virtual currency in United States dollars shown on a virtual-currency exchange based in the United States for a particular date or period specified in this chapter.\n(a) \"Virtual currency\" means a digital representation of value that:\n(1) is used as a medium of exchange, unit of account, or store of value; and\n(2) is not money, whether or not denominated in money.\n(b) Virtual currency does not include:\n(1) a transaction in which a merchant grants, as part of an affinity or rewards program, value that cannot be taken from or exchanged with the merchant for money, bank credit, or virtual currency; or\n(2) a digital representation of value issued by or on behalf of a publisher and used solely within an online game, game platform, or family of games sold by the same publisher or offered on the same game platform.\n\"Virtual currency address\" means an alphanumeric identifier representing a destination for a virtual currency transfer that is associated with a virtual currency wallet.\n\"Virtual-currency administration\" means issuing virtual currency with the authority to redeem the currency for money, bank credit, or other virtual currency.\n\"Virtual-currency business activity\" means:\n(1) exchanging, transferring, or storing virtual currency or engaging in virtual-currency administration, whether directly or through an agreement with a virtual-currency control-services vendor;\n(2) holding electronic precious metals or electronic certificates representing interests in precious metals on behalf of another person or issuing shares or electronic certificates representing interests in precious metals; or\n(3) exchanging one or more digital representations of value used within one or more online games, game platforms, or family of games for:\n(i) virtual currency offered by or on behalf of the same publisher from which the original digital representation of value was received; or\n(ii) money or bank credit outside the online game, game platform, or family of games offered by or on behalf of the same publisher from which the original digital representation of value was received.\n\"Virtual-currency control-services vendor\" means a person that has control of virtual currency solely under an agreement with a person that, on behalf of another person, assumes control of virtual currency.\n\"Virtual currency kiosk\" means an electronic terminal acting as a mechanical agent of the virtual currency kiosk operator to enable the virtual currency kiosk operator to facilitate the exchange of virtual currency for money, bank credit, or other virtual currency, including but not limited to by (1) connecting directly to a separate virtual currency exchanger that performs the actual virtual currency transmission, or (2) drawing upon the virtual currency in the possession of the electronic terminal's operator.\n\"Virtual currency kiosk operator\" means a licensee that operates a virtual currency kiosk within Minnesota.\n\"Virtual currency kiosk transaction\" means a transaction conducted or performed, in whole or in part, by electronic means via a virtual currency kiosk. Virtual currency kiosk transaction also means a transaction made at a virtual currency kiosk to purchase currency with fiat currency or to sell virtual currency for fiat currency.\n\"Virtual currency wallet\" means a software application or other mechanism providing a means to hold, store, or transfer virtual currency.",
  "repealed": false,
  "rules": [
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "control_of_virtual_currency"
              },
              true
            ]
          },
          {
            "or": [
              {
                "===": [
                  {
                    "var": "action"
                  },
                  "execute_unilaterally"
                ]
              },
              {
                "===": [
                  {
                    "var": "action"
                  },
                  "prevent_indefinitely"
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "control_of_virtual_currency": true,
          "action": "execute_unilaterally"
        },
        {
          "control_of_virtual_currency": true,
          "action": "prevent_indefinitely"
        },
        {
          "control_of_virtual_currency": false,
          "action": "execute_unilaterally"
        }
      ],
      "variables": [
        {
          "name": "control_of_virtual_currency",
          "description": "Indicates if there is control over virtual currency in a transaction or relationship."
        },
        {
          "name": "action",
          "description": "The action taken with the virtual currency, such as executing or preventing a transaction."
        }
      ],
      "consequences": [
        "Has the power to execute or prevent a virtual currency transaction."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "exchange"
              },
              true
            ]
          },
          {
            "or": [
              {
                "and": [
                  {
                    "===": [
                      {
                        "var": "control_of_virtual_currency"
                      },
                      true
                    ]
                  },
                  {
                    "===": [
                      {
                        "var": "action"
                      },
                      "sell"
                    ]
                  }
                ]
              },
              {
                "and": [
                  {
                    "===": [
                      {
                        "var": "control_of_virtual_currency"
                      },
                      true
                    ]
                  },
                  {
                    "===": [
                      {
                        "var": "action"
                      },
                      "trade"
                    ]
                  }
                ]
              },
              {
                "and": [
                  {
                    "===": [
                      {
                        "var": "control_of_virtual_currency"
                      },
                      true
                    ]
                  },
                  {
                    "===": [
                      {
                        "var": "action"
                      },
                      "convert"
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "exchange": true,
          "control_of_virtual_currency": true,
          "action": "sell"
        },
        {
          "exchange": true,
          "control_of_virtual_currency": true,
          "action": "trade"
        },
        {
          "exchange": false,
          "control_of_virtual_currency": true,
          "action": "convert"
        }
      ],
      "variables": [
        {
          "name": "exchange",
          "description": "Indicates if the action is an exchange of virtual currency."
        },
        {
          "name": "control_of_virtual_currency",
          "description": "Indicates if there is control over virtual currency in a transaction or relationship."
        },
        {
          "name": "action",
          "description": "The action taken with the virtual currency, such as selling, trading, or converting."
        }
      ],
      "consequences": [
        "Assumes control of virtual currency to sell, trade, or convert it."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "new_customer"
              },
              true
            ]
          },
          {
            "<": [
              {
                "var": "customer_duration_hours"
              },
              72
            ]
          }
        ]
      },
      "examples": [
        {
          "new_customer": true,
          "customer_duration_hours": 24
        },
        {
          "new_customer": true,
          "customer_duration_hours": 48
        },
        {
          "new_customer": false,
          "customer_duration_hours": 72
        }
      ],
      "variables": [
        {
          "name": "new_customer",
          "description": "Indicates if the consumer is a new customer at a virtual currency kiosk."
        },
        {
          "name": "customer_duration_hours",
          "description": "The duration in hours since the consumer first became a customer."
        }
      ],
      "consequences": [
        "Subject to new customer transaction limit."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "existing_customer"
              },
              true
            ]
          },
          {
            ">=": [
              {
                "var": "customer_duration_hours"
              },
              72
            ]
          }
        ]
      },
      "examples": [
        {
          "existing_customer": true,
          "customer_duration_hours": 72
        },
        {
          "existing_customer": true,
          "customer_duration_hours": 100
        },
        {
          "existing_customer": false,
          "customer_duration_hours": 48
        }
      ],
      "variables": [
        {
          "name": "existing_customer",
          "description": "Indicates if the consumer is an existing customer at a virtual currency kiosk."
        },
        {
          "name": "customer_duration_hours",
          "description": "The duration in hours since the consumer first became a customer."
        }
      ],
      "consequences": [
        "Subject to existing customer transaction limits."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "transfer"
              },
              true
            ]
          },
          {
            "or": [
              {
                "===": [
                  {
                    "var": "action"
                  },
                  "credit_to_another"
                ]
              },
              {
                "===": [
                  {
                    "var": "action"
                  },
                  "move_within_same_person"
                ]
              },
              {
                "===": [
                  {
                    "var": "action"
                  },
                  "relinquish_control"
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "transfer": true,
          "action": "credit_to_another"
        },
        {
          "transfer": true,
          "action": "move_within_same_person"
        },
        {
          "transfer": false,
          "action": "relinquish_control"
        }
      ],
      "variables": [
        {
          "name": "transfer",
          "description": "Indicates if the action is a transfer of virtual currency."
        },
        {
          "name": "action",
          "description": "The action taken with the virtual currency, such as crediting, moving, or relinquishing control."
        }
      ],
      "consequences": [
        "Assumes control of virtual currency to credit, move, or relinquish it."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "virtual_currency"
              },
              true
            ]
          },
          {
            "===": [
              {
                "var": "is_digital_representation_of_value"
              },
              true
            ]
          },
          {
            "or": [
              {
                "===": [
                  {
                    "var": "used_as"
                  },
                  "medium_of_exchange"
                ]
              },
              {
                "===": [
                  {
                    "var": "used_as"
                  },
                  "unit_of_account"
                ]
              },
              {
                "===": [
                  {
                    "var": "used_as"
                  },
                  "store_of_value"
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "virtual_currency": true,
          "is_digital_representation_of_value": true,
          "used_as": "medium_of_exchange"
        },
        {
          "virtual_currency": true,
          "is_digital_representation_of_value": true,
          "used_as": "unit_of_account"
        },
        {
          "virtual_currency": false,
          "is_digital_representation_of_value": true,
          "used_as": "store_of_value"
        }
      ],
      "variables": [
        {
          "name": "virtual_currency",
          "description": "Indicates if the item is considered virtual currency."
        },
        {
          "name": "is_digital_representation_of_value",
          "description": "Indicates if the item is a digital representation of value."
        },
        {
          "name": "used_as",
          "description": "The purpose for which the digital representation is used, such as a medium of exchange, unit of account, or store of value."
        }
      ],
      "consequences": [
        "Recognized as virtual currency."
      ]
    },
    {
      "rule": {
        "and": [
          {
            "===": [
              {
                "var": "virtual_currency"
              },
              false
            ]
          },
          {
            "or": [
              {
                "===": [
                  {
                    "var": "transaction_type"
                  },
                  "affinity_or_rewards_program"
                ]
              },
              {
                "===": [
                  {
                    "var": "transaction_type"
                  },
                  "digital_representation_in_game"
                ]
              }
            ]
          }
        ]
      },
      "examples": [
        {
          "virtual_currency": false,
          "transaction_type": "affinity_or_rewards_program"
        },
        {
          "virtual_currency": false,
          "transaction_type": "digital_representation_in_game"
        },
        {
          "virtual_currency": true,
          "transaction_type": "affinity_or_rewards_program"
        }
      ],
      "variables": [
        {
          "name": "virtual_currency",
          "description": "Indicates if the item is considered virtual currency."
        },
        {
          "name": "transaction_type",
          "description": "The type of transaction, such as an affinity or rewards program or a digital representation in a game."
        }
      ],
      "consequences": [
        "Not recognized as virtual currency."
      ]
    }
  ]
}