{
  "id": "573.16",
  "url": "https://www.revisor.mn.gov/statutes/cite/573.16",
  "title": "573.16 DEFENSES; OTHER DEBTS OUTSTANDING OR PAID.",
  "text": "The next of kin, legatees, heirs, and devisees may show, in their defense, that there are unsatisfied debts of a prior class, or others of the same class as the debt in action; and if it shall appear that the value of the personal property delivered, or of the real estate descended or devised, to them does not exceed the debts of a prior class, judgment shall be rendered in their favor. If the value of such property exceeds the amount of debts which are entitled to preference over the debt in action, judgment shall be rendered against them only for such a sum as bears a just proportion to the other debts of the same class. If a debt of a class prior to the one in action, or of the same class, is paid by any next of kin, legatees, heirs, or devisees, they may prove such payment, and the amount thereof shall be treated, in ascertaining the amount to be recovered, as if it were unpaid.",
  "repealed": false,
  "rules": [
    {
      "rule": {
        "if": [
          {
            "<=": [
              {
                "var": "property_value"
              },
              {
                "var": "prior_class_debts"
              }
            ]
          },
          "favor",
          {
            "if": [
              {
                ">": [
                  {
                    "var": "property_value"
                  },
                  {
                    "var": "prior_class_debts"
                  }
                ]
              },
              "proportionate",
              null
            ]
          }
        ]
      },
      "examples": [
        {
          "property_value": 100000,
          "prior_class_debts": 120000,
          "same_class_debts": 30000,
          "paid_debts": 0
        },
        {
          "property_value": 150000,
          "prior_class_debts": 100000,
          "same_class_debts": 50000,
          "paid_debts": 0
        },
        {
          "property_value": 200000,
          "prior_class_debts": 150000,
          "same_class_debts": 50000,
          "paid_debts": 20000
        }
      ],
      "variables": [
        {
          "name": "property_value",
          "description": "The value of the personal property delivered or real estate descended or devised to the next of kin, legatees, heirs, or devisees."
        },
        {
          "name": "prior_class_debts",
          "description": "The total amount of debts of a prior class."
        },
        {
          "name": "same_class_debts",
          "description": "The total amount of debts of the same class as the debt in action."
        },
        {
          "name": "paid_debts",
          "description": "The amount of debts of a prior or same class that have been paid by the next of kin, legatees, heirs, or devisees."
        }
      ],
      "consequences": [
        "Judgment in favor of the next of kin, legatees, heirs, or devisees.",
        "Judgment against them for a proportionate sum."
      ]
    }
  ]
}