{
	"id": "58.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.02",
	"title": "58.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given to them.\n\"Act\" means the Minnesota Residential Mortgage Originator and Servicer Licensing Act.\n\"Advance fee\" means a commission, fee, charge, or compensation of any kind paid to a residential mortgage originator before the closing of a loan, that is intended in whole or in part as payment for the originator's services in finding or attempting to find a loan for a borrower. Advance fee does not include pass-through fees or commitment or extended lock fees or other fees as determined by the commissioner.\n\"Advertisement\" includes, but is not limited to, any illustration, circular, or statement that presents information to the public in either a paper, electronic, or other medium that is intended to attract clients, generate interest, or otherwise make known the existence of the licensee and which addresses services, fees, or products provided by or available through the licensee, including, but not limited to, interest rates, loan origination fees, types of available loans, discount points, closing costs, or sample mortgage terms.\n\"Borrower\" means a person or persons applying for a residential mortgage loan, a mortgagor, or the person or persons on whose behalf the activities in subdivisions 12, 14, 22, and 23 are conducted.\n\"Closing\" means either or both of the following: (1) the process whereby the real estate contract between a buyer and a seller is consummated; or (2) the process whereby the documents creating a security interest in real property become effective between the borrower and the lender.\n\"Commissioner\" means the commissioner of commerce.\n\"Employee\" means an individual who is treated as an employee by the residential mortgage originator or servicer for purposes of compliance with federal income tax laws.\n\"Escrow account\" means a trust account that is established and maintained to hold funds received from a borrower, such as real estate taxes and insurance premiums, incurred in connection with the servicing of the mortgage.\n\"Exempt person\" means a person exempt from residential mortgage originator licensing requirements, and a person exempt from residential mortgage service licensing requirements.\n\"Financial institution\" means a bank, bank and trust, trust company with banking powers, savings bank, savings association, or credit union, organized under the laws of this state, any other state, or the United States; an industrial loan and thrift under chapter 53; or a regulated lender under chapter 56. The term \"financial institution\" also includes a subsidiary or operating subsidiary of a financial institution or of a bank holding company as defined in the federal Bank Holding Company Act, United States Code, title 12, section 1841 et seq., if the subsidiary or operating subsidiary can demonstrate to the satisfaction of the commissioner that it is regulated and subject to active and ongoing oversight and supervision by a federal banking agency, as defined in the Federal Deposit Insurance Act, United States Code, title 12, section 1811 et seq., or the commissioner.\n\"Lender\" means a person who makes residential mortgage loans including a person who provides table funding.\n\"Making a residential mortgage loan\" means for compensation or gain, or the expectation of compensation or gain, to advance funds or make a commitment to advance funds in connection with a residential mortgage.\n\"Mortgage broker\" or \"broker\" means a person who performs the activities described in subdivisions 14 and 23.\n\"Mortgage brokering\" or \"brokering\" means helping to obtain from another person, for a borrower, a residential mortgage loan or assisting a borrower in obtaining a residential mortgage loan in return for consideration to be paid by the borrower or lender or both. Mortgage brokering or brokering includes, but is not limited to, soliciting, placing, or negotiating a residential mortgage loan.\n[Repealed, 2000 c 427 s 21]\n\"Nationwide Multistate Licensing System and Registry\" has the meaning given in section 58A.02, subdivision 8.\n\"Person\" means a natural person, firm, partnership, limited liability partnership, corporation, association, limited liability company, or other form of business organization and the officers, directors, employees, or agents of that person.\n\"Person in control\" means any member of senior management, including owners or officers, and other persons who possess, directly or indirectly, the power to direct or cause the direction of the management policies of an applicant or licensee under this chapter, regardless of whether the person has any ownership interest in the applicant or licensee. Control is presumed to exist if a person, directly or indirectly, owns, controls, or holds with power to vote ten percent or more of the voting stock of an applicant or licensee or of a person who owns, controls, or holds with power to vote ten percent or more of the voting stock of an applicant or licensee.\n\"Residential mortgage loan\" means a loan secured primarily by either: (1) a mortgage, deed of trust, or other equivalent security interest on residential real estate; or (2) certificates of stock or other evidence of ownership interest in and proprietary lease from corporations, partnerships, or other forms of business organizations formed for the purpose of cooperative ownership of residential real estate.\n\"Residential mortgage originator\" means a person who, directly or indirectly, for compensation or gain or in expectation of compensation or gain, solicits or offers to solicit, or accepts or offers to accept an application for a residential mortgage loan through any medium or mode of communication from a borrower, or makes a residential mortgage loan. \"Residential mortgage originator\" includes a lender as defined in subdivision 11 and a broker as defined in subdivision 13.\n\"Residential mortgage servicer\" or \"servicer\" means a person who engages in the activity of servicing a residential mortgage as defined in subdivision 22.\n\"Residential real estate\" means real property located in Minnesota upon which a dwelling, as defined in United States Code, title 15, section 1602(w), is constructed or is intended to be constructed, whether or not the owner occupies the real property.\n\"Servicing\" or \"servicing a residential mortgage loan\" means through any medium or mode of communication the collection or remittance of, or the right or obligation to collect or remit for a lender, mortgagee, note owner, noteholder, or for a person's own account, payments, interest, principal, and escrow items such as insurance and taxes for property subject to a residential mortgage loan.\n\"Soliciting, placing, or negotiating a residential mortgage loan\" means for compensation or gain or expectation of compensation or gain, whether directly or indirectly, accepting or offering to accept an application for a residential mortgage loan, assisting, or offering to assist a borrower in applying for a residential mortgage loan, or negotiating or offering to negotiate the terms or conditions of a residential mortgage loan with a lender on behalf of a borrower.\n[Repealed, 2004 c 203 art 1 s 11]\n\"Trust account\" means a negotiable order of withdrawal account, demand deposit, or checking account maintained for the purpose of segregating trust funds from other funds. A \"trust account\" must not allow the financial institution a right of setoff against the money owed it by the account holder.\n\"Trust funds\" means funds received by a residential mortgage originator or servicer in a fiduciary capacity for later distribution, such as appraisal or credit report fees, taxes, or insurance premiums. Trust funds includes commitment, lock, extended lock, and advance fees.\nMS 2018 [Repealed, 2019 c 19 s 3]\n\"Negative amortization\" occurs when the borrower's compliance with any repayment option offered pursuant to the terms of the residential mortgage loan is insufficient to satisfy the interest accruing on the loan, resulting in an increase in the loan balance. Negative amortization does not occur when a residential mortgage loan is originated, subsidized, or guaranteed by or through a state, tribal, or local government, or nonprofit organization, and bears one or more of the following nonstandard payment terms that substantially benefit the borrower: payments vary with income; payments of principal and interest are deferred until the maturity date of the loan or the sale of the residence; principal or interest is forgivable under specified conditions; or where no interest or an annual interest rate of two percent or less is charged in connection with the loan.\n\"Fully indexed rate\" equals the index rate prevailing at the time a residential mortgage loan is originated, plus the margin that will apply after the expiration of an introductory interest rate.\nA \"transaction agent\" is the person identified in a mortgage recorded with the county recorder or registrar of titles as the nominee or agent for a third party also identified in the mortgage.",
	"repealed": false
}