{
	"id": "46.048",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.048",
	"title": "46.048 NOTICE OF PROPOSED ACQUISITION.",
	"text": "Whenever a change in the outstanding voting stock of a banking institution will result in control or in a change in the control of the banking institution, the person acquiring control of the banking institution, including an out-of-state bank holding company, shall file notice of the proposed acquisition of control with the commissioner of commerce at least 60 days before the actual effective date of the change, except that the commissioner may extend the 60-day period an additional 30 days if in the commissioner's judgment any material information submitted is substantially inaccurate or the acquiring party has not furnished all the information required. The notice must be accompanied by a filing fee of $3,000 payable to the commissioner of commerce, unless the person filing the notice has been associated with the banking institution as an officer or director for at least three years, in which case the filing fee is $1,000. No filing fee is required of a person required to file a notice because of a stock redemption or other transaction by others that caused the change in control. As used in this section, the term \"control\" means the power to directly or indirectly direct or cause the direction of the management or policies of the banking institution. A change in ownership of capital stock that would result in direct or indirect ownership by a stockholder or an affiliated group of stockholders of less than 25 percent of the outstanding capital stock is not considered a change of control. If there is any doubt as to whether a change in the outstanding voting stock is sufficient to result in control or to effect a change in the control, the doubt shall be resolved in favor of reporting the facts to the commissioner. The commissioner shall use the criteria established by the Financial Institution Regulatory and Interest Rate Control Act of 1978, United States Code, title 12, section 1817(j), and the regulations adopted under it, when reviewing the acquisition and determining if the acquisition should or should not be disapproved. Within three days after making the decision to disapprove a proposed acquisition, the commissioner shall notify the acquiring party in writing of the disapproval. The notice must provide a statement of the basis for the disapproval.\n[Repealed, 1993 c 257 s 49]\nThe notice required by subdivision 1 must contain the following information to the extent that it is known by the person making the notice:\n(1) the identity, personal history, business background, and experience of each person by whom or on whose behalf the acquisition is to be made, including the person's material business activities and affiliations during the past five years, and a description of any material pending legal or administrative proceedings in which the person is a party and any criminal indictment or conviction of that person by a state or federal court;\n(2) a statement of the assets and liabilities of each person by whom or on whose behalf the acquisition is to be made, as of the end of the fiscal year for each of the five years immediately preceding the date of the notice, together with related statements of income, sources, and application of funds for each of the fiscal years then concluded, all prepared in accordance with generally accepted accounting principles consistently applied, and an interim statement of the assets and liabilities for each person, together with related statements of income, source, and application of funds as of a date not more than 90 days before the date of the filing of the notice;\n(3) the terms and conditions of the proposed acquisition and the manner in which the acquisition is to be made;\n(4) the identity, source, and amount of the funds or other consideration to be used in making the acquisition, and if any part of these funds or other consideration has been or is to be borrowed or otherwise obtained for the purpose of making the acquisition, a description of the transaction, the names of the parties, and any arrangements, agreements, or understandings with those persons;\n(5) any plans or proposals that a party making the acquisition may have to liquidate the bank, to sell its assets or merge it, or make any other major change in its business or corporate structure or management;\n(6) the identity of any person employed, retained, or to be compensated by the acquiring party, or by any person on the acquiring party's behalf, to make solicitations or recommendations to stockholders for the purpose of assisting in the acquisition, and a brief description of the terms of the employment, retainer, or arrangement for compensation;\n(7) copies of all invitations, tenders, or advertisements making tender offers to stockholders for purchase of their stock to be used in connection with the proposed acquisition; and\n(8) any additional relevant information in the form the commissioner requires by rule or by specific request in connection with any particular notice.\nUpon the filing of a notice:\n(1) an acquiring party shall publish once in a newspaper of general circulation notice of the proposed acquisition in a form acceptable to the commissioner; and\n(2) the commissioner shall accept public comment on a notice for a period of not less than 21 days from the date of the publication required by clause (1).\nIn addition to any other information the commissioner may be able to obtain pursuant to section 13.82, the Minnesota Bureau of Criminal Apprehension shall, upon the commissioner's request, provide fingerprint and background checks on all persons named in the notice required by subdivision 2 and is authorized to exchange fingerprints with the Federal Bureau of Investigation for the purpose of a criminal background check of the national files.\nWithin ten days of receipt of notice of disapproval according to subdivision 1, the acquiring party may request a department hearing on the proposed acquisition. At the hearing, all issues must be determined on the record according to chapter 14 and the rules adopted by the commissioner. At the conclusion of the hearing, the commissioner shall by order approve or disapprove the proposed acquisition on the basis of the record made at the hearing.",
	"repealed": false
}