{
	"id": "515B.4-111",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-111",
	"title": "515B.4-111 CONVERSION PROPERTY.",
	"text": "(a) A unit owner of a unit in a common interest community containing conversion property shall not, for a period of one year following the recording of the declaration creating the common interest community, require any occupant who was residing in the unit at the time the declaration was recorded to vacate the unit unless the unit owner gives notice to the occupant in the manner described in this section. The notice shall be given no later than 120 days before the occupant is required to vacate the unit. The notice shall be sufficient as to all occupants of a unit if it is hand delivered or mailed to the unit to be vacated, addressed to the occupants thereof. If the holder of the lessee's interest in the unit has given the unit owner an address different than that of the unit, then the notice shall also be given to the holder of the lessee's interest at the designated address. The notice shall comply with the following requirements:\n(1) The notice shall set forth generally the rights conferred by this section.\n(2) The notice shall have attached a form of purchase agreement setting forth the proposed terms of sale of the unit to the holder of the lessee's interest as contemplated by subsection (d) and a statement of any significant restrictions imposed by the declaration on the use and occupancy of the unit.\n(3) The notice shall state that the occupants of the unit may demand to be given 60 additional days before being required to vacate, if any of them, or any person residing with them, is (i) 62 years of age or older, (ii) a person with a disability as defined in section 268A.01, or (iii) a minor child on the date the notice is given. This demand must be in writing, contain reasonable proof of qualification, and be given to the declarant within 30 days after the notice of conversion is delivered or mailed.\n(4) The notice shall be contained in an envelope upon which the following shall be boldly printed: \"Notice of Conversion.\"\n(b) Notwithstanding subsection (a), an occupant may be required to vacate a unit upon less than 120 days' notice by reason of nonpayment of rent, utilities or other monetary obligations, violations of law, waste, or conduct that disturbs other occupants' peaceful enjoyment of the premises. The terms of the tenancy may not be altered during the notice period, except that the holder of the lessee's interest or other party in possession may vacate and terminate the tenancy upon one month's written notice to the declarant. Nothing in this section prevents the unit owner and any occupant from agreeing to a right of occupancy on a month-to-month basis beyond the 120-day notice period, or to an earlier termination of the right of occupancy.\n(c) No repair work or remodeling may be commenced or undertaken in the occupied units or common areas of the building during the notice period, unless reasonable precautions are taken to ensure the safety and security of the occupants.\n(d) For 60 days after delivery or mailing of the notice described in subsection (a), the holder of the lessee's interest in the unit on the date the notice is mailed or delivered shall have an option to purchase that unit on the terms set forth in the purchase agreement attached to the notice. The purchase agreement shall contain no terms or provisions which violate any state or federal law relating to discrimination in housing. If the holder of the lessee's interest fails to sign a binding purchase agreement for the unit during that 60-day period, the unit owner may not offer to dispose of an interest in that unit during the following 180 days at a price or on terms more favorable to the offeree than the price or terms offered to the holder. This subsection and subsection (a)(2) do not apply to any unit in a conversion property if that unit will be restricted exclusively to nonresidential use or if the boundaries of the converted unit do not substantially conform to the boundaries of the residential unit before conversion.\n(e) If a unit owner, in violation of subsection (b), conveys a unit to a purchaser for value who has no knowledge of the violation, the recording of the deed conveying the unit or, in a cooperative, the conveyance of the right to possession of the unit, extinguishes any right a holder of a lessee's interest who is not in possession of the unit may have under subsection (d) to purchase that unit, but the conveyance does not affect the right of the holder to recover damages from the unit owner for a violation of subsection (d).\n(f) If a notice described in subsection (a) specifies a date by which a unit or proposed unit must be vacated or otherwise complies with the provisions of chapter 504B, the notice also constitutes a notice to vacate specified by that statute.\n(g) An occupant residing in space in a conversion property shall not have any of the rights set out in this section or under any municipal ordinance if the holder of the lessee's interest in the space received written notice of intent to convert to a common interest community (i) before signing a lease or a lease renewal or before occupying the space and (ii) less than two years before the common interest community is created.\n(h) A notice of intent to convert to a common interest community shall identify the conversion property by both legal description and street address and state that (i) the declarant intends to convert the property to a planned community, condominium, or cooperative form of common interest community, specifying the intended form, and (ii) persons entering into leases subsequent to the receipt of the notice of intent to convert will not have the rights available to an occupant or a person holding the lessee's interest under this section.\n(i) Nothing in this section permits a unit owner to terminate a lease in violation of its terms.\n(j) Failure to give notice as required by subsection (a) is a defense to an action for possession.",
	"repealed": false
}