{
	"id": "504B.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.001",
	"title": "504B.001 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Controlled substance\" means a drug, substance, or immediate precursor in Schedules I through V of section 152.02. The term does not include distilled spirits, wine, malt beverages, intoxicating liquors, or tobacco.\n\"Distress for rent\" means the act of a landlord seizing personal property of the tenant or other person to enforce payment of rent.\n\"Evict\" or \"eviction\" means a summary court proceeding to remove a tenant or occupant from or otherwise recover possession of real property by the process of law set out in this chapter.\n\"Housing-related neighborhood organization\" means a nonprofit corporation incorporated under chapter 317A that:\n(1) designates in its articles of incorporation or bylaws a specific geographic community to which its activities are limited; and\n(2) is formed for the purposes of promoting community safety, crime prevention, and housing quality in a nondiscriminatory manner.\nFor purposes of this chapter, an action taken by a neighborhood organization with the written permission of a residential tenant means, with respect to a building with multiple dwelling units, an action taken by the neighborhood organization with the written permission of the residential tenants of a majority of the occupied units.\n\"Inspector\" means the person charged by the governing body of the political subdivision in which a residential building is situated, with the responsibility of enforcing provisions of local law, the breach of which could constitute a violation as defined in subdivision 14, clause (1). If there is no such person, \"inspector\" means the county agent of a community health board as authorized under section 145A.04 or the chair of the board of county commissioners, and in the case of a manufactured home park, the state Department of Health or its designee.\n\"Landlord\" means an owner of real property, a contract for deed vendee, receiver, executor, trustee, lessee, agent, or other person directly or indirectly in control of rental property.\n\"Lease\" means an oral or written agreement creating a tenancy in real property.\n\"License\" means a personal privilege to do a particular act or series of acts on real property without possessing any estate or interest in real property. It may be created in writing or orally.\n\"Person\" means a natural person, corporation, limited liability company, partnership, joint enterprise, or unincorporated association.\n\"Residential building\" means:\n(1) a building used in whole or in part as a dwelling, including single-family homes, multiple-family units such as apartments, and structures containing both dwelling units and units used for nondwelling purposes, and includes a manufactured home park; or\n(2) an unoccupied building which was previously used in whole or in part as a dwelling and which constitutes a nuisance under section 561.01.\n\"Residential tenant\" means a person who is occupying a dwelling in a residential building under a lease or contract, whether oral or written, that requires the payment of money or exchange of services, all other regular occupants of that dwelling unit, or a resident of a manufactured home park.\n\"Tenancy at will\" means a tenancy in which the tenant holds possession by permission of the landlord but without a fixed ending date.\n\"Tenant association\" means a group of tenants from two or more rental units that are owned or operated by the same landlord who form or maintain an organization, whether incorporated or unincorporated, to improve housing conditions, amenities, community life, or the contractual position of the member tenants.\n\"Tenant organizer\" means a tenant or another who assists residential tenants in establishing and operating a tenant association and is not an employee or representative of the current or prospective landlord, property owner, manager, or agent of the landlord.\n\"Violation\" means:\n(1) a violation of any state, county or city health, safety, housing, building, fire prevention, or housing maintenance code applicable to the building;\n(2) a violation of this chapter;\n(3) a violation of any federal, state, county, or city laws protecting tenants from discrimination;\n(4) a violation of any applicable tenant rights and landlord obligations for public and subsidized tenancies under local, state, or federal law; or\n(5) a violation of an oral or written agreement, lease, or contract for the rental of a dwelling in a building.\n\"Writ of recovery of premises and order to vacate\" means the writ set out in section 504B.361.\n(a) \"Abandonment of tenancy\" means the intentional and voluntary absolute relinquishment of premises by the residential tenant.\n(b) \"Abandonment of personal property\" means a residential tenant leaving some of the tenant's personal property on the premises after permanently vacating the property.",
	"repealed": false
}