{
	"id": "10A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.12",
	"title": "10A.12 POLITICAL FUNDS.",
	"text": "An association other than a political committee or party unit may not contribute more than $750 in aggregate in any calendar year to candidates, local candidates, political committees, or party units or make approved expenditures of more than $750 in aggregate in any calendar year unless the contribution or expenditure is made through a political fund.\nAn association other than a political committee that makes only independent expenditures or expenditures to promote or defeat a ballot question must do so through an independent expenditure or ballot question political fund if the independent expenditures aggregate more than $1,500 in a calendar year or if the expenditures to promote or defeat a ballot question aggregate more than $5,000 in a calendar year, or by contributing to an existing independent expenditure or ballot question political committee or fund.\nAn association that makes an independent expenditure without complying with subdivision 1a is subject to a civil penalty of up to four times the amount of the independent expenditure, but not to exceed $25,000, except when the violation was intentional.\nThe contents of an association's political fund may not be commingled with other funds or with the personal funds of an officer or member of the association or the fund. It is not commingling for an association that uses only its own general treasury money to make expenditures and disbursements permitted under section 10A.121, subdivision 1, directly from the depository used for its general treasury money. An association that accepts more than $1,500 in aggregate in contributions to influence the nomination or election of candidates or local candidates or more than $5,000 in contributions to promote or defeat a ballot question must establish a separate depository for those contributions.\nAn association that has a political fund must elect or appoint a treasurer of the political fund.\nA political fund may not accept a contribution or make an expenditure or contribution from the political fund while the office of treasurer of the political fund is vacant.\nAn association may, if not prohibited by other law, deposit in its political fund money derived from dues or membership fees. Under section 10A.20, the treasurer of the fund must disclose the name of any member whose dues, membership fees, and contributions deposited in the political fund together exceed $200 in a year.\nA person who knowingly violates this section is subject to a civil penalty imposed by the board of up to $1,000.",
	"repealed": false
}