{
	"id": "103G.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.301",
	"title": "103G.301 GENERAL PERMIT; APPLICATION PROCEDURES.",
	"text": "(a) An application for a permit must be accompanied by:\n(1) maps, plans, and specifications describing the proposed appropriation and use of waters;\n(2) the changes, additions, repairs, or abandonment proposed to be made;\n(3) the waters of the state affected; and\n(4) other data the commissioner may require.\n(b) The commissioner may require a statement of the effect the actions proposed in the permit application will have on the environment, including:\n(1) anticipated changes in water and related land resources;\n(2) unavoidable but anticipated detrimental effects; and\n(3) alternatives to the actions proposed in the permit application, including conservation measures to improve water use efficiencies and reduce water demand.\n(a) A fee to defray the costs of receiving, recording, and processing must be paid for a permit application authorized under this chapter, except for a general permit application, for each request to amend or transfer an existing permit, and for a notification to request authorization to conduct a project under a general permit. Fees established under this subdivision, unless specified in paragraph (c), must comply with section 16A.1285.\n(b) Proposed projects that require water in excess of 100 million gallons per year must be assessed fees to recover the costs incurred to evaluate the project and the costs incurred for environmental review. Fees collected under this paragraph must be credited to an account in the natural resources fund and are appropriated to the commissioner.\n(c) The fee to apply for a permit to appropriate water, in addition to any fee under paragraph (b), is $150. The application fee for a permit to construct or repair a dam that is subject to a dam safety inspection, to work in public waters, or to divert waters for mining must be at least $1,200, but not more than $12,000. The fee for a notification to request authorization to conduct a project under a general permit is $400, except that the fee for a notification to request authorization to appropriate water under a general permit is $100.\n(a) In addition to the application fee, the commissioner may charge a field inspection fee for:\n(1) projects requiring a mandatory environmental assessment under chapter 116D;\n(2) projects undertaken without a required permit or application; and\n(3) projects undertaken in excess of limitations established in an issued permit.\n(b) The fee must be at least $100 but not more than actual inspection costs.\n(c) The fee is to cover actual costs related to a permit applied for under this chapter or for a project undertaken without proper authorization.\n(d) The commissioner shall establish a schedule of field inspection fees under section 16A.1285. The schedule must include actual costs related to field inspection, including investigations of the area affected by the proposed activity, analysis of the proposed activity, consultant services, and subsequent monitoring, if any, of the activity authorized by the permit. Fees collected under this subdivision must be credited to an account in the natural resources fund and are appropriated to the commissioner.\nA permit application, general permit notification, or field inspection fee may not be refunded for any reason, even if the application or request is denied or withdrawn.\nA permit application, general permit notification, or field inspection fee may not be imposed on any state agency, as defined in section 16B.01, or federal governmental agency applying for a permit.\nNotwithstanding this section or any other law, no permit application, general permit notification, or field inspection fee shall be charged to a town in connection with the construction or alteration of a town road, bridge, or culvert.\nAn application for a permit must be filed with the commissioner. If the proposed activity for which the permit is requested is within a municipality, is within or affects a watershed district or a soil and water conservation district, or is within the boundaries of a reservation or Tribal community of a federally recognized Indian Tribe in Minnesota, a copy of the application with maps, plans, and specifications must be served on the mayor of the municipality, the secretary of the board of managers of the watershed district, the secretary of the board of supervisors of the soil and water conservation district, or the Tribal chair of the federally recognized Indian Tribe, as applicable. For purposes of this section, \"federally recognized Indian Tribe\" means the Minnesota Tribal governments listed in section 10.65, subdivision 2.\n(a) If the proposed activity for which the permit is requested is within a municipality, or is within or affects a watershed district or a soil and water conservation district, the commissioner may obtain a written recommendation of the managers of the district and the board of supervisors of the soil and water conservation district or the mayor of the municipality before issuing or denying the permit.\n(b) The managers, supervisors, or mayor must file a recommendation within 30 days after receiving of a copy of the application for permit.\n(c) If the proposed activity for which the permit is requested is within the boundaries of a reservation or Tribal community of a federally recognized Indian Tribe in Minnesota, the federally recognized Indian Tribe may:\n(1) submit recommendations to the commissioner within 30 days of receiving the application; or\n(2) request Tribal consultation according to section 10.65 within 30 days of receiving the application.\n(d) If Tribal consultation is requested under paragraph (c), clause (2), a permit application is not complete until after the consultation occurs or 90 days after the request for consultation is made, whichever is sooner.\nFees collected under this section must be credited to the water management account in the natural resources fund.",
	"repealed": false
}