{
	"id": "508.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.47",
	"title": "508.47 REGISTERED LANDS; TRANSFER, SURVEYS.",
	"text": "An owner of registered land may convey, mortgage, lease, charge, or otherwise deal with the same as fully as if it had not been registered. An owner of registered land may use any form of deed, mortgage, lease, or other voluntary instrument sufficient in law for the purpose intended. No voluntary instrument of conveyance purporting to convey or affect registered land, except a will, and a lease for a term not exceeding three years, shall take effect as a conveyance, or bind or affect the land, but shall operate only as a contract between the parties, and as authority to the registrar to make registration. The act of registration shall be the operative act to convey or affect the land.\nThe registrar of titles may require that the owner of a parcel of unplatted registered land, who conveys any part thereof which is not a full government subdivision, or simple fractional or quantity part of a full government subdivision, shall first file with the registrar of titles a drawing in triplicate of said parcel of unplatted land, showing the tract or tracts being or to be conveyed, which drawing shall be known as a \"registered land survey.\"\n(a) A full government subdivision is defined as a government lot, a quarter-quarter section, a quarter-quarter-quarter section ad infinitum;\n(b) A simple fractional part of a full government subdivision is defined as: one-half; two-thirds; one-fourth, and similar fractions;\n(c) A simple quantity part of a full government subdivision is defined as: 20 acres; 200 feet, ten chains, and similar quantities.\nThe registered land survey shall correctly show the legal description of the parcel of unplatted land represented by said registered land survey and the outside measurements of the parcel of unplatted land and of all tracts delineated therein, the direction of all lines of said tracts to be shown by angles or bearings or other relationship to the outside lines of said registered land survey, and the surveyor shall place monuments in the ground at appropriate corners, and all tracts shall be lettered consecutively beginning with the letter \"A.\" A registered land survey which delineates multilevel tracts shall include a map showing the elevation view of the tracts with their upper and lower boundaries defined by elevations referenced to a mean sea level adjusted datum benchmark. None of said tracts or parts thereof may be dedicated to the public by said registered land survey.\nA licensed land surveyor shall certify that the registered land survey is a correct representation of said parcel of unplatted land. The certification shall be properly acknowledged by the land surveyor on the registered land survey before a notarial officer. All signatures on the registered land survey shall be written with black ink and shall not be written with ball point ink. The registered land survey shall be prepared on transparent reproducible film or the equivalent with a minimum thickness of four mil, and shall be prepared by a photographic process. Sheet size shall be 22 inches by 34 inches. A border line shall be placed one-half inch inside the outer edge of the sheet on the top and bottom 34-inch sides; and the right 22-inch side; and two inches inside the outer edge of the sheet on the left 22-inch side. Text used on the registered land survey shall not be smaller than eight-point type. If the registered land survey consists of more than one sheet, the sheets shall be numbered consecutively. The registered land survey shall be labeled \"OFFICIAL,\" and any copy shall be labeled \"copy\" in the center of the top margin.\nBefore filing, however, any survey shall be approved in the manner required for the approval of subdivision plats, which approval shall be endorsed on it or attached to it.\nAt the time of filing, a registered land survey shall contain a certification by the proper county official that there are no delinquent taxes owed and that the current year's payable taxes have been paid in accordance with section 272.12.\nNotwithstanding any provisions of subdivision 5 to the contrary, no other copies of the survey need be filed.\nThe registrar shall duly certify and furnish to any person a copy of said registered land survey, which shall be admissible in evidence.\nThe registered land survey shall be filed in the office of the registrar of titles, who shall number each registered land survey, the numbers to run consecutively beginning with the number \"1.\" One copy of each registered land survey shall be retained by the registrar of titles as a master copy, one copy filed in a registered land survey register in the registrar's office and made available to the public, and one copy delivered to the county auditor who may thereafter refer to it in connection with the tax descriptions when convenient. Thereafter the tracts in each registered land survey shall be known as Tract ....., registered land survey No. ...., and all conveyances shall describe said property accordingly; but the registrar shall not accept for filing and registration any conveyance of unplatted registered land if the land is described in the conveyance according to a registered land survey which has not been approved as provided in subdivision 4 unless the approval of the body authorized to approve subdivision plats is endorsed thereon or attached thereto.\nNothing in this section shall operate to change the tax classification of the lands in the registered land survey or otherwise in any way affect the land. The purpose of this section is to simplify the description and designation of the registered land in connection with its transfer. Land conveyed by reference to a registered land survey shall be deemed to be conveyed by metes and bounds.\nThe provisions of this section shall also be applied to the transfer of parts of lots, outlots and unlotted blocks, when the language necessary to describe the parts is other than by simple fractional or quantity parts thereof.",
	"repealed": false
}