{
	"id": "245G.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.011",
	"title": "245G.011 BEHAVIORAL HEALTH CRISIS FACILITIES GRANTS.",
	"text": "\"Commissioner\" means the commissioner of human services.\n\"Eligible applicant\" or \"applicant\" means a statutory or home rule charter city, county, housing and redevelopment authority, publicly owned hospital, or other public entity otherwise eligible to receive state general obligation bond proceeds that is designated to apply for a behavioral health crisis program facilities grant by the local mental health authority, established under section 245.466 or on behalf of a regional consortium of organizations that serve individuals with mental illness or a substance use disorder.\n\"Eligible project\" or \"project\" means the acquisition or betterment of public land, buildings, and other public improvements of a capital nature within the meaning of the Minnesota Constitution, article XI, section 5, clause (a). It includes acquisition of land or interest in land, predesign, design, renovation, construction, furnishing, and equipping facilities in which to provide behavioral health crisis programs and services.\nFor purposes of this section, \"behavioral health crisis facilities\" or \"facility\" means a facility whose purpose is to provide mental health or substance use disorder services. Proceeds may be up to 100 percent of project costs, up to $5,000,000 per project. Priority must be given to proposals that:\n(1) demonstrate a need for the program in the region;\n(2) provide a detailed service plan, including the services that will be provided and to whom, and staffing requirements;\n(3) provide an estimated cost of operating the program;\n(4) verify financial sustainability by detailing sufficient funding sources and the capacity to obtain third-party payments for services provided, including private insurance and federal Medicaid and Medicare financial participation;\n(5) demonstrate an ability and willingness to build on existing resources in the community; and\n(6) agree to a comprehensive evaluation of services and financial viability by the commissioner.\n[Repealed, 2024 c 108 art 6 s 6]",
	"repealed": false
}