{
	"id": "79A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.04",
	"title": "79A.04 PRIVATE SELF-INSURING EMPLOYER; ANNUAL RENEWAL OR DEPOSIT OF NEW SECURITY FOR PAYMENT OF COMPENSATION.",
	"text": "Each year every private self-insuring employer shall secure incurred liabilities for the payment of compensation and the performance of its obligations and the obligations of all self-insuring employers imposed under chapter 176 by renewing the prior year's security deposit or by making a new deposit of security. If a new deposit is made, it must be posted in the following manner: within 60 days of the filing of the annual report, the security posting for all prior years plus one-third of the posting for the current year; by July 31, one-third of the posting for the current year; by October 31, the final one-third of the posting for the current year.\nThe minimum deposit is 110 percent of the private self-insurer's estimated future liability. The deposit may be used to secure payment of all administrative and legal costs, and unpaid assessments required by section 79A.12, subdivision 2, relating to or arising from its or other employers' self-insuring. As used in this section, \"private self-insurer\" includes both current and former members of the self-insurers' security fund; and \"private self-insurers' estimated future liability\" means the private self-insurers' total of estimated future liability as determined by an Associate or Fellow of the Casualty Actuarial Society every year for group member private self-insurers and, for a nongroup member private self-insurer's authority to self-insure, every year for the first five years. After the first five years, the nongroup member's total shall be as determined by an Associate or Fellow of the Casualty Actuarial Society at least every two years, and each such actuarial study shall include a projection of future losses during the period until the next scheduled actuarial study, less payments anticipated to be made during that time.\nAll data and information furnished by a private self-insurer to an Associate or Fellow of the Casualty Actuarial Society for purposes of determining private self-insurers' estimated future liability must be certified by an officer of the private self-insurer to be true and correct with respect to payroll and paid losses, and must be certified, upon information and belief, to be true and correct with respect to reserves. The certification must be made by sworn affidavit. In addition to any other remedies provided by law, the certification of false data or information pursuant to this subdivision may result in a fine imposed by the commissioner of commerce on the private self-insurer up to the amount of $5,000, and termination of the private self-insurers' authority to self-insure. The determination of private self-insurers' estimated future liability by an Associate or Fellow of the Casualty Actuarial Society shall be conducted in accordance with standards and principles for establishing loss and loss adjustment expense reserves by the Actuarial Standards Board, an affiliate of the American Academy of Actuaries. The commissioner may reject an actuarial report that does not meet the standards and principles of the Actuarial Standards Board, and may further disqualify the actuary who prepared the report from submitting any future actuarial reports pursuant to this chapter. Within 30 days after the actuary has been served by the commissioner with a notice of disqualification, an actuary who is aggrieved by the disqualification may request a hearing to be conducted in accordance with chapter 14. Based on a review of the actuarial report, the commissioner of commerce may require an increase in the minimum security deposit in an amount the commissioner considers sufficient.\nIn addition, the Minnesota self-insurers' security fund may, at its sole discretion and cost, undertake an independent actuarial review or an actuarial study of a private self-insurer's estimated future liability as defined in this subdivision. The review or study must be conducted by an associate or fellow of the Casualty Actuarial Society. The actuary has the right to receive and review data and information of the self-insurer necessary for the actuary to complete its review or study. A copy of this report must be filed with the commissioner and a copy must be furnished to the self-insurer.\nEstimated future liability is determined by first taking the total amount of the self-insured's future liability of workers' compensation claims and then deducting the total amount which is estimated to be returned to the self-insurer from any specific excess insurance coverage, aggregate excess insurance coverage, and any supplementary benefits or second injury benefits which are estimated to be reimbursed by the special compensation fund. However, in the determination of estimated future liability, the actuary for the self-insurer shall not take a credit for any excess insurance or reinsurance which is provided by a captive insurance company which is wholly owned by the self-insurer. The opinion may discount liabilities to present value at a rate up to the lesser of four percent per annum, or the average of the applicable federal midterm rates, based on annual compounding, as published by the United States Secretary of the Treasury under United States Code, title 26, section 1274(d), for the 12 months preceding the valuation date of the report. Supplementary benefits or second injury benefits will not be reimbursed by the special compensation fund unless the special compensation fund assessment pursuant to section 176.129 is paid and the reports required thereunder are filed with the special compensation fund. In the case of surety bonds, bonds shall secure administrative and legal costs in addition to the liability for payment of compensation reflected on the face of the bond. In no event shall the security be less than the last retention limit selected by the self-insurer with the Workers' Compensation Reinsurance Association, provided that the commissioner may allow former members to post less than the Workers' Compensation Reinsurance Association retention level if that amount is adequate to secure payment of the self-insurers' estimated future liability, as defined in this subdivision, including payment of claims, administrative and legal costs, and unpaid assessments required by section 79A.12, subdivision 2. The posting or depositing of security pursuant to this section shall release all previously posted or deposited security from any obligations under the posting or depositing and any surety bond so released shall be returned to the surety. Any other security shall be returned to the depositor or the person posting the bond.\nAs a condition for the granting or renewing of a certificate to self-insure, the commissioner may require a private self-insurer to furnish any additional security the commissioner considers sufficient to insure payment of all claims under chapter 176.\nNotwithstanding the requirements of subdivisions 1 and 2, the commissioner may, until the next annual securing of liability, adjust this required security deposit for the portion attributable to the current year only, if, in the commissioner's judgment, the self-insurer will be able to meet its obligations under this chapter until the next annual securing of liability.\nThe commissioner may only accept as security, and the employer shall deposit as security, cash, approved government securities, surety bonds, or irrevocable letters of credit in any combination. Interest or dividend income or other income generated by the security shall be paid to the member or, at the member's direction, applied to the member's security requirement. The current deposit shall include within its coverage all amounts covered by terminated surety bonds. As used in this chapter, an irrevocable letter of credit shall be accepted only if it is clean, irrevocable, and contains an evergreen clause.\n(a) \"Clean\" means a letter of credit that is not conditioned on the delivery of any other documents or materials.\n(b) \"Irrevocable\" means a letter of credit that cannot be modified or revoked without the consent of the beneficiary, once the beneficiary is established.\n(c) \"Evergreen clause\" means one which specifically states that expiration of a letter of credit will not take place without a 60-day notice by the insurer and one which allows the issuer to conduct an annual review of the account party's financial condition. If prior notice of expiration is not given by the issuer, the letter of credit is automatically extended for one year.\nA clean irrevocable letter of credit shall be accepted only if it is in the form prescribed by statute and is issued by a financial institution that is authorized to engage in banking in any of the 50 states or under the laws of the United States and whose business is substantially confined to banking and supervised by the state commissioner of commerce or banking or similar official, and which has a long-term debt rating by a recognized national rating agency of investment grade or better. If no long-term debt rating is available, the financial institution must have the equivalent investment grade financial characteristics.\nThe following are acceptable securities and surety bonds for the purpose of funding self-insurance plans and group self-insurance plans:\n(1) direct obligations of the United States government except mortgage-backed securities of the Government National Mortgage Association;\n(2) bonds, notes, debentures, and other instruments which are obligations of agencies and instrumentalities of the United States including, but not limited to, the Federal National Mortgage Association, the Federal Home Loan Mortgage Corporation, the Federal Home Loan Bank, the Student Loan Marketing Association, and the Farm Credit System, and their successors, but not including collateralized mortgage obligations or mortgage pass-through instruments;\n(3) bonds or securities that are issued by the state of Minnesota and that are secured by the full faith and credit of the state;\n(4) certificates of deposit which are insured by the Federal Deposit Insurance Corporation and are issued by a Minnesota depository institution;\n(5) obligations of, or instruments unconditionally guaranteed by, Minnesota depository institutions whose long-term debt rating is at least AA-, Aa3, or their equivalent, by at least two nationally recognized rating agencies;\n(6) surety bonds issued by a corporate surety authorized by the commissioner of commerce to transact such business in the state;\n(7) obligations of or instruments unconditionally guaranteed by Minnesota insurance companies, whose long-term debt rating is at least AA-, Aa3, or their equivalent, by at least two nationally recognized rating agencies and whose rating is A+ by A. M. Best, Inc.; and\n(8) any guarantee from the United States government whereby the payment of the workers' compensation liability of a self-insurer is guaranteed; and bonds which are the general obligation of the Minnesota Housing Finance Agency.\nSurety bonds, irrevocable letters of credit, and documents showing issuance of any irrevocable letter of credit shall be deposited with, and, except where specified by statute, in a form approved by the commissioner.\nSecurities shall be deposited on behalf of the commissioner by the self-insured employer with the commissioner of management and budget or a financial institution approved by the commissioner. Securities shall be accepted by the commissioner of management and budget for deposit and shall be withdrawn only upon written order of the commissioner.\nCash shall be deposited in a financial institution approved by the commissioner and in the account assigned to the commissioner of management and budget. Cash shall be withdrawn only upon written order of the commissioner.\nUpon the commissioner sending a request to renew, request to post, or request to increase a security deposit, a perfected security interest is created in the private self-insured's assets in favor of the commissioner to the extent of any then unsecured portion of the self-insured's incurred liabilities. That perfected security interest is transferred to any cash or securities thereafter posted by the private self-insured with the commissioner of management and budget and is released only upon either of the following:\n(1) the acceptance by the commissioner of a surety bond or irrevocable letter of credit for the full amount of the incurred liabilities for the payment of compensation; or\n(2) the return of cash or securities by the commissioner.\nThe private self-insured employer loses all right, title, and interest in and any right to control all assets or obligations posted or left on deposit as security. In the event that a court of competent jurisdiction has declared the private self-insurer to be insolvent, or in the event of the issuance of a certificate of default by the commissioner, the commissioner shall liquidate the deposit as provided in this chapter, and transfer it to the self-insurer's security fund for application to the self-insured employer's incurred liability and other current or future obligations of the self-insurers' security fund. In the event that a court of competent jurisdiction has declared the private self-insurer to be insolvent, or in the event of the issuance of a certificate of default by the commissioner, all right, title, and interest in and any right to control all assets or obligations which have been posted or deposited as security must be transferred to the self-insurers' security fund.\n[Repealed, 1999 c 177 s 88]\nThe commissioner of labor and industry shall notify the commissioner and the security fund if the commissioner of labor and industry has knowledge that any private self-insurer has failed to pay workers' compensation benefits as required by chapter 176. The security deposit shall be used to administer and pay the private self-insurers' workers' compensation or assessment obligations or any other current or future obligations of the self-insurers' security fund if any of the following occurs:\n(1) the private self-insurer has failed to pay workers' compensation as required by chapter 176 and the commissioner determines that a court of competent jurisdiction has declared the private self-insurer to be insolvent;\n(2) the commissioner issues a certificate of default against a private self-insurer for failure to pay workers' compensation as required by chapter 176; or\n(3) the commissioner issues a certificate of default against a private self-insurer for failure to pay an assessment to the self-insurer's security fund when due.\n(a) A private self-insurer must notify the commissioner prior to, or immediately upon, the filing of a voluntary or involuntary petition under the United States Bankruptcy Code, title 11, and when a court of competent jurisdiction has declared the private self-insurer to be bankrupt.\n(b) If a private self-insurer is (1) the subject of a voluntary or involuntary petition under the United States Bankruptcy Code, title 11, or (2) a court of competent jurisdiction has declared the private self-insurer to be bankrupt and the private self-insurer has failed to pay workers' compensation as required by chapter 176, the commissioner must call the security and proceed in accordance with this section.\n(c) If, upon notice that a private self-insurer is the subject of a voluntary or involuntary petition under the United States Bankruptcy Code, title 11, or a court of competent jurisdiction has declared the private self-insurer to be bankrupt but the private self-insurer has not failed to timely pay workers' compensation benefits as required by chapter 176, the commissioner may call the security and proceed in accordance with this section if the commissioner determines that the private self-insurer's payment of workers' compensation benefits would be delayed in any way as a result of the bankruptcy petition or declaration or that the private self-insurer would otherwise be unable to fulfill its obligations under chapter 79A or 176.\n(d) In making the determination provided for in paragraph (c) to call a private self-insurer's security and proceed in accordance with this section, the commissioner must consult with the commissioner of labor and industry to determine if the commissioner of labor and industry has knowledge that the private self-insurer has failed to pay workers' compensation benefits as required by chapter 176. The commissioner shall also consider the following:\n(1) the self-insurer's most recent actuarial statement, including but not limited to estimated future liability and posted security;\n(2) the self-insurer's claims history and claims projections;\n(3) the circumstances surrounding the self-insurer's petition to file bankruptcy; and\n(4) any other circumstances the commissioner deems relevant.\n(e) In making the determination under paragraph (c), the commissioner must also meet and confer with the private self-insurer and the security fund. The initial meet and confer must occur within 30 days of the filing of the petition for chapter 11 bankruptcy. Failure to participate in the meet and confer process by the self-insurer may result in a default determination to immediately transfer the posted security and claims obligations to the security fund. During the meet and confer, the commissioner may ask the self-insurer to provide additional information. Additionally, the security fund may inspect the private self-insurer's most recent actuarial study on file with the commissioner as well as its current security deposit amount required by the commissioner. Data disclosed during the meet and confer must remain confidential. Nothing in this section shall limit the fund's authority to seek information directly from its members.\nIn the event of insolvency or certificate of default, the commissioner shall immediately notify by certified mail the commissioner of management and budget, the surety, the issuer of an irrevocable letter of credit, and any custodian of the security required in this chapter. At the time of notification, the commissioner shall also call the security and transfer and assign it to the self-insurers' security fund. The commissioner shall also immediately notify by certified mail the self-insurers' security fund, and order the security fund to assume the insolvent self-insurers' obligations for which it is liable under chapter 176. The security fund shall commence payment of these obligations within 14 days of receipt of this notification and order. Payments shall be made to claimants whose entitlement to benefits can be ascertained by the security fund, with or without proceedings before the Department of Labor and Industry, the Office of Administrative Hearings, the Workers' Compensation Court of Appeals, or the Minnesota Supreme Court. Upon the assumption of obligations by the security fund pursuant to the commissioner's notification and order, the security fund has the right to immediate possession of any posted or deposited security and the custodian, surety, or issuer of any irrevocable letter of credit or the commissioner, if in possession of it, shall turn over the security, proceeds of the surety bond, or letter of credit to the security fund together with the interest that has accrued since the date of the self-insured employer's insolvency. The security fund has the right to the immediate possession of all relevant workers' compensation claim files and data of the self-insurer, and the possessor of the files and data must turn the files and data, or complete copies of them, over to the security fund within five days of the notification provided under this subdivision. If the possessor of the files and data fails to timely turn over the files and data to the security fund, it is liable to the security fund for a penalty of $500 per day for each day after the five-day period has expired. The security fund is entitled to recover its reasonable attorney fees and costs in any action brought to obtain possession of the workers' compensation claim files and data of the self-insurer, and for any action to recover the penalties provided by this subdivision. The self-insurers' security fund may administer payment of benefits or it may retain a third-party administrator to do so.\nNotwithstanding anything in this chapter to the contrary, any cash, securities, irrevocable letter of credit, specific excess or aggregate excess insurance proceeds, or any other security deposited or posted in accordance with this section shall be used first, when due, to pay workers' compensation claims. After that security has been exhausted, the payment of workers' compensation claims from self-insurers' security fund members' assessments may be made. Where the self-insurers' security fund member assessment account is used to pay workers' compensation claims on an emergency or an interim basis, pending receipt by the self-insurers' security fund of security which is due but not yet received, then the member assessment account shall be reimbursed for payment from the security when it is received, and the priorities stated above shall thereafter apply.\nThe commissioner shall be provided with any relevant information by the employer, any excess insurer, any third-party administrator, or any issuer of any irrevocable letter of credit, issuer of any surety bond, or custodian of any security necessary for the commissioner to carry out the commissioner's obligations under this chapter. The commissioner shall provide this information to the self-insurers' security fund if necessary for the security fund to carry out its obligations under this chapter.\nThe payment of benefits by the self-insurers' security fund from security deposit proceeds shall release and discharge any custodian of the security deposit, surety, any issuer of a letter of credit, and the self-insured employer from liability to fulfill obligations to provide those same benefits as compensation, but does not release any person or entity from any liability to the security fund for full reimbursement. Any decision or determination made or any settlement approved by the commissioner or by an administrative law judge under subdivision 15 shall conclusively be presumed valid and binding as to all known claims arising out of the underlying dispute, unless an appeal is made pursuant to chapter 14. No security shall be exchanged more often than once every 90 days.\nThe commissioner shall advise the self-insurers' security fund promptly after the receipt of information indicating that a private self-insurer may be unable to meet its compensation obligations. The commissioner shall advise the self-insurers' security fund of all determinations and directives and orders made or issued pursuant to this section.\nDisputes concerning the posting, renewal, termination, exoneration, or return of all or any portion of the security deposit, or any liability arising out of the posting or failure to post security, or adequacy of the security or reasonableness of administrative costs, including legal fees, and arising between or among a surety, the issuer of an agreement of assumption and guarantee of workers' compensation liabilities, the issuer of a letter of credit, any custodian of the security deposit, a private self-insurer, or the self-insurers' security fund shall be resolved by the commissioner. An appeal from the commissioner's written decision, determination, or order may be instituted pursuant to the contested case procedures of chapter 14. Payment of claims from the security deposit or by the self-insurers' security fund shall not be stayed pending the resolution of the disputes unless and until the administrative law judge issues a determination staying a payment of claims decision or determination of the commissioner or the self-insurers' security fund.\nIf, following a private self-insurer's insolvency or certificate of default, the commissioner calls its security and proceeds in accordance with this section, the commissioner shall revoke the certificate to self-insure of the private self-insurer as soon as practicable but no later than 30 days after its security has been called. No insolvent self-insurer, as defined in section 79A.01, subdivision 4, shall be eligible to receive another grant of authority to self-insure unless either: (1) the insolvent self-insurer's posted security was sufficient to pay all direct and indirect administrative and professional expenses of the security fund related to the insolvent self-insurer, and all losses, including estimated future liability, allocated loss expense, and unallocated loss expense of the insolvent self-insurer; or (2) the insolvent self-insurer pays the security fund an amount equal to all such losses and expenses the security fund has paid or will be required to pay related to this insolvent self-insurer.",
	"repealed": false
}