{
	"id": "115B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.40",
	"title": "115B.40 PROGRAM.",
	"text": "The commissioner may take any environmental response action, including emergency action, related to a release or threatened release of a hazardous substance, pollutant or contaminant, or decomposition gas from a qualified facility that the commissioner deems reasonable and necessary to protect the public health or welfare or the environment under the standards required in sections 115B.01 to 115B.20. The commissioner may undertake studies necessary to determine reasonable and necessary environmental response actions at individual facilities. The commissioner may develop general work plans for environmental studies, presumptive remedies, and generic remedial designs for facilities with similar characteristics. Prior to selecting environmental response actions for a facility, the commissioner shall hold at least one public informational meeting near the facility and provide for receiving and responding to comments related to the selection. The commissioner shall design, implement, and provide oversight consistent with the actions selected under this subdivision.\n(a) The commissioner shall establish a priority list for preventing or responding to releases of hazardous substances, pollutants and contaminants, or decomposition gases at qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1). The commissioner shall periodically revise the list to reflect changing conditions at facilities that affect priority for response actions. The initial priority list must be established by January 1, 1995.\n(b) The priority list required under this subdivision must be based on the relative risk or danger to public health or welfare or the environment, taking into account to the extent possible the population at risk, the hazardous potential of the hazardous substances at the facility, the potential for contamination of drinking water supplies, the potential for direct human contact, and the potential for destruction of sensitive ecosystems.\nBy September 1, 1994, the commissioner shall notify the owner or operator of, and persons subject to a cleanup order at, each qualified facility defined in section 115B.39, subdivision 2, paragraph (o), clause (1), of whether the requirements of subdivision 4 or 5 have been met. If the requirements have not been met at a facility, the commissioner, by the earliest practicable date, shall notify the owner or operator and persons subject to a cleanup order of what actions need to be taken.\n(a) The owner or operator of a qualified facility that is not subject to a cleanup order shall:\n(1) complete closure activities at the facility, or enter into a binding agreement with the commissioner to do so, as provided in paragraph (e), within one year from the date the owner or operator is notified by the commissioner under subdivision 3 of the closure activities that are necessary to properly close the facility in compliance with facility's permit, closure orders, or enforcement agreement with the agency, and with the solid waste rules in effect at the time the facility stopped accepting waste;\n(2) undertake or continue postclosure and custodial care at the facility until the date of notice of compliance under subdivision 7;\n(3) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), transfer to the commissioner of revenue for deposit in the remediation fund established in section 116.155 any funds required for proof of financial responsibility under section 116.07, subdivision 4h, that remain after facility closure and any postclosure care and response action undertaken by the owner or operator at the facility including, if proof of financial responsibility is provided through a letter of credit or other financial instrument or mechanism that does not accumulate money in an account, the amount that would have accumulated had the owner or operator utilized a trust fund, less any amount used for closure, postclosure care, and response action at the facility;\n(4) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (2), transfer to the commissioner of revenue for deposit in the remediation fund established in section 116.155 an amount of cash that is equal to the sum of their approved current contingency action cost estimate and the present value of their approved estimated remaining postclosure care costs required for proof of financial responsibility under section 116.07, subdivision 4h; and\n(5) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (3), transfer to the commissioner of revenue for deposit in the remediation fund established in section 116.155 an amount of cash that is equal to the sum of their approved current contingency action cost estimate and any funds required for proof of financial responsibility under section 116.07, subdivision 4h, that remain after facility closure and any postclosure and custodial care and response action undertaken by the owner or operator at the facility.\n(b) The owner or operator of a qualified facility that is not subject to a cleanup order shall:\n(1) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), provide the commissioner with a copy of all applicable comprehensive general liability insurance policies and other liability policies relating to property damage, certificates, or other evidence of insurance coverage held during the life of the facility; and\n(2) enter into a binding agreement with the commissioner to:\n(i) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), take any actions necessary to preserve the owner or operator's rights to payment or defense under insurance policies included in clause (1); cooperate with the commissioner in asserting claims under the policies; and, within 60 days of a request by the commissioner, but no earlier than July 1, 1996, assign only those rights under the policies related to environmental response costs;\n(ii) cooperate with the commissioner or other persons acting at the direction of the commissioner in taking additional environmental response actions necessary to address releases or threatened releases and to avoid any action that interferes with environmental response actions, including allowing entry to the property and to the facility's records and allowing entry and installation of equipment; and\n(iii) refrain from developing or altering the use of property described in any permit for the facility except after consultation with the commissioner and in conformance with any conditions established by the commissioner for that property, including use restrictions, to protect public health and welfare and the environment.\n(c) The owner or operator of a qualified facility defined in section 115B.39, subdivision 2, paragraph (o), clause (1), that is a political subdivision may use a portion of any funds established for response at the facility, which are available directly or through a financial instrument or other financial arrangement, for closure or postclosure care at the facility if funds available for closure or postclosure care are inadequate and shall assign the rights to any remainder to the commissioner.\n(d) The agreement required in paragraph (b), clause (2), must be in writing and must apply to and be binding upon the successors and assigns of the owner. The owner shall record the agreement, or a memorandum approved by the commissioner that summarizes the agreement, with the county recorder or registrar of titles of the county where the property is located.\n(e) A binding agreement entered into under paragraph (a), clause (1), may include a provision that the owner or operator will reimburse the commissioner for the costs of closing the facility to the standard required in that clause.\n(a) For a qualified facility that is subject to a cleanup order, persons identified in the order shall complete construction of the remedy required under the cleanup order and:\n(1) for a federal order, receive a concurrent determination of the United States Environmental Protection Agency and the agency or commissioner that the remedy is functioning properly and is performing as designed; or\n(2) for a state order, receive acknowledgment from the agency or commissioner that the obligations under the order for construction of the remedy have been met.\n(b) The owner or operator of a qualified facility that is subject to a cleanup order, in addition to any applicable requirement in paragraph (a), shall comply with subdivision 4, paragraphs (a), clause (3) or (4); and (b).\n(a) If the owner or operator of a qualified facility that is subject to the requirements of subdivision 4, paragraph (a), fails to comply with subdivision 4, paragraph (a), clause (1) or (2), the commissioner shall:\n(1) undertake or complete closure activities at the facility in compliance with the solid waste rules in effect at the time the commissioner takes action under this clause; and\n(2) undertake or continue postclosure care at the facility as required under subdivision 2.\n(b) If a facility has been properly closed under subdivision 4, but the applicable closure requirements are less environmentally protective than closure requirements in the solid waste rules in effect on January 1, 1993, the commissioner shall determine whether the facility should be closed to the higher standards and, if so, shall undertake additional closure activities at the facility to meet those standards. The commissioner may determine that additional closure activities are unnecessary only if it is likely that response actions will be taken in the near future and that those response actions will result in removal or significant alteration of the closure activities or render the closure activities unnecessary.\n(a) The commissioner shall provide written notice of compliance to the appropriate owner or operator or person subject to a cleanup order when:\n(1) the commissioner determines that the requirements of subdivision 4 or 5 have been met; and\n(2) the person who will receive the notice has submitted to the commissioner a written waiver of any claims the person may have against any other person for recovery of any environmental response costs related to a qualified facility that were incurred prior to the date of notice of compliance.\n(b) Beginning on the date of the notice of compliance:\n(1) the commissioner shall assume all obligations of the owner or operator or person for environmental response actions under the federal Superfund Act and any federal or state cleanup orders and shall undertake all further action under subdivision 1 at or related to the facility that the commissioner deems appropriate and in accordance with the priority list; and\n(2) the commissioner may not seek recovery against the owner or operator of the facility or any responsible person of any costs incurred by the commissioner for environmental response action at or related to the facility, except:\n(i) in the case of qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), to the extent of insurance coverage held by the owner or operator or responsible person; or\n(ii) as provided in section 115B.402.\n(c) The commissioner and the attorney general shall communicate with the United States Environmental Protection Agency addressing the manner and procedure for the state's assumption of federal obligations under paragraph (b), clause (1).\n(a) With respect to claims for recovery of environmental response costs related to qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), the running of all applicable periods of limitation under state law is suspended until July 1, 2004.\n(b) A waiver of claims for recovery of environmental response costs under this section or section 115B.43 is extinguished for that portion of reimbursable costs under section 115B.43 that have not been reimbursed by July 1, 2004.",
	"repealed": false
}