{
	"id": "47.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.59",
	"title": "47.59 FINANCIAL INSTITUTION CREDIT EXTENSION MAXIMUM RATES.",
	"text": "For purposes of this section, the following definitions shall apply.\n(a) \"Actuarial method\" has the meaning given the term in Code of Federal Regulations, title 12, part 226, and appendix J thereto.\n(b) \"Annual percentage rate\" has the meaning given the term in Code of Federal Regulations, title 12, part 226, but using the definition of \"finance charge\" used in this section.\n(c) \"Borrower\" means a debtor under a loan or a purchaser or debtor under a credit sale contract.\n(d) \"Business purpose\" means a purpose other than a personal, family, household, or agricultural purpose.\n(e) \"Cardholder\" means a person to whom a credit card is issued or who has agreed with the financial institution to pay obligations arising from the issuance to or use of the card by another person.\n(f) \"Consumer loan\" means a loan made by a financial institution in which:\n(1) the debtor is a person other than an organization;\n(2) the debt is incurred primarily for a personal, family, or household purpose; and\n(3) the debt is payable in installments or a finance charge is made.\n(g) \"Credit\" means the right granted by a financial institution to a borrower to defer payment of a debt, to incur debt and defer its payment, or to purchase property or services and defer payment.\n(h) \"Credit card\" means a card or device issued under an arrangement pursuant to which a financial institution gives to a cardholder the privilege of obtaining credit from the financial institution or other person in purchasing or leasing property or services, obtaining loans, or otherwise. A transaction is \"pursuant to a credit card\" only if credit is obtained according to the terms of the arrangement by transmitting information contained on the card or device orally, in writing, by mechanical or electronic methods, or in any other manner. A transaction is not \"pursuant to a credit card\" if the card or device is used solely in that transaction to:\n(1) identify the cardholder or evidence the cardholder's creditworthiness and credit is not obtained according to the terms of the arrangement;\n(2) obtain a guarantee of payment from the cardholder's deposit account, whether or not the payment results in a credit extension to the cardholder by the financial institution; or\n(3) effect an immediate transfer of funds from the cardholder's deposit account by electronic or other means, whether or not the transfer results in a credit extension to the cardholder by the financial institution.\n(i) \"Credit sale contract\" means a contract evidencing a credit sale. \"Credit sale\" means a sale of goods or services, or an interest in land, in which:\n(1) credit is granted by a seller who regularly engages as a seller in credit transactions of the same kind; and\n(2) the debt is payable in installments or a finance charge is made.\n(j) \"Finance charge\" has the meaning given in Code of Federal Regulations, title 12, part 226, except that the following will not in any event be considered a finance charge:\n(1) a charge as a result of default or delinquency under subdivision 6 if made for actual unanticipated late payment, delinquency, default, or other similar occurrence, and a charge made for an extension or deferment under subdivision 5, unless the parties agree that these charges are finance charges;\n(2) an additional charge under subdivision 6;\n(3) a discount, if a financial institution purchases a loan at less than the face amount of the obligation or purchases or satisfies obligations of a cardholder pursuant to a credit card and the purchase or satisfaction is made at less than the face amount of the obligation;\n(4) fees paid by a borrower to a broker, provided the financial institution or a person described in subdivision 4 does not require use of the broker to obtain credit; or\n(5) a commission, expense reimbursement, or other sum received by a financial institution or a person described in subdivision 4 in connection with insurance described in subdivision 6.\n(k) \"Financial institution\" means a state or federally chartered bank, a state or federally chartered bank and trust, a trust company with banking powers, a state or federally chartered saving bank, a state or federally chartered savings association, an industrial loan and thrift company organized under chapter 53, a regulated lender organized under chapter 56, or an operating subsidiary of any such institution.\n(l) \"Loan\" means:\n(1) the creation of debt by the financial institution's payment of money to the borrower or a third person for the account of the borrower;\n(2) the creation of debt pursuant to a credit card in any manner, including a cash advance or the financial institution's honoring a draft or similar order for the payment of money drawn or accepted by the borrower, paying or agreeing to pay the borrower's obligation, or purchasing or otherwise acquiring the borrower's obligation from the obligee or the borrower's assignee;\n(3) the creation of debt by a cash advance to a borrower pursuant to an overdraft line of credit arrangement;\n(4) the creation of debt by a credit to an account with the financial institution upon which the borrower is entitled to draw immediately;\n(5) the forbearance of debt arising from a loan; and\n(6) the creation of debt pursuant to open-end credit.\n\"Loan\" does not include the forbearance of debt arising from a sale or lease, a credit sale contract, or an overdraft from a person's deposit account with a financial institution which is not pursuant to a written agreement to pay overdrafts with the right to defer repayment thereof.\n(m) \"Official fees\" means:\n(1) fees and charges which actually are or will be paid to public officials for determining the existence of or for perfecting, releasing, terminating, or satisfying a security interest or mortgage relating to a loan or credit sale, and any separate fees or charges which actually are or will be paid to public officials for recording a notice described in section 580.032, subdivision 1; and\n(2) premiums payable for insurance in lieu of perfecting a security interest or mortgage otherwise required by a financial institution in connection with a loan or credit sale, if the premium does not exceed the fees and charges described in clause (1), which would otherwise be payable.\n(n) \"Organization\" means a corporation, government, government subdivision or agency, trust, estate, partnership, joint venture, cooperative, limited liability company, limited liability partnership, or association.\n(o) \"Person\" means a natural person or an organization.\n(p) \"Principal\" means the total of:\n(1) the amount paid to, received by, or paid or repayable for the account of, the borrower; and\n(2) to the extent that payment is deferred:\n(i) the amount actually paid or to be paid by the financial institution for additional charges permitted under this section; and\n(ii) prepaid finance charges.\nExtensions of credit or purchases of extensions of credit by financial institutions under sections 47.20, 47.21, 47.201, 47.204, 47.58, 48.153, 48.185, 48.195, 59A.01 to 59A.15, 334.01, 334.011, 334.012, 334.022, 334.06, and 334.061 to 334.19 may, but need not, be made according to those sections in lieu of the authority set forth in this section to the extent those sections authorize the financial institution to make extensions of credit or purchase extensions of credit under those sections. If a financial institution elects to make an extension of credit or to purchase an extension of credit under those other sections, the extension of credit or the purchase of an extension of credit is subject to those sections and not this section, except this subdivision, and except as expressly provided in those sections. A financial institution may also charge an organization a rate of interest and any charges agreed to by the organization and may calculate and collect finance and other charges in any manner agreed to by that organization. Except for extensions of credit a financial institution elects to make under section 334.01, 334.011, 334.012, 334.022, 334.06, or 334.061 to 334.19, chapter 334 does not apply to extensions of credit made according to this section or the sections listed in this subdivision. This subdivision does not authorize a financial institution to extend credit or purchase an extension of credit under any of the sections listed in this subdivision if the financial institution is not authorized to do so under those sections. A financial institution extending credit under any of the sections listed in this subdivision shall specify in the promissory note, contract, or other loan document the section under which the extension of credit is made.\n(a) With respect to a loan, including a loan pursuant to open-end credit but excluding open-end credit pursuant to a credit card, a financial institution may contract for and receive a finance charge on the unpaid balance of the principal amount not to exceed the greater of:\n(1) an annual percentage rate not exceeding 21.75 percent; or\n(2) the total of:\n(i) 33 percent per year on that part of the unpaid balance of the principal amount not exceeding $1,425; and\n(ii) 19 percent per year on that part of the unpaid balance of the principal amount exceeding $1,425.\nWith respect to open-end credit pursuant to a credit card, the financial institution may contract for and receive a finance charge on the unpaid balance of the principal amount at an annual percentage rate not exceeding 18 percent per year.\n(b) On a loan where the finance charge is calculated according to the method provided for in paragraph (a), clause (2), the finance charge must be contracted for and earned as provided in that provision or at the single annual percentage rate computed to the nearest one-tenth of one percent that would earn the same total finance charge at maturity of the contract as would be earned by the application of the graduated rates provided in paragraph (a), clause (2), when the debt is paid according to the agreed terms and the calculations are made according to the actuarial method.\n(c) With respect to a loan, the finance charge must be considered not to exceed the maximum annual percentage rate permitted under this section if the finance charge contracted for and received does not exceed the equivalent of the maximum annual percentage rate calculated in accordance with Code of Federal Regulations, title 12, part 226, but using the definition of finance charge provided in this section.\n(d) This subdivision does not limit or restrict the manner of calculating the finance charge, whether by way of add-on, discount, discount points, precomputed charges, single annual percentage rate, variable rate, interest in advance, compounding, average daily balance method, or otherwise, if the annual percentage rate does not exceed that permitted by this section. Discount points permitted by this paragraph and not collected but included in the principal amount must not be included in the amount on which credit insurance premiums are calculated and charged.\n(e) With respect to a loan secured by real estate, if a finance charge is calculated or collected in advance, or included in the principal amount of the loan, and the borrower prepays the loan in full, the financial institution shall credit the borrower with a refund of the charge to the extent that the annual percentage rate yield on the loan would exceed the maximum rate permitted under paragraph (a), taking into account the prepayment. The refund need not be made if it would be less than $9.50.\n(f) With respect to all other loans, if the finance charge is calculated or collected in advance, or included in the principal amount of the loan, and the borrower prepays the loan in full, the financial institution shall credit the borrower with a refund of the charge to the extent the annual percentage rate yield on the loan would exceed the annual percentage rate on the loan as originally determined under paragraph (a) and taking into account the prepayment. The refund need not be made if it would be less than $9.50.\n(g) For the purpose of calculating the refund under this subdivision, the financial institution may assume that the contract was paid before the date of prepayment according to the schedule of payments under the loan and that all payments were paid on their due dates.\n(h) For loans repayable in substantially equal successive monthly installments, the financial institution may calculate the refund under paragraph (f) as the portion of the finance charge allocable on an actuarial basis to all wholly unexpired payment periods following the date of prepayment, based on the annual percentage rate on the loan as originally determined under paragraph (a), and for the purpose of calculating the refund may assume that all payments are made on the due date.\n(i) The dollar amounts in this subdivision, subdivision 6, paragraph (a), clause (4), and the dollar amount of original principal amount of closed-end credit in subdivision 6, paragraph (d), shall change periodically, as provided in this section, according to and to the extent of changes in the implicit price deflator for the gross domestic product, 2005 = 100, compiled by the United States Department of Commerce, and hereafter referred to as the index. The index for December 2011 is the reference base index for adjustments of dollar amounts.\n(j) The designated dollar amounts shall change on July 1 of each even-numbered year if the percentage of change, calculated to the nearest whole percentage point, between the index for December of the preceding year and the reference base index is ten percent or more; but\n(1) the portion of the percentage change in the index in excess of a multiple of ten percent shall be disregarded and the dollar amounts shall change only in multiples of ten percent of the amounts appearing in Laws 1995, chapter 202, on May 24, 1995; and\n(2) the dollar amounts shall not change if the amounts required by this section are those currently in effect pursuant to Laws 1995, chapter 202, as a result of earlier application of this section.\n(k) If the index is revised, the percentage of change pursuant to this section shall be calculated on the basis of the revised index. If a revision of the index changes the reference base index, a revised reference base index shall be determined by multiplying the reference base index then applicable by the rebasing factor furnished by the Department of Commerce. If the index is superseded, the index referred to in this section is the one represented by the Department of Commerce as reflecting most accurately changes in the purchasing power of the dollar for consumers.\n(l) The commissioner shall:\n(1) announce and publish on or before April 30 of each year in which dollar amounts are to change, the changes in dollar amounts required by paragraph (j);\n(2) announce and publish promptly after the changes occur, changes in the index required by paragraph (k) including, if applicable, the numerical equivalent of the reference base index under a revised reference base index and the designation or title of any index superseding the index; and\n(3) promptly notify the revisor of statutes in writing of the changes announced and published by the commissioner pursuant to clauses (1) and (2). The revisor shall publish the changes in the next edition of Minnesota Statutes.\n(m) A person does not violate this chapter with respect to a transaction otherwise complying with this chapter if that person relies on dollar amounts either determined according to paragraph (j), clause (2), or appearing in the last publication of the commissioner announcing the then current dollar amounts.\n(n) The adjustments provided in this section shall not be affected unless explicitly provided otherwise by law.\n(a) A person may enter into a credit sale contract for sale to a financial institution and a financial institution may purchase and enforce the contract, if the annual percentage rate provided for in the contract does not exceed that permitted in this section, or, in the case of a retail installment sale of a motor vehicle as defined in section 53C.01, the annual percentage rates permitted by subdivision 4a.\n(b) The annual percentage rate may not exceed the equivalent of the greater of either of the following:\n(1) the total of:\n(i) 36 percent per year on that part of the unpaid balances of the amount financed that is $300 or less;\n(ii) 21 percent per year on that part of the unpaid balances of the amount financed which exceeds $300 but does not exceed $1,000; and\n(iii) 15 percent per year on that part of the unpaid balances of the amount financed which exceeds $1,000; or\n(2) 19 percent per year on the unpaid balances of the amount financed.\n(c) This subdivision does not limit or restrict the manner of calculating the finance charge whether by way of add-on, discount, discount points, single annual percentage rate, precomputed charges, variable rate, interest in advance, compounding, or otherwise, if the annual percentage rate calculated under paragraph (d) does not exceed that permitted by this section. The finance charge may be contracted for and earned at the single annual percentage rate that would earn the same finance charge as the graduated rates when the debt is paid according to the agreed terms and the finance charge is calculated under paragraph (d). If the finance charge is calculated and collected in advance, or included in the principal amount of the contract, and the borrower prepays the contract in full, the financial institution shall credit the borrower with a refund of the charge to the extent the annual percentage rate yield on the contract would exceed the annual percentage rate on the contract as originally determined under paragraph (d) and taking into account the prepayment. For the purpose of calculating the refund under this subdivision, the financial institution may assume that the contract was paid before the date of prepayment according to the schedule of payments under the contract and that all payments were paid on their due dates. For contracts repayable in substantially equal successive monthly installments, the financial institution may calculate the refund as the portion of the finance charge allocable on an actuarial basis to all wholly unexpired payment periods following the date of prepayment, based on the annual percentage rate on the contract as originally determined under paragraph (d), and for the purpose of calculating the refund may assume that all payments are made on the due date.\n(d) The annual percentage rate must be calculated in accordance with Code of Federal Regulations, title 12, part 226, except that the following will not in any event be considered a finance charge:\n(1) a charge as a result of delinquency or default under subdivision 6 if made for actual unanticipated late payment, delinquency, default, or other similar occurrence, and a charge made for an extension or deferment under subdivision 5, unless the parties agree that these charges are finance charges;\n(2) an additional charge under subdivision 6; or\n(3) a discount, if a financial institution purchases a contract evidencing a credit sale at less than the face amount of the obligation or purchases or satisfies obligations of a cardholder according to a credit card and the purchase or satisfaction is made at less than the face amount of the obligation.\nA retail installment contract evidencing the retail installment sale of a motor vehicle as defined in section 53C.01 is subject to the finance charge limitations in paragraphs (a) and (b).\n(a) The finance charge authorized by this subdivision in a retail installment sale may not exceed the following annual percentage rates applied to the principal balance determined in the same manner as in section 53C.08, subdivision 2, clause (5):\n(1) Class 1. A motor vehicle designated by the manufacturer by a year model of the same or not more than one year before the year in which the sale is made, 18 percent per year.\n(2) Class 2. A motor vehicle designated by the manufacturer by a year model of two to three years before the year in which the sale is made, 19.75 percent per year.\n(3) Class 3. Any motor vehicle not in Class 1 or Class 2, 23.25 percent per year.\n(b) A sale of a manufactured home made after July 31, 1983, is governed by this subdivision for purposes of determining the lawful finance charge rate, except that the maximum finance charge for a Class 1 manufactured home may not exceed 14.5 percent per year. A retail installment sale of a manufactured home that imposes a finance charge that is greater than the rate permitted by this subdivision is lawful and enforceable in accordance with its terms until the indebtedness is fully satisfied if the rate was lawful when the sale was made.\n(a) The parties may agree in writing, either in the loan contract or credit sale contract or in a subsequent agreement, to a deferment of wholly unpaid installments. For precomputed loans and credit sale contracts, the manner of deferment charge shall be determined as provided for in this section. A deferment postpones the scheduled due date of the earliest unpaid installment and all subsequent installments as originally scheduled, or as previously deferred, for a period equal to the deferment period. The deferment period is that period during which no installment is scheduled to be paid by reason of the deferment. The deferment charge for a one-month period may not exceed the applicable charge for the installment period immediately following the due date of the last undeferred payment. A proportionate charge may be made for deferment periods of more or less than one month. A deferment charge is earned pro rata during the deferment period and is fully earned on the last day of the deferment period. If a loan or credit sale is prepaid in full during a deferment period, the financial institution shall make or credit to the borrower a refund of the unearned deferment charge in addition to any other refund or credit made for prepayment of the loan or credit sale in full.\nFor the purpose of this subdivision, \"applicable charge\" means the amount of finance charge attributable to each monthly installment period for the loan or credit sale contract. The applicable charge is computed as if each installment period were one month and any charge for extending the first installment period beyond the one month, or reduction in charge for a first installment less than one month, is ignored. The applicable charge for any installment period is that which would have been made for the period had the loan been made on an interest-bearing basis at the single annual percentage rate provided for in the contract based upon the assumption that all payments were made according to schedule. For convenience in computation, the financial institution may round the single annual rate to the nearest one quarter of one percent.\n(b) Subject to a refund of unearned finance or deferment charge required by this section, a financial institution may convert a loan or credit sale contract to an interest bearing balance, if:\n(1) the loan contract or credit sale contract so provides and is subject to a change of the terms of the written agreement between the parties; or\n(2) the loan contract so provides and two or more installments are delinquent one full month or more on any due date.\nThereafter, the single annual percentage rate and other charges must be determined as provided under this section for interest-bearing transactions.\n(a) For purposes of this subdivision, \"financial institution\" includes a person described in subdivision 4, paragraph (a). In addition to the finance charges permitted by this section, a financial institution may contract for and receive the following additional charges that may be included in the principal amount of the loan or credit sale unpaid balances:\n(1) official fees and taxes;\n(2) charges for insurance as described in paragraph (b);\n(3) with respect to a loan or credit sale contract secured by real estate, the following \"closing costs,\" if they are bona fide, reasonable in amount, and not for the purpose of circumvention or evasion of this section:\n(i) fees or premiums for title examination, abstract of title, title insurance, surveys, or similar purposes;\n(ii) fees for preparation of a deed, mortgage, settlement statement, or other documents, if not paid to the financial institution;\n(iii) escrows for future payments of taxes, including assessments for improvements, insurance, and water, sewer, and land rents;\n(iv) fees for notarizing deeds and other documents;\n(v) appraisal and credit report fees; and\n(vi) fees for determining whether any portion of the property is located in a flood zone and fees for ongoing monitoring of the property to determine changes, if any, in flood zone status;\n(4) a delinquency charge on a payment, including the minimum payment due in connection with open-end credit, not paid in full on or before the tenth day after its due date in an amount not to exceed five percent of the amount of the payment or $9.88, whichever is greater;\n(5) for a returned check or returned automatic payment withdrawal request, an amount not in excess of the service charge limitation in section 604.113, except that, on a loan transaction that is a consumer small loan as defined in section 47.60, subdivision 1, paragraph (a), in which cash is advanced in exchange for a personal check, the civil penalty provisions of section 604.113, subdivision 2, paragraph (b), may not be demanded or assessed against the borrower; and\n(6) charges for other benefits, including insurance, conferred on the borrower that are of a type that is not for credit.\n(b) An additional charge may be made for insurance written in connection with the loan or credit sale contract, which may be included in the principal amount of the loan or credit sale unpaid balances:\n(1) with respect to insurance against loss of or damage to property, or against liability arising out of the ownership or use of property, if the financial institution furnishes a clear, conspicuous, and specific statement in writing to the borrower setting forth the cost of the insurance if obtained from or through the financial institution and stating that the borrower may choose the person through whom the insurance is to be obtained;\n(2) with respect to credit insurance or mortgage insurance providing life, accident, health, or unemployment coverage, if the insurance coverage is not required by the financial institution, and this fact is clearly and conspicuously disclosed in writing to the borrower, and the borrower gives specific, dated, and separately signed affirmative written indication of the borrower's desire to do so after written disclosure to the borrower of the cost of the insurance; and\n(3) with respect to the vendor's single interest insurance, but only (i) to the extent that the insurer has no right of subrogation against the borrower; and (ii) to the extent that the insurance does not duplicate the coverage of other insurance under which loss is payable to the financial institution as its interest may appear, against loss of or damage to property for which a separate charge is made to the borrower according to clause (1); and (iii) if a clear, conspicuous, and specific statement in writing is furnished by the financial institution to the borrower setting forth the cost of the insurance if obtained from or through the financial institution and stating that the borrower may choose the person through whom the insurance is to be obtained.\n(c) In addition to the finance charges and other additional charges permitted by this section, a financial institution may contract for and receive the following additional charges in connection with open-end credit, which may be included in the principal amount of the loan or balance upon which the finance charge is computed:\n(1) annual charges, not to exceed $50 per annum, payable in advance, for the privilege of opening and maintaining open-end credit;\n(2) charges for the use of an automated teller machine;\n(3) charges for any monthly or other periodic payment period in which the borrower has exceeded or, except for the financial institution's dishonor would have exceeded, the maximum approved credit limit, in an amount not in excess of the service charge permitted in section 604.113;\n(4) charges for obtaining a cash advance in an amount not to exceed the service charge permitted in section 604.113; and\n(5) charges for check and draft copies and for the replacement of lost or stolen credit cards.\n(d) In addition to the finance charges and other additional charges permitted by this section, a financial institution may contract for and receive a onetime loan administrative fee not exceeding $25 in connection with closed-end credit, which may be included in the principal balance upon which the finance charge is computed. This paragraph applies only to closed-end credit in an original principal amount of $8,208 or less. The determination of an original principal amount must exclude the administrative fee contracted for and received according to this paragraph.\n(a) If the agreement with respect to a loan or credit sale contract contains covenants by the borrower or purchaser to perform certain duties pertaining to insuring or preserving collateral and the financial institution according to the agreement pays for performance of the duties on behalf of the borrower or purchaser, the financial institution may add to the debt or contract balance the amounts so advanced. Before or within a reasonable time not more than 30 days after advancing any sums, the financial institution shall state to the borrower or purchaser in writing the amount of sums advanced or to be advanced, any charges with respect to this amount, and any revised payment schedule and, if the duties of the borrower or purchaser performed by the financial institution pertain to insurance, a brief description of the insurance paid for or to be paid for by the financial institution including the type and amount of coverages. Additional information need not be given. The actions of the financial institution pursuant to this subdivision shall not be deemed to cure the borrower's failure to perform covenants in the loan or credit sale contract, unless the loan or credit sale contract expressly provides otherwise.\n(b) A finance charge equal to that specified in the loan agreement or credit sale contract may be made for sums advanced under paragraph (a).\nWith respect to a loan or credit sale, the agreement may provide for payment by the borrower of the attorney's fees and court costs incurred in connection with collection or foreclosure. This subdivision is not a limitation on attorney's fees that may be charged to an organization.\nThe borrower or purchaser may prepay in full the unpaid balance of a consumer loan or credit sale contract, at any time without penalty.\n(a) A financial institution shall credit a payment to the consumer's account as of the date of receipt except when a delay in crediting does not result in a finance or other charge or except as provided in paragraph (b).\n(b) If a financial institution, in the loan agreement or, in the case of open-end credit, on or with a periodic statement or similar document, specifies requirements for the consumer to follow in making payments, but accepts a payment that does not conform to the requirements, the creditor shall credit the payment within five days of receipt.\n(c) If a financial institution fails to credit a payment, as required by paragraph (a) or (b) in time to avoid the imposition of finance or other charges, the financial institution shall adjust the consumer's account so that the charges imposed are credited to the consumer's account promptly or, in the case of open-end credit, no later than during the next billing cycle.\n(a) The sale of credit insurance or mortgage insurance is subject to chapters 61A, 62A, and 62B, as applicable, and the rules adopted under those chapters, if any. In case there are multiple consumers obligated under a transaction subject to this chapter, no policy or certificate of insurance providing credit insurance may be procured by or through a financial institution or person described in subdivision 2 upon more than two of the consumers, in which case they may be insured jointly.\n(b) A financial institution that provides credit insurance in relation to open-end credit may calculate the charge to the borrower in each billing cycle by applying the current premium rate to the balance in the manner permitted with respect to finance charges by the provisions on finance charge in this section.\n(c) Upon prepayment in full of a consumer loan or credit sale contract by the proceeds of credit insurance or mortgage insurance, the consumer or the consumer's estate is entitled to a refund of any portion of a separate charge for insurance that by reason of prepayment is retained by the financial institution or returned to it by the insurer, unless the charge was computed from time to time on the basis of the balances of the consumer's loan or credit sale contract.\n(d) This section does not require a financial institution to grant a refund to the consumer if all refunds due to the consumer under paragraph (c) amount to less than $5 and, except as provided in paragraph (c), does not require the financial institution to account to the consumer for any portion of a separate charge for insurance because:\n(1) the insurance is terminated by performance of the insurer's obligation;\n(2) the financial institution pays or accounts for premiums to the insurer in amounts and at times determined by the agreement between them; or\n(3) the financial institution receives directly or indirectly under a policy of insurance a gain or advantage not prohibited by law.\n(e) Except as provided in paragraph (d), the financial institution shall promptly make or cause to be made an appropriate refund to the consumer with respect to a separate charge made to the consumer for insurance if:\n(1) the insurance is not provided or is provided for a shorter term than for which the charge to the borrower for insurance was computed; or\n(2) the insurance terminates before the end of the term for which it was written because of prepayment in full or otherwise.\n(f) If a financial institution requires insurance, upon notice to the borrower, the borrower has the option of providing the required insurance through an existing policy of insurance owned or controlled by the borrower, or through a policy to be obtained and paid for by the borrower, but the financial institution for reasonable cause may decline the insurance provided by the borrower.\n(a) Except as otherwise provided in this section and subject to the provisions on additional charges and maximum finance charges in this section, a financial institution may agree to sell, as an agent, property and liability insurance, and may contract for and receive a charge for this insurance separate from and in addition to other charges. This section does not authorize the issuance of the insurance prohibited under any statute or rule governing the business of insurance nor does it authorize a financial institution to underwrite insurance.\n(b) This section does not apply to an insurance premium loan. A financial institution may request cancellation of a policy of property or liability insurance only after the borrower's default or in accordance with a written authorization by the borrower. In either case, the cancellation does not take effect until written notice is delivered to the borrower or mailed to the borrower at the borrower's address as stated by the borrower. The notice must state that the policy may be canceled on a date not less than ten days after the notice is delivered, or, if the notice is mailed, not less than 13 days after it is mailed. A cancellation may not take effect until those notice periods expire.\n(a) Financial institutions shall comply with the requirements of the federal Truth in Lending Act, United States Code, title 15, sections 1601 to 1693, as the same may be amended from time to time, in connection with a consumer loan or credit sale for a consumer purpose where the federal Truth in Lending Act is applicable. A financial institution shall give the following disclosure to the borrower in writing at the time an open-end credit account is established if the financial institution imposes a loan fee, points, or similar charge that relates to the opening of the account which is not included in the annual percentage rate given pursuant to the federal Truth in Lending Act: \"YOU HAVE BEEN ASSESSED FINANCE CHARGES, OR POINTS, WHICH ARE NOT INCLUDED IN THE ANNUAL PERCENTAGE RATE. THESE CHARGES MAY BE REFUNDED, IN WHOLE OR IN PART, IF YOU DO NOT USE YOUR LINE OF CREDIT OR IF YOU REPAY YOUR LINE OF CREDIT EARLY. THESE CHARGES INCREASE THE COST OF YOUR CREDIT.\"\n(b) Financial institutions shall comply with the following consumer protection provisions in connection with a consumer loan or credit sale for a consumer purpose: sections 325G.02 to 325G.05; 325G.06 to 325G.11; 325G.15 to 325G.22; and 325G.29 to 325G.36, and Code of Federal Regulations, title 12, part 535, where those statutes or regulations are applicable.\n(c) An assignment of a consumer's earnings by the consumer to a financial institution as payment or as security for payment of a debt arising out of a consumer loan or consumer credit sale is unenforceable by the financial institution except where the assignment: (1) by its terms is revocable at the will of the consumer; (2) is a payroll deduction plan or preauthorized payment plan, beginning at the time of the transaction, in which the consumer authorizes a series of wage deductions as a method of making each payment; or (3) applies only to wages or other earnings already earned at the time of the assignment.\nLoans and credit sale contracts other than consumer loans and consumer credit sale contracts are not subject to the provisions and limitations of subdivisions 9; 10; 11, paragraph (b); and 12.\n(a) If a financial institution has violated any provision of this section applying to collection of finance or other charges, the borrower or purchaser under a credit sale contract may recover from the financial institution actual damages and, in an action other than a class action, a penalty in an amount determined by the court but not less than $100 nor more than $1,000. With respect to violations arising from other than open-end credit transactions, no action may be brought according to this paragraph and no setoff or recoupment may be asserted according to this paragraph more than one year after the making of the debt.\n(b) A borrower or purchaser under a credit sale contract is not obligated to pay a charge in excess of that allowed by this section and has a right of refund of any excess charge paid. A refund may not be made by reducing the borrower's or purchaser's obligation by the amount of the excess charge, unless the financial institution has notified the borrower or purchaser that the borrower or purchaser may request a refund and the borrower or purchaser has not so requested within 30 days thereafter. If the borrower or purchaser has paid an amount in excess of the lawful obligation under the agreement, the borrower or purchaser may recover the excess amount from the financial institution that made the excess charge or from an assignee of the financial institution's rights that undertakes direct collection of payments from or enforcement of rights against borrowers or purchasers arising from the debt.\n(c) If a financial institution has contracted for or received a charge in excess of that allowed by this section, or if a borrower or purchaser under a credit sale contract is entitled to a refund and a person liable to the borrower or purchaser refuses to make a refund within a reasonable time after demand, the borrower or purchaser may recover from the financial institution or the person liable in an action other than a class action a penalty in an amount determined by the court but not less than $100 nor more than $1,000. With respect to excess charges arising from other than open-end credit transactions, no action according to this paragraph may be brought more than one year after the making of the debt. For purposes of this paragraph, a reasonable time is presumed to be 30 days.\n(d) A violation of this section does not impair rights on a debt.\n(e) A financial institution is not liable for a penalty under paragraph (a) or (c) if it notifies the borrower or purchaser under a credit sale contract of a violation before the financial institution receives from the borrower or purchaser written notice of the violation or the borrower or purchaser has brought an action under this section, and the financial institution corrects the violation within 45 days after notifying the borrower or purchaser. If the violation consists of a prohibited agreement, giving the borrower or purchaser a corrected copy of the writing containing the violation is sufficient notification and correction. If the violation consists of an excess charge, correction must be made by an adjustment or refund.\n(f) A financial institution may not be held liable in an action brought under this section for a violation of this section if the financial institution shows by a preponderance of evidence that the violation was not intentional and resulted from a bona fide error notwithstanding the maintenance of procedures reasonably adopted to avoid the error.\n(g) In an action in which it is found that a financial institution has violated this section, the court shall award to the borrower or the purchaser under a credit sale contract the costs of the action and to the borrower's or purchaser's attorneys their reasonable fees.",
	"repealed": false
}