{
	"id": "179.876",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.876",
	"title": "179.876 MEATPACKING WORKER CHRONIC INJURIES AND WORKPLACE SAFETY.",
	"text": "(a) The meat-processing employer's ergonomics program under section 182.677, subdivision 2, must be developed and implemented by a committee of individuals who are knowledgeable of the tasks and work processes performed by workers at the employer's facility. The committee must include:\n(1) a certified professional ergonomist;\n(2) a licensed, board-certified physician, with preference given to a physician who has specialized experience and training in occupational medicine; and\n(3) at least three workers employed in the employer's facility who have completed a general industry outreach course approved by the commissioner, one of whom must be an authorized employee representative if the employer is party to a collective bargaining agreement.\n(b) If it is not practicable for a certified professional ergonomist or a licensed, board-certified physician to be a member of the committee required by paragraph (a), the meatpacking employer must have their safe-worker program reviewed by a certified professional ergonomist and a licensed, board-certified physician prior to implementation of the program and annually thereafter.\n(a) Meat-processing employers must provide every worker who is assigned a new task if the worker has no previous work experience with training on how to safely perform the task, the ergonomic and other hazards associated with the task, and training on the early signs and symptoms of musculoskeletal injuries and the procedures for reporting them. The employer must give a worker an opportunity within 30 days of receiving the new task training to receive refresher training on the topics covered in the new task training. The employer must provide this training in a language and with vocabulary that the employee can understand.\n(b) Meat-processing employers must provide each worker with no less than eight hours of safety training each year. This annual training must address health and safety topics that are relevant to the establishment and the worker's job assignment, such as cuts, lacerations, amputations, machine guarding, biological hazards, lockout/tagout, hazard communication, ergonomic hazards, and personal protective equipment. At least two of the eight hours of annual training must be on topics related to the facility's ergonomic injury prevention program, including the assessment of surveillance data, the ergonomic hazard prevention and control plan, and the early signs and symptoms of musculoskeletal disorders and the procedures for reporting them. The employer must provide this training in a language and with vocabulary that the employee can understand.\n(a) Meat-processing employers must ensure that:\n(1) all first-aid providers, medical assistants, nurses, and physicians engaged by the employer are licensed and perform their duties within the scope of their licensed practice;\n(2) medical management of musculoskeletal disorders is under direct supervision of a licensed physician specializing in occupational medicine who will advise on best practices for management and prevention of work-related musculoskeletal disorders; and\n(3) medical management of musculoskeletal injuries follows the most current version of the American College of Occupational and Environmental Medicine practice guidelines.\n(b) The coordinator may compile, analyze, and publish annually, either in summary or detailed form, all reports or information obtained under sections 179.87 to 179.877, including information about ergonomics programs, and may cooperate with the United States Department of Labor in obtaining national summaries of occupational deaths, injuries, and illnesses. The coordinator and authorized employee representative must preserve the anonymity of each employee with respect to whom medical reports or information is obtained.\n(c) Meat-processing employers must not institute or maintain any program, policy, or practice that discourages employees from reporting injuries, hazards, or safety standards violations.\n(a) This subdivision applies during a peacetime public health emergency declared under section 12.31, subdivision 2, that involves airborne transmission.\n(b) Meat-processing employers must maintain a radius of space around and between each worker according to the Centers for Disease Control and Prevention guidelines unless a nonporous barrier separates the workers. An employer may accomplish such distancing by increasing physical space between workstations, slowing production speeds, staggering shifts and breaks, adjusting shift size, or a combination thereof. The employer must reconfigure common or congregate spaces to allow for such distancing, including lunch rooms, break rooms, and locker rooms. The employer must reinforce social distancing by allowing workers to maintain six feet of distance along with the use of nonporous barriers.\n(c) Meat-processing employers must provide employees with face masks and must make face shields available on request. Face masks, including replacement face masks, and face shields must be provided at no cost to the employee. All persons present at the meatpacking operation must wear face masks in the facility except in those parts of the facility where infection risk is low because workers work in isolation.\n(d) Meat-processing employers must provide all meat-processing workers with the ability to frequently and routinely sanitize their hands with either hand-washing or hand-sanitizing stations. The employer must ensure that restrooms have running hot and cold water and paper towels and are in sanitary condition. The employer must provide gloves to those who request them.\n(e) Meat-processing employers must clean and regularly disinfect all frequently touched surfaces in the workplace, such as workstations, training rooms, machinery controls, tools, protective garments, eating surfaces, bathrooms, showers, and other similar areas. Employers must install and maintain ventilation systems that ensure unidirectional air flow, outdoor air, and filtration in both production areas and common areas such as cafeterias and locker rooms.\n(f) Meat-processing employers must disseminate all required communications, notices, and any published materials regarding these protections in English, Spanish, and other languages as required for employees to understand the communication.\n(g) Consistent with sections 177.253 and 177.254, meat-processing employers must provide adequate break time for workers to use the bathroom, wash their hands, and don and doff protective equipment. Nothing in this subdivision relieves an employer of its obligation to comply with federal and state wage and hour laws.\n(h) Meat-processing employers must provide sufficient personal protective equipment for each employee for each shift, plus replacements, at no cost to the employee. Meat-processing employers must provide training in proper use of personal protective equipment, safety procedures, and sanitation.\n(i) Meat-processing employers must record all injuries and illnesses in the facility and make these records available upon request to the health and safety committee. The name, contact information, and occupation of an employee, and any other information that would reveal the identity of an employee, must be removed. The redacted records must only include, to the extent it would not reveal the identity of an employee, the location where the employee worked, the date of the injury or visit, a description of the medical treatment or first aid provided, and a description of the injury suffered. The employer also must make its records available to the commissioner, and where there is a collective bargaining agreement, to the authorized bargaining representative.\n(j) Except for paragraphs (f) and (g), this subdivision shall be enforced by the commissioner under sections 182.66 and 182.661. A violation of this subdivision is subject to the penalties provided under section 182.666. Paragraphs (f) and (g) are enforceable by the commissioner as described in section 179.874, subdivision 2.\n(k) The entirety of this subdivision may also be enforced as described in section 179.874, subdivisions 3 to 6.",
	"repealed": false
}