{
	"id": "426.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/426.05",
	"title": "426.05 WHEELAGE TAX.",
	"text": "Any city may impose an annual wheelage tax upon motor vehicles using the public streets or highways, provided that:\n(1) No wheelage tax imposed by any city shall exceed a sum equal to 20 percent tax imposed by the state in lieu of all other taxes, except such wheelage tax, upon motor vehicles using the public streets or highways; provided, however, that the governing body of any city of the first class now or hereafter having a population of 450,000 inhabitants or over may impose such wheelage tax in an amount not to exceed $15 for trucks and $10 for other motor vehicles; and provided further, that any city of the first class which has a population of not more than 150,000 inhabitants may impose such wheelage taxes on trucks and other motor vehicles in an amount not exceeding 25 percent of the state tax on such vehicles, but no such tax shall exceed $50 on any one truck and $5 on any other vehicle;\n(2) No city shall impose a wheelage tax upon the vehicle of any person not a resident of such city, unless such vehicle shall be used principally upon the streets or highways of such city;\n(3) No such wheelage tax shall be imposed upon any vehicle used upon the public streets or highways solely for the purpose of selling or peddling the products of the farm or garden occupied and cultivated by the owners of such vehicles;\n(4) The terms \"motor vehicles\" and \"trucks\" shall have the meanings ascribed to them by Minnesota Statutes 1949, section 168.011;\n(5) In any city of the first class now or hereafter having a population of 450,000 inhabitants or over, the proceeds of such wheelage tax shall be placed in a special fund of such city to be known as the \"wheelage tax fund.\" If, in any such city there is a board of estimate and taxation or similar board or body empowered by the charter of such city to fix and determine the maximum amount of money and the maximum rate of tax which may be raised in the aggregate by general taxation by the city council and by the several boards and departments of the city having power to levy taxes, then all moneys remaining in such wheelage tax fund, after payment of the cost of administration, shall from time to time be allocated and distributed by said board of estimate and taxation or similar authority to the several departments of the city including the city council and the board of education, in accordance with the needs of said departments, as the same shall be determined by said board of estimate and taxation or similar authority.\nIn any city of the first class of over 450,000, the imposition of such tax shall not be effective until approved by a majority of the people voting on the tax at a general or special election after submission to them by the governing body, and shall not continue for more than five years after such approval. Such tax may, however, be reimposed for additional periods of five years by submission to and approval by the voters of such city in the same manner. Such tax may be repealed by the governing body at any time after one year after its imposition by a two-thirds vote of the governing body.\nIn any city of the first class which has a population of not more than 150,000 inhabitants, the imposition of such tax shall not be effective until approved by a majority of the people voting on the tax at a general or special election after submission to them by the governing body, and shall not continue for more than one year after such approval.",
	"repealed": false
}