{
	"id": "148.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.56",
	"title": "148.56 OPTOMETRISTS.",
	"text": "(a) Any person shall be deemed to be practicing optometry within the meaning of sections 148.52 to 148.62 who shall in any way:\n(1) advertise as an optometrist;\n(2) employ any means, including the use of autorefractors or other automated testing devices, for the measurement of the powers of vision or the adaptation of lenses or prisms for the aid thereof;\n(3) possess testing appliances for the purpose of the measurement of the powers of vision;\n(4) diagnose any disease, optical deficiency or deformity, or visual or muscular anomaly of the visual system consisting of the human eye and its accessory or subordinate anatomical parts;\n(5) prescribe lenses, including plano or cosmetic contact lenses, or prisms for the correction or the relief of same;\n(6) employ or prescribe ocular exercises, orthoptics, or habilitative and rehabilitative therapeutic vision care; or\n(7) prescribe or administer legend drugs to aid in the diagnosis, cure, mitigation, prevention, treatment, or management of disease, deficiency, deformity, or abnormality of the human eye and adnexa included in the curricula of accredited schools or colleges of optometry, and as limited by Minnesota statute and adopted rules by the Board of Optometry, or who holds oneself out as being able to do so.\n(b) In the course of treatment, nothing in this section shall allow:\n(1) legend drugs to be administered intravenously, intramuscularly, or by injection, except for treatment of anaphylaxis;\n(2) invasive surgery including, but not limited to, surgery using lasers;\n(3) Schedule II and III oral legend drugs and oral steroids to be administered or prescribed;\n(4) oral antivirals to be prescribed or administered for more than ten days; or\n(5) oral carbonic anhydrase inhibitors to be prescribed or administered for more than seven days.\nIt shall be unlawful for any person who is not licensed as an optometrist in this state to:\n(1) perform any of the actions contained in subdivision 1;\n(2) fit, sell, or dispose of, or to take, receive, or solicit any order for the fitting, sale, or disposition of, any spectacles, eye glasses, or lenses for the correction of vision in any place within the state other than an established place of business where spectacles, eye glasses, or lenses are commonly sold and dealt in; or\n(3) sell or dispose of, at retail, any spectacles, eye glasses, or lenses for the correction of vision in any established place of business or elsewhere in this state except under the supervision, direction, and authority of a duly licensed optometrist who holds a certificate under sections 148.52 to 148.62, and is in charge of and in personal attendance at the booth, counter, or place where such articles are sold or disposed of.\nNothing in sections 148.52 to 148.62 shall be construed to apply to the sale of toy glasses, goggles consisting of plano-white or plano-colored lenses or ordinary colored glasses or to the replacement of duplications of broken lenses, nor to sales upon prescription from persons legally authorized by the laws of this state to examine eyes and prescribe glasses therefor, nor shall it apply to regularly licensed physicians and surgeons. Sections 148.52 to 148.62 also do not apply to the sale of spectacles, used for reading and containing only simple lenses having a plus power of up to and including 3.25, if no attempt is made to test the eyes. The term \"simple lenses\" does not include bifocals. The seller shall prominently display a sign on the counter or rack or other display device where the spectacles are offered for sale that reads as follows: \"If you have experienced a vision loss, the selection of these glasses should not take the place of an eye exam.\"\nIt shall be unlawful for any person to engage in the practice of optometry without first procuring a license from the state Board of Optometry.\nNothing in sections 148.52 to 148.62 shall prohibit the practice of a licensed or registered health care provider in Minnesota who is operating within the provider's scope of practice under Minnesota law.",
	"repealed": false
}