{
	"id": "62Q.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.46",
	"title": "62Q.46 PREVENTIVE ITEMS AND SERVICES.",
	"text": "(a) \"Preventive items and services\" has the meaning specified in the Affordable Care Act. Preventive items and services includes:\n(1) evidence-based items or services that have in effect a rating of A or B in the current recommendations of the United States Preventive Services Task Force with respect to the individual involved;\n(2) immunizations for routine use in children, adolescents, and adults that have in effect a recommendation from the Advisory Committee on Immunization Practices of the Centers for Disease Control and Prevention with respect to the individual involved. For purposes of this clause, a recommendation from the Advisory Committee on Immunization Practices of the Centers for Disease Control and Prevention is considered in effect after the recommendation has been adopted by the Director of the Centers for Disease Control and Prevention, and a recommendation is considered to be for routine use if the recommendation is listed on the Immunization Schedules of the Centers for Disease Control and Prevention;\n(3) with respect to infants, children, and adolescents, evidence-informed preventive care and screenings provided for in comprehensive guidelines supported by the Health Resources and Services Administration;\n(4) with respect to women, additional preventive care and screenings that are not listed with a rating of A or B by the United States Preventive Services Task Force but that are provided for in comprehensive guidelines supported by the Health Resources and Services Administration;\n(5) all contraceptive methods established in guidelines published by the United States Food and Drug Administration;\n(6) screenings for human immunodeficiency virus for:\n(i) all individuals at least 15 years of age but less than 65 years of age; and\n(ii) all other individuals with increased risk of human immunodeficiency virus infection according to guidance from the Centers for Disease Control;\n(7) all preexposure prophylaxis when used for the prevention or treatment of human immunodeficiency virus, including but not limited to all preexposure prophylaxis, as defined in any guidance by the United States Preventive Services Task Force or the Centers for Disease Control, including the June 11, 2019, Preexposure Prophylaxis for the Prevention of HIV Infection United States Preventive Services Task Force Recommendation Statement; and\n(8) all postexposure prophylaxis when used for the prevention or treatment of human immunodeficiency virus, including but not limited to all postexposure prophylaxis as defined in any guidance by the United States Preventive Services Task Force or the Centers for Disease Control.\n(b) A health plan company must provide coverage for preventive items and services at a participating provider without imposing cost-sharing requirements, including a deductible, coinsurance, or co-payment. Nothing in this section prohibits a health plan company that has a network of providers from excluding coverage or imposing cost-sharing requirements for preventive items or services that are delivered by an out-of-network provider.\n(c) A health plan company is not required to provide coverage for any items or services specified in any recommendation or guideline described in paragraph (a) if the recommendation or guideline is no longer included as a preventive item or service as defined in paragraph (a). Annually, a health plan company must determine whether any additional items or services must be covered without cost-sharing requirements or whether any items or services are no longer required to be covered.\n(d) Nothing in this section prevents a health plan company from using reasonable medical management techniques to determine the frequency, method, treatment, or setting for a preventive item or service to the extent not specified in the recommendation or guideline.\n(e) A health plan shall not require prior authorization or step therapy for preexposure prophylaxis or postexposure prophylaxis, except that: if the United States Food and Drug Administration has approved one or more therapeutic equivalents of a drug, device, or product for the prevention of HIV, this paragraph does not require a health plan to cover all of the therapeutically equivalent versions without prior authorization or step therapy, if at least one therapeutically equivalent version is covered without prior authorization or step therapy.\n(f) This section does not apply to grandfathered plans.\n(g) This section does not apply to plans offered by the Minnesota Comprehensive Health Association.\n[See Note.]\n(a) A health plan company may impose cost-sharing requirements with respect to an office visit if a preventive item or service is billed separately or is tracked separately as individual encounter data from the office visit.\n(b) A health plan company must not impose cost-sharing requirements with respect to an office visit if a preventive item or service is not billed separately or is not tracked separately as individual encounter data from the office visit and the primary purpose of the office visit is the delivery of the preventive item or service.\n(c) A health plan company may impose cost-sharing requirements with respect to an office visit if a preventive item or service is not billed separately or is not tracked separately as individual encounter data from the office visit and the primary purpose of the office visit is not the delivery of the preventive item or service.\nNothing in this section prohibits a health plan company from providing coverage for preventive items and services in addition to those specified under subdivision 1, paragraph (a), or from denying coverage for preventive items and services that are not recommended as preventive items and services specified under subdivision 1, paragraph (a). A health plan company may impose cost-sharing requirements for a treatment not described under subdivision 1, paragraph (a), even if the treatment results from a preventive item or service described under subdivision 1, paragraph (a).",
	"repealed": false
}