{
	"id": "62Q.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.68",
	"title": "62Q.68 DEFINITIONS.",
	"text": "For purposes of sections 62Q.68 to 62Q.72, the terms defined in this section have the meanings given them. For purposes of sections 62Q.69 and 62Q.70, the term \"health plan company\" does not include an insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01 or a nonprofit health service plan corporation regulated under chapter 62C that only provides dental coverage or vision coverage. For purposes of sections 62Q.69 through 62Q.73, the term \"health plan company\" does not include the Comprehensive Health Association created under chapter 62E. Section 62Q.70 does not apply to individual coverage. However, a health plan company offering individual coverage may, pursuant to section 62Q.69, subdivision 3, paragraph (c), follow the process outlined in section 62Q.70.\n\"Complaint\" means any grievance against a health plan company that is not the subject of litigation and that has been submitted by a complainant to a health plan company regarding the provision of health services including, but not limited to, the scope of coverage for health care services; retrospective denials or limitations of payment for services; eligibility issues; denials, cancellations, or nonrenewals of coverage; administrative operations; and the quality, timeliness, and appropriateness of health care services rendered. If the complaint is from an applicant, the complaint must relate to the application. If the complaint is from a former enrollee, the complaint must relate to services received during the period of time the individual was an enrollee. Any grievance requiring a medical determination in its resolution must have the medical determination aspect of the complaint processed under the appeal procedure described in section 62M.06.\n\"Complainant\" means an enrollee, applicant, or former enrollee, or anyone acting on behalf of an enrollee, applicant, or former enrollee, who submits a complaint.",
	"repealed": false
}