{
	"id": "609.855",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.855",
	"title": "609.855 CRIMES INVOLVING TRANSIT; SHOOTING AT TRANSIT VEHICLE.",
	"text": "(a) A person is guilty of a petty misdemeanor who intentionally obtains or attempts to obtain service for himself, herself, or another person from a provider of public transit or from a public conveyance by doing any of the following:\n(1) occupies or rides in any public transit vehicle without paying the applicable fare or otherwise obtaining the consent of the transit provider including:\n(i) the use of a reduced fare when a person is not eligible for the fare; or\n(ii) the use of a fare medium issued solely for the use of a particular individual by another individual;\n(2) presents a falsified, counterfeit, photocopied, or other deceptively manipulated fare medium as fare payment or proof of fare payment;\n(3) sells, provides, copies, reproduces, or creates any version of any fare medium without the consent of the transit provider; or\n(4) puts or attempts to put any of the following into any fare box, pass reader, ticket vending machine, or other fare collection equipment of a transit provider:\n(i) papers, articles, instruments, or items other than fare media or currency; or\n(ii) a fare medium that is not valid for the place or time at, or the manner in, which it is used.\n(b) Where self-service barrier-free fare collection is utilized by a public transit provider, it is a violation of this subdivision to intentionally fail to exhibit proof of fare payment upon the request of an authorized transit representative when entering, riding upon, or leaving a transit vehicle or when present in a designated paid fare zone located in a transit facility.\n(c) A person who violates this subdivision must pay a fine of no more than $10.\n(a) Whoever intentionally commits an act that interferes with or obstructs, or tends to interfere with or obstruct, the operation of a transit vehicle is guilty of unlawful interference with a transit operator and may be sentenced as provided in paragraph (c).\n(b) An act that is committed on a transit vehicle that distracts the driver from the safe operation of the vehicle or that endangers passengers is a violation of this subdivision if an authorized transit representative has clearly warned the person once to stop the act.\n(c) A person who violates this subdivision may be sentenced as follows:\n(1) to imprisonment for not more than three years or to payment of a fine of not more than $5,000, or both, if the violation was accompanied by force or violence or a communication of a threat of force or violence; or\n(2) to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both, if the violation was not accompanied by force or violence or a communication of a threat of force or violence.\n(a) A person who throws or deposits litter while riding in a vehicle providing public transit service is guilty of a petty misdemeanor.\n(b) A person is guilty of a violation of this subdivision only if the person continues to act in violation of this subdivision after being warned once by an authorized transit representative to stop the conduct.\n(a) A person who performs any of the following while in a transit vehicle or at a transit facility is guilty of a misdemeanor:\n(1) smokes, as defined in section 144.413, subdivision 4;\n(2) urinates or defecates;\n(3) consumes an alcoholic beverage, as defined in section 340A.101, subdivision 2;\n(4) damages a transit vehicle or transit facility in a manner that meets the requirements for criminal damage to property in the fourth degree under section 609.595, subdivision 3, and is not otherwise a violation under section 609.595, subdivision 1, 1a, or 2;\n(5) performs vandalism, defacement, or placement of graffiti, as defined in section 617.90, subdivision 1; or\n(6) engages in disorderly conduct as specified in section 609.72, subdivision 1, clause (3).\n(b) A peace officer, as defined in section 626.84, subdivision 1, paragraph (c), may order a person to depart a transit vehicle or transit facility for a violation under paragraph (a).\n[Repealed, 1994 c 636 art 2 s 69]\nWhoever recklessly discharges a firearm at or in any portion of a public transit vehicle or facility is guilty of a felony and may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $6,000, or both. If the transit vehicle or facility is occupied by any person other than the offender, the person may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(a) At the sentencing on a violation of this section, the district court shall consider the extent to which the person's conduct has negatively disrupted the delivery of transit services or has affected the utilization of public transit services by others. The district court may, in its discretion, include as part of any sentence for a violation of this section, an order restraining the person from using public transit vehicles and facilities for a fixed period, not to exceed two years or any term of probation, whichever is longer.\n(b) The district court administrator shall forward copies of any orders, and any subsequent orders of the court rescinding or modifying the original order, promptly to the operator of the transit system on which the offense took place.\n(c) A person who violates an order issued under this subdivision is guilty of a gross misdemeanor.\n(a) The definitions in this subdivision apply in this section.\n(b) \"Public transportation\" or \"transit\" has the meaning given to \"public transportation\" in section 174.22, subdivision 7.\n(c) \"Public transit vehicle\" or \"transit vehicle\" means any vehicle used for the purpose of providing public transit, whether or not the vehicle is owned or operated by a public entity.\n(d) \"Public transit facilities\" or \"transit facilities\" means any vehicles, equipment, property, structures, stations, improvements, plants, parking or other facilities, or rights that are owned, leased, held, or used for the purpose of providing public transit, whether or not the facility is owned or operated by a public entity.\n(e) \"Fare medium\" means a ticket, smart card, pass, coupon, token, transfer, or other medium sold or distributed by a public transit provider, or its authorized agents, for use in gaining entry to or use of the public transit facilities or vehicles of the provider.\n(f) \"Proof of fare payment\" means a fare medium valid for the place or time at, or the manner in, which it is used. If using a reduced-fare medium, proof of fare payment also includes proper identification demonstrating a person's eligibility for the reduced fare. If using a fare medium issued solely for the use of a particular individual, proof of fare payment also includes an identification document bearing a photographic likeness of the individual and demonstrating that the individual is the person to whom the fare medium is issued.\n(g) \"Authorized transit representative\" means the person authorized by the transit provider to operate the transit vehicle, a peace officer, a transit official under section 473.4075, subdivision 1, or any other person designated by the transit provider as an authorized transit representative under this section.",
	"repealed": false
}