{
	"id": "354B.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.215",
	"title": "354B.215 TEACHERS RETIREMENT ASSOCIATION COVERAGE FOR EMPLOYEES WHO DID NOT RECEIVE ELECTION TO TRANSFER.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them, unless the context clearly indicates another meaning is intended.\n(b) \"Executive director\" means the executive director of the Teachers Retirement Association.\n(c) \"Individual retirement account plan\" means the individual retirement account plan governed by chapter 354B.\n(d) \"Maximum past service credit\" means service credit for the period beginning with the date the eligible person was first covered by the individual retirement account plan to the transfer date.\n(e) \"Minnesota State\" means the Minnesota State Colleges and Universities.\n(f) \"Transfer date\" means the date selected by the executive director under subdivision 5 for the purpose of preparing the estimates required by subdivision 5.\nNotwithstanding any provision of law to the contrary, an eligible person described in subdivision 3 is authorized to become a member of the Teachers Retirement Association and purchase service credit upon making an election under subdivision 6.\n(a) An eligible person is a person who:\n(1) is employed by Minnesota State;\n(2) has an account in the individual retirement account plan; and\n(3) satisfies paragraph (b).\n(b) A person satisfies this paragraph if Minnesota State is not able to produce at least one of the following items by the end of the 60-day period under subdivision 4, paragraph (b):\n(1) a record indicating that the person received notice regarding the person's eligibility to elect prospective coverage by the Teachers Retirement Association within the election period under section 354B.211, subdivision 4 or 6, or its predecessor;\n(2) a record that the person elected retirement coverage by the individual retirement account plan; or\n(3) other credible documentation demonstrating that the person was aware of the person's right to elect retirement coverage by the Teachers Retirement Association.\n(a) To elect coverage by the Teachers Retirement Association, an eligible person must submit a written application to the chancellor on a form provided by Minnesota State. The application must include:\n(1) an attestation that the person was not informed of the right to elect a transfer from the individual retirement account plan to the Teachers Retirement Association and the person was unaware of the right to elect such a transfer;\n(2) the date on which the person first became a participant in the individual retirement account plan;\n(3) a signed release authorizing Minnesota State to provide employment and other personnel information to the Teachers Retirement Association; and\n(4) any other information that Minnesota State may require.\n(b) No later than 60 days after receipt of the application under paragraph (a), Minnesota State must verify the information provided by the person in the application, determine whether the person is an eligible person under subdivision 3, and provide a written response to the person regarding the determination of eligibility. If Minnesota State determines that the person is not an eligible person, Minnesota State must include a copy of any documentation identified in subdivision 3, paragraph (b), in its written response to the person.\n(c) If Minnesota State determines that the person is an eligible person under subdivision 3, Minnesota State must forward to the executive director:\n(1) the application;\n(2) confirmation or modification of the information provided by the eligible person in the application;\n(3) salary history for the eligible person;\n(4) an estimate of the amount available for transfer from the eligible person's account in the individual retirement account plan to the Teachers Retirement Association; and\n(5) any other relevant information.\n(a) Upon receipt of the application and information under subdivision 4, the executive director must prepare estimates of the following as of a prospective transfer date selected by the executive director that is no later than 90 days after receiving the application and information under subdivision 4:\n(1) the purchase payment amount determined under section 356.551 to purchase the maximum past service credit;\n(2) the amount of service credit the eligible person would receive if the amount estimated under subdivision 4, paragraph (c), clause (4), is transferred to the Teachers Retirement Association and used to purchase service credit under section 356.551;\n(3) the purchase payment amount for additional years of service credit, if any, not to exceed the maximum past service credit; and\n(4) the offset amount attributable to the eligible person.\n(b) No later than 90 days after receiving the application and information under subdivision 4, the executive director must send a written communication to the eligible person with the amounts determined in paragraph (a) and inform Minnesota State of the offset amount. The executive director may charge the eligible person a reasonable fee to cover the costs of calculating the amounts required by paragraph (a).\n(c) Minnesota State must notify the eligible person and the executive director no later than 30 days after receiving notice of the offset amount from the executive director under paragraph (b) if there are sufficient funds in the IRAP to TRA transfer account to pay the full offset amount or, if there are not sufficient funds, the portion of the offset amount, if any, that will be paid.\n(a) No later than 60 days after the executive director sends the written communication required by subdivision 5, the eligible person may elect to transfer coverage from the individual retirement account plan to the Teachers Retirement Association effective as of the transfer date.\n(b) If the eligible person elects to transfer coverage under paragraph (a), the available balance in the eligible person's account in the individual retirement account plan must be transferred to the Teachers Retirement Association, not to exceed the amount required by the Teachers Retirement Association to purchase the maximum past service credit, as adjusted for the offset amount, if any.\n(c) If the available balance in the eligible person's account in the individual retirement account plan plus the offset amount, if any, is less than the amount needed to cover the cost to purchase the maximum past service credit, the eligible person must:\n(1) direct the transfer of funds from the eligible person's account in the higher education supplemental retirement plan established under chapter 354C, from a source specified in section 356.441, subdivision 1, or from more than one of the foregoing sources in an amount, in total, sufficient to cover the rest of the cost to purchase the maximum past service credit; or\n(2) elect fewer years or partial years of service credit corresponding to the amount of service credit that may be purchased using the funds transferred from the individual retirement account plan, the offset amount, and if directed by the eligible person, funds from any of the sources described in clause (1).\n(d) Minnesota State must promptly initiate the transfer of funds or work with the eligible person to initiate the transfer of funds to the Teachers Retirement Association from the eligible person's account in the individual retirement account plan and, if directed by the eligible person under paragraph (c), from any other account over which Minnesota State has the authority to initiate or approve transfers when directed by a participant.\n(e) Unless the balance in the IRAP to TRA transfer account is zero, Minnesota State must direct a transfer to the Teachers Retirement Association of an amount that is equal to the offset amount attributable to the eligible person. If the balance in the IRAP to TRA transfer account is less than the amount needed to transfer the offset amount, Minnesota State must direct a transfer of the remaining balance in the IRAP to TRA transfer account to the Teachers Retirement Association.\n(a) Upon receipt by the Teachers Retirement Association of the transfer or transfers under subdivision 6, the eligible person's membership in the Teachers Retirement Association commences effective as of the transfer date and the executive director must grant past service credit to the eligible person.\n(b) The executive director may adjust the amount of past service credit granted to the eligible person as necessary to ensure that the Teachers Retirement Association does not receive less than required to cover the cost of the past service credit granted.\n(c) Upon membership commencement, the eligible person ceases to be an active participant in the individual retirement account plan.\n(d) Upon membership commencement, the person's membership status is irrevocable. Neither Minnesota State nor the Teachers Retirement Association may seek to revoke the eligible person's membership status due to events, including but not limited to Minnesota State producing documentation that would have previously disqualified the person as an eligible person under subdivision 3.\nThe Teachers Retirement Association must grant service credit to the eligible person for all years or partial years of service with Minnesota State for the purpose of vesting in a retirement annuity under section 354.44 or in a retirement benefit under section 354.46 or 354.48.\nNo later than March 31, 2025, and periodically thereafter, Minnesota State must provide notice to all employees summarizing this section and offer assistance to any eligible person who wishes to elect to transfer coverage from the individual retirement account plan to the Teachers Retirement Association. Minnesota State must designate personnel responsible for assisting employees with the requirements of this section. The notice must identify these personnel and provide their contact information.\nThe chancellor and the executive director must submit an annual report to the Legislative Commission on Pensions and Retirement stating the number of employees who elected a transfer during the prior calendar year. Without identifying any eligible person, the report must include for each eligible person the total amount transferred by the eligible person from the eligible person's account in the individual retirement account plan and other sources to purchase past service credit and the offset amount, if any. The report must be submitted to the Legislative Commission on Pensions and Retirement no later than January 31 of each year.\n(a) The IRAP to TRA transfer account is created in the special revenue fund.\n(b) Minnesota State must use the money in the IRAP to TRA transfer account established under paragraph (a) to transfer amounts required by subdivision 6, paragraph (e), until the balance in the account is zero.",
	"repealed": false
}