{
	"id": "66A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.35",
	"title": "66A.35 GUARANTY FUNDS.",
	"text": "(a) A domestic mutual life insurance company may be formed with, or an existing domestic mutual life insurance company may establish, a guaranty fund divided into certificates of $10 each, or multiples thereof, and this guaranty fund shall be invested in the same manner as is provided for the investment of capital stock of insurance companies.\n(b) The certificate holders of the guaranty fund are entitled to an annual dividend of not more than ten percent on their respective certificates, if the net profits or unused premiums left after all losses, expenses, or liabilities then incurred, with reserves for reinsurance, are provided for, are sufficient to pay the annual dividend. If the dividends in any one year are less than ten percent, the difference may be made up in any subsequent year or years from the net profits. Approval of the commissioner must be obtained before accrual for or payment of the dividend, or any repayment of principal.\n(c) The guaranty fund must be applied to the payment of losses and expenses when necessary, and, if the guaranty fund is impaired, the directors may make good the whole or any part of the impairment from future profits of the company, but no dividend shall be paid on guaranty fund certificates while the guaranty fund is impaired. The holder of the guaranty fund certificate is not liable for any more than the amount of the certificate which has not been paid in, and this amount must be plainly and legibly stated on the face of the certificate.\n(d) Notwithstanding any other provision of law, each certificate holder of record is entitled to one vote in person or by proxy in any meeting of the members of the company for each $10 investment in guaranty fund certificates.\n(e) The guaranty fund may be reduced or retired by vote of the policyholders of the company and the assent of the commissioner, if the net assets of the company above its reinsurance reserve and all other claims and obligations and the amount of its guaranty fund certificates and interest on the certificates for two years last preceding and including the date of its last annual statement are not less than 50 percent of the premiums in force. Due notice of this proposed action on the part of the company shall be mailed to each policyholder of the company not less than 30 days before the meeting when the action may be taken.\n(f) In domestic mutual life insurance companies with a guaranty fund, the certificate holders shall be entitled to choose and elect from among their own number or from among the policyholders at least one-half or more of the total number of directors.\n(g) If any domestic mutual life insurance company with a guaranty fund ceases to do business, it shall not divide among its certificate holders any part of its assets or guaranty fund until all its debts and obligations have been paid or canceled.\n(h) Foreign mutual life insurance companies having a guaranty fund shall not be required to make their certificate of guaranty fund conform to the provisions of this section, but when the certificates do not conform with this section, the amount of the guaranty fund shall be charged as a liability.",
	"repealed": false
}