{
	"id": "62A.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.095",
	"title": "62A.095 SUBROGATION CLAUSES REGULATED.",
	"text": "(a) A health plan may not be offered, sold, or issued to a resident of this state, or to cover a resident of this state, unless the health plan complies with subdivision 2.\n(b) Health plans providing benefits under health care programs administered by the commissioner of human services are not subject to the limits described in subdivision 2 but are subject to the right of subrogation provisions under section 256B.37 and the lien provisions under section 256.015; 256B.042; Minnesota Statutes 2010, section 256D.03, subdivision 8; or 256L.03, subdivision 6.\nFor purposes of this section, \"health plan\" includes coverage that is excluded under section 62A.011, subdivision 3, clauses (4), (6), (7), (8), (9), and (10).\nNo health plan described in subdivision 1 shall contain a subrogation, reimbursement, or similar clause that provides subrogation, reimbursement, or similar rights to the health carrier issuing the health plan, unless:\n(1) the clause provides that it applies only after the covered person has received a full recovery from another source; and\n(2) the clause provides that the health carrier's subrogation right is subject to subtraction for actual monies paid to account for the pro rata share of the covered person's costs, disbursements, and reasonable attorney fees, and other expenses incurred in obtaining the recovery from another source unless the health carrier is separately represented by an attorney.\nIf the health carrier is separately represented by an attorney, the health carrier and the covered person, by their attorneys, may enter into an agreement regarding allocation of the covered person's costs, disbursements, and reasonable attorney fees and other expenses. If the health carrier and covered person cannot reach agreement on allocation, the health carrier and covered person shall submit the matter to binding arbitration.\nNothing in this section shall limit a health carrier's right to recovery from another source which may otherwise exist at law.\nFor the purposes of this section, full recovery does not include payments made by a health plan to or for the benefit of a covered person.\nNo addition of, or amendment of, a subrogation, reimbursement, or similar clause in a health plan shall be applied to the disadvantage of a covered person with respect to benefits provided by the health carrier in connection with an injury, illness, condition, or other covered situation that originated prior to the addition of or amendment to the clause.",
	"repealed": false
}