{
	"id": "116.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.07",
	"title": "116.07 POWERS AND DUTIES.",
	"text": "In addition to any powers or duties otherwise prescribed by law and without limiting the same, the Pollution Control Agency shall have the powers and duties hereinafter specified.\n(a) The Pollution Control Agency shall improve air quality by promoting, in the most practicable way possible, the use of energy sources and waste disposal methods which produce or emit the least air contaminants consistent with the agency's overall goal of reducing all forms of pollution. The agency shall also adopt standards of air quality, including maximum allowable standards of emission of air contaminants from motor vehicles, recognizing that due to variable factors, no single standard of purity of air is applicable to all areas of the state. In adopting standards the Pollution Control Agency shall give due recognition to the fact that the quantity or characteristics of air contaminants or the duration of their presence in the atmosphere, which may cause air pollution in one area of the state, may cause less or not cause any air pollution in another area of the state, and it shall take into consideration in this connection such factors, including others which it may deem proper, as existing physical conditions, zoning classifications, topography, prevailing wind directions and velocities, and the fact that a standard of air quality which may be proper as to an essentially residential area of the state, may not be proper as to a highly developed industrial area of the state. Such standards of air quality shall be premised upon scientific knowledge of causes as well as effects based on technically substantiated criteria and commonly accepted practices. No local government unit shall set standards of air quality which are more stringent than those set by the Pollution Control Agency.\n(b) The Pollution Control Agency shall promote solid waste disposal control by encouraging the updating of collection systems, elimination of open dumps, and improvements in incinerator practices. The agency shall also adopt standards for the control of the collection, transportation, storage, processing, and disposal of solid waste and sewage sludge for the prevention and abatement of water, air, and land pollution, recognizing that due to variable factors, no single standard of control is applicable to all areas of the state. In adopting standards, the Pollution Control Agency shall give due recognition to the fact that elements of control which may be reasonable and proper in densely populated areas of the state may be unreasonable and improper in sparsely populated or remote areas of the state, and it shall take into consideration in this connection such factors, including others which it may deem proper, as existing physical conditions, topography, soils and geology, climate, transportation, and land use. Such standards of control shall be premised on technical criteria and commonly accepted practices.\n(c) The Pollution Control Agency shall also adopt standards describing the maximum levels of noise in terms of sound pressure level which may occur in the outdoor atmosphere, recognizing that due to variable factors no single standard of sound pressure is applicable to all areas of the state. Such standards shall give due consideration to such factors as the intensity of noises, the types of noises, the frequency with which noises recur, the time period for which noises continue, the times of day during which noises occur, and such other factors as could affect the extent to which noises may be injurious to human health or welfare, animal or plant life, or property, or could interfere unreasonably with the enjoyment of life or property. In adopting standards, the Pollution Control Agency shall give due recognition to the fact that the quantity or characteristics of noise or the duration of its presence in the outdoor atmosphere, which may cause noise pollution in one area of the state, may cause less or not cause any noise pollution in another area of the state, and it shall take into consideration in this connection such factors, including others which it may deem proper, as existing physical conditions, zoning classifications, topography, meteorological conditions and the fact that a standard which may be proper in an essentially residential area of the state, may not be proper as to a highly developed industrial area of the state. Such noise standards shall be premised upon scientific knowledge as well as effects based on technically substantiated criteria and commonly accepted practices. No local governing unit shall set standards describing the maximum levels of sound pressure which are more stringent than those set by the Pollution Control Agency.\n(d) The Pollution Control Agency shall adopt standards for the identification of hazardous waste and for the management, identification, labeling, classification, storage, collection, transportation, processing, and disposal of hazardous waste, recognizing that due to variable factors, a single standard of hazardous waste control may not be applicable to all areas of the state. In adopting standards, the Pollution Control Agency shall recognize that elements of control which may be reasonable and proper in densely populated areas of the state may be unreasonable and improper in sparsely populated or remote areas of the state. The agency shall consider existing physical conditions, topography, soils, and geology, climate, transportation and land use. Standards of hazardous waste control shall be premised on technical knowledge, and commonly accepted practices. Hazardous waste generator licenses may be issued for a term not to exceed five years. No local government unit shall set standards of hazardous waste control which are in conflict or inconsistent with those set by the Pollution Control Agency.\n(e) A person who generates less than 100 kilograms of hazardous waste per month is exempt from the following agency hazardous waste rules:\n(1) rules relating to transportation, manifesting, storage, and labeling for photographic fixer and x-ray negative wastes that are hazardous solely because of silver content; and\n(2) any rule requiring the generator to send to the agency or commissioner a copy of each manifest for the transportation of hazardous waste for off-site treatment, storage, or disposal, except that counties within the metropolitan area may require generators to provide manifests.\nNothing in this paragraph exempts the generator from the agency's rules relating to on-site accumulation or outdoor storage. A political subdivision or other local unit of government may not adopt management requirements that are more restrictive than this paragraph.\n(f) In any rulemaking proceeding under chapter 14 to adopt standards for air quality, solid waste, or hazardous waste under this chapter, or standards for water quality under chapter 115, the statement of need and reasonableness must include:\n(1) an assessment of any differences between the proposed rule and:\n(i) existing federal standards adopted under the Clean Air Act, United States Code, title 42, section 7412(b)(2); the Clean Water Act, United States Code, title 33, sections 1312(a) and 1313(c)(4); and the Resource Conservation and Recovery Act, United States Code, title 42, section 6921(b)(1);\n(ii) similar standards in states bordering Minnesota; and\n(iii) similar standards in states within the Environmental Protection Agency Region 5; and\n(2) a specific analysis of the need and reasonableness of each difference.\n(a) No standards adopted by any state agency for limiting levels of noise in terms of sound pressure which may occur in the outdoor atmosphere shall apply to:\n(1) segments of trunk highways constructed with federal interstate substitution money, provided that all reasonably available noise mitigation measures are employed to abate noise;\n(2) an existing or newly constructed segment of a highway, provided that all reasonably available noise mitigation measures, as approved by the commissioners of the Department of Transportation and Pollution Control Agency, are employed to abate noise;\n(3) except for the cities of Minneapolis and St. Paul, an existing or newly constructed segment of a road, street, or highway under the jurisdiction of a road authority of a town, statutory or home rule charter city, or county, except for roadways for which full control of access has been acquired;\n(4) skeet, trap or shooting sports clubs; or\n(5) motor vehicle race events conducted at a facility specifically designed for that purpose that was in operation on or before July 1, 1996.\n(b) Nothing herein shall prohibit a local unit of government or a public corporation with the power to make rules for the government of its real property from regulating the location and operation of skeet, trap or shooting sports clubs, or motor vehicle race events conducted at a facility specifically designed for that purpose that was in operation on or before July 1, 1996.\n(a) A person who generates waste containing greater than 50 parts per million PCB which is subject to the federal requirements for the management of waste under Code of Federal Regulations, title 40, part 761, is also subject to state hazardous waste requirements for proper disposal, licensing, and fees. PCB small capacitors and lighting ballasts are also subject to state on-site accumulation requirements.\n(b) PCB waste associated with oil-filled electric equipment voluntarily disposed of or retrofilled prior to the end of its service life is eligible for a waiver from annual hazardous waste fees. To be eligible for the waiver, a generator and the commissioner must execute a voluntary PCB phase-out agreement, and before relicensing, the generator must demonstrate performance of the agreement. The PCB phase-out agreement must include a description of specific goals, activities to be performed to achieve the goals, phase-out criteria, and a schedule for implementation.\n(c) For the purpose of this subdivision, \"PCB\" has the meaning given in section 116.36.\n(a) A temporary storage facility located at a commodity facility that is required to be controlled under Minnesota Rules, part 7011.1005, subpart 3, is not subject to Minnesota Rules, parts 7011.1000 to 7011.1015. For all portable equipment and fugitive dust emissions directly associated with the temporary storage facility, it is determined that there is no applicable specific standard of performance.\n(b) For the purposes of this subdivision, the following terms have the meanings given to them:\n(1) \"temporary storage facility\" means a facility storing grain that:\n(i) uses an asphalt, concrete, or comparable base material;\n(ii) has rigid, self-supporting sidewalls;\n(iii) provides adequate aeration; and\n(iv) provides an acceptable covering; and\n(2) \"portable equipment\" means equipment that is not fixed at any one spot and can be moved, including but not limited to portable receiving pits, portable augers and conveyors, and portable reclaim equipment directly associated with the temporary storage facility.\nPursuant and subject to the provisions of chapter 14, and the provisions hereof, the Pollution Control Agency may adopt, amend, and rescind rules governing its own administration and procedure and its staff and employees.\n(a) Pursuant and subject to the provisions of chapter 14, and the provisions hereof, the Pollution Control Agency may adopt, amend and rescind rules and standards having the force of law relating to any purpose within the provisions of Laws 1967, chapter 882, for the prevention, abatement, or control of air pollution. Any such rule or standard may be of general application throughout the state, or may be limited as to times, places, circumstances, or conditions in order to make due allowance for variations therein. Without limitation, rules or standards may relate to sources or emissions of air contamination or air pollution, to the quality or composition of such emissions, or to the quality of or composition of the ambient air or outdoor atmosphere or to any other matter relevant to the prevention, abatement, or control of air pollution.\n(b) Pursuant and subject to the provisions of chapter 14, and the provisions hereof, the Pollution Control Agency may adopt, amend, and rescind rules and standards having the force of law relating to any purpose within the provisions of Laws 1969, chapter 1046, for the collection, transportation, storage, processing, and disposal of solid waste and the prevention, abatement, or control of water, air, and land pollution which may be related thereto, and the deposit in or on land of any other material that may tend to cause pollution. The agency shall adopt such rules and standards for sewage sludge, addressing the intrinsic suitability of land, the volume and rate of application of sewage sludge of various degrees of intrinsic hazard, design of facilities, and operation of facilities and sites. Any such rule or standard may be of general application throughout the state or may be limited as to times, places, circumstances, or conditions in order to make due allowance for variations therein. Without limitation, rules or standards may relate to collection, transportation, processing, disposal, equipment, location, procedures, methods, systems or techniques or to any other matter relevant to the prevention, abatement or control of water, air, and land pollution which may be advised through the control of collection, transportation, processing, and disposal of solid waste and sewage sludge, and the deposit in or on land of any other material that may tend to cause pollution. By January 1, 1983, the rules for the management of sewage sludge shall include an analysis of the sewage sludge determined by the commissioner of agriculture to be necessary to meet the soil amendment labeling requirements of section 18C.215.\n(c) The rules for the disposal of solid waste shall include site-specific criteria to prohibit solid waste disposal based on the area's sensitivity to groundwater contamination, including site-specific testing. The rules shall provide criteria for locating landfills based on a site's sensitivity to groundwater contamination. Sensitivity to groundwater contamination is based on the predicted minimum time of travel of groundwater contaminants from the solid waste to the compliance boundary. The rules shall prohibit landfills in areas where karst is likely to develop. The rules shall specify testable or otherwise objective thresholds for these criteria. The rules shall also include modifications to financial assurance requirements under subdivision 4h that ensure the state is protected from financial responsibility for future groundwater contamination. The modifications to the financial assurance rules specified in this paragraph must require that a solid waste disposal facility subject to them maintain financial assurance so long as the facility poses a potential environmental risk to human health, wildlife, or the environment, as determined by the agency following an empirical assessment. The financial assurance and siting modifications to the rules specified in this paragraph do not apply to:\n(1) solid waste facilities initially permitted before January 1, 2011, including future contiguous expansions and noncontiguous expansions within 600 yards of a permitted boundary;\n(2) solid waste disposal facilities that accept only construction and demolition debris and incidental nonrecyclable packaging, and facilities that accept only industrial waste that is limited to wood, concrete, porcelain fixtures, shingles, or window glass resulting from the manufacture of construction materials; and\n(3) requirements for permit by rule solid waste disposal facilities.\n(d) Until the rules are modified as provided in paragraph (c) to include site-specific criteria to prohibit areas from solid waste disposal due to groundwater contamination sensitivity, as required under this section, the agency shall not issue a permit for a new solid waste disposal facility, except for:\n(1) the reissuance of a permit for a land disposal facility operating as of March 1, 2008;\n(2) a permit to expand a land disposal facility operating as of March 1, 2008, beyond its permitted boundaries, including expansion on land that is not contiguous to, but is located within 600 yards of, the land disposal facility's permitted boundaries;\n(3) a permit to modify the type of waste accepted at a land disposal facility operating as of March 1, 2008;\n(4) a permit to locate a disposal facility that accepts only construction debris as defined in section 115A.03, subdivision 7;\n(5) a permit to locate a disposal facility that:\n(i) accepts boiler ash from an electric energy power plant that has wet scrubbed units or has units that have been converted from wet scrubbed units to dry scrubbed units as those terms are defined in section 216B.68;\n(ii) is on land that was owned on May 1, 2008, by the utility operating the electric energy power plant; and\n(iii) is located within three miles of the existing ash disposal facility for the power plant; or\n(6) a permit to locate a new solid waste disposal facility for ferrous metallic minerals regulated under Minnesota Rules, chapter 6130, or for nonferrous metallic minerals regulated under Minnesota Rules, chapter 6132.\n(e) Pursuant and subject to the provisions of chapter 14, and the provisions hereof, the Pollution Control Agency may adopt, amend and rescind rules and standards having the force of law relating to any purpose within the provisions of Laws 1971, chapter 727, for the prevention, abatement, or control of noise pollution. Any such rule or standard may be of general application throughout the state, or may be limited as to times, places, circumstances or conditions in order to make due allowances for variations therein. Without limitation, rules or standards may relate to sources or emissions of noise or noise pollution, to the quality or composition of noises in the natural environment, or to any other matter relevant to the prevention, abatement, or control of noise pollution.\n(f) As to any matters subject to this chapter, local units of government may set emission regulations with respect to stationary sources which are more stringent than those set by the Pollution Control Agency.\n(g) Pursuant to chapter 14, the Pollution Control Agency may adopt, amend, and rescind rules and standards having the force of law relating to any purpose within the provisions of this chapter for generators of hazardous waste, the management, identification, labeling, classification, storage, collection, treatment, transportation, processing, and disposal of hazardous waste and the location of hazardous waste facilities. A rule or standard may be of general application throughout the state or may be limited as to time, places, circumstances, or conditions. In implementing its hazardous waste rules, the Pollution Control Agency shall give high priority to providing planning and technical assistance to hazardous waste generators. The agency shall assist generators in investigating the availability and feasibility of both interim and long-term hazardous waste management methods. The methods shall include waste reduction, waste separation, waste processing, resource recovery, and temporary storage.\n(h) The Pollution Control Agency shall give highest priority in the consideration of permits to authorize disposal of diseased shade trees by open burning at designated sites to evidence concerning economic costs of transportation and disposal of diseased shade trees by alternative methods.\n(a) The Pollution Control Agency may issue, continue in effect or deny permits, under such conditions as it may prescribe for the prevention of pollution, for the emission of air contaminants, or for the installation or operation of any emission facility, air contaminant treatment facility, treatment facility, potential air contaminant storage facility, or storage facility, or any part thereof, or for the sources or emissions of noise pollution.\n(b) The Pollution Control Agency may also issue, continue in effect or deny permits, under such conditions as it may prescribe for the prevention of pollution, for the storage, collection, transportation, processing, or disposal of waste, or for the installation or operation of any system or facility, or any part thereof, related to the storage, collection, transportation, processing, or disposal of waste.\n(c) The agency may not issue a permit to a facility without analyzing and considering the cumulative levels and effects of past and current environmental pollution from all sources on the environment and residents of the geographic area within which the facility's emissions are likely to be deposited, provided that the facility is located in a community in a city of the first class in Hennepin County that meets all of the following conditions:\n(1) is within a half mile of a site designated by the federal government as an EPA superfund site due to residential arsenic contamination;\n(2) a majority of the population are low-income persons of color and American Indians;\n(3) a disproportionate percent of the children have childhood lead poisoning, asthma, or other environmentally related health problems;\n(4) is located in a city that has experienced numerous air quality alert days of dangerous air quality for sensitive populations between February 2007 and February 2008; and\n(5) is located near the junctions of several heavily trafficked state and county highways and two one-way streets which carry both truck and auto traffic.\n(d) The Pollution Control Agency may revoke or modify any permit issued under this subdivision and section 116.081 whenever it is necessary, in the opinion of the agency, to prevent or abate pollution.\n(e) The Pollution Control Agency has the authority for approval over the siting, expansion, or operation of a solid waste facility with regard to environmental issues. However, the agency's issuance of a permit does not release the permittee from any liability, penalty, or duty imposed by any applicable county ordinances. Nothing in this chapter precludes, or shall be construed to preclude, a county from enforcing land use controls, regulations, and ordinances existing at the time of the permit application and adopted pursuant to Minnesota Statutes 2020, sections 366.10 to 366.181, or sections 394.21 to 394.37, or 462.351 to 462.365, with regard to the siting, expansion, or operation of a solid waste facility.\n(f) Except as prohibited by federal law, a person may commence construction, reconstruction, replacement, or modification of any facility prior to the issuance of a construction permit by the agency.\n(a) Except as otherwise provided in sections 115A.18 to 115A.30, the agency shall commence any environmental review required under chapter 116D within 120 days of its acceptance of a completed permit application. The agency shall respond to a permit application for a hazardous waste facility within 120 days following a decision not to prepare environmental documents or following the acceptance of a negative declaration notice or an environmental impact statement. Except as otherwise provided in sections 115A.18 to 115A.30, within 60 days following the submission of a final permit application for a hazardous waste facility, unless a time extension is agreed to by the applicant, the agency shall issue or deny all permits needed for the construction of the proposed facility.\n(b) The agency shall promulgate rules pursuant to chapter 14 for all hazardous waste facilities. The rules shall require:\n(1) contingency plans for all hazardous waste facilities which provide for effective containment and control in any emergency condition;\n(2) the establishment of a mechanism to assure that money to cover the costs of closure and postclosure monitoring and maintenance of hazardous waste facilities will be available;\n(3) the maintenance of liability insurance by the owner or operator of hazardous waste facilities during the operating life of the facility.\n[Repealed, 1983 c 373 s 72]\n(a) The agency may collect permit fees in amounts not greater than those necessary to cover the reasonable costs of developing, reviewing, and acting upon applications for agency permits and implementing and enforcing the conditions of the permits pursuant to agency rules. Permit fees shall not include the costs of litigation. The fee schedule must reflect reasonable and routine direct and indirect costs associated with permitting, implementation, and enforcement. The agency may impose an additional enforcement fee to be collected for a period of up to two years to cover the reasonable costs of implementing and enforcing the conditions of a permit under the rules of the agency. Any money collected under this paragraph shall be deposited in the environmental fund.\n(b) Notwithstanding paragraph (a), the agency shall collect an annual fee from the owner or operator of all stationary sources, emission facilities, emissions units, air contaminant treatment facilities, treatment facilities, potential air contaminant storage facilities, or storage facilities subject to a notification, permit, or license requirement under this chapter, subchapters I and V of the federal Clean Air Act, United States Code, title 42, section 7401 et seq., or rules adopted thereunder. The annual fee shall be used to pay for all direct and indirect reasonable costs, including legal costs, required to develop and administer the notification, permit, or license program requirements of this chapter, subchapters I and V of the federal Clean Air Act, United States Code, title 42, section 7401 et seq., or rules adopted thereunder. Those costs include the reasonable costs of reviewing and acting upon an application for a permit; implementing and enforcing statutes, rules, and the terms and conditions of a permit; emissions, ambient, and deposition monitoring; preparing generally applicable regulations; responding to federal guidance; modeling, analyses, and demonstrations; preparing inventories and tracking emissions; and providing information to the public about these activities.\n(c) The agency shall set fees that:\n(1) will result in the collection, in the aggregate, from the sources listed in paragraph (b), of an amount not less than $25 per ton of each volatile organic compound; pollutant regulated under United States Code, title 42, section 7411 or 7412 (section 111 or 112 of the federal Clean Air Act); and each pollutant, except carbon monoxide, for which a national primary ambient air quality standard has been promulgated;\n(2) may result in the collection, in the aggregate, from the sources listed in paragraph (b), of an amount not less than $25 per ton of each pollutant not listed in clause (1) that is regulated under this chapter or air quality rules adopted under this chapter; and\n(3) shall collect, in the aggregate, from the sources listed in paragraph (b), the amount needed to match grant funds received by the state under United States Code, title 42, section 7405 (section 105 of the federal Clean Air Act).\nThe agency must not include in the calculation of the aggregate amount to be collected under clauses (1) and (2) any amount in excess of 4,000 tons per year of each air pollutant from a source. The increase in air permit fees to match federal grant funds shall be a surcharge on existing fees. The commissioner may not collect the surcharge after the grant funds become unavailable. In addition, the commissioner shall use nonfee funds to the extent practical to match the grant funds so that the fee surcharge is minimized.\n(d) To cover the reasonable costs described in paragraph (b), the agency shall provide in the rules promulgated under paragraph (c) for an increase in the fee collected in each year by the percentage, if any, by which the Consumer Price Index for the most recent calendar year ending before the beginning of the year the fee is collected exceeds the Consumer Price Index for the calendar year 1989. For purposes of this paragraph the Consumer Price Index for any calendar year is the average of the Consumer Price Index for all-urban consumers published by the United States Department of Labor, as of the close of the 12-month period ending on August 31 of each calendar year. The revision of the Consumer Price Index that is most consistent with the Consumer Price Index for calendar year 1989 shall be used.\n(e) Any money collected under paragraphs (b) to (d) must be deposited in the environmental fund and must be used solely for the activities listed in paragraph (b).\n(f) Permit applicants who wish to construct, reconstruct, or modify a project may offer to reimburse the agency for the costs of staff time or consultant services needed to expedite the preapplication process and permit development process through the final decision on the permit, including the analysis of environmental review documents. The reimbursement shall be in addition to permit application fees imposed by law. When the agency determines that it needs additional resources to develop the permit application in an expedited manner, and that expediting the development is consistent with permitting program priorities, the agency may accept the reimbursement. The commissioner must give the applicant an estimate of costs to be incurred by the commissioner. The estimate must include a brief description of the tasks to be performed, a schedule for completing the tasks, and the estimated cost for each task. The applicant and the commissioner must enter into a written agreement detailing the estimated costs for the expedited permit decision-making process to be incurred by the agency. The agreement must also identify staff anticipated to be assigned to the project. The commissioner must not issue a permit until the applicant has paid all fees in full. The commissioner must refund any unobligated balance of fees paid. Reimbursements accepted by the agency are appropriated to the agency for the purpose of developing the permit or analyzing environmental review documents. Reimbursement by a permit applicant shall precede and not be contingent upon issuance of a permit; shall not affect the agency's decision on whether to issue or deny a permit, what conditions are included in a permit, or the application of state and federal statutes and rules governing permit determinations; and shall not affect final decisions regarding environmental review.\n(g) The fees under this subdivision are exempt from section 16A.1285.\nWhen the agency issues a permit for a facility for the processing of hazardous waste, the agency may approve as a condition of the permit an agreement by which the permittee indemnifies the generators of hazardous waste accepted by the facility for part or all of any liability which may accrue to the generators as a result of a release or threatened release of a hazardous waste from the facility. The agency may approve an agreement under this subdivision only if the agency determines that the permittee has demonstrated financial responsibility to carry out the agreement during the term of the permit. If a generator of hazardous waste accepted by a permitted processing facility is held liable for costs or damages arising out of a release of a hazardous waste from the facility, and the permittee is subject to an agreement approved under this subdivision, the generator is liable to the extent that the costs or damages were not paid under this agreement.\nAn operator or owner of a facility is responsible for closure of the facility and postclosure care relating to the facility. If an owner or operator has failed to provide the required closure or postclosure care of the facility the agency may take the actions. The owner or operator is liable for the costs of the required closure and postclosure care taken by the agency.\nThe agency shall adopt rules establishing requirements for the closure of solid waste disposal facilities and for the postclosure care of closed facilities. The rules apply to all solid waste disposal facilities in operation at the time the rules are effective. The rules must provide standards and procedures for closing disposal facilities and for the care, maintenance, and monitoring of the facilities after closure that will prevent, mitigate, or minimize the threat to public health and the environment posed by closed disposal facilities.\n(a) The agency shall adopt rules requiring the operator or owner of a solid waste disposal facility to submit to the agency proof of the operator's or owner's financial capability to provide reasonable and necessary response during the operating life of the facility and for 30 years after closure for a mixed municipal solid waste disposal facility or for a minimum of 20 years after closure, as determined by agency rules, for any other solid waste disposal facility, and to provide for the closure of the facility and postclosure care required under agency rules. Proof of financial responsibility is required of the operator or owner of a facility receiving an original permit or a permit for expansion after adoption of the rules. Within 180 days of the effective date of the rules or by July 1, 1987, whichever is later, proof of financial responsibility is required of an operator or owner of a facility with a remaining capacity of more than five years or 500,000 cubic yards that is in operation at the time the rules are adopted. Compliance with the rules and the requirements of paragraph (b) is a condition of obtaining or retaining a permit to operate the facility.\n(b) A municipality, as defined in section 475.51, subdivision 2, including a sanitary district, that owns or operates a solid waste disposal facility that was in operation on May 15, 1989, may meet its financial responsibility for all or a portion of the contingency action portion of the reasonable and necessary response costs at the facility by pledging its full faith and credit to meet its responsibility. The pledge must be made in accordance with the requirements in chapter 475 for issuing bonds of the municipality, and the following additional requirements:\n(1) The governing body of the municipality shall enact an ordinance that clearly accepts responsibility for the costs of contingency action at the facility and that reserves, during the operating life of the facility and for the time period required in paragraph (a) after closure, a portion of the debt limit of the municipality, as established under section 475.53 or other law, that is equal to the total contingency action costs.\n(2) The municipality shall require that all collectors that haul to the facility implement a plan for reducing solid waste by using volume-based pricing, recycling incentives, or other means.\n(3) When a municipality opts to meet a portion of its financial responsibility by relying on its authority to issue bonds, it shall also begin setting aside in a dedicated long-term care trust fund money that will cover a portion of the potential contingency action costs at the facility, the amount to be determined by the agency for each facility based on at least the amount of waste deposited in the disposal facility each year, and the likelihood and potential timing of conditions arising at the facility that will necessitate response action. The agency may not require a municipality to set aside more than five percent of the total cost in a single year.\n(4) A municipality shall have and consistently maintain an investment grade bond rating as a condition of using bonding authority to meet financial responsibility under this section.\n(5) The municipality shall file with the commissioner of revenue its consent to have the amount of its contingency action costs deducted from state aid payments otherwise due the municipality and paid instead to the remediation fund created in section 116.155, if the municipality fails to conduct the contingency action at the facility when ordered by the agency. If the agency notifies the commissioner that the municipality has failed to conduct contingency action when ordered by the agency, the commissioner shall deduct the amounts indicated by the agency from the state aids in accordance with the consent filed with the commissioner.\n(6) The municipality shall file with the agency written proof that it has complied with the requirements of this paragraph.\n(c) The method for proving financial responsibility under paragraph (b) may not be applied to a new solid waste disposal facility or to expansion of an existing facility, unless the expansion is a vertical expansion. Vertical expansions of qualifying existing facilities cannot be permitted for a duration of longer than three years.\n(d) The commissioner shall consult with the commissioner of management and budget for guidance on the forms of financial assurance that are acceptable for private owners and public owners, and in carrying out a periodic review of the adequacy of financial assurance for solid waste disposal facilities. Financial assurance rules shall allow financial mechanisms to public owners of solid waste disposal facilities that are appropriate to their status as subdivisions of the state.\nThe civil penalties of sections 115.071 and 116.072 apply to any person in violation of the rules adopted under subdivision 4g or 4h.\n(a) The agency may not issue a permit for new or additional capacity for a mixed municipal solid waste resource recovery or disposal facility as defined in section 115A.03 unless each county using or projected in the permit to use the facility has in place a solid waste management plan approved under section 115A.46 or 473.803 and amended as required by section 115A.96, subdivision 6. The agency shall issue the permit only if the capacity of the facility is consistent with the needs for resource recovery or disposal capacity identified in the approved plan or plans. Consistency must be determined by the Pollution Control Agency. Plans approved before January 1, 1990, need not be revised if the capacity sought in the permit is consistent with the approved plan or plans.\n(b) The agency shall require as part of the permit application for a waste incineration facility identification of preliminary plans for ash management and ash leachate treatment or ash utilization. The permit issued by the agency must include requirements for ash management and ash leachate treatment.\n(c) Within 180 days of receipt of a completed application, the agency shall approve, disapprove, or delay decision on the application, with reasons for the delay, in writing.\n(d) The agency may not issue a permit for a new disposal facility, as defined in section 115A.03, subdivision 10, or a permit to expand an existing disposal facility unless:\n(1) all local units of government in which the facility is to be sited and exercising their respective land use and zoning authority pursuant to chapter 366, 494, or 462 have granted approval for and provided any required public notices of the new or expanded facility prior to the issuance of the permit;\n(2) all local units of government in which the facility is to be sited and exercising their respective land use and zoning authority pursuant to chapter 366, 494, or 462 have authorized the permit to be issued prior to or concurrent with the required approval by the local unit of government; or\n(3) the new or expanded facility is part of and will be sited on land already identified in an approved solid waste management plan as described in paragraph (a).\n(e) The commissioners of the Pollution Control Agency and natural resources shall apply Minnesota Rules, parts 7001.3050, subpart 3, item G, and 7035.2525, subpart 2, item G, to solid waste facilities permitted under and in compliance with those rules and in compliance with Minnesota Rules, chapter 6132.\n(a) The agency shall adopt rules to require the owner or operator of a solid waste disposal facility or resource recovery facility to submit to the agency and to each county using or projected to use the facility a management plan for the separation of household hazardous waste and other problem materials from solid waste prior to disposal or processing and for the proper management of the waste. The rules must require that the plan be developed in coordination with each county using, or projected to use, the facility. The plan must not be inconsistent with the plan developed under section 115A.956, subdivision 2, and must include:\n(1) identification of materials that are problem materials, as defined in section 115A.03, subdivision 24e, for the facility;\n(2) participation in public education activities on management of household hazardous waste and other problem materials in the facility's service area;\n(3) a strategy for reduction of household hazardous waste and other problem materials entering the facility; and\n(4) a plan for the storage and proper management of separated household hazardous waste and other problem materials.\n(b) By September 30, 1992, the owner or operator of a facility shall implement the elements of the plan required in paragraph (a) relating to household hazardous waste management. After that date, the agency may not grant or renew a permit for a facility until the agency has:\n(1) reviewed the elements of the facility's plan relating to household hazardous waste management;\n(2) directed the applicant or permittee to make changes to these elements as necessary to comply with the plan requirements under paragraph (a); and\n(3) included a requirement to implement the elements as a condition of the issued or renewed permit.\n(c) By September 30, 1993, the owner or operator of a facility shall implement the elements of the plan required in paragraph (a) relating to problem materials management. After that date, the agency may not grant or renew a permit for a facility until the agency has:\n(1) reviewed the elements of the facility's plan relating to problem materials management;\n(2) directed the applicant or permittee to make changes to these elements as necessary to comply with the plan requirements under paragraph (a); and\n(3) included a requirement to implement the elements as a condition of the issued or renewed permit.\n(a) The commissioner may acquire interests in real property at a solid waste disposal facility, limited to environmental covenants under chapter 114E and easements for the environmental covenants, when the commissioner determines the property interests are related to:\n(1) closure;\n(2) postclosure care; and\n(3) any other actions needed after the postclosure care period expires.\n(b) The state is not liable under this chapter or any other law solely as a result of acquiring an interest in real property under this section.\n(c) An environmental covenant under this subdivision must be in accordance with chapter 114E and must be signed and acknowledged by every owner of the fee simple title to the real property subject to the covenant.\n(a) The commissioner may require, as part of a state individual air quality permit issued in response to an enforcement action that required the payment of a civil penalty, that the owner or operator hold in-person meetings with residents of the community where the facility is located to share information about the facility's operations and environmental releases and to discuss community concerns.\n(b) For the purposes of this subdivision, \"state individual air quality permit\" means an air quality permit that:\n(1) is issued to an individual facility that is required to obtain a permit under Minnesota Rules, part 7007.0250, subparts 2 to 6; and\n(2) is not a general permit issued under Minnesota Rules, part 7007.1100.\n(a) The commissioner must develop a compliance protocol for use under this subdivision, consisting of:\n(1) methods the agency requires a facility to employ to physically measure the actual emissions of each air toxic emitted by the facility; and\n(2) the frequency with which the facility must employ each method.\n(b) Methods of physical measurement the agency may require include but are not limited to:\n(1) continuous emission monitoring systems;\n(2) performance tests;\n(3) ambient monitoring near the facility;\n(4) portable monitoring units that have been calibrated with performance tests or continuous emission monitors; and\n(5) any other physical method of measuring actual emissions that the commissioner determines is accurate and technically and physically feasible.\n(c) For violations of state and federal air pollution laws involving emissions of hazardous air pollutants, the commissioner may require a compliance protocol as part of a state individual air quality permit issued in response to an enforcement action.\n(d) The commissioner may require a facility to employ quality control measures and procedures to ensure that pollution control equipment and emissions monitoring equipment are properly calibrated, operated, and maintained to ensure accuracy.\n(e) For the purposes of this subdivision, \"state individual air quality permit\" means an air quality permit that:\n(1) is issued to an individual facility that is required to obtain a permit under Minnesota Rules, part 7007.0250, subparts 2 to 6; and\n(2) is not a general permit issued under Minnesota Rules, part 7007.1100.\n(f) Beginning January 15, 2025, the commissioner must annually submit a report to the chairs and ranking minority members of the environment and natural resources finance and policy committees on the use of compliance protocols over the preceding year.\n(a) The Pollution Control Agency may grant variances from its rules as provided in rules adopted under this section and sections 14.055 and 14.056 in order to avoid undue hardship and to promote the effective and reasonable application and enforcement of laws, rules, and standards for prevention, abatement and control of water, air, noise, and land pollution. The variance rules shall provide for notice and opportunity for hearing before a variance is granted.\n(b) A local government unit authorized by contract with the Pollution Control Agency pursuant to section 116.05 to exercise administrative powers under this chapter may grant variances after notice and public hearing from any ordinance, rule, or standard for prevention, abatement, or control of water, air, noise and land pollution, adopted pursuant to said administrative powers and under the provisions of this chapter.\nIn exercising all its powers the Pollution Control Agency shall give due consideration to the establishment, maintenance, operation and expansion of business, commerce, trade, industry, traffic, and other economic factors and other material matters affecting the feasibility and practicability of any proposed action, including, but not limited to, the burden on a municipality of any tax which may result therefrom, and shall take or provide for such action as may be reasonable, feasible, and practical under the circumstances.\n(a) Any Minnesota county board may, by resolution, with approval of the Pollution Control Agency, assume responsibility for processing applications for permits required by the Pollution Control Agency under this section for livestock feedlots, poultry lots or other animal lots. The responsibility for permit application processing, if assumed by a county, may be delegated by the county board to any appropriate county officer or employee.\n(b) For the purposes of this subdivision, the term \"processing\" includes:\n(1) the distribution to applicants of forms provided by the Pollution Control Agency;\n(2) the receipt and examination of completed application forms, and the certification, in writing, to the Pollution Control Agency either that the animal lot facility for which a permit is sought by an applicant will comply with applicable rules and standards, or, if the facility will not comply, the respects in which a variance would be required for the issuance of a permit; and\n(3) rendering to applicants, upon request, assistance necessary for the proper completion of an application.\n(c) For the purposes of this subdivision, the term \"processing\" may include, at the option of the county board, issuing, denying, modifying, imposing conditions upon, or revoking permits pursuant to the provisions of this section or rules promulgated pursuant to it, subject to review, suspension, and reversal by the Pollution Control Agency. The Pollution Control Agency shall, after written notification, have 15 days to review, suspend, modify, or reverse the issuance of the permit. After this period, the action of the county board is final, subject to appeal as provided in chapter 14. For permit applications filed after October 1, 2001, section 15.99 applies to feedlot permits issued by the agency or a county pursuant to this subdivision.\n(d) For the purpose of administration of rules adopted under this subdivision, the commissioner and the agency may provide exceptions for cases where the owner of a feedlot has specific written plans to close the feedlot within five years. These exceptions include waiving requirements for major capital improvements.\n(e) For purposes of this subdivision, a discharge caused by an extraordinary natural event such as a precipitation event of greater magnitude than the 25-year, 24-hour event, tornado, or flood in excess of the 100-year flood is not a \"direct discharge of pollutants.\"\n(f) In adopting and enforcing rules under this subdivision, the commissioner shall cooperate closely with other governmental agencies.\n(g) The Pollution Control Agency shall work with the Minnesota Extension Service, the Department of Agriculture, the Board of Water and Soil Resources, producer groups, local units of government, as well as with appropriate federal agencies such as the Natural Resources Conservation Service and the Farm Service Agency, to notify and educate producers of rules under this subdivision at the time the rules are being developed and adopted and at least every two years thereafter.\n(h) The Pollution Control Agency shall adopt rules governing the issuance and denial of permits for livestock feedlots, poultry lots or other animal lots pursuant to this section. Pastures are exempt from the rules authorized under this paragraph. No feedlot permit shall include any terms or conditions that impose any requirements related to any pastures owned or utilized by the feedlot operator other than restrictions under a manure management plan. A feedlot permit is not required for livestock feedlots with more than ten but less than 50 animal units; provided they are not in shoreland areas. A livestock feedlot permit does not become required solely because of a change in the ownership of the buildings, grounds, or feedlot. These rules apply both to permits issued by counties and to permits issued by the Pollution Control Agency directly.\n(i) The Pollution Control Agency shall exercise supervising authority with respect to the processing of animal lot permit applications by a county.\n(j) Any new rules or amendments to existing rules proposed under the authority granted in this subdivision, or to implement new fees on animal feedlots, must be submitted to the members of legislative policy and finance committees with jurisdiction over agriculture and the environment prior to final adoption. The rules must not become effective until 90 days after the proposed rules are submitted to the members.\n(k) Until new rules are adopted that provide for plans for manure storage structures, any plans for a liquid manure storage structure must be prepared or approved by a registered professional engineer or a United States Department of Agriculture, Natural Resources Conservation Service employee.\n(l) A county may adopt by ordinance standards for animal feedlots that are more stringent than standards in Pollution Control Agency rules.\n(m) After January 1, 2001, a county that has not accepted delegation of the feedlot permit program must hold a public meeting prior to the agency issuing a feedlot permit for a feedlot facility with 300 or more animal units, unless another public meeting has been held with regard to the feedlot facility to be permitted.\n(n) After the proposed rules published in the State Register, volume 24, number 25, are finally adopted, the agency may not impose additional conditions as a part of a feedlot permit, unless specifically required by law or agreed to by the feedlot operator.\n(o) For the purposes of feedlot permitting, a discharge from land-applied manure or a manure stockpile that is managed according to agency rule must not be subject to a fine for a discharge violation.\n(p) For the purposes of feedlot permitting, manure that is land applied, or a manure stockpile that is managed according to agency rule, must not be considered a discharge into waters of the state, unless the discharge is to waters of the state, as defined by section 103G.005, subdivision 17, except type 1 or type 2 wetlands, as defined in section 103G.005, subdivision 17b, and does not meet discharge standards established for feedlots under agency rule.\n(q) Unless the upgrade is needed to correct an immediate public health threat under section 145A.04, subdivision 8, or the facility is determined to be a concentrated animal feeding operation under Code of Federal Regulations, title 40, section 122.23, in effect on April 15, 2003, the agency may not require a feedlot operator:\n(1) to spend more than $3,000 to upgrade an existing feedlot with less than 300 animal units unless cost-share money is available to the feedlot operator for 75 percent of the cost of the upgrade; or\n(2) to spend more than $10,000 to upgrade an existing feedlot with between 300 and 500 animal units, unless cost-share money is available to the feedlot operator for 75 percent of the cost of the upgrade or $50,000, whichever is less.\n(r) A feedlot operator who stores and applies up to 100,000 gallons per calendar year of private truck wash wastewater resulting from trucks that transport animals or supplies to and from the feedlot does not require a permit to land-apply industrial by-products if the feedlot operator stores and applies the wastewater in accordance with Pollution Control Agency requirements for land applications of industrial by-product that do not require a permit.\n(s) A feedlot operator who holds a permit from the Pollution Control Agency to land-apply industrial by-products from a private truck wash is not required to have a certified land applicator apply the private truck wash wastewater if the wastewater is applied by the feedlot operator to cropland owned or leased by the feedlot operator or by a commercial animal waste technician licensed by the commissioner of agriculture under chapter 18C. For purposes of this paragraph and paragraph (r), \"private truck wash\" means a truck washing facility owned or leased, operated, and used only by a feedlot operator to wash trucks owned or leased by the feedlot operator and used to transport animals or supplies to and from the feedlot.\n(a) A person who applies to the Pollution Control Agency or a county board for a permit to construct or expand a feedlot with a capacity of 500 animal units or more shall, not less than 20 business days before the date on which a permit is issued, provide notice to each resident and each owner of real property within 5,000 feet of the perimeter of the proposed feedlot. The notice may be delivered by first class mail, in person, or by the publication in a newspaper of general circulation within the affected area and must include information on the type of livestock and the proposed capacity of the feedlot. Notification under this subdivision is satisfied under an equal or greater notification requirement of a county or town permit process. A person must also send a copy of the notice by first class mail to the clerk of the town in which the feedlot is proposed not less than 20 business days before the date on which a permit is issued.\n(b) The agency or a county board must verify that notice was provided as required under paragraph (a) prior to issuing a permit.\n(a) Any state agency or local government unit conducting an inventory or survey of livestock feedlots under its jurisdiction must publicize notice of the inventory in a newspaper of general circulation in the affected area and in other media as appropriate. The notice must state the dates the inventory will be conducted, the information that will be requested in the inventory, and how the information collected will be provided to the public. The notice must also specify the date for a public meeting to provide information regarding the inventory.\n(b) A local government unit conducting an inventory or survey of livestock feedlots under its jurisdiction must hold at least one public meeting within the boundaries of the jurisdiction of the local unit of government, prior to beginning the inventory. A state agency conducting a survey of livestock feedlots must hold at least four public meetings outside of the seven-county Twin Cities metropolitan area, prior to beginning the inventory. The public meeting must provide information concerning the dates the inventory will be conducted, the procedure the agency or local unit of government will use to request the information to be included in the inventory, and how the information collected will be provided to the public.\n(a) The agency must issue national pollutant discharge elimination system permits for feedlots only as required by federal law. The issuance of national pollutant discharge elimination system permits for feedlots must be based on the following:\n(1) a permit for a newly constructed or expanded animal feedlot that is identified as a priority by the commissioner, using criteria in effect on January 1, 2010, must be issued as an individual permit;\n(2) an existing feedlot that is identified as a priority by the commissioner, using criteria in effect on January 1, 2010, must be issued as an individual permit; and\n(3) the agency must issue a general national pollutant discharge elimination system permit, if required, for animal feedlots that are not identified under clause (1) or (2).\n(b) Prior to the issuance of a general national pollutant discharge elimination system permit for a category of animal feedlot facility permittees, the agency must hold at least one public hearing on the permit issuance.\n(c) To the extent practicable, the agency must include a public notice and comment period for an individual national pollutant discharge elimination system permit concurrent with any public notice and comment for:\n(1) the purpose of environmental review of the same facility under chapter 116D; or\n(2) the purpose of obtaining a conditional use permit from a local unit of government where the local government unit is the responsible governmental unit for purposes of environmental review under chapter 116D.\n(d) A feedlot owner may choose to apply for a national pollutant discharge elimination system permit even if the feedlot is not required by federal law to have a national pollutant discharge elimination system permit.\nNotwithstanding subdivision 7 or Minnesota Rules, chapter 7020, to the contrary, and notwithstanding the proximity to public or private waters, an owner or resident of agricultural land on which livestock have been allowed to pasture at any time during the ten-year period beginning January 1, 2010, is permanently exempt from requirements related to feedlot or manure management on that land for so long as the property remains in pasture.\nExcept for areas within the metropolitan area, as defined in section 473.121, subdivision 2, or within cities of the first or second class, an air emission permit is not required for a manure digester and associated electrical generation equipment that process manure from the farm or provide for backup power for the farm.\nThe agency may publish, broadcast, or distribute information pertaining to agency activities, laws, rules, and standards.\nThe commissioner has the following powers and duties for enforcing any provision of this chapter and chapter 114C, relating to air contamination or waste:\n(1) to adopt, issue, reissue, modify, deny, revoke, reopen, enter into or enforce reasonable orders, schedules of compliance and stipulation agreements;\n(2) to require the owner or operator of any emission facility, air contaminant treatment facility, potential air contaminant storage facility, or any system or facility related to the storage, collection, transportation, processing, or disposal of waste to establish and maintain records; to make reports; to install, use, and maintain monitoring equipment or methods; and to make tests, including testing for odor where a nuisance may exist, in accordance with methods, at locations, at intervals, and in a manner as the agency shall prescribe; and to provide other information as the agency may reasonably require;\n(3) to conduct investigations, issue notices, public and otherwise, and order hearings as it may deem necessary or advisable for the discharge of its duties under this chapter and chapter 114C, including but not limited to the issuance of permits; and to authorize any member, employee, or agent appointed by it to conduct the investigations and issue the notices; and\n(4) when appropriate, requiring parties who enter into a negotiated agreement to settle an enforcement matter with the agency to reimburse the agency for oversight costs. The agency may recover oversight costs only if the agency's costs exceed $25,000. If oversight costs exceed $25,000, the agency may recover all the oversight costs incurred by the agency that are associated with implementing the negotiated agreement. Oversight costs may include but are not limited to any costs associated with inspections, sampling, monitoring, modeling, risk assessment, permit writing, engineering review, economic analysis and review, and other record or document review. Estimates of anticipated oversight costs must be disclosed in the negotiated agreement, and estimates must be periodically updated and disclosed to the parties to the negotiated agreement. The agency's legal and litigation costs are not recoverable under this clause. In addition to settlement agreements, the commissioner has discretion as to whether to apply this clause in cases where the agency is using schedules of compliance to bring a class of regulated parties into compliance.\nIf a party to a stipulation agreement asserts a good cause or force majeure claim for an extension of time to comply with a stipulated term, the commissioner may deny the extension if the assertion is based solely on increased costs of compliance.\n[Repealed, 1997 c 231 art 13 s 20]\n(a) If the agency receives an application for a permit to spread soil contaminated by a harmful substance as defined in section 115B.25, subdivision 7a, on land in an organized or unorganized township other than the township of origin of the soil, the agency must notify the board of the organized township, or the county board of the unorganized township where the spreading would occur at least 60 days prior to issuing the permit.\n(b) The agency must not issue a permit to spread contaminated soil on land outside the township of origin if, by resolution, the township board of the organized township, or the county board of the unorganized township where the soil is to be spread requests that the agency not issue a permit.\nThe ash from a legitimate fire training exercise involving the live burning of a structure is classified as demolition debris and may be disposed in any permit-by-rule land disposal facility authorized under agency rules or any permitted demolition land disposal facility, with the consent of the disposal facility operator, if a person certified by a Minnesota state college or university fire safety center certifies in writing in advance to the commissioner that the structure has been adequately prepared for such a training exercise, taking into account all applicable safety concerns and regulations, including Pollution Control Agency guidelines regarding the removal of hazardous materials from training-burn structures before the training event.",
	"repealed": false
}