{
	"id": "308C.614",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.614",
	"title": "308C.614 LIEN FOR ASSESSMENTS.",
	"text": "(a) A senior housing cooperative formed under this chapter has a lien on a membership interest, the appurtenant occupancy agreement, and the member's associated occupancy rights for any assessment levied against that membership interest from the time the assessment becomes due. If an assessment is payable in installments, the full amount of the assessment is a lien from the time the first installment thereof becomes due. Unless the bylaws provide otherwise, any fees, charges, or payments that members must regularly pay to the cooperative are enforceable as assessments under this section. Other cooperatives formed under this chapter may authorize a lien on a membership interest, occupancy agreement, or a proprietary lease in the bylaws.\n(b) A lien under this section is prior to all other liens and encumbrances on a membership certificate except (i) liens, encumbrances, or mortgages which the cooperative creates, assumes, or takes subject to, or (ii) any first security interest encumbering only the membership interest. If a first security interest encumbering a membership interest which is personal property is foreclosed, the secured party or the purchaser at the sale shall take title to the membership interest subject to unpaid assessments. This paragraph shall not affect the priority of mechanics' liens encumbering the project.\n(c) Proceedings to enforce an assessment lien shall be instituted within three years after the last installment of the assessment becomes payable, or shall be barred.\n(d) The member and owner of the membership interest, at the time an assessment is due, shall be personally liable to the cooperative for payment of the assessment levied against the membership interest. If there are multiple owners of the membership interest, they shall be jointly and severally liable.\n(e) This section does not prohibit actions to recover sums for which paragraph (a) creates a lien nor prohibit a cooperative from taking an assignment of the membership certificate and occupancy agreement or other conveyance documents agreed upon by the parties in lieu of foreclosure.\n(f) The cooperative shall furnish to a member or the member's authorized agent upon written request of the member or the authorized agent a statement setting forth the amount of unpaid assessments currently levied against the member's interest. The statement shall be furnished within ten business days after receipt of the request and is binding on the cooperative and every member.",
	"repealed": false
}