{
	"id": "142C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.01",
	"title": "142C.01 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given in this section.\n\"Applicant\" means an individual or organization that is subject to certification under this chapter and that applied for but is not yet granted certification under this chapter.\n\"Authorized agent\" means the individual designated by the certification holder who is responsible for communicating with the commissioner of children, youth, and families regarding all items pursuant to this chapter.\n\"Center operator\" or \"program operator\" means the person exercising supervision or control over the center's or program's operations, planning, and functioning.\n\"Certification holder\" means the individual or organization that is legally responsible for the operation of the center, and granted certification by the commissioner under this chapter.\n\"Certified license-exempt child care center\" means the commissioner's written authorization for a child care center excluded from licensure under section 142B.05, subdivision 2, paragraph (a), clause (3), (7) to (9), (15), (18), (26), or (30), to register to receive child care assistance payments under chapter 142E.\n\"Disinfecting\" means the use of a product capable of destroying or inactivating harmful germs, except bacterial spores, consistent with label directions on environmental surfaces including bathroom toilets and floors, diaper-changing surfaces, and surfaces exposed to blood or other bodily fluids.\n\"Infant\" means a child who is at least six weeks old but less than 16 months old.\n\"Preschooler\" means a child who is at least 33 months old but who has not yet attended the first day of kindergarten.\n\"School-age child\" means a child who is of sufficient age to have attended the first day of kindergarten or is eligible to enter kindergarten within four months and who:\n(1) is no more than 13 years old;\n(2) is 14 years old and has a disability and is eligible for child care assistance under chapter 142E;\n(3) is eligible for child care assistance until redetermination under section 142E.10, subdivision 1, paragraph (e); or\n(4) attends a certified center that serves only school-age children in a setting that has no students enrolled in a grade higher than 8th grade.\n\"Staff person\" means an employee of a certified center who provides direct contact services to children.\n\"Substitute\" means an adult who is temporarily filling a position as a staff person for less than 240 hours total in a calendar year due to the absence of a regularly employed staff person who provides direct contact services to a child.\n\"Toddler\" means a child who is at least 16 months old but less than 33 months old.\n\"Unsupervised volunteer\" means an individual who: (1) assists in the care of a child in care; (2) is not under the continuous direct supervision of a staff person; and (3) is not employed by the certified center.",
	"repealed": false
}