{
	"id": "86B.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.521",
	"title": "86B.521 MOTORBOAT NOISE CONTROL.",
	"text": "A motor may not be used on a motorboat unless it is equipped with an efficient muffler, underwater exhaust, or other device that adequately muffles or suppresses the sound of the exhaust of the motor so as to prevent excessive or unusual noise. A motor may not be equipped with an altered muffler, muffler cutout, muffler bypass, or any other device designed or installed so that it can be used to continually or intermittently bypass any muffler or muffler system installed in the motorboat or to reduce or eliminate the effectiveness of such a muffler or muffler system.\nA person may not sell or offer for sale a marine engine or motorboat that would exceed the noise limits contained in section 86B.321, subdivision 2, under a test procedure approved by the commissioner if the motor is maintained according to the manufacturer's specifications.\n(a) A person may not modify a marine engine or motorboat in a manner that will amplify or increase the noise emitted by the marine engine or motorboat above the noise limits contained in section 86B.321, subdivision 2, under a test procedure approved by the commissioner.\n(b) A person may not operate a motorboat with an engine modified to increase noise above the noise limits.\n(a) A person may not sell or offer for sale replacement or additional parts for a marine engine or motorboat which when installed in the marine engine or motorboat will amplify or increase the noise emitted by the marine engine or motorboat above the noise limits contained in section 86B.321, subdivision 2, under a test procedure approved by the commissioner.\n(b) A person may not operate a motorboat incorporating parts prohibited to be sold under paragraph (a).\nThe provisions of this section do not apply to motorboats operating under a permit issued under section 86B.121 or a United States Coast Guard marine event permit in a regatta, or race, while on trial runs, or while on official trials for speed records during the time and in the designated area authorized by the permit.\nThe test procedures under subdivisions 2, 3, and 4 shall be established by written order by the commissioner and published in the State Register. The establishment of test procedures is exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.",
	"repealed": false
}