{
	"id": "161.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.04",
	"title": "161.04 TRUNK HIGHWAY FUND.",
	"text": "The trunk highway fund shall consist of 62 percent of the net highway user tax distribution fund as provided in article 14 of the constitution; the proceeds of the sale of any bonds authorized by article 14 of the constitution; money received from the federal government as aid in the construction and maintenance of trunk highways; and any other money otherwise allotted, appropriated, or legislated therefor.\nUpon the request of the commissioner, moneys in the trunk highway fund shall be invested by the State Board of Investment in those securities authorized for such purpose in section 11A.21. All interest and profits from such investments shall be credited to the trunk highway fund. The commissioner of management and budget shall be the custodian of all securities purchased under the provisions of this section.\nA trunk highway revolving loan account is created in the transportation revolving loan fund under section 446A.085. The commissioner may transfer money from the trunk highway fund to the trunk highway revolving loan account. Money in the account may be used to make loans. Funds in the trunk highway revolving loan account may not be used for any toll facilities project or congestion-pricing project and may be used only for trunk highway purposes and repayments and interest from loans of those funds must be credited to the trunk highway revolving loan account in the transportation revolving loan fund. Money in the trunk highway revolving loan account is annually appropriated to the commissioner and does not lapse. Interest earned from investment of money in this account must be deposited in the trunk highway revolving loan account.\nLoans from the transportation revolving loan fund to the commissioner for trunk highway projects must be deposited in the trunk highway fund. Loan proceeds are appropriated annually to the commissioner and do not lapse. Principal and interest payments on the loan proceeds must be paid from the debt service account and are considered a long-term obligation of the trunk highway fund.\n(a) The trunk highway emergency relief account is created in the trunk highway fund. Money in the account is appropriated to the commissioner to be used to fund relief activities related to an emergency, as defined in section 161.32, subdivision 3, or under section 12A.16, subdivision 1.\n(b) Reimbursements by the Federal Highway Administration for emergency relief payments made from the trunk highway emergency relief account must be credited to the account. Notwithstanding section 16A.28, money in the account is available until spent. If the balance of the account at the end of a fiscal year is greater than $10,000,000, the amount above $10,000,000 must be canceled to the trunk highway fund.\nMS 2012 [Repealed, 2013 c 117 art 3 s 41]",
	"repealed": false
}