{
	"id": "260C.623",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.623",
	"title": "260C.623 ADOPTION PETITION.",
	"text": "(a) The responsible social services agency may petition for the adopting parent to adopt a child who is under the guardianship of the commissioner. The petition shall contain or have attached a statement certified by the adopting parent that the adopting parent desires that the relationship of parent and child be established between the adopting parent and the child and that adoption is in the best interests of the child.\n(b) The adopting parent may petition the court for adoption of the child.\n(c) An adopting parent must be at least 21 years of age at the time the adoption petition is filed unless the adopting parent is an individual related to the child, as defined by section 142B.01, subdivision 15.\n(d) The petition may be filed in Minnesota by an adopting parent who resides within or outside the state.\n(a) An adoption petition shall be filed not later than nine months after the date of the fully executed adoption placement agreement unless the court finds that:\n(1) the time for filing a petition be extended because of the child's special needs as defined under title IV-E of the federal Social Security Act, United States Code, title 42, section 672; or\n(2) based on a written plan for completing filing of the petition, including a specific timeline, to which the adopting parent has agreed, the time for filing a petition be extended long enough to complete the plan because an extension is in the best interests of the child and additional time is needed for the child to adjust to the adoptive home.\n(b) If an adoption petition is not filed within nine months of the execution of the adoption placement agreement as required under section 260C.613, subdivision 1, and after giving the adopting parent written notice of its request together with the date and time of the hearing set to consider its report, the responsible social services agency shall file a report requesting an order for one of the following:\n(1) that the time for filing a petition be extended because of the child's special needs as defined under title IV-E of the federal Social Security Act, United States Code, title 42, section 673;\n(2) that, based on a written plan for completing filing of the petition, including a specific timeline, to which the adopting parent has agreed, the time for filing a petition can be extended long enough to complete the plan because an extension is in the best interests of the child and additional time is needed for the child to adjust to the adoptive home; or\n(3) that the child can be removed from the adopting home.\n(c) At the conclusion of the review, the court shall issue findings, appropriate orders for the parties to take action or steps required to advance the case toward a finalized adoption, and set the date and time for the next review hearing.\n(a) The petition shall be captioned in the legal name of the child as that name is reflected on the child's birth record prior to adoption and shall be entitled \"Petition to Adopt Child under the Guardianship of the Commissioner of Children, Youth, and Families.\" The actual name of the child shall be supplied to the court by the responsible social services agency if unknown to the individual with whom the agency has made the adoptive placement.\n(b) The adoption petition shall be verified as required in section 260C.141, subdivision 4, and, if filed by the responsible social services agency, signed and approved by the county attorney.\n(c) The petition shall state:\n(1) the full name, age, and place of residence of the adopting parent;\n(2) if the adopting parents are married, the date and place of marriage;\n(3) the date the adopting parent acquired physical custody of the child;\n(4) the date of the adoptive placement by the responsible social services agency;\n(5) the date of the birth of the child, if known, and the county, state, and country where born;\n(6) the name to be given the child, if a change of name is desired;\n(7) the description and value of any real or personal property owned by the child;\n(8) the relationship of the adopting parent to the child prior to adoptive placement, if any;\n(9) whether the Indian Child Welfare Act does or does not apply; and\n(10) the name and address of:\n(i) the child's guardian ad litem;\n(ii) the adoptee, if age ten or older;\n(iii) the child's Indian tribe, if the child is an Indian child; and\n(iv) the responsible social services agency.\n(d) A petition may ask for the adoption of two or more children.\n(e) If a petition is for adoption by a married person, both spouses must sign the petition indicating willingness to adopt the child and the petition must ask for adoption by both spouses unless the court approves adoption by only one spouse when spouses do not reside together or for other good cause shown.\n(f) If the petition is for adoption by a person residing outside the state, the adoptive placement must have been approved by the state where the person is a resident through the Interstate Compact on the Placement of Children, sections 260.851 to 260.92.\nThe following must be filed with the petition:\n(1) the adoption study report required under section 259.41;\n(2) the social and medical history required under sections 259.43 and 260C.609; and\n(3) a document prepared by the petitioner that establishes who must be given notice under section 260C.627, subdivision 1, that includes the names and mailing addresses of those to be served by the court administrator.",
	"repealed": false
}