{
	"id": "121A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.20",
	"title": "121A.20 LICENSED SCHOOL NURSE.",
	"text": "(a) The Department of Education must employ a school health services specialist to:\n(1) provide technical assistance to school districts and charter schools for the education-related health needs of students;\n(2) serve as the primary source of information and support for schools in addressing emergency readiness, public health, and the needs of children and youth with acute and chronic health conditions and related disorders; and\n(3) serve as the primary liaison to the Department of Health and other state agencies to coordinate school-based, health-related services for students.\n(b) The school health services specialist's duties include:\n(1) increasing professional awareness and competencies of school nurses and other specialized instructional support personnel, using the competencies defined in the most recent edition of the document jointly prepared by the American Nurses Association and the National Association of School Nurses identified as \"School Nursing; Scope and Standards of Practice\" to meet the educational needs of students with acute or chronic health conditions or students identified with risk characteristics associated with health and mental health;\n(2) developing implementation guidance to assist general education and special education teachers in (i) recognizing health-related educational needs of children and youth, and (ii) improving students' attendance and full participation in instruction and other school activities;\n(3) developing implementation guidance to assist teachers, specialized instructional support personnel, and school administrators in prevention of and intervention with health-harming behavior and mental health; and\n(4) increasing the availability of online and asynchronous professional development programs and materials for school staff.\nFor purposes of this section, \"health services specialist\" means a professional registered nurse who:\n(1) is licensed as a public health nurse in Minnesota;\n(2) is licensed as a school nurse in Minnesota;\n(3) has a minimum of three years of experience in school nursing services or as a public health nurse serving schools; and\n(4) has experience in managing a districtwide health policy.\nThe Department of Education's school health services specialist must be highly trained in school nursing, which includes knowledge about child growth and development; public health; health education; and special education with a focus on the impact of health on learning, comprehensive assessment of learning-related health using interventions that are evidence-based, and documentation and evaluation of child health knowledge, skills, status, and education implications. The specialist must have knowledge of section 504 plans, health insurance and third-party reimbursement, health privacy, and emergency preparedness. The specialist must also have skills in interdisciplinary collaboration, policy development, parent involvement, health teaching and learning, and staff development.",
	"repealed": false
}