{
	"id": "469.019",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.019",
	"title": "469.019 RENTALS, TENANT ADMISSIONS.",
	"text": "In the operation or management of housing projects an authority shall observe the following duties with respect to rentals and tenant admissions.\n(a) It may rent or lease the dwelling accommodations only to persons of low income and at rentals within their ability to pay.\n(b) It may rent or lease to a tenant dwelling accommodations consisting of the number of rooms it deems necessary to provide safe and sanitary accommodations to the proposed occupants, without overcrowding, but no greater number.\n(c) It shall not approve a family as tenant in a housing project if the family has an aggregate annual net income from all sources at the time of admission which exceeds five times the annual rental for the accommodations to be provided the family. As used in this section, aggregate annual net income shall not include:\n(1) the income of a family member, other than the head of the household or spouse, who is under 18 years of age or who is a full-time student;\n(2) the first $300 of the income of a secondary wage earner who is the spouse of the head of the household;\n(3) $300 for each member of the family residing in the household, other than the head of the household or spouse, who is under 18 years of age or who is 18 years of age or older and is disabled or a full-time student;\n(4) nonrecurring income as defined by the authority;\n(5) five percent of the family's gross income from all sources or, in the case of an elderly family, ten percent of the family's gross income;\n(6) amounts paid or incurred for which the family is liable for extraordinary medical expenses or other expenses resulting from unusual circumstances as determined by the authority; and\n(7) an amount equal to the money received by the head of the household or spouse from or under the direction of any public or private nonprofit child-placing agency for the care and maintenance of one or more persons who are under 18 years of age and were placed in the family by that agency.\n(d) In computing the rental for the purpose of this section, there shall be included in the rental the average annual cost, as determined by the authority, to occupants of heat, water, electricity, gas, cooking fuel, and other necessary services or facilities, whether or not the charge for the services and facilities is included in the rental. An authority may adopt as its maximum net income for admission of families any maximum which is less than either: (1) the maximum net family income computed under this section; or (2) the maximum net family income determined pursuant to section 469.022; or (3) the maximum net family income determined pursuant to the Housing and Community Development Act of 1974.",
	"repealed": false
}