{
	"id": "282.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.005",
	"title": "282.005 TAX-FORFEITED LAND; INITIAL SALE.",
	"text": "Prior to managing tax-forfeited lands as otherwise provided in this chapter, a county must first offer tax-forfeited parcels for sale pursuant to this section, except that any interests in iron-bearing stockpiles, minerals, or mineral interests are reserved for the state as provided under subdivision 8, and any parcel withdrawn from sale by the commissioner of natural resources under section 282.007 must be managed as provided in section 282.007. If a property cannot be sold under this section for more than the minimum bid, the state is deemed to have purchased the property through a credit bid and the parcels may be disposed of as otherwise provided in this chapter.\nFor the purposes of this section, the following terms have the meanings given:\n(1) \"interested party\" means any party with an interest in the real estate including but not limited to an owner of the property, a lienholder, or any other party who has filed their name according to section 276.041;\n(2) \"mineral interest\" means an interest in any minerals, including but not limited to iron, gas, coal, oil, copper, gold, or other valuable minerals; and\n(3) \"minimum bid\" means the sum of delinquent taxes, special assessments, penalties, interests, and costs assigned to the parcel.\nPrior to the public sale required under this section, an interested party may repurchase the property by payment of the sum of all delinquent taxes and assessments computed under section 282.251, together with penalties, interest, and costs, that accrued or would have accrued if the parcel of land had not forfeited. A property repurchased under this subdivision is no longer subject to the requirements of this section. All rights and interests of all interested parties remain unaffected if a property is repurchased under this subdivision.\n(a) The county auditor must sell the property at a public auction to the highest bidder in a manner reasonably calculated to facilitate public participation, including by online auction. The sale under this section must occur within six months of either the filing of the certificate of forfeiture pursuant to section 281.23, subdivision 9, or the date the property is vacated by the occupant, whichever is later. Notice of the sale under this subdivision must be provided by publication in newspapers, websites, and other forums that serve diverse communities in the county where the property is located at least 30 days before the commencement of the sale.\n(b) At auction, the county auditor must calculate the minimum bid and make the figure available to those participating in the auction. The county auditor must also calculate and make available the initial price of the property, which is equal to the estimated market value, as determined by the most recent assessment. The property must not be sold for less than the initial price for 30 days after it is initially made available at auction. If no buyer is willing to pay the initial price, the price for the property must be reduced to the minimum bid. If no buyer is willing to pay the minimum bid, the state is deemed to have purchased the property through a credit bid and the parcels may be disposed of as otherwise provided in this chapter.\nThe auction proceeds must be collected by the county auditor. The amount of the minimum bid shall be deposited into a county's forfeited tax sale fund. The proceeds in excess of the minimum bid shall be available for distribution pursuant to subdivision 6.\n(a) If a sale under this section results in a surplus, within 60 days of the sale, the county auditor must notify interested parties, in a manner described in subdivision 7, of the surplus by sending notice of the surplus and a claim form to the interested parties. The commissioner of revenue must prescribe the form and manner of the claim form. The notice must indicate that the sale of the property resulted in a surplus, the amount of the surplus, that parties with an interest in the property are entitled to the surplus amount, and that interested parties have an obligation to submit a claim for the surplus. Interested parties are entitled to make a claim for surplus proceeds under this subdivision if they file a claim within six months from the date the notice is first mailed to the interested parties.\n(b) Unless disputed by the county auditor, if a single claim is filed, the county auditor must pay the surplus to the interested party filing the claim. A county must not pay any claimant until after the period of time in which to file a claim has expired.\n(c) If there are multiple claims for a given property, the county must divide payments under this subdivision among the claimants according to each claimant's interest in proportion to the interest of all claimants. If the county auditor disputes a claim, or if there is a dispute as to how to divide the surplus among multiple claimants, the county auditor may deposit the surplus funds in district court and file a petition pursuant to Rule 67 of the Minnesota Rules of Civil Procedure, asking the court to determine claimants' rights to the funds deposited. The county auditor is entitled to recover the costs it reasonably incurs in commencing and maintaining this action from the amount of funds submitted to the court in the action. If the court determines that no claimant is entitled to the surplus, the surplus must be returned to the county and deposited into the county's forfeited tax sale fund.\n(d) The county and the county auditor are entitled to absolute immunity related to any claim predicated on distribution of surplus if the county auditor distributed proceeds consistent with this subdivision.\n(a) A notice provided under subdivision 6 or 8 must be served as follows:\n(1) by certified mail to all interested parties of record within 60 days of the sale;\n(2) if an interested party of record has not filed a claim, a second notice must be sent by first class mail to all interested parties between 90 and 120 days after the sale;\n(3) unless the property is vacant land, within 60 days of the sale, by first class mail to the property addressed to the attention of the occupants of the property; and\n(4) within 60 days of the sale, by publishing a list of property sales with surplus with unexpired claims periods to the county's website.\n(b) In addition, solely at the discretion of the county, a list of property sales with surplus with unexpired claims periods may be published in the county's designated newspaper for publication of required public notices.\n(a) Upon forfeiture, any iron-bearing stockpiles, minerals, and mineral interests shall be sold to the state for $50. The county auditor must notify interested parties within 60 days of the sale by sending notice and a claim form. The commissioner of revenue must prescribe the form and manner of the claim form. Notice must be provided in a manner described in subdivision 7. An interested party may submit a claim alleging that the value of the iron-bearing stockpiles, minerals, or mineral interests in the property exceeds the minimum bid. Claims must be submitted within six months from the date the notice under this subdivision is first mailed to the interested parties.\n(b) If a claim is filed under this subdivision, the commissioner of natural resources must determine the value of the forfeited iron-bearing stockpiles, minerals, and mineral interests. If the value of the iron-bearing stockpiles, minerals, and mineral interests does not exceed the minimum bid, the claimant is not entitled to any payment under this subdivision. If the value of the iron-bearing stockpiles, minerals, and mineral interests exceeds the minimum bid, the claimant is entitled to a payment from the commissioner of natural resources equal to this excess amount.\n(c) If there are multiple claims, the county must divide payments under this subdivision among the claimants according to each claimant's ownership interest in proportion to the ownership interest of all claimants. If the county auditor disputes a claim, or if there is a dispute as to how to divide the surplus among multiple claimants, the commissioner of natural resources must transfer the amount due to the claimants under this subdivision to the county auditor. The county auditor must then deposit the transferred amount in district court and file a petition pursuant to Rule 67 of the Minnesota Rules of Civil Procedure, asking the court to determine claimants' rights to the funds deposited. The county auditor is entitled to recover the costs it reasonably incurs in commencing and maintaining this action from the amount of funds submitted to the court in the action. If the court determines that no party that filed a claim is entitled to the surplus, the payment must be returned to the commissioner of natural resources and is canceled to the general fund.\n(d) An amount necessary to make payments under this subdivision is annually appropriated from the general fund to the commissioner of natural resources.\nIf a sale under this section results in a surplus and either (1) no interested party makes a claim for the proceeds within the time allowed under subdivision 6, or (2) it is determined that no claimant was entitled to the surplus proceeds, then interested parties are no longer eligible to receive payment of any surplus. Once interested parties are no longer eligible to receive payment of any surplus, the proceeds must be returned to the county's forfeited tax sale fund.\nThe forfeiture of the property extinguishes all liens, claims, and encumbrances other than:\n(1) the rights of interested parties to surplus proceeds under this section;\n(2) rights of redemption provided under federal law;\n(3) easements and rights-of-way holders who are not interested parties; and\n(4) benefits or burdens of any real covenants filed of record as of the date of forfeiture.\nProperty deemed to be purchased by the state pursuant to this section shall be held in trust for the benefit of the taxing districts. All land becoming property of the state pursuant to this chapter shall be managed in accordance with chapters 93 and 282 and other applicable law.",
	"repealed": false
}