{
	"id": "103E.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.011",
	"title": "103E.011 DRAINAGE AUTHORITY POWERS.",
	"text": "The drainage authority may make orders to:\n(1) construct and maintain drainage systems;\n(2) deepen, widen, straighten, or change the channel or bed of a natural waterway that is part of the drainage system or is located at the outlet of a drainage system;\n(3) extend a drainage system into or through a municipality for a suitable outlet; and\n(4) construct necessary dikes, dams, and control structures and power appliances, pumps, and pumping machinery as provided by law.\nA drainage authority may not drain a water body or begin work or activity regulated by the public-waters-work permit requirement under section 103G.245 in a watercourse until the commissioner determines that the water body or watercourse is not public waters. If a water body or watercourse is determined to be public waters, the drainage proceedings are subject to section 103G.211 relating to replacing public waters and the water bank program.\n(a) The drainage authority must receive permission from the commissioner to:\n(1) remove, construct, or alter a dam affecting public waters;\n(2) establish, raise, or lower the level of public waters; or\n(3) drain any portion of a public water.\n(b) The petitioners for a proposed drainage project or the drainage authority may apply to the commissioner for permission to do work in public waters or for the determination of public waters status of a water body or watercourse.\nThe drainage authority may construct necessary dams, structures, and improvements and maintain them to impound and release floodwater to prevent damage. The dams, structures, and improvements may be constructed with or without a drainage project. For a water body or watercourse that is not public waters the drainage authority may:\n(1) lower or establish the level of water in the water body or watercourse to control floodwaters;\n(2) build structures and improvements to maintain a water body or watercourse for flood control or other public purposes; and\n(3) construct dikes or dams in a water body to maintain water at the level designated by the drainage authority and to drain part of the water body.\nNotwithstanding other provisions of this chapter, a drainage authority may accept and use funds from sources other than, or in addition to, those derived from assessments based on the benefits of the drainage system for the purposes of wetland preservation or restoration or creation of water quality improvements or flood control. The sources of funding authorized under this subdivision may also be used outside the benefited area but must be within the watershed of the drainage system.",
	"repealed": false
}