{
	"id": "93.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.45",
	"title": "93.45 IRON RANGE TRAIL.",
	"text": "In recognition of the unique combination of cultural, geological, industrial, historical, recreational, and scenic characteristics of Minnesota's iron ranges, an \"Iron Range Trail\" is hereby established on the Vermilion, Mesabi, and Cuyuna iron ranges and at related points on Lake Superior. The commissioner of natural resources shall establish, develop, and maintain the trail, and related places of interest under the commissioner's jurisdiction and control, for the purposes specified in this subdivision. The trail need not be continuous between or within ranges and related points, but shall be developed as a coordinated unit and for multiple use. The commissioner, in cooperation with other state agencies, local governments, and private organizations and individuals shall mark and, where necessary, interpret places of cultural, geological, industrial, historical, recreational, and scenic interest. In cooperation with state and local road authorities, local governments, and private organizations and individuals, the commissioner also shall mark access, where available, to these places of interest from public roads and highways.\nThe commissioner may acquire by gift or purchase necessary trail easements and related interest in and across lands not under the commissioner's jurisdiction and control. The commissioner also may enter into contracts, leases, or other agreements with the operator or the owner of active or inactive mine areas and with the person having the right of possession thereof for the use and development of these areas for Iron Range Trail purposes. The commissioner may develop, maintain, and operate such areas or may enter into contracts with third parties for the development, maintenance, or operation of the areas. If the commissioner enters into such a contract with a third party, the contract shall provide that the operator, owner and any person entitled to possession or control of the area shall be held harmless and indemnified by the third party from and against any and all claims for injuries or damage to person or property, from such use or development. Nothing in this section prohibits a person from asserting any claim for alleged damages brought pursuant to section 3.732 or 3.736.",
	"repealed": false
}