{
	"id": "245G.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.21",
	"title": "245G.21 REQUIREMENTS FOR LICENSED RESIDENTIAL TREATMENT.",
	"text": "A license holder who provides supervised room and board at the licensed program site as a treatment component is defined as a residential program according to section 245A.02, subdivision 14, and is subject to this section.\nA client must be allowed to receive visitors at times prescribed by the license holder. The license holder must set and post a notice of visiting rules and hours, including both day and evening times. A client's right to receive visitors other than a personal physician, advanced practice registered nurse, or physician assistant; religious adviser; county case manager; parole or probation officer; or attorney may be subject to visiting hours established by the license holder for all clients. The treatment director or designee may impose limitations as necessary for the welfare of a client provided the limitation and the reasons for the limitation are documented in the client's file. A client must be allowed to receive visits at all reasonable times from the client's personal physician, advanced practice registered nurse, or physician assistant; religious adviser; county case manager; parole or probation officer; and attorney.\nA license holder who provides room and board and treatment services to a client in the same facility, and any license holder that accepts client property must meet the requirements for handling client funds and property in section 245A.04, subdivision 13. License holders:\n(1) may establish policies regarding the use of personal property to ensure that treatment activities and the rights of other clients are not infringed upon;\n(2) may take temporary custody of a client's property for violation of a facility policy;\n(3) must retain the client's property for a minimum of seven days after the client's service termination if the client does not reclaim property upon service termination, or for a minimum of 30 days if the client does not reclaim property upon service termination and has received room and board services from the license holder; and\n(4) must return all property held in trust to the client at service termination regardless of the client's service termination status, except that:\n(i) a drug, drug paraphernalia, or drug container that is subject to forfeiture under section 609.5316, must be given to the custody of a local law enforcement agency. If giving the property to the custody of a local law enforcement agency violates Code of Federal Regulations, title 42, sections 2.1 to 2.67, or title 45, parts 160 to 164, a drug, drug paraphernalia, or drug container must be destroyed by a staff member designated by the program director; and\n(ii) a weapon, explosive, and other property that can cause serious harm to the client or others must be given to the custody of a local law enforcement agency, and the client must be notified of the transfer and of the client's right to reclaim any lawful property transferred; and\n(iii) a medication that was determined by a physician, advanced practice registered nurse, or physician assistant to be harmful after examining the client must be destroyed, except when the client's personal physician, advanced practice registered nurse, or physician assistant approves the medication for continued use.\nA license holder who provides room and board and treatment services in the same facility must have the appropriate license from the Department of Health.\nA license holder must establish and enforce an ongoing facility abuse prevention plan consistent with sections 245A.65 and 626.557, subdivision 14.\nA license holder must prepare an individual abuse prevention plan for each client as specified under sections 245A.65, subdivision 2, and 626.557, subdivision 14.\nA license holder must have written procedures for assessing and monitoring a client's health, including a standardized data collection tool for collecting health-related information about each client. The policies and procedures must be approved and signed by a registered nurse.\nA license holder must meet the administration of medications requirements of section 245G.08, subdivision 5, if services include medication administration.",
	"repealed": false
}