{
	"id": "15.985",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.985",
	"title": "15.985 ADVISORY INSPECTIONS.",
	"text": "(a) Upon the voluntary request of a person to a state agency for an advisory inspection for the purpose of complying with state law, the agency must, except as provided in paragraphs (f) and (g), conduct an advisory inspection. An agency is not required to conduct an advisory inspection if the agency has a regularly scheduled inspection that would occur within 90 days after the request for the advisory inspection, or if before an advisory inspection is requested, the agency has notified the person that it will be conducting an inspection within 45 days. If an advisory inspection results in findings that potentially could make a person subject to a fine or other penalty imposed by the agency, the agency must notify the person in writing of those findings within ten days of the inspection.\n(1) Except as provided in clause (2), if within 60 days of receiving notice, the person notifies the agency that it has corrected the situation that made the person potentially subject to the fine or penalty, and the agency later determines that the situation is corrected, the agency may not impose a fine or penalty as a result of the findings in the advisory inspection.\n(2) For violations of chapter 177, if the person notifies the agency within the time period for remedying violations required under the applicable section of chapter 177 that it has corrected the situation that made the person potentially subject to the fine or penalty, and the agency later determines that the situation is corrected, the agency may not impose a fine or penalty as a result of the finding in the advisory inspection.\n(3) A person may not request more than one advisory inspection from the same agency in a calendar year. A person may not request an advisory inspection after an inspection resulting in a fine or other penalty has been determined and the violator notified of the amount to be paid, until fines or penalties have been paid or settled.\n(b) For purposes of this section:\n(1) \"inspection\" includes an examination of real or personal property or an audit or other examination of financial or other documents;\n(2) \"penalty\" includes a civil or administrative fine or other financial sanction;\n(3) \"person\" includes a real person and businesses, including corporations, partnerships, limited liability companies, and unincorporated associations; and\n(4) \"state agency\" means a department, agency, board, commission, constitutional office, or other group in the executive branch of state government.\n(c) If an agency revises, amends, extends, or adds additional violations to a notice, the person has 60 days from the date of those changes to correct the situation without fine or penalty. For violations of chapter 177, the person has the time period for remedying violations under the applicable section of chapter 177 to correct the situation without fine or penalty.\n(d) An agency conducting an inspection under this section may impose and collect from the person requesting the inspection a fee equal to the costs incurred by the agency related to the inspection. Fees under this section shall be considered charges for goods and services provided for the direct and primary use of a private individual, business, or other entity under section 16A.1283, paragraph (b), clause (3). Fee revenue collected under this section must be deposited in an appropriate fund other than the general fund and is appropriated from that fund to the agency collecting the fee for the purpose of conducting inspections under this section.\n(e) Nothing in this section shall prohibit or interfere with an agency offering similar programs that allow independent audits or inspections, including the environmental improvement program under chapter 114C. If a person conducts a self-audit under chapter 114C, the terms and conditions of this section do not apply. For advisory inspections conducted by the Pollution Control Agency, terms and conditions of sections 114C.20 to 114C.28 shall be used instead of those in paragraphs (a) to (c) and (g).\n(f) If agency staff resources are limited, an agency must give higher priority to the agency's regular inspections over advisory inspections under this section. Insofar as conducting advisory inspections reduces an agency's costs, the savings must be reflected in the charges for advisory inspections. Before hiring additional staff complement for purposes of this section, an agency must report to the chairs and ranking minority members of the legislative budget committees with jurisdiction over the agency documenting: (1) the demand for advisory inspections and why additional staff complement is needed to meet the demand; and (2) that the revenue generated by advisory inspections will cover the expenses of the additional staff complement. If a person requests an advisory inspection, but the agency does not have staff resources necessary to conduct the advisory inspection before a regular inspection is conducted, and the regular inspection results in findings that could make a person subject to a fine or penalty, the agency must take into account the person's request for an advisory inspection and the person's desire to take corrective action before taking any enforcement action against the person.\n(g) This section does not apply to:\n(1) criminal penalties;\n(2) situations in which implementation of this section is prohibited by federal law or would result in loss of federal funding or in other federal sanctions or in which implementation would interfere with multistate agreements, international agreements, or agreements between state and federal regulatory agencies;\n(3) conduct constituting fraud;\n(4) violations in a manner that endangers human life or presents significant risk of major injury or severe emotional harm to humans;\n(5) violations that are part of a pattern that has occurred repeatedly and shows willful intent;\n(6) violations for which it may be demonstrated that the alternative inspections process is being used to avoid enforcement;\n(7) violations that occur within three years of violating an applicable law;\n(8) the Department of Revenue;\n(9) the Workers' Compensation Division at the Department of Labor and Industry;\n(10) violations of vehicle size weight limits under sections 169.80 to 169.88;\n(11) commercial motor vehicle inspections under section 169.781 and motor carrier regulations under chapter 221;\n(12) state inspections or surveys of hospitals, nursing homes, outpatient surgical centers, supervised living facilities, board and lodging with special services, home care, housing with services and assisted living settings, hospice, and supplemental nursing services agencies;\n(13) examinations of health maintenance organizations or county-based purchasing entities regulated under chapter 62D;\n(14) special transportation services under section 174.30; and\n(15) entities regulated by the Department of Commerce's Financial Institutions and Insurance Divisions for purposes of regulatory requirements of those divisions.\nIf an agency determines that this section does not apply due to situations specified in clause (2), the agency must report the basis for that determination to the chairs and ranking minority members of the legislative committees with jurisdiction over the agency.\n(h) An agency may terminate an advisory inspection and proceed as if an inspection were a regular inspection if, in the process of conducting an advisory inspection, the agency finds a situation that the agency determines: could lead to criminal penalties; endangers human life or presents significant risk of major injury or severe emotional harm to humans; presents a severe and imminent threat to animals, food, feed, crops, commodities, or the environment; or evidences a pattern of willful violations.",
	"repealed": false
}