{
	"id": "245.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.98",
	"title": "245.98 COMPULSIVE GAMBLING TREATMENT PROGRAM.",
	"text": "For the purposes of this section, \"compulsive gambler\" means a person who is chronically and progressively preoccupied with gambling and with the urge to gamble to the extent that the gambling behavior compromises, disrupts, or damages personal, family, or vocational pursuits.\nThe commissioner of human services shall establish a program for the treatment of compulsive gamblers. The commissioner may contract with an entity with expertise regarding the treatment of compulsive gambling to operate the program. The program may include the establishment of a statewide toll-free number, resource library, public education programs; regional in-service training programs and conferences for health care professionals, educators, treatment providers, employee assistance programs, and criminal justice representatives; and the establishment of certification standards for programs and service providers. The commissioner may enter into agreements with other entities and may employ or contract with consultants to facilitate the provision of these services or the training of individuals to qualify them to provide these services. The program may also include inpatient and outpatient treatment and rehabilitation services for residents in different settings, including a temporary or permanent residential setting for mental health or substance use disorder, and individuals in jails or correctional facilities. The program may also include research studies. The research studies must include baseline and prevalence studies for adolescents and adults to identify those at the highest risk. The program must be approved by the commissioner before it is established.\nThe commissioner shall adopt by rule criteria to be used in conducting compulsive gambling assessments of offenders under section 609.115, subdivision 9. The commissioner shall also adopt by rule standards to qualify a person to: (1) assess offenders for compulsive gambling treatment; and (2) provide treatment indicated in a compulsive gambling assessment. The rules must specify the circumstances in which, in the absence of an independent assessor, the assessment may be performed by a person with a direct or shared financial interest or referral relationship resulting in shared financial gain with a treatment provider.\n[Repealed, 1995 c 207 art 11 s 12]\nThe commissioner of human services is authorized to enter into an agreement with the governing body of any Indian tribe located within the boundaries of the state of Minnesota that conducts either class II or class III gambling, as defined in section 4 of the Indian Gaming Regulatory Act, Public Law 100-497, and future amendments to it, for the purpose of obtaining funding for compulsive gambling programs from the Indian tribe. Prior to entering into any agreement with an Indian tribe under this section, the commissioner shall consult with and obtain the approval of the governor or governor's designated representatives authorized to negotiate a tribal-state compact regulating the conduct of class III gambling on Indian lands of a tribe requesting negotiations. Contributions collected under this subdivision are appropriated to the commissioner of human services for the compulsive gambling treatment program under this section.\nThe commissioner shall create standards for treatment and provider qualifications for the treatment component of the compulsive gambling program.",
	"repealed": false
}