{
	"id": "90.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.201",
	"title": "90.201 VOID TIMBER SALES; REFUNDS; ADJUSTMENT OF SALE TERMS.",
	"text": "Any sale of timber made by fraud or mistake or in violation of the provisions of this chapter shall be void, the permit issued thereon shall be of no effect, and the holder shall be required to surrender the same. In case of a sale made by mistake the amount paid shall be refunded to the permit holder, or at the request of the permit holder the commissioner may credit the refund as payment upon any other timber purchased by the permit holder. If timber has been cut on a permit which required cancellation due to error by the state, it may be sold at single stumpage rate without formalities.\nThe commissioner shall refund to a permit holder any amount paid on a timber sale which exceeds the value of the timber cut under that sale as determined on a final statement transmitted pursuant to section 90.181. The commissioner may credit a refund to any other permit held by the same permit holder if the permit is delinquent as provided in section 90.181, subdivision 2, and may credit a refund to any other permit to which the permit holder requests that it be credited.\nAny refund of cash that is due to a permit holder as determined on a final statement transmitted pursuant to section 90.181 or a refund of cash made pursuant to section 90.161, subdivision 1, shall be paid to the permit holder according to section 16A.124 unless the refund is credited on another permit as provided in this chapter.\nWhen a permit holder dies or becomes permanently incapacitated, the commissioner may cancel the permit and compromise and settle the remaining obligations to the state.\nWhen standing timber under a valid permit is damaged through fire, windstorm, flood, or other natural cause, the commissioner may reappraise the timber and modify the permit. The commissioner shall ensure that the reappraisal is in the best interest of the state and the trust.",
	"repealed": false
}