{
	"id": "144E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.03",
	"title": "144E.03 EMERGENCY MEDICAL SERVICES ADVISORY COUNCIL.",
	"text": "The Emergency Medical Services Advisory Council is established and consists of the following members:\n(1) one emergency medical technician currently practicing with a licensed ambulance service, appointed by the Minnesota Ambulance Association;\n(2) one paramedic currently practicing with a licensed ambulance service or a medical response unit, appointed jointly by the Minnesota Professional Fire Fighters Association and the Minnesota Ambulance Association;\n(3) one medical director of a licensed ambulance service, appointed by the National Association of EMS Physicians, Minnesota Chapter;\n(4) one firefighter currently serving as an emergency medical responder, appointed by the Minnesota State Fire Chiefs Association;\n(5) one registered nurse who is certified or currently practicing as a flight nurse, appointed jointly by the regional emergency services boards of the designated regional emergency medical services systems;\n(6) one hospital administrator, appointed by the Minnesota Hospital Association;\n(7) one social worker, appointed by the Board of Social Work;\n(8) one member of a federally recognized Tribal Nation in Minnesota, appointed by the Minnesota Indian Affairs Council;\n(9) three public members, appointed by the governor. At least one of the public members must reside outside the metropolitan counties listed in section 473.121, subdivision 4;\n(10) one member with experience working as an employee organization representative representing emergency medical service providers, appointed by an employee organization representing emergency medical service providers;\n(11) one member representing a local government, appointed by the Coalition of Greater Minnesota Cities;\n(12) one member representing a local government in the seven-county metropolitan area, appointed by the League of Minnesota Cities;\n(13) two members of the house of representatives and two members of the senate, appointed according to subdivision 2; and\n(14) the commissioner of health and commissioner of public safety or their designees as ex officio members.\nThe speaker of the house and the house minority leader must each appoint one member of the house of representatives to serve on the advisory council. The senate majority leader and the senate minority leader must each appoint one member of the senate to serve on the advisory council. Legislative members appointed under this subdivision serve until successors are appointed. Legislative members may receive per diem compensation and reimbursement for expenses according to the rules of their respective bodies.\nCompensation and reimbursement for expenses for members appointed under subdivision 1, clauses (1) to (12); removal of members; filling of vacancies of members; and, except for initial appointments, membership terms are governed by section 15.059. Notwithstanding section 15.059, subdivision 6, the advisory council does not expire.\n(a) The advisory council must elect a chair and vice-chair from among its membership and may elect other officers as the advisory council deems necessary.\n(b) The advisory council must meet quarterly or at the call of the chair.\n(c) Meetings of the advisory council are subject to chapter 13D.\nThe advisory council must review and make recommendations to the director and the deputy director of ambulance services on the administration of this chapter; the regulation of ambulance services and medical response units; the operation of the emergency medical services system in the state; and other topics as directed by the director.",
	"repealed": false
}