{
	"id": "354.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.66",
	"title": "354.66 QUALIFIED PART-TIME TEACHERS; MEMBERSHIP IN ASSOCIATION.",
	"text": "As used in this section, the term \"teachers\" shall have the meaning given it in section 122A.15, subdivision 1, except that the term shall not include superintendents. The term shall also have the meaning given it in section 136F.43, subdivision 1.\nFor purposes of this section, the term \"board\" means a school district board and the Board of Trustees of the Minnesota State Colleges and Universities.\nFor purposes of this section, the term \"district\" means a school district or the Minnesota State Colleges and Universities system.\n(a) Except as indicated in paragraph (b), participation in the part-time mobility program must be based on a full fiscal year and the employment pattern of the teacher during the most recent fiscal year.\n(b) For a teacher in the Minnesota State Colleges and Universities system who teaches only during the first semester in an academic year and retires immediately after the first semester, participation in the part-time mobility program must be based on one-half of a full fiscal year and the employment pattern of the teacher during the most recent one-half of the most recent fiscal year.\n(a) A teacher in a Minnesota public elementary school, a Minnesota secondary school, or the Minnesota State Colleges and Universities system who has three years or more of allowable service in the association or three years or more of full-time teaching service in Minnesota public elementary schools, Minnesota secondary schools, or the Minnesota State Colleges and Universities system, by agreement with the board of the employing district or with the authorized representative of the board, may be assigned to teaching service in a part-time teaching position under subdivision 3. The agreement must be executed before October 1 of the school year for which the teacher has been assigned to teaching service in a part-time teaching position under this section. A copy of the executed agreement must be filed with the executive director of the association. If the copy of the executed agreement is filed with the association after October 1 of the school year for which the teacher has been assigned to teaching service in a part-time teaching position, the employing unit shall pay the fine specified in section 354.52, subdivision 6, for each calendar day that elapsed since the October 1 due date, unless the association waives the fine. The association may not accept an executed agreement that is received by the association more than 15 months late.\n(b) Notwithstanding paragraph (a), if the teacher is also a legislator:\n(1) the agreement in paragraph (a) must be executed before March 1 of the school year for which the teacher requests to make retirement contributions under subdivision 4; and\n(2) the fines specified in paragraph (a) apply if the employing unit does not file the executed agreement with the executive director of the association by March 1.\n(a) For purposes of this section, the term \"part-time teaching position\" means a teaching position within the district in which the teacher is compensated for an amount of at least 30 percent, but not exceeding 80 percent of the compensation established by the board for a full-time teacher with identical education and experience with the employing unit.\n(b) For a teacher to which subdivision 1c, paragraph (b), applies, the term \"part-time teaching position\" means a teaching position within the district in which the teacher is compensated for an amount of at least 15 percent, but not exceeding 40 percent of the compensation established by the board for a full-time teacher, with identical education and experience with the employing unit.\nNotwithstanding any provision to the contrary in this chapter relating to the salary figure to be used for the determination of contributions or the accrual of service credit, a teacher assigned to a part-time position under this section shall continue to make employee contributions to and to accrue allowable service credit in the retirement fund during the period of part-time employment on the same basis and in the same amounts as would have been paid and accrued if the teacher had been employed on a full-time basis provided that, prior to June 30 each year, or within 30 days after notification by the association of the amount due, whichever is later, the member and the employing board make that portion of the required employer contribution to the retirement fund, in any proportion which they may agree upon, that is based on the difference between the amount of compensation that would have been paid if the teacher had been employed on a full-time basis and the amount of compensation actually received by the teacher for the services rendered in the part-time assignment. The employing unit shall make that portion of the required employer contributions to the retirement fund on behalf of the teacher that is based on the amount of compensation actually received by the teacher for the services rendered in the part-time assignment. The employee and employer contributions shall be based upon the rates of contribution prescribed by section 354.42. Full accrual of allowable service credit and employee contributions for part-time teaching service pursuant to this section and section 354A.094 shall not continue for a period longer than ten years.\n[Repealed, 1987 c 398 art 7 s 43]\nA teacher entitled to full accrual of allowable service credit and employee contributions for part-time teaching service pursuant to this section shall not be entitled during the same period of time to be a member of, accrue allowable service credit in or make employee contributions to any other Minnesota public employee pension plan, except the plan established in chapter 3A, the plan established in chapter 352D if the teacher also is a legislator, or a firefighters relief association governed by sections 424A.091 to 424A.096.\nA board of an employing district entering into an agreement authorized by this section shall take all steps necessary to assure continuance of any insurance programs furnished or authorized a full-time teacher on an identical basis and with identical sharing of costs for a part-time teacher pursuant to this section, provided, however, that the requirements of this sentence may be modified by a collective bargaining agreement between a board and an exclusive representative pursuant to chapter 179A. Teachers as defined in section 136F.43 employed on a less than 75 percent time basis pursuant to this section shall be eligible for state paid insurance benefits as if the teachers were employed full time.\nOnly teachers who are public employees as defined in section 179A.03, subdivision 14, during the school year preceding the period of part-time employment pursuant to this section shall qualify for full accrual of service credit from, and employee contributions to the retirement fund for part-time teaching service pursuant to subdivision 4. Notwithstanding the provisions of section 179A.03, subdivision 14, paragraph (a), clauses (5) and (6), teachers who are employed on a part-time basis for purposes of this section and who would therefore be disqualified from the bargaining unit by one or both of those provisions, shall continue to be in the bargaining unit during the period of part-time employment pursuant to this section for purposes of compensation, fringe benefits and the grievance procedure.\nNo teacher shall qualify for full accrual of service credit from and employee contributions to the retirement association or a teachers retirement fund association for part-time teaching service pursuant to subdivision 4 or section 354A.094, subdivision 4, in more than one district at the same time. No teacher shall qualify for full accrual of service credit from and employee contributions to the retirement association or a teachers retirement fund association for part-time teaching service during part-time employment in a district pursuant to this section in any year when the teacher also takes a full-time or part-time teaching position in another Minnesota school district.\n[Repealed, 1987 c 398 art 7 s 43]\nNothing in this section shall be construed to limit the authority of a board to assign a teacher to a part-time teaching position which does not qualify for full accrual of service credit from and employee contributions to the retirement fund pursuant to this section.\nNeither subdivision 5 nor 8 shall be construed to prohibit a teacher who qualifies for full accrual of service credit from and employee contributions to the retirement fund pursuant to this section in any year from being employed as a substitute teacher by any school district during that year. Notwithstanding the provisions of sections 354.091 and 354.42, a teacher may not qualify for full accrual of service credit from and employee contributions to the retirement fund for other teaching service rendered for any part of any year for which the teacher qualifies for full accrual of service credit from and employee contributions to the retirement fund pursuant to this section or section 354A.094.",
	"repealed": false
}