{
	"id": "325A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/325A.05",
	"title": "325A.05 DISCLOSURES MADE PRIOR TO CONTRACT.",
	"text": "In either the first written communication from the invention developer to a specific customer or at the first personal meeting between the invention developer and a customer, the invention developer shall make a written disclosure to the customer of the information required in this section.\nThe disclosure shall state the median fee charged to all of the invention developers' customers who have signed contracts with the developer in the preceding six months, excluding customers who have signed in the preceding 30 days.\nThe disclosure shall include a single statement setting forth (1) the total number of customers who have contracted with the invention developer, except that the number need not reflect those customers who have contracted within the preceding 30 days, and (2) the number of customers who have received by virtue of the invention developer's performance of invention development services an amount of money in excess of the amount of money paid by those customers to the invention developer pursuant to a contract for invention development services.\nThe disclosure shall contain the following statement:\n\"An invention developer who is also a lawyer may give you legal advice concerning patent, copyright, or trademark law or to advise you of whether your idea or invention may be patentable or may be protected under the patent, copyright, or trademark laws of the United States or any other law. An invention developer who is not a lawyer may not give you legal advice on these subjects.\nNo patent, copyright or trademark protection will be acquired for you by the invention developer. Your failure to inquire into the law governing patent, copyright or trademark matters may jeopardize your rights in your idea or invention, both in the United States and in foreign countries. Your failure to identify and investigate existing patents, trademarks or registered copyrights may place you in jeopardy of infringing the copyrights, patent or trademark rights of other persons if you proceed to make, use, distribute or sell your idea or invention.\"",
	"repealed": false
}