{
	"id": "83.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.29",
	"title": "83.29 REGISTRATION.",
	"text": "Upon compliance with all the provisions of sections 83.20 to 83.42 applicable to the application for registration and with the requirements of the commissioner, and if the commissioner finds no grounds for denial of the application, the commissioner shall register the subdivided lands. The commissioner shall have power to place such conditions, limitations, and restrictions on any registration as may be necessary to carry out the purposes of sections 83.20 to 83.42. Registration shall be by entry in a book called Register of Subdivided Lands, which entry shall show the subdivided lands registered and for whom registered, and shall specify the conditions, limitations, and restrictions upon such registration, if any, or shall make proper reference to a formal order of the commissioner on file showing such conditions, limitations, and restrictions.\nIf the commissioner determines upon inquiry and examination:\n(1) that any of the requirements of sections 83.20 to 83.42 or the rules promulgated pursuant to sections 83.20 to 83.42 have not been met;\n(2) that the proposed promotional plan is or tends to be fraudulent, deceptive, or misleading;\n(3) that the sales of the lands would work or tend to work a fraud or deception on the purchasers thereof;\n(4) that the sales of the lands would be unfair or inequitable to the purchasers thereof;\n(5) that the subdivider has violated any of the provisions of sections 83.20 to 83.42 or any order or rule of the commissioner;\n(6) that the subdivider is not in compliance with federal, state, or local environmental quality standards,\nthe commissioner may issue an order denying the application for registration; provided, however, that nothing in this section shall authorize the commissioner to deny an application based solely on the proposed sale price of the lands. The order shall state the reasons for denial. Every person whose application for registration has been denied shall have the right to a hearing provided a request for such hearing is filed with the commissioner within 30 days of the receipt of the order of denial. The order of denial shall inform the applicant of the right to this hearing.\nThe state environmental quality standards referred to in subdivision 2, clause (6), for the subdivision and development of land in this state shall be established by the Environmental Quality Board. Thereafter, the commissioner shall be required to include such standards in the rules promulgated pursuant to section 83.38.\nA document is filed when it is received by the commissioner and the proper fee is paid.\nNo person shall publish or cause to be published in this state any advertisement offering subdivided lands subject to the registration requirements of section 83.23 which is false, misleading, or deceptive.",
	"repealed": false
}