{
	"id": "270C.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.85",
	"title": "270C.85 ADMINISTRATION OF PROPERTY TAX LAWS; POWERS AND DUTIES.",
	"text": "The commissioner shall have and exercise general supervision over the administration of the property tax laws, assessors, town, county, and city boards of review and equalization, and all other assessing officers in the performance of their duties, to the end that all assessments of property be made relatively just and equal in compliance with the laws of the state.\nThe commissioner shall have and exercise the following powers and duties in administering the property tax laws:\n(1) confer with, advise, and give the necessary instructions and directions to local assessors and local boards of review throughout the state as to their duties under the laws of the state;\n(2) direct proceedings, actions, and prosecutions to be instituted to enforce the laws relating to the liability and punishment of public officers and officers and agents of corporations for failure or negligence to comply with the provisions of the property tax laws, and cause complaints to be made against local assessors, members of boards of equalization, members of boards of review, or any other assessing or taxing officer, to the proper authority, for their removal from office for misconduct or negligence of duty;\n(3) require county attorneys to assist in the commencement of prosecutions in actions or proceedings for removal, forfeiture, and punishment, for violation of the property tax laws in their respective districts or counties;\n(4) require town, city, county, and other public officers to report and certify information, at the parcel level or in the aggregate, as to the assessment and taxation of real and personal property, and such other information as may be needful in the work of the commissioner. The commissioner shall prescribe the content, format, manner, and time of filing of all required reports and certifications;\n(5) transmit to the governor, on or before the third Monday in December of each even-numbered year, and to each member of the legislature, on or before November 15 of each even-numbered year, the report of the department for the preceding years, showing all the taxable property subject to the property tax laws and the value of the same, in tabulated form;\n(6) inquire into the methods of assessment and taxation and ascertain whether the assessors faithfully discharge their duties; and\n(7) assist local assessors in determining the estimated market value of industrial special-use property. For purposes of this clause, \"industrial special-use property\" means property that:\n(i) is designed and equipped for a particular type of industry;\n(ii) is not easily adapted to some other use due to the unique nature of the facilities;\n(iii) has facilities totaling at least 75,000 square feet in size; and\n(iv) has a total estimated market value of $10,000,000 or greater based on the assessor's preliminary determination.",
	"repealed": false
}