{
	"id": "82.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.86",
	"title": "82.86 REAL ESTATE EDUCATION, RESEARCH AND RECOVERY FUND.",
	"text": "There is established a \"real estate education, research and recovery fund\" to be administered by the commissioner of commerce. The commissioner of management and budget shall be the custodian of the fund and shall operate under the direction of the commissioner.\nThere is hereby created in the state treasury a real estate education, research and recovery fund which shall be administered by the commissioner in the manner and for the purposes prescribed in this section.\nEach real estate broker, real estate salesperson, and real estate closing agent entitled under this chapter to renew a license shall pay in addition to the appropriate renewal fee a further fee of $20 per licensing period which shall be credited to the real estate education, research, and recovery fund. Any person who receives an initial license shall pay, in addition to all other fees payable, a fee of $30.\nIf the amount in the fund is at any time less than the commissioner believes is necessary to carry out the purposes of this section every licensee, when renewing a license, shall pay, in addition to the annual renewal fee and the fee set forth in subdivision 3, an assessment not to exceed $100, said sum having been reasonably determined by the commissioner to be necessary to restore a balance in the fund of an amount adequate to carry out the purposes of this section.\nAny funds shall, upon request of the commissioner, be invested by the state Board of Investment in the class of securities specified in section 11A.24 and acts amendatory thereto. All interest and profits from such investments shall be credited to the real estate education, research and recovery fund. The commissioner of management and budget shall be the custodian of securities purchased under the provisions of this section.\nThe commissioner may expend money as appropriated for the following purposes:\n(a) to promote the advancement of education and research in the field of real estate for the benefit of those licensed under this chapter;\n(b) to underwrite educational seminars and other forms of educational projects for the benefit of real estate licensees;\n(c) to establish a real estate chair or courses at Minnesota state institutions of higher learning for the purpose of making such courses available to licensees and the general public;\n(d) to contract for a particular educational or research project in the field of real estate to further the purposes of this chapter;\n(e) to pay any reasonable costs and disbursements, excluding attorney's fees, incurred in defending actions against the real estate education, research and recovery fund including the cost of mailing or publication of notice pursuant to subdivision 14; and\n(f) to provide information to the public on housing issues, including but not limited to, environmental safety and housing affordability.\nWhen any aggrieved person obtains a final judgment in any court of competent jurisdiction regardless of whether the judgment has been discharged by a bankruptcy court against an individual licensed under this chapter, on grounds of fraudulent, deceptive, or dishonest practices, or conversion of trust funds arising directly out of any transaction when the judgment debtor was licensed and performed acts for which a license is required under this chapter, or performed acts permitted by section 327B.04, subdivision 5, the aggrieved person may, upon the judgment becoming final, and upon termination of all proceedings, including reviews and appeals, file a verified application in the court in which the judgment was entered. The application shall state with specificity the grounds upon which the application seeks to recover from the fund, and request an order directing payment out of the fund of the amount of actual and direct out of pocket loss in the transaction, but excluding any attorney's fees, interest on the loss and on any judgment obtained as a result of the loss, up to the sum of $150,000 of the amount unpaid upon the judgment, provided that nothing in this chapter shall be construed to obligate the fund for more than $150,000 per claimant, per transaction, subject to the limitations set forth in subdivision 14, regardless of the number of persons aggrieved or parcels of real estate involved in the transaction, provided that regardless of the number of claims against a licensee, nothing in this chapter may obligate the fund for more than $250,000 per licensee. An aggrieved person who has a cause of action under section 80A.76 shall first seek recovery as provided in section 80A.66(e), before the commissioner may order payment from the recovery fund. For purposes of this section, persons who are joint tenants or tenants in common are deemed to be a single claimant. A copy of the verified application shall be served upon the commissioner and upon the judgment debtor, and a certificate or affidavit of service filed with the court. For the purpose of this section, \"aggrieved person\" does not include a government agency, financial institution, or other entity that purchases, guarantees, or insures a loan secured by real estate, and does not include a licensee unless (1) the licensee is acting in the capacity of principal in the sale of interests in real property owned by the licensee; or (2) the licensee is acting in the capacity of principal in the purchase of interests in real property to be owned by the licensee. Under no circumstances shall a licensee be entitled to payment under this section for the loss of a commission or similar fee.\nFor the purposes of this section, recovery is limited to transactions where the property involved is intended for the direct personal habitation or commercial use of the buyer.\nExcept for securities permitted to be sold by a licensee pursuant to section 82.81, subdivision 7, for any action commenced after July 1, 1993, recovery under this section is not available where the buyer's participation is for investment purposes only, and is limited to providing capital to fund the transaction.\n(a) The commissioner shall pay claims from the recovery portion of the fund that do not exceed the jurisdiction limits for conciliation court matters as specified in section 491A.01 on an accelerated basis if all of the requirements in subdivision 7 and paragraphs (b) to (f) have been satisfied.\n(b) When any aggrieved person as defined in subdivision 7 obtains a judgment in any court of competent jurisdiction, regardless of whether the judgment has been discharged by a bankruptcy court against a licensee on grounds specified in subdivision 7, the aggrieved person may file a verified application with the commissioner for payment out of the recovery portion of the fund of the amount of actual and direct out-of-pocket loss in the transaction, but excluding any attorney fees, interest on the loss, and on any judgment obtained as a result of the loss, up to the conciliation court jurisdiction limits, of the amount unpaid upon the judgment. For purposes of this section, persons who are joint tenants or tenants in common are deemed to be a single claimant.\n(c) The commissioner shall send the licensee a copy of the verified application by first-class mail to the licensee's address as it appears in the records of the Department of Commerce with a notice that the claim will be paid 15 days from the date of the notice unless the licensee notifies the commissioner before that date of the commencement of an appeal of the judgment, if the time for appeal has not expired, and that payment of the claim will result in automatic suspension of the licensee's license.\n(d) If the licensee does not notify the commissioner of the commencement of an appeal, the commissioner shall pay the claim at the end of the 15-day period.\n(e) If an appeal is commenced, the payment of the claim is stayed until the conclusion of the appeal.\n(f) The commissioner may pay claims which total no more than $50,000 against the licensee under this accelerated process. The commissioner may prorate the amount of claims paid under this subdivision if claims in excess of $50,000 against the licensee are submitted. Any unpaid portions of these claims must be satisfied in the manner set forth in subdivision 7.\nThe court shall conduct a hearing upon such application 30 days after service of the application upon the commissioner. Upon petition of the commissioner, the court shall continue the hearing up to 60 days further; and upon a showing of good cause may continue the hearing for such further period as the court deems appropriate. At the hearing the aggrieved person shall be required to show that the person:\n(a) is not a spouse of debtor, or the personal representative of such spouse;\n(b) has complied with all the requirements of this section;\n(c) has obtained a judgment as set out in subdivision 7, stating the amount thereof and the amount owing thereon at the date of the application;\n(d) has made all reasonable searches and inquiries to ascertain whether the judgment debtor is possessed of real or personal property or other assets, liable to be sold or applied in satisfaction of the judgment;\n(e) by such search has discovered no personal or real property or other assets liable to be sold or applied, or has discovered certain of them, describing them, owned by the judgment debtor and liable to be so applied, and has taken all necessary action and proceedings for the realization thereof, and that the amount thereby realized was insufficient to satisfy the judgment, stating the amount so realized and the balance remaining due on the judgment after application of the amount realized;\n(f) has diligently pursued remedies against all the judgment debtors and all other persons liable to that person in the transaction for which that person seeks recovery from the real estate education, research and recovery fund;\n(g) is making said application no more than one year after the judgment becomes final, or no more than one year after the termination of any review or appeal of the judgment.\nWhenever the court proceeds upon an application as set forth in subdivision 7, it shall order payment out of the fund only upon a determination that the aggrieved party has a valid cause of action within the purview of subdivision 7 and has complied with the provisions of subdivision 9. The judgment shall be only prima facie evidence of such cause of action and for the purposes of this section shall not be conclusive. The commissioner may defend any such action on behalf of the fund and shall have recourse to all appropriate means of defense and review including examination of witnesses. The commissioner may move the court at any time to dismiss the application when it appears there are no triable issues and the petition is without merit. The motion may be supported by affidavit of any person or persons having knowledge of the facts, and may be made on the basis that the petition, and the judgment referred to therein, does not form the basis for a meritorious recovery claim within the purview of subdivision 7; provided, however, the commissioner shall give written notice at least ten days before such motion. The commissioner may, subject to court approval, compromise a claim based upon the application of an aggrieved party but shall not be bound by any prior compromise or stipulation of the judgment debtor.\nThe commissioner may defend any such action on behalf of the fund and shall have recourse to all appropriate means of defense and review, including examination of witnesses. The judgment debtor may defend any such action on the debtor's own behalf and shall have recourse to all appropriate means of defense and review, including examination of witnesses. Whenever an applicant's judgment is by default, stipulation, or consent, or whenever the action against the licensee was defended by a trustee in bankruptcy, the applicant shall have the burden of proving the cause of action for fraudulent, deceptive or dishonest practices, or conversion of trust funds. Otherwise, the judgment shall create a rebuttable presumption of the fraudulent, deceptive or dishonest practices, or conversion of trust funds. This presumption is a presumption affecting the burden of producing evidence.\nIf the court finds after the hearing that said claim should be levied against the fund, the court shall enter an order directed to the commissioner requiring payment from the fund of whatever sum it shall find to be payable upon the claim pursuant to the provisions of and in accordance with the limitations contained in this section.\nShould the commissioner pay from the recovery portion of the fund any amount in settlement of a claim or toward satisfaction of a judgment against a licensee, the license shall be automatically suspended upon the effective date of an order by the court as set forth herein authorizing payment from the recovery portion of the fund. No broker, salesperson, or closing agent shall be granted reinstatement until the person has repaid in full, plus interest at the rate of 12 percent a year, twice the amount paid from the fund on the person's account, and has obtained a surety bond issued by an insurer authorized to transact business in this state in the amount of $40,000. The bond shall be filed with the commissioner, with the state of Minnesota as obligee, conditioned for the prompt payment to any aggrieved person entitled thereto, of any amounts received by the real estate broker, salesperson, or closing agent or to protect any aggrieved person from loss resulting from fraudulent, deceptive, or dishonest practices or conversion of trust funds arising out of any transaction when the real estate broker or salesperson was licensed and performed acts for which a license is required under this chapter. The bond shall remain operative for as long as that real estate broker, salesperson, or closing agent is licensed. No payment shall be made from the fund based upon claims against any broker, salesperson, or closing agent who is granted reinstatement pursuant to this subdivision. A discharge in bankruptcy shall not relieve a person from the penalties and disabilities provided in this section.\nThe commissioner shall satisfy all claims against licensees for which an order pursuant to subdivision 12 directing payment from the recovery portion of the fund has become final during the calendar year. Each claim shall be satisfied by the commissioner by July 15 of the calendar year after the year in which the order directing payment of the claim becomes final, subject to the limitations of this section. If, at the end of any calendar year, the commissioner determines that the courts have issued orders that have become final during the year directing payment out of the recovery portion of the fund in a total amount in excess of the funds available for recovery purposes, the commissioner shall allocate the funds available for recovery purposes among all claimants in the ratio that the amount ordered paid to each claimant bears to the aggregate of all amounts ordered paid. The commissioner shall mail notice of the allocation to all claimants not less than 45 days following the end of the calendar year. Any claimant who objects to the plan of allocation shall file a petition in the District Court of Ramsey or Hennepin County within 20 days of the mailing of notice setting forth the grounds for objection. Upon motion of the commissioner, the court shall summarily dismiss the petition and order distribution in accordance with the proposed plan of allocation unless it finds substantial reason to believe that the distribution would be in violation of the provisions of this section. If a petition is filed, no distribution shall be made except in accordance with a final order of the court. In the event no petition is filed within 20 days of the mailing of notice, the commissioner shall make a distribution in accordance with the plan of allocation. Any distribution made by the commissioner in accordance with this subdivision shall be deemed to satisfy and extinguish the claims of any claimant receiving a distribution against the fund.\nAny sums received by the commissioner pursuant to any provisions of this section shall be deposited in the state treasury, and credited to the real estate education, research and recovery fund, and said sums shall be allocated exclusively for the purposes provided in this section. All moneys in the fund are appropriated annually to the commissioner for the purposes of this section.\nAll money credited to the fund under section 462A.201 may only be used for purposes under subdivision 6, clause (f). Beginning in 1990, the commissioner must, on February 1 of each year, review the amount of money spent or allocated for uses under subdivision 6, clause (f), for the previous calendar year. If the amount spent or allocated is less than the amount credited to the fund under section 462A.201 during the same calendar year, the difference must be transferred from the fund to the housing trust fund account established in section 462A.201. If the fund balance exceeds $4,000,000, the commissioner may suspend the fee imposed under subdivision 3.\nIt shall be unlawful for any person or the agent of any person to knowingly file with the commissioner any notice, statement, or other document required under the provisions of this section which is false or untrue or contains any material misstatement of fact. Such conduct shall constitute a gross misdemeanor.\nWhen, upon the order of the court, the commissioner has paid from the recovery portion of the fund any sum to the judgment creditor, the commissioner shall be subrogated to all of the rights of the judgment creditor to the extent of the amount so paid and the judgment creditor shall assign all right, title and interest in the judgment to the extent of the amount so paid to the commissioner and any amount and interest so recovered by the commissioner on the judgment shall be deposited to the fund.\nNothing contained in this section shall limit the authority of the commissioner to take disciplinary action against any licensee under other provisions of this chapter; nor shall the repayment in full of all obligations to the recovery portion of the fund by any licensee nullify or modify the effect of any other disciplinary proceeding brought pursuant to the provisions of this chapter.\nThe commissioner shall, on or before October 1 in each even-numbered year, prepare and file in the Office of the Governor for the preceding two fiscal years ending June 30 a report on the activities of the real estate education, research and recovery fund; noting the amount of money received by the fund, the amount of money expended and the purposes therefor.",
	"repealed": false
}