{
	"id": "295.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.50",
	"title": "295.50 DEFINITIONS.",
	"text": "For purposes of sections 295.50 to 295.59, the following terms have the meanings given.\n\"Blood components\" means the parts of the blood that are separated from blood by physical or mechanical means and are intended for transfusion. Blood components do not include blood derivatives.\n\"Commissioner\" is the commissioner of revenue.\n\"Delivered outside of Minnesota\" means property which the seller delivers to a common carrier for delivery outside Minnesota, places in the United States mail or parcel post directed to the purchaser outside Minnesota, or delivers to the purchaser outside Minnesota by means of the seller's own delivery vehicles, and which is not later returned to a point within Minnesota, except in the course of interstate commerce.\n\"Emergency medical reasons\" means a public health emergency declaration pursuant to United States Code, title 42, section 247d; a national security or peacetime emergency declared by the governor pursuant to section 12.31; or a situation involving an action by the commissioner of health pursuant to section 144.4197, 144.4198, or 151.37, subdivisions 2, paragraph (b), and 10, except that, for purposes of this subdivision, a drug shortage not caused by a public health emergency shall not constitute an emergency medical reason.\n\"Gross revenues\" are total amounts received in money or otherwise by:\n(1) a hospital for patient services;\n(2) a surgical center for patient services;\n(3) a health care provider, other than a staff model health plan company, for patient services;\n(4) a wholesale drug distributor for sale or distribution of legend drugs that are delivered in Minnesota by the wholesale drug distributor, by common carrier, or by mail, unless the legend drugs are delivered to another wholesale drug distributor who sells legend drugs exclusively at wholesale; and\n(5) a staff model health plan company as gross premiums for enrollees, co-payments, deductibles, coinsurance, and fees for patient services.\n(a) \"Health care provider\" means:\n(1) a person whose health care occupation is regulated or required to be regulated by the state of Minnesota furnishing any or all of the following goods or services directly to a patient or consumer: medical, surgical, optical, visual, dental, hearing, nursing services, drugs, laboratory, diagnostic or therapeutic services;\n(2) a person who provides goods and services not listed in clause (1) that qualify for reimbursement under the medical assistance program provided under chapter 256B;\n(3) a staff model health plan company;\n(4) an ambulance service required to be licensed;\n(5) a person who sells or repairs hearing aids and related equipment or prescription eyewear; or\n(6) a person providing patient services, who does not otherwise meet the definition of health care provider and is not specifically excluded in clause (b), who employs or contracts with a health care provider as defined in clauses (1) to (5) to perform, supervise, otherwise oversee, or consult with regarding patient services.\n(b) Health care provider does not include:\n(1) hospitals; medical supplies distributors, except as specified under paragraph (a), clause (5); nursing homes licensed under chapter 144A or licensed in any other jurisdiction; wholesale drug distributors; pharmacies; surgical centers; bus and taxicab transportation, or any other providers of transportation services other than ambulance services required to be licensed; supervised living facilities for persons with developmental disabilities, licensed under Minnesota Rules, parts 4665.0100 to 4665.9900; housing with services establishments required to be registered under chapter 144D; board and lodging establishments providing only custodial services that are licensed under chapter 157 and registered under section 157.17 to provide supportive services or health supervision services; adult foster homes as defined in Minnesota Rules, part 9555.5105; day training and habilitation services for adults with developmental disabilities as defined in section 252.41, subdivision 3; boarding care homes, as defined in Minnesota Rules, part 4655.0100; and adult day care centers as defined in Minnesota Rules, part 9555.9600;\n(2) home health agencies as defined in Minnesota Rules, part 9505.0175, subpart 15; a person providing personal care services and supervision of personal care services as defined in Minnesota Rules, part 9505.0335; a person providing home care nursing services as defined in Minnesota Rules, part 9505.0360; and home care providers required to be licensed under chapter 144A for home care services provided under chapter 144A;\n(3) a person who employs health care providers solely for the purpose of providing patient services to its employees;\n(4) an educational institution that employs health care providers solely for the purpose of providing patient services to its students if the institution does not receive fee for service payments or payments for extended coverage; and\n(5) a person who receives all payments for patient services from health care providers, surgical centers, or hospitals for goods and services that are taxable to the paying health care providers, surgical centers, or hospitals, as provided under section 295.53, subdivision 1, paragraph (b), clause (3) or (4), or from a source of funds that is excluded or exempt from tax under sections 295.50 to 295.59.\n[Repealed, 1993 c 345 art 13 s 24]\n\"Home health care services\" are services:\n(1) defined under the state medical assistance program as home health agency services provided by a home health agency, personal care services and supervision of personal care services, home care nursing services, and waivered services or services by home care providers required to be licensed under chapter 144A; and\n(2) provided at a recipient's residence, if the recipient does not live in a hospital, nursing facility, as defined in section 62A.46, subdivision 3, or intermediate care facility for persons with developmental disabilities as defined in section 256B.055, subdivision 12, paragraph (d).\n\"Hospice care services\" are services:\n(1) as defined in Minnesota Rules, part 9505.0297; and\n(2) provided at a recipient's residence, if the recipient does not live in a hospital, nursing facility as defined in section 62A.46, subdivision 3, or intermediate care facility for persons with developmental disabilities as defined in section 256B.055, subdivision 12, paragraph (d).\n\"Hospital\" means a hospital licensed under chapter 144, or a hospital licensed by any other jurisdiction.\n\"Manufacturer\" has the meaning provided in section 151.01, subdivision 14a.\n[Repealed, 1996 c 471 art 6 s 13]\n[Repealed, 1996 c 471 art 6 s 13]\n[Repealed, 1996 c 471 art 6 s 13]\n(a) \"Patient services\" means inpatient and outpatient services and other goods and services provided by hospitals, surgical centers, or health care providers. They include the following health care goods and services provided to a patient or consumer:\n(1) bed and board;\n(2) nursing services and other related services;\n(3) use of hospitals, surgical centers, or health care provider facilities;\n(4) medical social services;\n(5) drugs, biologicals, supplies, appliances, and equipment;\n(6) other diagnostic or therapeutic items or services;\n(7) medical or surgical services;\n(8) items and services furnished to ambulatory patients not requiring emergency care; and\n(9) emergency services.\n(b) \"Patient services\" does not include:\n(1) services provided to nursing homes licensed under chapter 144A;\n(2) examinations for purposes of utilization reviews, insurance claims or eligibility, litigation, and employment, including reviews of medical records for those purposes;\n(3) services provided to and by community residential mental health facilities licensed under section 245I.23 or Minnesota Rules, parts 9520.0500 to 9520.0670, and to and by residential treatment programs for children with severe emotional disturbance licensed or certified under chapter 245A;\n(4) services provided under the following programs: day treatment services as defined in section 245.462, subdivision 8; assertive community treatment as described in section 256B.0622; adult rehabilitative mental health services as described in section 256B.0623; crisis response services as described in section 256B.0624; and children's therapeutic services and supports as described in section 256B.0943;\n(5) services provided to and by community mental health centers as defined in section 245.62, subdivision 2;\n(6) services provided to and by assisted living programs and congregate housing programs;\n(7) hospice care services;\n(8) home and community-based waivered services under chapter 256S and sections 256B.49 and 256B.501;\n(9) targeted case management services under sections 256B.0621; 256B.0625, subdivisions 20, 20a, 33, and 44; and 256B.094; and\n(10) services provided to the following: supervised living facilities for persons with developmental disabilities licensed under Minnesota Rules, parts 4665.0100 to 4665.9900; housing with services establishments required to be registered under chapter 144D; board and lodging establishments providing only custodial services that are licensed under chapter 157 and registered under section 157.17 to provide supportive services or health supervision services; adult foster homes as defined in Minnesota Rules, part 9555.5105; day training and habilitation services for adults with developmental disabilities as defined in section 252.41, subdivision 3; boarding care homes as defined in Minnesota Rules, part 4655.0100; adult day care services as defined in section 245A.02, subdivision 2a; and home health agencies as defined in Minnesota Rules, part 9505.0175, subpart 15, or licensed under chapter 144A.\n\"Person\" means an individual, partnership, limited liability company, corporation, association, governmental unit or agency, or public or private organization of any kind.\n[Repealed, 1993 c 345 art 13 s 24]\n\"Pharmacy\" means a pharmacy required to be licensed under chapter 151, or a pharmacy required to be licensed by any other jurisdiction.\nMS 2022 [Repealed, 2023 c 25 s 190]\n\"Pharmacy benefits manager\" means an entity that performs pharmacy benefits management.\n[Repealed, 1996 c 471 art 6 s 13]\n[Repealed, 1996 c 471 art 6 s 13]\n[Repealed, 1996 c 471 art 6 s 13]\n\"Staff model health plan company\" means a health plan company as defined in section 62Q.01, subdivision 4, which employs one or more types of health care provider to deliver health care services to the health plan company's enrollees.\n\"Surgical center\" is an outpatient surgical center as defined in Minnesota Rules, chapter 4675, or a similar facility located in any other jurisdiction.\n\"Third-party purchaser of health care services\" includes but is not limited to a health carrier or community integrated service network that pays for health care services on behalf of patients or that reimburses, indemnifies, compensates, or otherwise insures patients for health care services.\n\"Wholesale drug distributor\" means any person engaged in wholesale drug distribution including but not limited to manufacturers; repackagers; own-label distributors; jobbers; brokers; warehouses, including manufacturers' and distributors' warehouses, chain drug warehouses, and wholesale drug warehouses; independent wholesale drug traders; and pharmacies that conduct wholesale drug distribution. A wholesale drug distributor does not include a common carrier or individual hired primarily to transport legend drugs.\n\"Legend drug\" means a drug that is required by federal law to bear one of the following statements: \"Caution: Federal law prohibits dispensing without prescription\" or \"Rx only.\" Legend drugs do not include nutritional products as defined in Minnesota Rules, part 9505.0325, subpart 1, and blood and blood components.\n\"Wholesale drug distribution\" means the sale or distribution of legend drugs to a person other than a consumer or patient, but does not include:\n(1) a sale between a division, subsidiary, parent, affiliated, or related company under the common ownership and control of a corporate entity;\n(2) the purchase or other acquisition, by a hospital or other health care entity that is a member of a group purchasing organization, of a legend drug for its own use from the organization or from other hospitals or health care entities that are members of such organizations;\n(3) the sale, purchase, or trade of a legend drug by a charitable organization described in section 501(c)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1988, to a nonprofit affiliate of the organization to the extent otherwise permitted by law;\n(4) the sale, purchase, or trade of a legend drug among hospitals or other health care entities that are under common control;\n(5) the sale, purchase, or trade of a legend drug for emergency medical reasons;\n(6) the transfer of legend drugs by a retail pharmacy to another retail pharmacy to alleviate a temporary shortage; or\n(7) the distribution of legend drug samples by manufacturer representatives.",
	"repealed": false
}