{
	"id": "256G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256G.02",
	"title": "256G.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Board and lodging facility\" means a facility that serves as an alternative to institutionalization and provides a program of on-site care or supervision to persons who cannot live independently in the community because of age or physical, mental, or emotional disability.\n\"Commissioner\" means the commissioner of human services.\n(a) \"County of financial responsibility\" has the meanings in paragraphs (b) to (f).\n(b) For an applicant who resides in the state and is not in a facility described in subdivision 6, it means the county in which the applicant resides at the time of application.\n(c) For an applicant who resides in a facility described in subdivision 6, it means the county in which the applicant last resided in nonexcluded status immediately before entering the facility.\n(d) For an applicant who has not resided in this state for any time other than the excluded time, and subject to the limitations in section 256G.03, subdivision 2, it means the county in which the applicant resides at the time of making application.\n(e) For an individual already having a social service case open in one county, financial responsibility for any additional social services attaches to the case that has the earliest date of application and has been open without interruption.\n(f) Notwithstanding paragraphs (b) to (e), the county of financial responsibility for semi-independent living services provided under section 252.275, and chapter 245D, is the county of residence in nonexcluded status immediately before the placement into or request for those services.\n\"Department\" means the Department of Human Services.\n\"Direct Care and Treatment executive board\" or \"executive board\" means the Direct Care and Treatment executive board established under section 246C.06.\n\"Excluded time\" means:\n(1) any period an applicant spends in a hospital, sanitarium, nursing home, shelter other than an emergency shelter, halfway house, foster home, community residential setting licensed under chapter 245D, semi-independent living domicile or services program, residential facility offering care, board and lodging facility or other institution for the hospitalization or care of human beings, as defined in section 144.50, 144A.01, or 245A.02, subdivision 14; maternity home, battered women's shelter, or correctional facility; or any facility based on an emergency hold under section 253B.05, subdivisions 1 and 2;\n(2) any period an applicant spends on a placement basis in a training and habilitation program, including: a rehabilitation facility or work or employment program as defined in section 268A.01; semi-independent living services provided under section 252.275, and chapter 245D; or day training and habilitation programs;\n(3) any period an applicant is receiving assisted living services, integrated community supports, or day support services; and\n(4) any placement for a person with an indeterminate commitment, including independent living.\n\"Local agency\" means the agency designated by the county board of commissioners, human services boards, local social services agencies in the several counties of the state or multicounty local social services agencies where those have been established in accordance with law.\n\"Reside\" means to have an established place of abode in one state or county and not to have an established place of abode in another state or county.",
	"repealed": false
}