{
	"id": "168B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/168B.10",
	"title": "168B.10 CONTRACTS; REIMBURSEMENT BY AGENCY.",
	"text": "If a unit of government enters into a contract with a person licensed by the agency pursuant to this section or a contract pursuant to section 168B.09 the agency may review the contract to determine whether it conforms to the agency's plan for solid waste management and is in compliance with agency rules. A contract that does so conform may be approved by the agency. Where a contract has been approved, the agency may reimburse the unit of government for the costs incurred under the contract that have not been reimbursed under section 168B.08. Except as otherwise provided in section 168B.09, the agency shall not approve any contract that (1) has been entered into without prior notice to and request for bids from all persons duly licensed by the agency pursuant to subdivision 2; (2) does not provide for a full performance bond; or (3) does not provide for total collection and transportation of abandoned motor vehicles, except that the agency may approve a contract covering solely collection or transportation of abandoned motor vehicles where the agency determines total collection and transportation to be impracticable and where all other requirements herein have been met and the unit of government, after proper notice and request for bids, has not received any bid for total collection and transportation of abandoned motor vehicles.\nThe agency may issue a license to any person desiring to be a party to a disposal contract who meets the requirements for solid waste disposers established by the agency pursuant to section 116.07.\nIf a unit of government utilizes its own equipment and personnel pursuant to its authority under section 168B.09, and the use of the equipment and personnel conforms to the agency's plan for solid waste management and is in compliance with agency rules, that government may be reimbursed by the agency for reasonable costs incurred which are not reimbursed under section 168B.08.\nThe agency may demand that a unit of government contract for the disposal of abandoned motor vehicles and other scrap metal pursuant to the agency's plan for solid waste disposal. Where the unit of government fails to so contract within 180 days of the demand, the agency, through the Department of Administration and on behalf of such unit of government, may contract with any person duly licensed by the agency for such disposal.\nThe agency may reimburse the government entities of Indian reservations for the costs associated with the inventory, collection, storage and transportation of abandoned motor vehicles and abandoned scrap metal which are voluntarily surrendered by their owners or which are otherwise lawfully acquired by the Indian reservation. Such reimbursement may be made for only those costs, and under the same conditions, for which a unit of government may be reimbursed under subdivisions 1 and 3.",
	"repealed": false
}