{
	"id": "317A.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.435",
	"title": "317A.435 NOTICE REQUIREMENTS.",
	"text": "Notice of meetings of members must be given to every member with voting rights as of the record date determined under section 317A.437. If the meeting is an adjourned meeting and the date, time, and place of the meeting were announced at the time of adjournment, notice is not required unless a new record date for the adjourned meeting is or must be fixed under section 317A.437.\nIn all cases where a specific minimum notice period has not been fixed by law, the notice must be given at least five days before the date of the meeting, or a shorter time provided in the articles or bylaws, and not more than 60 days before the date of the meeting. The notice must contain the date, time, and place of the meeting, and other information required by this chapter. If proxies are permitted at the meeting, the notice must so inform members and state the procedure for appointing proxies.\nA member may waive notice of a meeting of members. A waiver of notice by a member entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, or by attendance. Attendance by a member at a meeting is a waiver of notice of that meeting, unless the member objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened, or objects before a vote on an item of business because the item may not lawfully be considered at that meeting and does not participate in the consideration of the item at that meeting.\n(a) A neighborhood organization must hold an annual meeting at which there must be an election of successors to directors whose terms expire at the annual meeting. Notwithstanding subdivisions 1 and 2, notice of a meeting to elect directors and any other meeting at which articles or bylaws are proposed to be amended must be given as specified by this subdivision. The articles or bylaws of a neighborhood organization may provide for electing directors by petition, if notice of the petition process is given as provided by this subdivision.\n(b) At least ten but not more than 30 days before a meeting of the members of the neighborhood organization is to be held, notice of the date, time, and place of the meeting or the date and process applicable to petitions and any other information required by this chapter must be given in a manner designed to notify all members with voting rights to the extent practical.\n(c) For purposes of this subdivision, \"neighborhood organization\" means a nonprofit corporation under this chapter that represents a defined geographic area and has been accepted by a political subdivision as the basic planning unit for the area. \"Neighborhood organization\" does not include a unit owners' association under chapter 515B or a planned unit development or homeowners' association that consists exclusively of property owners within a defined geographic area.\n(d) A neighborhood organization may choose to be governed by this subdivision by so providing in its articles or bylaws.",
	"repealed": false
}