{
	"id": "103F.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.06",
	"title": "103F.06 SOIL HEALTH PRACTICES PROGRAM.",
	"text": "(a) In this section, the following terms have the meanings given:\n(1) \"board\" means the Board of Water and Soil Resources;\n(2) \"local units of government\" has the meaning given under section 103B.305, subdivision 5; and\n(3) \"soil health\" has the meaning given under section 103C.101, subdivision 10a.\n(a) The board must administer a financial and technical support program to produce soil health practices that achieve water quality, soil productivity, climate change resiliency, or carbon sequestration benefits or reduce pesticide and fertilizer use.\n(b) The program must include but is not limited to no till, field borders, prairie strips, cover crops, and other practices sanctioned by the board or the United States Department of Agriculture's Natural Resources Conservation Service.\n(a) The board may provide financial and technical support to local units of government, private sector organizations, and farmers to establish soil health practices and related practices with climate and water-quality benefits.\n(b) The board must establish practices and costs that are eligible for financial and technical support under this section.\n(a) The board may employ staff or enter into external agreements to implement this section.\n(b) The board must assist local units of government in achieving the objectives of the program, including assessing practice standards and program effectiveness.\nThe board must regularly review and optimize the availability of federal funds and programs to supplement or complement state and other efforts consistent with the purposes of this section.\nThe board, in consultation with the commissioner of agriculture, may cooperate with the United States Department of Agriculture, other federal and state agencies, local governments, and private sector organizations to establish soil health goals for the state that will achieve water quality, soil productivity, climate change resiliency, and carbon sequestration benefits and reduce pesticide and fertilizer use.",
	"repealed": false
}