{
	"id": "144H.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/144H.01",
	"title": "144H.01 DEFINITIONS.",
	"text": "The terms defined in this section apply to this chapter.\n\"Basic services\" includes but is not limited to:\n(1) the development, implementation, and monitoring of a comprehensive protocol of care that is developed in conjunction with the parent or guardian of a medically complex or technologically dependent child and that specifies the medical, nursing, psychosocial, and developmental therapies required by the medically complex or technologically dependent child; and\n(2) the caregiver training needs of the child's parent or guardian.\n\"Commissioner\" means the commissioner of health.\n\"Licensee\" means an owner of a prescribed pediatric extended care (PPEC) center licensed under this chapter.\n\"Medically complex or technologically dependent child\" means a child under 21 years of age who, because of a medical condition, requires continuous therapeutic interventions or skilled nursing supervision which must be prescribed by a licensed physician and administered by, or under the direct supervision of, a licensed registered nurse.\n\"Owner\" means an individual whose ownership interest provides sufficient authority or control to affect or change decisions regarding the operation of the PPEC center. An owner includes a sole proprietor, a general partner, or any other individual whose ownership interest has the ability to affect the management and direction of the PPEC center's policies.\n\"Prescribed pediatric extended care center,\" \"PPEC center,\" or \"center\" means any facility that provides nonresidential basic services to three or more medically complex or technologically dependent children who require such services and who are not related to the owner by blood, marriage, or adoption.\n\"Supportive services or contracted services\" include but are not limited to speech therapy, occupational therapy, physical therapy, social work services, developmental services, child life services, and psychology services.",
	"repealed": false
}