{
	"id": "148E.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.225",
	"title": "148E.225 TREATMENT AND INTERVENTION SERVICES.",
	"text": "A social worker must base treatment and intervention services on an assessment or diagnosis. A social worker must evaluate, on an ongoing basis, the appropriateness of the assessment or diagnosis.\nA social worker must not use an assessment or diagnostic instrument without adequate training. A social worker must follow standards and accepted procedures for using an assessment or diagnostic instrument. A social worker must inform a client of the purpose before administering the instrument and must make the results available to the client.\nA social worker must develop a plan for services that includes goals based on the assessment or diagnosis. A social worker must evaluate, on an ongoing basis, the appropriateness of the plan and the client's progress toward the goals.\n(a) A social worker must make and maintain current and accurate records, appropriate to the circumstances, of all services provided to a client. At a minimum, the records must contain documentation of:\n(1) the assessment or diagnosis;\n(2) the content of the service plan;\n(3) progress with the plan and any revisions of assessment, diagnosis, or plan;\n(4) any fees charged and payments made;\n(5) copies of all client-written authorizations for release of information; and\n(6) other information necessary to provide appropriate services.\n(b) These records must be maintained by the social worker for at least seven years after the last date of service to the client. Social workers who are employed by an agency or other entity are not required to:\n(1) maintain personal or separate records; or\n(2) personally retain records at the conclusion of their employment.\nA social worker must terminate a professional relationship with a client when the social worker reasonably determines that the client is not likely to benefit from continued services or the services are no longer needed, unless the social worker is required by law to provide services. A social worker who anticipates terminating services must give reasonable notice to the client in a manner that is appropriate to the needs of the client. The social worker must provide appropriate referrals as needed or upon request of the client.",
	"repealed": false
}