{
	"id": "354.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.72",
	"title": "354.72 AUTHORIZED LEAVE OF ABSENCE AND STRIKE PERIOD SERVICE CREDIT PURCHASE PROCEDURE.",
	"text": "This section applies to any strike period under section 354.05, subdivision 13, clause (6), and to any period of authorized leave of absence under sections 354.093, 354.094, 354.095, and 354.096 for which the teacher obtains credit for allowable service by making payment as specified in this section to the Teachers Retirement Association fund. Each year of an extended leave of absence under section 354.094 is considered to be a separate leave for purposes of this section.\n(a) A teacher may purchase credit for allowable and formula service in the plan for a period specified in subdivision 1 if the teacher makes a payment as specified in paragraph (b), (c), or (d), whichever applies. The employing unit, at its option, may pay the employer portion of the amount on behalf of its employees.\n(b) If payment is received by the executive director by June 30 of the fiscal year of the strike period or by December 31 of the fiscal year following an authorized leave included under section 354.093, 354.095, or 354.096, payment must equal the total employee and employer contribution rates, including amortization contribution rates if applicable, multiplied by the member's average monthly salary rate on the date the leave or strike period commenced, multiplied by the months and portions of a month of the leave or strike period for which the teacher seeks allowable service credit. This paragraph also applies to an extended leave under section 354.094, except that payment must be received by June 30 of the year of the leave, and the salary used in the computation is the salary received during the year immediately preceding the initial year of the leave.\n(c) If payment is made after June 30 and before the following June 30 for a strike period, or after December 31 of the fiscal year following a leave of absence under section 354.093, 354.095, or 354.096, and before July 1, the payment must include the amount determined in paragraph (b) plus compound interest at the applicable monthly rate or rates specified in section 356.59, subdivision 4, from June 30 for a strike period, or from December 31 for a leave under section 354.093, 354.095, or 354.096, until the last day of the month in which payment is received. If payment is made on or after July 1 and before the following July 1 for an extended leave of absence under section 354.094, the payment must include the amount determined in paragraph (b) plus compound interest at the applicable monthly rate or rates specified in section 356.59, subdivision 4, from June 30 until the last day of the month in which payment is received.\n(d) If payment is received by the executive director after the applicable last permitted date under paragraph (c), the payment amount is the amount determined under section 356.551. Notwithstanding payment deadlines specified in section 356.551, payment under this section may be made anytime before the effective date of retirement.",
	"repealed": false
}