{
	"id": "124D.901",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.901",
	"title": "124D.901 STUDENT SUPPORT PERSONNEL AID.",
	"text": "For the purposes of this section, the following terms have the meanings given:\n(1) \"new position\" means a student support services personnel full-time or part-time position not under contract by a school district, charter school, or cooperative unit at the start of the 2022-2023 school year;\n(2) \"part-time position\" means a student support services personnel position less than 1.0 full-time equivalent at the start of the 2022-2023 school year;\n(3) \"American Rescue Plan Act\" means the federal American Rescue Plan Act of 2021, Public Law 117-2, that awarded funds; and\n(4) \"student support services personnel\" means an individual licensed to serve as a school counselor, school psychologist, school social worker, school nurse, or chemical dependency counselor in Minnesota.\nThe purpose of student support personnel aid is to:\n(1) address shortages of student support services personnel within Minnesota schools;\n(2) decrease caseloads for existing student support services personnel to ensure effective services;\n(3) ensure that students receive effective student support services and integrated and comprehensive services to improve prekindergarten through grade 12 academic, physical, social, and emotional outcomes supporting career and college readiness and effective school mental health services;\n(4) ensure that student support services personnel serve within the scope and practice of their training and licensure;\n(5) fully integrate learning supports, instruction, assessment, data-based decision making, and family and community engagement within a comprehensive approach that facilitates interdisciplinary collaboration; and\n(6) improve student health, school safety, and school climate to support academic success and career and college readiness.\n(a) The initial student support personnel aid for a school district equals the greater of the student support personnel allowance times the adjusted pupil units at the district for the current fiscal year or $40,000. The initial student support personnel aid for a charter school equals the greater of the student support personnel allowance times the adjusted pupil units at the charter school for the current fiscal year or $20,000. Aid under this paragraph must be reserved in a fund balance that, beginning in fiscal year 2025, may not exceed the greater of the aid entitlement in the prior fiscal year or the fund balance in the prior fiscal year.\n(b) The cooperative student support personnel aid for a school district that is a member of an intermediate school district or other cooperative unit that serves students equals the greater of the cooperative student support allowance times the adjusted pupil units at the district for the current fiscal year or $40,000. If a district is a member of more than one cooperative unit that serves students, the revenue must be allocated among the cooperative units. Aid under this paragraph must not exceed actual expenditures.\n(c) The student support personnel allowance equals $11.94 for fiscal year 2024, $17.08 for fiscal year 2025, and $48.73 for fiscal year 2026 and later.\n(d) The cooperative student support allowance equals $0.60 for fiscal year 2024, $0.85 for fiscal year 2025, and $2.44 for fiscal year 2026 and later.\n(a) Aid under this section must be used to hire new positions for student support services personnel or increase a current position that is less than 1.0 full-time equivalent to a greater number of service hours or make permanent a position hired using onetime resources awarded through the federal Coronavirus Aid Relief and Economic Security Act, the federal Consolidated Appropriations Act, the federal Division M-Coronavirus Response and Relief Supplemental Appropriations Act, or the federal American Rescue Plan Act, or to maintain a position that would otherwise be eliminated.\n(b) Cooperative student support personnel aid must be transferred to the intermediate district or other cooperative unit of which the district is a member and used to hire new positions for student support services personnel or increase a current position that is less than 1.0 full-time equivalent to a greater number of service hours or make permanent a position hired using onetime resources awarded through the American Rescue Plan Act at the intermediate district or cooperative unit.\n(c) If a school district, charter school, or cooperative unit does not receive at least two applications and is not able to hire a new full-time equivalent position with student support personnel aid, the aid may be used for contracted services from individuals licensed to serve as a school counselor, school psychologist, school social worker, school nurse, or chemical dependency counselor in Minnesota.\nBy February 1 following any fiscal year in which student support personnel aid was received, a school district, charter school, or cooperative unit must submit a written report to the commissioner indicating how the new position affected two or more of the following measures:\n(1) school climate;\n(2) student health;\n(3) attendance rates;\n(4) academic achievement;\n(5) career and college readiness; and\n(6) postsecondary completion rates.",
	"repealed": false
}