{
	"id": "41A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.14",
	"title": "41A.14 AGRICULTURE RESEARCH, EDUCATION, EXTENSION, AND TECHNOLOGY TRANSFER GRANT PROGRAM.",
	"text": "The agriculture research, education, extension, and technology transfer grant program is created. The purpose of the grant program is to provide investments that will most efficiently achieve long-term agricultural productivity increases through improved infrastructure, vision, and accountability. The scope and intent of the grants, to the extent possible, shall provide for long-term base funding that allows the grantee to continue the functions of the research, education, extension, and technology transfer efforts to a practical conclusion. Priority for grants shall be given to human infrastructure. The commissioner shall provide grants for:\n(1) agricultural research, extension, and technology transfer needs at the University of Minnesota for use by any of the following:\n(i) the College of Food, Agricultural and Natural Resource Sciences;\n(ii) the Minnesota Agricultural Experiment Station;\n(iii) the University of Minnesota Extension Service;\n(iv) the University of Minnesota Veterinary School;\n(v) the Veterinary Diagnostic Laboratory; or\n(vi) the Stakman-Borlaug Center;\n(2) agriculture rapid response for plant and animal diseases and pests; and\n(3) agricultural education including but not limited to the Minnesota Agriculture Education Leadership Council, farm business management, mentoring programs, graduate debt forgiveness, and high school programs.\n(a) In awarding grants under this section, the commissioner and a representative of the College of Food, Agricultural and Natural Resource Sciences at the University of Minnesota must consult with an advisory panel consisting of the following stakeholders:\n(1) a representative of the Minnesota State Colleges and Universities system;\n(2) a representative of the Minnesota Farm Bureau;\n(3) a representative of the Minnesota Farmers Union;\n(4) a person representing agriculture industry statewide;\n(5) a representative of each of the state commodity councils organized under section 17.54 and the Minnesota Pork Board;\n(6) a person representing an association of primary manufacturers of forest products;\n(7) a person representing organic or sustainable agriculture;\n(8) a person representing statewide environment and natural resource conservation organizations; and\n(9) a person representing the interests of Minnesota Tribal governments as defined in section 10.65, subdivision 2, paragraph (a), clause (4).\n(b) Members under paragraph (a), clauses (1) to (3) and (5), shall be chosen by their respective organizations. The member under paragraph (a), clause (9), may be appointed by the Minnesota Indian Affairs Council at the council's discretion.\nAn agriculture research, education, extension, and technology transfer account is created in the agricultural fund in the state treasury. The account consists of money received in the form of gifts, grants, reimbursement, or appropriations from any source for any of the purposes provided in subdivision 1, and any interest or earnings of the account. Money in the account is appropriated to the commissioner of agriculture for the purposes under subdivision 1.",
	"repealed": false
}