{
	"id": "471.476",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.476",
	"title": "471.476 AMBULANCE SERVICES, HENNEPIN COUNTY EXCEPTION.",
	"text": "Any county, except Hennepin County, city, however organized, town or hospital district, either singly or jointly in accordance with an agreement made pursuant to section 471.59, may provide general ambulance services. In providing such service the political subdivision may purchase, rent or lease ambulances and related equipment and supplies; may contract for such service with any person, firm, corporation or other political subdivision upon such terms and conditions as may be agreed upon and may employ and train personnel for such service. Ambulance service authorized by this section may be provided both inside and outside the boundaries of the political subdivision and may be furnished to nonresidents as well as residents.\nAny such political subdivision providing a general ambulance service pursuant to this section may levy an annual tax over and above any statutory or charter limitation and may also impose reasonable charges for ambulance services in order to finance the cost of such service. Any governing body may appropriate money as necessary from funds received for the purposes of Laws 1969, chapter 333, or from any surplus in general revenue funds of the political subdivision.\nAny city, however organized, may issue bonds for the acquisition of ambulances and related equipment notwithstanding the provisions of any other statute or charter.\nAny organized town may in the manner hereinafter provided provide general ambulance service for a portion or portions of the territory within the town outside the boundaries of any incorporated municipality, and may levy the tax authorized by this section on the portion or portions so served. To establish such service, the town board shall adopt a resolution describing with particularity the territory to be served and shall transmit a certified copy of the resolution to the county auditor. The territory described in the resolution shall be compact and contiguous in nature. The town board may thereafter annually levy such tax on the territory described as may be necessary to provide the ambulance service. Upon the certification of such tax by the town board to the county auditor, the auditor shall thereupon spread the tax upon the property described in the resolution and the same shall be collected and distributed as other taxes for use by the town board for ambulance service within the territory described in the resolution.",
	"repealed": false
}