{
	"id": "97B.647",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.647",
	"title": "97B.647 TAKING WOLVES.",
	"text": "Except as provided under section 97B.645 or 97B.671, a person may not take a wolf without a wolf-hunting or wolf-trapping license.\nWolves may be taken with legal firearms, with bow and arrow, and by trapping. The open season to take wolves with firearms begins each year on the same day as the opening of the firearms deer-hunting season. The commissioner may by rule prescribe the open seasons for wolves according to this subdivision.\nThe commissioner may by rule designate areas where wolves may be taken.\nThe commissioner may establish by rule the daily and possession limits for wolves.\nThe commissioner may by rule limit the number of persons that may hunt or trap wolves in an area, if it is necessary to prevent an overharvest or improve the distribution of hunters and trappers. The commissioner shall establish a method, including a drawing, to impartially select the hunters and trappers for an area.\nAn application for a wolf-hunting or wolf-trapping license must be made in a manner provided by the commissioner and accompanied by a $4 application fee and proof that the applicant holds a current or previous year hunting license. The $4 application fee shall be credited to the wolf management and monitoring account and appropriated to the commissioner to pay for costs associated with conducting the wolf license drawing and wolf management. A person may not make more than one application for each season as prescribed by the commissioner. If a person makes more than one application, the person is ineligible for a license for that season after determination by the commissioner, without a hearing.\nThe commissioner may by rule set an annual quota for the number of wolves that can be taken by hunting and trapping. The commissioner may establish a method to monitor harvest and close the season when the quota is reached. The commissioner shall reserve a portion of the annual quota for the trapping season.",
	"repealed": false
}