{
	"id": "282.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.018",
	"title": "282.018 LAND BY PUBLIC WATERS, NONFORESTED MARGINAL LAND, WETLANDS.",
	"text": "(a) All land which is the property of the state as a result of forfeiture to the state for nonpayment of taxes, regardless of whether the land is held in trust for taxing districts, and which borders on or is adjacent to meandered lakes and other public waters and watercourses, and the live timber growing or being thereon, is hereby withdrawn from sale except as hereinafter provided. The authority having jurisdiction over the timber on any of these lands may sell the timber as otherwise provided by law for cutting and removal under the conditions as the authority may prescribe in accordance with approved, sustained yield forestry practices. The authority having jurisdiction over the timber shall reserve the timber and impose the conditions as the authority deems necessary for the protection of watersheds, wildlife habitat, shorelines, and scenic features. Within the area in Cook, Lake, and St. Louis counties described in the Act of Congress approved July 10, 1930 (46 Stat. 1020), the timber on tax-forfeited lands shall be subject to like restrictions as are now imposed by that act on federal lands.\n(b) Of all tax-forfeited land bordering on or adjacent to meandered lakes and other public waters and watercourses and so withdrawn from sale, a strip two rods in width, the ordinary high-water mark being the waterside boundary thereof, and the land side boundary thereof being a line drawn parallel to the ordinary high-water mark and two rods distant landward therefrom, hereby is reserved for public travel thereon, and whatever the conformation of the shore line or conditions require, the authority having jurisdiction over these lands shall reserve a wider strip for these purposes.\n(c) Any tract or parcel of land which has 150 feet or less of waterfront may be sold by the authority having jurisdiction over the land, in the manner otherwise provided by law for the sale of the lands, if the authority determines that it is in the public interest to do so. Any tract or parcel of land within a plat of record bordering on or adjacent to meandered lakes and other public waters and watercourses may be sold by the authority having jurisdiction over the land, in the manner otherwise provided by law for the sale of the lands, if the authority determines that it is in the public interest to do so. If the authority having jurisdiction over the land is not the commissioner of natural resources, the land may not be offered for sale without the prior approval of the commissioner of natural resources.\n(d) Where the authority having jurisdiction over lands withdrawn from sale under this section is not the commissioner of natural resources, the authority may submit proposals for disposition of the lands to the commissioner. The commissioner of natural resources shall evaluate the lands and their public benefits and make recommendations on the proposed dispositions to the committees of the legislature with jurisdiction over natural resources. The commissioner shall include any recommendations of the commissioner for disposition of lands withdrawn from sale under this section over which the commissioner has jurisdiction. The commissioner's recommendations may include a public sale, sale to a private party, acquisition by the Department of Natural Resources for public purposes, or a cooperative management agreement with, or transfer to, another unit of government.\n(e) Notwithstanding this subdivision, a county may sell property governed by this section upon written authorization from the commissioner of natural resources. Prior to the sale or conveyance of lands under this subdivision, the county board must give notice of its intent to meet for that purpose as provided in section 282.01, subdivision 1.\nNonforested marginal land and wetlands on land that is property of the state as a result of forfeiture to the state for nonpayment of taxes is withdrawn from sale as provided in section 103F.535 unless:\n(1) notice of the existence of the nonforested marginal land or wetlands, in a form prescribed by the Board of Water and Soil Resources, is provided to prospective purchasers; and\n(2) the deed contains a restrictive covenant, in a form prescribed by the Board of Water and Soil Resources, that precludes enrollment of the land in a state-funded program providing compensation for conservation of marginal land or wetlands.",
	"repealed": false
}