{
	"id": "116J.417",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.417",
	"title": "116J.417 GREATER MINNESOTA CHILD CARE FACILITY CAPITAL GRANT PROGRAM.",
	"text": "The purpose of the greater Minnesota child care facility capital grant program established in this section is to keep or enhance jobs, increase the tax base, or expand or create new economic development in the area in which the grants are made, by providing facilities for the child care necessary to support workers and their families.\nTwo greater Minnesota child care facility capital grant accounts are created. One account is created in the general fund and one in the bond proceeds fund. Money in the accounts is appropriated to the commissioner to make grants under this section. Money in the greater Minnesota child care facility capital grant accounts is available until encumbered or spent subject to section 16A.642.\n(a) A city, county, or school district, or a joint powers board established by two or more cities, counties, or school districts is eligible to apply for and receive a grant from either greater Minnesota child care facility capital grant account established in this section.\n(b) A private child care provider licensed as a child care center or to provide in-home family child care is eligible to apply for and receive a grant from the greater Minnesota child care facility capital grant account in the general fund.\n(c) An applicant must be located outside of the metropolitan area as defined in section 473.121, subdivision 2.\nA city, county, or school district may own a child care facility and operate a child care facility program that meets the requirements for state licensing under Minnesota Rules, chapter 9503. A city, county, or school district may enter into a lease or management agreement with one or more licensed child care providers to operate a child care program in a facility owned by the city, county, or school district. A lease or management agreement for state bond-financed property is subject to section 16A.695.\n(a) A grant may be used to acquire land or an interest in land, predesign, design, renovate, construct, furnish, and equip facilities in which to provide child care or for other child care facility improvements that support the purposes for which this grant program is established. Money from the account in the general fund may also be used to upgrade or expand existing nonprofit child care facilities for purposes of meeting state requirements.\n(b) All projects must increase child care capacity in the community that is served by the provider and meet all state requirements for child care facilities or programs.\n(a) The commissioner shall make grants to eligible applicants to provide up to 50 percent of the capital costs of eligible child care facility capital projects. An eligible applicant receiving a grant must provide for the remainder of the costs of the project, either in cash or in kind. In-kind contributions may include the cost of project elements made before or after the grant award is made.\n(b) The commissioner may also distribute money from the general fund account through a regional organization within the meaning of section 15.75 to provide grants to eligible applicants based on the manner of application and criteria established by the commissioner.\n(c) If the commissioner awards a grant for less than 50 percent of the project cost, the commissioner must provide the applicant and the chairs and ranking minority members of the senate and house of representatives committees with jurisdiction over economic development finance a written explanation for awarding less than 50 percent.\nThe commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section. An applicant shall apply for a grant in the manner and at the times the commissioner shall determine. At a minimum, an application must include:\n(1) evidence of the need for improved, expanded, or new child care facilities in the area;\n(2) a description of the new or expanded facility or other improvements to be made;\n(3) a description of the specific state requirements making improvements necessary, if applicable;\n(4) estimated costs of the capital project and the sources of funding to complete it;\n(5) estimated costs of the expanded services and the sources of funding to provide them;\n(6) the applicant's analysis of the expected economic benefits to the area in which the project would be located;\n(7) the feasibility study that shows the financial and operational sustainability of the project funded;\n(8) the average number of children provided care by the applicant during the year prior to the application, if any, and the expected number of children that could be provided child care after the proposed project is completed; and\n(9) other information that the commissioner determines is necessary or useful in evaluating the impact of the proposed project on the local economy.\nGrants must not be awarded for more than $500,000 per project or more than $2,000,000 in two years to an applicant for one or more projects in the same city or county.\nIf the commissioner determines that a grantee is unable to proceed with an approved project or has not expended or obligated the grant money within five years of entering into the grant agreement with the commissioner, the commissioner shall cancel the grant and the money is available for the commissioner to make other grants under this section. Money made available to the commissioner from a canceled grant is subject to cancellation under section 16A.642 as if it had been appropriated to the program in the year in which the grant is canceled.",
	"repealed": false
}