{
	"id": "13.383",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.383",
	"title": "13.383 HEALTH OCCUPATIONS INVESTIGATIVE DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 16 are codified outside this chapter. Those sections classify health occupations investigative data as other than public, place restrictions on access to government data, or involve data sharing.\nReports of emergency medical technician, emergency medical technician-intermediate, emergency medical technician-paramedic, or first responder misconduct are classified under section 144E.305, subdivision 3.\nData relating to investigations and disciplinary actions under section 146A.06 are governed by subdivision 2 of that section.\n(a) Disciplinary data generally. Data held by the Board of Medical Practice in connection with disciplinary matters are classified under section 147.01, subdivision 4. The administrative record of any disciplinary action taken by the Board of Medical Practice under sections 147.01 to 147.22 is sealed upon judicial review as provided in section 147.151.\n(b) Required examinations; physician's medical record. Data obtained by the Board of Medical Practice when requiring a mental or physical examination of a physician or when accessing a physician's medical records are classified under section 147.091, subdivision 6.\n(c) Sexual misconduct. Certain data relating to sexual misconduct are classified under section 147.092.\n(d) Reports of violations. Certain reports of violations submitted to the Board of Medical Practice are classified under section 147.121.\n(e) Patient medical records. Patient medical records provided to the Board of Medical Practice under section 147.131 are classified under that section.\n(a) Required examinations; physician assistant's medical records. Data obtained by the Medical Practices Board when requiring a mental or physical examination of a physician assistant or when accessing a physician assistant's medical records are classified under section 147A.13, subdivision 6.\n(b) Sharing complaint information. Sharing of complaint information regarding a physician assistant is governed by section 147A.26.\nData of the Board of Chiropractic Examiners and the peer review committee are classified under sections 148.10, subdivision 1, and 148.106, subdivision 10.\n(a) Required examinations; nurse's medical records. Data obtained by the Board of Nursing when requiring a mental or physical examination of a nurse or when accessing a nurse's medical records are classified under section 148.261, subdivision 5.\n(b) Reports of violations. Certain reports of violations submitted to the Board of Nursing are classified under section 148.264.\n(c) Patient medical records. Medical records of a patient cared for by a nurse who is under review by the Board of Nursing are classified under sections 148.191, subdivision 2, and 148.265.\n(d) Records of nurse disciplinary action. The administrative records of any disciplinary action taken by the Board of Nursing under sections 148.171 to 148.285 are sealed upon judicial review as provided in section 148.266.\nClient records of a patient cared for by a psychologist or psychological practitioner who is under review by the Board of Psychology are classified under section 148.941, subdivision 4. Data obtained by the Board of Psychology when requiring a mental, physical, or substance use disorder examination or evaluation of a regulated individual or when accessing the medical records of a regulated individual are classified under section 148.941, subdivision 8.\nMS 2018 [Repealed, 2020 c 83 art 1 s 103]\n(a) Disciplinary data generally. Data held by the Board of Social Work in connection with disciplinary matters are classified under sections 148E.255 to 148E.270.\n(b) Reports of violations. Certain reports of violations submitted to the Board of Social Work are classified under sections 148E.240 to 148E.250.\n(c) Client records. Client records of a patient cared for by a social worker who is under review by the Board of Social Work are classified under section 148E.230.\nMS 2008 [Repealed, 2007 c 13 art 1 s 21]\n(a) Sharing licensing data. Sharing of data collected for licensing of alcohol and drug counselors is governed by section 214.10, subdivision 8.\n(b) Investigative data. Information obtained as part of an investigation or evaluation of a drug and alcohol counselor is governed by section 148F.025, subdivision 4, or 148F.09, subdivision 6.\n(c) Client records. The privacy and access to client records obtained in the course of alcohol and drug counseling are governed by sections 148F.13 and 148F.135.\n(d) Test results. Test results and interpretations regarding an individual obtained in the course of alcohol and drug counseling are classified under section 148F.18, subdivision 4.\nData on investigations and disciplinary actions of mortuary science practitioners by the commissioner of health are classified under section 149A.04, subdivision 5.\n(a) Required examinations; medical records. Data obtained by the Board of Dentistry when requiring a mental or physical examination of a dentist, dental hygienist, or dental assistant or when accessing the medical records of a dentist, dental hygienist, or dental assistant are classified under sections 150A.08, subdivisions 5 and 6, and 150A.081.\n(b) Patient records. Patient records of a patient cared for by a dentist, dental hygienist, or dental assistant who is under review by the Board of Dentistry are classified under section 150A.081.\n(c) Investigative data. Reports submitted to the Board of Dentistry containing information about violations are classified under section 150A.14.\n(a) Patient records. Patient records of a patient cared for by a doctor of podiatric medicine who is under review by the Board of Podiatric Medicine are classified under section 153.20.\n(b) Access to doctor's medical data. Access to the medical data of a doctor of podiatric medicine who is under review by the Board of Podiatric Medicine is governed by section 153.21, subdivision 2.\n(a) Sharing complaint information. Sharing of complaint information regarding a hearing instrument dispenser is governed by section 153A.15, subdivision 3.\n(b) Medical records. Medical records obtained by the commissioner of health in the course of reviewing a hearing instrument dispenser are classified under section 153A.15, subdivision 3a.\n(a) Client records. Veterinary records on clients of a veterinarian who is under review by the Board of Veterinary Medicine are classified under section 156.082.\n(b) Required examinations; veterinarian's medical record. Data obtained by the Board of Veterinary Medicine when requiring a mental or physical examination of a veterinarian or when accessing the veterinarian's medical records are classified under section 156.125.\nCertain medical data collected by the Board of Podiatric Medicine related to the licensure of an orthotist, prosthetist, or pedorthist are classified by section 153B.70.",
	"repealed": false
}