{
	"id": "332B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.02",
	"title": "332B.02 DEFINITIONS.",
	"text": "Unless a different meaning is clearly indicated by the context, for the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Accreditation\" means certification as an accredited credit counseling provider by the Council on Accreditation, the Bureau Veritas Certification North America, Inc., or BSI Management Systems America, Inc.\n\"Advertise\" means to solicit business through any means or medium.\n\"Aggregate debt\" means the total of principal and interest that is owed by the debtor to the creditors at the time of execution of the debt settlement agreement.\n\"Attorney general\" means the attorney general of the state of Minnesota.\n\"Commissioner\" means the commissioner of commerce.\n\"Controlling or affiliated party\" means any person or entity that controls or is controlled, directly or indirectly, or is under common control with another person. Controlling or affiliated party includes, but is not limited to, employees, officers, independent contractors, corporations, partnerships, and limited liability corporations.\n\"Credit counseling\" means the provision of counseling and advice on managing household finances, including but not limited to managing credit and debt, budgeting, and personal savings.\n\"Creditor\" means:\n(1) a party named by the debtor as a creditor in the debt settlement services plan or debt settlement services agreement;\n(2) a party that acquires or holds the debt;\n(3) a party to whom interactions with the debt settlement services is assigned in relation to the debt listed in the debt settlement services plan or debt settlement services agreement; or\n(4) the federal government, state government, or their political subdivisions, to which delinquent taxes are owed.\n\"Debt settlement services\" means any one or more of the following activities:\n(1) offering to provide advice, or offering to act or acting as an intermediary between a debtor and one or more of the debtor's creditors, where the primary purpose of the advice or action is to obtain a settlement for less than the full amount of debt, whether in principal, interest, fees, or other charges, incurred primarily for personal, family, or household purposes including, but not limited to, offering debt negotiation, debt reduction, or debt relief services;\n(2) advising, encouraging, assisting, or counseling a debtor to accumulate funds in an account for future payment of a reduced amount of debt to one or more of the debtor's creditors; or\n(3) offering to provide advice, or offering to act or acting as an intermediary between a debtor and the federal government, state government, or their political subdivisions to delay payment of delinquent taxes owed, establish a payment plan for delinquent taxes owed, or obtain a settlement for less than the full amount of delinquent taxes owed.\nAny person so engaged or holding out as so engaged is deemed to be engaged in the provision of debt settlement services, regardless of whether or not a fee is charged for such services.\n\"Debt settlement services agreement\" means the written contract between the debt settlement services provider and the debtor.\n\"Debt settlement services plan\" means the debtor's individualized package of debt settlement services set forth in the debt settlement services agreement.\n\"Debt settlement services provider\" means any person offering or providing debt settlement services to a debtor domiciled in this state, regardless of whether or not a fee is charged for the services and regardless of whether the person maintains a physical presence in the state. The term includes any person to whom debt settlement services are delegated. The term shall not include an exempt attorney at law and persons listed in section 332A.02, subdivision 8, clauses (2) to (12), or a debt management services provider.\n\"Exempt attorney at law\" means an attorney licensed or otherwise authorized to practice law in this state:\n(1) whose exclusive or principal practice does not involve the provision of debt settlement services; and\n(2) who does not have a business relationship with a debt settlement services provider that involves the provision of debt settlement services.\n\"Lead generator\" means a person that, without providing debt settlement services: (1) solicits debtors to engage in debt settlement through mail, in person, or electronic website-based solicitation or any other means, (2) acts as an intermediary or referral agent between a debtor and an entity actually providing debt settlement services, or (3) obtains a debtor's personally identifiable information and transmits that information to a debt settlement services provider.\n\"Person\" means an individual, firm, partnership, association, or corporation.\n\"Registrant\" means any person registered by the commissioner pursuant to this chapter and, where used in conjunction with an act or omission required or prohibited by this chapter, shall mean any person performing debt settlement services.",
	"repealed": false
}