{
	"id": "59B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/59B.03",
	"title": "59B.03 REQUIREMENTS FOR TRANSACTING BUSINESS.",
	"text": "A provider may, but is not required to, appoint an administrator or other designee to be responsible for any or all of the administration of service contracts and compliance with this chapter.\nService contracts must not be issued, sold, or offered for sale in this state unless the provider has:\n(1) provided a receipt for, or other written evidence of, the purchase of the service contract to the contract holder;\n(2) provided a copy of the service contract to the service contract holder within a reasonable period of time from the date of purchase; and\n(3) complied with this chapter.\nEach provider of service contracts sold in this state shall file a registration with the commissioner on a form prescribed by the commissioner. Each provider shall pay to the commissioner a fee in the amount of $750 annually.\nIn order to ensure the faithful performance of a provider's obligations to its contract holders, each provider is responsible for complying with the requirements of one of the following:\n(1) insure all service contracts under a reimbursement insurance policy issued by an insurer authorized to transact insurance in this state, a risk retention group, as that term is defined in United States Code, title 15, section 3901(A)(4), as long as that risk retention group is registered pursuant to section 60E.03 or 60E.04 as applicable, and is in full compliance with the federal Liability Risk Retention Act of 1986, United States Code, title 15, section 3901, et al., or issued pursuant to sections 60A.195 to 60A.209, and either:\n(i) the insurer or risk retention group shall, at the time the policy is filed with the commissioner, and continuously thereafter, maintain surplus as to policyholders and paid-in capital of at least $15,000,000, and annually file audited financial statements with the commissioner; or\n(ii) the commissioner may authorize an insurer or risk retention group that has surplus as to policyholders and paid-in capital of less than $15,000,000 but at least equal to $10,000,000 to issue the insurance required by this section if the insurer or risk retention group demonstrates to the satisfaction of the commissioner that the company maintains a ratio of direct written premiums, wherever written, to surplus as to policyholders and paid-in capital of not greater than 3-to-1; or\n(2)(i) maintain a funded reserve account for obligations under contracts issued and outstanding in this state. The reserves must not be less than 40 percent of gross consideration received, less claims paid, on the sale of the service contract for all in-force contracts. The reserve account is subject to examination and review by the commissioner; and\n(ii) place in trust with the commissioner a financial security deposit, having a value of not less than five percent of the gross consideration received, less claims paid, on the sale of the service contract for all service contracts issued and in force, but not less than $25,000, consisting of one of the following:\n(A) a surety bond issued by an authorized surety;\n(B) securities of the type eligible for deposit by authorized insurers in this state;\n(C) cash;\n(D) a letter of credit issued by a qualified financial institution containing an evergreen clause which prevents the expiration of the letter without due notice from the issuer; or\n(E) another form of security prescribed by rules of the commissioner; or\n(3)(i) maintain, or its parent company maintain, a net worth or stockholders' equity of $100,000,000; and\n(ii) upon request, provide the commissioner with a copy of the provider's or the provider's parent company's most recent Form 10-K or Form 20-F filed with the Securities and Exchange Commission (SEC) within the last calendar year, or if the company does not file with the SEC, a copy of the company's audited financial statements, which shows a net worth of the provider or its parent company of at least $100,000,000. If the provider's parent company's Form 10-K, Form 20-F, or audited financial statements are filed to meet the provider's financial stability requirement, then the parent company shall agree to guarantee the obligations of the provider relating to service contracts sold by the provider in this state.\nService contracts must require the provider to permit the service contract holder to return the service contract within 20 days of the date the service contract was mailed to the service contract holder or within ten days of delivery if the service contract is delivered to the service contract holder at the time of sale or within a longer time period permitted under the service contract. Upon return of the service contract to the provider within the applicable time period, if no claim has been made under the service contract before its return to the provider, the service contract is void and the provider shall refund to the service contract holder, or credit the account of the service contract holder, with the full purchase price of the service contract. The right to void the service contract provided in this paragraph is not transferable and applies only to the original service contract purchaser, and only if no claim has been made before its return to the provider. A ten percent penalty per month must be added to a refund that is not paid or credited within 45 days after return of the service contract to the provider.\n(a) Provider fees collected on service contracts are not subject to premium taxes.\n(b) Premiums for reimbursement insurance policies are subject to applicable taxes.\nExcept for the registration requirements in subdivision 3, providers and related service contract sellers, administrators, and other persons marketing, selling, or offering to sell service contracts are exempt from any licensing requirements of this state.\nThe marketing, sale, offering for sale, issuance, making, proposing to make, and administration of service contracts by providers and related service contract sellers, administrators, and other persons are exempt from all other provisions of the insurance laws of this state, except as provided in section 72A.20, subdivision 38.",
	"repealed": false
}