{
	"id": "245.461",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.461",
	"title": "245.461 POLICY AND CITATION.",
	"text": "Sections 245.461 to 245.486 may be cited as the \"Minnesota Comprehensive Adult Mental Health Act.\"\nThe commissioner shall create and ensure a unified, accountable, comprehensive adult mental health service system that:\n(1) recognizes the right of adults with mental illness to control their own lives as fully as possible;\n(2) promotes the independence and safety of adults with mental illness;\n(3) reduces chronicity of mental illness;\n(4) eliminates abuse of adults with mental illness;\n(5) provides services designed to:\n(i) increase the level of functioning of adults with mental illness or restore them to a previously held higher level of functioning;\n(ii) stabilize adults with mental illness;\n(iii) prevent the development and deepening of mental illness;\n(iv) support and assist adults in resolving mental health problems that impede their functioning;\n(v) promote higher and more satisfying levels of emotional functioning; and\n(vi) promote sound mental health; and\n(6) provides a quality of service that is effective, efficient, appropriate, and consistent with contemporary professional standards in the field of mental health.\n[Repealed, 2013 c 107 art 4 s 22]\nThe commissioner shall ensure that the housing services provided as part of a comprehensive mental health service system:\n(1) allow all persons with mental illness to live in stable, affordable housing, in settings that maximize community integration and opportunities for acceptance;\n(2) allow persons with mental illness to actively participate in the selection of their housing from those living environments available to the general public; and\n(3) provide necessary support regardless of where persons with mental illness choose to live.\nThe commissioner shall seek and apply for federal and other nonstate, nonlocal government funding for the mental health services specified in sections 245.461 to 245.486, in order to maximize nonstate, nonlocal dollars for these services.\nBy July 1, 2013, the commissioner of human services shall develop a list of diagnostic codes to define the range of child and adult mental illnesses for the statewide mental health system. The commissioner may use the International Classification of Diseases (ICD); the American Psychiatric Association's Diagnostic and Statistical Manual (DSM); or a combination of both to develop the list. The commissioner shall establish an advisory committee, comprising mental health professional associations, counties, tribes, managed care organizations, state agencies, and consumer organizations that shall advise the commissioner regarding development of the diagnostic codes list. The commissioner shall annually notify providers of changes to the list.",
	"repealed": false
}