{
	"id": "206.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.84",
	"title": "206.84 METHODS OF USING ELECTRONIC VOTING SYSTEMS.",
	"text": "The officials in charge of elections shall determine procedures to instruct election judges and voters in the use of electronic voting system manual marking devices and the electronic ballot marker, including assistive voting technology.\n[Repealed, 1997 c 147 s 79]\nThe ballot information must be in the same order provided for paper ballots, except that the information may be in vertical or horizontal rows, or on a number of separate pages. The secretary of state shall provide by rule for standard ballot formats for electronic voting systems. Electronic ballot displays and audio ballot readers shall be in the order provided for on the optical scan ballot. Electronic ballot displays may employ zooms or other devices as assistive voting technology. Audio ballot readers may employ rewinds or audio cues as assistive voting technology.\nBallot cards may contain special printed marks as required for proper positioning and reading of the ballots by electronic vote counting equipment. Ballot cards must contain an identification of the precinct for which they have been prepared which can be read visually and which can be tabulated by the automatic tabulating equipment.\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]\nThe official in charge of elections in each municipality where an electronic voting system is used shall have the voting systems put in order, set, adjusted, and made ready for voting when delivered to the election precincts. The official shall also provide each precinct with a container for transporting ballot cards to the counting location after the polls close. The container shall be of sturdy material to protect the ballots from all reasonably foreseeable hazards including auto collisions. The election judges shall meet at the polling place at least one hour before the time for opening the polls. Before the polls open the election judges shall compare the ballot cards used with the sample ballots, electronic ballot displays, and audio ballot reader furnished to see that the names, numbers, and letters on both agree and shall certify to that fact on forms provided for the purpose. The certification must be filed with the election returns.\nA voter who spoils a ballot card or makes an error may return it to the election judges and obtain another. Except as otherwise provided in sections 206.55 to 206.90, the election judges shall conduct the election in the manner prescribed for precincts using paper ballots in chapters 204C and 204D.",
	"repealed": false
}