{
	"id": "97A.0455",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.0455",
	"title": "97A.0455 SUBMITTING PROPOSED EMERGENCY RULE TO ATTORNEY GENERAL.",
	"text": "The commissioner shall submit to the attorney general the proposed emergency rule as published, with any modifications. On the same day that it is submitted, the commissioner shall mail notice of the submission to all persons who requested to be informed that the proposed emergency rule has been submitted to the attorney general. If the proposed emergency rule has been modified, the notice must state that fact, and must state that a free copy of the proposed emergency rule, as modified, is available upon request from the commissioner.\n(a) The attorney general shall review the proposed emergency rule as to its legality, review its form to the extent the form relates to legality, and shall approve or disapprove the proposed emergency rule and any modifications on the tenth working day following the date of receipt of the proposed emergency rule from the commissioner. The attorney general shall send a statement of reasons for disapproval of the rule to the commissioner, the chief administrative law judge, the Legislative Coordinating Commission, and to the revisor of statutes.\n(b) The attorney general shall disregard any error or defect in the proceeding due to the commissioner's failure to satisfy any procedural requirement imposed by law or rule if the attorney general finds:\n(1) that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process; or\n(2) that the commissioner has taken corrective action to cure the error or defect so that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process.\nThe attorney general shall assess the commissioner for the actual cost of processing rules under this section. The commissioner shall include in the department's budget money to pay the attorney general's assessment. Receipts from the assessment must be deposited in the state treasury and credited to the general fund.",
	"repealed": false
}