{
	"id": "360.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.62",
	"title": "360.62 TAX REFUND.",
	"text": "(a) Except as provided herein the tax upon any aircraft which has been paid for any year, shall be refunded only for errors made in computing the tax or fees or for the error on the part of an owner who may in error have registered an aircraft that was not before, nor at the time of such registration, nor at any time thereafter during the tax period, subject to such tax in this state; provided that after more than 24 months after such tax was paid no refund shall be made for any tax paid on any aircraft. Refunds as provided by sections 360.511 to 360.67 shall be made in the manner provided by Laws 1947, chapter 416. The former owner of a transferred aircraft by an assignment in writing endorsed upon the former owner's registration certificate and delivered to the commissioner within the time provided herein may sell and assign to the new owner thereof the right to have the tax paid by the former owner accredited to such new owner who duly registers such aircraft. Any owner whose aircraft shall be destroyed or permanently removed from the state shall be entitled to a refund for the unused portion of the tax paid upon the aircraft so destroyed or removed from the state, such refund to be computed pro rata by the month, and to be equal to the monthly tax rate multiplied by the number of full calendar months remaining in the fiscal year.\n(b) In order to secure such refund, the aircraft owner shall submit a signed statement that such aircraft has either been sold out of state or destroyed, the date of such sale or destruction, and such other information as the commissioner may require. Any false statement willfully and knowingly made in regard thereto shall be deemed a perjury and punished accordingly. No refund shall be made if application is not made within 12 months after the date the aircraft was sold out of state or destroyed.",
	"repealed": false
}