{
	"id": "325I.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/325I.02",
	"title": "325I.02 DISCLOSURE OF VIDEOTAPE RENTAL OR SALES RECORDS.",
	"text": "Except as provided in subdivisions 2 and 3, a videotape service provider or videotape seller who knowingly discloses, to any person, personally identifiable information concerning any consumer of the provider or seller is liable to the consumer for the relief provided in section 325I.03.\n(a) A videotape service provider or videotape seller shall disclose personally identifiable information concerning any consumer:\n(1) to a grand jury pursuant to a grand jury subpoena;\n(2) pursuant to a court order in a civil proceeding upon a showing of compelling need for the information that cannot be accommodated by other means, or in a criminal proceeding upon a showing of legitimate need for the information that cannot be accommodated by other means, if:\n(i) the consumer is given reasonable notice by the person seeking the disclosure of the court proceeding relevant to the issuance of the court order;\n(ii) the consumer is afforded the opportunity to appear and contest the disclosure; and\n(iii) the court imposes appropriate safeguards against unauthorized disclosure; or\n(3) to a law enforcement agency pursuant to a warrant lawfully obtained under the laws of this state or the United States.\n(b) A videotape service provider or videotape seller may disclose personally identifiable information concerning any consumer to a court or law enforcement agency pursuant to a civil action or criminal investigation for conversion or theft commenced or initiated by the videotape service provider or videotape seller or to enforce collection of fines for overdue or unreturned videotapes or collection for unpaid videotapes, to the extent necessary to establish the fact of the rental or sale. In a court action, the court shall impose appropriate safeguards against unauthorized disclosure of the information. A law enforcement agency shall maintain the information as investigative data under section 13.82, except that when the investigation becomes inactive, the information is private data on individuals as defined in section 13.02, subdivision 12.\nA videotape service provider or videotape seller may disclose personally identifiable information concerning any consumer:\n(1) to the consumer;\n(2) to a person in connection with a transfer of ownership of the videotape service provider or videotape seller;\n(3) to any person with the written informed consent of the consumer, as provided in subdivision 4; or\n(4) if a videotape is sold by mail or telephone and the videotape seller complies with United States Code, title 18, section 2710(b)(2)(D).\nFor purposes of subdivision 3, clause (3), in order to obtain the written informed consent of the consumer, the videotape service provider or videotape seller must obtain a signed statement conforming to the notice contained in this subdivision. The notice must be in writing in at least ten-point boldfaced type, must be separate from any membership, subscriber, or rental or purchase agreement between the consumer and the videotape service provider or videotape seller, and must read as follows:\n\"This videotape service provider (videotape seller) from time to time provides to marketers of goods and services, the names and addresses of customers and a description or subject matter of materials rented or purchased by video customers. The videotape service provider (videotape seller) may not include your name, address, or the description or subject matter of any material rented or purchased in these lists without your written consent. This election may be changed by you, in writing, at any time.\nI do not object to the release of my name, address, or the description or subject matter of the material rented or purchased.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nSignature\"\nPersonally identifiable information obtained in any manner other than as provided in this section may not be received in evidence in any trial, hearing, arbitration, or other proceeding before any court, grand jury, officer, agency, regulatory body, legislative committee, or other authority of the state or any political subdivision.\nA person subject to this section shall destroy personally identifiable information as soon as practicable, but no later than one year from the date the information is no longer necessary for the purpose for which it was collected and there are no pending requests or orders for access to the information under this section.\nA videotape service provider or videotape seller may not require a consumer to execute a consent under subdivision 4 as a condition of providing videotape goods or services to the consumer.",
	"repealed": false
}