{
	"id": "352.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.27",
	"title": "352.27 FEDERALLY PROTECTED PURCHASE OF SERVICE CREDIT FOR PERIODS OF MILITARY SERVICE.",
	"text": "(a) An employee who is absent from employment by reason of service in the uniformed services, as defined in United States Code, title 38, section 4303(13), and who returns to state service upon discharge from service in the uniformed service within the time frames required in United States Code, title 38, section 4312(e), may obtain service credit for the period of the uniformed service as further specified in this section, provided that the employee did not separate from uniformed service with a dishonorable or bad conduct discharge or under other than honorable conditions.\n(b) The employee may obtain credit by paying into the fund an equivalent employee contribution based upon the contribution rate or rates in effect at the time that the uniformed service was performed multiplied by the full and fractional years being purchased and applied to the annual salary rate. The annual salary rate is the average annual salary during the purchase period that the employee would have received if the employee had continued to be employed in covered employment rather than having performed uniformed service, or, if the determination of that rate is not reasonably certain, the annual salary rate is the employee's average salary rate during the 12-month period of covered employment rendered immediately preceding the period of the uniformed service.\n(c) The equivalent employer contribution and, if applicable, the equivalent additional employer contribution provided in this chapter must be paid by the department employing the employee from funds available to the department at the time and in the manner provided in this chapter, using the employer and additional employer contribution rate or rates in effect at the time that the uniformed service was performed, applied to the same annual salary rate or rates used to compute the equivalent employee contribution.\n(d) If the employee equivalent contributions provided in this section are not paid in full, the employee's allowable service credit must be prorated by multiplying the full and fractional number of years of uniformed service eligible for purchase by the ratio obtained by dividing the total employee contribution received by the total employee contribution otherwise required under this section.\n(e) To receive service credit under this section, the equivalent employee contributions specified in paragraph (b) must be transmitted to the Minnesota State Retirement System during the period which begins with the date on which the individual returns to state service and which has a duration of three times the length of the uniformed service period, but not to exceed five years. If the determined payment period is less than three years, the contributions required under paragraph (b) to receive service credit must be made within three years of the discharge date.\n(f) The amount of service credit obtainable under this section may not exceed five years unless a longer purchase period is required under United States Code, title 38, section 4312.\n(g) The employing unit shall pay interest on all equivalent employee and employer contribution amounts payable under this section. Interest must be at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually, from the end of each fiscal year of the leave or the break in service to the end of the month in which the payment is received.",
	"repealed": false
}