{
	"id": "62J.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.61",
	"title": "62J.61 RULEMAKING; IMPLEMENTATION.",
	"text": "The commissioner of health is exempt from chapter 14, including section 14.386, in implementing sections 62J.50 to 62J.54, subdivision 3, and 62J.56 to 62J.581.\n(a) The commissioner shall publish proposed rules in the State Register or, if the commissioner determines that publishing the text of the proposed rules would be unduly cumbersome, shall publish notice of the proposed rules that contains a detailed description of the rules along with a statement that a free copy of the entire set of rules is available upon request to the agency.\n(b) Interested parties have 30 days to comment on the proposed rules. After the commissioner has considered all comments, the commissioner shall publish notice in the State Register that the rules have been adopted 30 days before they are to take effect.\n(c) If the adopted rules are the same as the proposed rules, the notice shall state that the rules have been adopted as proposed and shall cite the prior publication. If the adopted rules differ from the proposed rules, the portions of the adopted rules which differ from the proposed rules shall be included in the notice of adoption together with a citation to the prior State Register that contained the notice of the proposed rules.\n(d) The commissioner may use rulemaking to implement sections 62J.54, subdivision 4, 62J.55, and 62J.60.\nThe commissioner shall not adopt any rules requiring patients to provide their Social Security numbers unless and until federal laws are modified to allow or require such action nor shall the commissioner adopt rules which allow medical records, claims, or other treatment or clinical data to be included on the health care identification card, except as specifically provided in this chapter.\nThe commissioner shall seek comments from the Ethics and Confidentiality Committee of the Minnesota Health Data Institute and the Department of Administration, Public Information Policy Analysis Division, before adopting or publishing final rules relating to issues of patient privacy and medical records.\nThe commissioner shall maintain an email address for submission of comments from interested parties to provide input about the effectiveness of and continued need for the rulemaking procedures set out in subdivision 2 and about the quality and effectiveness of rules adopted using these procedures. The commissioner may seek additional input and provide additional opportunities for input as needed.",
	"repealed": false
}