{
	"id": "204C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.08",
	"title": "204C.08 OPENING OF POLLING PLACES.",
	"text": "[Renumbered subd 1c]\n[Renumbered subd 1d]\nThe election judges shall meet at the polling place at least one hour before the time for opening the polls. Before the polls open, the election judges shall compare the ballots used with the sample ballots, electronic ballot displays, and audio ballot reader furnished to see that the names, numbers, and letters on both agree and shall certify to that fact on forms provided for that purpose. The certification must be filed with the election returns.\nUpon their arrival at the polling place on the day of election, the election judges shall cause the national flag to be displayed on a suitable staff at the entrance to the polling place. The flag shall be displayed continuously during the hours of voting and the election judges shall attest to that fact by signing the flag certification statement on the precinct summary statement. The election judges shall receive no compensation for any time during which they intentionally fail to display the flag as required by this subdivision.\nThe county auditor shall prepare and provide to each polling place sufficient copies of a poster setting forth the Voter's Bill of Rights as set forth in this section. Before the hours of voting are scheduled to begin, the election judges shall post it in a conspicuous location or locations in the polling place. The Voter's Bill of Rights is as follows:\n\"VOTER'S BILL OF RIGHTS\nFor all persons residing in this state who meet federal voting eligibility requirements:\n(1) You have the right to be absent from work for the purpose of voting in a state, federal, or regularly scheduled election without reduction to your pay, personal leave, or vacation time on election day for the time necessary to appear at your polling place, cast a ballot, and return to work.\n(2) If you are in line at your polling place any time before 8:00 p.m., you have the right to vote.\n(3) If you can provide the required proof of residence, you have the right to register to vote and to vote on election day.\n(4) If you are unable to sign your name, you have the right to orally confirm your identity with an election judge and to direct another person to sign your name for you.\n(5) You have the right to request special assistance when voting.\n(6) If you need assistance, you may be accompanied into the voting booth by a person of your choice, except by an agent of your employer or union or a candidate.\n(7) You have the right to bring your minor children into the polling place and into the voting booth with you.\n(8) You have the right to vote if you are not currently incarcerated for conviction of a felony offense.\n(9) If you are under a guardianship, you have the right to vote, unless the court order revokes your right to vote.\n(10) You have the right to vote without anyone in the polling place trying to influence your vote.\n(11) If you make a mistake or spoil your ballot before it is submitted, you have the right to receive a replacement ballot and vote.\n(12) You have the right to file a written complaint at your polling place if you are dissatisfied with the way an election is being run.\n(13) You have the right to take a sample ballot into the voting booth with you.\n(14) You have the right to take a copy of this Voter's Bill of Rights into the voting booth with you.\"\nBefore the hours for voting are scheduled to begin, the election judges shall post any official voter instruction posters furnished to them in a conspicuous location or locations in the polling place.\nAt least two sample ballots must be posted in a conspicuous location in the polling place and must remain open to inspection by the voters throughout election day. The sample ballots must accurately reflect the offices, candidates, and rotation sequence on the ballots used in that polling place. The sample ballots may be either in full or reduced size.\nImmediately before the time when voting is scheduled to begin, one of the election judges shall open the ballot box in the presence of the individuals assembled at the polling place, demonstrate that it is empty, lock it, and deliver the key to another election judge. Except as provided by law or rule, the box shall not be reopened until after the hours for voting have ended and all voting has been concluded. The box shall be kept in public view at all times during voting hours. After locking the ballot box, the election judges shall proclaim that voting may begin, and shall post outside the polling place conspicuous written or printed notices of the time when voting is scheduled to end.\nThe governing body of a municipality or school district by resolution may direct the municipal or school district clerk to furnish a boxcar seal for each ballot box in place of a lock and key. Each seal shall consist of a numbered strap with a self-locking device securely attached to one end of the strap so that the other end may be inserted and securely locked in the seal. No two straps shall bear the same number.",
	"repealed": false
}