{
	"id": "174.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.75",
	"title": "174.75 COMPLETE STREETS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Complete streets\" is the planning, scoping, design, implementation, operation, and maintenance of roads in order to reasonably address the safety and accessibility needs of users of all ages and abilities. Complete streets considers the needs of motorists, pedestrians, transit users and vehicles, bicyclists, and commercial and emergency vehicles moving along and across roads, intersections, and crossings in a manner that is sensitive to the local context and recognizes that the needs vary in urban, suburban, and rural settings.\n(c) \"Vulnerable road user\" has the meaning given in section 169.011, subdivision 92b.\n(a) The commissioner must implement a complete streets policy after consultation with stakeholders, state and regional agencies, local governments, and road authorities. The commissioner, after such consultation, must address relevant protocols, guidance, standards, requirements, and training.\n(b) The complete streets policy must include but is not limited to:\n(1) integration of related principles of context-sensitive solutions;\n(2) integration throughout the project development process;\n(3) methods to evaluate inclusion of active transportation facilities in a project, which may include but are not limited to sidewalks, crosswalk markings, pedestrian accessibility, and bikeways; and\n(4) consideration of consultation with other road authorities regarding existing and planned active transportation network connections.\nThe commissioner must maintain guidance that accompanies the complete streets policy under this section. The guidance must include sections on:\n(1) an analysis framework that provides for:\n(i) identification of characteristics of a project;\n(ii) highway system categorization based on context, including population density, land use, density and scale of surrounding development, volume of highway use, and the nature and extent of active transportation; and\n(iii) relative emphasis for different road system users in each of the categories under item (ii) in a manner that supports safety and mobility of vulnerable road users, motorcyclists or other operators of two- or three-wheeled vehicles, and public transit users; and\n(2) an analysis of speed limit reductions and associated roadway design modifications to support safety and mobility in active transportation.\nThe commissioner shall report on the implementation of the complete streets policy in the agency's biennial budget submission under section 174.02.\nLocal road authorities are encouraged, but not required, to create and adopt complete streets policies for their roads that reflect local context and goals. Nothing in this section may be construed to prohibit a local road authority from adopting a complete streets policy that incorporates or exceeds statutory complete streets principles.\n(a) When evaluating a request for a variance from the engineering standards for state-aid projects under chapter 162 in which the variance request is related to complete streets, the commissioner shall consider the latest edition of:\n(1) A Policy on Geometric Design of Highways and Streets, from the American Association of State Highway and Transportation Officials; and\n(2) for projects in urban areas, the Context Sensitive Solutions in Designing Major Urban Thoroughfares for Walkable Communities, from the Institute of Transportation Engineers.\n(b) If the commissioner denies a variance request related to complete streets, the commissioner shall provide written reasons for the denial to the political subdivision that submitted the request.",
	"repealed": false
}