{
	"id": "164.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/164.08",
	"title": "164.08 CARTWAYS.",
	"text": "The town board by resolution may establish a cartway two rods wide and not more than one-half mile in length upon petition presented to the town board signed by at least five voters, landowners of the town, requesting the cartway on a section line to serve a tract or tracts of land consisting of at least 150 acres of which at least 100 acres are tillable. If the petition is granted the proceedings of the town board shall be in accordance with section 164.07.\n(a) Upon petition presented to the town board by the owner of a tract of land containing at least five acres, who has no access thereto except over a navigable waterway or over the lands of others, or whose access thereto is less than two rods in width, the town board by resolution shall establish a cartway at least two rods wide connecting the petitioner's land with a public road. A town board shall establish a cartway upon a petition of an owner of a tract of land that, as of January 1, 1998, was on record as a separate parcel, contained at least two but less than five acres, and has no access thereto except over a navigable waterway or over the lands of others. The town board may select an alternative route other than that petitioned for if the alternative is deemed by the town board to be less disruptive and damaging to the affected landowners and in the public's best interest.\n(b) In an unorganized territory, the board of county commissioners of the county in which the tract is located shall act as the town board. The proceedings of the town board shall be in accordance with section 164.07.\n(c) The amount of damages shall be paid by the petitioner to the town before such cartway is opened. For the purposes of this subdivision damages shall mean the compensation, if any, awarded to the owner of the land upon which the cartway is established together with the cost of professional and other services, hearing costs, administrative costs, recording costs, and other costs and expenses which the town may incur in connection with the proceedings for the establishment of the cartway. The town board may by resolution require the petitioner to post a bond or other security acceptable to the board for the total estimated damages before the board takes action on the petition.\n(d) Town road and bridge funds shall not be expended on the cartway unless the town board, or the county board acting as the town board in the case of a cartway established in an unorganized territory, by resolution determines that an expenditure is in the public interest. If no resolution is adopted to that effect, the grading or other construction work and the maintenance of the cartway is the responsibility of the petitioner, subject to the provisions of section 164.10.\n(e) After the cartway has been constructed the town board, or the county board in the case of unorganized territory, may by resolution designate the cartway as a private driveway with the written consent of the affected landowner in which case from the effective date of the resolution no town road and bridge funds shall be expended for maintenance of the driveway; provided that the cartway shall not be vacated without following the vacation proceedings established under section 164.07.\nWhen a cartway is not maintained by the town, one or more of the private property owners who own land adjacent to a cartway or one or more of the private property owners who has no access to the owner's land except by way of the cartway may maintain the cartway. The cost of maintenance shall be equitably divided among all of the private property owners who own land adjacent to the cartway and all of the private property owners who have no access to their land except by way of the cartway. The following factors may be taken into consideration when determining an equitable share of maintenance expenses: the frequency of use, the type and weight of the vehicles or equipment, and the distance traveled on the cartway to the individual's property. The town board may determine the maintenance costs to be apportioned to each private property owner if the private property owners cannot agree on the division of the costs. The town board's decision may be appealed within 30 days to the district court of the county in which the cartway is located. Private property owners who pay the cost of maintenance shall have a civil cause of action against any of the private property owners who refuse to pay their share of the maintenance cost.",
	"repealed": false
}