{
	"id": "11A.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.241",
	"title": "11A.241 INVESTMENT IN NORTHERN IRELAND.",
	"text": "(a) By January 1 of each year, the state board shall:\n(1) compile a list of corporations that, directly or through a subsidiary, do business in Northern Ireland and in whose stocks or obligations the board has invested under section 11A.24, subdivision 3 or 5; and\n(2) determine whether each corporation on the list has, during the preceding year, taken affirmative action to eliminate religious or ethnic discrimination in Northern Ireland.\n(b) In making the determination required by paragraph (a), clause (2), the state board shall consider whether a corporation has, during the preceding year, taken substantial action designed to lead toward the achievement of the following goals:\n(1) increasing representation of persons from underrepresented religious groups at all levels in its work force;\n(2) providing adequate security for employees who are members of minority religious groups, both at the workplace and while traveling to and from work;\n(3) creating a climate in the workplace free from religious or political provocation;\n(4) publicly advertising all job openings and making special recruiting efforts to attract applicants from underrepresented religious groups;\n(5) providing that layoff, recall, and termination procedures do not favor workers who are members of particular religious groups;\n(6) abolishing job reservations, apprenticeship restrictions, and differential employment criteria that discriminate on the basis of religious or ethnic origin;\n(7) developing new programs and expanding existing programs to prepare current employees who are members of minority religious groups for skilled jobs;\n(8) establishing procedures to assess, identify, and recruit employees who are members of minority religious groups and who have potential for advancement; and\n(9) appointing senior management employees to oversee affirmative action efforts and the setting of timetables for carrying out clauses (1) to (8).\nWhenever feasible, the board shall sponsor, cosponsor, or support shareholder resolutions designed to encourage corporations in which the board has invested to pursue a policy of affirmative action in Northern Ireland.\nNothing in this section may be construed to require the state board to dispose of existing investments or to make future investments that violate sound investment policy for public pensions.",
	"repealed": false
}