{
	"id": "13.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.411",
	"title": "13.411 LICENSING DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify licensing data as other than public, place restrictions on access to government data, or involve data sharing.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\nData obtained by the commissioner of health on unlicensed complementary and alternative health care practitioners and clients are classified under sections 146A.06 and 146A.08.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\n(a) Mortuary science. Data submitted to the commissioner of health for a license, reciprocal license, or renewal of a license to practice mortuary science are classified under sections 149A.20, subdivision 13, 149A.30, subdivision 7, and 149A.40, subdivision 10.\n(b) Operation of funeral establishment. Data submitted to the commissioner of health for a license or renewal of a license to operate a funeral establishment are classified under sections 149A.50, subdivision 9, and 149A.51, subdivision 9.\n(c) Operation of a crematory. Data submitted to the commissioner of health for a license or renewal of a license to operate a crematory are classified under sections 149A.52, subdivision 8, and 149A.53, subdivision 8.\n(a) Health licensing boards. Data held by health licensing boards are classified under sections 214.10, subdivision 8, and 214.25, subdivision 1.\n(b) Combined boards data. Data held by licensing boards participating in a health professional services program are classified under sections 214.34 and 214.35.\nCertain data on applicants for licensure as private detectives are classified under section 326.3382, subdivision 3.\nData relating to disciplinary proceedings involving licensees of the Board of Accountancy are classified under section 326A.08, subdivision 2.\nData relating to disciplinary actions involving real estate appraisers are classified under section 82B.20, subdivision 4.\nSection 626.8457, subdivision 3, governs data sharing between law enforcement agencies and the Peace Officer Standards and Training Board for purposes of administering the peace officer database required by section 626.845, subdivision 3.\nData submitted to the Office of Cannabis Management for a cannabis business license or a hemp business license and data relating to investigations and disciplinary proceedings involving cannabis businesses and hemp businesses licensed by the Office of Cannabis Management are classified under section 342.20.",
	"repealed": false
}