{
	"id": "142F.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.20",
	"title": "142F.20 FAMILY ASSETS FOR INDEPENDENCE.",
	"text": "The Minnesota family assets for independence initiative is established to provide incentives for low-income families to accrue assets for education, housing, vehicles, emergencies, and economic development purposes.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Eligible educational institution\" means the following:\n(1) an institution of higher education described in section 101 or 102 of the Higher Education Act of 1965; or\n(2) an area vocational education school, as defined in subparagraph (C) or (D) of United States Code, title 20, chapter 44, section 2302(3) (the Carl D. Perkins Vocational and Applied Technology Education Act), which is located within any state, as defined in United States Code, title 20, chapter 44, section 2302(30). This clause is applicable only to the extent section 2302 is in effect on August 1, 2008.\n(c) \"Family asset account\" means a savings account opened by a household participating in the Minnesota family assets for independence initiative.\n(d) \"Fiduciary organization\" means:\n(1) a community action agency that has obtained recognition under section 142F.301;\n(2) a federal community development credit union;\n(3) a women-oriented economic development agency;\n(4) a federally recognized Tribal Nation; or\n(5) a nonprofit organization as defined under section 501(c)(3) of the Internal Revenue Code.\n(e) \"Financial coach\" means a person who:\n(1) has completed an intensive financial literacy training workshop that includes curriculum on budgeting to increase savings, debt reduction and asset building, building a good credit rating, and consumer protection;\n(2) participates in ongoing statewide family assets for independence in Minnesota (FAIM) network training meetings under FAIM program supervision; and\n(3) provides financial coaching to program participants under subdivision 5.\n(f) \"Financial institution\" means a bank, bank and trust, savings bank, savings association, or credit union, the deposits of which are insured by the Federal Deposit Insurance Corporation or the National Credit Union Administration.\n(g) \"Household\" means all individuals who share finances and use of a dwelling unit as primary quarters for living and eating separate from other individuals. Sharing finances does not include situations in which a person is living in the same dwelling unit as others without sharing any other financial arrangements.\n(h) \"Permissible use\" means:\n(1) postsecondary educational expenses at an eligible educational institution as defined in paragraph (b), including books, supplies, and equipment required for courses of instruction;\n(2) acquisition costs of acquiring, constructing, or reconstructing a residence, including any usual or reasonable settlement, financing, or other closing costs;\n(3) business capitalization expenses for expenditures on capital, plant, equipment, working capital, and inventory expenses of a legitimate business pursuant to a business plan approved by the fiduciary organization;\n(4) acquisition costs of a principal residence within the meaning of section 1034 of the Internal Revenue Code of 1986 which do not exceed 100 percent of the average area purchase price applicable to the residence determined according to section 143(e)(2) and (3) of the Internal Revenue Code of 1986;\n(5) acquisition costs of a personal vehicle only if approved by the fiduciary organization;\n(6) contributions to an emergency savings account; and\n(7) contributions to a Minnesota 529 savings plan.\nThe commissioner shall allocate funds to participating fiduciary organizations to provide family asset services. Grant awards must be based on a plan submitted by a statewide organization representing fiduciary organizations. The statewide organization must ensure that any interested unrepresented fiduciary organization have input into the development of the plan. The plan must equitably distribute funds to achieve geographic balance and document the capacity of participating fiduciary organizations to manage the program. A portion of funds appropriated for this section may be expended on the evaluation of the Minnesota family assets for independence initiative.\nA participating fiduciary organization must:\n(1) provide separate accounts for the immediate deposit of program funds;\n(2) establish a process to select participants and describe any priorities for participation;\n(3) enter into a family asset agreement with the household to establish the terms of participation;\n(4) provide households with economic literacy education;\n(5) provide households with information on early childhood family education;\n(6) provide matching deposits for participating households;\n(7) coordinate with other related public and private programs; and\n(8) establish a process to appeal and mediate disputes.\nA financial coach shall provide the following to program participants:\n(1) financial education relating to budgeting, debt reduction, asset-specific training, credit building, and financial stability activities;\n(2) asset-specific training related to buying a home or vehicle, acquiring postsecondary education, starting or expanding a small business, saving for emergencies, or saving for a child's education; and\n(3) financial stability education and training to improve and sustain financial security.\n(a) To be eligible for the family assets for independence initiative, a household must have maximum income that is equal to or less than the greater of:\n(1) 50 percent of the area median income as determined by the United States Department of Housing and Urban Development; or\n(2) 200 percent of the federal poverty guidelines.\n(b) To be eligible for state matching funds under this section, a household must meet the requirements of this section.\n(c) Each participating household must sign a family asset agreement that includes the amount of scheduled deposits into its savings account, the proposed use, and the proposed savings goal. A participating household must agree to complete an economic literacy training program.\n(d) Participating households may only deposit money that is derived from household earned income or from state and federal income tax credits.\n(a) To receive a match, a participating household must transfer funds withdrawn from a family asset account to its matching fund custodial account held by the fiscal agent, according to the family asset agreement. The fiscal agent must determine if the match request is for a permissible use consistent with the household's family asset agreement.\n(b) The fiscal agent must ensure the household's custodial account contains the applicable matching funds to match the balance in the household's account, including interest, on at least a quarterly basis and at the time of an approved withdrawal. Matches must be a contribution of $3 from state grant or TANF funds for every $1 of funds withdrawn from the family asset account not to exceed a $12,000 lifetime limit.\n(c) Notwithstanding paragraph (b), if funds are appropriated for the Federal Assets for Independence Act of 1998, and a participating fiduciary organization is awarded a grant under that act, participating households with that fiduciary organization must be provided matches as follows:\n(1) from state grant and TANF funds, a matching contribution of $1.50 for every $1 of funds withdrawn from the family asset account not to exceed a $6,000 lifetime limit; and\n(2) from nonstate funds, a matching contribution of not less than $1.50 for every $1 of funds withdrawn from the family asset account not to exceed a $6,000 lifetime limit.\n(d) Upon receipt of transferred custodial account funds, the fiscal agent must make a direct payment to the vendor of the goods or services for the permissible use.\nThe fiscal agent on behalf of each fiduciary organization participating in a family assets for independence initiative must report quarterly to the commissioner of children, youth, and families identifying the participants with accounts; the number of accounts; the amount of savings and matches for each participant's account; the uses of the account; the number of businesses, homes, vehicles, and educational services paid for with money from the account; and the amount of contributions to Minnesota 529 savings plans and emergency savings accounts, as well as other information that may be required for the commissioner to administer the program and meet federal TANF reporting requirements.",
	"repealed": false
}