{
	"id": "240.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.13",
	"title": "240.13 PARI-MUTUEL BETTING.",
	"text": "(a) Class B and class D licenses give the licensees authority to conduct pari-mutuel betting on the results of races run at the licensed racetrack, and on other races as authorized by the commission under this section.\n(b) A class B or class D license gives the licensee the authority to transmit and receive telecasts and conduct pari-mutuel betting on the results of horse races run at its class A facility, and of other horse races run at other locations, as authorized by the commission. The class B or class D licensee may present racing programs separately or concurrently.\n(c) Subject to the approval of the commission the types of betting, takeout, and distribution of winnings on pari-mutuel pools on simulcast races at a class B or class D facility are those in effect at the sending racetrack. Pari-mutuel pools may be commingled with pools at the sending racetrack, for the purposes of determining odds and payout prices, via the totalizator computer at the class A facility.\n(d) The commission may not authorize a class B licensee to conduct simulcasting or telerace simulcasting unless 125 days of live racing, consisting of not less than eight live races on each racing day, have been conducted at the class A facility within the preceding 12 months. The number of live racing days required may be adjusted by agreement between the licensee and the horsepersons' organization representing the majority of horsepersons racing the breed racing the majority of races at the licensee's class A facility during the preceding 12 months. The number of live racing days required must be reduced by one day for each assigned racing day that the licensee is unable to conduct live racing due to natural occurrences or catastrophes beyond its control.\n(e) The commission may authorize no more than five class D licensees to conduct simulcasting in any year. Simulcasting may be conducted at each class D licensee's facility:\n(1) only on races conducted at another class D facility during a county fair day at that facility; and\n(2) only on standardbred races.\nA class D licensee may not conduct simulcasting for wagering purposes unless the licensee has a written contract, permitting the simulcasting, with a horseperson's organization representing the standardbred industry the breed being simulcast under authority of the class D license.\n(a) A licensee conducting pari-mutuel betting must provide at the licensed track:\n(1) the necessary equipment for issuing pari-mutuel tickets; and\n(2) mechanical or electronic equipment for displaying information the commission requires. All mechanical or electronic devises must be approved by the commission before being used.\n(b) A licensee conducting pari-mutuel betting must post prominently at each point of sale of pari-mutuel tickets, in a manner approved by the commissioner of human services, the toll-free telephone number established by the commissioner of human services in connection with the compulsive gambling program established under section 245.98.\nThe commission shall by rule designate those types of pari-mutuel pools which are permitted at licensed racetracks, and no licensee may conduct any type of pari-mutuel pool which has not been so designated.\nA class B or class D licensee conducting pari-mutuel betting must deduct from a straight pari-mutuel pool, before payments to holders of winning tickets, an amount equal to not more than 17 percent of the total money in that pool. The class B or class D licensee must deduct from a multiple pari-mutuel pool, before payments to the holders of winning tickets, an amount equal to not more than 23 percent of the total money in that pool. The remaining money in each pool must be distributed among the holders of winning tickets in a manner the commission by rule prescribes for each type of pool. Breakage must be computed on the basis of payoffs rounded down to the next lowest increment of ten cents, with a minimum payoff of $1.10 on a $1 ticket, except that the licensee may reduce the minimum payoff to $1.05 on a $1 ticket if there is not a sufficient amount in a pool to make a minimum payoff of $1.10.\n(a) From the amounts deducted from all pari-mutuel pools by a licensee, including breakage, an amount equal to not less than the following percentages of all money in all pools must be set aside by the licensee and used for purses for races conducted by the licensee, provided that a licensee may agree by contract with an organization representing a majority of the horsepersons racing the breed involved to set aside amounts in addition to the following percentages, if the contract is in writing and reviewed by the commission for compliance with this subdivision:\n(1) for live races conducted at a class A facility, 8.4 percent of handle;\n(2) for simulcasts conducted any day a class A facility is licensed, not less than 37 percent of the amount remaining after deduction for the state pari-mutuel tax, payment to the breeders fund, and payment to the sending out-of-state racetrack for receipt of the signal.\nThe commission may by rule provide for the administration and enforcement of this subdivision. The deductions for payment to the sending out-of-state racetrack must be actual, except that when there exists any overlap of ownership, control, or interest between the sending out-of-state racetrack and the receiving licensee, the deduction must not be greater than three percent unless agreed to between the licensee and the horsepersons' organization representing the majority of horsepersons racing the breed racing the majority of races during the existing racing meeting or, if outside of the racing season, during the most recent racing meeting.\nThe licensee shall pay to the commission for deposit in the Minnesota breeders fund 5-1/2 percent of the takeout from all pari-mutuel pools generated by wagering at the licensee's facility on simulcasts of races not conducted in this state.\n(b) The licensee shall pay to the horseperson's organization representing the majority of the horsepersons racing the breed involved and contracting with the licensee with respect to purses and the conduct of the racing meetings and providing representation to its members, an amount as may be determined by agreement by the licensee and the horsepersons' organization sufficient to provide benevolent programs, benefits, and services for horsepersons and their on-track employees. The amount paid may be deducted from the money set aside for purses to be paid in races for the breed represented by the horseperson's organization or may be paid from breakage retained by the licensee from live or simulcast wagering as agreed between the licensee and horsepersons' organization. With respect to racing meetings where more than one breed is racing, the licensee may contract independently with the horseperson's organization representing each breed racing. The contract must be in writing and reviewed by the commission for compliance with this subdivision.\n(c) Notwithstanding sections 325D.49 to 325D.66, a horseperson's organization representing the majority of the horsepersons racing a breed at a meeting, and the members thereof, may agree to withhold horses during a meeting.\n(d) Money set aside for purses from wagering on simulcasts must be used for purses for live races involving the same breed involved in the simulcast except that money set aside for purses and payments to the breeders fund from wagering on simulcasts of races not conducted in this state, occurring during a live mixed meet, must be allotted to the purses and breeders fund for each breed participating in the mixed meet as agreed upon by the breed organizations participating in the live mixed meet. The agreement shall be in writing and reviewed by the commission for compliance with this subdivision prior to the first day of the live mixed meet. In the absence of a written agreement reviewed by the commission, the money set aside for purses and payments to the breeders fund from wagering on simulcasts, occurring during a live mixed meet, shall be allotted to each breed participating in the live mixed meet in the same proportion that the number of live races run by each breed bears to the total number of live races conducted during the period of the mixed meet.\n(e) The allocation of money set aside for purses to particular racing meets may be adjusted, relative to overpayments and underpayments, by contract between the licensee and the horsepersons' organization representing the majority of horsepersons racing the breed involved at the licensee's facility. The contract must be in writing and reviewed by the commission for compliance with this subdivision.\n(f) Subject to the provisions of this chapter, money set aside from pari-mutuel pools for purses must be for the breed involved in the race that generated the pool, except that if the breed involved in the race generating the pari-mutuel pool is not racing in the current racing meeting, or has not raced within the preceding 12 months at the licensee's class A facility, money set aside for purses may be distributed proportionately to those breeds that have run during the preceding 12 months or paid to the commission and used for purses or to promote racing for the breed involved in the race generating the pari-mutuel pool, or both, in a manner prescribed by the commission.\n(g) This subdivision does not apply to a class D licensee.\n(a) The commission may permit an authorized licensee to conduct simulcasting at the licensee's facility on any day authorized by the commission. All simulcasts must comply with the Interstate Horse Racing Act of 1978, United States Code, title 15, sections 3001 to 3007.\n(b) The commission may not authorize any day for simulcasting at a class A facility during the racing season, and a licensee may not be allowed to transmit out-of-state telecasts of races the licensee conducts, unless the licensee has obtained the approval of the horsepersons' organization representing the majority of the horsepersons racing the breed involved at the licensed racetrack during the preceding 12 months. In the case of a class A facility licensed under section 240.06, subdivision 5a, the approval applicable to the first year of the racetrack's operation may be obtained from the horsepersons' organization that represents the majority of horsepersons who will race the breed involved at the licensed racetrack during the first year of the racetrack's operation.\n(c) The licensee may pay fees and costs to an entity transmitting a telecast of a race to the licensee for purposes of conducting pari-mutuel wagering on the race. The licensee may deduct fees and costs related to the receipt of televised transmissions from a pari-mutuel pool on the televised race, provided that one-half of any amount recouped in this manner must be added to the amounts required to be set aside for purses.\n(d) With the approval of the commission and subject to the provisions of this subdivision, a licensee may transmit telecasts of races it conducts, for wagering purposes, to locations outside the state, and the commission may allow this to be done on a commingled pool basis.\n(e) Except as otherwise provided in this section, simulcasting may be conducted on a commingled pool basis or, with the approval of the commission, on a separate pool basis. All provisions of law governing pari-mutuel betting apply to simulcasting except as otherwise provided in this subdivision or in the commission's rules. If pools are commingled, wagering at the licensed facility must be on equipment electronically linked with the equipment at the licensee's class A facility or with the sending racetrack via the totalizator computer at the licensee's class A facility. Subject to the approval of the commission, the types of betting, takeout, and distribution of winnings on commingled pari-mutuel pools are those in effect at the sending racetrack. Breakage for pari-mutuel pools on a televised race must be calculated in accordance with the law or rules governing the sending racetrack for these pools, and must be distributed in a manner agreed to between the licensee and the sending racetrack. Notwithstanding subdivision 7 and section 240.15, subdivision 5, the commission may approve procedures governing the definition and disposition of unclaimed tickets that are consistent with the law and rules governing unclaimed tickets at the sending racetrack. For the purposes of this section, \"sending racetrack\" is either the racetrack outside of this state where the horse race is conducted or, with the consent of the racetrack, an alternative facility that serves as the racetrack for the purpose of commingling pools.\n(f) Except as otherwise provided in section 240.06, subdivision 5b, clause (2), if there is more than one class B licensee conducting racing within the seven-county metropolitan area, simulcasting may be conducted only on races run by a breed that ran at the licensee's class A facility within the 12 months preceding the event.\nMS 1990 [Repealed, 1991 c 336 art 1 s 33]\nThe licensee must pay off on an uncashed ticket presented for payment within 90 days of the end of the racing meeting during which it was issued. A ticket not presented for payment within that period is an unredeemed ticket and shall be reported to the commission as provided in section 240.15, subdivision 5.\nA licensee may not accept a bet or a pari-mutuel ticket for payment from any person under the age of 18 years. It is an affirmative defense to a charge under this paragraph for the licensee to prove by a preponderance of the evidence that the licensee, reasonably and in good faith, relied upon representation of proof of age described in section 340A.503, subdivision 6, in accepting the bet or pari-mutuel ticket for payment.\nA class B licensee may, with the approval of the horsepersons' organization representing the majority of horsepersons racing the breed involved, transmit telecasts of races the licensee conducts, and simulcasts upon which the licensee accepts wagers to sites on Indian lands of tribes who are conducting gaming authorized by a tribal-state compact entered into pursuant to the Indian Gaming Regulatory Act, Public Law 100-497, for wagering purposes. Transmissions of telecasts or simulcasts are only authorized if they are conducted pursuant to a written agreement between the tribal government receiving the signal and a licensee who is authorized to conduct live racing, at the licensee's facility, of the breed involved in the telecast or simulcast. The written agreement is not valid or effective unless it is approved by the commission. The agreement must be enforceable only in state courts. The term of the written agreement shall not exceed five years. The agreement may be renewed after review and approval, not earlier than six months before the end of the term, by the commission. With prior approval of the commission, a licensed racetrack transmitting telecasts of races it conducts, to sites on Indian lands within or outside of Minnesota or to other locations outside the state, may commingle the amounts bet at the receiving entity with the pools at the sending licensed racetrack.",
	"repealed": false
}