{
	"id": "462A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.02",
	"title": "462A.02 POLICY.",
	"text": "It is hereby found and declared that as a result of public actions involving highways, public facilities and urban renewal activities, and as a result of the spread of deteriorated housing and blight to formerly sound urban and rural neighborhoods, and as a result of the inability of private enterprise and investment to produce without public assistance a sufficient supply of decent, safe and sanitary residential dwellings at prices and rentals which persons and families of low and moderate income can afford, there exists within the state of Minnesota a serious shortage of decent, safe and sanitary housing at prices or rentals within the means of persons and families of low and moderate income.\nIt is further declared that this shortage of housing for low and moderate income families is inimical to the safety, health, morals and welfare of the residents of the state and to the sound growth and development of its communities. An adequate supply of housing of a variety of housing types serving persons and families of all income levels and properly planned and related to public transportation, public facilities, public utilities and sources of employment and service is essential to the orderly growth and prosperity of the state and its communities. Present patterns of providing housing unduly limit the housing options for many people in the state's urban centers, smaller communities and nonmetropolitan areas.\nIt is further declared that continuing present patterns of providing housing in the state will limit the ability of the private building industry and the investment industry to produce, without assistance, the needed construction of sanitary, decent and safe residential dwellings at prices or rentals which persons and families of low and moderate income can afford, will result in a failure to provide sufficient long-term mortgage financing for housing for low and moderate income families, and will not assure that additional housing will be provided in sufficient quantity in the areas of need and demand.\nIt is further declared that housing assistance programs provided by the federal government are inadequate both in the amount of housing given assistance and the number of dollars available for assistance and that it will not be possible to meet the housing needs of low and moderate income families in Minnesota without state action to supplement federal programs. The legislature also finds that the provision of additional federal resources to assist in the reduction of housing costs for low and moderate income families is dependent upon the state of Minnesota providing administrative capability and a state housing finance program to add to and more effectively utilize federal funds. It is further declared that the provision of an adequate supply of housing for low and moderate income families has been greatly restricted by the rapidly increasing costs of financing housing and that providing an adequate supply of housing to meet the needs of low and moderate income families will not be possible until and unless the cost of mortgage financing for housing for low and moderate income families is reduced by state action.\nIt is further declared that in establishing a Minnesota housing finance agency, the legislature is acting in all respects for the benefit of the people of the state of Minnesota to serve a public purpose in improving and otherwise promoting their health, welfare and prosperity and that the Minnesota housing finance agency, as created and established, is empowered to act on the behalf of the people of the state of Minnesota in serving this public purpose for the benefit of the general public.\nIt is further declared that it is a valid public purpose to construct housing for low and moderate income families who would otherwise be unable to obtain adequate housing at prices or rentals they could afford, to encourage such construction in the areas of need and demand with a reasonable balance between nonmetropolitan and metropolitan areas of the state, and to assist in the elimination of substandard housing conditions and to prevent the recurrence of such conditions by housing persons of varied economic means and a wide range of incomes in the same developments and neighborhoods properly planned and related to public facilities and sources of employment and services and to provide the necessary powers to accomplish these public purposes.\nIt is further declared that housing assistance programs provided by the federal government frequently require cooperation by or coordination with an agency of state government and that the availability of particular housing assistance programs of the federal government may depend upon the existence of an agency in state government with the authority and capacity to coordinate and administer such federal housing assistance programs.\nIt is further found and declared that many residential dwellings occupied by persons and families of low and moderate income do not conform to building, housing maintenance, fire, health or other state, county and city codes and standards applicable to housing; that many have a market value substantially below the market value that they would have if rehabilitated; that many are substantially less desirable to live in than they would be if rehabilitated; that many are substantially defective or are inadequate for the number of persons occupying them; that many are uninsurable because of fire risks; that many owners of such dwellings cannot afford to make the needed repairs and improvements without expending more than a reasonable portion of their income for housing, and some are unable to afford any additional amount for housing; and that existing private and public means of enterprise and investment cannot provide financing or assistance on terms and conditions within the means of many such owners. These conditions are adverse to the safety, health, and welfare of the citizens of the state, and contrary to the public policy of preventing and eliminating blight in urban and rural areas. The rehabilitation of such housing is more economical and less disruptive than replacement and the relocation of the occupants. It is therefore a valid public purpose for the state to preserve and promote the safety, health, and welfare of its citizens by exercise of the powers granted to the Minnesota housing finance agency in this chapter.\nIt is further declared that the health, welfare, and personal interests of persons who are mentally ill, developmentally disabled, physically disabled, and drug dependent citizens of Minnesota and who are or may be in need of residential care are better served through the development of a comprehensive, community-based system of treatment and care which requires the availability of adequate financing for the construction, renovation, or rehabilitation of residential care facilities as well as sufficient funds for their operational start-up costs.\nIt is further declared that supplies of conventional energy resources are rapidly depleting in quantity and rising in price and that the burden of these occurrences falls heavily upon the citizens of Minnesota generally and persons of low and moderate income in particular. These conditions are adverse to the health, welfare, and safety of all of the citizens of this state. It is further declared that it is a public purpose to ensure the availability of financing to be used by all citizens of the state, while giving preference to low and moderate income people, to assist in the installation in their dwellings of reasonably priced energy conserving systems including the use of alternative energy resources and equipment so that by the improvement of the energy efficiency, clean energy, greenhouse gas emissions reduction, climate resiliency, and other qualified projects for all housing, the adequacy of the total energy supply may be preserved for the benefit of all citizens.\nIt is further declared that it is in the best interests of the citizens of the state of Minnesota that public money used for the purposes of this chapter be used in a manner that best assures the long-term affordability of housing to low- and moderate-income citizens. To achieve that public purpose, the agency shall consider, in the making of grants and loans and other uses of agency resources, the degree to which such grants, loans, and other uses will assure the long-term affordability of the housing, by use of the community land trust model or other techniques.",
	"repealed": false
}