{
	"id": "97B.207",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.207",
	"title": "97B.207 USING DOGS TO LOCATE WOUNDED DEER OR BEAR.",
	"text": "A person may use a dog to locate and retrieve a wounded deer or bear only as provided in this section.\n(a) A person attempting to locate and retrieve a wounded deer or bear using a dog must have a valid license to take the deer or bear and have the license in possession. If the person is a dog handler that does not have a valid hunting license, the person must be accompanied by a licensed hunter with the license in possession.\n(b) The licensed hunter, and any accompanying dog handler, must be on foot and must wear blaze orange or blaze pink as provided in section 97B.071, paragraph (a).\n(c) Any light used must be a handheld artificial light, as defined under section 97B.081, subdivision 3, paragraph (f).\n(a) A dog used to locate a wounded deer or bear must be accompanied by a licensed hunter and any dog handler until the wounded deer or bear is located. The dog must be leashed and the licensed hunter or dog handler must be in physical control of the leash at all times. The leash must not exceed 30 feet in length.\n(b) The dog owner's information, including the owner's name and telephone number, must be on the dog while the dog is used to locate a wounded deer or bear under this section.\n(c) The licensed hunter and any accompanying dog handler are jointly and severally responsible for a dog under this section. A violation of this subdivision is a misdemeanor under section 97A.301, subdivision 1, and section 97A.421 applies.\n(a) The trespass provisions in section 97B.001 apply to activities under this section, including all requirements to gain permission to enter private or public property.\n(b) Activities under this section may occur during legal shooting hours or outside legal shooting hours of the open season for the location and species. Any activity occurring under this section outside the open season for the location and species must be reported to the local conservation officer before locating or retrieving the wounded deer or bear.",
	"repealed": false
}