{
	"id": "306.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.02",
	"title": "306.02 CEMETERY CORPORATIONS OR ASSOCIATIONS.",
	"text": "A corporation or association may: (1) be formed to procure and hold or sell lands or lots exclusively for the purpose of a public cemetery; (2) acquire and manage all real and personal property necessary or proper to establish, embellish, care for, and manage a cemetery, and may construct and operate on that property a crematory and other proper means of disposing of the dead; and (3) sell and convey cemetery lots or sell and convey real or personal property acquired by it but not needed for cemetery purposes. The corporation or association may be formed by three or more persons, who shall execute and verify the certificate or articles of incorporation as required in the matter of the formation of other corporations. The certificate of incorporation shall be recorded in the office of the county recorder of the county where the cemetery is located and upon filing, the association is a corporation.\nCemetery land and property or a public burial ground owned or controlled by a town, statutory or home rule charter city, or county may be transferred by deed or otherwise to an existing cemetery association or corporation, a cemetery association or corporation formed under this chapter, or a cemetery association or corporation formed under the laws of a federally recognized Indian tribe in Minnesota. The transfer may be with or without condition, as determined by the town, statutory or home rule charter city, or county. The town, statutory or home rule charter city, or county may, as a part of the transaction, enter into a contract or agreement with the cemetery association to provide for the management and maintenance of the cemetery, for the sale of lots or land in the cemetery, and for those other matters concerning the care and control of the cemetery as the town, statutory or home rule charter city, or county considers advisable.\nCemetery land or property owned by a religious corporation existing under state laws may be transferred to a cemetery association under state laws without any express consideration. In this case, the articles of incorporation of the cemetery association may provide, or may be amended to provide, for the appointment of its directors or trustees by the board of directors of the religious corporation or by some specified officer of the corporation. A cemetery association affiliated with a religious corporation by such a provision in its articles may provide for the acquisition of other cemetery properties within the state for the burial of persons of the same religious faith, exclusively.\nA cemetery corporation or association governed by this chapter may transfer cemetery land or property to a religious corporation existing under state laws without any express consideration. Money held by the cemetery corporation or association for maintenance of transferred land containing cemetery burial plots must also be transferred to the religious corporation to which the land is transferred, and the religious corporation shall use the money for maintenance of the land and plots.",
	"repealed": false
}