{
	"id": "62J.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.52",
	"title": "62J.52 ESTABLISHMENT OF UNIFORM BILLING FORMS.",
	"text": "(a) On and after January 1, 1996, all institutional inpatient hospital services, ancillary services, institutionally owned or operated outpatient services rendered by providers in Minnesota, and institutional or noninstitutional home health services that are not being billed using an equivalent electronic billing format, must be billed using the most current version of the uniform billing form CMS 1450.\n(b) The instructions and definitions for the use of the uniform billing form CMS 1450 shall be in accordance with the uniform billing form manual specified by the commissioner. In promulgating these instructions, the commissioner may utilize the manual developed by the National Uniform Billing Committee.\n(c) Services to be billed using the uniform billing form CMS 1450 include: institutional inpatient hospital services and distinct units in the hospital such as psychiatric unit services, physical therapy unit services, swing bed (SNF) services, inpatient state psychiatric hospital services, inpatient skilled nursing facility services, home health services (Medicare part A), and hospice services; ancillary services, where benefits are exhausted or patient has no Medicare part A, from hospitals, state psychiatric hospitals, skilled nursing facilities, ICFs/DD, and home health (Medicare part B); institutional owned or operated outpatient services such as waivered services, hospital outpatient services, including ambulatory surgical center services, hospital referred laboratory services, hospital-based ambulance services, and other hospital outpatient services, skilled nursing facilities, home health, freestanding renal dialysis centers, comprehensive outpatient rehabilitation facilities (CORF), outpatient rehabilitation facilities (ORF), rural health clinics, federally qualified health centers, and community mental health centers; home health services such as home health intravenous therapy providers and hospice; and any other health care provider certified by the Medicare program to use this form.\n(d) On and after January 1, 1996, a mother and newborn child must be billed separately, and must not be combined on one claim form.\n(e) Services provided by Medicare Critical Access Hospitals electing Method II billing will be allowed an exception to this provision to allow the inclusion of the professional fees on the CMS 1450.\n(a) On and after January 1, 1996, all noninstitutional health care services rendered by providers in Minnesota except dental or pharmacy providers, that are not currently being billed using an equivalent electronic billing format, must be billed using the most current version of the health insurance claim form CMS 1500.\n(b) The instructions and definitions for the use of the uniform billing form CMS 1500 shall be in accordance with the manual developed by the Administrative Uniformity Committee entitled standards for the use of the CMS 1500 form, dated February 1994, as further defined by the commissioner.\n(c) Services to be billed using the uniform billing form CMS 1500 include physician services and supplies, durable medical equipment, noninstitutional ambulance services, independent ancillary services including occupational therapy, physical therapy, speech therapy and audiology, home infusion therapy, podiatry services, optometry services, mental health licensed professional services, substance abuse licensed professional services, advanced practice registered nurse services, chiropractors, physician assistants, laboratories, medical suppliers, waivered services, personal care attendants, and other health care providers such as day activity centers and freestanding ambulatory surgical centers.\n(d) Services provided by Medicare Critical Access Hospitals electing Method II billing will be allowed an exception to this provision to allow the inclusion of the professional fees on the CMS 1450.\n(a) On and after January 1, 1996, all dental services provided by dental care providers in Minnesota, that are not currently being billed using an equivalent electronic billing format, shall be billed using the most current version of the American Dental Association uniform dental billing form.\n(b) The instructions and definitions for the use of the uniform dental billing form shall be in accordance with the manual developed by the Administrative Uniformity Committee dated February 1994, and as amended or further defined by the commissioner.\n(a) On and after January 1, 1996, all pharmacy services provided by pharmacists in Minnesota that are not currently being billed using an equivalent electronic billing format shall be billed using the most current version of the NCPDP/universal claim form.\n(b) The instructions and definitions for the use of the uniform claim form shall be in accordance with instructions specified by the commissioner of health.\n[Repealed, 2008 c 305 s 11]",
	"repealed": false
}