{
	"id": "583.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/583.24",
	"title": "583.24 APPLICABILITY.",
	"text": "(a) The Farmer-Lender Mediation Act applies to creditors who are owed debts subject to the Farmer-Lender Mediation Act and are:\n(1) the United States or an agency of the United States;\n(2) corporations, partnerships, and other business entities; and\n(3) individuals.\n(b) The Farmer-Lender Mediation Act does not apply to creditors of a debtor described under subdivision 2, paragraph (b).\n(a) Except as provided in paragraph (b) the Farmer-Lender Mediation Act applies to a debtor who is:\n(1) a person operating a family farm as defined in section 500.24, subdivision 2;\n(2) a family farm corporation as defined in section 500.24, subdivision 2; or\n(3) an authorized farm corporation as defined in section 500.24, subdivision 2.\n(b) The Farmer-Lender Mediation Act does not apply to a debtor who owns and leases less than 60 acres if the debtor has less than $20,000 in gross sales of agricultural products the preceding year.\n[Repealed, 1987 c 292 s 39]\nThe Farmer-Lender Mediation Act does not apply to a debt:\n(1) for which a proof of claim form has been filed in bankruptcy by a creditor or that was listed as a scheduled debt, of a debtor who has filed a petition in bankruptcy after July 1, 1987, under United States Code, title 11, chapter 7, 11, 12, or 13;\n(2) if the debt was in default when the creditor received a mediation proceeding notice under the Farmer-Lender Mediation Act and the creditor filed a claim form, the debt was mediated during the mediation period under section 583.26, subdivision 8, and (i) the mediation was unresolved; or (ii) a mediation agreement with respect to that debt was signed;\n(3) for which the creditor has served a mediation notice, the debtor has failed to make a timely request for mediation, and within 60 days after the debtor failed to make a timely request the creditor began a proceeding to enforce the debt against the agricultural property of the debtor;\n(4) for which a creditor has received a mediation proceeding notice and the creditor and debtor have restructured the debt and have signed a separate mediation agreement with respect to that debt;\n(5) for which there is a lien for rental value of farm machinery under section 514.661; or\n(6) that is a new line of credit, loan, or other debt extended by a creditor to the debtor as a result of a mediation conducted pursuant to the Farmer-Lender Mediation Act. However, this new debt becomes subject to the Farmer-Lender Mediation Act two years after the mediation from which the new debt originated ends, as evidenced by the date on the termination statement issued by the mediator under section 583.26, subdivision 10.\nThe minimum eligible debt amount is $15,000. In 2022 and every five years thereafter, the commissioner of agriculture, in consultation with the director, must report to the legislative committees with jurisdiction over agriculture policy what the minimum eligible debt amount under this subdivision would be if adjusted using the United States Department of Agriculture's Index of the Cost of Production.",
	"repealed": false
}