{
	"id": "290.9201",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.9201",
	"title": "290.9201 TAX ON NONRESIDENT ENTERTAINERS.",
	"text": "(a) \"Entertainer\" means an individual who is not a resident of Minnesota or a state with which Minnesota has a reciprocal agreement under section 290.081 who performs acts in Minnesota that amuse, entertain, or inform. For purposes of this section, \"entertainer\" includes, but is not limited to, a musician, singer, dancer, comedian, thespian, athlete, and public speaker.\n(b) Entertainment entity means either: (1) an entertainer who is paid compensation for providing entertainment as an independent contractor, (2) a partnership that is paid compensation for entertainment provided by entertainers who are partners, or (3) a corporation that is paid compensation for entertainment provided by entertainers who are shareholders of the corporation.\nEntertainment entities are subject to a tax in the amount of two percent of the total compensation received by them during the calendar year for entertainment performed in Minnesota.\n[Repealed, 1Sp2011 c 7 art 1 s 13]\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1990 c 480 art 1 s 45]\nCompensation subject to the tax imposed under this section is not assignable to Minnesota under section 290.17.\nThe tax on compensation of an entertainer must be withheld at a rate of two percent of all compensation paid to the entertainment entity by the person or corporation having legal control of the payment of the compensation. The compensation subject to withholding under this section is not subject to the withholding provisions of section 290.92, subdivision 2a, 3, or 28, except the provisions of sections 270C.02, subdivision 2, paragraph (b), 270C.60, 289A.09, subdivisions 1, paragraph (f), and 2, 289A.60, and 289A.63 shall apply to withholding under this section as if the withholding were upon wages.\nThe person or corporation having legal control of the payment of compensation taxable under this section shall deposit the earnings tax with the commissioner.\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1990 c 480 art 1 s 45]\n(a) Subdivisions 7 and 8 do not apply to:\n(1) compensation paid to nonresident public speakers, if the compensation paid to the speaker is less than $2,000 or is only a payment of the speaker's expenses; or\n(2) compensation paid to an entertainment entity if the compensation paid to the entertainment entity is less than $600.\n(b) Compensation paid to a public speaker or an entertainment entity that is not subject to withholding tax under this subdivision is not subject to tax under subdivision 2 unless the total compensation received by the public speaker or entertainment entity in the tax year exceeds the individual income tax filing requirements for a nonresident individual under section 289A.08, subdivision 1, paragraph (a), clause (1).",
	"repealed": false
}