{
	"id": "299A.477",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.477",
	"title": "299A.477 HOMETOWN HEROES ASSISTANCE PROGRAM.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Critical illness\" means cardiac disease and cancer as well as other illnesses covered by a policy of insurance issued by an insurer in compliance with chapter 60A.\n(c) \"Firefighter\" means a volunteer, paid on-call, part-time, or career firefighter serving a general population within the boundaries of the state.\n(d) \"Minnesota Firefighter Initiative\" means a collaborative that is established by major fire service organizations in Minnesota, is a nonprofit organization, and is tax exempt under section 501(c)(3) of the Internal Revenue Code.\nThe commissioner of public safety shall award a grant to the Minnesota Firefighter Initiative to administer a hometown heroes assistance program for Minnesota firefighters. The Minnesota Firefighter Initiative shall use the grant funds:\n(1) to establish and fund critical illness coverage that provides monetary support payments to each firefighter who is diagnosed with a critical illness on or after August 1, 2021, and who applies for the payment. Monetary support shall be provided according to the requirements in subdivision 3;\n(2) to develop a psychotherapy program customized to address emotional trauma experienced by firefighters and to offer all firefighters in the state up to five psychotherapy sessions per year under the customized program, provided by mental health professionals;\n(3) to coordinate additional psychotherapy sessions to firefighters who need them;\n(4) to develop, annually update, and annually provide to all firefighters in the state at least two hours of training on critical illnesses, such as cancer and heart disease, and emotional trauma as causes of illness and death for firefighters; steps and best practices for firefighters to limit the occupational risks of cancer, heart disease, and emotional trauma; provide evidence-based suicide prevention strategies; and ways for firefighters to address occupation-related emotional trauma and promote emotional wellness. The training shall be presented by firefighters who attend an additional course to prepare them to serve as trainers; and\n(5) for administrative and overhead costs of the Minnesota Firefighter Initiative associated with conducting the activities in clauses (1) to (4).\n(a) The Minnesota Firefighter Initiative shall establish and administer a critical illness monetary support program which shall provide support payments of up to $20,000 to each eligible firefighter. A firefighter who is diagnosed with a critical illness on or after August 1, 2021, is eligible to apply for benefits under the monetary support program and has 12 months from the diagnosis to submit an application. A firefighter's application for monetary support must include a certification from the firefighter's health care provider of the firefighter's diagnosis of an eligible critical illness. The Minnesota Firefighter Initiative shall establish criteria to guide disbursement of monetary support payments under this program, and shall scale the amount of monetary support provided to each firefighter according to the severity of the firefighter's diagnosis.\n(b) The commissioner of public safety may access the accounts of the critical illness monetary support program to conduct periodic audits of the program to ensure that payments are being made in compliance with this section and disbursement criteria established by the Minnesota Firefighter Initiative.\nThe commissioner may accept contributions from nonstate sources to supplement state appropriations for the hometown heroes assistance program. Contributions received under this subdivision are appropriated to the commissioner for the grant to the Minnesota Firefighter Initiative for purposes of this section.",
	"repealed": false
}