{
	"id": "116J.4231",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.4231",
	"title": "116J.4231 OFFICE OF NEW AMERICANS.",
	"text": "(a) The Office of New Americans is established within the Department of Employment and Economic Development. The governor must appoint an assistant commissioner who serves in the unclassified service. The assistant commissioner must hire a program manager, an office assistant, and any staff necessary to carry out the office's duties under subdivision 2.\n(b) The purpose of the office is to foster immigrant and refugee inclusion through an intentional process to improve economic mobility, enhance civic participation, and improve receiving communities' openness to immigrants and refugees by incorporating the needs and aspirations of immigrants and refugees, their families, and their communities for the benefit of all by fulfilling the duties outlined in subdivision 2.\nThe Office of New Americans has the following duties:\n(1) create and implement a statewide strategy and programming to foster and promote immigrant and refugee inclusion in Minnesota so as to improve economic mobility, enhance civic participation, and improve receiving communities' openness to immigrants and refugees;\n(2) address the state's workforce needs by connecting employers and job seekers within the immigrant and refugee community;\n(3) identify and support implementation of programs and strategies to reduce employment barriers for immigrants and refugees, including the creation of alternative employment pathways;\n(4) support programs and activities designed to ensure equitable access to the workforce for immigrants and refugees, including those who are disabled;\n(5) support equitable opportunities for immigrants and refugees to access state government services and grants, including collaborating with Minnesota's ethnic councils as created by section 15.0145;\n(6) work with state agencies, Minnesota's ethnic councils, and community and foundation partners to undertake studies and research and analyze economic and demographic trends to better understand and serve the state's immigrant and refugee communities;\n(7) coordinate and establish best practices for language access initiatives to all state agencies after soliciting input from Minnesota's ethnic councils;\n(8) convene stakeholders to further the objectives identified in subdivision 1;\n(9) make policy recommendations to the governor on issues impacting immigrants and refugees after soliciting input from Minnesota's ethnic councils;\n(10) engage all stakeholders to further the objectives identified in subdivision 1 within the context of workforce access and workforce readiness, including in the areas of employment, housing, legal services, health care, and education and communicate the importance of immigrant and refugee inclusion in the success of immigrants, refugees, their children, and the communities in which they settle;\n(11) engage with and support existing municipal and county offices that promote and foster immigrant and refugee inclusion and encourage the development of new municipal and county offices dedicated to immigrant and refugee inclusion;\n(12) serve as the point of contact for immigrants and refugees accessing resources both within the department and with boards charged with oversight of a profession;\n(13) promulgate rules necessary to implement and effectuate this section;\n(14) provide an annual report, as required by subdivision 3;\n(15) perform any other activities consistent with the office's purpose; and\n(16) administer any grant program or other appropriation to the office.\n(a) Beginning January 15, 2025, and each year thereafter, the Office of New Americans shall report to the legislative committees with jurisdiction over the office's activities during the previous year.\n(b) The report shall contain, at a minimum:\n(1) a summary of the office's activities;\n(2) suggested policies, incentives, and legislation designed to accelerate the achievement of the duties under subdivision 2;\n(3) any proposed legislative and policy initiatives;\n(4) the amount and types of grants awarded under subdivision 6; and\n(5) any other information deemed necessary and requested by the legislative committees with jurisdiction over the office.\n(c) The report may be submitted electronically and is subject to section 3.195, subdivision 1.\n(a) An Interdepartmental Coordinating Council on Immigrant and Refugee Affairs is established to advise the Office of New Americans.\n(b) The purpose of the council is to identify and establish ways in which state departments, agencies, and Minnesota's ethnic councils can work together to deliver state programs and services effectively and efficiently to Minnesota's immigrant and refugee populations. The council shall implement policies, procedures, and programs requested by the governor through the state departments and offices.\n(c) The council shall be chaired by the assistant commissioner of the Office of New Americans and shall include the commissioners, department directors, or designees from the following:\n(1) the governor's office;\n(2) the Department of Administration;\n(3) the Department of Employment and Economic Development;\n(4) the Department of Human Services;\n(5) the Department of Human Services Refugee Resettlement Programs Office;\n(6) the Department of Labor and Industry;\n(7) the Department of Health;\n(8) the Department of Education;\n(9) the Office of Higher Education;\n(10) the Department of Public Safety;\n(11) the Department of Corrections;\n(12) the Council on Asian Pacific Minnesotans;\n(13) the Council for Minnesotans of African Heritage; and\n(14) the Minnesota Council on Latino Affairs.\n(d) Each department or office specified in paragraph (c) shall designate one staff member as an immigrant and refugee services liaison. The liaison's responsibilities shall include:\n(1) preparation and dissemination of information and services available to immigrants and refugees; and\n(2) interfacing with the Office of New Americans on issues that impact immigrants and refugees.\nNothing in this section shall be construed to create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the state; its departments, agencies, or entities; its officers, employees, or agents; or any other person.\nThe Office of New Americans may apply for grants for interested state agencies, community partners, and stakeholders under this section to carry out the duties under subdivision 2.",
	"repealed": false
}