{
	"id": "103I.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.105",
	"title": "103I.105 ADVISORY COUNCIL ON WELLS AND BORINGS.",
	"text": "(a) The Advisory Council on Wells and Borings is established as an advisory council to the commissioner. The advisory council shall consist of 18 voting members. Of the 18 voting members:\n(1) one member must be from the Department of Health, appointed by the commissioner of health;\n(2) one member must be from the Department of Natural Resources, appointed by the commissioner of natural resources;\n(3) one member must be a member of the Minnesota Geological Survey of the University of Minnesota, appointed by the director;\n(4) one member must be a responsible individual for a licensed explorer;\n(5) one member must be a certified representative of a licensed elevator boring contractor;\n(6) two members must be members of the public who are not connected with the boring or well drilling industry;\n(7) one member must be from the Pollution Control Agency, appointed by the commissioner of the Pollution Control Agency;\n(8) one member must be from the Department of Transportation, appointed by the commissioner of transportation;\n(9) one member must be from the Board of Water and Soil Resources appointed by its chair;\n(10) one member must be a certified representative of an environmental well contractor;\n(11) six members must be residents of this state appointed by the commissioner, who are certified representatives of licensed well contractors, with not more than two from the seven-county metropolitan area and at least four from other areas of the state who represent different geographical regions; and\n(12) one member must be a certified representative of a licensed bored geothermal heat exchanger contractor.\n(b) An appointee of the well drilling industry may not serve more than two consecutive terms.\n(c) The appointees to the advisory council from the well drilling industry must:\n(1) have been residents of this state for at least three years before appointment; and\n(2) have at least five years' experience in the well drilling business.\n(d) The terms of the appointed members and the compensation and removal of all members are governed by section 15.059.",
	"repealed": false
}