{
	"id": "135A.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.195",
	"title": "135A.195 REQUIREMENTS RELATED TO ONLINE PROGRAM MANAGEMENT COMPANIES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Contract\" means an agreement entered into by an institution of higher education with an online program management company. Contract includes any amendment or addendum to the agreement.\n(c) \"Institution of higher education\" means an institution governed by either the Board of Trustees of the Minnesota State Colleges and Universities or the Board of Regents of the University of Minnesota. The Board of Regents of the University of Minnesota is requested to comply with this section.\n(d) \"Managed program\" means an online course or program that is fully delivered online in a virtual space.\n(e) \"Online program management company\" means a private, for-profit, third-party entity that enters into a contract with an institution of higher education to provide bundled products and services to develop, deliver, or provide managed programs, when the services provided include recruitment and marketing.\n(f) \"Tuition sharing\" means compensation or payment to an online program management company based on a percentage of revenue or fees collected from managed programs.\nA contract must not contain any provision that:\n(1) includes or allows for tuition sharing;\n(2) grants the online program management company ownership rights to any or all intellectual property rights, patentable discoveries, or inventions of faculty members of an institution of higher education; or\n(3) grants the online program management company decision making authority over:\n(i) curriculum development, design, or maintenance;\n(ii) student assessment and grading;\n(iii) course assessment;\n(iv) admissions requirements;\n(v) appointment of faculty;\n(vi) faculty assessment;\n(vii) decision to award course credit or credential; or\n(viii) institutional governance.\nPrior to being executed, a contract must be reviewed and approved by the institution of higher education's governing board. The Board of Regents of the University of Minnesota is requested to comply with this subdivision. The review must include an analysis of the contract's compliance with subdivision 2 prior to approval. A governing board must not approve a contract unless the contract complies with subdivision 2.\nAn institution of higher education that contracts with an online program management company shall annually submit to the chairs and ranking minority members of the committees in the senate and house of representatives with jurisdiction over higher education finance an assessment and analysis that provides for a rigorous review and monitoring of online program management. The Board of Regents of the University of Minnesota is requested to comply with this subdivision. The report must, at a minimum, include:\n(1) a comparison of the actual enrollment and revenue and the enrollment and revenue projections outlined in the financial pro forma;\n(2) enrollment data reporting in 2026 and each year thereafter that includes measures of student persistence and completion;\n(3) evidence of good standing and engagement with the Higher Learning Commission and any applicable specialized accreditors and licensing bodies, and evidence of any approvals that may be required to offer courses and programs;\n(4) an assessment of the degree to which the programs offered compete with similar programs;\n(5) a description and evidence of how institutions gather student feedback and student complaints related to online program management courses and program offerings, and the process for addressing any concerns and complaints; and\n(6) the most recent compliance analysis under subdivision 3.\n(a) An institution of higher education that retains an online program management company to provide marketing services for its academic degree programs shall require that:\n(1) the online program management company must clearly disclose the third-party relationship between the online program management company and the institution each time it engages in recruitment or marketing activities for an academic program of the institution; and\n(2) all recruitment and marketing communications from the online program management company receive prior approval from the institution.\n(b) An institution of higher education that contracts with an online program management company shall make publicly available on its website a list of the online programs that are supported by the online program management company.\nNotwithstanding subdivision 1, paragraph (b), this section does not apply to an addendum or amendment to a contract entered into by an institution of higher education on or before July 1, 2023, that increases or decreases the number of managed programs. This subdivision expires July 1, 2028.",
	"repealed": false
}