{
	"id": "174.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.185",
	"title": "174.185 PAVEMENT LIFE-CYCLE COST ANALYSIS.",
	"text": "For the purposes of this section, the following definitions apply.\n(a) \"Life-cycle cost\" is the sum of the cost of the initial pavement project and all anticipated costs for maintenance, repair, and resurfacing over the life of the pavement. Anticipated costs must be based on Minnesota's actual or reasonably projected maintenance, repair, and resurfacing schedules, and costs determined by the Department of Transportation district personnel based upon recently awarded local projects and experience with local material costs.\n(b) \"Life-cycle cost analysis\" is a comparison of life-cycle costs among competing paving materials using equal design lives and equal comparison periods.\nFor each project in the reconditioning, resurfacing, and road repair funding categories, the commissioner must perform a life-cycle cost analysis and document the lowest life-cycle costs and all alternatives considered. The commissioner must document the chosen pavement strategy and, if the lowest life cycle is not selected, document the justification for the chosen strategy.\n(a) Before finalizing a pavement selection, the commissioner must post a draft of the life-cycle cost analysis and the draft pavement selection on the department's Office of Materials and Road Research website for 21 days. During this period, the commissioner must allow industry association representatives to submit questions and comments. The commissioner must collaborate with the person who submitted the question or comment, where necessary, to ensure the commissioner fully understands the question or comment. The commissioner must respond to each question or comment in writing, which must include a description of any associated changes that will be made to the life-cycle cost analysis.\n(b) After the review period under paragraph (a) closes, the commissioner may make revisions, when deemed appropriate, to the life-cycle cost analysis in response to questions or comments received. If the commissioner revises the type of pavement from concrete to asphalt or from asphalt to concrete, the commissioner must post the revised life-cycle cost analysis for review in accordance with the requirements under paragraph (a).\n[See Note.]\n(a) After the review period required in subdivision 2a and any subsequent changes to the analysis, the commissioner must select the pavement strategy and prepare a document of justification. At a minimum, the document of justification must:\n(1) explain why the pavement strategy was selected;\n(2) if the lowest life-cycle cost is not selected, justify why a strategy with a higher life-cycle cost was selected; and\n(3) include all questions and comments received during the review period and the commissioner's responses to each.\n(b) The commissioner must submit the analysis and document of justification to a licensed professional engineer for review. A life-cycle cost analysis is not considered final until it is certified and signed by a licensed professional engineer as provided by Minnesota Rules, part 1800.4200.\n(c) For all projects that began construction on or after January 1, 2024, the commissioner must store all life-cycle cost analyses and documents of justification on the department's website in a manner that allows the public to easily access the documents.\n(d) After completing the certification and signature requirements in paragraph (b) and the posting requirements in paragraph (c), the commissioner may advance the project to substantial plan development.\n(e) For purposes of this subdivision, \"substantial plan development\" means the point in time during the plan development process after which any further activities would preclude any of the feasible pavement alternatives from being selected or constructed.\n[See Note.]\nBy January 31 of each year, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance on life-cycle cost analyses conducted under this section. At a minimum, the report must include information on the results of the analyses under subdivision 2, the public review under subdivision 2a, and the final selection and document of justification under subdivision 2b.\n[See Note.]",
	"repealed": false
}