{
	"id": "353F.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/353F.025",
	"title": "353F.025 CERTIFICATION AND DECERTIFICATION OF MEDICAL FACILITIES AND OTHER PUBLIC EMPLOYING UNITS.",
	"text": "(a) The chief clerical officer of a governmental subdivision may submit a resolution from the governing body to the executive director of the Public Employees Retirement Association which supports providing coverage under this chapter for employees of that governmental subdivision who are privatized, and which states that the governing body will pay for actuarial calculations, as further specified in paragraph (c).\n(b) The governing body must also provide a copy of any applicable purchase or lease agreement and any other information requested by the executive director to allow the executive director to verify that under the proposed employer change, the new employer does not qualify as a governmental subdivision under section 353.01, subdivision 6, making the employees ineligible for continued coverage as active members of the general employees retirement plan of the Public Employees Retirement Association.\n(c) Following receipt of a resolution and a determination by the executive director that the new employer is not a governmental subdivision, the executive director shall direct the consulting actuary retained under section 356.214 to determine whether the general employees retirement plan of the Public Employees Retirement Association, if coverage under this chapter is provided, is expected to receive a net gain or a net loss if privatization occurs. A net gain is expected if the actuarial liability of the special benefit coverage provided under this chapter, if extended to the applicable employees under the privatization, is less than the actuarial gain otherwise to accrue to the plan. A net loss is expected if the actuarial accrued liability of the special benefit coverage provided under this chapter, if extended to the applicable employees under the privatization, is more than the actuarial gain otherwise to accrue to the plan. The date of the actuarial calculations used to make this determination must be within one year of the effective date of privatization.\n(a) If the actuarial calculations under subdivision 1, paragraph (c), indicate privatization can be approved because a net gain to the general employees retirement plan of the Public Employees Retirement Association is expected, or if paragraph (b) applies, the executive director shall, following acceptance of the actuarial calculations by the board of trustees, forward notice and supporting documentation, including a copy of the actuary's report and findings, to the chair and the executive director of the Legislative Commission on Pensions and Retirement and the chairs and the ranking minority members of the committees with jurisdiction over governmental operations in the house of representatives and senate.\n(b) If the calculations under subdivision 1, paragraph (c), indicate a net loss, the executive director shall recommend to the board of trustees that the privatization be approved if the chief clerical officer of the applicable governmental subdivision submits a resolution from the governing body specifying that a lump sum payment will be made to the Public Employees Retirement Association equal to the net loss, plus interest. The interest must be computed using the applicable ultimate investment return assumption under section 356.215, subdivision 8, expressed as a monthly rate, from the date of the actuarial valuation from which the actuarial accrued liability data was used to determine the net loss in the actuarial study under subdivision 1, to the date of payment, with annual compounding. Payment must be made on or after the effective date of privatization.\n(c) The Public Employees Retirement Association must maintain a list that includes the names of all privatized former public employers in the association's comprehensive annual financial report and on the association's website.\n[Repealed, 2013 c 111 art 3 s 31]",
	"repealed": false
}