{
	"id": "148E.0551",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.0551",
	"title": "148E.0551 PROVISIONAL LICENSES.",
	"text": "An applicant may be issued a provisional license if the applicant:\n(1) has met the requirements of section 148E.055, subdivision 2, clauses (1), (3), (4), (5), and (6); subdivision 3, clauses (1), (3), (4), (5), and (6); subdivision 4, clauses (1), (2), (4), (5), (6), and (7); or subdivision 5, paragraph (a), clauses (1), (2), (3), (5), (6), (7), and (8); and\n(2) complies with the requirements of subdivisions 2 to 7.\n(a) A provisional license is valid until expiration, or until the board issues or denies a license under section 148E.055, or until the board revokes the provisional license, whichever occurs first.\n(b) A provisional license expires three years after the effective date of the license.\nA licensee who is issued a provisional license must comply with the requirements of section 148E.050.\nA licensee who is issued a provisional license must pay the appropriate license fee specified in section 148E.180.\nA licensee who is issued a provisional license must document supervised practice as provided in section 148E.116. If a licensee issued a provisional license is granted a license under section 148E.055, the licensee must also meet the supervised practice requirements in sections 148E.100 to 148E.115. The supervised practice completed under a provisional license does not apply to this requirement.\n(a) After being issued a provisional license under subdivision 1, the licensee's supervisor must submit an evaluation every six months during the first 2,000 hours of social work practice. The evaluation must meet the requirements in section 148E.126. The supervisor must meet the eligibility requirements specified in section 148E.116.\n(b) After completion of 2,000 hours of supervised social work practice, the licensee's supervisor must submit a final evaluation and attest to the applicant's ability to engage in the practice of social work competently and ethically.\nUpon completion of the requirements for a provisional license under subdivisions 1 to 6, an applicant shall not practice social work in Minnesota except as provided in section 148E.065, unless licensed according to section 148E.055.\nA licensee who is issued a provisional license is subject to the grounds for disciplinary action under section 148E.190. The board may also take action according to sections 148E.260 to 148E.270 if:\n(1) the licensee's supervisor does not submit an evaluation as required by section 148E.126;\n(2) an evaluation submitted according to section 148E.126 indicates that the licensee cannot practice social work competently and ethically; or\n(3) the licensee does not comply with the requirements of subdivisions 1 to 7.\nMS 2022 [Repealed, 2024 c 127 art 23 s 12]",
	"repealed": false
}