{
	"id": "103F.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.48",
	"title": "103F.48 RIPARIAN PROTECTION AND WATER QUALITY PRACTICES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Board\" means the Board of Water and Soil Resources.\n(c) \"Buffer\" means an area consisting of perennial vegetation, excluding invasive plants and noxious weeds, adjacent to all bodies of water within the state and that protects the water resources of the state from runoff pollution; stabilizes soils, shores, and banks; and protects or provides riparian corridors.\n(d) \"Buffer-protection map\" means buffer maps established and maintained by the commissioner of natural resources.\n(e) \"Commissioner\" means the commissioner of natural resources.\n(f) \"Executive director\" means the executive director of the Board of Water and Soil Resources.\n(g) \"Local water management authority\" means a watershed district, metropolitan water management organization, or county operating separately or jointly in its role as local water management authority under chapter 103B or 103D.\n(h) \"Normal water level\" means the level evidenced by the long-term presence of surface water as indicated directly by hydrophytic plants or hydric soils or indirectly determined via hydrological models or analysis.\n(i) \"Public waters\" means public waters that are on the public waters inventory as provided in section 103G.201.\n(j) \"With jurisdiction\" means a board determination that the county or watershed district has adopted and is implementing a rule, ordinance, or official controls providing procedures for the issuance of administrative penalty orders, enforcement, and appeals for purposes of this section and section 103B.101. This determination is revocable by board action if the adoption and implementation of rule, ordinance, or official controls are not in compliance with the requirements of this section or board-adopted procedures.\nIt is the policy of the state to establish riparian buffers and water quality practices to:\n(1) protect state water resources from erosion and runoff pollution;\n(2) stabilize soils, shores, and banks; and\n(3) protect or provide riparian corridors.\n(a) Except as provided in paragraph (b), landowners owning property adjacent to a water body identified and mapped on a buffer-protection map must maintain a buffer to protect the state's water resources as follows:\n(1) for all public waters, the more restrictive of:\n(i) a 50-foot average width, 30-foot minimum width, continuous buffer of perennially rooted vegetation; or\n(ii) the state shoreland standards and criteria adopted by the commissioner under section 103F.211; and\n(2) for public drainage systems established under chapter 103E, a 16.5-foot minimum width continuous buffer as provided in section 103E.021, subdivision 1. The buffer vegetation shall not impede future maintenance of the ditch.\n(b) A landowner owning property adjacent to a water body identified in a buffer-protection map and whose property is used for cultivation farming may meet the requirements under paragraph (a) by adopting an alternative riparian water quality practice, or combination of structural, vegetative, and management practices, based on the Natural Resources Conservation Service Field Office Technical Guide, common alternative practices adopted and published by the board, other practices approved by the board, or practices based on local conditions approved by the local soil and water conservation district that are consistent with the Field Office Technical Guide, that provide water quality protection comparable to the buffer protection for the water body that the property abuts. Included in these practices are retention ponds and alternative measures that prevent overland flow to the water resource.\n(c) The width of a buffer on public waters must be measured from the top or crown of the bank. Where there is no defined bank, measurement must be from the edge of the normal water level. The width of the buffer on public drainage systems must be measured as provided in section 103E.021, subdivision 1.\n(d) Upon request by a landowner or authorized agent or operator of a landowner, a technical professional employee or contractor of the soil and water conservation district or its delegate may issue a validation of compliance with the requirements of this subdivision. The soil and water conservation district validation may be appealed to the board as described in subdivision 9.\n(e) Buffers or alternative water quality practices required under paragraph (a) or (b) must be in place on or before:\n(1) November 1, 2017, for public waters; and\n(2) November 1, 2018, for public drainage systems.\n(f) Nothing in this section limits the eligibility of a landowner or authorized agent or operator of a landowner to participate in federal or state conservation programs, including enrolling or reenrolling in federal conservation programs.\n(g) After May 31, 2017, a person planting buffers or water quality protection practices to meet the requirements in paragraph (a) must use only seed mixes verified by the Department of Agriculture as consistent with chapter 18G or 21 to prevent contamination with Palmer amaranth or other noxious weed seeds.\nIn consultation with local water management authorities, on or before July 1, 2017, the soil and water conservation district shall develop, adopt, and submit to each local water management authority within its boundary a summary of watercourses for inclusion in the local water management authority's plan. A local water management authority that receives a summary of watercourses identified under this subdivision must incorporate an addendum to its comprehensive local water management plan or comprehensive watershed management plan to include the soil and water conservation district recommendations by July 1, 2018. The incorporation to include the summary of watercourses provided by the soil and water conservation district does not require a plan amendment as long as a copy of the included information is distributed to all agencies, organizations, and individuals required to receive a copy of the plan changes. A local water management authority that receives a summary of watercourses identified under this subdivision must address implementation of the soil and water conservation district recommendations when revising its comprehensive local water management plan as part of a regularly scheduled update to its comprehensive local water management plan or development of a comprehensive watershed management plan under section 103B.801.\nLand adjacent to waters subject to subdivision 3 is exempt from the water resource protection requirements under subdivision 3, to the extent these exemptions are not inconsistent with the requirements of the state shoreland rules adopted by the commissioner pursuant to section 103F.211, if it is:\n(1) enrolled in the federal Conservation Reserve Program;\n(2) used as a public or private water access or recreational use area including stairways, landings, picnic areas, access paths, beach and watercraft access areas, and permitted water-oriented structures as provided in the shoreland model standards and criteria adopted pursuant to section 103F.211 or as provided for in an approved local government shoreland ordinance;\n(3) covered by a road, trail, building, or other structures; or\n(4) regulated by a national pollutant discharge elimination system/state disposal system (NPDES/SDS) permit under Minnesota Rules, chapter 7090, and provides water resources riparian protection, in any of the following categories:\n(i) municipal separate storm sewer system (MS4);\n(ii) construction stormwater (CSW); or\n(iii) industrial stormwater (ISW);\n(5) part of a water-inundation cropping system; or\n(6) in a temporary nonvegetated condition due to drainage tile installation and maintenance, alfalfa or other perennial crop or plant seeding, or construction or conservation projects authorized by a federal, state, or local government unit.\n(a) Soil and water conservation districts must assist landowners with implementation of the water resource riparian protection requirements established in this section. For the purposes of this subdivision, assistance includes planning, technical assistance, implementation of approved alternative practices, and tracking progress toward compliance with the requirements.\n(b) The commissioner or the board must provide sufficient funding to soil and water conservation districts to implement this section.\n(a) If the soil and water conservation district determines a landowner is not in compliance with this section, the district must notify the county or watershed district with jurisdiction over the noncompliant site and the board. The county or watershed district with jurisdiction or the board must provide the landowner with a list of corrective actions needed to come into compliance and a practical timeline to meet the requirements in this section. The county or watershed district with jurisdiction must provide a copy of the corrective action notice to the board.\n(b) A county or watershed district exercising jurisdiction under this subdivision and the enforcement authority granted in section 103B.101, subdivision 12a, shall affirm their jurisdiction and identify the ordinance, rule, or other official controls to carry out the compliance provisions of this section and section 103B.101, subdivision 12a, by notice to the board prior to March 31, 2017. A county or watershed district must provide notice to the board at least 60 days prior to the effective date of a subsequent decision on their jurisdiction.\n(c) If the landowner does not comply with the list of actions and timeline provided, the county or watershed district may enforce this section under the authority granted in section 103B.101, subdivision 12a, or by rule of the watershed district or ordinance or other official control of the county. Before exercising administrative penalty authority, a county or watershed district must adopt a plan consistent with the plan adopted by the board containing procedures for the issuance of administrative penalty orders and may issue orders beginning November 1, 2017. If a county or watershed district with jurisdiction over the noncompliant site has not adopted a plan, rule, ordinance, or official control under this paragraph, the board must enforce this section under the authority granted in section 103B.101, subdivision 12.\n(d) If the county, watershed district, or board determines that sufficient steps have been taken to fully resolve noncompliance, all or part of the penalty may be forgiven.\n(e) An order issued under paragraph (c) may be appealed to the board as provided under subdivision 9.\n(f) A corrective action is not required for conditions resulting from a flood or other act of nature.\n(g) A landowner agent or operator of a landowner may not remove or willfully degrade a riparian buffer or water quality practice, wholly or partially, unless the agent or operator has obtained a signed statement from the property owner stating that the permission for the work has been granted by the unit of government authorized to approve the work in this section or that a buffer or water quality practice is not required as validated by the soil and water conservation district. Removal or willful degradation of a riparian buffer or water quality practice, wholly or partially, by an agent or operator is a separate and independent offense and may be subject to the corrective actions and penalties in this subdivision.\nThe board may withhold funding from a local water management authority with jurisdiction or a soil and water conservation district that fails to implement this section, or from a local water management authority that fails to implement subdivision 4. Funding may be restored upon the board's approval of a corrective action plan.\nA landowner or agent or operator may appeal the terms and conditions of a soil and water conservation district validation or an administrative penalty order to the board within 30 days of receipt of written or electronic notice of the validation or order. The request for appeal must be in writing. The appealing party must provide a copy of the validation or order that is being appealed, the basis for the appeal, and any supporting evidence. The request for appeal may be submitted personally, by first class mail, or electronically to the executive director. If a written or electronic request for appeal is not submitted within 30 days, the validation or order is final. The executive director shall review the request and supporting evidence and issue a decision within 60 days of receipt of an appeal. The executive director's decision is appealable directly to the court of appeals pursuant to sections 14.63 to 14.69.\n(a) A landowner or drainage authority may contact the soil and water conservation district for information on how to apply for local, state, or federal cost-share grants, contracts, or loans that are available to establish buffers or other water resource protection measures.\n(b) The provisions of sections 103E.011, subdivision 5; 103E.021; and 103E.715 may be used in advance or retroactively to acquire or provide compensation for all or part of the buffer strip establishment or alternative riparian water quality practices as required under subdivision 3, paragraph (a) or (b).\nThis section applies to the state and its departments and agencies.",
	"repealed": false
}