{
	"id": "515A.1-106",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.1-106",
	"title": "515A.1-106 APPLICABILITY OF LOCAL ORDINANCES, REGULATIONS, AND BUILDING CODES.",
	"text": "(a) Except as provided in subsections (b) and (c), a zoning, subdivision, building code, or other real estate use law, ordinance, charter provision, or regulation may not directly or indirectly prohibit the condominium form of ownership or impose any requirement upon a condominium, upon the creation or disposition of a condominium or upon any part of the condominium conversion process which it would not impose upon a physically similar development under a different form of ownership. Otherwise, no provision of sections 515A.1-101 to 515A.4-117 invalidates or modifies any provision of any zoning, subdivision, building code, or other real estate use law, ordinance, charter provision, or regulation.\n(b) Subsection (a) shall not apply to any ordinance, rule, regulation, charter provision or contract provision relating to the financing of housing construction, rehabilitation, or purchases provided by or through a housing finance program established and operated pursuant to state or federal law by a state or local agency or local unit of government.\n(c) A statutory or home rule charter city, pursuant to an ordinance or charter provision establishing standards to be applied uniformly within its jurisdiction, may prohibit or impose reasonable conditions upon the conversion of buildings to the condominium form of ownership only if there exists within the city a significant shortage of suitable rental dwellings available to low and moderate income individuals or families or to establish or maintain the city's eligibility for any federal or state program providing direct or indirect financial assistance for housing to the city. Prior to the adoption of an ordinance pursuant to the authority granted in this subsection, the city shall conduct a public hearing.\nAny ordinance or charter provision adopted pursuant to this subsection shall not apply to any conversion condominium or proposed conversion condominium for which a bona fide loan commitment for a consideration has been issued by a lender and is in effect on the date of adoption of the ordinance or charter provision, or for which a notice of condominium conversion or intent to convert prescribed by section 515A.4-110(a), containing a termination of tenancy, has been given to at least 75 percent of the tenants and subtenants in possession prior to the date of adoption of the ordinance or charter provision.\n(d) For purposes of providing marketable title, a statement in the declaration showing that the condominium is not subject to an ordinance or showing that any conditions required under an ordinance have been complied with shall be prima facie evidence that the condominium was not created in violation thereof.\n(e) A violation of an ordinance or charter provision adopted pursuant to the provisions of subsections (b) or (c) shall not affect the validity of a condominium. This subsection shall not be construed to in any way limit the power of a city to enforce the provisions of an ordinance or charter provision adopted pursuant to subsections (b) or (c).\nAny ordinance or charter provision enacted hereunder shall not be effective for a period exceeding 18 months.",
	"repealed": false
}