{
	"id": "144G.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.20",
	"title": "144G.20 ENFORCEMENT.",
	"text": "(a) The commissioner may refuse to grant a provisional license, refuse to grant a license as a result of a change in ownership, refuse to renew a license, suspend or revoke a license, or impose a conditional license if the owner, controlling individual, or staff of an assisted living facility:\n(1) is in violation of, or during the term of the license has violated, any of the requirements in this chapter or adopted rules;\n(2) permits, aids, or abets the commission of any illegal act in the provision of assisted living services;\n(3) performs any act detrimental to the health, safety, and welfare of a resident;\n(4) obtains the license by fraud or misrepresentation;\n(5) knowingly makes a false statement of a material fact in the application for a license or in any other record or report required by this chapter;\n(6) denies representatives of the department access to any part of the facility's books, records, files, or staff;\n(7) interferes with or impedes a representative of the department in contacting the facility's residents;\n(8) interferes with or impedes ombudsman access according to section 256.9742, subdivision 4, or interferes with or impedes access by the Office of Ombudsman for Mental Health and Developmental Disabilities according to section 245.94, subdivision 1;\n(9) interferes with or impedes a representative of the department in the enforcement of this chapter or fails to fully cooperate with an inspection, survey, or investigation by the department;\n(10) destroys or makes unavailable any records or other evidence relating to the assisted living facility's compliance with this chapter;\n(11) refuses to initiate a background study under section 144.057 or 245A.04;\n(12) fails to timely pay any fines assessed by the commissioner;\n(13) violates any local, city, or township ordinance relating to housing or assisted living services;\n(14) has repeated incidents of personnel performing services beyond their competency level; or\n(15) has operated beyond the scope of the assisted living facility's license category.\n(b) A violation by a contractor providing the assisted living services of the facility is a violation by the facility.\n(a) A suspension or conditional license designation may include terms that must be completed or met before a suspension or conditional license designation is lifted. A conditional license designation may include restrictions or conditions that are imposed on the assisted living facility. Terms for a suspension or conditional license may include one or more of the following and the scope of each will be determined by the commissioner:\n(1) requiring a consultant to review, evaluate, and make recommended changes to the facility's practices and submit reports to the commissioner at the cost of the facility;\n(2) requiring supervision of the facility or staff practices at the cost of the facility by an unrelated person who has sufficient knowledge and qualifications to oversee the practices and who will submit reports to the commissioner;\n(3) requiring the facility or staff to obtain training at the cost of the facility;\n(4) requiring the facility to submit reports to the commissioner;\n(5) prohibiting the facility from admitting any new residents for a specified period of time; or\n(6) any other action reasonably required to accomplish the purpose of this subdivision and subdivision 1.\n(b) A facility subject to this subdivision may continue operating during the period of time residents are being transferred to another service provider.\n(a) In addition to any other remedies provided by law, the commissioner may, without a prior contested case hearing, immediately temporarily suspend a license or prohibit delivery of housing or services by a facility for not more than 90 calendar days or issue a conditional license, if the commissioner determines that there are:\n(1) Level 4 violations; or\n(2) violations that pose an imminent risk of harm to the health or safety of residents.\n(b) For purposes of this subdivision, \"Level 4\" has the meaning given in section 144G.31.\n(c) A notice stating the reasons for the immediate temporary suspension or conditional license and informing the licensee of the right to an expedited hearing under subdivision 17 must be delivered by personal service to the address shown on the application or the last known address of the licensee. The licensee may appeal an order immediately temporarily suspending a license or issuing a conditional license. The appeal must be made in writing by certified mail or personal service. If mailed, the appeal must be postmarked and sent to the commissioner within five calendar days after the licensee receives notice. If an appeal is made by personal service, it must be received by the commissioner within five calendar days after the licensee received the order.\n(d) A licensee whose license is immediately temporarily suspended must comply with the requirements for notification and transfer of residents in subdivision 15. The requirements in subdivision 9 remain if an appeal is requested.\nNotwithstanding the provisions of subdivision 13, paragraph (a), the commissioner must revoke a license if a controlling individual of the facility is convicted of a felony or gross misdemeanor that relates to operation of the facility or directly affects resident safety or care. The commissioner shall notify the facility and the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities 30 calendar days in advance of the date of revocation.\n(a) The owners and managerial officials of a facility whose Minnesota license has not been renewed or whose license in this state or any other state has been revoked because of noncompliance with applicable laws or rules shall not be eligible to apply for nor will be granted an assisted living facility license under this chapter or a home care provider license under chapter 144A, or be given status as an enrolled personal care assistance provider agency or personal care assistant by the Department of Human Services under section 256B.0659, for five years following the effective date of the nonrenewal or revocation. If the owners or managerial officials already have enrollment status, the Department of Human Services shall terminate that enrollment.\n(b) The commissioner shall not issue a license to a facility for five years following the effective date of license nonrenewal or revocation if the owners or managerial officials, including any individual who was an owner or managerial official of another licensed provider, had a license in this state or any other state that was not renewed or was revoked as described in paragraph (a).\n(c) Notwithstanding subdivision 1, the commissioner shall not renew, or shall suspend or revoke, the license of a facility that includes any individual as an owner or managerial official who was an owner or managerial official of a facility whose license in this state or any other state was not renewed or was revoked as described in paragraph (a) for five years following the effective date of the nonrenewal or revocation.\n(d) The commissioner shall notify the facility 30 calendar days in advance of the date of nonrenewal, suspension, or revocation of the license.\nWithin ten business days after the receipt of the notification, the facility may request, in writing, that the commissioner stay the nonrenewal, revocation, or suspension of the license. The facility shall specify the reasons for requesting the stay; the steps that will be taken to attain or maintain compliance with the licensure laws and regulations; any limits on the authority or responsibility of the owners or managerial officials whose actions resulted in the notice of nonrenewal, revocation, or suspension; and any other information to establish that the continuing affiliation with these individuals will not jeopardize resident health, safety, or well-being.\nThe commissioner shall determine whether the stay will be granted within 30 calendar days of receiving the facility's request. The commissioner may propose additional restrictions or limitations on the facility's license and require that granting the stay be contingent upon compliance with those provisions. The commissioner shall take into consideration the following factors when determining whether the stay should be granted:\n(1) the threat that continued involvement of the owners and managerial officials with the facility poses to resident health, safety, and well-being;\n(2) the compliance history of the facility; and\n(3) the appropriateness of any limits suggested by the facility.\nIf the commissioner grants the stay, the order shall include any restrictions or limitation on the provider's license. The failure of the facility to comply with any restrictions or limitations shall result in the immediate removal of the stay and the commissioner shall take immediate action to suspend, revoke, or not renew the license.\n(a) The commissioner has discretion to bar any controlling individual of a facility if the person was a controlling individual of any other nursing home, home care provider licensed under chapter 144A, or given status as an enrolled personal care assistance provider agency or personal care assistant by the Department of Human Services under section 256B.0659, or assisted living facility in the previous two-year period and:\n(1) during that period of time the nursing home, home care provider licensed under chapter 144A, or given status as an enrolled personal care assistance provider agency or personal care assistant by the Department of Human Services under section 256B.0659, or assisted living facility incurred the following number of uncorrected or repeated violations:\n(i) two or more repeated violations that created an imminent risk to direct resident care or safety; or\n(ii) four or more uncorrected violations that created an imminent risk to direct resident care or safety; or\n(2) during that period of time, was convicted of a felony or gross misdemeanor that related to the operation of the nursing home, home care provider licensed under chapter 144A, or given status as an enrolled personal care assistance provider agency or personal care assistant by the Department of Human Services under section 256B.0659, or assisted living facility, or directly affected resident safety or care.\n(b) When the commissioner bars a controlling individual under this subdivision, the controlling individual may appeal the commissioner's decision under chapter 14.\nSubdivision 8 does not apply to any controlling individual of the facility who had no legal authority to affect or change decisions related to the operation of the nursing home, assisted living facility, or home care that incurred the uncorrected or repeated violations.\n(a) In lieu of revoking, suspending, or refusing to renew the license of a facility where a controlling individual was disqualified by subdivision 8, paragraph (a), clause (1), the commissioner may issue an order staying the revocation, suspension, or nonrenewal of the facility's license. The order may but need not be contingent upon the facility's compliance with restrictions and conditions imposed on the license to ensure the proper operation of the facility and to protect the health, safety, comfort, treatment, and well-being of the residents in the facility. The decision to issue an order for a stay must be made within 90 calendar days of the commissioner's determination that a controlling individual of the facility is disqualified by subdivision 8, paragraph (a), clause (1), from operating a facility.\n(b) In determining whether to issue a stay and to impose conditions and restrictions, the commissioner must consider the following factors:\n(1) the ability of the controlling individual to operate other facilities in accordance with the licensure rules and laws;\n(2) the conditions in the nursing home or assisted living facility that received the number and type of uncorrected or repeated violations described in subdivision 8, paragraph (a), clause (1); and\n(3) the conditions and compliance history of each of the nursing homes and assisted living facilities owned or operated by the controlling individual.\n(c) The commissioner's decision to exercise the authority under this subdivision in lieu of revoking, suspending, or refusing to renew the license of the facility is not subject to administrative or judicial review.\n(d) The order for the stay of revocation, suspension, or nonrenewal of the facility license must include any conditions and restrictions on the license that the commissioner deems necessary based on the factors listed in paragraph (b).\n(e) Prior to issuing an order for stay of revocation, suspension, or nonrenewal, the commissioner shall inform the licensee and the controlling individual in writing of any conditions and restrictions that will be imposed. The controlling individual shall, within ten working days, notify the commissioner in writing of a decision to accept or reject the conditions and restrictions. If any of the conditions or restrictions are rejected, the commissioner must either modify the conditions and restrictions or take action to suspend, revoke, or not renew the facility's license.\n(f) Upon issuance of the order for a stay of revocation, suspension, or nonrenewal, the controlling individual shall be responsible for compliance with the conditions and restrictions. Any time after the conditions and restrictions have been in place for 180 days, the controlling individual may petition the commissioner for removal or modification of the conditions and restrictions. The commissioner must respond to the petition within 30 days of receipt of the written petition. If the commissioner denies the petition, the controlling individual may request a hearing under chapter 14. Any hearing shall be limited to a determination of whether the conditions and restrictions shall be modified or removed. At the hearing, the controlling individual bears the burden of proof.\n(g) The failure of the controlling individual to comply with the conditions and restrictions contained in the order for stay shall result in the immediate removal of the stay and the commissioner shall take action to suspend, revoke, or not renew the license.\n(h) The conditions and restrictions are effective for two years after the date they are imposed.\n(i) Nothing in this subdivision shall be construed to limit in any way the commissioner's ability to impose other sanctions against a licensee under the standards in state or federal law whether or not a stay of revocation, suspension, or nonrenewal is issued.\n(a) The commissioner must initiate proceedings within 60 calendar days of notification to suspend or revoke a facility's license or must refuse to renew a facility's license if within the preceding two years the facility has incurred the following number of uncorrected or repeated violations:\n(1) two or more uncorrected violations or one or more repeated violations that created an imminent risk to direct resident care or safety; or\n(2) four or more uncorrected violations or two or more repeated violations of any nature for which the fines are in the four highest daily fine categories prescribed in rule.\n(b) Notwithstanding paragraph (a), the commissioner is not required to revoke, suspend, or refuse to renew a facility's license if the facility corrects the violation.\n(a) Within five business days after proceedings are initiated by the commissioner to revoke or suspend a facility's license, or a decision by the commissioner not to renew a living facility's license, the controlling individual of the facility or a designee must provide to the commissioner, the ombudsman for long-term care, and the Office of Ombudsman for Mental Health and Developmental Disabilities the names of residents and the names and addresses of the residents' designated representatives and legal representatives, and family or other contacts listed in the assisted living contract.\n(b) The controlling individual or designees of the facility must provide updated information each month until the proceeding is concluded. If the controlling individual or designee of the facility fails to provide the information within this time, the facility is subject to the issuance of:\n(1) a correction order; and\n(2) a penalty assessment by the commissioner in rule.\n(c) Notwithstanding subdivisions 21 and 22, any correction order issued under this subdivision must require that the facility immediately comply with the request for information and that, as of the date of the issuance of the correction order, the facility shall forfeit to the state a $500 fine the first day of noncompliance and an increase in the $500 fine by $100 increments for each day the noncompliance continues.\n(d) Information provided under this subdivision may be used by the commissioner, the ombudsman for long-term care, or the Office of Ombudsman for Mental Health and Developmental Disabilities only for the purpose of providing affected consumers information about the status of the proceedings.\n(e) Within ten business days after the commissioner initiates proceedings to revoke, suspend, or not renew a facility license, the commissioner must send a written notice of the action and the process involved to each resident of the facility, legal representatives and designated representatives, and at the commissioner's discretion, additional resident contacts.\n(f) The commissioner shall provide the ombudsman for long-term care and the Office of Ombudsman for Mental Health and Developmental Disabilities with monthly information on the department's actions and the status of the proceedings.\n(a) Prior to any suspension, revocation, or refusal to renew a license, the facility shall be entitled to notice and a hearing as provided by sections 14.57 to 14.69. The hearing must commence within 60 calendar days after the proceedings are initiated. In addition to any other remedy provided by law, the commissioner may, without a prior contested case hearing, temporarily suspend a license or prohibit delivery of services by a provider for not more than 90 calendar days, or issue a conditional license if the commissioner determines that there are Level 3 violations that do not pose an imminent risk of harm to the health or safety of the facility residents, provided:\n(1) advance notice is given to the facility;\n(2) after notice, the facility fails to correct the problem;\n(3) the commissioner has reason to believe that other administrative remedies are not likely to be effective; and\n(4) there is an opportunity for a contested case hearing within 30 calendar days unless there is an extension granted by an administrative law judge.\n(b) If the commissioner determines there are Level 4 violations or violations that pose an imminent risk of harm to the health or safety of the facility residents, the commissioner may immediately temporarily suspend a license, prohibit delivery of services by a facility, or issue a conditional license without meeting the requirements of paragraph (a), clauses (1) to (4).\nFor the purposes of this subdivision, \"Level 3\" and \"Level 4\" have the meanings given in section 144G.31.\nA request for hearing must be in writing and must:\n(1) be mailed or delivered to the commissioner;\n(2) contain a brief and plain statement describing every matter or issue contested; and\n(3) contain a brief and plain statement of any new matter that the applicant or assisted living facility believes constitutes a defense or mitigating factor.\n(a) The process of suspending, revoking, or refusing to renew a license must include a plan for transferring affected residents' cares to other providers by the facility. The commissioner shall monitor the transfer plan. Within three calendar days of being notified of the final revocation, refusal to renew, or suspension, the licensee shall provide the commissioner, the lead agencies as defined in section 256B.0911, county adult protection and case managers, the ombudsman for long-term care, and the Office of Ombudsman for Mental Health and Developmental Disabilities with the following information:\n(1) a list of all residents, including full names and all contact information on file;\n(2) a list of the resident's legal representatives and designated representatives and family or other contacts listed in the assisted living contract, including full names and all contact information on file;\n(3) the location or current residence of each resident;\n(4) the payer sources for each resident, including payer source identification numbers; and\n(5) for each resident, a copy of the resident's service plan and a list of the types of services being provided.\n(b) The revocation, refusal to renew, or suspension notification requirement is satisfied by mailing the notice to the address in the license record. The licensee shall cooperate with the commissioner and the lead agencies, county adult protection and case managers, the ombudsman for long-term care, and the Office of Ombudsman for Mental Health and Developmental Disabilities during the process of transferring care of residents to qualified providers. Within three calendar days of being notified of the final revocation, refusal to renew, or suspension action, the facility must notify and disclose to each of the residents, or the resident's legal and designated representatives or emergency contact persons, that the commissioner is taking action against the facility's license by providing a copy of the revocation, refusal to renew, or suspension notice issued by the commissioner. If the facility does not comply with the disclosure requirements in this section, the commissioner shall notify the residents, legal and designated representatives, or emergency contact persons about the actions being taken. Lead agencies, county adult protection and case managers, and the Office of Ombudsman for Long-Term Care may also provide this information. The revocation, refusal to renew, or suspension notice is public data except for any private data contained therein.\n(c) A facility subject to this subdivision may continue operating while residents are being transferred to other service providers.\nWithin 15 business days of receipt of the licensee's timely appeal of a sanction under this section, other than for a temporary suspension, the commissioner shall request assignment of an administrative law judge. The commissioner's request must include a proposed date, time, and place of hearing. A hearing must be conducted by an administrative law judge pursuant to Minnesota Rules, parts 1400.8505 to 1400.8612, within 90 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause or for purposes of discussing settlement. In no case shall one or more extensions be granted for a total of more than 90 calendar days unless there is a criminal action pending against the licensee. If, while a licensee continues to operate pending an appeal of an order for revocation, suspension, or refusal to renew a license, the commissioner identifies one or more new violations of law that meet the requirements of Level 3 or Level 4 violations as defined in section 144G.31, the commissioner shall act immediately to temporarily suspend the license.\n(a) Within five business days of receipt of the licensee's timely appeal of a temporary suspension or issuance of a conditional license, the commissioner shall request assignment of an administrative law judge. The request must include a proposed date, time, and place of a hearing. A hearing must be conducted by an administrative law judge pursuant to Minnesota Rules, parts 1400.8505 to 1400.8612, within 30 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause. The commissioner shall issue a notice of hearing by certified mail or personal service at least ten business days before the hearing. Certified mail to the last known address is sufficient. The scope of the hearing shall be limited solely to the issue of whether the temporary suspension or issuance of a conditional license should remain in effect and whether there is sufficient evidence to conclude that the licensee's actions or failure to comply with applicable laws are Level 3 or Level 4 violations as defined in section 144G.31, or that there were violations that posed an imminent risk of harm to the resident's health and safety.\n(b) The administrative law judge shall issue findings of fact, conclusions, and a recommendation within ten business days from the date of hearing. The parties shall have ten calendar days to submit exceptions to the administrative law judge's report. The record shall close at the end of the ten-day period for submission of exceptions. The commissioner's final order shall be issued within ten business days from the close of the record. When an appeal of a temporary immediate suspension or conditional license is withdrawn or dismissed, the commissioner shall issue a final order affirming the temporary immediate suspension or conditional license within ten calendar days of the commissioner's receipt of the withdrawal or dismissal. The licensee is prohibited from operation during the temporary suspension period.\n(c) When the final order under paragraph (b) affirms an immediate suspension, and a final licensing sanction is issued under subdivisions 1 and 2 and the licensee appeals that sanction, the licensee is prohibited from operation pending a final commissioner's order after the contested case hearing conducted under chapter 14.\n(d) A licensee whose license is temporarily suspended must comply with the requirements for notification and transfer of residents under subdivision 15. These requirements remain if an appeal is requested.\nTo appeal the assessment of civil penalties under section 144G.31, and an action against a license under this section, a licensee must request a hearing no later than 15 business days after the licensee receives notice of the action.\nIf a facility license is revoked, a new application for license may be considered by the commissioner when the conditions upon which the revocation was based have been corrected and satisfactory evidence of this fact has been furnished to the commissioner. A new license may be granted after an inspection has been made and the facility has complied with all provisions of this chapter and adopted rules.\nAt any time, the commissioner and the applicant, licensee, manager if applicable, or facility may hold an informal conference to exchange information, clarify issues, or resolve issues.\nIn addition to any other remedy provided by law, the commissioner may bring an action in district court to enjoin a person who is involved in the management, operation, or control of a facility or staff of the facility from illegally engaging in activities regulated by this chapter. The commissioner may bring an action under this subdivision in the district court in Ramsey County or in the district in which the facility is located. The court may grant a temporary restraining order in the proceeding if continued activity by the person who is involved in the management, operation, or control of a facility, or by staff of the facility, would create an imminent risk of harm to a resident.\nIn matters pending before the commissioner under this chapter, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. If a person fails or refuses to comply with a subpoena or order of the commissioner to appear or testify regarding any matter about which the person may be lawfully questioned or to produce any papers, books, records, documents, or evidentiary materials in the matter to be heard, the commissioner may apply to the district court in any district, and the court shall order the person to comply with the commissioner's order or subpoena. The commissioner may administer oaths to witnesses or take their affirmation. Depositions may be taken in or outside the state in the manner provided by law for taking depositions in civil actions. A subpoena or other process or paper may be served on a named person anywhere in the state by an officer authorized to serve subpoenas in civil actions, with the same fees and mileage and in the same manner as prescribed by law for a process issued out of a district court. A person subpoenaed under this subdivision shall receive the same fees, mileage, and other costs that are paid in proceedings in district court.",
	"repealed": false
}