{
	"id": "342.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.21",
	"title": "342.21 LICENSE SUSPENSION OR REVOCATION; HEARING.",
	"text": "The office may revoke or not renew a license when the office has cause to believe that a cannabis business or hemp business has violated an ownership or operational requirement in this chapter or rules adopted pursuant to this chapter. The office must notify the license holder in writing, specifying the grounds for revocation or nonrenewal and fixing a time of at least 20 days thereafter for a hearing on the matter.\n(a) Before the office revokes or does not renew a license, the office must provide the license holder with a statement of the complaints made against the license holder, and the office must hold a hearing to determine whether the office should revoke the license or deny renewal of the license. The license holder shall receive notice at least 20 days before the date of the hearing and notice may be served either by certified mail addressed to the address of the license holder as shown in the license application or in the manner provided by law for the service of a summons. At the time and place fixed for the hearing, the office, or any office employee or agent authorized by the office to conduct the hearing, shall receive evidence, administer oaths, and examine witnesses.\n(b) After the hearing held pursuant to paragraph (a) or upon the failure of the license holder to appear at the hearing, the office must take action as is deemed advisable and issue written findings that the office must mail to the license holder. An action of the office under this paragraph is subject to judicial review pursuant to chapter 14.\nThe office may temporarily, without hearing, suspend the license and operating privilege of any business licensed under this chapter for up to 90 days if continuing the operation of the business would threaten the health or safety of any person. The office may extend the period for an additional 90 days if the office notified the business that the office intends to revoke or not renew a license and the hearing required under subdivision 2 has not taken place.",
	"repealed": false
}