{
	"id": "124D.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.42",
	"title": "124D.42 READING AND MATH CORPS.",
	"text": "[Repealed, 2004 c 286 s 4]\n[Repealed, 2004 c 286 s 4]\n[Repealed, 2004 c 286 s 4]\n[Repealed, 2004 c 286 s 4]\n[Repealed, 2004 c 286 s 4]\nThe commission must, within available resources:\n(1) orient each grantee organization in the nature, philosophy, and purpose of the program;\n(2) build an ethic of community service through general community service training; and\n(3) provide guidance on integrating programmatic-based measurement into program models.\n[Repealed, 2004 c 286 s 4]\n(a) A Minnesota reading corps program is established to provide ServeMinnesota AmeriCorps members with a data-based problem-solving model of literacy instruction to use in helping to train local Head Start program providers, other prekindergarten program providers, and staff in schools with students in kindergarten through grade 3 to evaluate and teach early literacy skills, including evidence-based literacy instruction under sections 120B.118 to 120B.124, to children age 3 to grade 3 and interventions for children in kindergarten to grade 3.\n(b) Literacy programs under this subdivision must comply with the provisions governing literacy program goals and data use under section 142D.12, subdivision 3, paragraph (b).\n(c) Literacy programs under this subdivision must use evidence-based reading instruction and interventions focused on structured literacy. ServeMinnesota must demonstrate to the department that the training AmeriCorps members receive meets or exceeds the requirements of section 120B.124, subdivision 4, for volunteers. Minnesota Reading Corps AmeriCorps members are not required to complete the training under section 120B.24, subdivision 4.\n(d) The commission must submit a biennial report to the committees of the legislature with jurisdiction over kindergarten through grade 12 education that records and evaluates program data to determine the efficacy of the programs under this subdivision.\n(a) A Minnesota math corps program is established to give ServeMinnesota AmeriCorps members a data-based problem-solving model of mathematics instruction useful for providing elementary and middle school students and their teachers with instructional support to meet state academic standards in mathematics.\n(b) The commission must submit a biennial report to the committees of the legislature with jurisdiction over kindergarten through grade 12 education that records and evaluates program data to determine the efficacy of the programs under this subdivision.",
	"repealed": false
}