{
	"id": "474A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.03",
	"title": "474A.03 DETERMINATION OF ANNUAL VOLUME CAP.",
	"text": "At the beginning of each calendar year after December 31, 2001, the commissioner shall determine the aggregate dollar amount of the annual volume cap under federal tax law for the calendar year, and of this amount the commissioner shall make the following allocation:\n(1) $74,530,000 to the small issue pool;\n(2) $122,060,000 to the housing pool, of which 27 percent of the adjusted allocation is reserved until the last Monday in June each year until 2021 for single-family housing programs, after which 31 percent of the adjusted allocation is reserved until the last Monday in June for single-family programs;\n(3) $12,750,000 to the public facilities pool; and\n(4) amounts to be allocated as provided in subdivision 2a.\nIf the annual volume cap is greater or less than the amount of bonding authority allocated under clauses (1) to (4) and subdivision 2a, paragraph (a), clauses (1) to (4), the allocation must be adjusted so that each adjusted allocation is the same percentage of the annual volume cap as each original allocation is of the total bonding authority originally allocated.\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\n(a) The commissioner shall make the following allocation to the Minnesota Housing Finance Agency and the following cities and county:\n(1) $84,940,000 per year to the Minnesota Housing Finance Agency;\n(2) $33,190,000 per year to the city of Minneapolis;\n(3) $24,890,000 per year to the city of Saint Paul; and\n(4) $16,600,000 per year to the Dakota County Community Development Agency for the county of Dakota and all political subdivisions located within the county.\n(b) Entitlement allocations provided under this subdivision must be used for mortgage bonds, mortgage credit certificates, public facility bonds, or residential rental project bonds, except that entitlement issuers may carry forward their allocations for any qualified bond as defined under section 474A.02, subdivision 23a.\n(c) Data on the home purchase price amount, mortgage amount, income, household size, and race of the households served with the proceeds of mortgage revenue bonds and mortgage credit certificates in the previous year must be submitted by each entitlement issuer to the Minnesota Housing Finance Agency by December 31 of each year. Compliance by the Minnesota Housing Finance Agency with the provisions of section 462A.073, subdivision 5, shall be deemed compliance with the reporting requirements of this subdivision.\nMS 1986 [Repealed, 1986 c 465 art 1 s 32; 1987 c 268 art 16 s 45]\nEvery entitlement issuer and other issuer shall pay to the commissioner a nonrefundable application fee to offset the state cost of program administration. The application fee is $20 for each $100,000 of entitlement or allocation requested, with the request rounded to the nearest $100,000. The minimum fee is $20. Fees received by the commissioner must be credited to the general fund. Each entitlement issuer must pay its application fee in full for that calendar year to the commissioner no later than when the first notice of issuance of bonds, notice of use of mortgage credit certificates, or notice of carry forward is submitted to the commissioner by that issuer.",
	"repealed": false
}