{
	"id": "171.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.01",
	"title": "171.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of this chapter, shall be given the meanings subjoined to them.\n[Renumbered subd 50]\n[Renumbered subd 39]\n[Renumbered subd 32]\n[Renumbered subd 45]\n[Renumbered subd 31]\n[Repealed, 1971 c 644 s 17]\n[Renumbered subd 43]\n[Renumbered subd 42]\n[Renumbered subd 48]\n[Renumbered subd 28]\n[Renumbered subd 30]\n[Renumbered subd 29]\n[Renumbered subd 37]\n[Renumbered subd 47]\n[Renumbered subd 34]\n[Renumbered subd 40]\n(a) (b) [Renumbered subd 49]\n(c) [Renumbered subd 38]\n\"Autocycle\" has the meaning given in section 169.011, subdivision 3a.\n\"Bus\" means every motor vehicle designed for carrying more than 15 passengers, including the driver, and used for the transportation of persons.\n[Renumbered subd 41]\n[Renumbered subd 46]\n\"Commercial motor vehicle\" means a motor vehicle or combination of motor vehicles used to transport passengers or property if the motor vehicle:\n(1) has a gross vehicle weight of more than 26,000 pounds;\n(2) has a towed unit with a gross vehicle weight of more than 10,000 pounds and the combination of vehicles has a combined gross vehicle weight of more than 26,000 pounds;\n(3) is a bus;\n(4) is of any size and is used in the transportation of hazardous materials that are required to be placarded under Code of Federal Regulations, title 49, parts 100-185; or\n(5) is outwardly equipped and identified as a school bus, except for type III vehicles defined in section 169.011, subdivision 71.\n[Renumbered subd 44]\n[Repealed, 1993 c 142 s 4]\n[Renumbered subd 33]\n[Renumbered subd 35]\n[Renumbered subd 36]\n\"Commissioner\" means the commissioner of public safety of the state of Minnesota, acting directly or through duly authorized agents.\n\"Conviction\" means a final conviction either after trial or upon a plea of guilty. Conviction also includes: a forfeiture of cash or collateral deposited to guarantee a defendant's appearance in court, which forfeiture has not been vacated; the failure to comply with a written notice to appear in court; or a breach of a condition of release without bail, is equivalent to a conviction.\n\"Current medical waiver\" means:\n(1) a medical variance, as defined in Code of Federal Regulations, title 49, section 390.5, that has been granted to the applicant or licensee by the Federal Motor Carrier Safety Administration and that is not expired, removed, or rescinded;\n(2) a waiver of physical qualifications that has been granted to the applicant or licensee by the commissioner under section 171.321, subdivision 2, and rules adopted under that section, and that is not expired or revoked; or\n(3) a waiver of physical qualifications that has been granted to the applicant or licensee by the commissioner of transportation under section 221.0314, subdivision 3 or 3a, or rules adopted under that section, and that is not expired or revoked.\n\"Department\" means the Department of Public Safety of the state, acting directly or through its duly authorized officers and agents.\n\"Driver\" means every person, who drives or is in actual physical control of a motor vehicle.\n\"Enhanced driver's license\" means a license, instruction permit, or provisional license to operate a motor vehicle issued or issuable under the laws of this state by the commissioner of public safety that denotes citizenship and identity and contains technology and security features approved by the secretary of the United States Department of Homeland Security. An enhanced driver's license may be used in the same manner as a driver's license, instruction permit, or provisional license, and is approved by the secretary of the United States Department of Homeland Security for purposes of entering the United States. All provisions in this chapter relating to drivers' licenses, instruction permits, and provisional licenses, including cancellation, suspension, revocation, reinstatement, examination, restriction, expiration, renewal, and unlawful acts and violations, apply to an enhanced driver's license.\n\"Enhanced identification card\" means an identification card issued or issuable under the laws of this state by the commissioner of public safety that denotes citizenship and identity and contains technology and security features approved by the secretary of the United States Department of Homeland Security. An enhanced identification card may be used in the same manner as an identification card and is approved by the secretary of the United States Department of Homeland Security for purposes of entering the United States.\n\"Farm tractor\" means every motor vehicle designed and used primarily as a farm implement for drawing plows, mowing machines and other implements of husbandry.\nFor purposes of this chapter only, \"farm truck\" means a single-unit truck, including a pickup truck as defined in section 168.002; truck-tractor; tractor; semitrailer; or trailer, used by its owner:\n(1) to transport from the farm to the market agricultural, horticultural, dairy, or other farm products, including livestock, produced or finished by the owner of the farm truck;\n(2) to transport the owner's other personal property from the farm to market; or\n(3) to transport property and supplies to the farm of the owner.\n\"Full-service provider\" has the meaning given in section 168.002, subdivision 12a.\n\"Gross vehicle weight\" means the greater of:\n(1) the unloaded weight of a vehicle or the unloaded weight of a truck-tractor and semitrailer combination, plus the weight of the load; or\n(2) the value specified by the manufacturer as the maximum gross weight or gross vehicle weight rating.\n\"Hazardous materials\" means any material that has been designated as hazardous under United States Code, title 49, section 5103, and is required to be placarded under Code of Federal Regulations, title 49, part 172, subpart F, or any quantity of a material listed as a select agent or toxin in Code of Federal Regulations, title 42, part 73.\n\"Head Start bus\" means a motor vehicle used to transport children or parents to or from a Head Start facility, or to or from Head Start-related activities, by the Head Start grantee, or by someone under an agreement with the Head Start grantee. A Head Start bus does not include a motor vehicle transporting children or parents to or from a Head Start facility for which parents or guardians receive direct compensation from a Head Start grantee, a motor coach operating under charter carrier authority, or a transit bus providing services as defined in section 174.22, subdivision 7.\n\"Interstate or foreign commerce\" means (1) any trade, traffic, or transportation within the jurisdiction of the United States between a place in a state and a place outside of that state, including a place outside of the United States, and (2) trade, traffic, and transportation in the United States that affects any trade, traffic, and transportation described in clause (1).\n\"Intrastate commerce\" means any trade, traffic, or transportation that occurs entirely within the state of Minnesota and that is not interstate or foreign commerce.\n\"License\" means any operator's license or any other license or permit to operate a motor vehicle issued or issuable under the laws of this state by the commissioner of public safety including:\n(1) any temporary license, instruction permit, or provisional license;\n(2) the privilege of any person to drive a motor vehicle whether or not the person holds a valid license; and\n(3) any nonresident's operating privilege.\n[Renumbered subd 31a]\n[Renumbered subd 31b]\n\"Manufactured home\" means any trailer or semitrailer which is designed, constructed, and equipped for use as a human dwelling place, living abode, or living quarters except travel trailers.\n\"Medical examiner\" has the meaning given in Code of Federal Regulations, title 49, section 390.5.\n\"Motor vehicle\" means every vehicle that is self-propelled, other than an electric personal assistive mobility device as defined in section 169.011, subdivision 26, and any vehicle propelled or drawn by a self-propelled vehicle, and not deriving its power from overhead wires except snowmobiles.\n(a) \"Motorcycle\" means every motor vehicle having a seat or saddle for the use of the rider and designed to travel on not more than three wheels in contact with the ground. Motorcycle includes motor scooters and bicycles with motor attached.\n(b) Motorcycle excludes tractors, motorized bicycles, and roadable aircraft, as defined in section 169.011, subdivision 67a.\n\"Motorized bicycle\" has the meaning given in section 169.011, subdivision 45.\n\"Noncompliant license,\" \"noncompliant identification card,\" or \"noncompliant license or identification card,\" means a driver's license or a Minnesota identification card issued under section 171.019, subdivision 2, paragraph (b). Unless provided otherwise, noncompliant license includes an appropriate instruction permit, provisional license, limited license, and restricted license.\n[See Note.]\n\"Nonresident\" means every person who is not a resident of this state.\n\"Owner\" means any person, firm, copartnership, association, or corporation who holds the legal title to a vehicle, or in the event a vehicle is the subject of an agreement for the conditional sale or lease thereof with the right of purchase upon performance of the conditions stated in the agreement and with an immediate right of possession vested in the conditional vendee or lessee, or in the event a mortgagor of a vehicle is entitled to possession, then such conditional vendee or lessee or mortgagor shall be deemed the owner for the purposes of this chapter.\n\"Passenger endorsement\" means the driver's license endorsement required of a person who operates a vehicle designed to transport more than 15 passengers, including the driver.\n\"Person\" means every natural person, firm, copartnership, association, or corporation.\n\"Primary driving supervisor\" means a person who: (1) supervises, for a majority of the supervised driving time, motor vehicle operation by an instruction permit holder who is under age 18; and (2) meets the applicable supervision requirements under this chapter.\n\"REAL ID Act\" means the REAL ID Act of 2005, Public Law 109-13, Division B.\n[See Note.]\n\"REAL ID compliant license,\" \"REAL ID compliant identification card,\" or \"REAL ID compliant license or identification card\" means a driver's license or a Minnesota identification card issued under section 171.019, subdivision 2, paragraph (a). Unless provided otherwise, REAL ID compliant license includes an appropriate instruction permit, provisional license, limited license, and restricted license.\n\"Residence address\" and \"permanent mailing address\" mean, for purposes of a driver's license or Minnesota identification card, the postal address of the permanent domicile within this state where an individual:\n(1) resides;\n(2) intends to reside within 30 calendar days after the date of application; or\n(3) intends to return whenever absent.\n\"School bus\" has the meaning given in section 169.011, subdivision 71.\n\"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States, including a United States military base located on foreign soil.\n\"Street\" or \"highway\" means the entire width between property lines of every way or place of whatever nature when any part thereof is open to the use of the public, as a matter of right, for purpose of vehicular traffic.\n\"Tank vehicle\" means any commercial motor vehicle that is designed to transport any liquid or gaseous materials within a tank, as defined in Code of Federal Regulations, title 49, section 178.320, including a cargo tank or a portable tank as defined in Code of Federal Regulations, title 49, section 171.8, that is either permanently or temporarily attached to the vehicle or the chassis, except portable tanks having a rated capacity under 1,000 gallons.\n\"Temporary lawful status\" has the meaning given in Code of Federal Regulations, title 6, section 37.3.\n[See Note.]\n\"Third-party tester\" means an individual who is an employee of a third-party testing program who has qualified for a third-party tester certificate issued by the commissioner granting the individual authorization to conduct road tests or skills tests.\n\"Third-party testing program\" means a program authorized by the commissioner to administer to an individual the road test or skills test.\n\"Temporary mailing address\" means the mailing address of any place where a person regularly or occasionally stays and may receive mail in their name other than the person's residence address. A temporary mailing address does not include the designated address under section 5B.05.\n(a) \"Travel trailer\" means any trailer or semitrailer designed and used for human living quarters that meets all of the following qualifications:\n(1) is not used as the residence of the owner or occupant;\n(2) is used for temporary living quarters by the owner or occupant while engaged in recreational or vacation activities; and\n(3) is towed on the public streets or highways incidental to such recreational or vacation activities.\n(b) The term \"travel trailer\" shall not include bunkhouses, so called, temporarily mounted on trailers, and manufactured homes. Such bunkhouses, exclusive of the trailer and manufactured homes, shall be listed and taxed as personal property as provided by law.\n\"Valid license,\" \"valid driver's license,\" \"valid Minnesota driver's license,\" \"valid standard driver's license,\" or other similar term, means any operator's license, provisional license, temporary license, limited license, permit, or other license to operate a motor vehicle issued or issuable under the laws of this state by the commissioner, or by another state or jurisdiction if specified, that is:\n(1) not expired, suspended, revoked, or canceled; and\n(2) not disqualified for the class of vehicle being operated.\n(a) \"Valid medical examiner's certificate\" means a record, on a form prescribed by the department:\n(1) of a medical examiner's examination of a person who holds or is applying for a class A, class B, or class C commercial driver's license;\n(2) upon which the medical examiner attests that the applicant or license holder is physically qualified to drive a commercial motor vehicle; and\n(3) that is not expired.\n(b) A valid medical examiner's certificate must be issued by a medical examiner who is certified by the Federal Motor Carrier Administration and listed on the National Registry of Certified Medical Examiners.\n\"Vehicle\" means every device in, upon, or by which any person or property is or may be transported or drawn upon any highway, excepting devices moved by human power or used exclusively upon stationary rails or tracks.\n\"Veteran with a total service-connected disability\" means a veteran, as defined in section 197.447, who provides to the commissioner satisfactory evidence that: (1) is issued by the Department of Veterans Affairs, the United States Veterans Administration, or the retirement board of one of the several branches of the armed forces; and (2) demonstrates that the veteran has received a 100 percent total and permanent service-connected disability rating.",
	"repealed": false
}