{
	"id": "3C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/3C.04",
	"title": "3C.04 OTHER OFFICE DUTIES DURING LEGISLATIVE SESSION.",
	"text": "The revisor's office shall give members of the legislature advice concerning the legal effect of bills or proposed bills, but only at the request of the members.\nThe revisor's office shall gather information about the practical operation and effect of statutes of this and other states.\nThe revisor's office shall report to the legislature any statutory changes recommended or discussed or statutory deficiencies noted in any opinion of the Supreme Court or the Court of Appeals of Minnesota. The report must be made by November 15 of each even-numbered year. It must treat opinions filed during the two-year period immediately preceding September 30 of the year before the year in which the session is held. It must include any comment necessary to outline clearly the legislative problem reported.\nThe revisor's office shall prepare and submit to the legislature bills clarifying and correcting the statutes and administrative rules.\nThe revisor's office shall assist in the enrollment and engrossment of bills. Senate bills are to be under the supervision of the secretary of the senate. House of representatives bills are to be under the supervision of the chief clerk of the house of representatives.\nIn preparing an engrossment or enrollment, the revisor may correct misspelled words and other minor clerical errors. No correction of this kind constitutes an alteration or departure from the text as shown in the journals of the senate and house of representatives.\nIn preparing an enrollment of a bill passed at a legislative session, the revisor shall assign the bill a chapter number. As far as practical, the numbers shall be assigned in the order of the date of the legislature's last vote on the bills before presentment to the governor. The revisor, as the agent of the legislature, shall present the enrolled bills to the governor and report to the house of origin the date of presentment of the enrollment. The revisor shall show on the enrollment the date the enrollment was presented to the governor.\nThe revisor's office shall perform other services requested by the legislature or either of its branches.",
	"repealed": false
}