{
	"id": "626A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.28",
	"title": "626A.28 REQUIREMENTS FOR GOVERNMENTAL ACCESS.",
	"text": "MS 2018 [Repealed, 2020 c 82 s 18]\nMS 2018 [Repealed, 2020 c 82 s 18]\n(a) Except as provided in paragraph (b) or sections 325M.01 to 325M.09, a provider of electronic communication service or remote computing service may disclose a record or other information pertaining to a subscriber to or customer of the service, not including the contents of communications, to any person other than a governmental entity.\n(b) A provider of electronic communication service or remote computing service may disclose a record or other information pertaining to a subscriber to or customer of the service, not including the contents of communications to a governmental entity only when the governmental entity:\n(1) uses an administrative subpoena authorized by statute, or a grand jury subpoena;\n(2) obtains a warrant;\n(3) obtains a court order for such disclosure under subdivision 4; or\n(4) has the consent of the subscriber or customer to the disclosure.\n(c) A governmental entity receiving records or information under this subdivision is not required to provide notice to a subscriber or customer.\n(d) Notwithstanding paragraph (b), a provider of electronic communication service or remote computing service may not disclose location information covered by section 626A.42 to a government entity except as provided in that section.\n[See Note.]\nA court order for disclosure under subdivision 3 must issue only if the governmental entity shows that there is reason to believe the records or other information sought, are relevant to a legitimate law enforcement inquiry. A court issuing an order pursuant to this section, on a motion made promptly by the service provider, may quash or modify such order, if the information or records requested are unusually voluminous in nature or compliance with such order otherwise would cause an undue burden on such provider.\nNo cause of action lies in any court against any provider of wire or electronic communication service, its officers, employees, agents, or other specified persons for providing information, facilities, or assistance in accordance with the terms of a court order, warrant, subpoena, or certification under section 626.085 or 626A.26 to 626A.34.",
	"repealed": false
}