{
	"id": "156.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.01",
	"title": "156.01 STATE BOARD OF VETERINARY MEDICINE.",
	"text": "There is hereby created a state Board of Veterinary Medicine which shall consist of two public members as defined by section 214.02 and five licensed veterinarians appointed by the governor. Each appointee shall be a resident of the state of Minnesota, and the veterinarian members of the board shall have practiced veterinary medicine in this state for at least five years prior to their appointment. Membership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements shall be as provided in sections 214.07 to 214.09. The provision of staff, administrative services and office space; the review and processing of complaints; the setting of board fees; and other provisions relating to board operations shall be as provided in chapter 214.\nWhenever the occasion arises pursuant to this chapter for the appointment of a veterinarian member of the board by the governor, the board of directors of the Minnesota Veterinary Medical Association may recommend to the governor, at least 30 days in advance of the date that the appointment is to be made, not more than three veterinarians qualified to serve on the board for each appointment to be made.\nThe board shall elect from its number a president and such other officers as are necessary, all from within its membership. One person may hold the offices of both secretary and treasurer. The board shall have a seal and the power to subpoena witnesses, to administer oaths, and take testimony. It shall make, alter, or amend rules that are necessary to carry this chapter into effect. It shall hold examinations for applicants for license to engage in veterinary practice at a time and place of its own choosing. Notice of an examination must be posted 90 days before the date set for the examination in all veterinary schools approved by the board in the state, and must be published in the American Association of Veterinary State Boards \"Directory of Veterinary Licensure Requirements.\" The board may hold other meetings it deems necessary; but no meeting shall exceed three days duration.\n[Repealed, 1976 c 222 s 209]\nThe executive director shall conduct all correspondence necessary to carry out the provisions of this chapter. The board shall keep an official record of all meetings. The board shall keep an official register of all applicants for licenses and a register of licensees. Such registers shall be prima facie evidence of the matters therein contained.\nMembers and employees of the board and consultants or other persons engaged in the investigation of violations and in the preparation, presentation, or management of and testimony pertaining to charges of violations of section 156.081 or other board regulatory provisions on behalf of the board are not civilly liable for any actions, transactions, or publications in the performance of their duties in accordance with those provisions.",
	"repealed": false
}