{
	"id": "444.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/444.18",
	"title": "444.18 AUTHORITY; TAX FOR COST; PROCEDURES.",
	"text": "Following the adoption of an ordinance under sections 444.16 to 444.21, the governing body may acquire, construct, reconstruct, extend, maintain, and otherwise improve storm sewer systems and related facilities within the district. Stormwater holding areas and ponds within and without the municipality may also be acquired, constructed, maintained, and improved for the benefit of any such district. The cost of the systems and facilities described in this subdivision may be recovered by the tax authorized in section 444.20.\nMS 1990 [Repealed, 1991 c 76 s 2]\nBefore the municipality awards a contract for an improvement, the governing body shall hold a public hearing on the proposed improvement following two publications in the official newspaper of a notice stating:\n(1) the time, date and place of the hearing;\n(2) the general nature of the improvement;\n(3) the estimated cost;\n(4) the area over which any levy will be imposed; and\n(5) the term over which the costs will be recovered.\nThe two publications shall be a week apart and the hearing shall be at least three days after the last publication. Not less than ten days before the hearing, notice of it shall be mailed to the owner of each parcel within the area proposed to be taxed, including the estimated tax to be levied against each parcel in the first year. Failure to give mailed notice or any defects in any notice shall not invalidate the proceedings. For the purpose of giving mailed notice, owners shall be those shown to be owners on the records of the county treasurer.\nBefore the hearing, the council shall secure from the city engineer or some other competent person a report advising it in a preliminary way as to:\n(a) whether the proposed improvement is feasible;\n(b) whether it should be made as proposed or in connection with some other improvement; and\n(c) the estimated cost of the improvement.\nNo error or omission in the report shall invalidate the proceeding unless it materially prejudices the interest of an owner. The council may also take other steps before the hearing including among other things the preparation of plans and specifications and the advertisement for bids on them that will in its judgment provide helpful information in determining the desirability and feasibility of the improvement. The hearing may be adjourned from time to time. A resolution ordering the improvement may be adopted at any time within six months after the date of the hearing.",
	"repealed": false
}