{
	"id": "515B.2-118",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-118",
	"title": "515B.2-118 AMENDMENT OF DECLARATION.",
	"text": "(a) Except as otherwise provided in subsection (d), the declaration, including any CIC plat, may be amended only by vote or written consent of unit owners of units to which at least 67 percent of the votes in the association are allocated, or any greater or other requirement the declaration specifies, subject to the following qualifications:\n(1) A declarant may execute supplemental declarations or amendments under section 515B.2-111 or 515B.2-112.\n(2) The association and certain unit owners, as applicable, may execute amendments under section 515B.2-107, 515B.2-109, 515B.2-112, 515B.2-114, or 515B.2-124.\n(3) Except for amendments or supplemental declarations under subsection (a)(1) and (2), and except as provided in sections 515B.1-102 (d)(3) and 515B.2-106 (a)(2), the unanimous written consent of the unit owners is required for any amendment which (i) creates or increases special declarant rights, (ii) increases the number of units, (iii) changes the boundaries of any unit, (iv) changes the allocated interests of a unit, (v) changes common elements to limited common elements or units, (vi) changes the authorized use of a unit from residential to nonresidential, or conversely, or (vii) changes the characterization of the unit owner's interest in a cooperative from real estate to personal property, or conversely. Where the amendment involves the conversion of common elements into a unit or units, the title to the unit or units created shall, upon recording of the amendment, vest in the association free and clear of the interests of the unit owners and all secured parties holding security interests in units.\n(4) In addition to any other requirements contained in this section, a declarant must execute an amendment that eliminates or modifies any special declarant rights held by that declarant.\n(5) If any provision of this chapter, the declaration, the bylaws, or the articles of incorporation requires the consent of a secured party holding a security interest in a unit as a condition for the approval or effectiveness of an amendment to the declaration, the bylaws, or the articles of incorporation, the consent is deemed to be granted if the secured party's written refusal to consent is not received by the association within 60 days after the secured party receives from the association notice and a copy of the amendment, by certified United States mail, postage prepaid and return receipt requested. If the secured party has not otherwise provided to the association an address for notice, the association shall send the notice to the address, if any, set forth in the recorded instrument that evidences the security interest. This subsection shall not apply to an amendment that affects the priority of a secured party's security interest or the ability of a secured party to foreclose its security interest. In such cases, the number or percentage of secured parties whose consent is required by the instrument to be amended must consent to the amendment in writing.\n(6) The declaration may specify less than 67 percent for approval of an amendment, but only if all of the units are restricted to nonresidential use.\n(7) If any provision of this chapter, the declaration, the bylaws, or the articles of incorporation requires the vote or consent of unit owners as a condition for the approval or effectiveness of an amendment to the declaration, the bylaws, or the articles of incorporation, the affirmative vote or consent of a unit owner is deemed to be granted if the association sends notice and a copy of the amendment, by certified United States mail, postage prepaid and return receipt requested, and (i) if a vote is conducted, the unit owner's vote is not cast against the proposed amendment, or (ii) if consent is requested, the unit owner's written refusal to consent is not received by the association within 60 days after notice is mailed. This subsection shall not apply to any amendment that would require execution by the association and certain unit owners pursuant to subsection (a)(2).\n(b) No action to challenge the validity of an amendment or a supplemental declaration may be brought more than two years after the amendment or supplemental declaration is recorded.\n(c) Every amendment to a declaration or supplemental declaration shall be recorded in every county in which any portion of the common interest community is located and is effective only when recorded. If an amendment (i) changes the number of units, (ii) changes the boundary of a unit, (iii) changes common elements to limited common elements, where the limited common element is required by section 515B.2-110 (c), to be shown on the CIC plat, (iv) changes limited common elements to common elements if the limited common elements are shown as limited common elements on the CIC plat, or (v) makes any other change that creates an inconsistency between the declaration, as amended, and the CIC plat, then an amendment to the CIC plat reflecting the change shall be recorded.\n(d) The association may petition the district court of any county in which any portion of the common interest community is located for an order reducing the percentage of affirmative votes or consents necessary for an amendment to the declaration, bylaws, or articles of incorporation, subject to the following qualifications:\n(1) The petition shall describe the reason for the amendment, the approval requirements based on the governing documents and applicable law, the effort that has been made to solicit approval of the association members, the number of affirmative votes or consents actually received, the number of negative votes or denials actually received, the number or percentage of affirmative votes or consents required to effect the amendment, and other matters the petitioner considers relevant to the court's determination. The petition shall also contain, as exhibits thereto, copies of all of the following: (i) the governing documents; (ii) the complete text of the amendment; (iii) copies of any notice and solicitation materials utilized in the solicitation of member approvals; and (iv) any other documentation that the petitioner believes will be useful to the court in deciding whether to grant the petition.\n(2) Upon filing the petition, the association shall contact the court administrator to obtain a hearing date not less than 90 days after the date of filing the petition.\n(3) Not less than 15 days prior to the date of the hearing, the association shall serve a copy of the petition, excluding the exhibits, and notice of the hearing date on all members of the association in the same manner as service of a summons by personal service, or by publication in circumstances in which service of a summons by publication would be allowed under the Minnesota Rules of Civil Procedure. Notwithstanding the foregoing, to avoid unnecessary expenses of service, the association may obtain from any member of the association a signed waiver of service (i) acknowledging receipt of a copy of the petition, excluding the exhibits, and notice of the hearing date, and (ii) waiving service thereof.\n(4) The court may grant the petition if it finds all of the following:\n(i) each member of the association was served with a copy of the petition, excluding the exhibits, and notice of the hearing date not less than 15 days prior to the date of the hearing, or waived service thereof, pursuant to subsection (d)(3);\n(ii) each secured party that is entitled to notice of the proposed amendment under the terms of the declaration, bylaws, or articles of incorporation, if any, either consented to the amendment, is deemed to have consented to the amendment pursuant to subsection (a)(5), or received a copy of the petition, excluding the exhibits, and notice of the hearing date not less than 15 days prior to the date of the hearing;\n(iii) the association conducted a vote or requested the consent of the members regarding the proposed amendment in accordance with the declaration, the bylaws, the articles of incorporation, this chapter, and any other applicable law;\n(iv) a reasonably diligent effort was made to permit all eligible members to vote, or to grant or deny consent, regarding the proposed amendment;\n(v) the amendment was approved by the affirmative vote or consent of unit owners of units to which at least 67 percent of the votes in the association are allocated, or if all of the units are restricted to nonresidential use, by the affirmative vote or consent of unit owners of units to which a majority of the votes in the association are allocated;\n(vi) the amendment is reasonable; and\n(vii) granting the petition is not improper for any reason stated in subsection (d)(6).\n(5) If the court makes the findings required by subsection (d)(4), any order issued pursuant to this section may confirm the amendment as being validly approved on the basis of the affirmative votes or consents actually received, or the order may dispense with any requirement relating to quorums or to the number or percentage of votes or consents needed for approval of the amendment that would otherwise exist under the governing documents.\n(6) Notwithstanding subsections (d)(1) to (5), the court shall not approve any amendment that:\n(i) would require execution by the association and certain unit owners pursuant to subsection (a)(2), unless the association and unit owners execute the amendment;\n(ii) would require the unanimous written consent of the unit owners pursuant to subsection (a)(3);\n(iii) would eliminate any special rights, preferences, or privileges designated in the declaration as belonging to the declarant, without the consent of the declarant; or\n(iv) would impair the security interest of a secured party without the approval of the percentage of secured parties specified in the declaration, if the declaration requires the approval of a specified percentage of secured parties.\n(7) An amendment to a declaration is not effective pursuant to this subsection until the court order and amendment have been recorded in every county in which a portion of the common interest community is located. Upon recordation of the amendment and court order, the declaration, as amended in accordance with this section, shall have the same force and effect as if the amendment were adopted in compliance with every requirement imposed by this chapter and the declaration.",
	"repealed": false
}