{
	"id": "136A.826",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.826",
	"title": "136A.826 INFORMATION TO STUDENTS.",
	"text": "A private career school or its agent must provide the catalog, brochure, or electronic display required in section 136A.822, subdivision 10, to a prospective student in a time or manner that gives the prospective student at least five days to read the catalog, brochure, or electronic display before signing a contract or enrollment agreement or before being accepted by a private career school that does not use a written contract or enrollment agreement.\nA contract or enrollment agreement used by a private career school must include at least the following:\n(1) the name and address of the private career school, clearly stated;\n(2) a clear and conspicuous disclosure that the agreement is a legally binding instrument upon written acceptance of the student by the private career school unless canceled under section 136A.827;\n(3) the private career school's cancellation and refund policy that shall be clearly and conspicuously entitled \"Buyer's Right to Cancel\";\n(4) a clear statement of total cost of the program including tuition and all other charges;\n(5) the name and description of the program, including the number of hours or credits of classroom instruction, or distance instruction, that shall be included; and\n(6) a clear and conspicuous explanation of the form and means of notice the student should use in the event the student elects to cancel the contract or sale, the effective date of cancellation, and the name and address, email address, or phone number of the seller to which the notice should be sent or delivered.\nThe contract or enrollment agreement must not include a wage assignment provision or a confession of judgment clause.\nImmediately upon signing of the enrollment agreement or the contract by a prospective student, the private career school or agent shall furnish to the prospective student an exact duplicate copy of the enrollment agreement or contract.",
	"repealed": false
}