{
	"id": "79A.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.071",
	"title": "79A.071 CUSTODIAL ACCOUNTS.",
	"text": "All securities shall be deposited with the commissioner of management and budget or in a custodial account with a depository institution acceptable to the commissioner of management and budget. Surety bonds shall be filed with the commissioner. The commissioner and the commissioner of management and budget may sell or collect, in the case of default of the employer or fund, the amount that yields sufficient funds to pay compensation due under the Workers' Compensation Act.\nSecurities in physical form deposited with the commissioner of management and budget must bear the following assignment, which shall be signed by an officer, partner, or owner: \"Assigned to the state of Minnesota for the benefit of injured employees of the self-insured employer under the Minnesota Workers' Compensation Act.\" Any securities held in a custodial account, whether in physical form, book entry, or other form, need not bear the assignment language. The instrument or contract creating and governing any custodial account must contain the following assignment language: \"This account is assigned to the commissioner of management and budget by the Company to pay compensation and perform the obligations of employers imposed under Minnesota Statutes, chapter 176. A depositor or other party has no right, title, or interest in the security deposited in the account until released by the state.\"\nAll securities in physical form on deposit with the commissioner of management and budget and surety bonds on deposit shall remain in the custody of the commissioner of management and budget or the commissioner for a period of time dictated by the applicable statute of limitations provided in the Workers' Compensation Act. All original instruments and contracts creating and governing custodial accounts shall remain with the commissioner of management and budget or the commissioner for a period of time dictated by the applicable statute of limitations provided in the Workers' Compensation Act.\nNo securities in physical form on deposit with the commissioner of management and budget or custodial accounts assigned to the state shall be released without an order from the commissioner.\nAny securities deposited with the commissioner of management and budget or with a custodial account assigned to the commissioner of management and budget or surety bonds held by the commissioner may be exchanged or replaced by the depositor with other acceptable securities or surety bonds of like amount so long as the market value of the securities or amount of the surety bond equals or exceeds the amount of deposit required. If securities are replaced by a surety bond, the self-insurer must maintain securities on deposit in an amount sufficient to meet all outstanding workers' compensation liability arising during the period covered by the deposit of the replaced securities, subject to the limitations on maximum security deposits established in Minnesota Rules.",
	"repealed": false
}