{
	"id": "462A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.33",
	"title": "462A.33 ECONOMIC DEVELOPMENT AND HOUSING CHALLENGE PROGRAM.",
	"text": "(a) The economic development and housing challenge program is created to be administered by the agency. Notwithstanding section 462A.24, this section shall be construed based on the specific language within this section and within an appropriation pursuant to this section.\n(b) The program shall provide grants or loans for the purpose of construction, acquisition, rehabilitation, demolition or removal of existing structures, construction financing, permanent financing, interest rate reduction, refinancing, and gap financing of housing to support economic development and redevelopment activities or job creation or job preservation within a community or region by meeting locally identified housing needs.\nGap financing is either:\n(1) the difference between the costs of the property, including acquisition, demolition, rehabilitation, and construction, and the market value of the property upon sale; or\n(2) the difference between the cost of the property and the amount the targeted household can afford for housing, based on industry standards and practices.\n(c) Preference for grants and loans shall be given to comparable proposals that include regulatory changes or waivers that result in identifiable cost avoidance or cost reductions, such as increased density, flexibility in site development standards, or zoning code requirements. Preference must also be given among comparable proposals to proposals for projects that are accessible to transportation systems, jobs, schools, and other services.\n(d) If a grant or loan is used for demolition or removal of existing structures, the cleared land must be used for the construction of housing to be owned or rented by persons who meet the income limits of this section or for other housing-related purposes that primarily benefit the persons residing in the adjacent housing. In making selections for grants or loans for projects that demolish affordable housing units, the agency must review the potential displacement of residents and consider the extent to which displacement of residents is minimized.\nChallenge grants or loans may be made to a city, a federally recognized American Indian Tribe or subdivision located in Minnesota, a Tribal housing corporation, a private developer, a nonprofit organization, a school district, a cooperative unit, as defined in section 123A.24, subdivision 2, a charter school, or the owner of the housing, including individuals. For the purpose of this section, \"city\" has the meaning given it in section 462A.03, subdivision 21. To the extent practicable, grants and loans shall be made so that an approximately equal number of housing units are financed in the metropolitan area and in the nonmetropolitan area.\nFifty percent of the funds appropriated for this section must be used for challenge grants or loans for housing proposals with financial or in-kind contributions from nonstate resources that reduce the need for deferred loan or grant funds from state resources. Challenge grants or loans must be used for economically viable homeownership or rental housing proposals that address the housing needs of the local work force.\nAmong comparable proposals, preference must be given to proposals that include contributions from nonstate resources for the greatest portion of the total development cost. Comparable proposals with contributions from local units of government or private philanthropic, religious, or charitable organizations must be given preference in awarding grants or loans.\nFor the purpose of this subdivision, a contribution may consist partially or wholly of the premium paid for federal housing tax credits.\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nHouseholds served through challenge grants or loans must not have incomes at the time of initial occupancy that exceed, for homeownership projects, 115 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development, and for rental housing projects, 80 percent of the greater of state or area median income as determined by the United States Department of Housing and Urban Development except that the housing developed or rehabilitated with challenge fund grants or loans must be affordable to the local work force.\nPreference among comparable proposals shall be given those that provide housing opportunities for an expanded range of household incomes within a community or that provide housing opportunities for a wide range of incomes within the development.\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nThe limitations on return of eligible mortgagors contained in section 462A.03, subdivision 13, do not apply to loans or grants for rental housing if the loans or grants made by the agency, from all sources, are less than 50 percent of the total costs, as determined by the agency.\nA school district; a cooperative unit, as defined in section 123A.24, subdivision 2; or a charter school may receive funding under this section in the form of a grant less than $100,000. A school district, intermediate district, or charter school that uses a grant under this section to construct a home for owner occupancy must require the future occupant to participate in the homeownership education counseling and training program under section 462A.209.",
	"repealed": false
}