{
	"id": "204B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.06",
	"title": "204B.06 FILING FOR PRIMARY; AFFIDAVIT OF CANDIDACY.",
	"text": "An affidavit of candidacy shall state the name of the office sought and, except as provided in subdivision 4, shall state that the candidate:\n(1) is an eligible voter;\n(2) has no other affidavit on file as a candidate for any office at the same primary or next ensuing general election, except as authorized by subdivision 9; and\n(3) is, or will be on assuming the office, 21 years of age or more, and will have maintained residence in the district from which the candidate seeks election for 30 days before the general election.\nAn affidavit of candidacy must include a statement that the candidate's name as written on the affidavit for ballot designation is the candidate's true name or the name by which the candidate is commonly and generally known in the community.\nAn affidavit of candidacy for partisan office shall also state the name of the candidate's political party or political principle, stated in three words or less.\n[Repealed, 1Sp2001 c 10 art 18 s 44]\n(a) An affidavit of candidacy must state a telephone number where the candidate can be contacted. An affidavit must also state the candidate's or campaign's nongovernment issued electronic mail address or an attestation that the candidate and the candidate's campaign do not possess an electronic mail address. An affidavit must also state the candidate's current address of residence as determined under section 200.031, or at the candidate's request in accordance with paragraph (c), the candidate's campaign contact address. When filing the affidavit, the candidate must present the filing officer with the candidate's valid driver's license or state identification card that contains the candidate's current address of residence, or documentation of proof of residence authorized for election day registration in section 201.061, subdivision 3, paragraph (a), clause (2); clause (3), item (ii); or paragraph (d). If the address on the affidavit and the documentation do not match, the filing officer must not accept the affidavit. The form for the affidavit of candidacy must allow the candidate to request, if eligible, that the candidate's address of residence be classified as private data, and to provide the certification required under paragraph (c) for classification of that address.\n(b) If an affidavit for an office where a residency requirement must be satisfied by the close of the filing period is filed as provided by paragraph (c), the filing officer must, within one business day of receiving the filing, determine whether the address provided in the affidavit of candidacy is within the area represented by the office the candidate is seeking. For all other candidates who filed for an office whose residency requirement must be satisfied by the close of the filing period, a registered voter in this state may request in writing that the filing officer receiving the affidavit of candidacy review the address as provided in this paragraph, at any time up to one day after the last day for filing for office. If requested, the filing officer must determine whether the address provided in the affidavit of candidacy is within the area represented by the office the candidate is seeking. If the filing officer determines that the address is not within the area represented by the office, the filing officer must immediately notify the candidate and the candidate's name must be removed from the ballot for that office. A determination made by a filing officer under this paragraph is subject to judicial review under section 204B.44.\n(c) If the candidate requests that the candidate's address of residence be classified as private data, the candidate must list the candidate's address of residence on a separate form to be attached to the affidavit. The candidate must also certify on the affidavit that either: (1) a police report has been submitted, an order for protection has been issued, or the candidate has a reasonable fear in regard to the safety of the candidate or the candidate's family; or (2) the candidate's address is otherwise private pursuant to Minnesota law. The address of residence provided by a candidate who makes a request for classification on the candidate's affidavit of candidacy and provides the certification required by this paragraph is classified as private data, as defined in section 13.02, subdivision 12, but may be reviewed by the filing officer as provided in this subdivision.\n(d) The requirements of this subdivision do not apply to affidavits of candidacy for a candidate for: (1) judicial office; (2) the office of county attorney; or (3) county sheriff.\nA candidate who seeks the nomination of a major political party for a partisan office shall state on the affidavit of candidacy that the candidate either participated in that party's most recent precinct caucus or intends to vote for a majority of that party's candidates at the next ensuing general election.\n[Repealed, 1983 c 253 s 26]\nCandidates for president or vice president of the United States are not required to file an affidavit of candidacy for office. Candidates who seek nomination for the office of United States senator or representative shall state the following information on the affidavit:\n(1) for United States senator, that the candidate will be an inhabitant of this state when elected and will be 30 years of age or older and a citizen of the United States for not less than nine years on the next January 3 or, in the case of an election to fill a vacancy, within 21 days after the special election; and\n(2) for United States representative, that the candidate will be an inhabitant of this state when elected and will be 25 years of age or older and a citizen of the United States for not less than seven years on the next January 3 or, in the case of an election to fill a vacancy, within 21 days after the special election.\nCandidates who seek nomination for the following offices shall state the following additional information on the affidavit:\n(1) for governor or lieutenant governor, that on the first Monday of the next January the candidate will be 25 years of age or older and, on the day of the state general election, a resident of Minnesota for not less than one year;\n(2) for supreme court justice, court of appeals judge, or district court judge, that the candidate is learned in the law and will not turn 70 years of age before the first Monday in January of the following year;\n(3) for county, municipal, school district, or special district office, that the candidate meets any other qualifications for that office prescribed by law;\n(4) for senator or representative in the legislature, that on the day of the general or special election to fill the office the candidate will have maintained residence not less than one year in the state and not less than six months in the legislative district from which the candidate seeks election.\nWhen two candidates are to be elected United States senators from this state at the same election, each individual filing for the nomination shall state in the affidavit of candidacy the term for which the individual desires to be a candidate, by stating the date of the expiration of the term.\nAn individual who files as a candidate for the office of chief justice or associate justice of the supreme court, judge of the court of appeals, or judge of the district court shall state in the affidavit of candidacy the office of the particular justice or judge for which the individual is a candidate. The individual shall be a candidate only for the office identified in the affidavit. Each justice of the supreme court and each court of appeals and district court judge is deemed to hold a separate nonpartisan office.\nAn individual who files as a candidate for governor or lieutenant governor shall file the affidavit of candidacy jointly with the affidavit of another individual who seeks nomination as a candidate for the other office.\nA candidate for judicial office or for the office of county attorney shall submit with the affidavit of candidacy proof that the candidate is licensed to practice law in this state. Proof means providing a copy of a current attorney license.\nA candidate for county sheriff shall submit with the affidavit of candidacy proof of licensure as a peace officer in this state. Proof means providing a copy of a current Peace Officer Standards and Training Board license.\nNotwithstanding subdivision 1, clause (2):\n(1) a candidate for soil and water conservation district supervisor in a district not located in whole or in part in Anoka, Hennepin, Ramsey, or Washington County may also have on file an affidavit of candidacy for:\n(i) mayor or council member of a statutory or home rule charter city of not more than 2,500 population contained in whole or in part in the soil and water conservation district; or\n(ii) town supervisor in a town of not more than 2,500 population contained in whole or in part in the soil and water conservation district; and\n(2) a candidate for school board member may also have on file an affidavit of candidacy for town board supervisor, unless that town board is exercising the powers of a statutory city under section 368.01 or an applicable special law.",
	"repealed": false
}