{
	"id": "60A.206",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.206",
	"title": "60A.206 QUALIFICATION AS ELIGIBLE SURPLUS LINES INSURER.",
	"text": "A surplus lines broker shall place nonadmitted insurance only with insurers which are in a stable and unimpaired financial condition. An insurer recognized by the commissioner as an eligible surplus lines insurer pursuant to subdivision 2 shall be considered to meet the requirements of this subdivision. Recognition as an eligible surplus lines insurer shall be conditioned upon the insurers continued compliance with sections 60A.195 to 60A.209.\nAn insurer not otherwise licensed to engage in the business of insurance in Minnesota may apply for recognition as an eligible surplus lines insurer by filing an application in the form and with the information as reasonably required by the commissioner regarding the insurer's financial stability, reputation, integrity and operating plans, accompanied by a license fee of $500. The commissioner may delegate to an association the power to process and make recommendations on applications for recognition as an eligible surplus lines insurer. Notwithstanding delegation by the commissioner, an applicant may file an application directly with the commissioner.\n(a) The commissioner shall recognize the insurer as an eligible surplus lines insurer when satisfied that the insurer is in a stable, unimpaired financial condition and that the insurer is qualified to provide coverage in compliance with sections 60A.195 to 60A.209. If filed with full supporting documentation before July 1 of any year, applications submitted under subdivision 2 shall be acted upon by the commissioner before December 31 of the year of submission.\n(b) The commissioner shall not authorize a foreign insurer as an eligible surplus lines insurer unless the insurer:\n(1) is domiciled within a United States jurisdiction and authorized to write the type of insurance in its domiciliary jurisdiction; and\n(2) has capital and surplus or its equivalent under the laws of its domiciliary jurisdiction which equals the greater of:\n(i) the minimum capital and surplus requirements under the laws of Minnesota; or\n(ii) $15,000,000.\nThe requirements of item (i) may be satisfied by an insurer's possessing less than the minimum capital and surplus upon an affirmative finding of acceptability by the commissioner. The finding shall be based upon factors such as quality of management, capital and surplus of any parent company, company underwriting profit and investment income trends, market availability, and company record and reputation within the industry. In no event shall the commissioner make an affirmative finding of acceptability when the surplus lines insurer's capital and surplus is less than $4,500,000.\n(c) Eligible surplus lines insurers domiciled within the United States shall file an annual statement and an annual financial audit, under the terms and conditions of section 60A.13, subdivisions 1, 3a, and 6, and are subject to the penalties of section 72A.061, and are subject to section 60A.03, subdivision 5, in regard to those requirements. The commissioner also has the powers provided in section 60A.13, subdivision 2, in regard to eligible surplus lines insurers.\n(d) Eligible surplus lines insurers domiciled outside the United States shall file an annual statement on the standard nonadmitted insurers information office financial reporting format as prescribed by the National Association of Insurance Commissioners and an annual financial audit performed by an independent accounting firm. The commissioner shall not prohibit a surplus lines broker from placing nonadmitted insurance with, or procuring nonadmitted insurance from, an alien insurer that is included on the Quarterly Listing of Alien Insurers maintained by the National Association of Insurance Commissioners International Insurers Department.\nWhen the commissioner considers it necessary, the commissioner may request information about or examine the affairs of any eligible surplus lines insurer at the expense of the insurer, to determine whether the insurer should continue to remain on the list of eligible surplus lines insurers. If the commissioner determines that it is in the public interest to remove an insurer from the list because the insurer no longer meets the requirements of sections 60A.195 to 60A.209, or is no longer qualified to provide coverage under sections 60A.195 to 60A.209, the commissioner shall do so. If an insurer removed from the list desires a hearing pursuant to the Administrative Procedure Act, the hearing shall be scheduled within 30 days following request for the hearing.\nBefore recognition as an eligible surplus lines insurer in this state, an alien insurer shall maintain a trust fund in the United States in cash, marketable securities, or other substantially equivalent instruments of at least $1,500,000 with a United States bank which is a member of the Federal Reserve System or which is on deposit with regulatory authorities in this or another state for the benefit of all United States policyholders and beneficiaries. A trust fund required under this subdivision shall not have an expiration date which is at any time less than five years in the future, on a continuing basis.\nSubdivisions 3 and 5 shall not apply to a group including incorporated and unincorporated, individual alien insurers which, in place of the requirements prescribed in subdivisions 3 and 5, maintain assets as provided in subdivision 3 and hold in trust for all policyholders and beneficiaries in the United States not less than $50,000,000 in the aggregate. The incorporated members of the group shall not be engaged in any business other than underwriting as a member of the group and must be subject to the same level of solvency regulation and control by the group's domiciliary regulator as are the unincorporated members.\nEach eligible surplus lines insurer shall appoint the commissioner as its resident agent, for purposes of service of process.",
	"repealed": false
}