{
	"id": "548.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/548.251",
	"title": "548.251 COLLATERAL SOURCE CALCULATIONS.",
	"text": "For purposes of this section, \"collateral sources\" means payments related to the injury or disability in question made to the plaintiff, or on the plaintiff's behalf up to the date of the verdict, by or pursuant to:\n(1) a federal, state, or local income disability or Workers' Compensation Act; or other public program providing medical expenses, disability payments, or similar benefits;\n(2) health, accident and sickness, or automobile accident insurance or liability insurance that provides health benefits or income disability coverage; except life insurance benefits available to the plaintiff, whether purchased by the plaintiff or provided by others, payments made pursuant to the United States Social Security Act, or pension payments;\n(3) a contract or agreement of a group, organization, partnership, or corporation to provide, pay for, or reimburse the costs of hospital, medical, dental or other health care services; or\n(4) a contractual or voluntary wage continuation plan provided by employers or any other system intended to provide wages during a period of disability, except benefits received from a private disability insurance policy where the premiums were wholly paid for by the plaintiff.\n[See Note.]\nIn a civil action, whether based on contract or tort, when liability is admitted or is determined by the trier of fact, and when damages include an award to compensate the plaintiff for losses available to the date of the verdict by collateral sources, a party may file a motion within ten days of the date of entry of the verdict requesting determination of collateral sources. If the motion is filed, the parties shall submit written evidence of, and the court shall determine:\n(1) amounts of collateral sources that have been paid for the benefit of the plaintiff or are otherwise available to the plaintiff as a result of losses except those for which a subrogation right has been asserted; and\n(2) amounts that have been paid, contributed, or forfeited by, or on behalf of, the plaintiff or members of the plaintiff's immediate family for the two-year period immediately before the accrual of the action and until judgment is entered to secure the right to a collateral source benefit that the plaintiff is receiving as a result of losses.\n(a) The court shall reduce the award by the amounts determined under subdivision 2, clause (1), and offset any reduction in the award by the amounts determined under subdivision 2, clause (2).\n(b) If the court cannot determine the amounts specified in paragraph (a) from the written evidence submitted, the court may within ten days request additional written evidence or schedule a conference with the parties to obtain further evidence.\n(c) In any case where the claimant is found to be at fault under section 604.01, the reduction required under paragraph (a) must be made before the claimant's damages are reduced under section 604.01, subdivision 1.\nIf the fees for legal services provided to the plaintiff are based on a percentage of the amount of money awarded to the plaintiff, the percentage must be based on the amount of the award as adjusted under subdivision 3. Any subrogated provider of a collateral source not separately represented by counsel shall pay the same percentage of attorney fees as paid by the plaintiff and shall pay its proportionate share of the costs.\nThe jury shall not be informed of the existence of collateral sources or any future benefits which may or may not be payable to the plaintiff.",
	"repealed": false
}