{
	"id": "16C.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.28",
	"title": "16C.28 CONTRACTS; AWARD.",
	"text": "(a) All state building and construction contracts entered into by or under the supervision of the commissioner or an agency for which competitive bids or proposals are required may be awarded to either of the following:\n(1) the lowest responsible bidder, taking into consideration conformity with the specifications, terms of delivery, the purpose for which the contract is intended, the status and capability of the vendor or contractor, other considerations imposed in the call for bids, and, where appropriate, principles of life-cycle costing; or\n(2) the vendor or contractor offering the best value, taking into account the specifications of the request for proposals, the price and performance criteria as set forth in subdivision 1b, and described in the solicitation document.\n(b) The vendor or contractor must secure bonding, commercial general insurance coverage, and workers' compensation insurance coverage under paragraph (a), clause (1) or (2). The commissioner shall determine whether to use the procurement process described in paragraph (a), clause (1), or the procurement process described in paragraph (a), clause (2), and paragraph (c). If the commissioner uses the method in paragraph (a), clause (2), and paragraph (c), the head of the agency shall determine which vendor or contractor offers the best value, subject to the approval of the commissioner. Any or all bids or proposals may be rejected.\n(c) When using the procurement process described in subdivision 1, paragraph (a), clause (2), the solicitation document must state the relative weight of price and other selection criteria. The award must be made to the vendor or contractor offering the best value applying the weighted selection criteria. If an interview of the vendor's or contractor's personnel is one of the selection criteria, the relative weight of the interview shall be stated in the solicitation document and applied accordingly.\n(a) The state recognizes the importance of the inclusion of a best value contracting system for construction as an alternative to the current low-bid system of procurement. In order to accomplish that goal, state and local governmental entities shall be able to use best value.\n(b) \"Best value\" means the procurement method defined in subdivision 1b.\n(c) The commissioner or any agency for which competitive bids or proposals are required may not use best value contracting for more than one project annually, or 20 percent of its projects, whichever is greater, in each of the first three fiscal years in which best value construction contracting is used.\nFor the purposes of construction, building, alteration, improvement, or repair services, \"best value\" describes the result determined by a procurement method that considers price and other criteria, which may include, but are not limited to:\n(1) the quality of the vendor's or contractor's performance on previous projects;\n(2) the timeliness of the vendor's or contractor's performance on previous projects;\n(3) the level of customer satisfaction with the vendor's or contractor's performance on previous projects;\n(4) the vendor's or contractor's record of performing previous projects on budget and ability to minimize cost overruns;\n(5) the vendor's or contractor's ability to minimize change orders;\n(6) the vendor's or contractor's ability to prepare appropriate project plans;\n(7) the vendor's or contractor's technical capabilities;\n(8) the individual qualifications of the contractor's key personnel; or\n(9) the vendor's or contractor's ability to assess and minimize risks.\n\"Performance on previous projects\" does not include the exercise or assertion of a person's legal rights. This definition does not apply to sections 16C.32, 16C.33, 16C.34, and 16C.35.\nThe commissioner shall establish procedures for developing and awarding best value requests for proposals for construction projects. The criteria to be used to evaluate the proposals must be included in the solicitation document and must be evaluated in an open and competitive manner.\nAny personnel administering procurement procedures for a user of best value procurement or any consultant retained by a local unit of government to prepare or evaluate solicitation documents must be trained, either by the department or through other training, in the request for proposals process for best value contracting or construction projects.\nA bid containing an alteration or erasure of any price contained in the bid which is used in determining the lowest responsible bid must be rejected unless the alteration or erasure is corrected in a manner that is clear and authenticated by an authorized representative of the responder. An alteration or erasure may be crossed out and the correction printed in ink or typewritten adjacent to it and initialed by an authorized representative of the responder.\nThe commissioner may reject the bid or proposal of any vendor or contractor who has failed to perform a previous contract with the state. In the case of identical low bids from two or more bidders, the commissioner may use negotiated procurement methods with the tied low bidders for that particular transaction so long as the price paid does not exceed the low tied bid price. The commissioner may award contracts to more than one vendor or contractor in accordance with subdivision 1, if doing so does not decrease the service level or diminish the effect of competition.\n[Repealed by amendment, 2014 c 196 art 2 s 14]\n[Repealed by amendment, 2014 c 196 art 2 s 14]\nWhen prevailing wage laws apply, an agency shall not be liable for costs under section 177.43, subdivision 3, if it has included language in its contracts which requires vendors and contractors to comply with prevailing wage laws and the contract also contains the following elements:\n(1) a description of the prevailing wage laws and a citation to relevant statutes;\n(2) contact details for further information from the Department of Labor and Industry; and\n(3) a statement of contractor and subcontractor liability for failure to adhere to prevailing wage laws.",
	"repealed": false
}