{
	"id": "161.166",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.166",
	"title": "161.166 COMMISSIONER ACTION; OTHER HIGHWAYS.",
	"text": "This section applies to trunk highways that are not interstate highways.\nIf the appeal board recommends approval of the final layout or does not submit its findings or recommendations within 60 days of the hearing, in which case the final layout is deemed approved, the commissioner may prepare substantially similar final construction plans and proceed with the project. If the final construction plans change access or traffic capacity or require additional acquisition of right-of-way from the final layout approved by the appeal board, the commissioner shall submit the portion of the final construction plan that shows the changes, to the governing body for its approval or disapproval under section 161.164, subdivision 2.\n(a) If the appeal board approves the final layout with modifications, the commissioner may:\n(1) prepare final construction plans including the modifications, notify the governing body, and proceed with the project;\n(2) decide not to proceed with the project; or\n(3) prepare a new final layout and resubmit it to the governing body for approval or disapproval under section 161.164, subdivision 2.\n(b) If the final construction plans contain changes in access or traffic capacity or require additional acquisition of permanent right-of-way from the final layout reviewed by the appeal board or the governing body, the commissioner shall resubmit the portion of the final construction plans that shows the changes, to the governing body for its approval or disapproval under section 161.164, subdivision 2.\nIf the appeal board disapproves the final layout, the commissioner may:\n(1) decide not to proceed with the project; or\n(2) prepare a new final layout and submit it to the governing body for approval or disapproval under section 161.164, subdivision 2.\nThe commissioner shall send a complete set of final construction plans to the municipality at least 45 days before the bid opening for informational purposes.",
	"repealed": false
}