{
	"id": "21.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.82",
	"title": "21.82 LABEL REQUIREMENTS; AGRICULTURAL, VEGETABLE, FLOWER, OR WILDFLOWER SEEDS.",
	"text": "Each container of agricultural, vegetable, flower, or wildflower seed which is offered for sale for sowing purposes must bear or have attached in a conspicuous place a plainly written or printed label or tag in the English language giving the information required by this section. This statement must not be modified or denied in the labeling or on another label attached to the container.\nFor agricultural, vegetable, flower, or wildflower seeds offered for sale as agricultural seed, except as otherwise provided in subdivisions 4, 5, and 6, the label must contain:\n(a) The name of the kind or kind and variety for each seed component in excess of five percent of the whole and the percentage by weight of each in order of its predominance. The commissioner shall by rule designate the kinds that are required to be labeled as to variety. If the variety of those kinds generally labeled as to variety is not stated and it is not required to be stated, the label shall show the name of the kind and the words: \"Variety not stated.\" The heading \"pure seed\" must be indicated on the seed label in close association with other required label information.\n(1) The percentage that is hybrid shall be at least 95 percent of the percentage of pure seed shown unless the percentage of pure seed which is hybrid seed is shown separately. If two or more kinds or varieties are present in excess of five percent and are named on the label, each that is hybrid shall be designated as hybrid on the label. Any one kind or kind and variety that has pure seed which is less than 95 percent but more than 75 percent hybrid seed as a result of incompletely controlled pollination in a cross shall be labeled to show the percentage of pure seed that is hybrid seed or a statement such as \"contains from 75 percent to 95 percent hybrid seed.\" No one kind or variety of seed shall be labeled as hybrid if the pure seed contains less than 75 percent hybrid seed. The word hybrid shall be shown on the label in conjunction with the kind.\n(2) Blends shall be listed on the label using the term \"blend\" in conjunction with the kind.\n(3) Mixtures shall be listed on the label using the term \"mixture,\" \"mix,\" or \"mixed.\"\n(b) Lot number or other lot identification.\n(c) Origin, if known, or that the origin is unknown.\n(d) Percentage by weight of all weed seeds present. This percentage may not exceed one percent. The heading \"weed seed\" must be indicated on the seed label in close association with other required label information.\n(e) Name and rate of occurrence per pound of each kind of restricted noxious weed seeds present. They must be listed under the heading \"noxious weed seeds\" in close association with other required label information.\n(f) Percentage by weight of seeds other than those kinds and varieties required to be named on the label. They must be listed under the heading \"other crop\" in close association with other required label information.\n(g) Percentage by weight of inert matter. The heading \"inert matter\" must be indicated on the seed label in close association with other required label information.\n(h) Net weight of contents, to appear on either the container or the label.\n(i) For each named kind or variety of seed:\n(1) percentage of germination, exclusive of hard or dormant seed or both;\n(2) percentage of hard or dormant seed or both, if present; and\n(3) the calendar month and year the percentages were determined by test or the statement \"sell by (month and year)\" which may not be more than 12 months from the date of test, exclusive of the month of test.\nThe headings for \"germination\" and \"hard seed or dormant seed\" percentages must be stated separately on the seed label. A separate percentage derived from combining these percentages may also be stated on the seed label as \"total viable.\"\n(j) Name and address of the person who labeled the seed or who sells the seed within this state, or a code number which has been registered with the commissioner.\nFor all named agricultural, vegetable, flower, or wildflower seeds which are treated, for which a separate label may be used, the label must contain:\n(1) a word or statement to indicate that the seed has been treated;\n(2) the commonly accepted, coined, chemical, or abbreviated generic chemical name of the applied substance;\n(3) the caution statement \"Do not use for food, feed, or oil purposes\" if the substance in the amount present with the seed is harmful to human or other vertebrate animals;\n(4) in the case of mercurials or similarly toxic substances, a poison statement and symbol;\n(5) a word or statement describing the process used when the treatment is not of pesticide origin; and\n(6) the date beyond which the inoculant is considered ineffective if the seed is treated with an inoculant. It must be listed on the label as \"inoculant: expires (month and year)\" or wording that conveys the same meaning.\nFor hybrid seed corn purposes a label must contain:\n(1) a statement indicating the number of seeds in the container may be listed along with or in lieu of the net weight of contents; and\n(2) for each variety of hybrid seed field corn, the day classification as determined by the originator or owner. The day classification must approximate the number of days of growing season necessary from emergence of the corn plant above ground to relative maturity and must be within three days of maturity ratings determined in comparative trials by the Minnesota agricultural experiment station.\nFor grass seed and mixtures of grass seeds intended for lawn and turf purposes, the requirements in paragraphs (a) and (b) must be met.\n(a) The label must contain the statement \"sell by (month and year listed here)\" which may be no more than 15 months from the date of test, exclusive of the month of test.\n(b) When grass seeds are sold outside their original containers, the labeling requirements are met if the seed is weighed from a properly labeled container in the presence of the purchaser.\nFor coated agricultural seeds the label must contain:\n(1) percentage by weight of pure seeds with coating material removed;\n(2) percentage by weight of coating material shown as a separate item in close association with the percentage of inert matter; and\n(3) percentage of germination determined on 400 pellets with or without seeds.\nFor vegetable seeds prepared for use in home gardens or household plantings the requirements in paragraphs (a) to (p) apply. Vegetable seeds packed for sale in commercial quantities to farmers, conservation groups, and other similar entities are considered agricultural seeds and must be labeled accordingly.\n(a) The label must contain the name of the kind or kind and variety for each seed component in excess of five percent of the whole and the percentage by weight of each in order of its predominance. If the variety of those kinds generally labeled as to variety is not stated and it is not required to be stated, the label must show the name of the kind and the words \"variety not stated.\"\n(b) The percentage that is hybrid must be at least 95 percent of the percentage of pure seed shown unless the percentage of pure seed which is hybrid seed is shown separately. If two or more kinds of varieties are present in excess of five percent and are named on the label, each that is hybrid must be designated as hybrid on the label. Any one kind or kind and variety that has pure seed that is less than 95 percent but more than 75 percent hybrid seed as a result of incompletely controlled pollination in a cross must be labeled to show the percentage of pure seed that is hybrid seed or a statement such as \"contains from 75 percent to 95 percent hybrid seed.\" No one kind or variety of seed may be labeled as hybrid if the pure seed contains less than 75 percent hybrid seed. The word \"hybrid\" must be shown on the label in conjunction with the kind.\n(c) Blends must be listed on the label using the term \"blend\" in conjunction with the kind.\n(d) Mixtures shall be listed on the label using the term \"mixture,\" \"mix,\" or \"mixed.\"\n(e) The label must show a lot number or other lot identification.\n(f) The origin may be omitted from the label.\n(g) The label must show the year for which the seed was packed for sale listed as \"packed for (year)\" for seed with a percentage of germination that exceeds the standard last established by the commissioner, the percentage of germination and the calendar month and year that the percentages were determined by test, or the calendar month and year the germination test was completed and the statement \"sell by (month and year listed here),\" which may be no more than 12 months from the date of test, exclusive of the month of test.\n(h) For vegetable seeds which germinate less than the standard last established by the commissioner, the label must show:\n(1) a percentage of germination, exclusive of hard or dormant seed or both;\n(2) a percentage of hard or dormant seed or both, if present; and\n(3) the words \"below standard\" in not less than eight point type and the month and year the percentages were determined by test.\n(i) The net weight of the contents or a statement indicating the number of seeds in the container or both, must appear on either the container or the label.\n(j) The heading for and percentage by weight of pure seed may be omitted from a label if the total is more than 90 percent.\n(k) The heading for and percentage by weight of weed seed may be omitted from a label if they are not present in the seed.\n(l) The heading \"noxious weed seeds\" may be omitted from a label if they are not present in the seed.\n(m) The heading for and percentage by weight of other crop seed may be omitted from a label if it is less than five percent.\n(n) The heading for and percentage by weight of inert matter may be omitted from a label if it is less than ten percent.\n(o) The label must contain the name and address of the person who labeled the seed or who sells the seed in this state or a code number that has been registered with the commissioner.\n(p) The labeling requirements for vegetable seeds prepared for use in home gardens or household plantings when sold outside their original containers are met if the seed is weighed from a properly labeled container in the presence of the purchaser.\nFor flower and wildflower seeds prepared for use in home gardens or household plantings, the requirements in paragraphs (a) to (l) apply. Flower and wildflower seeds packed for sale in commercial quantities to farmers, conservation groups, and other similar entities are considered agricultural seeds and must be labeled accordingly.\n(a) The label must contain the name of the kind and variety or a statement of type and performance characteristics as prescribed by rule.\n(b) The percentage that is hybrid must be at least 95 percent of the percentage of pure seed shown unless the percentage of pure seed which is hybrid seed is shown separately. If two or more kinds of varieties are present in excess of five percent and are named on the label, each that is hybrid must be designated as hybrid on the label. Any one kind or kind and variety that has pure seed that is less than 95 percent but more than 75 percent hybrid seed as a result of incompletely controlled pollination in a cross must be labeled to show the percentage of pure seed that is hybrid seed or a statement such as \"contains from 75 percent to 95 percent hybrid seed.\" No one kind or variety of seed may be labeled as hybrid if the pure seed contains less than 75 percent hybrid seed. The word \"hybrid\" must be shown on the label in conjunction with the kind.\n(c) Blends must be listed on the label using the term \"blend\" in conjunction with the kind.\n(d) Mixtures must be listed on the label using the term \"mixture,\" \"mix,\" or \"mixed.\"\n(e) The label must contain the lot number or other lot identification.\n(f) The origin may be omitted from the label.\n(g) The label must contain the year for which the seed was packed for sale listed as \"packed for (year)\" for seed with a percentage of germination that exceeds the standard last established by the commissioner, the percentage of germination and the calendar month and year that the percentages were determined by test, or the calendar month and year the germination test was completed and the statement \"sell by (month and year listed here),\" which may be no more than 12 months from the date of test, exclusive of the month of test.\n(h) For flower seeds which germinate less than the standard last established by the commissioner, the label must show:\n(1) percentage of germination exclusive of hard or dormant seed or both;\n(2) percentage of hard or dormant seed or both, if present; and\n(3) the words \"below standard\" in not less than eight point type and the month and year this percentage was determined by test.\n(i) The label must show the net weight of contents or a statement indicating the number of seeds in the container, or both, on either the container or the label.\n(j) The heading for and percentage by weight of pure seed may be omitted from a label if the total is more than 90 percent.\n(k) The heading for and percentage by weight of weed seed may be omitted from a label if they are not present in the seed.\n(l) The heading \"noxious weed seeds\" may be omitted from a label if they are not present in the seed.\n(m) The heading for and percentage by weight of other crop seed may be omitted from a label if it is less than five percent.\n(n) The heading for and percentage by weight of inert matter may be omitted from a label if it is less than ten percent.\n(o) The label must show the name and address of the person who labeled the seed or who sells the seed within this state, or a code number which has been registered with the commissioner.\nTo comply with the hemp requirements in chapter 18K, a hemp seed labeler must test the hemp parent plants used to produce the hemp seed at the appropriate developmental stage and obtain a certificate of analysis showing that the hemp seed was produced from hemp parent plants with less than 0.3 percent total delta-9 tetrahydrocannabinol concentration.",
	"repealed": false
}