{
	"id": "424A.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.016",
	"title": "424A.016 DEFINED CONTRIBUTION FIREFIGHTERS RELIEF ASSOCIATION SPECIFIC REGULATION.",
	"text": "If the articles of incorporation or the bylaws governing the firefighters relief association so provide exclusively, the relief association may pay a defined contribution lump-sum service pension instead of a defined benefit service pension governed by section 424A.02.\n(a) A relief association, when its articles of incorporation or bylaws so provide, may pay out of the assets of its special fund a defined contribution service pension to each of its members who:\n(1) separates from active service with the fire department;\n(2) reaches age 50;\n(3) completes at least five years of active service as an active member of the fire department to which the relief association is associated;\n(4) completes at least five years of active membership with the relief association before separation from active service; and\n(5) complies with any additional conditions as to age, service, and membership that are prescribed by the bylaws of the relief association.\n(b) In the case of a member who has completed at least five years of active service as an active member of the fire department to which the relief association is associated on the date that the relief association is established and incorporated, the requirement that the member complete at least five years of active membership with the relief association before separation from active service may be waived by the board of trustees of the relief association if the member completes at least five years of inactive membership with the relief association before the date of the payment of the service pension. During the period of inactive membership, the member is not entitled to receive any disability benefit coverage, is not entitled to receive additional individual account allocation of fire state aid or municipal contribution toward a service pension, and is considered to have the status of a person entitled to a deferred service pension.\n(c) The service pension earned by a firefighter under this chapter and the articles of incorporation and bylaws of the relief association may be paid whether or not the municipality or independent nonprofit firefighting corporation to which the relief association is associated qualifies for the receipt of fire state aid under chapter 477B.\nIf the articles of incorporation or bylaws of a defined contribution relief association provide a vesting schedule that satisfies the requirements of this subdivision, the relief association may pay a reduced service pension to a retiring member. For purposes of this section, \"vests,\" \"vesting,\" or \"vested\" means a nonforfeitable, unconditional, or legally enforceable right. A member vests in the member's account in accordance with the vesting schedule set forth in the relief association's articles of incorporation or bylaws. Provided a member meets the minimum age and service requirements of subdivision 2, the member is entitled to a service pension equal to the member's account, but only to the extent vested as provided in the vesting schedule set forth in the articles of incorporation or bylaws. In no event may the articles of incorporation or bylaws:\n(1) require that a member have more than 20 years of active service to become 100 percent vested in the member's account; or\n(2) provide for a larger vesting percentage than is provided in the following schedule with respect to the completed number of years of active service indicated in the schedule:\n(a) An individual account must be established for each firefighter who is a member of the relief association.\n(b) To each individual active member account must be credited an equal share of:\n(1) any amounts of fire state aid and police and firefighter retirement supplemental state aid received by the relief association;\n(2) any amounts of municipal contributions to the relief association raised from levies on real estate or from other available municipal revenue sources exclusive of fire state aid; and\n(3) any amounts equal to the share of the assets of the special fund to the credit of:\n(i) any former member who terminated active service with the fire department to which the relief association is associated before meeting the minimum service requirement provided for in subdivision 2, paragraph (b), and either has not returned to active service with the fire department for a period no shorter than five years or has died and no survivor benefit or death benefit is payable; or\n(ii) any member who terminated active service before becoming 100 percent vested in the member's account under subdivision 2, paragraph (b), and any applicable provision of the bylaws of the relief association.\n(c) In addition, any investment return on the assets of the special fund must be credited in proportion to the share of the assets of the special fund to the credit of each individual active member account and inactive member account, unless the inactive member is a deferred member as defined in subdivision 6.\n(d) Administrative expenses of the relief association payable from the special fund may be deducted from individual accounts in a manner specified in the bylaws of the relief association.\n(e) Amounts to be credited to individual accounts under paragraph (b) must be allocated uniformly for all years of active service and allocations must be made for all years of service, except for caps on service credit if so provided in the bylaws of the relief association. Amounts forfeited under paragraph (b), clause (3), before a resumption of active service and membership under section 424A.01, subdivision 6, remain forfeited and may not be reinstated upon the resumption of active service and membership. The allocation method may utilize monthly proration for fractional years of service, as the bylaws or articles of incorporation of the relief association so provide. The bylaws or articles of incorporation may define a \"month,\" but the definition must require a calendar month to have at least 16 days of active service. If the bylaws or articles of incorporation do not define a \"month,\" a \"month\" is a completed calendar month of active service measured from the member's date of entry to the same date in the subsequent month.\n(f) At the time that the payment of a service pension commences under subdivision 2 and any applicable provision of the bylaws of the relief association, a retiring member is entitled to that portion of the assets of the special fund to the credit of the member in the individual member account which is nonforfeitable under subdivision 3 and any applicable provision of the bylaws of the relief association based on the number of years of service to the credit of the retiring member.\n(g) Annually, the secretary of the relief association shall certify the individual account allocations to the state auditor at the same time that the annual financial statement or financial report and audit of the relief association, whichever applies, is due under section 424A.014.\n(a) A defined contribution relief association, if the governing bylaws so provide, may pay, at the option of the intended recipient and in lieu of a single payment of a service pension or a survivor benefit, the service pension or survivor benefit in installments.\n(b) The election of installment payments is irrevocable and must be made by the intended recipient in writing and filed with the secretary of the relief association no later than 30 days before the commencement of payment of the service pension or survivor benefit.\n(c) The amount of the installment payments must be the fractional portion of the remaining account balance equal to one divided by the number of remaining annual installment payments.\n(a) A \"deferred member\" means a member of a relief association who has separated from active service and membership and has completed the minimum service and membership requirements in subdivision 2. The requirement that a member separate from active service and membership is waived for persons who have discontinued their volunteer firefighter and paid on-call firefighter duties and who are employed on a part-time or full-time basis under section 424A.015, subdivision 1.\n(b) A deferred member is entitled to receive a deferred service pension when the member reaches at least age 50, or at least the minimum age specified in the bylaws governing the relief association if that age is greater than age 50, and makes a valid written application.\n(c) A defined contribution relief association must credit interest or additional investment performance on the deferred lump-sum service pension during the period of deferral for all deferred members on or after January 1, 2021. A defined contribution relief association may specify in its bylaws the method by which it will credit interest or additional investment performance to the accounts of deferred members. Such method shall be limited to one of the three methods provided in this paragraph. In the event the bylaws do not specify a method, the interest or additional investment performance must be credited using the method defined in clause (3). The permissible methods are:\n(1) at the investment performance rate actually earned on that portion of the assets if the deferred benefit amount is invested by the relief association in a separate account established and maintained by the relief association;\n(2) at the investment performance rate actually earned on that portion of the assets if the deferred benefit amount is invested in a separate investment vehicle held by the relief association; or\n(3) at the investment return on the assets of the special fund of the defined contribution relief association in proportion to the share of the assets of the special fund to the credit of each individual deferred member account.\n(d) Notwithstanding the requirements of section 424A.015, subdivision 6, bylaw amendments made in accordance with paragraph (c) on or before January 1, 2022, shall apply to members already in deferred status as of January 1, 2021.\n(e) Unless the bylaws provide differently, interest or additional investment performance must be allocated to each deferred member account beginning on the date that the member separates from active service and membership and ending on the last date that the deferred member account is valued before the final distribution of the deferred service pension.\n(a) A defined contribution relief association may only pay an ancillary benefit which would constitute an authorized disbursement as specified in section 424A.05. The ancillary benefit for active members must equal the vested and nonvested amount of the individual account of the member.\n(b) For deferred members, the ancillary benefit must equal the vested amount of the individual account of the member. For the recipient of installment payments of a service pension, the ancillary benefit must equal the remaining balance in the individual account of the recipient.\n(c) If the bylaws permit and as defined by the bylaws, the relief association may pay an ancillary benefit to, or on behalf of, a member who is not active or deferred.\n(d)(1) If a survivor or death benefit is payable under the articles of incorporation or bylaws, the benefit must be paid:\n(i) as a survivor benefit to the surviving spouse of the deceased firefighter;\n(ii) as a survivor benefit to the surviving children of the deceased firefighter if no surviving spouse;\n(iii) as a survivor benefit to a designated beneficiary of the deceased firefighter if no surviving spouse or surviving children; or\n(iv) as a death benefit to the estate of the deceased active or deferred firefighter if no surviving spouse, no surviving children, and no beneficiary designated.\n(2) If there are no surviving children, the surviving spouse may waive, in writing, wholly or partially, the spouse's entitlement to a survivor benefit.\n(e) For purposes of this section, for a defined contribution firefighters relief association, a trust created under chapter 501C may be a designated beneficiary. If a trust payable to the surviving children organized under chapter 501C has been established as authorized by this section and there is no surviving spouse, the survivor benefit may be paid to the trust, notwithstanding the requirements of this section.\nEach relief association to which this section applies must file a revised copy of its governing bylaws with the state auditor upon the adoption of any amendment to its governing bylaws by the relief association. Failure of the relief association to file a copy of the bylaws or any bylaw amendments with the state auditor disqualifies the municipality from the distribution of any future fire state aid until this filing requirement has been completed.",
	"repealed": false
}