{
	"id": "326B.148",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.148",
	"title": "326B.148 SURCHARGE.",
	"text": "To defray the costs of administering sections 326B.101 to 326B.194, a surcharge is imposed on all permits issued by municipalities in connection with the construction of or addition or alteration to buildings and equipment or appurtenances after June 30, 1971. The commissioner may use any surplus in surcharge receipts to award grants for code research and development and education.\nIf the fee for the permit issued is fixed in amount the surcharge is equivalent to one-half mill (.0005) of the fee or $1, except that effective July 1, 2010, until June 30, 2015, the permit surcharge is equivalent to one-half mill (.0005) of the fee or $5, whichever amount is greater. For all other permits, the surcharge is as follows:\n(1) if the valuation of the structure, addition, or alteration is $1,000,000 or less, the surcharge is equivalent to one-half mill (.0005) of the valuation of the structure, addition, or alteration;\n(2) if the valuation is greater than $1,000,000, the surcharge is $500 plus two-fifths mill (.0004) of the value between $1,000,000 and $2,000,000;\n(3) if the valuation is greater than $2,000,000, the surcharge is $900 plus three-tenths mill (.0003) of the value between $2,000,000 and $3,000,000;\n(4) if the valuation is greater than $3,000,000, the surcharge is $1,200 plus one-fifth mill (.0002) of the value between $3,000,000 and $4,000,000;\n(5) if the valuation is greater than $4,000,000, the surcharge is $1,400 plus one-tenth mill (.0001) of the value between $4,000,000 and $5,000,000; and\n(6) if the valuation exceeds $5,000,000, the surcharge is $1,500 plus one-twentieth mill (.00005) of the value that exceeds $5,000,000.\nAll permit surcharges must be collected by each municipality and a portion of them remitted to the state. Each municipality having a population greater than 20,000 people shall prepare and submit to the commissioner once a month a report of fees and surcharges on fees collected during the previous month but shall retain the greater of two percent or that amount collected up to $25 to apply against the administrative expenses the municipality incurs in collecting the surcharges. All other municipalities shall submit the report and surcharges on fees once a quarter but shall retain the greater of four percent or that amount collected up to $25 to apply against the administrative expenses the municipalities incur in collecting the surcharges. The report, which must be in a form prescribed by the commissioner, must be submitted together with a remittance covering the surcharges collected by the 15th day following the month or quarter in which the surcharges are collected.\nA municipality that fails to report or submit the required remittance to the department in accordance with this subdivision is subject to the remedies provided by section 326B.082.\nRevenue received from the surcharge imposed in subdivision 1 should approximately equal the cost, including the overhead cost, of administering sections 326B.101 to 326B.194.",
	"repealed": false
}