{
	"id": "299A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.01",
	"title": "299A.01 DEPARTMENT OF PUBLIC SAFETY; CREATION, ORGANIZATION.",
	"text": "The Department of Public Safety is created under the supervision and control of the commissioner of public safety, which office is established. The commissioner of public safety is appointed by the governor under the provisions of section 15.06. The commissioner may appoint a deputy commissioner.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A; and\n(6) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\nThe commissioner may accept paid advertising for departmental publications, media productions, or other informational materials. Advertising revenues received are appropriated to the commissioner to be used to defray costs of publications, media productions, or other informational materials. The commissioner may not accept paid advertising from an elected official or candidate for elective office.\n(a) The commissioner, as part of the department's mission and within the department's resources, shall report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over criminal justice policy and funding on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to paragraph (b) and section 16A.10, subdivision 1. The purpose of the report is to determine the extent to which each program is accomplishing the program's mission, goals, and objectives. The report may address:\n(1) factors that limited or delayed achievement of objectives or goals;\n(2) resources used or saved and efficiencies achieved in reaching program objectives and goals;\n(3) information from customers and partners of the agency regarding the quality of service and effectiveness of the agency and the agency's programs;\n(4) recommendations on elimination of unnecessary or obsolete mandated reports; and\n(5) major cases, events, or circumstances that required an agency response.\n(b) By August 1 of each odd-numbered year, the commissioner must present to the individuals identified in paragraph (a) a report that states the mission, goals, and objectives of each program and lists and describes the performance measures and targets the department will include in the performance report required under paragraph (a). The report must include information on how program goals and objectives were created and who participated in formulating them. The measures and targets must include a history of the department's performance for the previous five years. At a minimum, the report must include measures and targets for the following:\n(1) staffing and salaries for divisions within the agency;\n(2) caseloads and responsibilities of Bureau of Criminal Apprehension agents;\n(3) development and funding of the Allied Radio Matrix for Emergency Response (ARMER);\n(4) grant programs administered under the Office of Justice Programs and Homeland Security and Emergency Management;\n(5) receipt and expenditure of federal grant funds;\n(6) expenditure of the fire safety insurance surcharge;\n(7) emergency preparedness;\n(8) crime lab operations; and\n(9) assistance provided to crime victims.\nThe duties of the commissioner shall include the following:\n(1) the coordination, development and maintenance of services contracts with existing state departments and agencies assuring the efficient and economic use of advanced business machinery including computers;\n(2) the execution of contracts and agreements with existing state departments for the maintenance and servicing of vehicles and communications equipment, and the use of related buildings and grounds;\n(3) the development of integrated fiscal services for all divisions, and the preparation of an integrated budget for the department;\n(4) the publication and award of grant contracts with state agencies, local units of government, and other entities for programs that will benefit the safety of the public; and\n(5) the establishment of a planning bureau within the department.\n(a) No delegation or assignment of a power or duty by the commissioner to an employee of the department shall be made in respect to, or in a manner resulting in a reenactment of, the powers, duties or responsibilities contained in section 299C.03, and acts amendatory thereof, except to the Division of the Bureau of Criminal Apprehension.\n(b) Employees of the Department of Public Safety are in the classified civil service except where otherwise specifically provided for by law.\n[Repealed, 1976 c 5 s 12]\n[Renumbered 16B.875]\n[Repealed, 1997 c 239 art 8 s 36]\nNotwithstanding sections 14.05, subdivision 1, and 645.36 or other law to the contrary, the rules adopted under the authority of Minnesota Statutes 1996, section 299A.01, subdivision 6, paragraph (a), remain in effect on and after July 1, 1997, until further amended or repealed.\nAnnually by January 15, the commissioner of public safety must submit a traffic safety report to the governor and the chairs and ranking minority members of the legislative committees with jurisdiction over traffic safety and enforcement. In preparing the report, the commissioner must seek advice and comments from the Advisory Council on Traffic Safety under section 4.076. The report must analyze the safety of Minnesota's roads and transportation system, including but not limited to:\n(1) injuries and fatalities that occur on or near a roadway or other transportation system facility;\n(2) factors that caused crashes resulting in injuries and fatalities;\n(3) roadway and system improvements broadly and at specific locations that could reduce injuries and fatalities;\n(4) enforcement and education efforts that could reduce injuries and fatalities;\n(5) other safety improvements or programs to improve the quality of the roadway and transportation use experience; and\n(6) existing resources and resource gaps for roadway and transportation system safety improvements.",
	"repealed": false
}