{
	"id": "256B.0617",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0617",
	"title": "256B.0617 MENTAL HEALTH SERVICES PROVIDER CERTIFICATION.",
	"text": "(a) The commissioner of human services shall establish an initial provider entity application and certification and recertification processes to determine whether a provider entity has administrative and clinical infrastructures that meet the certification requirements. This process applies to providers of the following services:\n(1) children's intensive behavioral health services under section 256B.0946; and\n(2) intensive nonresidential rehabilitative mental health services under section 256B.0947.\n(b) The commissioner shall recertify a provider entity every three years using the individual provider's certification anniversary or the calendar year end. The commissioner may approve a recertification extension in the interest of sustaining services when a certain date for recertification is identified.\n(c) The commissioner shall establish a process for decertification of a provider entity and shall require corrective action, medical assistance repayment, or decertification of a provider entity that no longer meets the requirements in this section or that fails to meet the clinical quality standards or administrative standards provided by the commissioner in the application and certification process.\n(d) The commissioner must provide the following to provider entities for the certification, recertification, and decertification processes:\n(1) a structured listing of required provider certification criteria;\n(2) a formal written letter with a determination of certification, recertification, or decertification signed by the commissioner or the appropriate division director; and\n(3) a formal written communication outlining the process for necessary corrective action and follow-up by the commissioner signed by the commissioner or their designee, if applicable. In the case of corrective action, the commissioner may schedule interim recertification site reviews to confirm certification or decertification.",
	"repealed": false
}