{
	"id": "256R.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.03",
	"title": "256R.03 CONDITIONS FOR FUNDING.",
	"text": "(a) No medical assistance payments shall be made to any nursing facility unless the nursing facility is certified to participate in the medical assistance program under title XIX of the federal Social Security Act and has in effect a provider agreement with the commissioner meeting the requirements of state and federal statutes and rules.\n(b) No medical assistance payments shall be made to any nursing facility unless the nursing facility complies with all requirements of Minnesota Statutes including, but not limited to, this chapter and chapter 256B and rules adopted under them that govern participation in the program.\n(c) Subject to exceptions in section 256B.25, subdivision 3, no nursing facility may receive any state or local payment for providing care to a person eligible for medical assistance, except under the medical assistance program.\nA nursing home or boarding care home that has received a notice to suspend admissions under section 144A.105 shall be ineligible to receive payment for admissions that occur during the effective dates of the suspension. Upon termination of the suspension by the commissioner of health, payments may be made for eligible persons, beginning with the day after the suspension ends.\nThis section applies whether the nursing facility participates fully in the medical assistance program or is withdrawing from the medical assistance program. No medical assistance payments may be made to any nursing facility which has withdrawn or is withdrawing from the medical assistance program except as provided in subdivision 4, or federal law.\nIf a nursing facility terminates its participation in the medical assistance program, whether voluntarily or involuntarily, the commissioner may authorize the nursing facility to receive continued medical assistance reimbursement until medical assistance residents can be relocated to nursing facilities participating in the medical assistance program.\nA nursing facility located in Minnesota electing to enroll as a medical assistance provider must enter into a contract with the commissioner. Payment rates and procedures are determined and governed by this section and by the terms of the contract. The commissioner may negotiate different contract terms for different nursing facilities.\n(a) All contracts entered into under this section are for a term not to exceed four years. Either party may terminate a contract at any time without cause by providing 90 calendar days advance written notice to the other party. The decision to terminate a contract is not appealable. The provisions of the contract shall be renegotiated at a minimum of every four years by the parties prior to the expiration date of the contract. The parties may voluntarily amend the terms of the contract at any time by mutual agreement.\n(b) If a nursing facility fails to comply with the terms of a contract, the commissioner shall provide reasonable notice regarding the breach of contract and a reasonable opportunity for the facility to come into compliance. If the facility fails to come into compliance or to remain in compliance, the commissioner may terminate the contract.",
	"repealed": false
}