{
	"id": "148F.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.155",
	"title": "148F.155 IMPAIRED OBJECTIVITY OR EFFECTIVENESS.",
	"text": "(a) An alcohol and drug counselor must not provide alcohol and drug counseling services to a client or potential client when the counselor's objectivity or effectiveness is impaired.\n(b) The provider shall not provide alcohol and drug counseling services to a client if doing so would create a multiple relationship. For purposes of this section, \"multiple relationship\" means one that is both professional and:\n(1) cohabitational;\n(2) familial;\n(3) one in which there has been personal involvement with the client or family member of the client that is reasonably likely to adversely affect the client's welfare or ability to benefit from services; or\n(4) one in which there is significant financial involvement other than legitimate payment for professional services rendered that is reasonably likely to adversely affect the client's welfare or ability to benefit from services.\nIf an unforeseen multiple relationship arises after services have been initiated, the provider shall promptly terminate the professional relationship.\n(c) The provider shall not provide alcohol and drug counseling services to a client who is also the provider's student or supervisee. If an unforeseen situation arises in which both types of services are required or requested by the client or a third party, the provider shall decline to provide the services.\n(d) The provider shall not provide alcohol and drug counseling services to a client when the provider is biased for or against the client for any reason that interferes with the provider's impartial judgment, including where the client is a member of a class legally protected from discrimination. The provider may provide services if the provider is working to resolve the impairment in the manner required under subdivision 2.\n(e) The provider shall not provide alcohol and drug counseling services to a client when there is a fundamental divergence or conflict of service goals, interests, values, or attitudes between the client and the provider that adversely affects the professional relationship. The provider may provide services if the provider is working to resolve the impairment in the manner required under subdivision 2.\n(a) When an impairment occurs that is listed in subdivision 1, paragraph (d) or (e), the provider may provide services only if the provider actively pursues resolution of the impairment and is able to do so in a manner that results in minimal adverse effects on the client or potential client.\n(b) If the provider attempts to resolve the impairment, it must be by means of professional education, training, continuing education, consultation, psychotherapy, intervention, supervision, or discussion with the client or potential client, or an appropriate combination thereof.",
	"repealed": false
}