{
	"id": "60D.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/60D.18",
	"title": "60D.18 ACQUISITIONS INVOLVING INSURERS NOT OTHERWISE COVERED.",
	"text": "The following definitions apply for the purposes of this section only:\n(a) \"Acquisition\" means an agreement, arrangement, or activity the consummation of which results in a person acquiring directly or indirectly the control of another person, and includes, but is not limited to, the acquisition of voting securities, the acquisition of assets, bulk reinsurance, and mergers.\n(b) An \"involved insurer\" includes an insurer that either acquires or is acquired, is affiliated with an acquirer or acquired, or is the result of a merger.\n(a) Except as exempted in paragraph (b), this section applies to any acquisition in which there is a change in control of an insurer authorized to do business in this state.\n(b) This section does not apply to the following:\n(1) a purchase of securities solely for investment purposes so long as such securities are not used by voting or otherwise to cause or attempt to cause the substantial lessening of competition in any insurance market in this state. If a purchase of securities results in a presumption of control under section 60D.15, subdivision 4, it is not solely for investment purposes unless the commissioner of the insurer's state of domicile accepts a disclaimer of control or affirmatively finds that control does not exist and such disclaimer action or affirmative finding is communicated by the domiciliary commissioner to the commissioner of this state;\n(2) the acquisition of a person by another person when both persons are neither directly nor through affiliates primarily engaged in the business of insurance, if preacquisition notification is filed with the commissioner in accordance with subdivision 3, paragraph (a), 30 days before the proposed effective date of the acquisition. However, the preacquisition notification is not required for exclusion from this section, if the acquisition would otherwise be excluded from this section by any other clause of this paragraph;\n(3) the acquisition of already affiliated persons;\n(4) an acquisition if, as an immediate result of the acquisition;\n(i) in no market would the combined market share of the involved insurers exceed five percent of the total market;\n(ii) there would be no increase in any market share; or\n(iii) in no market would the combined market share of the involved insurers exceed 12 percent of the total market; and the market share increases by more than two percent of the total market.\nFor the purpose of this clause, a \"market\" means direct written insurance premium in this state for a line of business as contained in the annual statement required to be filed by insurers licensed to do business in this state;\n(5) an acquisition for which a preacquisition notification would be required pursuant to this section due solely to the resulting effect on the ocean marine insurance line of business; and\n(6) an acquisition of an insurer whose domiciliary commissioner affirmatively finds that the insurer is in failing condition; there is a lack of feasible alternative to improving the condition; the public benefits of improving the insurer's condition through the acquisition exceed the public benefits that would arise from not lessening competition; and the findings are communicated by the domiciliary commissioner to the commissioner of this state.\n(a) An acquisition covered by subdivision 2 may be subject to an order pursuant to subdivision 4 unless the acquiring person files a preacquisition notification and the waiting period has expired. The acquired person may file a preacquisition notification. The commissioner shall give confidential treatment to information submitted under this section in the same manner as provided in section 60D.22.\n(b) The preacquisition notification must be in the form and contain the information as prescribed by the National Association of Insurance Commissioners relating to those markets that, under subdivision 2, paragraph (b), clause (5), cause the acquisition not to be exempted from the provisions of this section. The commissioner may require the additional material and information as the commissioner deems necessary to determine whether the proposed acquisition, if consummated, would violate the competitive standard of subdivision 4. The required information may include an opinion of an economist as to the competitive impact of the acquisition in this state accompanied by a summary of the education and experience of the person indicating that person's ability to render an informed opinion.\n(c) The waiting period required begins on the date of receipt of the commissioner of a preacquisition notification and ends on the earlier of the 30th day after the date of its receipt, or termination of the waiting period by the commissioner. Before the end of the waiting period, the commissioner on a onetime basis may require the submission of additional needed information relevant to the proposed acquisition, in which event the waiting period shall end on the earlier of the 30th day after receipt of the additional information by the commissioner or termination of the waiting period by the commissioner.\n(a) The commissioner may enter an order under subdivision 5 with respect to an acquisition if there is substantial evidence that the effect of the acquisition may be substantially to lessen competition in any line of insurance in this state or tend to create a monopoly therein or if the insurer fails to file adequate information in compliance with subdivision 3.\n(b) In determining whether a proposed acquisition would violate the competitive standard of paragraph (a), the commissioner shall consider the following:\n(1) Any acquisition covered under subdivision 2 involving two or more insurers competing in the same market is prima facie evidence of violation of the competitive standards:\n(i) if the market is highly concentrated and the involved insurers possess the following shares of the market:\n(ii) if the market is not highly concentrated and the involved insurers possess the following shares of the market:\nA highly concentrated market is one in which the share of the four largest insurers is 75 percent or more of the market. Percentages not shown in the tables are interpolated proportionately to the percentages that are shown. If more than two insurers are involved, exceeding the total of the two columns in the table is prima facie evidence of violation of the competitive standard in paragraph (a). For the purpose of this clause, the insurer with the largest share of the market shall be deemed to be insurer A.\n(2) There is a significant trend toward increased concentration when the aggregate market share of any grouping of the largest insurers in the market, from the two largest to the eight largest, has increased by seven percent or more of the market over a period of time extending from any base year five to ten years prior to the acquisition up to the time of the acquisition. Any acquisition or merger covered under subdivision 2 involving two or more insurers competing in the same market is prima facie evidence of violation of the competitive standard in clause (1) if:\n(i) there is a significant trend toward increased concentration in the market;\n(ii) one of the insurers involved is one of the insurers in a grouping of such large insurers showing the requisite increase in the market share; and\n(iii) another involved insurer's market is two percent or more.\n(3) For the purposes of paragraph (b):\n(i) The term \"insurer\" includes any company or group of companies under common management, ownership, or control.\n(ii) The term \"market\" means the relevant product and geographical markets. In determining the relevant product and geographical markets, the commissioner shall give due consideration to, among other things, the definitions or guidelines, if any, promulgated by the National Association of Insurance Commissioners and to information, if any, submitted by parties to the acquisition. In the absence of sufficient information to the contrary, the relevant product market is assumed to be the direct written insurance premium for a line of business, the line being that used in the annual statement required to be filed by insurers doing business in this state, and the relevant geographical market is assumed to be this state.\n(iii) The burden of showing prima facie evidence of violation of the competitive standard rests upon the commissioner.\n(iv) Even though an acquisition is not prima facie violative of the competitive standard under paragraph (b), clauses (1) and (2), the commissioner may establish the requisite anticompetitive effect based upon other substantial evidence. Even though an acquisition is prima facie violative of the competitive standard under paragraph (b), clauses (1) and (2), a party may establish the absence of the requisite anticompetitive effect based upon other substantial evidence. Relevant factors in making a determination under this paragraph include, but are not limited to, the following: market shares, volatility of ranking of market leaders, number of competitors, concentration, trend of concentration in the industry, and ease of entry and exit into the market.\n(c) An order may not be entered under subdivision 5 if:\n(1) the acquisition will yield substantial economies of scale or economies in resource utilization that cannot be feasibly achieved in any other way, and the public benefits which would arise from such economies exceed the public benefits which would arise from not lessening competition; or\n(2) the acquisition will substantially increase the availability of insurance, and the public benefits of such increase exceed the public benefits which would arise from not lessening competition.\nIf an acquisition violates the standards of this section, the commissioner may enter an order:\n(1) requiring an involved insurer to cease and desist from doing business in this state with respect to the line or lines of insurance involved in the violation; or\n(2) denying the application of an acquired or acquiring insurer for a license to do business in this state.\nThe order must not be entered unless there is a hearing, the notice of the hearing is issued before the end of the waiting period and not less than 15 days before the hearing, and the hearing is concluded and the order is issued no later than 60 days after the end of the waiting period. Every order must be accompanied by a written decision of the commissioner setting forth findings of fact and conclusions of law.\nAn order entered under this paragraph shall not become final earlier than 30 days after it is issued, during which time the involved insurer may submit a plan to remedy the anticompetitive impact of the acquisition within a reasonable time. Based upon the plan or other information, the commissioner shall specify the conditions, if any, under the time period during which the aspects of the acquisition causing a violation of the standards of this section would be remedied and the order vacated or modified.\nAn order pursuant to this subdivision does not apply if the acquisition is not consummated.\nAny person who violates a cease and desist order of the commissioner and while the order is in effect, may after notice and hearing and upon order of the commissioner, be subject at the discretion of the commissioner to any one or more of the following:\n(1) a monetary penalty of not more than $10,000 for every day of violation;\n(2) suspension or revocation of the person's license.\nAny insurer or other person who fails to make any filing required by this section and who also fails to demonstrate a good faith effort to comply with the filing requirement, is subject to a fine of not more than $50,000.\nSections 60D.24, subdivisions 2 and 3; and 60D.25 do not apply to acquisitions covered under subdivision 2.",
	"repealed": false
}