{
	"id": "116L.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.41",
	"title": "116L.41 COMMISSIONER'S DUTIES AND POWERS; AGREEMENTS.",
	"text": "Upon request, the commissioner shall provide or coordinate the provision of program services under sections 116L.40 to 116L.42 to a business eligible for grants under this section. The commissioner shall specify the form of and required information to be provided with applications for projects to be funded with grants under this section.\n(a) The commissioner may provide grants in aid of up to $200,000 to new or expanding employers at a location in Minnesota and outside of the metropolitan area, as defined in section 473.121, subdivision 2, for the provision of program services using the guidelines in this subdivision.\n(b) The program must involve training and education specifically directed to new jobs that are determined to be appropriate by the commissioner.\n(c) The program must give preference to projects that provide training for economically disadvantaged people, people of color, or people with disabilities and to employers located in economically distressed areas.\n(d) Employers are eligible for reimbursement of program costs of up to $10,000 per new job for which training is provided, with an additional $1,000 available per new job for an individual with a disability.\n(a) The commissioner may provide grants in aid of up to $35,000 to employers at a location in Minnesota outside of the metropolitan area, as defined in section 473.121, subdivision 2, for the provision of program services using the guidelines in this subdivision.\n(b) The employer must be an existing business located in Minnesota that is in the manufacturing or skilled assembly production industry and has 150 or fewer full-time employees companywide.\n(c) The employer must be invested in new automation technology within the past year or plan to invest in new automation technology within the project time frame specified in the agreement under subdivision 3.\n(d) The program must involve training and education for full-time, permanent employees that is directly related to the new automation technology.\n(e) The program must give preference to projects that provide training for economically disadvantaged people, people of color, or people with disabilities and to employers located in economically distressed areas.\n(f) Employers are eligible for program cost reimbursement of up to $5,000 per employee trained on new automation technology and retained.\n(a) The commissioner may enter into an agreement to establish a project with an employer that:\n(1) identifies program costs to be paid from sources under the program;\n(2) identifies program costs to be paid by the employer;\n(3) provides that on-the-job training costs for employees may not exceed 50 percent of the annual gross wages and salaries of the new jobs in the first full year after execution of the agreement up to a maximum of $10,000 per eligible employee;\n(4) provides that each employee receiving training through the project must be paid wages of at least 120 percent of the federal poverty guidelines for a family of four, plus benefits; and\n(5) provides that job training will be provided and the length of time of training.\n(b) Before entering into a final agreement, the commissioner shall:\n(1) determine that sufficient funds for the project are available; and\n(2) investigate the applicability of other training programs and determine whether the job skills partnership grant program is a more suitable source of funding for the training and whether the training can be completed in a timely manner that meets the needs of the business.\nThe investigation under clause (2) must be completed within 15 days or as soon as reasonably possible after the employer has provided the commissioner with all the requested information.\nThe commissioner must not enter into an agreement under subdivision 2 unless the commissioner determines that sufficient funds are available.\nThe commissioner shall allocate grant funds under section 116L.42 to project applications based on a first-come, first-served basis, determined on the basis of the commissioner's receipt of a complete application for the project, including the provision of all of the required information. The agreement must specify the amount of grant funds available to the employer for each year covered by the agreement.\nThe commissioner may charge each employer an application fee to cover part or all of the administrative and legal costs incurred, not to exceed $500 per employer. The fee is deemed approved under section 16A.1283. The fee is deposited in the jobs training account in the special revenue fund and amounts in the account are appropriated to the commissioner for the costs of administering the program. The commissioner shall refund the fee to the employer if the application is denied because program funding is unavailable.",
	"repealed": false
}