{
	"id": "609.5314",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5314",
	"title": "609.5314 ADMINISTRATIVE FORFEITURE OF CERTAIN PROPERTY SEIZED IN CONNECTION WITH A CONTROLLED SUBSTANCES SEIZURE.",
	"text": "(a) The following are subject to administrative forfeiture under this section:\n(1) all money totaling $1,500 or more, precious metals, and precious stones that there is probable cause to believe represent the proceeds of a controlled substance offense;\n(2) all money found in proximity to controlled substances when there is probable cause to believe that the money was exchanged for the purchase of a controlled substance;\n(3) all conveyance devices containing controlled substances with a retail value of $100 or more if there is probable cause to believe that the conveyance device was used in the transportation or exchange of a controlled substance intended for distribution or sale; and\n(4) all firearms, ammunition, and firearm accessories found:\n(i) in a conveyance device used or intended for use to commit or facilitate the commission of a felony offense involving a controlled substance;\n(ii) on or in proximity to a person from whom a felony amount of controlled substance is seized; or\n(iii) on the premises where a controlled substance is seized and in proximity to the controlled substance, if possession or sale of the controlled substance would be a felony under chapter 152.\n(b) The Department of Corrections Fugitive Apprehension Unit shall not seize items listed in paragraph (a), clauses (3) and (4), for the purposes of forfeiture.\n(c) Money is the property of an appropriate agency and may be seized and recovered by the appropriate agency if:\n(1) the money is used by an appropriate agency, or furnished to a person operating on behalf of an appropriate agency, to purchase or attempt to purchase a controlled substance; and\n(2) the appropriate agency records the serial number or otherwise marks the money for identification.\n(d) As used in this section, \"money\" means United States currency and coin; the currency and coin of a foreign country; a bank check, cashier's check, or traveler's check; a prepaid credit card; cryptocurrency; or a money order.\n(e) As used in this section, \"controlled substance\" does not include cannabis flower as defined in section 342.01, subdivision 16, cannabis products as defined in section 342.01, subdivision 20, hemp-derived consumer products as defined in section 342.01, subdivision 37, or lower-potency hemp edibles as defined in section 342.01, subdivision 50.\n(a) Any person, other than the defendant driver, alleged to have used a vehicle in the transportation or exchange of a controlled substance intended for distribution or sale, claiming an ownership interest in a vehicle that has been seized or restrained under this section may assert that right by notifying the prosecuting authority in writing and within 60 days of the service of the notice of seizure.\n(b) Upon receipt of notice pursuant to paragraph (a), the prosecuting authority may release the vehicle to the asserting person. If the prosecuting authority proceeds with the forfeiture, the prosecuting authority must, within 30 days, file a separate complaint in the name of the jurisdiction pursuing the forfeiture against the vehicle, describing the vehicle, specifying that the vehicle was used in the transportation or exchange of a controlled substance intended for distribution or sale, and specifying the time and place of the vehicle's unlawful use. The complaint may be filed in district court or conciliation court and the filing fee is waived.\n(c) A complaint filed by the prosecuting authority must be served on the asserting person and on any other registered owners. Service may be made by certified mail at the address listed in the Department of Public Safety's computerized motor vehicle registration records or by any means permitted by court rules.\n(d) The hearing on the complaint shall, to the extent practicable, be held within 30 days of the filing of the petition. The court may consolidate the hearing on the complaint with a hearing on any other complaint involving a claim of an ownership interest in the same vehicle.\n(e) At a hearing held pursuant to this subdivision, the state must prove by a preponderance of the evidence that:\n(1) the seizure was incident to a lawful arrest or a lawful search; and\n(2) the vehicle was used in the transportation or exchange of a controlled substance intended for distribution or sale.\n(f) At a hearing held pursuant to this subdivision, the asserting person must prove by a preponderance of the evidence that the asserting person:\n(1) has an actual ownership interest in the vehicle; and\n(2) did not have actual or constructive knowledge that the vehicle would be used or operated in any manner contrary to law or that the asserting person took reasonable steps to prevent use of the vehicle by the alleged offender.\n(g) If the court determines that the state met both burdens under paragraph (e) and the asserting person failed to meet any burden under paragraph (f), the court shall order that the vehicle remains subject to forfeiture under this section.\n(h) The court shall order that the vehicle is not subject to forfeiture under this section and shall order the vehicle returned to the asserting person if it determines that:\n(1) the state failed to meet any burden under paragraph (e);\n(2) the asserting person proved both elements under paragraph (f); or\n(3) clauses (1) and (2) apply.\n(i) If the court determines that the asserting person is an innocent owner and orders the vehicle returned to the innocent owner, an entity in possession of the vehicle is not required to release the vehicle until the innocent owner pays:\n(1) the reasonable costs of the towing, seizure, and storage of the vehicle incurred before the innocent owner provided the notice required under paragraph (a); and\n(2) any reasonable costs of storage of the vehicle incurred more than two weeks after an order issued under paragraph (h).\n(a) Forfeiture of property described in subdivision 1 that does not exceed $50,000 in value is governed by this subdivision. Within 60 days from when seizure occurs, all persons known to have an ownership, possessory, or security interest in seized property must be notified of the seizure and the intent to forfeit the property. In the case of a motor vehicle required to be registered under chapter 168, notice mailed by certified mail to the address shown in Department of Public Safety records is deemed sufficient notice to the registered owner. The notification to a person known to have a security interest in seized property required under this paragraph applies only to motor vehicles required to be registered under chapter 168 and only if the security interest is listed on the vehicle's title. Upon motion by the appropriate agency or the prosecuting authority, a court may extend the time period for sending notice for a period not to exceed 90 days for good cause shown.\n(b) Notice may otherwise be given in the manner provided by law for service of a summons in a civil action. The notice must be in writing and contain:\n(1) a description of the property seized;\n(2) the date of seizure; and\n(3) notice of the right to obtain judicial review of the forfeiture and of the procedure for obtaining that judicial review, printed in English. This requirement does not preclude the appropriate agency from printing the notice in other languages in addition to English.\nSubstantially the following language must appear conspicuously in the notice:\n\"WARNING: If you were the person arrested when the property was seized, you will automatically lose the above-described property and the right to be heard in court if you do not file a lawsuit and serve the prosecuting authority within 60 days. You may file your lawsuit in conciliation court if the property is worth $15,000 or less; otherwise, you must file in district court. You do not have to pay a filing fee for your lawsuit.\nWARNING: If you have an ownership interest in the above-described property and were not the person arrested when the property was seized, you will automatically lose the above-described property and the right to be heard in court if you do not notify the prosecuting authority of your interest in writing within 60 days.\"\n(c) If notice is not sent in accordance with paragraph (a), and no time extension is granted or the extension period has expired, the appropriate agency shall return the property to the person from whom the property was seized, if known. An agency's return of property due to lack of proper notice does not restrict the agency's authority to commence a forfeiture proceeding at a later time. The agency shall not be required to return contraband or other property that the person from whom the property was seized may not legally possess.\n(a) Within 60 days following service of a notice of seizure and forfeiture under this section, a claimant may file a demand for a judicial determination of the forfeiture. The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service of a copy of the complaint on the prosecuting authority for that county. The claimant may serve the complaint on the prosecuting authority by certified mail or any means permitted by court rules. If the value of the seized property is $15,000 or less, the claimant may file an action in conciliation court for recovery of the seized property. A copy of the conciliation court statement of claim may be served personally or as permitted by the Rules of Conciliation Court Procedure on the prosecuting authority having jurisdiction over the forfeiture within 60 days following service of the notice of seizure and forfeiture under this subdivision. The claimant does not have to pay the court filing fee. No responsive pleading is required of the prosecuting authority and no court fees may be charged for the prosecuting authority's appearance in the matter. The district court administrator shall schedule the hearing as soon as practicable after, and in any event no later than 90 days following, the conclusion of the criminal prosecution. The proceedings are governed by the Rules of Civil Procedure and, where applicable, by the Rules of Conciliation Court Procedure.\n(b) The complaint must be captioned in the name of the claimant as plaintiff and the seized property as defendant, and must state with specificity the grounds on which the claimant alleges the property was improperly seized and the plaintiff's interest in the property seized. Notwithstanding any law to the contrary, an action for the return of property seized under this section may not be maintained by or on behalf of any person who has been served with a notice of seizure and forfeiture unless the person has complied with this subdivision.\n(c) If the claimant makes a timely demand for judicial determination under this subdivision, the appropriate agency must conduct the forfeiture under section 609.531, subdivision 6a. The limitations and defenses set forth in section 609.5311, subdivision 3, apply to the judicial determination.\n(d) If a demand for judicial determination of an administrative forfeiture is filed under this subdivision and the court orders the return of the seized property, the court may order sanctions under section 549.211. If the court orders payment of these costs, they must be paid from forfeited money or proceeds from the sale of forfeited property from the appropriate law enforcement and prosecuting agencies in the same proportion as they would be distributed under section 609.5315, subdivision 5.",
	"repealed": false
}