{
	"id": "524.3-204",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-204",
	"title": "524.3-204 DEMAND FOR NOTICE OF ORDER OR FILING CONCERNING DECEDENT'S ESTATE.",
	"text": "Any person desiring notice of any order or filing pertaining to a decedent's estate in which the person has a financial or property interest, may file a demand for notice with the court at any time after the death of the decedent stating the name of the decedent, the nature of the interest in the estate, and the demandant's address or that of the demandant's attorney. The court administrator shall mail a copy of the demand to the personal representative if one has been appointed. After filing of a demand, no personal representative or other person shall apply to the court for an order or filing to which the demand relates unless demandant or the demandant's attorney is given notice thereof at least 14 days before the date of such order or filing, except that this requirement shall not apply to any order entered or petition filed in any formal proceeding. Such notice shall be given by delivery of a copy thereof to the person being notified or by mailing a copy thereof by certified, registered or ordinary first class mail addressed to the person at the post office address given in the demand or at the person's office or place of residence, if known. The court for good cause shown may provide for a different method or time of giving such notice and proof thereof shall be made on or before the making or acceptance of such order or filing and filed in the proceeding. The validity of an order which is issued or filing which is accepted without compliance with this requirement shall not be affected by the error, but the petitioner receiving the order or the person making the filing may be liable for any damage caused by the absence of notice. The requirement of notice arising from a demand under this provision may be waived in writing by the demandant and shall cease upon the termination of the demandant's interest in the estate.",
	"repealed": false
}