{
	"id": "144.218",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.218",
	"title": "144.218 REPLACEMENT BIRTH RECORDS.",
	"text": "Upon receipt of a certified copy of an order, decree, or certificate of adoption, the state registrar shall register a replacement vital record in the new name of the adopted person. The original record of birth is private data pursuant to section 13.02, subdivision 12, and shall not be disclosed except pursuant to court order or section 144.2252. The information contained on the original birth record, except for the registration number, shall be provided on request to a parent who is named on the original birth record. Upon the receipt of a certified copy of a court order of annulment of adoption the state registrar shall restore the original vital record to its original place in the file.\nIn proceedings for the adoption of a person who was born in a foreign country, the court, upon evidence presented by the commissioner of children, youth, and families from information secured at the port of entry or upon evidence from other reliable sources, may make findings of fact as to the date and place of birth and parentage. Upon receipt of certified copies of the court findings and the order or decree of adoption, a certificate of adoption, or a certified copy of a decree issued under section 259.60, the state registrar shall register a birth record in the new name of the adopted person. The certified copies of the court findings and the order or decree of adoption, certificate of adoption, or decree issued under section 259.60 are private data, pursuant to section 13.02, subdivision 12, and shall not be disclosed except pursuant to court order or section 144.2252. The birth record shall state the place of birth as specifically as possible and that the vital record is not evidence of United States citizenship.\nMS 2022 [Repealed, 2024 c 127 art 59 s 57]\nIf a court finds that a birth record is incomplete, inaccurate, or false or if it is being issued pursuant to section 259.10, subdivision 2, the court may order the registration of a replacement vital record, and, if necessary, set forth the correct information in the order. Upon receipt of the order, the registrar shall register a replacement vital record containing the findings of the court. The prior vital record shall be confidential pursuant to section 13.02, subdivision 3, and shall not be disclosed except pursuant to court order.\nUpon the order of a court of this state, upon the request of a court of another state, or upon the filing of a recognition of parentage with the state registrar, a replacement birth record must be registered consistent with the findings of the court or the recognition of parentage.\nIf a safe place infant birth is registered pursuant to section 144.216, subdivision 4, paragraph (b), the state registrar shall issue a replacement birth record free of information that identifies a parent. The prior vital record shall be confidential pursuant to section 13.02, subdivision 3, and shall not be disclosed except pursuant to a court order.",
	"repealed": false
}