{
	"id": "148.96",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.96",
	"title": "148.96 PRESENTATION TO PUBLIC.",
	"text": "All licensees, when representing themselves in activities relating to the practice of psychology, including in written materials or advertising, shall identify the academic degree upon which their licensure is based, as well as their level of licensure. Individuals licensed on the basis of the equivalent of a master's degree in a doctoral program shall similarly use the designation \"M. Eq.\" to identify the educational status on which their licensure is based, as well as their level of licensure.\nAt the initial meeting, a licensee shall display or make available to each new client accurate information about the qualifications and competencies of the licensee, in accordance with regulations of the board.\n(a) Unless licensed under sections 148.88 to 148.98, except as provided in paragraphs (b) through (e), persons shall not represent themselves or permit themselves to be represented to the public by:\n(1) using any title or description of services incorporating the words \"psychology,\" \"psychological,\" \"psychological practitioner,\" or \"psychologist\"; or\n(2) representing that the person has expert qualifications in an area of psychology.\n(b) Psychologically trained individuals who are employed by an educational institution recognized by a regional accrediting organization, by a federal, state, county, or local government institution, agency, or research facility, may represent themselves by the title designated by that organization provided that the title does not indicate that the individual is credentialed by the board.\n(c) A psychologically trained individual from an institution described in paragraph (b) may offer lecture services and is exempt from the provisions of this section.\n(d) A person who is preparing for the practice of psychology under supervision in accordance with board statutes and rules may be designated as a \"psychological intern,\" \"psychology fellow,\" \"psychological trainee,\" or by other terms clearly describing the person's training status.\n(e) Former licensees who are completely retired from the practice of psychology may represent themselves using the descriptions in paragraph (a), clauses (1) and (2), but shall not represent themselves or allow themselves to be represented as current licensees of the board.\n[Repealed, 1Sp2017 c 6 art 11 s 56]\n[Repealed, 1Sp2017 c 6 art 11 s 56]",
	"repealed": false
}