{
	"id": "86B.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.341",
	"title": "86B.341 DUTIES AND LIABILITIES AT ACCIDENT OR INCIDENT.",
	"text": "(a) The operator of a watercraft involved in an accident or incident resulting in injury or death to a person or in damage to property shall, if possible without serious danger to the watercraft or the persons aboard, immediately stop at the scene of the accident or incident and render assistance as may be practicable and necessary.\n(b) The operator must give the operator's name, address, and license number of the watercraft and the name and address of the owner of the watercraft to the person injured or the operator or occupants of the other watercraft or owner or occupant of the property involved. The operator must promptly report the accident or incident to the sheriff of the county where the accident or incident occurred. Sheriffs are required to report all accidents and incidents to the commissioner of natural resources, who must periodically transmit a summary of the reports to the commissioner of public safety, and transmit statistics on boating accidents and incidents to the United States Coast Guard.\n(a) The owner and operator of a watercraft are jointly and severally liable for any injury or damage caused by the negligent operation of a watercraft whether the negligence consists of a violation of the provisions of the statutes of this state or neglecting to observe ordinary care in the operation as the common law requires. The owner is not liable if the watercraft is being operated without the owner's express or implied consent. It is presumed that the operation of a watercraft is with the knowledge and consent of the owner if at the time of the injury or damage the watercraft is under the control of the owner's spouse, father, mother, brother, sister, son, daughter, or other member of the owner's immediate family.\n(b) This subdivision may not be construed to:\n(1) relieve other persons from liability which the persons would otherwise have; or\n(2) authorize or allow recovery in excess of the injury or damage actually incurred.",
	"repealed": false
}