{
	"id": "146A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.01",
	"title": "146A.01 DEFINITIONS.",
	"text": "As used in this chapter, the following terms have the meanings given them.\n\"Commissioner\" means the commissioner of health or the commissioner's designee.\n\"Complementary and alternative health care client\" means an individual who receives services from an unlicensed complementary and alternative health care practitioner.\n(a) \"Complementary and alternative health care practices\" means the broad domain of complementary and alternative healing methods and treatments, including but not limited to: (1) acupressure; (2) anthroposophy; (3) aroma therapy; (4) ayurveda; (5) cranial sacral therapy; (6) culturally traditional healing practices; (7) detoxification practices and therapies; (8) energetic healing; (9) polarity therapy; (10) folk practices; (11) healing practices utilizing food, food supplements, nutrients, and the physical forces of heat, cold, water, touch, and light; (12) Gerson therapy and colostrum therapy; (13) healing touch; (14) herbology or herbalism; (15) homeopathy; (16) nondiagnostic iridology; (17) body work, massage, and massage therapy; (18) meditation; (19) mind-body healing practices; (20) naturopathy; (21) noninvasive instrumentalities; and (22) traditional Oriental practices, such as Qi Gong energy healing.\n(b) Complementary and alternative health care practices do not include surgery, x-ray radiation, administering or dispensing legend drugs and controlled substances, practices that invade the human body by puncture of the skin, setting fractures, the use of medical devices as defined in section 147A.01, any practice included in the practice of dentistry as defined in section 150A.05, subdivision 1, or the manipulation or adjustment of articulations of joints or the spine as described in section 146.23 or 148.01.\n(c) Complementary and alternative health care practices do not include practices that are permitted under section 147.09, clause (11), or 148.271, clause (5).\n(d) This chapter does not apply to, control, prevent, or restrict the practice, service, or activity of lawfully marketing or distributing food products, including dietary supplements as defined in the federal Dietary Supplement Health and Education Act, educating customers about such products, or explaining the uses of such products. Under Minnesota law, an unlicensed complementary and alternative health care practitioner may not provide a medical diagnosis or recommend discontinuance of medically prescribed treatments.\n\"Office of Unlicensed Complementary and Alternative Health Care Practice\" or \"office\" means the Office of Unlicensed Complementary and Alternative Health Care Practice established in section 146A.02.\n\"Unlicensed complementary and alternative health care practitioner\" means a person who:\n(1) either:\n(i) is not licensed or registered by a health-related licensing board or the commissioner of health; or\n(ii) is licensed or registered by the commissioner of health or a health-related licensing board other than the Board of Medical Practice, the Board of Dentistry, the Board of Chiropractic Examiners, or the Board of Podiatric Medicine, but does not hold oneself out to the public as being licensed or registered by the commissioner or a health-related licensing board when engaging in complementary and alternative health care;\n(2) has not had a license or registration issued by a health-related licensing board or the commissioner of health revoked or has not been disciplined in any manner at any time in the past, unless the right to engage in complementary and alternative health care practices has been established by order of the commissioner of health;\n(3) is engaging in complementary and alternative health care practices; and\n(4) is providing complementary and alternative health care services for remuneration or is holding oneself out to the public as a practitioner of complementary and alternative health care practices.",
	"repealed": false
}