{
	"id": "204C.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.26",
	"title": "204C.26 SUMMARY STATEMENTS AND ENVELOPES FOR BALLOT RETURNS; ELECTION OFFICIALS TO FURNISH.",
	"text": "For state elections, each official responsible for printing ballots shall furnish three or more blank summary statement forms for the returns of those ballots for each precinct. At least two copies of the summary statement must be prepared for elections not held on the same day as the state elections. The blank summary statement forms shall be furnished at the same time and in the same manner as the ballots. The county auditor shall furnish blank summary statement forms containing separate space for the summary statement of the returns of the state general election ballot.\nThe blank summary statement forms furnished to each precinct shall identify the precinct, ward number if any, city, school district if applicable, or town, date, and kind of election and, under appropriate headings identifying each color ballot, shall contain spaces for the election judges to enter the information required by section 204C.24, subdivision 1.\nEach blank summary statement form shall also contain a certificate to be signed by the election judges stating that the national flag was displayed on a suitable staff during voting hours; that all of the ballots cast were properly piled, checked, and counted; and that the numbers entered by the election judges on the summary statements correctly show the number of votes cast for each candidate and for and against each question.\nNo later than ten weeks before the state primary in each even-numbered year, the secretary of state shall prescribe the form for summary statements of election returns and the methods by which returns for the state primary and state general election shall be recorded by precinct, county, and state election officials. Each county auditor and municipal or school district clerk required to furnish summary statements shall prepare them in the manner prescribed by the secretary of state. The summary statement of the primary returns shall be in the same form as the summary statement of the general election returns except that a separate part of the summary statement shall be provided for the partisan primary ballot and a separate part for the nonpartisan primary ballot.\nEach official responsible for printing ballots shall also furnish envelopes to contain those ballots after they have been counted. The envelopes shall be made of heavy paper, printed or marked to distinguish the color of the ballots to be contained in them. They shall be of convenient size to hold the ballots and shall be furnished at the same time and in the same manner as the ballots.",
	"repealed": false
}