{
	"id": "299C.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.65",
	"title": "299C.65 INFORMATION ADVISORY GROUP.",
	"text": "[Repealed by amendment, 2016 c 116 s 1]\n(a) The Criminal and Juvenile Justice Information and Bureau of Criminal Apprehension Advisory Group consists of the following members:\n(1) the commissioner of corrections or designee;\n(2) the commissioner of public safety or designee;\n(3) the state chief information officer or designee;\n(4) three members of the judicial branch appointed by the chief justice of the supreme court;\n(5) the commissioner of administration or designee;\n(6) the state court administrator or designee;\n(7) two members appointed by the Minnesota Sheriffs Association, at least one of whom must be a sheriff;\n(8) two members appointed by the Minnesota Chiefs of Police Association, at least one of whom must be a chief of police;\n(9) two members appointed by the Minnesota County Attorneys Association, at least one of whom must be a county attorney;\n(10) two members appointed by the League of Minnesota Cities representing the interests of city attorneys, at least one of whom must be a city attorney;\n(11) two members appointed by the Board of Public Defense, at least one of whom must be a public defender;\n(12) two corrections administrators appointed by the Association of Minnesota Counties representing the interests of local corrections, at least one of whom represents a Community Corrections Act county;\n(13) two probation officers appointed by the commissioner of corrections in consultation with the president of the Minnesota Association of Community Corrections Act Counties and the president of the Minnesota Association of County Probation Officers;\n(14) four public members appointed by the governor representing both metropolitan and greater Minnesota for a term of four years using the process described in section 15.059, one of whom represents the interests of victims, and one of whom represents the private business community who has expertise in integrated information systems and who, for the purposes of meetings of the advisory group, may be compensated pursuant to section 15.059;\n(15) two members appointed by the Minnesota Association for Court Management, at least one of whom must be a court administrator;\n(16) one member of the house of representatives appointed by the speaker of the house, or an alternate who is also a member of the house of representatives, appointed by the speaker of the house;\n(17) one member of the senate appointed by the majority leader, or an alternate who is also a member of the senate, appointed by the majority leader of the senate;\n(18) one member appointed by the attorney general;\n(19) two members appointed by the League of Minnesota Cities, one of whom works or resides in greater Minnesota and one of whom works or resides in the seven-county metropolitan area, and at least one of whom is an elected official;\n(20) two members appointed by the Association of Minnesota Counties, one of whom works or resides in greater Minnesota and one of whom works or resides in the seven-county metropolitan area, and at least one of whom is an elected official; and\n(21) the director of the Sentencing Guidelines Commission or a designee.\n(b) The chair, first vice-chair, and second vice-chair shall be elected by the advisory group.\n(c) The advisory group shall serve as the state advisory group on statewide criminal justice information policy and funding issues. The advisory group shall study and make recommendations to the governor, the supreme court, and the legislature on criminal justice information funding and policy issues such as related data practices, individual privacy rights, and data on race and ethnicity; information-sharing at the local, state, and federal levels; technology education and innovation; the impact of proposed legislation on the criminal justice system related to information systems and business processes; and data and identification standards.\n(d) The advisory group shall have the additional duties of reviewing and advising the bureau superintendent on:\n(1) audits, accreditation reports, and internal reviews of bureau operations;\n(2) emerging technologies in the law enforcement and forensic science fields;\n(3) policies and practices that impact individual privacy interests; and\n(4) other programmatic and operational initiatives of the bureau at the request of the superintendent.\n[Repealed by amendment, 2016 c 116 s 1]\n[Repealed, 2005 c 136 art 11 s 18]\nThe advisory group shall file a biennial report with the governor, supreme court, and chairs and ranking minority members of the senate and house of representatives committees and divisions with jurisdiction over criminal justice funding and policy by January 15 in each odd-numbered year. The report must provide the following:\n(1) status and review of current statewide criminal justice information systems;\n(2) recommendations concerning any legislative changes or appropriations that are needed to ensure that the criminal justice information systems operate accurately and efficiently;\n(3) summary of the activities of the advisory group, including any funding and grant requests; and\n(4) summary of any reviews conducted by the advisory group of bureau audits, reports, policies, programs, and procedures along with any recommendations provided to the bureau related to the reviews.\n[Repealed, 2005 c 136 art 11 s 18]\nAny funding requests submitted to the advisory group shall be reviewed by members of the advisory group to ensure compatibility with the mission of the advisory group. The advisory group shall establish specific criteria and a review process for awarding and distributing any grant funding to other entities.\n[Repealed, 2005 c 136 art 11 s 18]\n[Repealed, 2005 c 136 art 11 s 18]\n[Repealed, 2005 c 136 art 11 s 18]\n[Repealed, 2005 c 136 art 11 s 18]\n[Repealed, 2005 c 136 art 11 s 18]",
	"repealed": false
}