{
	"id": "116B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116B.03",
	"title": "116B.03 CIVIL ACTIONS.",
	"text": "Any person residing within the state; the attorney general; any political subdivision of the state; any instrumentality or agency of the state or of a political subdivision thereof; or any partnership, corporation, association, organization, or other entity having shareholders, members, partners or employees residing within the state may maintain a civil action in the district court for declaratory or equitable relief in the name of the state of Minnesota against any person, for the protection of the air, water, land, or other natural resources located within the state, whether publicly or privately owned, from pollution, impairment, or destruction; provided, however, that no action shall be allowable hereunder for acts taken by a person on land leased or owned by said person pursuant to a permit or license issued by the owner of the land to said person which do not and can not reasonably be expected to pollute, impair, or destroy any other air, water, land, or other natural resources located within the state; provided further that no action shall be allowable under this section for conduct taken by a person pursuant to any environmental quality standard, limitation, rule, order, license, stipulation agreement or permit issued by the Pollution Control Agency, Department of Natural Resources, Department of Health or Department of Agriculture.\nWithin seven days after commencing such action, the plaintiff shall cause a copy of the summons and complaint to be served upon the attorney general and the Pollution Control Agency. Within 21 days after commencing such action, the plaintiff shall cause written notice thereof to be published in a legal newspaper in the county in which suit is commenced, specifying the names of the parties, the designation of the court in which the suit was commenced, the date of filing, the act or acts complained of, and the declaratory or equitable relief requested. The court may order such additional notice to interested persons as it may deem just and equitable.\nIn any action maintained under this section, the attorney general may intervene as a matter of right and may appoint outside counsel where as a result of such intervention the attorney general may represent conflicting or adverse interests. Other interested parties may be permitted to intervene on such terms as the court may deem just and equitable in order to effectuate the purposes and policies set forth in section 116B.01.\nExcept as provided in sections 14.44, 14.63 to 14.68, 115.05, 116.07, and 542.03, any action maintained under this section may be brought in any county in which one or more of the defendants reside when the action is begun, or in which the cause of action or some part thereof arose, or in which the conduct which has or is likely to cause such pollution, impairment, or destruction occurred. If none of the defendants shall reside or be found in the state, the action may be begun and tried in any county which the plaintiff shall designate. A corporation, other than railroad companies, street railway companies, and street railroad companies whether the motive power is steam, electricity, or other power used by these corporations or companies, also telephone companies, telegraph companies, and all other public service corporations, shall be considered as residing in any county wherein it has an office, resident agency, or business place. The above enumerated public service corporations shall be considered as residing in any county wherein the cause of action shall arise or in which the conduct which has or is likely to cause pollution, impairment, or destruction occurred and wherein any part of its lines of railway, railroad, street railway, street railroad, without regard to the motive power of the railroad, street railway, or street railroad, telegraph or telephone lines or any other public service corporation shall extend, without regard to whether the corporation or company has an office, agent, or business place in the county or not.\nWhere any action maintained under this section results in a judgment that a defendant has not violated an environmental quality standard, limitation, rule, order, license, stipulation agreement, or permit promulgated or issued by the Pollution Control Agency, Department of Natural Resources, Department of Health, or Department of Agriculture, the judgment shall not in any way estop the agency from relitigating any or all of the same issues with the same or other defendant unless in the prior action the agency was, either initially or by intervention a party. Where the action results in a judgment that the defendant has violated an environmental quality standard, limitation, rule, order, license, stipulation agreement, or permit promulgated or issued by the Pollution Control Agency, Department of Natural Resources, Department of Health or Department of Agriculture the judgment shall be res judicata in favor of the agency in any action the agency might bring against the same defendant.",
	"repealed": false
}