{
	"id": "16A.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.151",
	"title": "16A.151 PROCEEDS OF LITIGATION OR SETTLEMENT.",
	"text": "(a) This subdivision applies, notwithstanding any law to the contrary, except as provided in subdivision 2.\n(b) A state official may not commence, pursue, or settle litigation, or settle a matter that could have resulted in litigation, in a manner that would result in money being distributed to a person or entity other than the state.\n(c) Money recovered by a state official in litigation or in settlement of a matter that could have resulted in litigation is state money and must be deposited in the general fund.\n(a) If a state official litigates or settles a matter on behalf of specific injured persons or entities, this section does not prohibit distribution of money to the specific injured persons or entities on whose behalf the litigation or settlement efforts were initiated. If money recovered on behalf of injured persons or entities cannot reasonably be distributed to those persons or entities because they cannot readily be located or identified or because the cost of distributing the money would outweigh the benefit to the persons or entities, the money must be paid into the general fund.\n(b) Money recovered on behalf of a fund in the state treasury other than the general fund may be deposited in that fund.\n(c) This section does not prohibit a state official from distributing money to a person or entity other than the state in litigation or potential litigation in which the state is a defendant or potential defendant.\n(d) State agencies may accept funds as directed by a federal court for any restitution or monetary penalty under United States Code, title 18, section 3663(a)(3), or United States Code, title 18, section 3663A(a)(3). Funds received must be deposited in a special revenue account and are appropriated to the commissioner of the agency for the purpose as directed by the federal court.\n(e) Tobacco settlement revenues as defined in section 16A.98, subdivision 1, paragraph (t), may be deposited as provided in section 16A.98, subdivision 12.\n(f) Any money received by the state resulting from a settlement agreement or an assurance of discontinuance entered into by the attorney general of the state, or a court order in litigation brought by the attorney general of the state, on behalf of the state or a state agency, related to alleged violations of consumer fraud laws in the marketing, sale, or distribution of opioids in this state or other alleged illegal actions that contributed to the excessive use of opioids, must be deposited in the settlement account established in the opiate epidemic response fund under section 256.043, subdivision 1. This paragraph does not apply to attorney fees and costs awarded to the state or the Attorney General's Office, to contract attorneys hired by the state or Attorney General's Office, or to other state agency attorneys.\n(g) Notwithstanding paragraph (f), if money is received from a settlement agreement or an assurance of discontinuance entered into by the attorney general of the state or a court order in litigation brought by the attorney general of the state on behalf of the state or a state agency against a consulting firm working for an opioid manufacturer or opioid wholesale drug distributor, the commissioner shall deposit any money received into the settlement account established within the opiate epidemic response fund under section 256.042, subdivision 1. Notwithstanding section 256.043, subdivision 3a, paragraph (a), any amount deposited into the settlement account in accordance with this paragraph shall be appropriated to the commissioner of human services to award as grants as specified by the opiate epidemic response advisory council in accordance with section 256.043, subdivision 3a, paragraph (e).\n(h) If the Minnesota Pollution Control Agency, through litigation or settlement of a matter that could have resulted in litigation, recovers $250,000 or more in a civil penalty from violations of a permit issued by the agency, then 40 percent of the money recovered must be distributed to the community health board, as defined in section 145A.02, where the permitted facility is located. Within 30 days of a final court order in the litigation or the effective date of the settlement agreement, the commissioner of the Minnesota Pollution Control Agency must notify the applicable community health board that the litigation has concluded or a settlement has been reached. The commissioner must collect the money and transfer it to the applicable community health board. The community health board must meet directly with the residents potentially affected by the pollution that was the subject of the litigation or settlement to identify the residents' concerns and incorporate those concerns into a project that benefits the residents. The project must be implemented by the community health board and funded as directed in this paragraph. The community health board may recover the reasonable costs it incurs to administer this paragraph from the funds transferred to the board under this paragraph. This paragraph directs the transfer and use of money only and does not create a right of intervention in the litigation or settlement of the enforcement action for any person or entity. A supplemental environmental project funded as part of a settlement agreement is not part of a civil penalty and must not be included in calculating the amount of funds required to be distributed to a community health board under this paragraph. For the purposes of this paragraph, \"supplemental environmental project\" means a project that benefits the environment or public health that a regulated facility agrees to undertake, though not legally required to do so, as part of a settlement with respect to an enforcement action taken by the Minnesota Pollution Control Agency to resolve noncompliance.\n(i) A community health board receiving a transfer of funds under paragraph (h) must, no later than one year after receiving the funds, submit a report to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over environment policy and natural resources that describes:\n(1) the process of community engagement employed to solicit community input regarding the use of the funds;\n(2) the purposes and activities for which the funds were used; and\n(3) an account of expenditures.\n(j) The commissioner of the Minnesota Pollution Control Agency must submit a report in September each even-numbered year, beginning in 2024, to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over environmental policy and natural resources that includes:\n(1) the amount transferred under paragraph (h) to each community health board during the previous two years; and\n(2) any agency services provided to the community health board or community residents during the duration of the project funded by the transfer, and the cost of those agency services, for consideration by the legislature for future appropriations that address reimbursement of the amount of the transfers and the cost of services provided by the agency.\n(k) Any money received by the state resulting from a settlement agreement or an assurance of discontinuance entered into by the attorney general of the state, or a court order in litigation brought by the attorney general of the state on behalf of the state or a state agency related to alleged violations of consumer fraud laws in the marketing, sale, or distribution of electronic nicotine delivery systems in this state or other alleged illegal actions that contributed to the exacerbation of youth nicotine use, must be deposited in the tobacco use prevention account under section 144.398. This paragraph does not apply to: (1) attorney fees and costs awarded or paid to the state or the Attorney General's Office; (2) contract attorneys hired by the state or Attorney General's Office; or (3) other state agency attorneys. The commissioner of management and budget must transfer to the tobacco use prevention account, any money subject to this paragraph that is received by the state before May 24, 2023.\n[See Note.]\nFor purposes of this section:\n(1) \"litigation\" includes civil, criminal, and administrative actions;\n(2) \"money recovered\" includes actual damages, punitive or exemplary damages, statutory damages, and civil and criminal penalties; and\n(3) \"state official\" means the attorney general, another constitutional officer, an agency, or an agency employee, acting in official capacity.\nThis section supersedes section 8.31, subdivision 2c.\n[Repealed, 2005 c 156 art 2 s 52]",
	"repealed": false
}