{
	"id": "515B.4-106",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-106",
	"title": "515B.4-106 PURCHASER'S RIGHT TO CANCEL.",
	"text": "(a) A person required to deliver a disclosure statement pursuant to section 515B.4-101 (b) shall provide at least one of the purchasers of the unit with a copy of the disclosure statement and all amendments thereto before conveyance of the unit. If a purchaser is not given a disclosure statement more than ten days before execution of the purchase agreement, the purchaser may, before conveyance, cancel the purchase agreement within ten days after first receiving the disclosure statement. If a purchaser is given the disclosure statement more than ten days before execution of the purchase agreement, the purchaser may not cancel the purchase agreement pursuant to this section. The ten-day rescission period may be modified or waived, in writing, by agreement of the purchaser of a unit only after the purchaser has received and had an opportunity to review the disclosure statement. The person required to deliver a disclosure statement may not condition the sale of the unit on the purchaser agreeing to modify or waive the purchaser's ten-day right of rescission, may not contractually obligate the purchaser to modify or waive the purchaser's ten-day right of rescission, and may not include a modification or waiver of the ten-day right of rescission in any purchase agreement for the unit. To be effective, a modification or waiver of a purchaser's ten-day right of rescission must be evidenced by an instrument separate from the purchase agreement signed by the purchaser more than three days after the purchaser receives the disclosure statement.\n(b) If an amendment to the disclosure statement materially and adversely affects a purchaser, then the purchaser shall have ten days after delivery of the amendment to cancel the purchase agreement in accordance with this section. The ten-day rescission period may be modified or waived, in writing, by agreement of the purchaser of a unit only after the purchaser has received and had an opportunity to review the amendment. To be effective, a modification or waiver of a purchaser's ten-day right of rescission under this section must be evidenced by a written instrument separate from the purchase agreement signed by the purchaser more than three days after the purchaser receives the amendment.\n(c) If a purchaser elects to cancel a purchase agreement pursuant to this section, the purchaser may do so by giving the seller or the seller's agent notice thereof pursuant to section 515B.1-115 or, if the seller or seller's agent has provided an electronic address at which the seller or seller's agent agrees to receive electronic communication, as defined in section 317A.011, subdivision 7a, by electronic communication sent to that address. Cancellation is without penalty, and all payments made by the purchaser before cancellation shall be refunded promptly. Notwithstanding anything in this section to the contrary, the purchaser's cancellation rights under this section terminate upon the purchaser's acceptance of a conveyance of the unit.\n(d) If a declarant obligated to deliver a disclosure statement fails to deliver to the purchaser a disclosure statement which substantially complies with this chapter, the declarant shall be liable to the purchaser in the amount of $5,000, in addition to any damages or other amounts recoverable under this chapter or otherwise. Any action brought under this subsection shall be commenced within the time period specified in section 515B.4-115, subsection (a).",
	"repealed": false
}