{
	"id": "327A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/327A.04",
	"title": "327A.04 WAIVER AND MODIFICATION LIMITED.",
	"text": "Except as provided in subdivisions 2 and 3, the provisions of sections 327A.01 to 327A.08 cannot be waived or modified by contract or otherwise. Any agreement which purports to waive or modify the provisions of sections 327A.01 to 327A.08, except as provided in subdivisions 2 and 3 of this section, shall be void.\nAt any time after a contract for the sale of a dwelling is entered into by and between a vendor and a vendee or a contract for home improvement work is entered into by and between a home improvement contractor and an owner, any of the warranties provided for in section 327A.02 may be excluded or modified only by a written instrument, printed in boldface type of a minimum size of ten points, which is signed by the vendee or the owner and which sets forth in detail the warranty involved, the consent of the vendee or the owner, and the terms of the new agreement contained in the writing. No exclusion or modification shall be effective unless the vendor or the home improvement contractor provides substitute express warranties offering substantially the same protections to the vendee or the owner as the statutory warranties set forth in section 327A.02. Any modification or exclusion agreed to by vendee and vendor or the owner and home improvement contractor pursuant to this subdivision shall not require the approval of the commissioner of labor and industry pursuant to section 327A.07.\nIf a major construction defect is discovered prior to the sale of a dwelling, the warranty set forth in section 327A.02, subdivision 1, clause (c) may be waived for the defect identified in the waiver instrument, after full oral disclosure of the specific defect, by an instrument which sets forth in detail: the specific defect; the difference between the value of the dwelling without the defect and the value of the dwelling with the defect, as determined and attested to by an independent appraiser, contractor, insurance adjuster, engineer or any other similarly knowledgeable person selected by the vendee; the price reduction; the date the construction was completed; the legal description of the dwelling; the consent of the vendee to the waiver; and the signatures of the vendee, the vendor, and two witnesses.\nA single waiver agreed to pursuant to this subdivision may not apply to more than one major construction defect in a dwelling.\nThe waiver shall not be effective unless recorded with the county recorder or registrar of titles who shall file the waiver for record.",
	"repealed": false
}