{
	"id": "103E.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.021",
	"title": "103E.021 PLANTING DITCHES WITH PERENNIAL VEGETATION.",
	"text": "In any proceeding to establish, construct, improve, or do any work affecting a public drainage system under any law that appoints viewers to assess benefits and damages, the authority having jurisdiction over the proceeding shall order spoil banks to be spread consistent with the plan and function of the drainage system. The authority shall order that permanent grass, other than a noxious weed, be planted on the ditch side slopes and that a permanent strip of perennial vegetation approved by the drainage authority be established on each side of the ditch. Preference should be given to planting native species of a local ecotype. The approved perennial vegetation shall not impede future maintenance of the ditch. The permanent strips of perennial vegetation shall be 16-1/2 feet in width measured outward from the top edge of the constructed channel resulting from the proceeding, or to the crown of the leveled spoil bank, whichever is the greater, except for an action by a drainage authority that results only in a redetermination of benefits and damages, for which the required width shall be 16-1/2 feet. Drainage system rights-of-way for the acreage and additional property required for the permanent strips must be acquired by the authority having jurisdiction.\nThe authority having jurisdiction over the repair and maintenance of the drainage system shall supervise all necessary reseeding. The permanent strips of perennial vegetation must be maintained in the same manner as other drainage system repairs. Harvest of the vegetation from the permanent strip in a manner not harmful to the vegetation or the drainage system is the privilege of the fee owner or assigns. The drainage inspector shall establish rules for the fee owner and assigns to harvest the vegetation.\nAgricultural practices, other than those required for the maintenance of a permanent growth of perennial vegetation, are not permitted on any portion of the property acquired for perennial vegetation.\nIf a property owner does not bring an area into compliance with this section as provided in the compliance notice, the inspection committee or drainage inspector must notify the drainage authority. If a property owner does not bring an area into compliance after being notified under section 103E.705, subdivision 2, the drainage authority must issue an order to have the work performed to bring the property into compliance. After the work is completed, the drainage authority must send a statement of the expenses incurred to bring the property into compliance to the auditor of the county where the property is located and to the property owner.\n(a) The amount of the expenses to bring an area into compliance with this section is a lien in favor of the drainage authority against the property where the expenses were incurred. The auditor must certify the expenses and enter the amount in the same manner as other drainage liens on the tax list for the following year. The amount must be collected in the same manner as real estate taxes for the property. The provisions of law relating to the collection of real estate taxes shall be used to enforce payment of amounts due under this section. The auditor must include a notice of collection of compliance expenses with the tax statement.\n(b) The amounts collected under this subdivision must be deposited in the drainage system account.\n(a) Notwithstanding other provisions of this chapter requiring appointment of viewers and redetermination of benefits and damages, a drainage authority may make findings and order the establishment of permanent buffer strips of perennial vegetation or side inlet controls, or both, adjacent to a public drainage ditch, where necessary to control erosion and sedimentation, improve water quality, or maintain the efficiency of the drainage system. The drainage authority's finding that establishing permanent buffer strips of perennial vegetation or side inlet controls is necessary to control erosion and sedimentation, improve water quality, or maintain the efficiency of the drainage system is sufficient to confer jurisdiction under this subdivision. Preference should be given to planting native species of a local ecotype. The approved perennial vegetation must not impede future maintenance of the ditch. The permanent strips of perennial vegetation shall be 16-1/2 feet in width measured outward from the top edge of the existing constructed channel. Drainage system rights-of-way for the acreage and additional property required for the permanent strips must be acquired by the authority having jurisdiction.\n(b) A project under this subdivision must be implemented as a repair according to section 103E.705, except that the drainage authority may appoint an engineer to examine the drainage system and prepare an engineer's repair report for the project.\n(c) Damages must be determined by the drainage authority, or viewers, appointed by the drainage authority, according to section 103E.315, subdivision 8. A damages statement must be prepared, including an explanation of how the damages were determined for each property affected by the project, and filed with the auditor or watershed district. Within 30 days after the damages statement is filed, the auditor or watershed district must prepare property owners' reports according to section 103E.323, subdivision 1, clauses (1), (2), (6), (7), and (8), and mail a copy of the property owner's report and damages statement to each owner of property affected by the proposed project.\n(d) After a damages statement is filed, the drainage authority must set a time, by order, not more than 30 days after the date of the order, for a hearing on the project. At least ten days before the hearing, the auditor or watershed district must give notice by mail of the time and location of the hearing to the owners of property and political subdivisions likely to be affected by the project.\n(e) The drainage authority must make findings and order the repairs to be made if the drainage authority determines from the evidence presented at the hearing and by the viewers and engineer, if appointed, that the repairs are necessary for the drainage system and the costs of the repairs are within the limitations of section 103E.705.",
	"repealed": false
}