{
	"id": "254B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.05",
	"title": "254B.05 VENDOR ELIGIBILITY.",
	"text": "(a) Programs licensed by the commissioner are eligible vendors. Hospitals may apply for and receive licenses to be eligible vendors, notwithstanding the provisions of section 245A.03. American Indian programs that provide substance use disorder treatment, extended care, transitional residence, or outpatient treatment services, and are licensed by tribal government are eligible vendors.\n(b) A licensed professional in private practice as defined in section 245G.01, subdivision 17, who meets the requirements of section 245G.11, subdivisions 1 and 4, is an eligible vendor of a comprehensive assessment provided according to section 254A.19, subdivision 3, and treatment services provided according to sections 245G.06 and 245G.07, subdivision 1, paragraphs (a), clauses (1) to (5), and (b); and subdivision 2, clauses (1) to (6).\n(c) A county is an eligible vendor for a comprehensive assessment when provided by an individual who meets the staffing credentials of section 245G.11, subdivisions 1 and 5, and completed according to the requirements of section 254A.19, subdivision 3. A county is an eligible vendor of care coordination services when provided by an individual who meets the staffing credentials of section 245G.11, subdivisions 1 and 7, and provided according to the requirements of section 245G.07, subdivision 1, paragraph (a), clause (5). A county is an eligible vendor of peer recovery services when the services are provided by an individual who meets the requirements of section 245G.11, subdivision 8.\n(d) A recovery community organization that meets the requirements of clauses (1) to (14) and meets certification or accreditation requirements of the Alliance for Recovery Centered Organizations, the Council on Accreditation of Peer Recovery Support Services, or a Minnesota statewide recovery organization identified by the commissioner is an eligible vendor of peer recovery support services. A Minnesota statewide recovery organization identified by the commissioner must update recovery community organization applicants for certification or accreditation on the status of the application within 45 days of receipt. If the approved statewide recovery organization denies an application, it must provide a written explanation for the denial to the recovery community organization. Eligible vendors under this paragraph must:\n(1) be nonprofit organizations under section 501(c)(3) of the Internal Revenue Code, be free from conflicting self-interests, and be autonomous in decision-making, program development, peer recovery support services provided, and advocacy efforts for the purpose of supporting the recovery community organization's mission;\n(2) be led and governed by individuals in the recovery community, with more than 50 percent of the board of directors or advisory board members self-identifying as people in personal recovery from substance use disorders;\n(3) have a mission statement and conduct corresponding activities indicating that the organization's primary purpose is to support recovery from substance use disorder;\n(4) demonstrate ongoing community engagement with the identified primary region and population served by the organization, including individuals in recovery and their families, friends, and recovery allies;\n(5) be accountable to the recovery community through documented priority-setting and participatory decision-making processes that promote the engagement of, and consultation with, people in recovery and their families, friends, and recovery allies;\n(6) provide nonclinical peer recovery support services, including but not limited to recovery support groups, recovery coaching, telephone recovery support, skill-building, and harm-reduction activities, and provide recovery public education and advocacy;\n(7) have written policies that allow for and support opportunities for all paths toward recovery and refrain from excluding anyone based on their chosen recovery path, which may include but is not limited to harm reduction paths, faith-based paths, and nonfaith-based paths;\n(8) maintain organizational practices to meet the needs of Black, Indigenous, and people of color communities, LGBTQ+ communities, and other underrepresented or marginalized communities. Organizational practices may include board and staff training, service offerings, advocacy efforts, and culturally informed outreach and services;\n(9) use recovery-friendly language in all media and written materials that is supportive of and promotes recovery across diverse geographical and cultural contexts and reduces stigma;\n(10) establish and maintain a publicly available recovery community organization code of ethics and grievance policy and procedures;\n(11) not classify or treat any recovery peer hired on or after July 1, 2024, as an independent contractor;\n(12) not classify or treat any recovery peer as an independent contractor on or after January 1, 2025;\n(13) provide an orientation for recovery peers that includes an overview of the consumer advocacy services provided by the Ombudsman for Mental Health and Developmental Disabilities and other relevant advocacy services; and\n(14) provide notice to peer recovery support services participants that includes the following statement: \"If you have a complaint about the provider or the person providing your peer recovery support services, you may contact the Minnesota Alliance of Recovery Community Organizations. You may also contact the Office of Ombudsman for Mental Health and Developmental Disabilities.\" The statement must also include:\n(i) the telephone number, website address, email address, and mailing address of the Minnesota Alliance of Recovery Community Organizations and the Office of Ombudsman for Mental Health and Developmental Disabilities;\n(ii) the recovery community organization's name, address, email, telephone number, and name or title of the person at the recovery community organization to whom problems or complaints may be directed; and\n(iii) a statement that the recovery community organization will not retaliate against a peer recovery support services participant because of a complaint.\n(e) A recovery community organization approved by the commissioner before June 30, 2023, must have begun the application process as required by an approved certifying or accrediting entity and have begun the process to meet the requirements under paragraph (d) by September 1, 2024, in order to be considered as an eligible vendor of peer recovery support services.\n(f) A recovery community organization that is aggrieved by an accreditation, certification, or membership determination and believes it meets the requirements under paragraph (d) may appeal the determination under section 256.045, subdivision 3, paragraph (a), clause (14), for reconsideration as an eligible vendor. If the human services judge determines that the recovery community organization meets the requirements under paragraph (d), the recovery community organization is an eligible vendor of peer recovery support services.\n(g) All recovery community organizations must be certified or accredited by an entity listed in paragraph (d) by June 30, 2025.\n(h) Detoxification programs licensed under Minnesota Rules, parts 9530.6510 to 9530.6590, are not eligible vendors. Programs that are not licensed as a residential or nonresidential substance use disorder treatment or withdrawal management program by the commissioner or by tribal government or do not meet the requirements of subdivisions 1a and 1b are not eligible vendors.\n(i) Hospitals, federally qualified health centers, and rural health clinics are eligible vendors of a comprehensive assessment when the comprehensive assessment is completed according to section 254A.19, subdivision 3, and by an individual who meets the criteria of an alcohol and drug counselor according to section 245G.11, subdivision 5. The alcohol and drug counselor must be individually enrolled with the commissioner and reported on the claim as the individual who provided the service.\n(j) Any complaints about a recovery community organization or peer recovery support services may be made to and reviewed or investigated by the ombudsperson for behavioral health and developmental disabilities under sections 245.91 and 245.94.\n[See Note.]\n(a) Vendors of room and board are eligible for behavioral health fund payment if the vendor:\n(1) has rules prohibiting residents bringing chemicals into the facility or using chemicals while residing in the facility and provide consequences for infractions of those rules;\n(2) is determined to meet applicable health and safety requirements;\n(3) is not a jail or prison;\n(4) is not concurrently receiving funds under chapter 256I for the recipient;\n(5) admits individuals who are 18 years of age or older;\n(6) is registered as a board and lodging or lodging establishment according to section 157.17;\n(7) has awake staff on site whenever a client is present;\n(8) has staff who are at least 18 years of age and meet the requirements of section 245G.11, subdivision 1, paragraph (b);\n(9) has emergency behavioral procedures that meet the requirements of section 245G.16;\n(10) meets the requirements of section 245G.08, subdivision 5, if administering medications to clients;\n(11) meets the abuse prevention requirements of section 245A.65, including a policy on fraternization and the mandatory reporting requirements of section 626.557;\n(12) documents coordination with the treatment provider to ensure compliance with section 254B.03, subdivision 2;\n(13) protects client funds and ensures freedom from exploitation by meeting the provisions of section 245A.04, subdivision 13;\n(14) has a grievance procedure that meets the requirements of section 245G.15, subdivision 2; and\n(15) has sleeping and bathroom facilities for men and women separated by a door that is locked, has an alarm, or is supervised by awake staff.\n(b) Programs licensed according to Minnesota Rules, chapter 2960, are exempt from paragraph (a), clauses (5) to (15).\n(c) Programs providing children's mental health crisis admissions and stabilization under section 245.4882, subdivision 6, are eligible vendors of room and board.\n(d) Programs providing children's residential services under section 245.4882, except services for individuals who have a placement under chapter 260C or 260D, are eligible vendors of room and board.\n(e) Licensed programs providing intensive residential treatment services or residential crisis stabilization services pursuant to section 256B.0622 or 256B.0624 are eligible vendors of room and board and are exempt from paragraph (a), clauses (6) to (15).\n(f) A vendor that is not licensed as a residential treatment program must have a policy to address staffing coverage when a client may unexpectedly need to be present at the room and board site.\nVendors must comply with the following duties:\n(1) maintain a provider agreement with the department;\n(2) continually comply with the standards in the agreement;\n(3) participate in the Drug Alcohol Normative Evaluation System;\n(4) submit an annual financial statement which reports functional expenses of substance use disorder treatment costs in a form approved by the commissioner;\n(5) report information about the vendor's current capacity in a manner prescribed by the commissioner; and\n(6) maintain adequate and appropriate insurance coverage necessary to provide substance use disorder treatment services, and at a minimum:\n(i) employee dishonesty in the amount of $10,000 if the vendor has or had custody or control of money or property belonging to clients; and\n(ii) bodily injury and property damage in the amount of $2,000,000 for each occurrence, except that a county or a county joint powers entity who is otherwise an eligible vendor shall be subject to the limits on liability under section 466.04.\n(a) Where appropriate and feasible, the commissioner shall identify and implement alternative methods of regulation and enforcement to the extent authorized in this subdivision. These methods shall include:\n(1) expansion of the types and categories of licenses that may be granted;\n(2) when the standards of an independent accreditation body have been shown to predict compliance with the rules, the commissioner shall consider compliance with the accreditation standards to be equivalent to partial compliance with the rules; and\n(3) use of an abbreviated inspection that employs key standards that have been shown to predict full compliance with the rules.\n(b) The commissioner shall work with the commissioners of health, public safety, administration, and education in consolidating duplicative licensing and certification rules and standards if the commissioner determines that consolidation is administratively feasible, would significantly reduce the cost of licensing, and would not reduce the protection given to persons receiving services in licensed programs. Where administratively feasible and appropriate, the commissioner shall work with the commissioners of health, public safety, administration, and education in conducting joint agency inspections of programs.\n(c) The commissioner shall work with the commissioners of health, public safety, administration, and education in establishing a single point of application for applicants who are required to obtain concurrent licensure from more than one of the commissioners listed in this clause.\nIf the commissioner determines that the methods in subdivision 2, clause (2) or (3), can be used in licensing a program, the commissioner shall reduce licensure fees by up to 50 percent. The commissioner may adopt rules to provide for the reduction of fees when a license holder substantially exceeds the basic standards for licensure.\nRegional treatment center substance use disorder treatment units are eligible vendors. The executive board may expand the capacity of substance use disorder treatment units beyond the capacity funded by direct legislative appropriation to serve individuals who are referred for treatment by counties and whose treatment will be paid for by funding under this chapter or other funding sources. Notwithstanding the provisions of sections 254B.03 to 254B.04, payment for any person committed at county request to a regional treatment center under chapter 253B for chemical dependency treatment and determined to be ineligible under the behavioral health fund, shall become the responsibility of the county.\n(a) The commissioner shall establish rates for substance use disorder services and service enhancements funded under this chapter.\n(b) Eligible substance use disorder treatment services include:\n(1) those licensed, as applicable, according to chapter 245G or applicable Tribal license and provided according to the following ASAM levels of care:\n(i) ASAM level 0.5 early intervention services provided according to section 254B.19, subdivision 1, clause (1);\n(ii) ASAM level 1.0 outpatient services provided according to section 254B.19, subdivision 1, clause (2);\n(iii) ASAM level 2.1 intensive outpatient services provided according to section 254B.19, subdivision 1, clause (3);\n(iv) ASAM level 2.5 partial hospitalization services provided according to section 254B.19, subdivision 1, clause (4);\n(v) ASAM level 3.1 clinically managed low-intensity residential services provided according to section 254B.19, subdivision 1, clause (5). The commissioner shall use the base payment rate of $79.84 per day for services provided under this item;\n(vi) ASAM level 3.1 clinically managed low-intensity residential services provided according to section 254B.19, subdivision 1, clause (5), at 15 or more hours of skilled treatment services each week. The commissioner shall use the base payment rate of $166.13 per day for services provided under this item;\n(vii) ASAM level 3.3 clinically managed population-specific high-intensity residential services provided according to section 254B.19, subdivision 1, clause (6). The commissioner shall use the specified base payment rate of $224.06 per day for services provided under this item; and\n(viii) ASAM level 3.5 clinically managed high-intensity residential services provided according to section 254B.19, subdivision 1, clause (7). The commissioner shall use the specified base payment rate of $224.06 per day for services provided under this item;\n(2) comprehensive assessments provided according to section 254A.19, subdivision 3;\n(3) treatment coordination services provided according to section 245G.07, subdivision 1, paragraph (a), clause (5);\n(4) peer recovery support services provided according to section 245G.07, subdivision 2, clause (8);\n(5) withdrawal management services provided according to chapter 245F;\n(6) hospital-based treatment services that are licensed according to sections 245G.01 to 245G.17 or applicable Tribal license and licensed as a hospital under sections 144.50 to 144.56;\n(7) substance use disorder treatment services with medications for opioid use disorder provided in an opioid treatment program licensed according to sections 245G.01 to 245G.17 and 245G.22, or under an applicable Tribal license;\n(8) medium-intensity residential treatment services that provide 15 hours of skilled treatment services each week and are licensed according to sections 245G.01 to 245G.17 and 245G.21 or applicable Tribal license;\n(9) adolescent treatment programs that are licensed as outpatient treatment programs according to sections 245G.01 to 245G.18 or as residential treatment programs according to Minnesota Rules, parts 2960.0010 to 2960.0220, and 2960.0430 to 2960.0490, or applicable Tribal license;\n(10) ASAM 3.5 clinically managed high-intensity residential services that are licensed according to sections 245G.01 to 245G.17 and 245G.21 or applicable Tribal license, which provide ASAM level of care 3.5 according to section 254B.19, subdivision 1, clause (7), and are provided by a state-operated vendor or to clients who have been civilly committed to the commissioner, present the most complex and difficult care needs, and are a potential threat to the community; and\n(11) room and board facilities that meet the requirements of subdivision 1a.\n(c) The commissioner shall establish higher rates for programs that meet the requirements of paragraph (b) and one of the following additional requirements:\n(1) programs that serve parents with their children if the program:\n(i) provides on-site child care during the hours of treatment activity that:\n(A) is licensed under chapter 245A as a child care center under Minnesota Rules, chapter 9503; or\n(B) is licensed under chapter 245A and sections 245G.01 to 245G.19; or\n(ii) arranges for off-site child care during hours of treatment activity at a facility that is licensed under chapter 245A as:\n(A) a child care center under Minnesota Rules, chapter 9503; or\n(B) a family child care home under Minnesota Rules, chapter 9502;\n(2) culturally specific or culturally responsive programs as defined in section 254B.01, subdivision 4a;\n(3) disability responsive programs as defined in section 254B.01, subdivision 4b;\n(4) programs that offer medical services delivered by appropriately credentialed health care staff in an amount equal to one hour per client per week if the medical needs of the client and the nature and provision of any medical services provided are documented in the client file; or\n(5) programs that offer services to individuals with co-occurring mental health and substance use disorder problems if:\n(i) the program meets the co-occurring requirements in section 245G.20;\n(ii) the program employs a mental health professional as defined in section 245I.04, subdivision 2;\n(iii) clients scoring positive on a standardized mental health screen receive a mental health diagnostic assessment within ten days of admission;\n(iv) the program has standards for multidisciplinary case review that include a monthly review for each client that, at a minimum, includes a licensed mental health professional and licensed alcohol and drug counselor, and their involvement in the review is documented;\n(v) family education is offered that addresses mental health and substance use disorder and the interaction between the two; and\n(vi) co-occurring counseling staff shall receive eight hours of co-occurring disorder training annually.\n(d) In order to be eligible for a higher rate under paragraph (c), clause (1), a program that provides arrangements for off-site child care must maintain current documentation at the substance use disorder facility of the child care provider's current licensure to provide child care services.\n(e) Adolescent residential programs that meet the requirements of Minnesota Rules, parts 2960.0430 to 2960.0490 and 2960.0580 to 2960.0690, are exempt from the requirements in paragraph (c), clause (5), items (i) to (iv).\n(f) Substance use disorder services that are otherwise covered as direct face-to-face services may be provided via telehealth as defined in section 256B.0625, subdivision 3b. The use of telehealth to deliver services must be medically appropriate to the condition and needs of the person being served. Reimbursement shall be at the same rates and under the same conditions that would otherwise apply to direct face-to-face services.\n(g) For the purpose of reimbursement under this section, substance use disorder treatment services provided in a group setting without a group participant maximum or maximum client to staff ratio under chapter 245G shall not exceed a client to staff ratio of 48 to one. At least one of the attending staff must meet the qualifications as established under this chapter for the type of treatment service provided. A recovery peer may not be included as part of the staff ratio.\n(h) Payment for outpatient substance use disorder services that are licensed according to sections 245G.01 to 245G.17 is limited to six hours per day or 30 hours per week unless prior authorization of a greater number of hours is obtained from the commissioner.\n(i) Payment for substance use disorder services under this section must start from the day of service initiation, when the comprehensive assessment is completed within the required timelines.\n(j) A license holder that is unable to provide all residential treatment services because a client missed services remains eligible to bill for the client's intensity level of services under this paragraph if the license holder can document the reason the client missed services and the interventions done to address the client's absence.\n(k) Hours in a treatment week may be reduced in observance of federally recognized holidays.\n(l) Eligible vendors of peer recovery support services must:\n(1) submit to a review by the commissioner of up to ten percent of all medical assistance and behavioral health fund claims to determine the medical necessity of peer recovery support services for entities billing for peer recovery support services individually and not receiving a daily rate; and\n(2) limit an individual client to 14 hours per week for peer recovery support services from an individual provider of peer recovery support services.\n(m) Peer recovery support services not provided in accordance with section 254B.052 are subject to monetary recovery under section 256B.064 as money improperly paid.\n[See Note.]",
	"repealed": false
}