{
	"id": "148.5192",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5192",
	"title": "148.5192 SPEECH-LANGUAGE PATHOLOGY ASSISTANTS.",
	"text": "A licensed speech-language pathologist may delegate duties to a licensed speech-language pathology assistant in accordance with this section following an initial introduction to a client with the speech-language pathologist and speech-language pathology assistant present.\n[See Note.]\n(a) A speech-language pathology assistant may perform only those duties delegated by a licensed speech-language pathologist and must be limited to duties within the training and experience of the speech-language pathology assistant.\n(b) Duties may include the following as delegated by the supervising speech-language pathologist:\n(1) assist with speech language and hearing screenings;\n(2) implement documented treatment plans or protocols developed by the supervising speech-language pathologist;\n(3) document client performance, including writing progress notes;\n(4) assist with assessments of clients;\n(5) assist with preparing materials and scheduling activities as directed;\n(6) perform checks and maintenance of equipment;\n(7) support the supervising speech-language pathologist in research projects, in-service training, and public relations programs; and\n(8) collect data for quality improvement.\n(c) A speech-language pathology assistant may not:\n(1) perform standardized or nonstandardized diagnostic tests, perform formal or informal evaluations, or interpret test results;\n(2) demonstrate strategies included in the feeding and swallowing plan developed by the speech-language pathologist or share such information with students, patients, clients, families, staff, and caregivers;\n(3) participate in parent conferences, case conferences, or interdisciplinary team meetings without approval from the speech-language pathologist or misrepresent themselves as a speech-language pathologist at such a conference or meeting. The speech-language pathologist and speech-language pathology assistant are required to meet prior to the parent conferences, case conferences, or interdisciplinary team meetings to determine the information to be shared;\n(4) provide client or family counseling or consult with the client or the family regarding the client status or service;\n(5) write, develop, or modify a client's individualized treatment plan or individualized education program;\n(6) select clients for service;\n(7) discharge clients from service;\n(8) disclose information to other team members without permission from the supervising speech-language pathologist; or\n(9) make referrals for additional services.\n(d) A speech-language pathology assistant must only sign documents, including treatment plans, education plans, reimbursement forms, or reports, when cosigned by the supervising speech-language pathologist. The speech-language pathology assistant must sign or initial all treatment notes written by the assistant, which must then also be cosigned by the supervising speech-language pathologist.\n[See Note.]\n(a) A supervising speech-language pathologist shall authorize and accept full responsibility for the performance, practice, and activity of a speech-language pathology assistant. The amount and type of supervision required must be based on the skills and experience of the speech-language pathology assistant. A minimum of one hour every 30 days of consultative supervision time must be documented for each speech-language pathology assistant.\n(b) A supervising speech-language pathologist must:\n(1) be licensed under sections 148.511 to 148.5198;\n(2) hold a certificate of clinical competence from the American Speech-Language-Hearing Association or its equivalent as approved by the commissioner; and\n(3) have completed at least ten hours of continuing education in supervision.\n(c) Once every 60 days, the supervising speech-language pathologist must treat or cotreat with the speech-language pathology assistant each client on the speech-language pathology assistant's caseload.\n(d) For purposes of this section, \"direct supervision\" means observation and guidance by the supervising speech-language pathologist during the performance of a delegated duty that occurs either on-site and in-view or through the use of real-time, two-way interactive audio and visual communication. The supervision requirements described in this section are minimum requirements. Additional supervision requirements may be imposed at the discretion of the supervising speech-language pathologist.\n(e) A supervising speech-language pathologist must be available to communicate with a speech-language pathology assistant at any time the assistant is in direct contact with a client.\n(f) A supervising speech-language pathologist must document activities performed by the assistant that are directly supervised by the supervising speech-language pathologist. At a minimum, the documentation must include:\n(1) information regarding the quality of the speech-language pathology assistant's performance of the delegated duties; and\n(2) verification that any delegated clinical activity was limited to duties authorized to be performed by the speech-language pathology assistant under this section.\n(g) A supervising speech-language pathologist must review and cosign all informal treatment notes signed or initialed by the speech-language pathology assistant.\n(h) A full-time, speech-language pathologist may supervise no more than two full-time, speech-language pathology assistants or the equivalent of two full-time assistants.\n[See Note.]\nAny agency or clinic that intends to utilize the services of a speech-language pathology assistant must provide written notification to the client or, if the client is younger than 18 years old, to the client's parent or guardian before a speech-language pathology assistant may perform any of the duties described in this section.",
	"repealed": false
}