{
	"id": "256.9685",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9685",
	"title": "256.9685 ESTABLISHMENT OF INPATIENT HOSPITAL PAYMENT SYSTEM.",
	"text": "The commissioner shall establish procedures for determining medical assistance payment rates under a prospective payment system for inpatient hospital services in hospitals that qualify as vendors of medical assistance. The commissioner shall establish, by rule, procedures for implementing this section and sections 256.9686, 256.969, and 256.9695. Services must meet the requirements of section 256B.04, subdivision 15, to be eligible for payment.\nNotwithstanding section 256B.04, subdivision 15, the commissioner shall establish an administrative reconsideration process for appeals of inpatient hospital services determined to be medically unnecessary. A physician, advanced practice registered nurse, physician assistant, or hospital may request a reconsideration of the decision that inpatient hospital services are not medically necessary by submitting a written request for review to the commissioner within 45 calendar days after the date the notice of the decision was mailed. The request for reconsideration must be reviewed by at least one medical review agent that is independent of the case under reconsideration. The medical review agent shall make a recommendation to the commissioner. The commissioner's decision on reconsideration is final and not subject to appeal under chapter 14.\nThe commissioner's decision under subdivision 1a is appealable by petition for writ of certiorari under chapter 606.\nMS 2022 [Repealed, 2023 c 70 art 17 s 63]\nMS 2022 [Repealed, 2023 c 70 art 17 s 63]\nIf it is determined that a provision of this section or section 256.9686, 256.969, or 256.9695 conflicts with existing or future requirements of the United States government with respect to federal financial participation in medical assistance, the federal requirements prevail. The commissioner may, in the aggregate, prospectively reduce payment rates to avoid reduced federal financial participation resulting from rates that are in excess of the Medicare limitations.",
	"repealed": false
}