{
	"id": "340A.413",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.413",
	"title": "340A.413 RESTRICTIONS ON NUMBER OF INTOXICATING LIQUOR LICENSES THAT MAY BE ISSUED.",
	"text": "No on-sale intoxicating liquor license may be issued in any city except as provided in this section in excess of the following limits:\n(1) in cities of the first class, one license for every 1,500 population, up to 200 licenses;\n(2) in cities of the second class, not more than 18 licenses plus one for every 2,500 population over 45,000;\n(3) in cities of the third class, not more than 12 licenses;\n(4) in cities of the fourth class, including cities whose acts of incorporation were repealed by Laws 1973, chapter 123, article V, section 5, not more than seven licenses;\n(5) in statutory cities of 5,000 to 10,000 population, not more than six licenses;\n(6) in statutory cities of 2,500 to 5,000 population, not more than five licenses;\n(7) in statutory cities of 500 to 2,500 population, not more than four licenses; and\n(8) in statutory cities under 500 population, not more than three licenses.\nFor cities in St. Louis County no on-sale liquor license may be issued in excess of the following limits, without the approval of the commissioner:\n(1) in cities of the third class, not more than 15 licenses;\n(2) in cities of the fourth class, not more than nine licenses; and\n(3) in statutory cities of 2,500 to 5,000 population, not more than six licenses.\n(a) The governing body of a city may issue on-sale intoxicating liquor licenses over the number permitted under subdivision 1 when authorized by the voters of the city at a general or special election.\n(b) The governing body may direct that either of the following questions be placed on the ballot:\n(1) \"Shall the city council be allowed to issue 'on-sale' licenses for the sale of intoxicating liquor at retail in excess of the number permitted by law?\n(2) \"Shall the city council be allowed to issue (a number to be determined by the governing body) 'on-sale' licenses for the sale of intoxicating liquor at retail in excess of the number now permitted by law?\n(c) If a majority of voters voting on the question in clause (1) vote yes, the governing body may issue an unlimited number of on-sale licenses. If a majority of voters voting on the question in clause (2) vote yes, the governing body may issue additional on-sale licenses in the number stated in the question.\nOn-sale intoxicating liquor licenses may be issued to the following entities by a city, in addition to the number authorized by this section:\n(1) clubs, or congressionally chartered veterans organizations;\n(2) restaurants;\n(3) establishments that are issued licenses to sell wine under section 340A.404, subdivision 5;\n(4) theaters that are issued licenses under section 340A.404;\n(5) hotels; and\n(6) bowling centers.\nNo off-sale intoxicating liquor license may be issued in any city, except as provided in this section, in excess of the following limits:\n(1) in cities of the first class, not more than one off-sale license for each 5,000 population; and\n(2) in all other cities the limit shall be determined by the governing body of the city.\nA license validly issued within the number prescribed in this section is not rendered invalid or illegal by reason of the consolidation or annexation of territory to a city and may continue to remain in effect and be renewed, except that the limitations as to ownership under section 340A.412, subdivision 2.",
	"repealed": false
}