{
	"id": "15C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/15C.05",
	"title": "15C.05 PRIVATE REMEDIES; COMPLAINT UNDER SEAL; COPY OF COMPLAINT AND WRITTEN DISCLOSURE OF EVIDENCE TO BE SENT TO PROSECUTING ATTORNEY.",
	"text": "(a) Except as otherwise provided in this section, a person may maintain an action under this chapter on the person's own account and that of the state; the person's own account and that of a political subdivision; or on the person's own account and that of both the state and a political subdivision. After an action is commenced, it may be voluntarily dismissed only if the court and the prosecuting attorney give written consent to the dismissal and their reasons for consenting.\n(b) If an action is brought under this section, no other person may bring another action under this section based on the same facts that are the subject of the pending action.\n(c) An action may not be maintained under this section:\n(1) against the state, the legislature, the judiciary, the executive branch, or a political subdivision, or respective officers, members, or employees if the action is based on evidence or information known to the state or political subdivision when the action was brought; or\n(2) if the action is based upon allegations or transactions that are the subject of a civil action or an administrative proceeding for a monetary penalty to which the state or a political subdivision is already a party.\n(d) A complaint in an action under this section must be commenced by filing the complaint with the court in chambers and the court must place it under seal for at least 60 days. No service may be made upon the defendant until the complaint is unsealed.\n(e) If a complaint is filed under this section, the plaintiff shall serve a copy of the complaint on the prosecuting attorney in accordance with the Minnesota Rules of Civil Procedure and at the same time shall serve a written disclosure of all material evidence and information the plaintiff possesses.\n(f) A court must dismiss an action or claim under this section, unless opposed by the prosecuting attorney, if substantially the same allegations or transactions as alleged in the action or claim were publicly disclosed:\n(1) in a criminal, civil, or administrative hearing in which the state or a political subdivision or its agent is a party;\n(2) in a report, hearing, audit, or investigation of the legislature, the governing body of a political subdivision, the legislative auditor, or the state auditor; or\n(3) by the news media.\nThis paragraph does not apply if the action or claim is brought by the prosecuting attorney or the person bringing the action or claim is an original source of the information.",
	"repealed": false
}