{
	"id": "349.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.16",
	"title": "349.16 ORGANIZATION LICENSES.",
	"text": "An organization may conduct lawful gambling if it has a license to conduct lawful gambling and complies with this chapter.\nMS 1988 [Repealed by amendment, 1990 c 590 art 1 s 17]\n(a) Licenses authorizing organizations to conduct lawful gambling may be issued by the board to organizations meeting the qualifications in paragraphs (b) to (e) if the board determines that the license is consistent with the purpose of sections 349.11 to 349.22.\n(b) The organization must have been in existence for the most recent three years preceding the license application as a registered Minnesota nonprofit corporation or as an organization designated as exempt from the payment of income taxes by the Internal Revenue Code.\n(c) The organization must have at least 15 active members at the time of its initial license application, and thereafter the organization must have at least 13 members eligible to vote on gambling matters.\n(d) The organization must not be in existence solely for the purpose of conducting gambling.\n(e) The organization has identified on its license application a gambling manager and certifies that the manager is qualified under this chapter.\nIf two or more organizations merge or otherwise join together to form a new organization and at least one of the organizations has an active lawful gambling license, the board shall consider the new organization to have been in existence for the most recent three years if all other requirements of subdivision 2 are met.\nLicenses issued under this section are perpetual and valid unless the board revokes or suspends the license, the organization terminates the license, or the license lapses.\n(a) An organization license is considered to be lapsed if the organization:\n(1) did not conduct and report any gambling sales activity within seven months from the date of the last gambling activity;\n(2) failed to have a gambling manager as required by section 349.167;\n(3) failed to pay annual license and permit fees; or\n(4) surrenders, withdraws, or otherwise terminates the license and files a termination plan required under section 349.19.\n(b) If the organization license is determined to be lapsed, the board may:\n(1) institute a proceeding under section 349.155;\n(2) require the organization to file a termination plan required under section 349.19;\n(3) enter a revocation order as of the date on which the license was considered lapsed;\n(4) impose a civil penalty as provided under section 349.151, subdivision 4;\n(5) order corrective action as provided under section 349.151, subdivision 7; or\n(6) summarily suspend the license as provided under section 349.1641.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nThe board shall impose an annual fee of $350 for an organization's license. Organizations that expect to receive less than $100,000 in gross annual receipts may request from the board a waiver of organization license fees.\nAn organization must pay a monthly regulatory fee of 0.125 percent of the organization's gross receipts from lawful gambling conducted each month. The fee must be reported and paid on a monthly basis in a format as determined by the commissioner of revenue, and remitted to the commissioner of revenue with the organization's monthly tax return. All monthly regulatory fees received by the commissioner of revenue under this subdivision must be deposited in the lawful gambling regulation account in the special revenue fund according to section 349.151. Failure to pay the monthly regulatory fees in a timely manner may result in disciplinary action by the board.\nAn organization may purchase gambling equipment only from a person licensed as a distributor.\nA statutory or home rule charter city or county may assess an annual investigation fee on organizations applying for an initial premises permit or conducting lawful gambling at a site within its jurisdiction under section 349.213, subdivision 2. An investigation fee may not exceed the following limits:\n(1) for cities of the first class, $500;\n(2) for cities of the second class, $250;\n(3) for all other cities, $100; and\n(4) for counties, $375.\nMS 2008 [Repealed, 2009 c 124 s 60]\nMS 2008 [Repealed, 2009 c 124 s 60]\nAn organization which is recognized by federal law, regulation, or other ruling as a quasi-governmental organization that would otherwise be exempt from one or more taxes under chapter 297E must agree to pay all taxes under chapter 297E on lawful gambling conducted by the organization as a condition of receiving a license or premises permit.\nThe organization must notify the board within ten days when changes in the application information occur.",
	"repealed": false
}