{
	"id": "51A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.02",
	"title": "51A.02 DEFINITIONS.",
	"text": "When used in sections 51A.01 to 51A.57, the words and phrases defined in this section have the meanings given them, except to the extent that any such word or phrase specifically is qualified by its context.\nMS 1986 [Renumbered subd 7]\n\"Affiliate\" means a person or organization controlled by, controlling, or under common control with another person or organization.\nMS 1986 [Renumbered subd 10]\nMS 1986 [Renumbered subd 13]\n\"Agreement\" means the bargain of the parties in fact as found in their contract language or by implication from other circumstances including course of dealings, usage of trade, or course of performance.\nMS 1986 [Repealed by amendment, 1988 c 666 s 2]\n\"Agricultural purpose\" means a purpose relating to the production, harvest, exhibition, marketing, transportation, processing, or manufacture of agricultural products. \"Agricultural products\" includes agricultural, horticultural, viticultural, and dairy products, livestock, wildlife, poultry, bees, forest products, fish and shellfish, and their products, including processed and manufactured products, and products raised or produced on farms, including processed or manufactured products.\nMS 1986 [Repealed by amendment, 1988 c 666 s 2]\nMS 1986 [Renumbered subd 23]\n\"Amount financed\" has the meaning given the term in the Code of Federal Regulations, title 12, part 226.\nMS 1986 [Renumbered subd 24]\n\"Annual percentage rate\" has the meaning given the term in the Code of Federal Regulations, title 12, part 226, but using the definition of \"finance charge\" used in this section.\n\"Association\" means a mutual or capital stock savings association or savings association chartered under the provisions of sections 51A.01 to 51A.57.\n\"Branch office\" means an office other than the home office at which deposit accounts are opened and loans are made.\nMS 1986 [Renumbered subd 30]\n\"Business purpose\" means a purpose other than personal, family, household, or agricultural purpose.\nMS 1986 [Renumbered subd 31]\n\"Capital stock\" means the aggregate of shares of nonwithdrawable capital issued by a capital stock association, but does not include nonwithdrawable capital represented by capital certificates.\nMS 1986 [Renumbered subd 32]\n\"Card issuer\" means a person who provides credit by issuing a credit card.\nMS 1986 [Renumbered subd 34]\n\"Cardholder\" means a person to whom a credit card is issued or who has agreed with the card issuer to pay obligations arising from the issuance to or use of the card by another person.\nMS 1986 [Renumbered subd 36]\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota.\nMS 1986 [Renumbered subd 38]\n\"Conditional sale contract\" or \"credit sale contract\" means a contract evidencing a sale on credit.\n\"Conspicuous\" means, in reference to a term or clause, that it is written so that a reasonable person against whom it is to operate ought to have noticed it.\nMS 1986 [Repealed by amendment, 1988 c 666 s 2]\n\"Consumer\" means the debtor to whom credit is granted in a consumer loan.\nMS 1986 [Renumbered subd 46]\n\"Consumer loan\" means a loan made by an association in which:\n(1) the debtor is a person other than an organization;\n(2) the debt is incurred primarily for a personal, family, household, or agricultural purpose; and\n(3) the debt is payable in installments or a finance charge is made.\nMS 1986 [Renumbered subd 47]\n\"Credit\" means the right granted by an association to a borrower to defer payment of debt, to incur debt and defer its payment, or to purchase property or services and defer payment.\nMS 1986 [Renumbered subd 48]\n\"Credit card\" means a card or device issued under an arrangement pursuant to which a card issuer gives to a cardholder the privilege of obtaining credit from the card issuer or other person in purchasing or leasing property or services, obtaining loans, or otherwise. A transaction is \"pursuant to a credit card\" only if credit is obtained according to the terms of the arrangement by transmitting information contained on the card or device orally, in writing, by mechanical or electronic methods, or in any other manner. A transaction is not \"pursuant to a credit card\" if the card or device is used solely in that transaction to:\n(1) identify the cardholder or evidence the cardholder's creditworthiness and credit is not obtained according to the terms of the arrangement;\n(2) obtain a guarantee of payment from the cardholder's deposit account, whether or not the payment results in a credit extension to the cardholder by the card issuer; or\n(3) effect an immediate transfer of funds from the cardholder's deposit account by electronic or other means, whether or not the transfer results in a credit extension to the cardholder by the card issuer.\nMS 1986 [Renumbered subd 49]\n\"Credit sale\" means a sale of goods, services, or an interest in land in which:\n(1) credit is granted by a seller who regularly engages as a seller in credit transactions of the same kind; and\n(2) the debt is payable in installments or a finance charge is made.\nMS 1986 [Renumbered subd 50]\n\"Demand deposit account\" has the meaning given the term in the Code of Federal Regulations, title 12, part 204.\nMS 1986 [Renumbered subd 51]\n\"Deposit account\" means funds deposited with an association in the form of a savings account, time deposit account, NOW account, demand deposit account, or treasury and tax loan account.\nMS 1986 [Renumbered subd 52]\nMS 1986 [Renumbered subd 53]\nMS 1986 [Renumbered subd 54]\n\"Dwelling unit\" means a single, unified combination of rooms designed for residential use by one family in a multiple dwelling unit structure, and which is not \"home property.\"\nMS 1986 [Repealed by amendment, 1988 c 666 s 2]\n\"Earnings\" means that part of the sources available for payment of earnings of an association which is declared payable on savings accounts from time to time by the board of directors, and is the cost of savings money to the association. Earnings also may be referred to as \"interest\" or \"dividends.\"\nMS 1986 [Renumbered subd 56]\n\"Federal association\" means an association or savings bank with its home office in this state and chartered under the federal Home Owners' Loan Act of 1933, United States Code, title 12, sections 1461 to 1470.\n\"Finance charge\" has the meaning given the term in the Code of Federal Regulations, title 12, part 226, except that the following will not in any event be considered a finance charge:\n(1) a charge as a result of default or delinquency under section 47.59 if made for actual unanticipated late payment, delinquency, default, or other similar occurrence, and a charge for an extension or deferment under section 47.59, unless the parties agree that these charges are finance charges;\n(2) any additional charge under section 47.59, subdivision 6; or\n(3) a discount, if an association purchases a contract evidencing a credit sale or loan at less than the face amount of the obligation or purchases or satisfies obligations of a cardholder pursuant to a credit card and the purchase or satisfaction is made at less than the face amount of the obligation.\n\"Financial institution\" means a savings association, commercial bank, trust company, credit union, or industrial loan and thrift company.\n\"Home office\" means the office of the association designated by it as its principal office.\n\"Home property\" means real estate on which there is located, or will be located pursuant to a real estate loan, either a structure designed for residential use by one family or a unit in a residential common interest community, including all elements pertinent thereto, designed for residential use by one family in a multiple dwelling unit structure or complex, and includes fixtures, furnishings and equipment.\n\"Impaired condition\" means a condition in which, based upon accepted examination practices, the assets of an association do not have an aggregate value equal to the aggregate amount of liabilities of the association to its creditors, including its members and all other persons.\n\"Improved real estate\" means real estate on which there is a structure or an enclosure, or which is reclaimed, prepared as building lots or sites, or otherwise occupied, made better, more useful, or of greater value by care so as to provide an enjoyment thereof.\n\"Insured association\" means an association the deposit accounts of which are insured wholly or in part in accordance with the provisions of sections 51A.01 to 51A.57.\n\"Lender credit card\" means a credit card issued by an association or federal association.\n\"Liquid assets\" means cash on hand; cash on deposit in federal home loan banks, state banks performing similar reserve functions, commercial banks, or insured associations or federal associations, which is withdrawable upon not more than 30 days' notice and which is not pledged as security for indebtedness, except that any deposits in a bank under the control or in the possession of any supervisory authority shall not be considered as liquid assets; and obligations of the United States, or such government guaranteed obligations as are approved by the Federal Savings and Loan Insurance Corporation.\n(a) Except as provided in paragraph (b), \"loan\" includes:\n(1) the creation of debt by the association's or federal association's payment of or agreement to pay money to the borrower or to a third person for the account of the borrower;\n(2) the creation of debt pursuant to a lender credit card in any manner, including a cash advance or the card issuer's honoring a draft or similar order for the payment of money drawn or accepted by the borrower, paying or agreeing to pay the borrower's obligation, or purchasing or otherwise acquiring the borrower's obligation from the obligee or the borrower's assignee;\n(3) the creation of debt by a cash advance to a borrower pursuant to an overdraft line of credit arrangement;\n(4) the creation of debt by a credit to an account with the lender upon which the borrower is entitled to draw immediately;\n(5) the forbearance of debt arising from a loan; and\n(6) the creation of debt pursuant to open-end credit.\n(b) \"Loan\" does not include the forbearance of debt arising from a sale or lease.\n\"Member\" means a person holding a deposit account of a mutual association, and a person borrowing from or assuming or obligated upon a loan or interest therein held by a mutual association, or purchasing property securing a loan or interest held by a mutual association, and any other person obligated to a mutual association. A joint and survivorship relationship, whether of savers or borrowers, constitutes a single membership.\n\"Money market deposit account\" has the meaning given the term in the Code of Federal Regulations, title 12, part 561.\n\"Net income\" means gross revenues for an accounting period less all expenses paid or incurred, taxes, and losses sustained as shall not have been charged to reserves pursuant to the provisions of sections 51A.01 to 51A.57.\n\"NOW account\" has the meaning given the term in the Code of Federal Regulations, title 12, part 561.\n\"Official fees\" means:\n(1) fees and charges which actually are or will be paid to public officials for determining the existence of or for perfecting, releasing, terminating, or satisfying a security interest or mortgage related to a loan or credit sale, and any separate fees or charges that actually are or will be paid to public officials for recording a notice described in section 580.032, subdivision 1; and\n(2) premiums payable for insurance in lieu of perfecting a security interest or mortgage otherwise required by an association in connection with a loan or credit sale, if the premium does not exceed the fees and charges described in clause (1) which would otherwise be payable.\n\"One borrower\" means (1) any person or entity which is, or which upon the making of a loan will become, obligor on a real estate loan, (2) nominees of such obligor, (3) all persons, trusts, partnerships, syndicates, and corporations of which such obligor is a nominee or a beneficiary, partner, member, or record or beneficial stockholder owning ten percent or more of the capital stock, and (4) if such obligor is a trust, partnership, syndicate, or corporation, all trusts, partnerships, syndicates, and corporations of which any beneficiary, partner, member, or record or beneficial stockholder owning ten percent or more of the capital stock, is also a beneficiary, partner, member, or record or beneficial stockholder owning ten percent or more of the capital stock of such obligor.\n\"Open-end credit\" means an arrangement pursuant to which:\n(1) an association may permit a borrower, from time to time, to obtain loans, including but not limited to an overdraft checking line of credit arrangement, a secured or unsecured line of credit agreement, or a credit card line of credit;\n(2) the amounts financed and the finance and other appropriate charges are debited to an account; and\n(3) the finance charge, if made, is computed on the account periodically.\n\"Organization\" means a corporation, government or governmental subdivision or agency, trust, estate, partnership, joint venture, cooperative, limited liability company, or association.\n\"Payable in installments\" means that payment is required or permitted by agreement to be made in more than four periodic payments. If any periodic payment under an agreement requiring or permitting two or more periodic payments is more than twice the amount of any other periodic payment, a loan is \"payable in installments.\"\n\"Person\" means a natural person or an organization.\n\"Primary lending area\" means the state of Minnesota.\n\"Real estate loan\" means any loan or other obligation secured by a first lien on real estate held in fee or in a leasehold extending or renewable automatically for a period of at least ten years beyond the date scheduled for the final principal payment of such loan or obligation, or any transaction out of which a first lien or claim is created against such real estate, including inter alia the purchase of such real estate in fee by an association and the concurrent or immediate sale thereof on installment contract.\n\"Savings account\" means any deposit account other than a time deposit account, a NOW account, a demand deposit account, or a treasury tax and loan account. Savings accounts include but are not limited to money market deposit accounts.\n\"Savings liability\" means the aggregate amount of savings accounts, including earnings credited to such accounts, less redemptions and withdrawals.\n\"Service organization\" means an affiliate organization substantially all the activities of which consist of activities as the commissioner may approve.\n\"Sources available for payment of earnings\" means net income for an accounting period less amounts transferred to reserves as provided in or permitted by sections 51A.01 to 51A.57, plus any balance of undivided profits whether same are designated as such or by other language from preceding accounting periods.\n\"Stockholder\" means the holder of one or more shares of any class of capital stock of a capital stock association organized and operating pursuant to the provisions of Laws 1981, chapter 276.\n\"Surplus\" means the aggregate amount of the undistributed net income for an association held as undivided profits or unallocated reserves for general corporate purposes, and any paid-in surplus held by an association.\n\"Thrift institution\" means an association, a mutual savings bank, a cooperative bank, a homestead association, a savings association, a federal association, and a supervised thrift and residential financing institution of a substantially similar nature.\n\"Time deposit\" has the meaning given the term in the Code of Federal Regulations, title 12, part 204.\n\"Withdrawal value\" means the amount credited to a deposit account of a member, less lawful deduction therefrom, as shown by the records of the association.",
	"repealed": false
}