{
	"id": "85.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.41",
	"title": "85.41 CROSS-COUNTRY-SKI PASSES.",
	"text": "While skiing on cross-country-ski trails, a person age 16 or over shall carry in immediate possession a valid cross-country-ski pass. A landowner who grants an easement for a grant-in-aid ski trail is not required to have a pass when skiing on the landowner's property.\n[See Note.]\n(a) The commissioner may appoint agents to issue and sell cross-country-ski passes. The commissioner may revoke the appointment of an agent at any time.\n(b) The commissioner may promulgate additional rules as provided in section 97A.485, subdivision 11. An agent shall observe all rules promulgated by the commissioner for the accounting and handling of licenses pursuant to section 97A.485, subdivision 11.\n(c) An agent must promptly deposit and remit all moneys received from the sale of passes, except issuing fees, to the commissioner.\n(a) Participants in cross-country-ski races and residents of a state or local government operated correctional facility are exempt from the pass requirement in subdivision 1 if a special use permit has been obtained by the organizers of the event or those in an official capacity in advance from the agency with jurisdiction over the cross-country-ski trail. Permits shall require that permit holders return the trail and any associated facility to its original condition if any damage is done by the permittee. Limited permits for special events may be issued and shall require the removal of any trail markers, banners, and other material used in connection with the special event.\n(b) Unless otherwise exempted under paragraph (a), students, teachers, and supervising adults engaged in school-sanctioned activities or youth activities sponsored by a nonprofit organization are exempt from the pass requirements in subdivision 1.\n(c) A resident that is in the armed forces of the United States, stationed outside of the state, and in the state on leave is exempt from the pass requirement in subdivision 1 if the resident possesses official military leave papers.\n(d) A resident who has served at any time during the preceding 24 months in federal active service, as defined in section 190.05, subdivision 5c, outside the United States as a member of the National Guard, or as a reserve component or active duty member of the United Stated armed forces and has been discharged from active service is exempt from the pass requirement in subdivision 1 if the resident possesses official military discharge papers.\nThe commissioner and agents shall issue and sell cross-country-ski passes. The pass shall be with the skier and available for inspection by any peace or conservation officer. The pass shall include the applicant's information deemed necessary by the commissioner.\n[See Note.]\nIn addition to the fee for a cross-country-ski pass, an issuing fee of $1 per pass shall be charged. The issuing fee shall be retained by the seller of the pass. Issuing fees for passes issued by the commissioner shall be deposited in the cross-country-ski account in the natural resources fund and retained for the operation of the electronic licensing system. A pass shall indicate the amount of the fee that is retained by the seller.",
	"repealed": false
}