{
	"id": "124D.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.99",
	"title": "124D.99 EDUCATION PARTNERSHIPS COALITION FUND.",
	"text": "The commissioner of education shall establish a program supporting a coalition of coordinated, aligned education partnerships as specified in this section, for a comprehensive network of evidence-based support services designed to close opportunity gaps by improving educational and developmental outcomes of children and their families within communities experiencing poverty and impediments to economic viability.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Neighborhood partnership grant\" means a sustaining grant for the ongoing operation, stability, and expansion of existing education partnership program locations serving a defined geographic area within a single municipality.\n(c) \"Regional neighborhood partnership grant\" means an implementation grant for the ongoing operation, stability, and expansion of activity of existing education partnership program locations serving a defined geographic area encompassing an entire municipality or part of or all of multiple municipalities.\n(a) The commissioner shall establish program requirements, an application process and timeline for each grant specified in subdivision 4, criteria for evaluation of applications, and a grant awards process. The commissioner's process must minimize administrative costs, minimize burdens for applicants and grant recipients, and provide a framework that permits flexibility in program design and implementation among grant recipients.\n(b) To the extent practicable, the commissioner shall design the program to align with programs implemented or proposed by organizations in Minnesota that:\n(1) identify and increase the capacity of organizations that are focused on achieving data-driven, locally controlled positive outcomes for children and youth throughout an entire neighborhood or geographic area through programs such as Strive Together, Promise Neighborhood, and the Education Partnerships Coalition members;\n(2) build a continuum of educational family and community supports with academically rigorous schools at the center;\n(3) maximize program efficiencies by integrating programmatic activities and eliminating administrative barriers;\n(4) develop local infrastructure needed to sustain and scale proven and effective solutions beyond the initial neighborhood or geographic area;\n(5) utilize appropriate outcome measures based on unique community needs and interests and apply rigorous evaluation on a periodic basis to be used to both monitor outcomes and allow for continuous improvements to systems;\n(6) collect and utilize data to improve student outcomes;\n(7) share disaggregated performance data with the community to set community-level outcomes;\n(8) employ continuous improvement processes;\n(9) have a Tribal entity, community foundation, higher education institution, or community-based organization as an anchor entity managing the partnership;\n(10) convene a cross-sector leadership group and have a documented accountability structure; and\n(11) demonstrate use of nonstate funds, from multiple sources, including in-kind contributions.\n(c) A grant recipient's supportive services programming must address:\n(1) kindergarten readiness and youth development;\n(2) grade 3 reading proficiency;\n(3) middle school mathematics;\n(4) high school graduation;\n(5) postsecondary educational enrollment;\n(6) postsecondary education completion or attainment;\n(7) physical and mental health;\n(8) development of career skills and readiness;\n(9) parental engagement and development;\n(10) community engagement and programmatic alignment; and\n(11) reduction of remedial education.\n(d) The commissioner, in consultation with grant recipients, must:\n(1) develop and revise core indicators of progress toward outcomes specifying impacts identified under subdivision 4;\n(2) establish a reporting system for grant recipients to measure program outcomes using data sources and program goals; and\n(3) evaluate effectiveness based on the core indicators established by each partnership.\nA grant recipient's program in the planning, development, or implementation phase must include:\n(1) integrated supportive services programming, as specified in subdivision 3, paragraph (c), within a specific community or geographic area for all ages of children and youth and their families within that area, provided that services may be phased in to all ages over time; and\n(2) a system for evaluating goals and outcomes as provided under subdivision 3, paragraph (d).\nThe commissioner shall award grants to qualifying recipients that can demonstrate a nonstate source of funds, including in-kind contributions.\nBy December 15 of each odd-numbered year, the commissioner shall submit a report on the education partnership program to the chairs and ranking minority members of the legislative committees having jurisdiction over kindergarten through grade 12 education, early childhood education, economic development, and human services. At a minimum, the report must summarize grantee activities, identify grant recipients and awards, analyze program performance measures and outcomes, and make any recommendations for legislative changes.",
	"repealed": false
}