{
	"id": "501C.1114",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1114",
	"title": "501C.1114 NONTRUST ESTATES.",
	"text": "Sections 501C.1101 to 501C.1118 apply to nontrust estates, subject to:\n(1) agreement of the parties;\n(2) specific direction in the instrument creating the nontrust estates;\n(3) subdivision 2; and\n(4) other applicable statutes.\nReferences in sections 501C.1101 to 501C.1118 to trusts and trustees must be read as applying to nontrust estates and to tenants and remainderpersons as the context requires.\n(a) In applying sections 501C.1101 to 501C.1118 to nontrust estates, the rules in paragraphs (b) to (e) must be followed.\n(b) A legal life tenant or a remainderperson who has incurred a charge for the tenant's or remainderperson's benefit without the consent or agreement of the other, shall pay the charge in full.\n(c) Costs of an improvement, including special taxes or assessments representing an addition to value of property forming part of the principal that cannot reasonably be expected to outlast the legal life estate, must be paid by the legal life tenant.\n(d) If the improvement can reasonably be expected to outlast the legal life estate, only a portion of the costs must be paid by the legal life tenant and the balance by the remainderperson.\n(1) The portion payable by the legal life tenant is that fraction of the total found by dividing the present value of the legal life estate by the present value of an estate of the same form as that of the legal life estate but limited to a period corresponding to the reasonably expected duration of the improvement.\n(2) The present value of the legal life estate must be computed by applying the federal estate tax regulations for the calculation of the value of life estates under section 2031 of the Internal Revenue Code of 1986. The federal estate tax regulations applied must be those in force on the date when the costs of the improvement are initially determined by assessment, agreement, or otherwise. No other evidence of duration or expectancy may be considered.\n(e) No allowance may be made for depreciation of property held by a legal life tenant on January 1, 1990, if the life tenant was not making the allowance with respect to the property prior to January 1, 1990.",
	"repealed": false
}