{
	"id": "299F.852",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.852",
	"title": "299F.852 CERTIFICATION AND PRODUCT CHANGE.",
	"text": "Each manufacturer shall submit to the state fire marshal a written certification attesting that each cigarette listed in the certification:\n(1) has been tested in accordance with section 299F.851; and\n(2) meets the performance standard set forth in section 299F.851, subdivision 1, paragraph (d).\nEach cigarette listed in the certification must be described with the following information:\n(1) brand or trade name on the package;\n(2) style, such as light or ultra light;\n(3) length in millimeters;\n(4) circumference in millimeters;\n(5) flavor, such as menthol or chocolate, if applicable;\n(6) filter or nonfilter;\n(7) package description, such as soft pack or box;\n(8) marking approved in accordance with section 299F.853;\n(9) the name, address, and telephone number of the laboratory, if different than the manufacturer that conducted the test; and\n(10) the date that the testing occurred.\nThe certifications must be made available to the attorney general for purposes consistent with this section and the commissioner of revenue for the purposes of ensuring compliance with this subdivision.\nEach cigarette certified under this subdivision must be recertified every three years.\nFor each cigarette listed in a certification, a manufacturer shall pay to the state fire marshal a $250 fee, to be deposited in the reduced cigarette ignition propensity account described in section 299F.857.\nIf a manufacturer has certified a cigarette pursuant to this section, and thereafter makes any change to the cigarette that is likely to alter its compliance with the reduced cigarette ignition propensity standards required by sections 299F.850 to 299F.859, that cigarette must not be sold or offered for sale in this state until the manufacturer retests the cigarette in accordance with the testing standards set forth in section 299F.851 and maintains records of that retesting as required by section 299F.851. Any altered cigarette that does not meet the performance standard set forth in section 299F.851 may not be sold in this state.",
	"repealed": false
}