{
	"id": "256D.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.44",
	"title": "256D.44 STANDARDS OF ASSISTANCE.",
	"text": "The state standards of assistance for basic needs, plus special need items establish the total amount of need for an applicant for or recipient of Minnesota supplemental aid, used to determine the assistance unit's eligibility for Minnesota supplemental aid. The state standards of assistance for basic needs must increase by an amount equal to the dollar value, rounded up to the nearest dollar, of any cost of living increases in the Supplemental Security Income program.\nThe state standard of assistance for a person who: (1) is eligible for a medical assistance home and community-based services waiver; (2) has been determined by the local agency to meet the plan requirements for placement in a setting authorized to provide housing support under section 256I.04, subdivision 1a; or (3) is eligible for a shelter needy payment under subdivision 5, paragraph (g), is the standard established in subdivision 3, paragraph (a) or (b).\nExcept as provided in subdivision 4, the monthly state standard of assistance for basic needs is as follows:\n(a) If an applicant or recipient does not reside with another person or persons, the state standard of assistance is $519.\n(b) If an applicant married couple or recipient married couple who live together, does not reside with others, the state standard of assistance is $778.\n(c) If an applicant or recipient resides with another person or persons, the state standard of assistance is $395.\n(d) If an applicant married couple or recipient married couple who live together, resides with others, the state standard of assistance is $519.\n(e) Married couples, living together who do not reside with others and were receiving MSA prior to January 1, 1994, and whose eligibility has not been terminated a full calendar month, the state standard of assistance is $793.\n(f) Married couples living together who reside with others and were receiving MSA prior to January 1, 1994, and whose eligibility has not been terminated a full calendar month, the state standard of assistance is $782.\n(g) For an individual who (1) receives Supplemental Security Income under federal living arrangement D or (2) is a resident of a licensed residential facility and has unmet personal needs, the state standard of assistance is the personal needs allowance for medical assistance recipients under section 256B.35.\nFor the purposes of this subdivision, \"home\" means a residence owned or rented by a recipient or the recipient's spouse. Assistance payments for recipients who are temporarily absent from their home due to hospitalization for illness must continue at the same level of payment during their absence if the following criteria are met:\n(1) a physician, advanced practice registered nurse, or physician assistant certifies that the absence is not expected to continue for more than three months;\n(2) a physician, advanced practice registered nurse, or physician assistant certifies that the recipient will be able to return to independent living; and\n(3) the recipient has expenses associated with maintaining a residence in the community.\n(a) In addition to the state standards of assistance established in subdivisions 1 to 4, payments are allowed for the following special needs of recipients of Minnesota supplemental aid who are not residents of a nursing home, a regional treatment center, or a setting authorized to receive housing support payments under chapter 256I.\n(b) The county agency shall pay a monthly allowance for medically prescribed diets if the cost of those additional dietary needs cannot be met through some other maintenance benefit. The need for special diets or dietary items must be prescribed by a licensed physician, advanced practice registered nurse, or physician assistant. Costs for special diets shall be determined as percentages of the allotment for a one-person household under the thrifty food plan as defined by the United States Department of Agriculture. The types of diets and the percentages of the thrifty food plan that are covered are as follows:\n(1) high protein diet, at least 80 grams daily, 25 percent of thrifty food plan;\n(2) controlled protein diet, 40 to 60 grams and requires special products, 100 percent of thrifty food plan;\n(3) controlled protein diet, less than 40 grams and requires special products, 125 percent of thrifty food plan;\n(4) low cholesterol diet, 25 percent of thrifty food plan;\n(5) high residue diet, 20 percent of thrifty food plan;\n(6) pregnancy and lactation diet, 35 percent of thrifty food plan;\n(7) gluten-free diet, 25 percent of thrifty food plan;\n(8) lactose-free diet, 25 percent of thrifty food plan;\n(9) antidumping diet, 15 percent of thrifty food plan;\n(10) hypoglycemic diet, 15 percent of thrifty food plan; or\n(11) ketogenic diet, 25 percent of thrifty food plan.\n(c) Payment for nonrecurring special needs must be allowed for necessary home repairs or necessary repairs or replacement of household furniture and appliances using the payment standard of the AFDC program in effect on July 16, 1996, for these expenses, as long as other funding sources are not available.\n(d) A fee for guardian or conservator service is allowed at a reasonable rate negotiated by the county or approved by the court. This rate shall not exceed five percent of the assistance unit's gross monthly income up to a maximum of $100 per month. If the guardian or conservator is a member of the county agency staff, no fee is allowed.\n(e) The county agency shall continue to pay a monthly allowance of $68 for restaurant meals for a person who was receiving a restaurant meal allowance on June 1, 1990, and who eats two or more meals in a restaurant daily. The allowance must continue until the person has not received Minnesota supplemental aid for one full calendar month or until the person's living arrangement changes and the person no longer meets the criteria for the restaurant meal allowance, whichever occurs first.\n(f) A fee equal to the maximum monthly amount allowed by the Social Security Administration is allowed for representative payee services provided by an agency that meets the requirements under SSI regulations to charge a fee for representative payee services. This special need is available to all recipients of Minnesota supplemental aid regardless of their living arrangement.\n(g)(1) Notwithstanding the language in this subdivision, an amount equal to one-half of the maximum federal Supplemental Security Income payment amount for a single individual which is in effect on the first day of July of each year will be added to the standards of assistance established in subdivisions 1 to 4 for adults under the age of 65 who qualify as in need of housing assistance and are:\n(i) relocating from an institution, a setting authorized to receive housing support under chapter 256I, or an adult mental health residential treatment program under section 256B.0622;\n(ii) eligible for personal care assistance under section 256B.0659; or\n(iii) home and community-based waiver recipients living in their own home or rented or leased apartment.\n(2) Notwithstanding subdivision 3, paragraph (c), an individual eligible for the shelter needy benefit under this paragraph is considered a household of one. An eligible individual who receives this benefit prior to age 65 may continue to receive the benefit after the age of 65.\n(3) \"Housing assistance\" means that the assistance unit incurs monthly shelter costs that exceed 40 percent of the assistance unit's gross income before the application of this special needs standard. \"Gross income\" for the purposes of this section is the applicant's or recipient's income as defined in section 256D.35, subdivision 10, or the standard specified in subdivision 3, paragraph (a) or (b), whichever is greater. A recipient of a federal or state housing subsidy, that limits shelter costs to a percentage of gross income, shall not be considered in need of housing assistance for purposes of this paragraph.\nThe county agency may establish standards of assistance for basic needs, special needs, and clothing and personal needs that exceed the corresponding state standards of assistance. State aid is not available for costs above state standards.\n[Repealed, 1995 c 207 art 5 s 40]",
	"repealed": false
}