{
	"id": "469.319",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.319",
	"title": "469.319 REPAYMENT OF TAX BENEFITS BY BUSINESSES THAT NO LONGER OPERATE IN A ZONE.",
	"text": "A business must repay the total tax benefits listed in section 469.315 received during the two years immediately before it (1) ceased to perform a substantial level of activities described in the business subsidy agreement, or (2) otherwise ceased to be a qualified business, other than those subject to the provisions of section 469.3191.\nPersons that receive benefits without operating a business in a zone are subject to repayment under this section if the business for which those benefits relate is subject to repayment under this section. Such persons are deemed to have ceased performing in the zone on the same day that the qualified business for which the benefits relate becomes subject to repayment under subdivision 1.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Business\" means any person that received tax benefits enumerated in section 469.315.\n(c) \"Commissioner\" means the commissioner of revenue.\n(d) \"Persons that receive benefits without operating a business in a zone\" means persons that claim benefits under section 469.316, subdivision 2 or 4, as well as persons that own property leased by a qualified business and are eligible for benefits under section 272.02, subdivision 64, or 297A.68, subdivision 37, paragraph (b).\nThe repayment must be paid to the state to the extent it represents a state tax reduction and to the county to the extent it represents a property tax reduction. Any amount repaid to the state must be deposited in the general fund. Any amount repaid to the county for the property tax exemption must be distributed to the taxing authorities with authority to levy taxes in the zone in the same manner provided for distribution of payment of delinquent property taxes. Any repayment of local sales taxes must be repaid to the commissioner for distribution to the city or county imposing the local sales tax.\n(a) For the repayment of taxes imposed under chapter 290 or 297A or local taxes collected pursuant to section 297A.99, a business must file an amended return with the commissioner of revenue and pay any taxes required to be repaid within 30 days after becoming subject to repayment under this section. The amount required to be repaid is determined by calculating the tax for the period or periods for which repayment is required without regard to the exemptions and credits allowed under section 469.315.\n(b) For the repayment of taxes imposed under chapter 297B, a business must pay any taxes required to be repaid to the motor vehicle registrar, as agent for the commissioner of revenue, within 30 days after becoming subject to repayment under this section.\n(c) For the repayment of property taxes, the county auditor shall prepare a tax statement for the business, applying the applicable tax extension rates for each payable year and provide a copy to the business and to the taxpayer of record. The business must pay the taxes to the county treasurer within 30 days after receipt of the tax statement. The business or the taxpayer of record may appeal the valuation and determination of the property tax to the Tax Court within 30 days after receipt of the tax statement.\n(d) The provisions of chapters 270C and 289A relating to the commissioner's authority to audit, assess, and collect the tax and to hear appeals are applicable to the repayment required under paragraphs (a) and (b). The commissioner may impose civil penalties as provided in chapter 289A, and the additional tax and penalties are subject to interest at the rate provided in section 270C.40. The additional tax shall bear interest from 30 days after becoming subject to repayment under this section until the date the tax is paid. Any penalty imposed pursuant to this section shall bear interest from the date provided in section 270C.40, subdivision 3, to the date of payment of the penalty.\n(e) If a property tax is not repaid under paragraph (c), the county treasurer shall add the amount required to be repaid to the property taxes assessed against the property for payment in the year following the year in which the auditor provided the statement under paragraph (c).\n(f) For determining the tax required to be repaid, a reduction of a state or local sales or use tax is deemed to have been received on the date that the good or service was purchased or first put to a taxable use. In the case of an income tax or franchise tax, including the credit payable under section 469.318, a reduction of tax is deemed to have been received for the two most recent tax years that have ended prior to the date that the business became subject to repayment under this section. In the case of a property tax, a reduction of tax is deemed to have been received for the taxes payable in the year that the business became subject to repayment under this section and for the taxes payable in the prior year.\n(g) The commissioner may assess the repayment of taxes under paragraph (d) any time within two years after the business becomes subject to repayment under subdivision 1, or within any period of limitations for the assessment of tax under sections 289A.38 to 289A.382, whichever period is later. The county auditor may send the statement under paragraph (c) any time within three years after the business becomes subject to repayment under subdivision 1.\n(h) A business is not entitled to any income tax or franchise tax benefits, including refundable credits, for any part of the year in which the business becomes subject to repayment under this section nor for any year thereafter. Property is not exempt from tax under section 272.02, subdivision 64, for any taxes payable in the year following the year in which the property became subject to repayment under this section nor for any year thereafter. A business is not eligible for any sales tax benefits beginning with goods or services purchased or first put to a taxable use on the day that the business becomes subject to repayment under this section.\n(a) The commissioner may waive all or part of a repayment required under subdivision 1, if the commissioner, in consultation with the commissioner of employment and economic development and appropriate officials from the local government units in which the qualified business is located, determines that requiring repayment of the tax is not in the best interest of the state or the local government units and the business ceased operating as a result of circumstances beyond its control including, but not limited to:\n(1) a natural disaster;\n(2) unforeseen industry trends; or\n(3) loss of a major supplier or customer.\n(b)(1) The commissioner shall waive repayment required under subdivision 1a if the commissioner has waived repayment by the operating business under subdivision 1, unless the person that received benefits without having to operate a business in the zone was a contributing factor in the qualified business becoming subject to repayment under subdivision 1;\n(2) the commissioner shall waive the repayment required under subdivision 1a, even if the repayment has not been waived for the operating business if:\n(i) the person that received benefits without having to operate a business in the zone and the business that operated in the zone are not related parties as defined in section 267(b) of the Internal Revenue Code of 1986, as amended through December 31, 2007; and\n(ii) actions of the person were not a contributing factor in the qualified business becoming subject to repayment under subdivision 1.\n(c) Requests for waiver must be made no later than 60 days after the earlier of the notice date of an order issued under subdivision 4, paragraph (d), or the date of a tax statement issued under subdivision 4, paragraph (c). For purposes of this section, \"notice date\" means the notice date designated by the commissioner on the order.\nWhere this section is inconsistent with section 116J.994, subdivision 3, paragraph (e), or 6, or any other provisions of sections 116J.993 to 116J.995, this section prevails.",
	"repealed": false
}