{
	"id": "3.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.153",
	"title": "3.153 LEGISLATIVE SUBPOENAS.",
	"text": "A joint legislative commission established by law and composed exclusively of legislators or a standing or interim legislative committee, by a two-thirds vote of its members, may request the issuance of subpoenas, including subpoenas duces tecum, requiring the appearance of persons, production of relevant records, and the giving of relevant testimony. Subpoenas shall be issued by the chief clerk of the house of representatives or the secretary of the senate upon receipt of the request. A person subpoenaed to attend a meeting of the legislature or a hearing of a legislative committee or commission shall receive the same fees and expenses provided by law for witnesses in district court.\nService of a subpoena authorized by this section shall be made in the manner provided for the service of subpoenas in civil actions at least seven days before the date fixed in the subpoena for appearance or production of records unless a shorter period is authorized by a majority vote of all the members of the committee or commission.\nAny person served with a subpoena may choose to be accompanied by counsel if a personal appearance is required and shall be served with a notice to that effect. The person shall also be served with a copy of the resolution or statute establishing the committee or commission and a general statement of the subject matter of the commission or committee's investigation or inquiry.\nTo carry out the authority granted by this section, a committee or commission authorized by subdivision 1 to request the issuance of subpoenas may, by a two-thirds vote of its members, request the issuance of an attachment to compel the attendance of a witness who, having been duly subpoenaed to attend, fails to do so. The chief clerk of the house of representatives or the secretary of the senate upon receipt of the request shall apply to the district court in Ramsey County for issuance of the attachment.\nAny person who without lawful excuse fails to respond to a subpoena issued under this section or who, having been subpoenaed, willfully refuses to be sworn or affirm or to answer any material or proper question before a committee or commission is guilty of a misdemeanor.",
	"repealed": false
}