{
	"id": "473.4057",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4057",
	"title": "473.4057 COMMUTER RAIL OPERATION AND MAINTENANCE.",
	"text": "Notwithstanding the provisions of sections 174.82 and 174.90, the Metropolitan Council must operate and maintain commuter rail facilities and services in any corridor that is located in whole or in part in the metropolitan area. The council's operation and maintenance of the facilities and services must commence upon completion of the planning, development, and construction of the commuter rail facilities by the commissioner of transportation and the commencement of prerevenue service.\nThe council is authorized to acquire equipment, supplies, and materials, including rolling stock, necessary for any commuter rail service that is subject to this section. This authority may be exercised either before or after the commencement of revenue service on a particular commuter rail line.\nAfter the commencement of revenue service in a particular commuter rail corridor, the council is responsible for planning, development, design, acquisition, construction, and equipping of any improvements to commuter rail facilities or service in that corridor.\n(a) Notwithstanding the provisions of section 471.345, for purchases related to the council's maintenance and operation of commuter rail lines, the council may award a contract for the purchase of supplies, materials, equipment or the rental thereof, or the construction, alteration, improvement, repair, or maintenance of real or personal property to the vendor or contractor offering the best value under a request for proposals.\n(b) For the purposes of this section, \"best value\" describes a result intended in the acquisition of goods and services described in paragraph (a). Price must be one of the evaluation criteria when acquiring such goods and services. Other evaluation criteria may include, but are not limited to, environmental considerations, quality, and vendor performance. A best value determination must be based on the evaluation criteria detailed in the solicitation document. If criteria other than price are used, the solicitation document must state the relative importance of price and other factors.\nPrior to commencement of prerevenue service for a commuter rail line that is subject to this section, the commissioner of transportation must either:\n(1) convey ownership; or\n(2) provide a right of use through lease, license, assignment, right of access, or other appropriate document;\nto the council for all property rights, use rights, and facilities acquired or constructed by the state of Minnesota or the commissioner in developing the commuter rail line and needed by the council to operate and maintain the line and the commuter rail service.\nThe council may enter into memoranda of understanding, joint powers agreements, or other agreements with public or private entities including, without limitation, political subdivisions, regional railroad authorities, metropolitan planning organizations, joint powers boards, the commissioner of transportation, or railroads, to carry out its responsibilities under this section.\nIn carrying out its responsibilities under this section and notwithstanding any other law to the contrary, the council may expend funds and exercise, both inside and outside the metropolitan area, those powers in this chapter that are necessary or convenient for those purposes. The jurisdiction of the metropolitan transit police under section 473.405 extends to offenses relating to the operation, property, facilities, equipment, employees, and passengers of any commuter rail facilities and services that are subject to this section.\nExcept for those provisions that provide that the commissioner of transportation is responsible for operating and maintaining commuter rail, the provisions of section 174.82 apply to commuter rail facilities and services that are subject to this section. Without limitation as to its application, the provisions of section 174.82 apply when the council is carrying out its responsibilities for commuter rail under this section to the same extent as those provisions would apply if the council were carrying out its responsibilities under contract to the commissioner.\nA contract entered into under subdivisions 1 to 8 does not affect the rights of employees under the Federal Employers Liability Act or the Railway Labor Act.",
	"repealed": false
}