{
	"id": "72A.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.071",
	"title": "72A.071 REBATES.",
	"text": "Notwithstanding any law to the contrary, insurers and producers are prohibited from knowingly permitting or offering to make or making any life insurance policy or annuity, or policy of accident and sickness insurance, or health plan or other insurance, or agreement as to such contract other than as plainly expressed in the policy issued thereon, or paying or allowing, or giving or offering to pay, allow, or give, directly or indirectly, as inducement to such policy, any rebate of premiums payable on the policy, or any special favor or advantage in the dividends or other benefits thereon, or any valuable consideration or inducement whatever not specified in the policy; or giving, or selling, or purchasing or offering to give, sell, or purchase as inducement to such policy or annuity or in connection therewith, any stocks, bonds or other securities of any company or other corporation, association or partnership, or any dividends or profits accrued thereon, or anything of value whatsoever not specified in the policy.\n(a) Nothing in subdivision 1, section 72A.20, subdivision 8 or 9, or section 72A.12, subdivision 3 or 4, shall be construed as including within the definition of discrimination or rebates any of the following practices:\n(1) in the case of life insurance policies or annuities, paying bonuses to policyholders or otherwise abating their premiums in whole or in part out of surplus accumulated from nonparticipating insurance, provided that any such bonuses or abatement of premiums shall be fair and equitable to policyholders and for the best interests of the company and its policyholders;\n(2) in the case of life insurance policies issued on the industrial debit plan, making allowance to policyholders who have continuously for a specified period made premium payments directly to an office of the insurer in an amount that fairly represents the saving in collection expenses;\n(3) readjusting the rate of premium for a group insurance policy based on the loss or expense thereunder, at the end of the first or any subsequent policy year of insurance thereunder, which may be made retroactive only for such policy year;\n(4) engaging in an arrangement that would not violate United States Code 1972, title 12, section 106, as interpreted by the Board of Governors of the Federal Reserve System, or United States Code, title 12, section 1464(q); or\n(5) the offer or provision by insurers or producers, by or through employees, affiliates, or third-party representatives, of value-added products or services at no or reduced cost when such products or services are not specified in the policy of insurance if the product or service relates to the insurance coverage and is designed to satisfy one or more of the following:\n(i) provide loss mitigation or loss control;\n(ii) reduce claim costs or claim settlement costs;\n(iii) provide education about liability risks or risk of loss to persons or property;\n(iv) monitor or assess risk, identify sources of risk, or develop strategies for eliminating or reducing risk;\n(v) enhance health;\n(vi) enhance financial wellness through items such as education or financial planning services;\n(vii) provide post-loss services;\n(viii) incent behavioral changes to improve the health or reduce the risk of death or disability of a customer, a policyholder, potential policyholder, certificate holder, potential certificate holder, insured, potential insured, or applicant; or\n(ix) assist in the administration of the employee or retiree benefit insurance coverage.\n(b) The cost to the insurer or producer offering the product or service to a customer must be reasonable in comparison to that customer's premiums or insurance coverage for the policy class.\n(c) If the insurer or producer is providing the product or service offered, the insurer or producer must ensure that upon request the customer is provided with contact information to assist the customer with questions regarding the product or service.\n(d) The availability of the value-added product or service must be based on documented objective criteria and offered in a manner that is not unfairly discriminatory. The documented criteria must be maintained by the insurer or producer and produced upon request of the commissioner.\n(e) If an insurer or producer does not have sufficient evidence but has a good-faith belief that the product or service meets the criteria of paragraph (a), clause (5), items (i) through (ix), the insurer or producer may provide the product or service in a manner that is not unfairly discriminatory as part of a pilot or testing program for no more than one year. An insurer or producer must notify the commissioner of such a pilot or testing program offered to consumers in this state prior to launching and may proceed with the program unless the commissioner objects within 45 days of notice.\n(a) An insurer or producer may:\n(1) offer or give noncash gifts, items, or services, including meals to or charitable donations on behalf of a customer, in connection with the marketing, sale, purchase, or retention of contracts of insurance, as long as the cost does not exceed the lesser of five percent of the current or projected policyholder premium or $250 per policy year per term. The offer must be made in a manner that is not unfairly discriminatory. The customer may not be required to purchase, continue to purchase, or renew a policy in exchange for the gift, item, or service;\n(2) offer or give noncash gifts, items, or services including meals to or charitable donations on behalf of a customer, to commercial or institutional customers in connection with the marketing, sale, purchase, or retention of contracts of insurance, as long as the cost is reasonable in comparison to the premium or proposed premium and the cost of the gift or service is not included in any amounts charged to another person or entity. The offer must be made in a manner that is not unfairly discriminatory. The customer may not be required to purchase, continue to purchase, or renew a policy in exchange for the gift, item, or service; and\n(3) conduct raffles or drawings to the extent permitted by state law, as long as there is no financial cost to entrants to participate, the drawing or raffle does not obligate participants to purchase insurance, the prizes do not exceed the lesser of five percent of the current or projected policyholder premium or $500, and the drawing or raffle is open to the public. The raffle or drawing must be offered in a manner that is not unfairly discriminatory. The customer may not be required to purchase, continue to purchase, or renew a policy in exchange for the gift, item, or service.\n(b) An insurer, producer, or representative of either may not offer or provide insurance at no cost as an inducement to the purchase of another policy.",
	"repealed": false
}