{
	"id": "270.074",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.074",
	"title": "270.074 VALUATION OF FLIGHT PROPERTY; METHODS OF APPORTIONMENT; RATIO OF TAX.",
	"text": "The commissioner shall determine the market valuation of all flight property operated or used by every airline company in air commerce in this state. The valuation apportioned to this state of such flight property shall be the proportion of the total valuation thereof determined on the basis of the total of the following percentages:\n(1) 50 percent of the percentage which the number of revenue ton miles of passengers, mail, express and freight flown by the airline company within this state during the preceding calendar year is of the total number of such miles flown by it within and without this state during the preceding calendar year.\n(2) 50 percent of the percentage that the total departures performed by the airline company within this state during the preceding calendar year is of the total departures performed by it within and without this state during the preceding calendar year.\nMS 2016 [Repealed, 1Sp2017 c 1 art 20 s 10]\n(a) The net tax capacity of the flight property of every airline company is 70 percent of the value thereof apportioned to this state under subdivision 1, except that the net tax capacity of quiet aircraft is 40 percent of the value determined under subdivision 1. \"Quiet aircraft\" means turboprops and aircraft defined as stage III or IV by the Federal Aviation Administration. If, in the opinion of the commissioner, other aircraft may be qualified as quiet aircraft, the commissioner may adopt rules providing additional qualifications.\n(b) The flight property of an airline company that owns or leases aircraft the majority of which are turboprops, and which provides, during six months or more of the year that taxes are levied, scheduled passenger service to three or more airports inside or outside of this state that serve small or medium sized communities, shall be assessed at 50 percent of the assessment percentage otherwise set by paragraph (a).",
	"repealed": false
}