{
	"id": "148B.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.50",
	"title": "148B.50 DEFINITIONS.",
	"text": "For the purposes of sections 148B.50 to 148B.593, the following terms have the meanings given.\n\"Approved supervisor\" means a licensed professional counselor, licensed psychologist, or other qualified supervisor as determined by the board, who has four years of professional counseling experience and documents to the board the completion of a training in counseling supervision that included content and experiences relevant to the supervision of professional counselors.\n\"Board\" means the Board of Behavioral Health and Therapy established by section 148B.51.\n\"Licensed professional counseling\" means the application of counseling, human development, and mental health research, principles, and procedures to maintain and enhance the mental health, development, personal and interpersonal effectiveness, and adjustment to work and life of individuals and families.\n(a) The scope of practice of a licensed professional counselor includes, but is not limited to:\n(1) the implementation of professional counseling treatment interventions including evaluation, treatment planning, assessment, and referral;\n(2) direct counseling services to individuals, groups, and families;\n(3) counseling strategies that effectively respond to multicultural populations;\n(4) knowledge of relevant laws and ethics impacting practice;\n(5) crisis intervention;\n(6) consultation; and\n(7) program evaluation and applied research.\n(b) For the purposes of paragraph (a), clause (1), \"professional counseling treatment interventions\" means the application of cognitive, affective, behavioral, systemic, and community counseling strategies which include principles of human development, wellness, and pathology. Counselors provide mental health services for clients whose symptoms significantly interfere with daily functioning and would most likely not improve in a reasonable time period without intervention.\n(c) Licensed professional counseling does not include activities or services undertaken by persons listed in section 148B.592, or the performance of any act that licensed professional counselors are not educated and trained to perform.",
	"repealed": false
}