{
	"id": "156.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.072",
	"title": "156.072 NONRESIDENTS; LICENSES.",
	"text": "A doctor of veterinary medicine duly admitted to practice in any state, commonwealth, territory, or district of the United States or province of Canada desiring permission to practice veterinary medicine in this state shall submit an application to the board upon forms prescribed by the board. Upon proof of licensure to practice in any United States or Canadian jurisdiction and having been actively engaged in practicing veterinary medicine therein, for at least three of the five years next preceding the application, or having been engaged in full time teaching of veterinary medicine in an approved or accredited college for at least three of the five years next preceding the application, or any combination thereof, the national examination in veterinary medicine may be waived, upon the recommendation of the board, and the applicant be admitted to practice without examination. However, the board may impose any other examinations it considers proper.\nSuch doctor of veterinary medicine shall accompany the application by the following:\n(1) a copy of a diploma from an accredited or approved college of veterinary medicine or certification from the dean, registrar, or secretary of an accredited or approved college of veterinary medicine attesting to the applicant's graduation from an accredited or approved college of veterinary medicine, or a certificate of satisfactory completion of the ECFVG or PAVE program;\n(2) affidavits of two licensed practicing doctors of veterinary medicine residing in the United States or Canadian licensing jurisdiction in which the applicant is currently practicing, attesting that they are well acquainted with the applicant, that the applicant is a person of good moral character, and has been actively engaged in practicing or teaching in such jurisdiction for the period above prescribed;\n(3) a certificate from the regulatory agency having jurisdiction over the conduct of practice of veterinary medicine that such applicant is in good standing and is not the subject of disciplinary action or pending disciplinary action;\n(4) a certificate from all other jurisdictions in which the applicant holds a currently active license or held a license within the past ten years, stating that the applicant is and was in good standing and has not been subject to disciplinary action;\n(5) in lieu of clauses (3) and (4), certification from the Veterinary Information Verification Agency that the applicant's licensure is in good standing;\n(6) a fee as set by the board in form of check or money order payable to the board, no part of which shall be refunded should the application be denied;\n(7) score reports on previously taken national examinations in veterinary medicine, certified by the Veterinary Information Verification Agency; and\n(8) if requesting waiver of examination, provide evidence of meeting licensure requirements in the state of the applicant's original licensure that were substantially equal to the requirements for licensure in Minnesota in existence at that time.\nA doctor of veterinary medicine duly admitted to practice in any state, commonwealth, territory, or district of the United States or province of Canada desiring admission to practice in this state but who has not been actively engaged in the practice thereof for at least three of the preceding five years must be examined for admission in accordance with the requirements prescribed herein for those not admitted to practice anywhere.\nMS 1998 [Renumbered 156.073]\nMS 1994 [Renumbered subd 4]",
	"repealed": false
}