{
	"id": "565.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/565.23",
	"title": "565.23 RECOVERY OF POSSESSION AFTER NOTICE AND HEARING.",
	"text": "A claimant seeking to recover possession of property after service of a summons and complaint but prior to final judgment shall proceed by motion. The motion shall be accompanied by an affidavit which states:\n(a) the particular property sought to be recovered by the claimant;\n(b) the facts giving rise to claimant's right to possession, referring to the documents, if any, evidencing the claimant's right to possession and the underlying obligation supporting the right;\n(c) the facts showing that respondent is wrongfully detaining the property;\n(d) if the property being claimed is security for an obligation, the date and the amount of the original obligation, the amount which has been paid by respondent and the amount now owing to claimant;\n(e) if the claimant asserts that the respondent is wrongfully detaining the property by reason of a breach of contractual duty other than the failure to pay money, the claimant shall state the specific contractual provision and the facts relating thereto; and\n(f) a good faith approximation of the current market value of each item of property being claimed. Where the property is inventory, accounts receivable or other property where separate valuation is not practicable, claimant may provide a good faith approximation of the current market value of each category of property.\nThe claimant's motion to recover possession of property together with claimant's affidavit and a notice of hearing shall be served upon respondent in the manner prescribed for service of a summons in a civil action in district court. If the respondent has already appeared in the action, the motion shall be served in the manner prescribed for service of pleadings subsequent to the summons. The date of hearing shall be fixed in accordance with rule 6 of the Minnesota Rules of Civil Procedure, unless a different date is fixed by order of the court.\nThe notice of hearing served upon the respondent shall be signed by the claimant or the attorney for the claimant and shall provide, at a minimum, the following information in substantially the following language:\n\"NOTICE OF HEARING\nTO: [the respondent]\nA hearing will be held on the ......... day of .........., .........., at .......... o'clock, ..M., [place] to determine whether the sheriff shall remove from your possession and deliver to [claimant] (hereinafter \"claimant\") the following property:\n[list property]\nYou have a right to appear at this hearing on your own behalf or with an attorney. You will have the opportunity to present defenses to the claimant's claims and to state reasons why the property described above should not be taken.\nIf the court determines that the claimant has a right to have possession of the property while this lawsuit is pending, you may nevertheless keep the property until the lawsuit is decided if you file with the court a surety bond in the amount of $..........\n[In amount computed pursuant to section 565.25]. This amount is [1-1/4 times the claimant's estimate of the value of the property] [1-1/2 times the claimant's claim against you]. If you believe the [value of the property] [amount of the claim] is overstated, you may ask the court to lower it.\nIf you do not appear at the hearing, the court has authority to issue an order directing that the above described property be immediately taken from your possession.\"\nAfter a hearing, the court shall order seizure of the property from respondent and delivery to claimant if claimant has demonstrated the probability of success on the merits entitling claimant to possession of the property and upon compliance with the bonding requirements set forth in section 565.25, subdivision 1, unless the court makes the following findings:\n(a) respondent has shown a defense to the merits of claimant's claim, the defense is a fair basis for litigation and the defense would, if established at hearing on the merits, entitle respondent to retain possession of the property;\n(b) the interests of respondent cannot be adequately protected by the bond filed by claimant pursuant to section 565.25, subdivision 1, if the property is delivered to the claimant prior to final decision on the merits; and\n(c) the harm suffered by the respondent would be substantially greater than the harm which would be suffered by the claimant if the property were not delivered to the claimant prior to final decision on the merits.\nIf the court makes the findings prescribed by subdivision 3 and orders that respondent may retain possession pending final decision on the merits, the court shall enter a further order protecting the rights of the claimant to the extent possible. The order may require that respondent make partial payment of the debt which may be due and that the payment shall be made either directly to claimant or into an escrow, that respondent post a bond in an amount set by the court, that respondent make the property available for inspection from time to time, that respondent be restrained from certain activities, including, but not limited to, selling, disposing or otherwise encumbering the property, or any other provision the court may deem just and appropriate.\nAn order requiring seizure of property may be stayed up to three days to allow the respondent time to post a bond pursuant to section 565.25, subdivision 2.",
	"repealed": false
}