{
	"id": "216I.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.07",
	"title": "216I.07 APPLICATIONS; STANDARD REVIEW.",
	"text": "An applicant who seeks a site or route permit for which the applicant's proposal is one of the projects identified in this section may follow the procedures under this section in lieu of the procedures under section 216I.06. The applicant must notify the commission at the time the application is submitted which procedure the applicant has elected to follow.\nThe requirements and procedures under this section apply to projects for which the applicant's proposal is:\n(1) large electric power generating plants with a capacity of less than 80 megawatts;\n(2) large electric power generating plants that are fueled by natural gas;\n(3) high-voltage transmission lines with a capacity between 100 and 300 kilovolts;\n(4) high-voltage transmission lines with a capacity in excess of 300 kilovolts and less than 30 miles in length in Minnesota;\n(5) high-voltage transmission lines with a capacity in excess of 300 kilovolts, if at least 80 percent of the distance of the line in Minnesota, as proposed by the applicant, is located along existing high-voltage transmission line right-of-way;\n(6) solar energy systems;\n(7) energy storage systems; and\n(8) large wind energy conversion systems.\n(a) For the projects identified in subdivision 2 and following the procedures under this section, the applicant must prepare and submit an environmental assessment with the application. A draft of the environmental assessment must also be provided to commission staff as part of the preapplication review under section 216I.05, subdivision 6. The environmental assessment must (1) contain information regarding the proposed project's human and environmental impacts, and (2) address mitigating measures for identified impacts. The environmental assessment is the only state environmental review document that must be prepared for the proposed project.\n(b) If after the public meeting the commission identifies other sites or routes or potential impacts for review, the commission must prepare an addendum to the environmental assessment that evaluates (1) the human and environmental impacts of the alternative site or route, and (2) any additional mitigating measures related to the identified impacts consistent with the scoping decision made pursuant to section 216I.06, subdivision 10, clause (2). The public may provide comments on the environmental assessment and any addendum to the environmental assessment at the public hearing and comment period under subdivision 4. When making the commission's final decision, the commission must consider the environmental assessment, the environmental assessment addendum, if any, and the entirety of the record related to human and environmental impacts.\n(a) After the commission issues any environmental assessment addendum and a draft permit under section 216I.05, subdivision 10, the commission must hold a public hearing in the area where the facility's location is proposed.\n(b) The commission must provide notice of the public hearing in the same manner as required under section 216I.06, subdivision 2.\n(c) The commission must conduct the public hearing under procedures established by the commission and may request that an administrative law judge from the Office of Administrative Hearings conduct the hearing and prepare a report.\n(d) The applicant must be present at the hearing to present evidence and to answer questions. The commission must provide opportunity at the public hearing for any person to present comments and to ask questions of the applicant and commission staff. The commission must also provide interested persons an opportunity to submit written comments into the record after the public hearing.\n(a) The commission must make a final decision on an application within 60 days of the date the public comment period following completion of the public hearing closes, or the date the report is filed, whichever is later. A final decision on the request for a site or route permit under this section must be made within six months of the date the commission determines the application is complete. The commission may extend the time limit under this subdivision for up to three months for just cause or upon agreement with the applicant.\n(b) Immediately following the commission's vote granting an applicant a site or route permit, and prior to issuance of a written commission order embodying the decision, the applicant may submit to commission staff for review preconstruction compliance filings specifying details of the applicant's proposed site or route operations.",
	"repealed": false
}