{
	"id": "518.168",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.168",
	"title": "518.168 HEARINGS.",
	"text": "(a) Custody proceedings shall receive priority in being set for hearing.\n(b) The court may tax as costs the payment of necessary travel and other expenses incurred by a person whose presence at the hearing the court deems necessary to determine the best interests of the child.\n(c) The court without a jury shall determine questions of law and fact. If it finds that a public hearing may be detrimental to the child's best interests, the court may exclude the public from a custody hearing, but may admit any person who has a direct interest in the particular case.\n(d) If the court finds it necessary for the protection of the child's welfare that the record of an interview, report, investigation, or testimony in a custody proceeding be kept secret, the court may make an appropriate order sealing the record.\n(e) At the first hearing or at an initial appearance before the court under this chapter, the court shall provide an information sheet to the parties explaining:\n(1) in cases where alternative dispute resolution is required under General Rules of Practice, rule 310.01, that the parties have the choice of using alternative dispute resolution methods including mediation, arbitration, and other processes to resolve the divorce or custody matter;\n(2) how mediation and other available forms of alternative dispute resolution for family law cases work;\n(3) that the parties may choose which method of alternative dispute resolution to use; and\n(4) that the court administrator is able to provide additional information about resources for alternative dispute resolution.\nEach party who is present at the first hearing or at an initial appearance must receive a copy of the information sheet from the court.\n(f) The state court administrator shall prepare an alternative dispute resolution information sheet that the court must use to satisfy the requirements of paragraph (e).",
	"repealed": false
}