{
	"id": "13D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.06",
	"title": "13D.06 CIVIL FINES; FORFEITURE OF OFFICE; OTHER REMEDIES.",
	"text": "Any person who intentionally violates this chapter shall be subject to personal liability in the form of a civil penalty in an amount not to exceed $300 for a single occurrence, which may not be paid by the public body.\nAn action to enforce the penalty in subdivision 1 may be brought by any person in any court of competent jurisdiction where the administrative office of the governing body is located.\n(a) If a person has been found to have intentionally violated this chapter in three or more actions brought under this chapter involving the same governing body, such person shall forfeit any further right to serve on such governing body or in any other capacity with such public body for a period of time equal to the term of office such person was then serving.\n(b) The court determining the merits of any action in connection with any alleged third violation shall receive competent, relevant evidence in connection therewith and, upon finding as to the occurrence of a separate third violation, unrelated to the previous violations, issue its order declaring the position vacant and notify the appointing authority or clerk of the governing body.\n(c) As soon as practicable thereafter the appointing authority or the governing body shall fill the position as in the case of any other vacancy.\n(a) In addition to other remedies, the court may award reasonable costs, disbursements, and reasonable attorney fees of up to $13,000 to any party in an action under this chapter.\n(b) The court may award costs and attorney fees to a defendant only if the court finds that the action under this chapter was frivolous and without merit.\n(c) A public body may pay any costs, disbursements, or attorney fees incurred by or awarded against any of its members in an action under this chapter.\n(d) No monetary penalties or attorney fees may be awarded against a member of a public body unless the court finds that there was an intent to violate this chapter.\n(e) The court shall award reasonable attorney fees to a prevailing plaintiff who has brought an action under this section if the public body that is the defendant in the action was also the subject of a prior written opinion issued under section 13.072, and the court finds that the opinion is directly related to the cause of action being litigated and that the public body did not act in conformity with the opinion. The court shall give deference to the opinion in a proceeding brought under this section.",
	"repealed": false
}