{
	"id": "3.8842",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8842",
	"title": "3.8842 LEGISLATIVE COMMISSION ON MINNESOTA SPORTS FACILITIES.",
	"text": "The Legislative Commission on Minnesota Sports Facilities is established by and under the authority of the Legislative Coordinating Commission to oversee the Minnesota Sports Facilities Authority's operating and capital budgets. The legislature finds that continuous legislative review of the financial management of the authority is necessary to promote fiscal responsibility and good management, and strengthen the accountability of the authority. The commission is charged with:\n(1) providing financial oversight of the authority as described in subdivision 8;\n(2) adoption of a statewide authority structure for the operation and management of sports facilities and entertainment venues under the jurisdiction of the authority. The authority membership shall represent the interests of both the metropolitan area and greater Minnesota; and\n(3) creating a comprehensive management plan that alleviates booking and scheduling concerns regarding the sports facilities and entertainment venues under the jurisdiction of the authority.\nThe commission consists of three senators appointed by the senate majority leader, three senators appointed by the senate minority leader, three state representatives appointed by the speaker of the house, and three state representatives appointed by the house minority leader. The appointing authorities must ensure balanced geographic representation. Each appointing authority must make appointments as soon as possible after the opening of the next regular session of the legislature in each odd-numbered year.\nMembers of the commission serve for a two-year term beginning upon appointment and expiring upon appointment of a successor after the opening of the next regular session of the legislature in the odd-numbered year. A vacancy in the membership of the commission must be filled for the unexpired term in a manner that will preserve the representation established by this section.\nThe commission must meet as soon as practicable after members are appointed in each odd-numbered year to elect its chair and other officers as it may determine necessary. A chair serves a two-year term, expiring in the odd-numbered year after a successor is elected. The chair must alternate biennially between the senate and the house of representatives.\nMembers serve without compensation but may be reimbursed for their reasonable expenses as members of the legislature.\nLegislative staff must provide administrative and research assistance to the commission.\nThe commission meets at least semiannually. If there is a quorum, the commission may take action by a simple majority vote of commission members present.\nThe commission must monitor, review, and make recommendations to the authority and to the legislature for the following calendar year on:\n(1) any proposed increases in the rate or dollar amount of tax;\n(2) any proposed increases in the debt of the authority;\n(3) the overall work and role of the authority;\n(4) the authority's proposed operating and capital budgets;\n(5) the authority's implementation of the operating and capital budgets; and\n(6) any other topics as deemed necessary by the commission to fulfill the purpose described in subdivision 1.\nThe commission shall report on January 15 of the even-numbered year on the effectiveness and future prospects of the commission.",
	"repealed": false
}