{
	"id": "469.002",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.002",
	"title": "469.002 DEFINITIONS.",
	"text": "In sections 469.001 to 469.047, the terms defined in this section have the meanings given to them herein, unless the context indicates a different meaning.\n\"Authority\" means a housing and redevelopment authority created or authorized to be created by sections 469.001 to 469.047.\n\"City\" means a home rule charter or statutory city.\n\"State public body\" means any city, county, commission, district, authority, or other political subdivision or instrumentality of this state.\n\"Governing body\" means the council, board of trustees, or other body charged with governing any state public body.\n\"Mayor\" means the mayor of a city.\n\"Clerk\" means the clerk of a city or the officer of any other state public body charged with the duties customarily imposed on the clerk of a city.\n\"Area of operation\" means, in the case of an authority created in and for a city, county, or group of counties, the area within the territorial boundaries of that city, county, or group of counties.\n\"Federal government\" includes the United States of America, the Department of Housing and Urban Development, or any other department, agency, or instrumentality of the United States of America.\n\"Federal legislation\" includes the United States Housing Act of 1937, United States Code, title 42, sections 1401 to 1440, as amended through December 31, 1998; the National Housing Act, United States Code, title 12, sections 1701 to 1750g, as amended through December 31, 1989; and any other legislation of the Congress of the United States relating to federal assistance for clearance or rehabilitation of substandard or blighted areas, land assembly, redevelopment projects, or housing.\n\"Blighted area\" means any area with buildings or improvements which, by reason of dilapidation, obsolescence, overcrowding, faulty arrangement or design, lack of ventilation, light, and sanitary facilities, excessive land coverage, deleterious land use, or obsolete layout, or any combination of these or other factors, are detrimental to the safety, health, morals, or welfare of the community.\n\"Project\" means a housing project, a housing development project, a workforce housing project, or a redevelopment project, or any combination of those projects. The term \"project\" also may be applied to all real and personal property, assets, cash, or other funds, held or used in connection with the development or operation of the project. The term \"project\" also includes an interest reduction program authorized by section 469.012, subdivision 7.\n\"Housing project\" means any work or undertaking to provide decent, safe, and sanitary dwellings for persons of low income and their families.\nSuch work or undertaking may include acquisition or provision of buildings, land, equipment, facilities, and other real or personal property for necessary, convenient, or desirable appurtenances, streets, sewers, water service, utilities, site preparation, landscaping, administrative, community, health, recreational, welfare, or other purposes.\n\"Housing project\" also includes the planning of the buildings and improvements, the acquisition of property, the demolition or removal of existing structures, the construction, reconstruction, alteration, and repair of the improvements and all other work in connection therewith.\n\"Redevelopment project\" means any work or undertaking:\n(1) to acquire blighted areas and other real property for the purpose of removing, preventing, or reducing blight, blighting factors, or the causes of blight;\n(2) to clear any areas acquired and install, construct or reconstruct streets, utilities, and site improvements essential to the preparation of sites for uses in accordance with the redevelopment plan;\n(3) to sell or lease land so acquired for uses in accordance with the redevelopment plan;\n(4) to prepare a redevelopment plan, and to incur initiation, planning, survey and other administrative costs of a redevelopment project, and to prepare technical and financial plans and arrangements for buildings, structures, and improvements and all other work in connection therewith; or\n(5) to conduct an urban renewal project. The term \"urban renewal project\" may include undertakings and activities for the elimination or for the prevention of the development or spread of slums or blighted or deteriorating areas and may involve any work or undertaking for that purpose constituting a redevelopment project or any rehabilitation or conservation work. For this purpose, \"rehabilitation or conservation work\" may include (i) carrying out plans for a program of voluntary or compulsory repair and rehabilitation of buildings or other improvements; (ii) acquisition of real property and demolition, removal, or rehabilitation of buildings and improvements thereon where necessary to eliminate unhealthful, unsanitary or unsafe conditions, lessen density, reduce traffic hazards, eliminate obsolete or other uses detrimental to the public welfare, or to otherwise remove or prevent the spread of blight or deterioration, to promote historic and architectural preservation, or to provide land for needed public facilities; (iii) installation, construction, or reconstruction of streets, utilities, parks, playgrounds, and other improvements necessary for carrying out the objectives of the urban renewal project; (iv) the disposition, for uses in accordance with the objectives of the urban renewal project, of any property or part thereof acquired in the area of the project; provided that the disposition shall be in the manner prescribed in sections 469.001 to 469.047 for the disposition of property in a redevelopment project area; (v) relocation within or outside the project area of structures that will be restored and maintained for architectural or historic purposes; (vi) restoration of acquired properties of historic or architectural value; and (vii) construction of foundations and platforms necessary for the provision of air rights sites.\nThe term \"redevelopment project\" also means a redevelopment project initiated as then provided by law and approved by the governing body of the city prior to July 1, 1951, as prescribed by Minnesota Statutes 1949, section 462.521.\n\"Housing development project\" means any work or undertaking to provide housing for persons of moderate income and their families. This work or undertaking may include the planning of building and improvements, the acquisition of real property which may be needed immediately or in the future for housing purposes, the construction, reconstruction, alteration and repair of new or existing buildings and the provisions of all equipment, facilities and other real or personal property for necessary, convenient or desirable appurtenances, streets, sewers, water service, utilities, site preparation, landscaping, administrative, community health, recreation or welfare or other purposes.\n\"Redevelopment plan\" means a plan approved by the governing body, or by an agency designated by the governing body for the purpose of approving such plans or authorized by law to do so, of each city in which any of a redevelopment project is to be carried out, which plan provides an outline for the development or redevelopment of the area and is sufficiently complete (1) to indicate its relationship to definite local objectives as to appropriate land uses; and (2) to indicate general land uses and general standards of development or redevelopment.\n\"Persons of low income and their families\" means persons or families who lack a sufficient income to enable them, without financial assistance, to live in decent, safe, and sanitary dwellings, without overcrowding.\n\"Persons of moderate income and their families\" means persons and families whose income is not adequate to cause private enterprise to provide without governmental assistance a substantial supply of decent, safe, and sanitary housing at rents or prices within their financial means.\n\"Bonds\" means any bonds, including refunding bonds, notes, interim certificates, debentures, or other obligations issued by an authority pursuant to sections 469.001 to 469.047.\n\"Real property\" includes all lands, together with improvements and fixtures thereon, and property of any nature appurtenant thereto, or used in connection therewith, and every estate, interest, and right, legal or equitable, therein, including terms for years.\n\"Obligee of the authority\" or \"obligee\" includes any bondholder, and the federal government when it is a party to any contract with the authority.\n\"General plan for the development of the locality as a whole\" means a plan adopted by a local planning agency or approved by the governing body of the city establishing general objectives for the future use of land in a locality, or if no such plan has been adopted or approved, the general land use proposals for the development of the locality established from time to time by the local planning agency or by the governing body of the city.\n\"Veterans\" has the meaning given in section 197.447, except as otherwise defined in a contract with the federal government providing for veterans' preferences, or as may be required by any federal law or regulation as a condition of federal financial assistance for a project.\n\"Section 8 program\" means an existing housing assistance payments program under Section 8 of the United States Housing Act of 1937, United States Code, title 42, section 1437f, as amended.\n(a) \"Workforce housing project\" means any work or undertaking by an authority located in an eligible project area to develop market rate residential rental properties, as defined in section 462A.39, subdivision 2, paragraph (d), or single-family housing, as defined under section 462C.02, subdivision 4.\n(b) For the purposes of this paragraph, \"eligible project area\" means an area that meets the criteria under section 462A.39, subdivisions 2, paragraph (b), and 4, paragraph (a).",
	"repealed": false
}