{
	"id": "150A.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.051",
	"title": "150A.051 DENTIST AND DENTAL HYGIENIST COMPACT.",
	"text": "The dentist and dental hygienist compact is enacted into law and entered into with all other jurisdictions legally joining in the compact in the form substantially specified in this section.\nARTICLE I\nTITLE\nThis statute shall be known and cited as the dentist and dental hygienist compact.\nARTICLE II\nDEFINITIONS\nAs used in this compact, unless the context requires otherwise, the following definitions shall apply:\n(A) \"Active military member\" means any person with full-time duty status in the armed forces of the United States including members of the National Guard and Reserve.\n(B) \"Adverse action\" means disciplinary action or encumbrance imposed on a license or compact privilege by a state licensing authority.\n(C) \"Alternative program\" means a nondisciplinary monitoring or practice remediation process applicable to a dentist or dental hygienist approved by a state licensing authority of a participating state in which the dentist or dental hygienist is licensed. This includes but is not limited to programs to which licensees with substance abuse or addiction issues are referred in lieu of adverse action.\n(D) \"Clinical assessment\" means examination or process, required for licensure as a dentist or dental hygienist as applicable, that provides evidence of clinical competence in dentistry or dental hygiene.\n(E) \"Commissioner\" means the individual appointed by a participating state to serve as the member of the commission for that participating state.\n(F) \"Compact\" means this dentist and dental hygienist compact.\n(G) \"Compact privilege\" means the authorization granted by a remote state to allow a licensee from a participating state to practice as a dentist or dental hygienist in a remote state.\n(H) \"Continuing professional development\" means a requirement as a condition of license renewal to provide evidence of successful participation in educational or professional activities relevant to practice or area of work.\n(I) \"Criminal background check\" means the submission of fingerprints or other biometric-based information for a license applicant for the purpose of obtaining that applicant's criminal history record information, as defined in Code of Federal Regulations, title 28, section 20.3(d), from the Federal Bureau of Investigation and the state's criminal history record repository as defined in Code of Federal Regulations, title 28, section 20.3(f).\n(J) \"Data system\" means the commission's repository of information about licensees, including but not limited to examination, licensure, investigative, compact privilege, adverse action, and alternative program.\n(K) \"Dental hygienist\" means an individual who is licensed by a state licensing authority to practice dental hygiene.\n(L) \"Dentist\" means an individual who is licensed by a state licensing authority to practice dentistry.\n(M) \"Dentist and dental hygienist compact commission\" or \"commission\" means a joint government agency established by this compact comprised of each state that has enacted the compact and a national administrative body comprised of a commissioner from each state that has enacted the compact.\n(N) \"Encumbered license\" means a license that a state licensing authority has limited in any way other than through an alternative program.\n(O) \"Executive board\" means the chair, vice chair, secretary, and treasurer and any other commissioners as may be determined by commission rule or bylaw.\n(P) \"Jurisprudence requirement\" means the assessment of an individual's knowledge of the laws and rules governing the practice of dentistry or dental hygiene, as applicable, in a state.\n(Q) \"License\" means current authorization by a state, other than authorization pursuant to a compact privilege, or other privilege, for an individual to practice as a dentist or dental hygienist in that state.\n(R) \"Licensee\" means an individual who holds an unrestricted license from a participating state to practice as a dentist or dental hygienist in that state.\n(S) \"Model compact\" means the model for the dentist and dental hygienist compact on file with the council of state governments or other entity as designated by the commission.\n(T) \"Participating state\" means a state that has enacted the compact and been admitted to the commission in accordance with the provisions herein and commission rules.\n(U) \"Qualifying license\" means a license that is not an encumbered license issued by a participating state to practice dentistry or dental hygiene.\n(V) \"Remote state\" means a participating state where a licensee who is not licensed as a dentist or dental hygienist is exercising or seeking to exercise the compact privilege.\n(W) \"Rule\" means a regulation promulgated by an entity that has the force of law.\n(X) \"Scope of practice\" means the procedures, actions, and processes a dentist or dental hygienist licensed in a state is permitted to undertake in that state and the circumstances under which the licensee is permitted to undertake those procedures, actions, and processes. Such procedures, actions, and processes and the circumstances under which they may be undertaken may be established through means, including but not limited to statute, regulations, case law, and other processes available to the state licensing authority or other government agency.\n(Y) \"Significant investigative information\" means information, records, and documents received or generated by a state licensing authority pursuant to an investigation for which a determination has been made that there is probable cause to believe that the licensee has violated a statute or regulation that is considered more than a minor infraction for which the state licensing authority could pursue adverse action against the licensee.\n(Z) \"State\" means any state, commonwealth, district, or territory of the United States of America that regulates the practices of dentistry and dental hygiene.\n(AA) \"State licensing authority\" means an agency or other entity of a state that is responsible for the licensing and regulation of dentists or dental hygienists.\nARTICLE III\nSTATE PARTICIPATION IN THE COMPACT\n(A) In order to join the compact and thereafter continue as a participating state, a state must:\n(1) enact a compact that is not materially different from the model compact as determined in accordance with commission rules;\n(2) participate fully in the commission's data system;\n(3) have a mechanism in place for receiving and investigating complaints about its licensees and license applicants;\n(4) notify the commission, in compliance with the terms of the compact and commission rules, of any adverse action or the availability of significant investigative information regarding a licensee and license applicant;\n(5) fully implement a criminal background check requirement, within a time frame established by commission rule, by receiving the results of a qualifying criminal background check;\n(6) comply with the commission rules applicable to a participating state;\n(7) accept the national board examinations of the joint commission on national dental examinations or another examination accepted by commission rule as a licensure examination;\n(8) accept for licensure that applicants for a dentist license graduate from a predoctoral dental education program accredited by the Commission on Dental Accreditation, or another accrediting agency recognized by the United States Department of Education for the accreditation of dentistry and dental hygiene education programs, leading to the Doctor of Dental Surgery (D.D.S.) or Doctor of Dental Medicine (D.M.D.) degree;\n(9) accept for licensure that applicants for a dental hygienist license graduate from a dental hygiene education program accredited by the Commission on Dental Accreditation or another accrediting agency recognized by the United States Department of Education for the accreditation of dentistry and dental hygiene education programs;\n(10) require for licensure that applicants successfully complete a clinical assessment;\n(11) have continuing professional development requirements as a condition for license renewal; and\n(12) pay a participation fee to the commission as established by commission rule.\n(B) Providing alternative pathways for an individual to obtain an unrestricted license does not disqualify a state from participating in the compact.\n(C) When conducting a criminal background check, the state licensing authority shall:\n(1) consider that information in making a licensure decision;\n(2) maintain documentation of completion of the criminal background check and background check information to the extent allowed by state and federal law; and\n(3) report to the commission whether it has completed the criminal background check and whether the individual was granted or denied a license.\n(D) A licensee of a participating state who has a qualifying license in that state and does not hold an encumbered license in any other participating state, shall be issued a compact privilege in a remote state in accordance with the terms of the compact and commission rules. If a remote state has a jurisprudence requirement a compact privilege will not be issued to the licensee unless the licensee has satisfied the jurisprudence requirement.\nARTICLE IV\nCOMPACT PRIVILEGE\n(A) To obtain and exercise the compact privilege under the terms and provisions of the compact, the licensee shall:\n(1) have a qualifying license as a dentist or dental hygienist in a participating state;\n(2) be eligible for a compact privilege in any remote state in accordance with (D), (G), and (H) of this article;\n(3) submit to an application process whenever the licensee is seeking a compact privilege;\n(4) pay any applicable commission and remote state fees for a compact privilege in the remote state;\n(5) meet any jurisprudence requirement established by a remote state in which the licensee is seeking a compact privilege;\n(6) have passed a National Board Examination of the Joint Commission on National Dental Examinations or another examination accepted by commission rule;\n(7) for a dentist, have graduated from a predoctoral dental education program accredited by the Commission on Dental Accreditation, or another accrediting agency recognized by the United States Department of Education for the accreditation of dentistry and dental hygiene education programs, leading to the Doctor of Dental Surgery (D.D.S.) or Doctor of Dental Medicine (D.M.D.) degree;\n(8) for a dental hygienist, have graduated from a dental hygiene education program accredited by the Commission on Dental Accreditation or another accrediting agency recognized by the United States Department of Education for the accreditation of dentistry and dental hygiene education programs;\n(9) have successfully completed a clinical assessment for licensure;\n(10) report to the commission adverse action taken by any nonparticipating state when applying for a compact privilege and, otherwise, within 30 days from the date the adverse action is taken;\n(11) report to the commission when applying for a compact privilege the address of the licensee's primary residence and thereafter immediately report to the commission any change in the address of the licensee's primary residence; and\n(12) consent to accept service of process by mail at the licensee's primary residence on record with the commission with respect to any action brought against the licensee by the commission or a participating state, and consent to accept service of a subpoena by mail at the licensee's primary residence on record with the commission with respect to any action brought or investigation conducted by the commission or a participating state.\n(B) The licensee must comply with the requirements of (A) of this article to maintain the compact privilege in the remote state. If those requirements are met, the compact privilege will continue as long as the licensee maintains a qualifying license in the state through which the licensee applied for the compact privilege and pays any applicable compact privilege renewal fees.\n(C) A licensee providing dentistry or dental hygiene in a remote state under the compact privilege shall function within the scope of practice authorized by the remote state for a dentist or dental hygienist licensed in that state.\n(D) A licensee providing dentistry or dental hygiene pursuant to a compact privilege in a remote state is subject to that state's regulatory authority. A remote state may, in accordance with due process and that state's laws, by adverse action revoke or remove a licensee's compact privilege in the remote state for a specific period of time and impose fines or take any other necessary actions to protect the health and safety of its citizens. If a remote state imposes an adverse action against a compact privilege that limits the compact privilege, that adverse action applies to all compact privileges in all remote states. A licensee whose compact privilege in a remote state is removed for a specified period of time is not eligible for a compact privilege in any other remote state until the specific time for removal of the compact privilege has passed and all encumbrance requirements are satisfied.\n(E) If a license in a participating state is an encumbered license, the licensee shall lose the compact privilege in a remote state and shall not be eligible for a compact privilege in any remote state until the license is no longer encumbered.\n(F) Once an encumbered license in a participating state is restored to good standing, the licensee must meet the requirements of (A) of this article to obtain a compact privilege in a remote state.\n(G) If a licensee's compact privilege in a remote state is removed by the remote state, the individual shall lose or be ineligible for the compact privilege in any remote state until the following occur:\n(1) the specific period of time for which the compact privilege was removed has ended; and\n(2) all conditions for removal of the compact privilege have been satisfied.\n(H) Once the requirements of (G) of this article have been met, the licensee must meet the requirements in (A) of this article to obtain a compact privilege in a remote state.\nARTICLE V\nACTIVE MILITARY MEMBER OR THEIR SPOUSES\nAn active military member and their spouse shall not be required to pay to the commission for a compact privilege the fee otherwise charged by the commission. If a remote state chooses to charge a fee for a compact privilege, it may choose to charge a reduced fee or no fee to an active military member and their spouse for a compact privilege.\nARTICLE VI\nADVERSE ACTIONS\n(A) A participating state in which a licensee is licensed shall have exclusive authority to impose adverse action against the qualifying license issued by that participating state.\n(B) A participating state may take adverse action based on the significant investigative information of a remote state, so long as the participating state follows its own procedures for imposing adverse action.\n(C) Nothing in this compact shall override a participating state's decision that participation in an alternative program may be used in lieu of adverse action and that such participation shall remain nonpublic if required by the participating state's laws. Participating states must require licensees who enter any alternative program in lieu of discipline to agree not to practice pursuant to a compact privilege in any other participating state during the term of the alternative program without prior authorization from such other participating state.\n(D) Any participating state in which a licensee is applying to practice or is practicing pursuant to a compact privilege may investigate actual or alleged violations of the statutes and regulations authorizing the practice of dentistry or dental hygiene in any other participating state in which the dentist or dental hygienist holds a license or compact privilege.\n(E) A remote state shall have the authority to:\n(1) take adverse actions as set forth in article IV, (D), against a licensee's compact privilege in the state;\n(2) in furtherance of its rights and responsibilities under the compact and the commission's rules issue subpoenas for both hearings and investigations that require the attendance and testimony of witnesses, and the production of evidence. Subpoenas issued by a state licensing authority in a participating state for the attendance and testimony of witnesses, or the production of evidence from another participating state, shall be enforced in the latter state by any court of competent jurisdiction, according to the practice and procedure of that court applicable to subpoenas issued in proceedings pending before it. The issuing authority shall pay any witness fees, travel expenses, mileage, and other fees required by the service statutes of the state where the witnesses or evidence are located; and\n(3) if otherwise permitted by state law, recover from the licensee the costs of investigations and disposition of cases resulting from any adverse action taken against that licensee.\n(F) Joint Investigations:\n(1) In addition to the authority granted to a participating state by its dentist or dental hygienist licensure act or other applicable state law, a participating state may jointly investigate licensees with other participating states.\n(2) Participating states shall share any significant investigative information, litigation, or compliance materials in furtherance of any joint or individual investigation initiated under the compact.\n(G) Authority to Continue Investigation:\n(1) After a licensee's compact privilege in a remote state is terminated, the remote state may continue an investigation of the licensee that began when the licensee had a compact privilege in that remote state.\n(2) If the investigation yields what would be significant investigative information had the licensee continued to have a compact privilege in that remote state, the remote state shall report the presence of such information to the data system as required by article VIII, (B), (6), as if it was significant investigative information.\nARTICLE VII\nESTABLISHMENT AND OPERATION OF THE COMMISSION\n(A) The compact participating states hereby create and establish a joint government agency whose membership consists of all participating states that have enacted the compact. The commission is an instrumentality of the participating states acting jointly and not an instrumentality of any one state. The commission shall come into existence on or after the effective date of the compact as set forth in article XI, (A).\n(B) Participation, Voting, and Meetings:\n(1) Each participating state shall have and be limited to one commissioner selected by that participating state's state licensing authority or, if the state has more than one state licensing authority, selected collectively by the state licensing authorities.\n(2) The commissioner shall be a member or designee of such authority or authorities.\n(3) The commission may by rule or bylaw establish a term of office for commissioners and may by rule or bylaw establish term limits.\n(4) The commission may recommend to a state licensing authority or authorities, as applicable, removal or suspension of an individual as the state's commissioner.\n(5) A participating state's state licensing authority or authorities, as applicable, shall fill any vacancy of its commissioner on the commission within 60 days of the vacancy.\n(6) Each commissioner shall be entitled to one vote on all matters that are voted upon by the commission.\n(7) The commission shall meet at least once during each calendar year. Additional meetings may be held as set forth in the bylaws. The commission may meet by telecommunication, video conference, or other similar electronic means.\n(C) The commission shall have the following powers:\n(1) establish the fiscal year of the commission;\n(2) establish a code of conduct and conflict of interest policies;\n(3) adopt rules and bylaws;\n(4) maintain its financial records in accordance with the bylaws;\n(5) meet and take such actions as are consistent with the provisions of this compact, the commission's rules, and the bylaws;\n(6) initiate and conclude legal proceedings or actions in the name of the commission, provided that the standing of any state licensing authority to sue or be sued under applicable law shall not be affected;\n(7) maintain and certify records and information provided to a participating state as the authenticated business records of the commission, and designate a person to do so on the commission's behalf;\n(8) purchase and maintain insurance and bonds;\n(9) borrow, accept, or contract for services of personnel, including but not limited to employees of a participating state;\n(10) conduct an annual financial review;\n(11) hire employees, elect or appoint officers, fix compensation, define duties, grant such individuals appropriate authority to carry out the purposes of the compact, and establish the commission's personnel policies and programs relating to conflicts of interest, qualifications of personnel, and other related personnel matters;\n(12) as set forth in the commission rules, charge a fee to a licensee for the grant of a compact privilege in a remote state and thereafter, as may be established by commission rule, charge the licensee a compact privilege renewal fee for each renewal period in which that licensee exercises or intends to exercise the compact privilege in that remote state. Nothing herein shall be construed to prevent a remote state from charging a licensee a fee for a compact privilege or renewals of a compact privilege, or a fee for the jurisprudence requirement if the remote state imposes such a requirement for the grant of a compact privilege;\n(13) accept any and all appropriate gifts, donations, grants of money, other sources of revenue, equipment, supplies, materials, and services, and receive, utilize, and dispose of the same; provided that at all times the commission shall avoid any appearance of impropriety and conflict of interest;\n(14) lease, purchase, retain, own, hold, improve, or use any property real, personal, or mixed, or any undivided interest therein;\n(15) sell, convey, mortgage, pledge, lease, exchange, abandon, or otherwise dispose of any property real, personal, or mixed;\n(16) establish a budget and make expenditures;\n(17) borrow money;\n(18) appoint committees, including standing committees, which may be composed of members, state regulators, state legislators or their representatives, and consumer representatives, and such other interested persons as may be designated in this compact and the bylaws;\n(19) provide and receive information from, and cooperate with, law enforcement agencies;\n(20) elect a chair, vice chair, secretary, and treasurer and such other officers of the commission as provided in the commission's bylaws;\n(21) establish and elect an executive board;\n(22) adopt and provide to the participating states an annual report;\n(23) determine whether a state's enacted compact is materially different from the model compact language such that the state would not qualify for participation in the compact; and\n(24) perform such other functions as may be necessary or appropriate to achieve the purposes of this compact.\n(D) Meetings of the Commission:\n(1) All meetings of the commission that are not closed pursuant to (D)(4) of this article shall be open to the public. Notice of public meetings shall be posted on the commission's website at least 30 days prior to the public meeting.\n(2) Notwithstanding (D)(1) of this article, the commission may convene an emergency public meeting by providing at least 24 hours prior notice on the commission's website, and any other means as provided in the commission's rules, for any of the reasons it may dispense with notice of proposed rulemaking under article IX, (L). The commission's legal counsel shall certify that one of the reasons justifying an emergency public meeting has been met.\n(3) Notice of all commission meetings shall provide the time, date, and location of the meeting, and if the meeting is to be held or accessible via telecommunication, video conference, or other electronic means, the notice shall include the mechanism for access to the meeting through such means.\n(4) The commission may convene in a closed, nonpublic meeting for the commission to receive legal advice or to discuss:\n(i) noncompliance of a participating state with its obligations under the compact;\n(ii) the employment, compensation, discipline, or other matters, practices, or procedures related to specific employees or other matters related to the commission's internal personnel practices and procedures;\n(iii) current or threatened discipline of a licensee or compact privilege holder by the commission or by a participating state's licensing authority;\n(iv) current, threatened, or reasonably anticipated litigation;\n(v) negotiation of contracts for the purchase, lease, or sale of goods, services, or real estate;\n(vi) accusing any person of a crime or formally censuring any person;\n(vii) trade secrets or commercial or financial information that is privileged or confidential;\n(viii) information of a personal nature where disclosure would constitute a clearly unwarranted invasion of personal privacy;\n(ix) investigative records compiled for law enforcement purposes;\n(x) information related to any investigative reports prepared by or on behalf of or for use of the commission or other committee charged with responsibility of investigation or determination of compliance issues pursuant to the compact;\n(xi) legal advice;\n(xii) matters specifically exempted from disclosure to the public by federal or participating state law; and\n(xiii) other matters as promulgated by the commission by rule.\n(5) If a meeting, or portion of a meeting, is closed, the presiding officer shall state that the meeting will be closed and reference each relevant exempting provision, and such reference shall be recorded in the minutes.\n(6) The commission shall keep minutes that fully and clearly describe all matters discussed in a meeting and shall provide a full and accurate summary of actions taken, and the reasons therefore, including a description of the views expressed. All documents considered in connection with an action shall be identified in such minutes. All minutes and documents of a closed meeting shall remain under seal, subject to release only by a majority vote of the commission or order of a court of competent jurisdiction.\n(E) Financing of the Commission:\n(1) The commission shall pay, or provide for the payment of, the reasonable expenses of its establishment, organization, and ongoing activities.\n(2) The commission may accept any and all appropriate sources of revenue, donations, and grants of money, equipment, supplies, materials, and services.\n(3) The commission may levy on and collect an annual assessment from each participating state and impose fees on licensees of participating states when a compact privilege is granted to cover the cost of the operations and activities of the commission and its staff, which must be in a total amount sufficient to cover its annual budget as approved each fiscal year for which sufficient revenue is not provided by other sources. The aggregate annual assessment amount for participating states shall be allocated based upon a formula that the commission shall promulgate by rule.\n(4) The commission shall not incur obligations of any kind prior to securing the funds adequate to meet the same; nor shall the commission pledge the credit of any participating state, except by and with the authority of the participating state.\n(5) The commission shall keep accurate accounts of all receipts and disbursements. The receipts and disbursements of the commission shall be subject to the financial review and accounting procedures established under the commission's bylaws. All receipts and disbursements of funds handled by the commission shall be subject to an annual financial review by a certified or licensed public accountant, and the report of the financial review shall be included in and become part of the annual report of the commission.\n(F) The Executive Board:\n(1) The executive board shall have the power to act on behalf of the commission according to the terms of this compact. The powers, duties, and responsibilities of the executive board shall include:\n(i) overseeing the day-to-day activities of the administration of the compact including compliance with the provisions of the compact and the commission's rules and bylaws;\n(ii) recommending to the commission changes to the rules or bylaws, changes to this compact legislation, fees charged to compact participating states, fees charged to licensees, and other fees;\n(iii) ensuring compact administration services are appropriately provided, including by contract;\n(iv) preparing and recommending the budget;\n(v) maintaining financial records on behalf of the commission;\n(vi) monitoring compact compliance of participating states and providing compliance reports to the commission;\n(vii) establishing additional committees as necessary;\n(viii) exercising the powers and duties of the commission during the interim between commission meetings, except for adopting or amending rules, adopting or amending bylaws, and exercising any other powers and duties expressly reserved to the commission by rule or bylaw; and\n(ix) other duties as provided in the rules or bylaws of the commission.\n(2) The executive board shall be composed of up to seven members:\n(i) the chair, vice chair, secretary, and treasurer of the commission and any other members of the commission who serve on the executive board shall be voting members of the executive board; and\n(ii) other than the chair, vice chair, secretary, and treasurer, the commission may elect up to three voting members from the current membership of the commission.\n(3) The commission may remove any member of the executive board as provided in the commission's bylaws.\n(4) The executive board shall meet at least annually.\n(i) An executive board meeting at which it takes or intends to take formal action on a matter shall be open to the public, except that the executive board may meet in a closed, nonpublic session of a public meeting when dealing with any of the matters covered under (D)(4) of this article.\n(ii) The executive board shall give five business days' notice of its public meetings, posted on its website and as it may otherwise determine to provide notice to persons with an interest in the public matters the executive board intends to address at those meetings.\n(5) The executive board may hold an emergency meeting when acting for the commission to:\n(i) meet an imminent threat to public health, safety, or welfare;\n(ii) prevent a loss of commission or participating state funds; or\n(iii) protect public health and safety.\n(G) Qualified Immunity, Defense, and Indemnification:\n(1) The members, officers, executive director, employees, and representatives of the commission shall be immune from suit and liability, both personally and in their official capacity, for any claim for damage to or loss of property or personal injury or other civil liability caused by or arising out of any actual or alleged act, error, or omission that occurred, or that the person against whom the claim is made had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities; provided that nothing in this paragraph shall be construed to protect any such person from suit or liability for any damage, loss, injury, or liability caused by the intentional or willful or wanton misconduct of that person. The procurement of insurance of any type by the commission shall not in any way compromise or limit the immunity granted hereunder.\n(2) The commission shall defend any member, officer, executive director, employee, or representative of the commission in any civil action seeking to impose liability arising out of any actual or alleged act, error, or omission that occurred within the scope of commission employment, duties, or responsibilities, or as determined by the commission that the person against whom the claim is made had a reasonable basis for believing occurred within the scope of commission employment, duties, or responsibilities; provided that nothing herein shall be construed to prohibit that person from retaining their own counsel at their own expense; and provided further that the actual or alleged act, error, or omission did not result from that person's intentional or willful or wanton misconduct.\n(3) Notwithstanding (G)(1) of this article, should any member, officer, executive director, employee, or representative of the commission be held liable for the amount of any settlement or judgment arising out of any actual or alleged act, error, or omission that occurred within the scope of that individual's employment, duties, or responsibilities for the commission, or that the person to whom that individual is liable had a reasonable basis for believing occurred within the scope of the individual's employment, duties, or responsibilities for the commission, the commission shall indemnify and hold harmless such individual; provided that the actual or alleged act, error, or omission did not result from the intentional or willful or wanton misconduct of the individual.\n(4) Nothing herein shall be construed as a limitation on the liability of any licensee for professional malpractice or misconduct, which shall be governed solely by any other applicable state laws.\n(5) Nothing in this compact shall be interpreted to waive or otherwise abrogate a participating state's state action immunity or state action affirmative defense with respect to antitrust claims under the Sherman Act, Clayton Act, or any other state or federal antitrust or anticompetitive law or regulation.\n(6) Nothing in this compact shall be construed to be a waiver of sovereign immunity by the participating states or by the commission.\n(H) Notwithstanding paragraph (G), clause (1), of this article, the liability of the executive director, employees, or representatives of the interstate commission, acting within the scope of their employment or duties, may not exceed the limits of liability set forth under the constitution and laws of this state for state officials, employees, and agents. This paragraph expressly incorporates section 3.736, and neither expands nor limits the rights and remedies provided under that statute.\n(I) Except for a claim alleging a violation of this compact, a claim against the commission, its executive director, employees, or representatives alleging a violation of the constitution and laws of this state may be brought in any county where the plaintiff resides. Nothing in this paragraph creates a private right of action.\n(J) Nothing in this compact shall be construed as a limitation on the liability of any licensee for professional malpractice or misconduct, which shall be governed solely by any other applicable state laws.\nARTICLE VIII\nDATA SYSTEM\n(A) The commission shall provide for the development, maintenance, operation, and utilization of a coordinated database and reporting system containing licensure, adverse action, and the presence of significant investigative information on all licensees and applicants for a license in participating states.\n(B) Notwithstanding any other provision of state law to the contrary, a participating state shall submit a uniform data set to the data system on all individuals to whom this compact is applicable as required by the rules of the commission, including:\n(1) identifying information;\n(2) licensure data;\n(3) adverse actions against a licensee, license applicant, or compact privilege and information related thereto;\n(4) nonconfidential information related to alternative program participation, the beginning and ending dates of such participation, and other information related to such participation;\n(5) any denial of an application for licensure, and the reasons for such denial, excluding the reporting of any criminal history record information where prohibited by law;\n(6) the presence of significant investigative information; and\n(7) other information that may facilitate the administration of this compact or the protection of the public, as determined by the rules of the commission.\n(C) The records and information provided to a participating state pursuant to this compact or through the data system, when certified by the commission or an agent thereof, shall constitute the authenticated business records of the commission, and shall be entitled to any associated hearsay exception in any relevant judicial, quasi-judicial, or administrative proceedings in a participating state.\n(D) Significant investigative information pertaining to a licensee in any participating state will only be available to other participating states.\n(E) It is the responsibility of the participating states to monitor the database to determine whether adverse action has been taken against a licensee or license applicant. Adverse action information pertaining to a licensee or license applicant in any participating state will be available to any other participating state.\n(F) Participating states contributing information to the data system may designate information that may not be shared with the public without the express permission of the contributing state.\n(G) Any information submitted to the data system that is subsequently expunged pursuant to federal law or the laws of the participating state contributing the information shall be removed from the data system.\nARTICLE IX\nRULEMAKING\n(A) The commission shall promulgate reasonable rules in order to effectively and efficiently implement and administer the purposes and provisions of the compact. A commission rule shall be invalid and have no force or effect only if a court of competent jurisdiction holds that the rule is invalid because the commission exercised its rulemaking authority in a manner that is beyond the scope and purposes of the compact, or the powers granted hereunder, or based upon another applicable standard of review.\n(B) The rules of the commission shall have the force of law in each participating state, provided that where the rules of the commission conflict with the laws of the participating state that establish the participating state's scope of practice as held by a court of competent jurisdiction, the rules of the commission shall be ineffective in that state to the extent of the conflict.\n(C) The commission shall exercise its rulemaking powers pursuant to the criteria set forth in this article and the rules adopted thereunder. Rules shall become binding as of the date specified by the commission for each rule.\n(D) If a majority of the legislatures of the participating states rejects a commission rule or portion of a commission rule, by enactment of a statute or resolution in the same manner used to adopt the compact, within four years of the date of adoption of the rule, then such rule shall have no further force and effect in any participating state or to any state applying to participate in the compact.\n(E) Rules shall be adopted at a regular or special meeting of the commission.\n(F) Prior to adoption of a proposed rule, the commission shall hold a public hearing and allow persons to provide oral and written comments, data, facts, opinions, and arguments.\n(G) Prior to adoption of a proposed rule by the commission, and at least 30 days in advance of the meeting at which the commission will hold a public hearing on the proposed rule, the commission shall provide a notice of proposed rulemaking:\n(1) on the website of the commission or other publicly accessible platform;\n(2) to persons who have requested notice of the commission's notices of proposed rulemaking; and\n(3) in such other ways as the commission may by rule specify.\n(H) The notice of proposed rulemaking shall include:\n(1) the time, date, and location of the public hearing at which the commission will hear public comments on the proposed rule and, if different, the time, date, and location of the meeting where the commission will consider and vote on the proposed rule;\n(2) if the hearing is held via telecommunication, video conference, or other electronic means, the commission shall include the mechanism for access to the hearing in the notice of proposed rulemaking;\n(3) the text of the proposed rule and the reason therefor;\n(4) a request for comments on the proposed rule from any interested person; and\n(5) the manner in which interested persons may submit written comments.\n(I) All hearings will be recorded. A copy of the recording and all written comments and documents received by the commission in response to the proposed rule shall be available to the public.\n(J) Nothing in this article shall be construed as requiring a separate hearing on each commission rule. Rules may be grouped for the convenience of the commission at hearings required by this article.\n(K) The commission shall, by majority vote of all commissioners, take final action on the proposed rule based on the rulemaking record.\n(1) The commission may adopt changes to the proposed rule provided the changes do not enlarge the original purpose of the proposed rule.\n(2) The commission shall provide an explanation of the reasons for substantive changes made to the proposed rule as well as reasons for substantive changes not made that were recommended by commenters.\n(3) The commission shall determine a reasonable effective date for the rule. Except for an emergency as provided in (L) of this article, the effective date of the rule shall be no sooner than 30 days after the commission issuing the notice that it adopted or amended the rule.\n(L) Upon determination that an emergency exists, the commission may consider and adopt an emergency rule with 24 hours' notice, with opportunity to comment, provided that the usual rulemaking procedures provided in the compact and in this article shall be retroactively applied to the rule as soon as reasonably possible, in no event later than 90 days after the effective date of the rule. For the purposes of this provision, an emergency rule is one that must be adopted immediately in order to:\n(1) meet an imminent threat to public health, safety, or welfare;\n(2) prevent a loss of commission or participating state funds;\n(3) meet a deadline for the promulgation of a rule that is established by federal law or rule; or\n(4) protect public health and safety.\n(M) The commission or an authorized committee of the commission may direct revisions to a previously adopted rule for purposes of correcting typographical errors, errors in format, errors in consistency, or grammatical errors. Public notice of any revisions shall be posted on the website of the commission. The revision shall be subject to challenge by any person for a period of 30 days after posting. The revision may be challenged only on grounds that the revision results in a material change to a rule. A challenge shall be made in writing and delivered to the commission prior to the end of the notice period. If no challenge is made, the revision will take effect without further action. If the revision is challenged, the revision may not take effect without the approval of the commission.\n(N) No participating state's rulemaking requirements shall apply under this compact.\nARTICLE X\nOVERSIGHT, DISPUTE RESOLUTION, AND ENFORCEMENT\n(A) Oversight:\n(1) The executive and judicial branches of state government in each participating state shall enforce this compact and take all actions necessary and appropriate to implement the compact.\n(2) Except as provided under article VII, paragraph (I), venue is proper and judicial proceedings by or against the commission shall be brought solely and exclusively in a court of competent jurisdiction where the principal office of the commission is located. The commission may waive venue and jurisdictional defenses to the extent it adopts or consents to participate in alternative dispute resolution proceedings. Nothing herein shall affect or limit the selection or propriety of venue in any action against a licensee for professional malpractice, misconduct, or any such similar matter.\n(3) The commission shall be entitled to receive service of process in any proceeding regarding the enforcement or interpretation of the compact or commission rule and shall have standing to intervene in such a proceeding for all purposes. Failure to provide the commission service of process shall render a judgment or order void as to the commission, this compact, or the promulgated rules.\n(B) Default, Technical Assistance, and Termination:\n(1) If the commission determines that a participating state has defaulted in the performance of its obligations or responsibilities under this compact or the promulgated rules, the commission shall provide written notice to the defaulting state. The notice of default shall describe the default, the proposed means of curing the default, and any other action that the commission may take, and shall offer training and specific technical assistance regarding the default.\n(2) The commission shall provide a copy of the notice of default to the other participating states.\n(C) If a state in default fails to cure the default, the defaulting state may be terminated from the compact upon an affirmative vote of a majority of the commissioners, and all rights, privileges, and benefits conferred on that state by this compact may be terminated on the effective date of termination. A cure of the default does not relieve the offending state of obligations or liabilities incurred during the period of default.\n(D) Termination of participation in the compact shall be imposed only after all other means of securing compliance have been exhausted. Notice of intent to suspend or terminate shall be given by the commission to the governor, the majority and minority leaders of the defaulting state's legislature, the defaulting state's state licensing authority or authorities, as applicable, and each of the participating states' state licensing authority or authorities, as applicable.\n(E) A state that has been terminated is responsible for all assessments, obligations, and liabilities incurred through the effective date of termination, including obligations that extend beyond the effective date of termination.\n(F) Upon the termination of a state's participation in this compact, that state shall immediately provide notice to all licensees of the state, including licensees of other participating states issued a compact privilege to practice within that state, of such termination. The terminated state shall continue to recognize all compact privileges then in effect in that state for a minimum of 180 days after the date of said notice of termination.\n(G) The commission shall not bear any costs related to a state that is found to be in default or that has been terminated from the compact, unless agreed upon in writing between the commission and the defaulting state.\n(H) The defaulting state may appeal the action of the commission by petitioning the United States District Court for the District of Columbia or the federal district where the commission has its principal offices. The prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees.\n(I) Dispute Resolution:\n(1) Upon request by a participating state, the commission shall attempt to resolve disputes related to the compact that arise among participating states and between participating states and nonparticipating states.\n(2) The commission shall promulgate a rule providing for both mediation and binding dispute resolution for disputes as appropriate.\n(J) Enforcement:\n(1) The commission, in the reasonable exercise of its discretion, shall enforce the provisions of this compact and the commission's rules.\n(2) By majority vote, the commission may initiate legal action against a participating state in default in the United States District Court for the District of Columbia or the federal district where the commission has its principal offices to enforce compliance with the provisions of the compact and its promulgated rules. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees. The remedies herein shall not be the exclusive remedies of the commission. The commission may pursue any other remedies available under federal or the defaulting participating state's law.\n(3) A participating state may initiate legal action against the commission in the United States District Court for the District of Columbia or the federal district where the commission has its principal offices to enforce compliance with the provisions of the compact and its promulgated rules. The relief sought may include both injunctive relief and damages. In the event judicial enforcement is necessary, the prevailing party shall be awarded all costs of such litigation, including reasonable attorney fees.\n(4) No individual or entity other than a participating state may enforce this compact against the commission.\nARTICLE XI\nEFFECTIVE DATE, WITHDRAWAL, AND AMENDMENT\n(A) The compact shall come into effect on the date on which the compact statute is enacted into law in the seventh participating state.\n(1) On or after the effective date of the compact, the commission shall convene and review the enactment of each of the states that enacted the compact prior to the commission convening (\"charter participating states\") to determine if the statute enacted by each such charter participating state is materially different than the model compact.\n(i) A charter participating state whose enactment is found to be materially different from the model compact shall be entitled to the default process set forth in article X.\n(ii) If any participating state is later found to be in default, or is terminated or withdraws from the compact, the commission shall remain in existence and the compact shall remain in effect even if the number of participating states should be less than seven.\n(2) Participating states enacting the compact subsequent to the charter participating states shall be subject to the process set forth in article VII, (C)(23), to determine if their enactments are materially different from the model compact and whether they qualify for participation in the compact.\n(3) All actions taken for the benefit of the commission or in furtherance of the purposes of the administration of the compact prior to the effective date of the compact or the commission coming into existence shall be considered to be actions of the commission unless specifically repudiated by the commission.\n(4) Any state that joins the compact subsequent to the commission's initial adoption of the rules and bylaws shall be subject to the commission's rules and bylaws as they exist on the date on which the compact becomes law in that state. Any rule that has been previously adopted by the commission shall have the full force and effect of law on the day the compact becomes law in that state.\n(B) Any participating state may withdraw from this compact by enacting a statute repealing that state's enactment of the compact.\n(1) A participating state's withdrawal shall not take effect until 180 days after enactment of the repealing statute.\n(2) Withdrawal shall not affect the continuing requirement of the withdrawing state's licensing authority or authorities to comply with the investigative and adverse action reporting requirements of this compact prior to the effective date of withdrawal.\n(3) Upon the enactment of a statute withdrawing from this compact, the state shall immediately provide notice of such withdrawal to all licensees within that state. Notwithstanding any subsequent statutory enactment to the contrary, such withdrawing state shall continue to recognize all compact privileges to practice within that state granted pursuant to this compact for a minimum of 180 days after the date of such notice of withdrawal.\n(C) Nothing contained in this compact shall be construed to invalidate or prevent any licensure agreement or other cooperative arrangement between a participating state and a nonparticipating state that does not conflict with the provisions of this compact.\n(D) This compact may be amended by the participating states. No amendment to this compact shall become effective and binding upon any participating state until it is enacted into the laws of all participating states.\nARTICLE XII\nCONSTRUCTION AND SEVERABILITY\n(A) This compact and the commission's rulemaking authority shall be liberally construed so as to effectuate the purposes and the implementation and administration of the compact. Provisions of the compact expressly authorizing or requiring the promulgation of rules shall not be construed to limit the commission's rulemaking authority solely for those purposes.\n(B) The provisions of this compact shall be severable and if any phrase, clause, sentence, or provision of this compact is held by a court of competent jurisdiction to be contrary to the constitution of any participating state, a state seeking participation in the compact, or of the United States, or the applicability thereof to any government, agency, person, or circumstance is held to be unconstitutional by a court of competent jurisdiction, the validity of the remainder of this compact and the applicability thereof to any other government, agency, person, or circumstance shall not be affected thereby.\n(C) Notwithstanding (B) of this article, the commission may deny a state's participation in the compact or, in accordance with the requirements of article X, (B), terminate a participating state's participation in the compact, if it determines that a constitutional requirement of a participating state is a material departure from the compact. Otherwise, if this compact shall be held to be contrary to the constitution of any participating state, the compact shall remain in full force and effect as to the remaining participating states and in full force and effect as to the participating state affected as to all severable matters.\nARTICLE XIII\nCONSISTENT EFFECT AND CONFLICT WITH OTHER STATE LAWS\n(A) Nothing herein shall prevent or inhibit the enforcement of any other law of a participating state that is not inconsistent with the compact.\n(B) Any laws, statutes, regulations, or other legal requirements in a participating state in conflict with the compact are superseded to the extent of the conflict.\n(C) All permissible agreements between the commission and the participating states are binding in accordance with their terms.",
	"repealed": false
}