{
	"id": "181.953",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.953",
	"title": "181.953 RELIABILITY AND FAIRNESS SAFEGUARDS.",
	"text": "(a) Except as provided under subdivision 5a, an employer who requests or requires an employee or job applicant to undergo drug or alcohol testing or cannabis testing shall use the services of a testing laboratory that meets one of the following criteria for drug testing:\n(1) is certified by the National Institute on Drug Abuse as meeting the mandatory guidelines published at 53 Federal Register 11970 to 11989, April 11, 1988;\n(2) is accredited by the College of American Pathologists, 325 Waukegan Road, Northfield, Illinois, 60093-2750, under the forensic urine drug testing laboratory program; or\n(3) is licensed to test for drugs by the state of New York, Department of Health, under Public Health Law, article 5, title V, and rules adopted under that law.\n(b) For alcohol testing, the laboratory must either be:\n(1) licensed to test for drugs and alcohol by the state of New York, Department of Health, under Public Health Law, article 5, title V, and the rules adopted under that law; or\n(2) accredited by the College of American Pathologists, 325 Waukegan Road, Northfield, Illinois, 60093-2750, in the laboratory accreditation program.\n[Repealed, 1991 c 60 s 12]\n(a) A testing laboratory that is not certified by the National Institute on Drug Abuse according to subdivision 1 shall follow the chain-of-custody procedures prescribed for employers in subdivision 5. A testing laboratory shall conduct a confirmatory test on all samples that produced a positive test result on an initial screening test. A laboratory shall disclose to the employer a written test result report for each sample tested within three working days after a negative test result on an initial screening test or, when the initial screening test produced a positive test result, within three working days after a confirmatory test. A test report must indicate the drugs, alcohol, drug or alcohol metabolites, or cannabis or cannabis metabolites tested for and whether the test produced negative or positive test results. A laboratory shall retain and properly store for at least six months all samples that produced a positive test result.\n(b) This subdivision and the chain-of-custody procedures under subdivision 5 do not apply to oral fluid testing under subdivision 5a.\nAn employer may not conduct drug or alcohol testing or cannabis testing of its own employees and job applicants using a testing laboratory owned and operated by the employer; except that, one agency of the state may test the employees of another agency of the state. Except as provided in subdivision 9, an employer may not request or require an employee or job applicant to contribute to, or pay the cost of, drug or alcohol testing or cannabis testing under sections 181.950 to 181.954.\nAn employer shall establish its own reliable chain-of-custody procedures to ensure proper record keeping, handling, labeling, and identification of the samples to be tested. The procedures must require the following:\n(1) possession of a sample must be traceable to the employee from whom the sample is collected, from the time the sample is collected through the time the sample is delivered to the laboratory;\n(2) the sample must always be in the possession of, must always be in view of, or must be placed in a secured area by a person authorized to handle the sample;\n(3) a sample must be accompanied by a written chain-of-custody record; and\n(4) individuals relinquishing or accepting possession of the sample must record the time the possession of the sample was transferred and must sign and date the chain-of-custody record at the time of transfer.\n(a) When drug and alcohol testing or cannabis testing is otherwise authorized under section 181.951, an employer may request an employee or job applicant to undergo oral fluid testing according to the procedures under this subdivision as an alternative to using the services of a testing laboratory under subdivision 1.\n(b) The employee must be informed of the test result at the time of the oral fluid test. Within 48 hours of an oral fluid test that indicates a positive test result or that is inconclusive or invalid, the employee or job applicant may request drug or alcohol testing or cannabis testing at no cost to the employee or job applicant using the services of a testing laboratory under subdivision 1, and according to the existing laboratory testing standards in subdivisions 1 to 5. The rights, notice, and limitations in subdivision 6, paragraph (b), and subdivisions 7 to 8 and 10 to 11 apply to an employee or job applicant and a laboratory test conducted pursuant to this paragraph.\n(c) If the laboratory test under paragraph (b) indicates a positive result, any subsequent confirmatory retest, if requested by the employee or job applicant, must be conducted following the retest procedures provided in subdivision 6, paragraph (c), and subdivision 9 at the employee's or job applicant's own expense.\n(d) Nothing in this subdivision is intended to modify the existing requirements for drug and alcohol testing or cannabis testing in the workplace under sections 181.950 to 18.957, unless stated otherwise.\n(a) Before requesting an employee or job applicant to undergo drug or alcohol testing or requesting cannabis testing, an employer shall provide the employee or job applicant with a form, developed by the employer, on which to acknowledge that the employee or job applicant has seen the employer's drug and alcohol testing or cannabis testing policy.\n(b) If an employee or job applicant tests positive for drug use, the employee must be given written notice of the right to explain the positive test and the employer may request that the employee or job applicant indicate any over-the-counter or prescription medication that the individual is currently taking or has recently taken and any other information relevant to the reliability of, or explanation for, a positive test result.\n(c) Within three working days after notice of a positive test result on a confirmatory test, the employee or job applicant may submit information to the employer, in addition to any information already submitted under paragraph (b), to explain that result, or may request a confirmatory retest of the original sample at the employee's or job applicant's own expense as provided under subdivision 9.\nWithin three working days after receipt of a test result report from the testing laboratory, an employer shall inform in writing an employee or job applicant who has undergone drug or alcohol testing or cannabis testing of (1) a negative test result on an initial screening test or of a negative or positive test result on a confirmatory test and (2) the right provided in subdivision 8. In the case of a positive test result on a confirmatory test, the employer shall also, at the time of this notice, inform the employee or job applicant in writing of the rights provided in subdivisions 6, paragraph (b), 9, and either subdivision 10 or 11, whichever applies.\nAn employee or job applicant has the right to request and receive from the employer a copy of the test result report on any drug or alcohol test or cannabis test.\nAn employee or job applicant may request a confirmatory retest of the original sample at the employee's or job applicant's own expense after notice of a positive test result on a confirmatory test. Within five working days after notice of the confirmatory test result, the employee or job applicant shall notify the employer in writing of the employee's or job applicant's intention to obtain a confirmatory retest. Within three working days after receipt of the notice, the employer shall notify the original testing laboratory that the employee or job applicant has requested the laboratory to conduct the confirmatory retest or transfer the sample to another laboratory licensed under subdivision 1 to conduct the confirmatory retest. The original testing laboratory shall ensure that the chain-of-custody procedures in subdivision 3 are followed during transfer of the sample to the other laboratory. The confirmatory retest must use the same drug, alcohol, or cannabis threshold detection levels as used in the original confirmatory test. If the confirmatory retest does not confirm the original positive test result, no adverse personnel action based on the original confirmatory test may be taken against the employee or job applicant.\n[See Note.]\n(a) An employer may not discharge, discipline, discriminate against, or request or require rehabilitation of an employee on the basis of a positive test result from an initial screening test that has not been verified by a confirmatory test.\n(b) In addition to the limitation under paragraph (a), an employer may not discharge an employee for whom a positive test result on a confirmatory test was the first such result for the employee on a drug or alcohol test or cannabis test requested by the employer unless the following conditions have been met:\n(1) the employer has first given the employee an opportunity to participate in, at the employee's own expense or pursuant to coverage under an employee benefit plan, either a drug, alcohol, or cannabis counseling or rehabilitation program, whichever is more appropriate, as determined by the employer after consultation with a certified chemical use counselor or a physician trained in the diagnosis and treatment of substance use disorder; and\n(2) the employee has either refused to participate in the counseling or rehabilitation program or has failed to successfully complete the program, as evidenced by withdrawal from the program before its completion or by a positive test result on a confirmatory test after completion of the program.\n(c) Notwithstanding paragraph (a), an employer may temporarily suspend the tested employee or transfer that employee to another position at the same rate of pay pending the outcome of the confirmatory test and, if requested, the confirmatory retest, provided the employer believes that it is reasonably necessary to protect the health or safety of the employee, coemployees, or the public. An employee who has been suspended without pay must be reinstated with back pay if the outcome of the confirmatory test or requested confirmatory retest is negative.\n(d) An employer may not discharge, discipline, discriminate against, or request or require rehabilitation of an employee on the basis of medical history information revealed to the employer pursuant to subdivision 6 unless the employee was under an affirmative duty to provide the information before, upon, or after hire.\n(e) An employee must be given access to information in the employee's personnel file relating to positive test result reports and other information acquired in the drug and alcohol testing process or cannabis testing process and conclusions drawn from and actions taken based on the reports or other acquired information.\n[See Note.]\nAn employer may discipline, discharge, or take other adverse personnel action against an employee for cannabis flower, cannabis product, lower-potency hemp edible, or hemp-derived consumer product use, possession, impairment, sale, or transfer while an employee is working, on the employer's premises, or operating the employer's vehicle, machinery, or equipment as follows:\n(1) if, as the result of consuming cannabis flower, a cannabis product, a lower-potency hemp edible, or a hemp-derived consumer product, the employee does not possess that clearness of intellect and control of self that the employee otherwise would have;\n(2) if cannabis testing verifies the presence of cannabis flower, a cannabis product, a lower-potency hemp edible, or a hemp-derived consumer product following a confirmatory test;\n(3) as provided in the employer's written work rules for cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products and cannabis testing, provided that the rules are in writing and in a written policy that contains the minimum information required by section 181.952; or\n(4) as otherwise authorized or required under state or federal law or regulations, or if a failure to do so would cause an employer to lose a monetary or licensing-related benefit under federal law or regulations.\nIf a job applicant has received a job offer made contingent on the applicant passing drug and alcohol testing, the employer may not withdraw the offer based on a positive test result from an initial screening test that has not been verified by a confirmatory test.",
	"repealed": false
}