{
	"id": "611.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.32",
	"title": "611.32 PROCEEDINGS WHERE INTERPRETER APPOINTED.",
	"text": "In any proceeding in which a person disabled in communication may be subjected to confinement, criminal sanction, or forfeiture of the person's property, and in any proceeding preliminary to that proceeding, including coroner's inquest, grand jury proceedings, and proceedings relating to mental health commitments, the presiding judicial officer shall appoint a qualified interpreter to assist the person disabled in communication and any witness disabled in communication throughout the proceedings.\nFollowing the apprehension or arrest of a person disabled in communication for an alleged violation of a criminal law, the arresting officer, sheriff or other law enforcement official shall immediately make necessary contacts to obtain a qualified interpreter and shall obtain an interpreter at the earliest possible time at the place of detention. A law enforcement officer shall, with the assistance of the interpreter, explain to the person disabled in communication, all charges filed against the person, and all procedures relating to the person's detainment and release. If the property of a person is seized under section 609.531, subdivision 4, the seizing officer, sheriff, or other law enforcement official shall, upon request, make available to the person at the earliest possible time a qualified interpreter to assist the person in understanding the possible consequences of the seizure and the person's right to judicial review. If the seizure is governed by section 609.5314, subdivision 2, a request for an interpreter must be made within 15 days after service of the notice of seizure and forfeiture. For a person who requests an interpreter under this section because of a seizure of property under section 609.5314, the 60 days for filing a demand for a judicial determination of a forfeiture begins when the interpreter is provided. The interpreter shall also assist the person with all other communications, including communications relating to needed medical attention. Prior to interrogating or taking the statement of the person disabled in communication, the arresting officer, sheriff, or other law enforcement official shall make available to the person a qualified interpreter to assist the person throughout the interrogation or taking of a statement.",
	"repealed": false
}