{
	"id": "84B.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/84B.061",
	"title": "84B.061 STATE JURISDICTION OVER RAINY LAKE AND OTHER NAVIGABLE WATERS; DUTIES OF GOVERNOR, ATTORNEY GENERAL, AND OTHER PUBLIC OFFICERS.",
	"text": "As required by this chapter and the act of Congress authorizing Voyageurs National Park, the state of Minnesota donated in excess of 35,000 acres of state and other publicly owned land for the park, roughly one-fourth of the land area of the park, at a cost of over $5,000,000 to the state. More than 24,000 acres of this land was state trust fund land which the state condemned before making its donation. Pursuant to section 84B.06, lands donated by the state, along with other lands acquired by the National Park Service for the park, were made subject to concurrent jurisdiction by the state and the United States under section 1.041. In making these donations, none of the navigable waters within the park and the lands under them have been donated to the United States. These navigable waters include the following: Rainy, Kabetogama, Namakan, Sand Point, and Crane Lakes. Pursuant to applicable federal and state law, navigable waters and their beds are owned by the state. Ownership of and jurisdiction over these waters, frozen waters, and their beds has not been ceded by the state, either expressly or implicitly, to the United States. Unlike section 1.044 relating to the Upper Mississippi Wildlife and Fish Refuge, where the state expressly granted its consent and jurisdiction to the United States to acquire interests in water, as well as land, the consent granted by the state in section 84B.06 to acquisitions by the United States for Voyageurs National Park is limited to land, only. In the discharge of their official duties, the governor, attorney general, other constitutional officers, and other public officials, such as the commissioner of natural resources, shall vigorously assert and defend, in all forums, the state's ownership of and jurisdiction over these waters and their beds and related natural resources, together with associated rights of the state and its citizens arising from the state's ownership and jurisdiction. In discharging their duties, the governor, attorney general, other constitutional officers, and other public officials shall, additionally, be especially cognizant of the free rights of travel afforded to citizens of Minnesota and others under the Webster-Ashburton Treaty (proclaimed November 10, 1842) and the Root-Bryce Treaty (proclaimed May 13, 1910) on international and associated boundary waters. Also, in furtherance of duties under this section, the commissioner of natural resources shall continue in effect the commercial removal of native rough fish, as defined in section 97A.015, subdivision 32c, from these waters, together with any rights to do so possessed by any person on January 1, 1995, so long as the commissioner determines that such taking is desirable to the management of the native fishery.",
	"repealed": false
}