{
	"id": "626.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.90",
	"title": "626.90 LAW ENFORCEMENT AUTHORITY; MILLE LACS BAND OF CHIPPEWA.",
	"text": "As used in this section, \"band\" means the federally recognized Mille Lacs Band of Chippewa Indians.\n(a) The band has the powers of a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), if all of the requirements of clauses (1) to (4) are met:\n(1) the band agrees to be subject to liability for its torts and those of its officers, employees, and agents acting within the scope of their employment or duties arising out of a law enforcement agency function conferred by this section, to the same extent as a municipality under chapter 466, and the band further agrees, notwithstanding section 16C.05, subdivision 7, to waive its sovereign immunity for purposes of claims of this liability;\n(2) the band files with the Board of Peace Officer Standards and Training a bond or certificate of insurance for liability coverage with the maximum single occurrence amounts set forth in section 466.04 and an annual cap for all occurrences within a year of three times the single occurrence amount;\n(3) the band files with the Board of Peace Officer Standards and Training a certificate of insurance for liability of its law enforcement officers, employees, and agents for lawsuits under the United States Constitution; and\n(4) the band agrees to be subject to section 13.82 and any other laws of the state relating to data practices of law enforcement agencies.\n(b) The band may enter into mutual aid/cooperative agreements with the Mille Lacs County sheriff under section 471.59 to define and regulate the provision of law enforcement services under this section.\n(c) Only if the requirements of paragraph (a) are met, the band shall have concurrent jurisdictional authority under this section with the Mille Lacs County Sheriff's Department over all persons in the geographical boundaries of the Treaty of February 22, 1855, 10 Stat. 1165, in Mille Lacs County, Minnesota.\nIf the band complies with the requirements set forth in subdivision 2, the band is authorized to appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), who have the same powers as peace officers employed by local units of government.\nThe sheriff of the county in which the violation occurred is responsible for receiving persons arrested by peace officers appointed under subdivision 3 and acting under the authority conferred by this section.\nThe Mille Lacs County attorney is responsible to prosecute or initiate petitions for any person arrested, investigated, or detained by peace officers appointed under subdivision 3 and acting under the authority conferred by this section.\nNothing in this section shall be construed to restrict the band's authority under federal law.\nThis section is limited to law enforcement authority only, and nothing in this section shall affect any other jurisdictional relationships or disputes involving the band or current reservation boundaries or entitle the band as a municipality or subdivision of government to any fine or penalty revenue allocation under section 484.90.",
	"repealed": false
}