{
	"id": "85.054",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.054",
	"title": "85.054 STATE PARK PERMIT EXEMPTIONS.",
	"text": "(a) A state park permit is not required for a motor vehicle to enter a state park, state monument, state recreation area, or state wayside, on four days each calendar year at each park, which the commissioner shall designate as State Park Open House Days. The commissioner may designate two consecutive days as State Park Open House Days, if the open house is held in conjunction with a special event described in section 85.052, subdivision 2.\n(b) The commissioner shall announce the date of each State Park Open House Day at least 30 days in advance of the date it occurs.\n(c) The purpose of State Park Open House Days is to acquaint the public with state parks, recreation areas, and waysides.\n(d) On State Park Open House Days, registered overnight guests in state parks and state recreation areas are exempt from the requirements for a state park permit under section 85.053 until after the camping or lodging check-out time of the following day in the park where the overnight stay occurred.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the Fort Snelling Memorial Chapel Island portion of Fort Snelling State Park.\n[Repealed, 2008 c 357 s 40]\nA state park permit is not required and a fee must not be charged for motor vehicle entry or parking at the Veterans Memorial scenic overlook portion of Jay Cooke State Park.\nA state park permit is not required and a fee must not be charged for motor vehicle entry or parking at the class I highway rest area parking lot located adjacent to marked Trunk Highway 61 and the Gooseberry River at Gooseberry Falls State Park.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the Iron Range Off-Highway Vehicle Recreation Area, except that the commissioner may establish special event fees.\nA state park permit is not required and a fee may not be charged for motor vehicle entry at Palisade Head in Tettegouche State Park, provided that motor vehicles entering the park under this provision may not be parked at Palisade Head for more than one hour. A state park permit is not required and a fee may not be charged for the class I rest area parking area at Tettegouche State Park.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the parking area located adjacent to County State-Aid Highway No. 4 at Zippel Bay State Park, Lake of the Woods County.\nA state park permit is not required and a fee may not be charged for motor vehicle entry to, use of roads to, or parking at the Department of Natural Resources regional headquarters portion of Lake Bemidji State Park.\nA state park permit is not required and a fee may not be charged for any portion of the Red River State Recreation Area located outside of the campground.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the parking area located north of Tamarac River in the southern unit of Big Bog State Recreation Area, Beltrami County.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the visitor parking area of Soudan Underground Mine and the Stuntz Bay boat house area.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at Croft Mine Historical Park and Portsmouth Mine Lake Overlook in Cuyuna Country State Recreation Area, except for overnight camping.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the class 1 highway rest area parking lot located adjacent to marked Trunk Highway 61 and Pigeon River at Grand Portage State Park.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at the parking lot located adjacent to John Latsch Road and Trunk Highway 61 at John A. Latsch State Park.\nA state park permit is not required and a fee may not be charged for motor vehicle entry or parking at Greenleaf Lake State Recreation Area.\nA state park permit is not required and a fee may not be charged for vehicles transporting K-12 students engaged in school-sanctioned activities at state parks.\nA state park permit is not required and a fee may not be charged for motor vehicle entry, use, or parking in La Salle Lake State Recreation Area unless the occupants of the vehicle enter, use, or park in a developed campground, overnight, or day-use area.\nMS 2020 [Repealed, 1Sp2021 c 6 art 2 s 134]",
	"repealed": false
}