{
	"id": "624.7175",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7175",
	"title": "624.7175 TRANSFER OF FIREARMS.",
	"text": "(a) Except as provided in paragraph (b), upon issuance of an extreme risk protection order, the court shall direct the respondent to transfer any firearms the person possesses as soon as reasonably practicable, but in no case later than 24 hours, to a federally licensed firearms dealer or a law enforcement agency. If the respondent elects to transfer the respondent's firearms to a law enforcement agency, the agency must accept the transfer. The transfer may be permanent or temporary. A temporary firearm transfer only entitles the receiving party to possess the firearm and does not transfer ownership or title. If the respondent makes a temporary transfer to a federally licensed firearms dealer, the dealer may charge the respondent a reasonable fee to store the firearms. If the temporary transfer is made to a law enforcement agency, the agency may not charge the respondent any storage or other associated fee. A dealer or agency may establish policies for disposal of abandoned firearms, provided these policies require that the respondent be notified prior to disposal of abandoned firearms. If a respondent permanently transfers the respondent's firearms to a law enforcement agency, the agency must compensate the respondent at fair market value and may not charge the respondent any processing or other fees.\n(b) A person directed to transfer any firearms pursuant to paragraph (a) may transfer any antique firearm, as defined in United States Code, title 18, section 921, paragraph (a), clause (16), as amended, or a curio or relic as defined in Code of Federal Regulations, title 27, section 478.11, as amended, to a relative who does not live with the respondent after confirming that the relative may lawfully own or possess a firearm.\n(c) The respondent must file proof of transfer as provided in this paragraph.\n(1) A law enforcement agency or federally licensed firearms dealer accepting transfer of a firearm pursuant to this section shall provide proof of transfer to the respondent. The proof of transfer must specify whether the firearms were permanently or temporarily transferred and must include the name of the respondent, date of transfer, and the serial number, manufacturer, and model of all transferred firearms. If transfer is made to a federally licensed firearms dealer, the respondent shall, within two business days after being served with the order, file a copy of proof of transfer with the law enforcement agency and attest that all firearms owned or possessed at the time of the order have been transferred in accordance with this section and that the person currently does not possess any firearms. If the respondent claims not to own or possess firearms, the respondent shall file a declaration of nonpossession with the law enforcement agency attesting that, at the time of the order, the respondent neither owned nor possessed any firearms, and that the respondent currently neither owns nor possesses any firearms. If the transfer is made to a relative pursuant to paragraph (b), the relative must sign an affidavit under oath before a notary public either acknowledging that the respondent permanently transferred the respondent's antique firearms, curios, or relics to the relative or agreeing to temporarily store the respondent's antique firearms, curios, or relics until such time as the respondent is legally permitted to possess firearms. To the extent possible, the affidavit shall indicate the serial number, make, and model of all antique firearms, curios, or relics transferred by the respondent to the relative.\n(2) The court shall seal affidavits, proofs of transfer, and declarations of nonpossession filed pursuant to this paragraph.\n(d) If a court issues an emergency order under section 624.7174, or makes a finding of immediate and present danger under section 624.7172, subdivision 2, paragraph (f), and there is probable cause to believe the respondent possesses firearms, the court shall issue a search warrant to the local law enforcement agency to take possession of all firearms in the respondent's possession as soon as practicable. The chief law enforcement officer, or the chief's designee, shall notify the respondent of the option to voluntarily comply with the order by surrendering the respondent's firearms to law enforcement prior to execution of the search warrant. Only if the respondent refuses to voluntarily comply with the order to surrender the respondent's firearms shall the officer or officers tasked with serving the search warrant execute the warrant. The local law enforcement agency shall, upon written notice from the respondent, transfer the firearms to a federally licensed firearms dealer. Before a local law enforcement agency transfers a firearm under this paragraph, the agency shall require the federally licensed firearms dealer receiving the firearm to submit a proof of transfer that complies with the requirements for proofs of transfer established in paragraph (c). The agency shall file all proofs of transfer received by the court within two business days of the transfer. A federally licensed firearms dealer who accepts a firearm transfer pursuant to this paragraph shall comply with paragraphs (a) and (c) as if accepting transfer directly from the respondent. A law enforcement agency may establish policies for disposal of abandoned firearms, provided these policies require that the respondent be notified prior to disposal of abandoned firearms.",
	"repealed": false
}