{
	"id": "144A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.15",
	"title": "144A.15 STATE RECEIVERSHIP.",
	"text": "In addition to any other remedy provided by law, the commissioner of health may petition the district court in Ramsey or Hennepin County or in the district in which a nursing home or certified boarding care home is located for an order directing the controlling persons of the nursing home or certified boarding care home to show cause why the commissioner of health should not be appointed receiver to operate the facility. The petition to the district court shall contain proof by affidavit that one or more of the following exists:\n(1) the commissioner of health has commenced proceedings to suspend or revoke the state license, or refuses to renew a license;\n(2) violations of section 1919(b), (c), or (d), of the Social Security Act, or the regulations adopted under that section, or violations of state laws or rules, create an emergency for the residents of the facility;\n(3) there is a threat of imminent abandonment by the owner or operator;\n(4) there is a pattern of failure to meet ongoing financial obligations such as failing to pay for food, pharmaceuticals, personnel, or required insurance;\n(5) the Centers for Medicare and Medicaid Services (CMS) has appointed a temporary manager to oversee the operation of the facility; or\n(6) notice by CMS has been given that the federal Medicare or Medicaid provider agreement will be terminated, revoked, canceled, or not renewed.\nThe order to show cause shall be personally served to either the nursing home administrator or to the person designated as the agent by the controlling persons to accept service on their behalf pursuant to section 144A.03, subdivision 2.\nIf, after hearing, the court finds that receivership is necessary as a means of protecting the health, safety, or welfare of a resident of the facility, the court shall appoint the commissioner of health as a receiver to take charge of the facility. The commissioner may enter into an agreement for a managing agent to work on the commissioner's behalf in operating the facility during the receivership. The court shall determine a fair monthly rental for the facility, taking into account all relevant factors including the condition of the facility. This rental fee shall be paid by the receiver to the appropriate controlling person for each month that the receivership remains in effect but shall be reduced by the amount that the costs of the receivership provided under section 256R.52 are in excess of the facility rate. The controlling person may agree to waive the fair monthly rent by affidavit to the court. Notwithstanding any other law to the contrary, no payment made to a controlling person by any state agency during a period of receivership shall include any allowance for profit or be based on any formula which includes an allowance for profit.\nNotwithstanding state contracting requirements in chapter 16C, the commissioner shall establish and maintain a list of qualified licensed nursing home administrators, or other qualified persons or organizations with experience in delivering skilled health care services and the operation of long-term care facilities for those interested in being a managing agent on the commissioner's behalf during a state receivership of a facility. This list will be a resource for choosing a managing agent and the commissioner may update the list at any time. A managing agent cannot be someone who: (1) is the owner, licensee, or administrator of the facility; (2) has a financial interest in the facility at the time of the receivership or is a related party to the owner, licensee, or administrator; or (3) has owned or operated any nursing facility or boarding care home that has been ordered into receivership.\nIf it appears from the petition filed under subdivision 1, or from an affidavit or affidavits filed with the petition, or from testimony of witnesses under oath when the court determines that this is necessary, that there is probable cause to believe that an emergency exists in a nursing home or certified boarding care home requiring the receivership, the court shall issue a temporary order for appointment of a receiver within two days after receipt of the petition. Notice of the petition shall be served personally on the nursing home administrator or on the person designated as the agent by the controlling person to accept service on their behalf according to section 144A.03, subdivision 2. A hearing on the petition shall be held within five days' after notice is served unless the administrator or designated agent consents to a later date. After the hearing, the court may continue, modify, or terminate the temporary order.\n(a) A nursing home receiver appointed pursuant to this section shall with all reasonable speed, but in any case, within 18 months after the receivership order, determine whether to close the facility or to make other provisions intended to keep it open. If facility closure is the determination, the commissioner shall provide for the orderly transfer of all the nursing home's residents to other facilities pursuant to the relocation procedures required in section 144A.161. During the receivership, the receiver may correct or eliminate those deficiencies in the facility which seriously endanger the life, health or safety of the residents unless the correction or elimination of deficiencies involves major alterations in the physical structure of the nursing home. The receiver shall, during this period, operate the nursing home in a manner designed to guarantee the safety and adequate health care of the residents. The receiver shall take no action which impairs the legal rights of a resident of the nursing home. The receiver shall have power to make contracts and incur lawful expenses. The receiver shall use the building, fixtures, furnishings, and any accompanying consumable goods in the provision of care and services to the residents during the receivership period. The receiver shall take action as is reasonably necessary to protect or conserve the tangible assets or property during receivership. The receiver shall collect incoming payments from all sources and apply them to the cost incurred in the performance of the receiver's functions. No security interest in any real or personal property comprising the nursing home or contained within it, or in any fixture of the facility, shall be impaired or diminished in priority by the receiver. The receiver shall pay all valid obligations the facility incurred during the course of the receivership and may pay obligations incurred prior to the receivership if, in the judgment of the commissioner, these payments must be made to ensure the health, safety, or welfare of the residents and shall deduct these expenses from rental payments owed to any controlling person by virtue of the receivership. The receiver has authority to hire, direct, manage, and discharge any employees of the facility including the administrator, director of nursing, medical director, or manager of the facility.\n(b) Nothing in this section shall relieve any owner, operator, or controlling person of a facility placed in receivership of any civil or criminal liability incurred, or any duty imposed by law, by reason of acts or omissions of the owner, licensee, or controlling person prior to the order for receivership under this section, nor shall anything contained in this section be construed to suspend during the receivership any obligation of the owner, licensee, or controlling person for payment of taxes or other operating and maintenance expenses of the facility nor of the owner, licensee, or controlling person or any other person for the payment of mortgages or liens.\nThe commissioner of health, as receiver appointed by the court, may hire a managing agent to work on the commissioner's behalf to operate the facility during the receivership, and that managing agent is entitled to a reasonable fee. The receiver and its managing agent shall be liable only in an official capacity for injury to person and property by reason of the conditions of the nursing home. The receiver and its managing agent shall not be personally liable, except for gross negligence and intentional acts. The commissioner of health shall assist the managing agent in carrying out its duties.\nReceivership imposed pursuant to this section shall terminate 18 months after the date on which it was ordered or at any other time designated by the court or upon the occurrence of any of the following events:\n(1) a determination by the commissioner of health that the nursing home's license should be renewed or should not be suspended or revoked;\n(2) the granting of a new license to the nursing home; or\n(3) a determination by the commissioner of health that all of the residents of the nursing home have been provided alternative health care, either in another facility or otherwise.\nIf a facility remains open after the receivership is concluded, a new operator is only legally responsible under state law for its actions after the receivership has concluded.",
	"repealed": false
}