{
	"id": "121A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.61",
	"title": "121A.61 DISCIPLINE AND REMOVAL OF STUDENTS FROM CLASS.",
	"text": "Each school board must adopt a written districtwide school discipline policy which includes written rules of conduct for students, minimum consequences for violations of the rules, and grounds and procedures for removal of a student from class. The policy must contain the discipline complaint procedure that any member of the school community may use to file a complaint regarding the application of discipline policies and seek corrective action. The policy must be developed in consultation with administrators, teachers, employees, pupils, parents, community members, law enforcement agencies, county attorney offices, social service agencies, and such other individuals or organizations as the board determines appropriate. A school site council may adopt additional provisions to the policy subject to the approval of the school board.\nThe policy must establish the various grounds for which a student may be removed from a class in the district for a period of time under the procedures specified in the policy. The policy must include a procedure for notifying and meeting with a student's parent or guardian to discuss the problem that is causing the student to be removed from class after the student has been removed from class more than ten times in one school year. The grounds in the policy must include at least the following provisions as well as other grounds determined appropriate by the board:\n(a) willful conduct that significantly disrupts the rights of others to an education, including conduct that interferes with a teacher's ability to teach or communicate effectively with students in a class or with the ability of other students to learn;\n(b) willful conduct that endangers surrounding persons, including school district employees, the student or other students, or the property of the school; and\n(c) willful violation of any rule of conduct specified in the discipline policy adopted by the board.\nThe policy must include at least the following components:\n(a) rules governing student conduct and procedures for informing students of the rules;\n(b) the grounds for removal of a student from a class;\n(c) the authority of the classroom teacher to remove students from the classroom pursuant to procedures and rules established in the district's policy;\n(d) the procedures for removal of a student from a class by a teacher, school administrator, or other school district employee;\n(e) the period of time for which a student may be removed from a class, which may not exceed five class periods for a violation of a rule of conduct;\n(f) provisions relating to the responsibility for and custody of a student removed from a class;\n(g) the procedures for return of a student to the specified class from which the student has been removed;\n(h) the procedures for notifying a student and the student's parents or guardian of violations of the rules of conduct and of resulting disciplinary actions;\n(i) any procedures determined appropriate for encouraging early involvement of parents or guardians in attempts to improve a student's behavior;\n(j) any procedures determined appropriate for encouraging early detection of behavioral problems;\n(k) any procedures determined appropriate for referring a student in need of special education services to those services;\n(l) any procedures determined appropriate for ensuring victims of bullying who respond with behavior not allowed under the school's behavior policies have access to a remedial response, consistent with section 121A.031;\n(m) the procedures for consideration of whether there is a need for a further assessment or of whether there is a need for a review of the adequacy of a current individualized education program of a student with a disability who is removed from class;\n(n) procedures for detecting and addressing chemical abuse problems of a student while on the school premises;\n(o) the minimum consequences for violations of the code of conduct;\n(p) procedures for immediate and appropriate interventions tied to violations of the code;\n(q) a provision that states that a teacher, school employee, school bus driver, or other agent of a district may use reasonable force in compliance with section 121A.582 and other laws;\n(r) an agreement regarding procedures to coordinate crisis services to the extent funds are available with the county board responsible for implementing sections 245.487 to 245.4889 for students with a serious emotional disturbance or other students who have an individualized education program whose behavior may be addressed by crisis intervention;\n(s) a provision that states a student must be removed from class immediately if the student engages in assault or violent behavior. For purposes of this paragraph, \"assault\" has the meaning given it in section 609.02, subdivision 10. The removal shall be for a period of time deemed appropriate by the principal, in consultation with the teacher;\n(t) a prohibition on the use of exclusionary practices for early learners as defined in section 121A.425; and\n(u) a prohibition on the use of exclusionary practices to address attendance and truancy issues.\nThe discipline policy must contain procedures for students, parents and other guardians, and school staff to file a complaint and seek corrective action when the requirements of sections 121A.40 to 121A.61, including the implementation of the local behavior and discipline policies, are not being implemented appropriately or are being discriminately applied. Each district and school policy implemented under this section must, at a minimum:\n(1) provide procedures for communicating this policy including the ability for a parent to appeal a decision under section 121A.49 that contains explicit instructions for filing the complaint;\n(2) provide an opportunity for involved parties to submit additional information related to the complaint;\n(3) provide a procedure to begin to investigate complaints within three school days of receipt, and identify personnel who will manage the investigation and any resulting record and are responsible for keeping and regulating access to any record;\n(4) provide procedures for issuing a written determination to the complainant that addresses each allegation and contains findings and conclusions;\n(5) if the investigation finds the requirements of sections 121A.40 to 121A.61, including any local policies that were not implemented appropriately, contain procedures that require a corrective action plan to correct a student's record and provide relevant staff with training, coaching, or other accountability practices to ensure appropriate compliance with policies in the future; and\n(6) prohibit reprisals or retaliation against any person who asserts, alleges, or reports a complaint, and provide procedures for applying appropriate consequences for a person who engages in reprisal or retaliation.\n(a) A school board is strongly encouraged to adopt a policy that promotes the understanding in school staff that when a student is unable to meet adult expectations it is often because the student lacks the skills to respond to a situation appropriately. A school district must support school staff in using tiered interventions that teach students skills and prioritize relationships between students and teachers.\n(b) A school board is strongly encouraged to adopt a policy that discourages teachers and staff from reacting to unwanted student behavior with approaches that take away the student's opportunity to build skills for responding more appropriately.",
	"repealed": false
}