{
	"id": "80A.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.76",
	"title": "80A.76 SECTION 509; CIVIL LIABILITY.",
	"text": "(a) Securities Litigation Uniform Standards Act. Enforcement of civil liability under this section is subject to the Securities Litigation Uniform Standards Act of 1998.\n(b) Liability of seller to purchaser. A person is liable to the purchaser if the person sells a security in violation of section 80A.49 or, by means of an untrue statement of a material fact or an omission to state a material fact necessary in order to make the statement made, in light of the circumstances under which it is made, not misleading, the purchaser not knowing the untruth or omission and the seller not sustaining the burden of proof that the seller did not know and, in the exercise of reasonable care, could not have known of the untruth or omission. An action under this subsection is governed by the following:\n(1) The purchaser may maintain an action to recover the consideration paid for the security, less the amount of any income received on the security, and interest from the date of the purchase, costs, and reasonable attorneys' fees determined by the court, upon the tender of the security, or for actual damages as provided in paragraph (3).\n(2) The tender referred to in paragraph (1) may be made any time before entry of judgment. Tender requires only notice in a record of ownership of the security and willingness to exchange the security for the amount specified. A purchaser that no longer owns the security may recover actual damages as provided in paragraph (3).\n(3) Actual damages in an action arising under this subsection are the amount that would be recoverable upon a tender less the value of the security when the purchaser disposed of it, and interest from the date of the purchase, costs, and reasonable attorneys' fees determined by the court.\n(c) Liability of purchaser to seller. A person is liable to the seller if the person buys a security by means of an untrue statement of a material fact or omission to state a material fact necessary in order to make the statement made, in light of the circumstances under which it is made, not misleading, the seller not knowing of the untruth or omission, and the purchaser not sustaining the burden of proof that the purchaser did not know, and in the exercise of reasonable care, could not have known of the untruth or omission. An action under this subsection is governed by the following:\n(1) The seller may maintain an action to recover the security, and any income received on the security, costs, and reasonable attorneys' fees determined by the court, upon the tender of the purchase price, or for actual damages as provided in paragraph (3).\n(2) The tender referred to in paragraph (1) may be made any time before entry of judgment. Tender requires only notice in a record of the present ability to pay the amount tendered and willingness to take delivery of the security for the amount specified. If the purchaser no longer owns the security, the seller may recover actual damages as provided in paragraph (3).\n(3) Actual damages in an action arising under this subsection are the difference between the price at which the security was sold and the value the security would have had at the time of the sale in the absence of the purchaser's conduct causing liability, and interest from the date of the sale of the security, costs, and reasonable attorneys' fees determined by the court.\n(d) Liability of unregistered broker-dealer and agent. A person acting as a broker-dealer or agent that sells or buys a security in violation of section 80A.56(a), 80A.57(a), or 80A.73 is liable to the customer. The customer, if a purchaser, may maintain an action for recovery of actual damages as specified in subsections (b)(1) through (3), or, if a seller, for a remedy as specified in subsections (c)(1) through (3).\n(e) Liability of unregistered investment adviser. A person acting as an investment adviser that provides investment advice for compensation in violation of section 80A.58(a) or 80A.73 is liable to the client. The client may maintain an action to recover the consideration paid for the advice, interest from the date of payment, costs, and reasonable attorneys' fees determined by the court.\n(f) Liability for investment advice. A person that receives directly or indirectly any consideration for providing investment advice to another person and that employs a device, scheme, or artifice to defraud the other person or engages in an act, practice, or course of business that operates or would operate as a fraud or deceit on the other person, is liable to the other person. An action under this subsection is governed by the following:\n(1) The person defrauded may maintain an action to recover the consideration paid for the advice and the amount of any actual damages caused by the fraudulent conduct, interest from the date of the fraudulent conduct, costs, and reasonable attorneys' fees determined by the court, less the amount of any income received as a result of the fraudulent conduct.\n(2) This subsection does not apply to a broker-dealer or its agents if the investment advice provided is solely incidental to transacting business as a broker-dealer and no special compensation is received for the investment advice.\n(g) Joint and several liability. The following persons are liable jointly and severally with and to the same extent as persons liable under subsections (b) through (f):\n(1) a person that directly or indirectly controls a person liable under subsections (b) through (f), unless the controlling person sustains the burden of proof that the person did not know, and in the exercise of reasonable care could not have known, of the existence of conduct by reason of which the liability is alleged to exist;\n(2) an individual who is a managing partner, executive officer, or director of a person liable under subsections (b) through (f), including an individual having a similar status or performing similar functions, unless the individual sustains the burden of proof that the individual did not know and, in the exercise of reasonable care could have known, of the existence of conduct by reason of which the liability is alleged to exist;\n(3) an individual who is an employee of or associated with a person liable under subsections (b) through (f) and who materially aids the conduct giving rise to the liability, unless the individual sustains the burden of proof that the individual did not know and, in the exercise of reasonable care could not have known, of the existence of conduct by reason of which the liability is alleged to exist; and\n(4) a person that is a broker-dealer, agent, investment adviser, or investment adviser representative that materially aids the conduct giving rise to the liability under subsections (b) through (f), unless the person sustains the burden of proof that the person did not know and, in the exercise of reasonable care could not have known, of the existence of conduct by reason of which liability is alleged to exist.\n(h) Right of contribution. A person liable under this section has a right of contribution as in cases of tort against any other person liable under this section for the same conduct.\n(i) Survival of cause of action. A cause of action under this section survives the death of an individual who might have been a plaintiff or defendant.\n(j) Statute of limitations. A person may not obtain relief:\n(1) under subsection (b) for violation of section 80A.49, or under subsection (d) or (e), unless the action is instituted within one year after the violation occurred; or\n(2) under subsection (b), other than for violation of section 80A.49, or under subsection (c) or (f), unless the action is instituted within the earlier of two years after discovery of the facts constituting the violation or five years after the violation.\n(k) No enforcement of violative contract. A person that has made, or has engaged in the performance of, a contract in violation of this chapter or a rule adopted or order issued under this chapter, or that has acquired a purported right under the contract with knowledge of conduct by reason of which its making or performance was in violation of this chapter, may not base an action on the contract.\n(l) No contractual waiver. A condition, stipulation, or provision binding a person purchasing or selling a security or receiving investment advice to waive compliance with this chapter or a rule adopted or order issued under this chapter is void.\n(m) Survival of other right or remedies. The rights and remedies provided by this chapter are in addition to any other rights or remedies that may exist, but this chapter does not create a cause of action not specified in this section or section 80A.66(e).",
	"repealed": false
}