{
	"id": "260.765",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.765",
	"title": "260.765 VOLUNTARY FOSTER CARE PLACEMENT.",
	"text": "The child-placing agency shall follow the notice provisions in section 260.761.\nAny agency considering placement of an Indian child shall make active efforts to identify and locate extended family members.\nAt any subsequent stage of a child-placing agency's involvement with an Indian child, the child-placing agency shall, upon request, give the Tribal social services agency full cooperation including access to all files concerning the child. If the files contain confidential or private data, the child-placing agency or individual may require execution of an agreement with the Tribal social services agency that the Tribal social services agency shall maintain the data according to statutory provisions applicable to the data.\nWhen an Indian child is voluntarily placed out of the care of the Indian child's parent or Indian custodian, the child-placing agency involved in the decision to place the Indian child shall give notice as described in section 260.761 of the placement to the Indian child's parent, parents, Indian custodian, and the Tribal social services agency within seven days of placement, excluding weekends and holidays.\nIf a child-placing agency makes a temporary voluntary placement pending a decision on adoption by an Indian child's parent or Indian custodian, notice of the placement shall be given to the Indian child's parents, Tribal social services agency, and the Indian custodian upon the filing of a petition for termination of parental rights or three months following the temporary placement, whichever occurs first.\nIn an administrative review of a voluntary foster care placement, the Tribal social services agency of the child, the Indian custodian, and the parents of the child shall have notice and a right of intervention and participation in the review.\nWhere any parent or Indian custodian voluntarily consents to a child placement or to termination of parental rights or adoption, the consent shall not be valid unless executed in writing and recorded before a judge and accompanied by the presiding judge's finding that the terms and consequences of the consent were fully explained in detail and were fully understood by the parent or Indian custodian. The court shall also find that either the parent or Indian custodian fully understood the explanation in English or that it was interpreted into a language the parent or Indian custodian understood. Any consent given prior to, or within ten days after, the birth of an Indian child shall not be valid.\nAny parent or Indian custodian may withdraw consent to a child placement at any time and, upon the withdrawal of consent, the child shall be returned to the parent or the Indian custodian. Upon demand by the parent or Indian custodian of an Indian child, the child-placing agency that placed the child shall return the child in voluntary foster care placement to the parent or Indian custodian within 24 hours of the receipt of the demand. If the request for return does not satisfy the requirement of section 260.755, subdivision 5, the child-placing agency shall immediately inform the parent or Indian custodian of the Indian child of the requirement.\nIn any voluntary proceeding for termination of parental rights to, or adoptive placement of, an Indian child, the consent of the parent may be withdrawn for any reason at any time prior to the entry of a final decree of termination or adoption, as the case may be, and the child shall be returned to the parent.\nAfter the entry of a final decree of adoption of an Indian child in any state court, the Indian child's parent may withdraw consent upon the grounds that consent was obtained through fraud or duress and may petition the court to vacate the decree. Upon a finding that consent was obtained through fraud or duress, the court shall vacate the decree and return the Indian child to the Indian child's parent. No adoption that has been effective for at least two years may be invalidated under the provisions of this subdivision unless otherwise permitted under a provision of state law.\n[Renumbered subd 1a]",
	"repealed": false
}