{
	"id": "169.443",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.443",
	"title": "169.443 SAFETY OF SCHOOL CHILDREN; BUS DRIVER'S DUTIES.",
	"text": "A driver of a school bus shall activate the prewarning flashing amber signals of the bus before stopping to load or unload school children. The driver shall activate and continuously operate the amber signals for a distance of at least 100 feet before stopping in a speed zone of 35 miles per hour or less and at least 300 feet before stopping in a speed zone of more than 35 miles per hour. On stopping for this purpose, the driver shall extend the stop-signal arm system and activate the flashing red signals. The driver shall not retract the stop-signal arm system nor extinguish the flashing red signals until loading or unloading is completed, students are seated, and children who must cross the roadway are safely across.\n(a) The stop-signal arm system of a school bus must be used in conjunction with the flashing red signals only when the school bus is stopped on a street or highway to load or unload school children.\n(b) A local authority, including the governing body of an Indian tribe, may by ordinance require that a school bus activate the stop-signal arm system and flashing red signals while stopped to unload school children at a location other than a location on a street or highway. The ordinance must designate each location where the requirement is imposed. The requirement is effective only if the local authority has erected signs at or near the location to provide adequate notice that other vehicles are required to obey section 169.444, subdivision 1, when those signals are activated.\n(c) A school bus driver is prohibited from loading or unloading passengers in a designated right-turn lane or in a lane immediately adjacent to a designated right-turn lane unless:\n(1) a school bus stop designated by the district transportation safety director is located in the right-turn lane;\n(2) the driver stops the bus at the extreme right side of the right-turn lane; and\n(3) the driver activates the prewarning flashing amber signals, flashing red signals, and stop-signal arm, unless the school board or its designee, based on safety considerations, provides written direction to the driver not to do so.\nAfter loading or unloading passengers, the school bus driver may re-enter the right-hand lane of traffic without turning right. The school bus must indicate the intent to enter the right-hand lane of traffic by activating a flashing left turn signal.\nSchool bus drivers shall not activate the prewarning flashing amber signals or flashing red signals and shall not use the stop arm signal:\n(1) in special school bus loading areas where the bus is entirely off the traveled portion of the roadway and where no other motor vehicle traffic is moving or is likely to be moving within 20 feet of the bus;\n(2) when directed not to do so, in writing, by the local school board;\n(3) when a school bus is being used on a street or highway for purposes other than the actual transportation of school children to or from school or a school-approved activity, except as provided in subdivision 8;\n(4) at railroad grade crossings;\n(5) when operating the bus under section 169.4475; and\n(6) when loading and unloading people at designated school bus stops where people are not required to cross the street or highway, while the bus is completely off the traveled portion of a roadway that has adequate shoulders. The driver shall drive the bus completely off the traveled portion of this roadway before loading or unloading people. A school bus stop is designated under this clause if the transportation director of the school district in which the bus stop is located, in consultation with the road authority, certifies the integrity of the shoulder and the safety of the location for loading and unloading people. Each designated school bus stop must be documented and approved by the school board.\nWhere school children must cross a roadway before getting on or after getting off the school bus, the driver of the school bus or a school bus patrol may supervise the crossing, using the standard school patrol flag or signal as approved and prescribed by the commissioner of public safety. Before moving the school bus, the driver of the bus shall visually determine that all children have crossed the roadway and that those who are to do so have boarded the school bus.\nWhen children are getting off a school bus or Head Start bus, the driver shall visually determine that they are a safe distance from the bus before moving the bus.\nThe driver of a type III vehicle shall load or unload school children or Head Start passengers only from the right-hand side of the vehicle, provided that on a one-way street the driver shall load or unload school children or Head Start passengers only from the curb side of the vehicle. When loading or unloading school children or Head Start passengers, the driver shall activate the vehicle's four-way hazard lights described in section 169.59, subdivision 4.\nA person who violates this section is guilty of a misdemeanor.\nA school bus that transports over regular routes and on regular schedules persons age 18 or under to and from a regularly scheduled recreational or educational activity must comply with subdivisions 1 and 7. Notwithstanding section 169.441, subdivision 3, a school bus may provide such transportation only if (1) the \"school bus\" sign is plainly visible; (2) the school bus has a valid certificate of inspection under section 169.451; (3) the driver of the school bus possesses a driver's license with a valid school bus endorsement under section 171.10; and (4) the entity that organizes the recreational or educational activity, or the contractor who provides the school buses to the entity, consults with the superintendent of the school district in which the activity is located or the superintendent's designee on the safety of the regular routes used.\n(a) As used in this subdivision, \"school bus\" has the meaning given in section 169.011, subdivision 71. In addition, the term includes type III vehicles as defined in section 169.011, subdivision 71, when driven by employees or agents of school districts.\n(b) A school bus driver may not operate a school bus while communicating over, or otherwise operating, a cellular phone for personal reasons, whether handheld or hands free, when the vehicle is in motion or a part of traffic.",
	"repealed": false
}