{
	"id": "119A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/119A.08",
	"title": "119A.08 NEIGHBORHOOD-BASED SERVICES FOR CHILDREN AND FAMILIES.",
	"text": "The commissioner may establish a pilot project for family services collaboratives to deliver and broker services through neighborhood-based community organizations.\n(a) A family services collaborative under section 142D.15 may apply to the commissioner to participate in the pilot project in specified geographic areas. The selected collaborative must implement the program through family service centers and eligible community groups that have strong ties to a local neighborhood and represent the diversity of residents and that have a history of providing services in the neighborhood.\n(b) An eligible organization must submit an application to the sponsoring family services collaborative with a description of areas to be served, a neighborhood presence, the needs of the area, the services to be provided with associated costs and resources, the intended outcomes, and the proposed methods of delivering service through volunteers, including any reimbursement or incentive not to exceed $200 for any service. Proposed services and amounts must be listed in an outcomes-based format.\nA participating center or group may deliver, or arrange for the delivery of, needed services listed in the application including assisting family members to achieve the commissioner-selected high school equivalency requirements; assisting with English as a second language or citizenship classes and tests; assisting with access to early childhood programs, childhood immunizations, suitable child care, and home visits; and assisting in crime prevention through after-school enrichment activities, truancy prevention, and tutoring for academically underachieving children.\nA collaborative that receives a grant under this section shall establish procedures to ensure the quality of the services paid for with grant funds and to monitor the delivery of services.",
	"repealed": false
}