{
	"id": "302A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.011",
	"title": "302A.011 DEFINITIONS.",
	"text": "For the purposes of this chapter, unless the language or context clearly indicates that a different meaning is intended, the words, terms, and phrases defined in this section have the meanings given them.\n[Repealed, 2006 c 250 art 1 s 45]\n\"Address\" means mailing address, including a zip code. In the case of a registered office or principal executive office, the term means the mailing address and the actual office location which shall not be a post office box.\n\"Articles\" means, in the case of a corporation incorporated under or governed by this chapter, articles of incorporation, articles of amendment, a resolution of election to become governed by this chapter, a demand retaining the two-thirds majority for shareholder approval of certain transactions, a statement of change of registered office, registered agent, or name of registered agent, a statement establishing or fixing the rights and preferences of a class or series of shares, a statement of cancellation of authorized shares, articles of merger, articles of conversion, articles of abandonment, and articles of dissolution. In the case of a foreign corporation, the term includes all documents serving a similar function required to be filed with the secretary of state or other officer of the foreign corporation's state of incorporation. In the case of a corporation formed under chapter 300, the term means the certificate of incorporation.\n\"Board\" means the board of directors of a corporation.\n\"Class,\" when used with reference to shares, means a category of shares that differs in designation or one or more rights or preferences from another category of shares of the corporation.\n\"Closely held corporation\" means a corporation which does not have more than 35 shareholders.\n\"Constituent corporation\" means a corporation or a foreign corporation that:\n(1) in a merger is either the surviving corporation or a domestic or foreign corporation that is merged into the surviving organization; or\n(2) in an exchange is either the acquiring organization or a corporation whose shares are acquired by the acquiring organization.\n\"Corporation\" or \"domestic corporation\" means a corporation, other than a foreign corporation, organized for profit and incorporated under or governed by this chapter.\n\"Director\" means a member of the board.\n\"Distribution\" means a direct or indirect transfer of money or other property, other than its own shares, with or without consideration, or an incurrence or issuance of indebtedness, by a corporation to any of its shareholders in respect of its shares. A distribution may be in the form of a dividend or a distribution in liquidation, or as consideration for the purchase, redemption, or other acquisition of its shares, or otherwise.\n\"Filed with the secretary of state\" means that a document meeting the applicable requirements of this chapter, signed and accompanied by a filing fee of $35, has been delivered to the secretary of state of this state. The secretary of state shall endorse on the document the word \"Filed\" and the month, day, and year of filing, record the document in the Office of the Secretary of State, and return a document to the person who delivered it for filing.\n\"Foreign corporation\" means an organization organized for profit that is incorporated under laws other than the laws of this state for a purpose or purposes for which a corporation may be incorporated under this chapter.\n\"Good faith\" means honesty in fact in the conduct of the act or transaction concerned.\n\"Intentionally\" means that the person referred to either has a purpose to do or fail to do the act or cause the result specified or believes that the act or failure to act, if successful, will cause that result. A person \"intentionally\" violates a statute if the person intentionally does the act or causes the result prohibited by the statute, or if the person intentionally fails to do the act or cause the result required by the statute, even though the person may not know of the existence or constitutionality of the statute or the scope or meaning of the terms used in the statute.\nA person \"knows\" or has \"knowledge\" of a fact when the person has actual knowledge of it. A person does not \"know\" or have \"knowledge\" of a fact merely because the person has reason to know of the fact.\n\"Legal representative\" means a person empowered to act for another person, including, but not limited to, an agent, officer, partner, or associate of, an organization; a trustee of a trust; a personal representative; an executor of a will; an administrator of an estate; a trustee in bankruptcy; and a receiver, guardian, custodian, or conservator of a person or a person's estate.\n(a) \"Notice\" is given by a shareholder of a corporation to the corporation or an officer of the corporation when in writing and mailed or delivered to the corporation or the officer at the registered office or principal executive office of the corporation.\n(b) In all other cases, \"notice\" is given to a person when:\n(1) mailed to the person at an address designated by the person or at the last known address of the person; or\n(2) deposited with a nationally recognized overnight delivery service for overnight delivery or, if overnight delivery to the person is not available, for delivery as promptly as practicable, to the person at an address designated by the person or at the last known address of the person; or\n(3) communicated to the person orally; or\n(4) handed to the person; or\n(5) left at the office of the person with a clerk or other person in charge of the office, or if there is no one in charge, when left in a conspicuous place in the office, or if the office is closed or the person to be notified has no office, when left at the dwelling house or usual place of abode of the person with some person of suitable age and discretion then residing therein.\n(c) Notice is also given by a publicly held corporation to a shareholder if the notice is addressed to the shareholder or group of shareholders in a manner permitted by the rules and regulations under the Securities Exchange Act of 1934, provided that the corporation has first received any affirmative written consent or implied consent required under those rules and regulations.\n(d) Notice by mail is given when deposited in the United States mail with sufficient postage affixed. Notice by deposit for delivery is given when deposited for delivery as provided in paragraph (b), clause (2), after having made sufficient arrangements for payment by the sender.\n(e) Notice is deemed received when it is given.\n\"Officer\" means the chief executive officer, the chief financial officer, a person elected, appointed, or otherwise designated as an officer pursuant to section 302A.311, and any other person deemed elected as an officer pursuant to section 302A.321. The term does not include a person elected, appointed, or otherwise designated chair of the board of the corporation, unless otherwise provided in the articles or bylaws.\n\"Organization\" means a general partnership, including a limited liability partnership, limited partnership, including a limited liability limited partnership, limited liability company, business trust, corporation, or any other person having a governing statute. The term includes a domestic or foreign organization regardless of whether organized for profit.\n\"Outstanding shares\" means all shares duly issued and not reacquired by a corporation.\n\"Parent\" of a specified corporation means an organization that directly, or indirectly through related organizations, owns more than 50 percent of the voting power of the shares or other ownership interests entitled to vote for directors or other members of the governing body of the specified organization.\n\"Person\" includes a natural person, an organization, and any other association, business trust, estate, trust, enterprise, and any other legal or commercial entity.\n\"Principal executive office\" means an office where the elected or appointed chief executive officer of a corporation has an office. If the corporation has no elected or appointed chief executive officer, \"principal executive office\" means the registered office of the corporation.\n\"Registered office\" means the place in this state designated in the articles of a corporation as the registered office of the corporation.\n\"Related organization\" of a specified corporation means:\n(1) a parent or subsidiary of the specified corporation;\n(2) another subsidiary of a parent of the specified corporation;\n(3) a limited liability company owning, directly or indirectly, more than 50 percent of the voting power of the shares entitled to vote for directors of the specified corporation;\n(4) a limited liability company having more than 50 percent of the voting power of its membership interests entitled to vote for members of its governing body owned directly or indirectly by the specified corporation;\n(5) a limited liability company having more than 50 percent of the voting power of its membership interests entitled to vote for members of its governing body owned directly or indirectly either (i) by a parent of the specified corporation or (ii) a limited liability company owning, directly or indirectly, more than 50 percent of the voting power of the shares entitled to vote for directors of the specified corporation; or\n(6) a corporation having more than 50 percent of the voting power of its shares entitled to vote for directors owned directly or indirectly by a limited liability company owning, directly or indirectly, more than 50 percent of the voting power of the shares entitled to vote for directors of the specified corporation.\n\"Security\" has the meaning given it in section 80A.41(30).\n\"Series\" means a category of shares, within a class of shares authorized or issued by a corporation by or pursuant to its articles, that have some of the same rights and preferences as other shares within the same class, but that differ in designation or one or more rights and preferences from another category of shares within that class.\n\"Share\" means one of the units, however designated, into which the shareholders' ownership interests in a corporation are divided.\n\"Shareholder\" means a person registered on the books or records of a corporation or its transfer agent or registrar as the owner of whole or fractional shares of the corporation.\n(a) \"Signed\" means that the signature of a person has been written on a document, as provided in section 645.44, subdivision 14, and, with respect to a document required by this chapter to be filed with the secretary of state, means that the document has been signed by a person authorized to do so by this chapter, the articles or bylaws, or a resolution approved by the directors as required by section 302A.237 or the shareholders as required by section 302A.437.\n(b) A signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.\n\"Subsidiary\" of a specified organization means an organization having more than 50 percent of the voting power of its shares or other ownership interests entitled to vote for directors or other members of the governing body of the organization owned directly, or indirectly through related organizations, by the specified organization.\n\"Surviving corporation\" means the domestic or foreign corporation resulting from a merger.\n[Repealed, 1997 c 10 art 1 s 33]\n\"Vote\" includes authorization by written action.\n[Repealed, 1982 c 497 s 73]\n\"Written action\" means a record signed, or consented to by authenticated electronic communication, by all of the persons required to take the action described. The term also means the counterparts of a record signed, or consented to by authenticated electronic communication, by any of the persons taking the action described. Each counterpart constitutes the action of the persons signing or so consenting to it, and all the counterparts, taken together, constitute one written action by all of the persons signing or so consenting to them.\n\"Acquiring person\" means a person that makes or proposes to make a control share acquisition. When two or more persons act as a partnership, limited partnership, syndicate, or other group pursuant to any written or oral agreement, arrangement, relationship, understanding, or otherwise for the purposes of acquiring, owning, or voting shares of an issuing public corporation, all members of the partnership, syndicate, or other group constitute a \"person.\"\n\"Acquiring person\" does not include (a) a licensed broker/dealer or licensed underwriter who (1) purchases shares of an issuing public corporation solely for purposes of resale to the public and (2) is not acting in concert with an acquiring person, or (b) a person who becomes entitled to exercise or direct the exercise of a new range of voting power within any of the ranges specified in section 302A.671, subdivision 2, paragraph (d), solely as a result of a repurchase of shares by, or recapitalization of, the issuing public corporation or similar action unless (1) the repurchase, recapitalization, or similar action was proposed by or on behalf of, or pursuant to any written or oral agreement, arrangement, relationship, understanding, or otherwise with, the person or any affiliate or associate of the person or (2) the person thereafter acquires beneficial ownership, directly or indirectly, of outstanding shares entitled to vote of the issuing public corporation and, immediately after the acquisition, is entitled to exercise or direct the exercise of the same or a higher range of voting power under section 302A.671, subdivision 2, paragraph (d), as the person became entitled to exercise as a result of the repurchase, recapitalization, or similar action.\n\"Control share acquisition\" means an acquisition, directly or indirectly, by an acquiring person of beneficial ownership of shares of an issuing public corporation that, except for section 302A.671, would, when added to all other shares of the issuing public corporation beneficially owned by the acquiring person, entitle the acquiring person, immediately after the acquisition, to exercise or direct the exercise of a new range of voting power within any of the ranges specified in section 302A.671, subdivision 2, paragraph (d), but does not include any of the following:\n(a) an acquisition before, or pursuant to an agreement entered into before, August 1, 1984;\n(b) an acquisition by a donee pursuant to an inter vivos gift not made to avoid section 302A.671 or by a distributee as defined in section 524.1-201, clause (10);\n(c) an acquisition pursuant to a security agreement not created to avoid section 302A.671;\n(d) an acquisition under sections 302A.601 to 302A.661, if the issuing public corporation is a party to the transaction;\n(e) an acquisition from the issuing public corporation;\n(f) an acquisition for the benefit of others by a person acting in good faith and not made to avoid section 302A.671, to the extent that the person may not exercise or direct the exercise of the voting power or disposition of the shares except upon the instruction of others;\n(g) an acquisition pursuant to a savings, employee stock ownership, or other employee benefit plan of the issuing public corporation or any of its subsidiaries, or by a fiduciary of the plan acting in a fiduciary capacity pursuant to the plan; or\n(h) an acquisition pursuant to an offer to purchase for cash pursuant to a tender offer, or to exchange for stock pursuant to an exchange offer, all shares of the voting stock of the issuing public corporation:\n(1) that has been approved by a majority vote of the members of a committee composed solely of one or more disinterested members of the board of the issuing public corporation formed pursuant to section 302A.673, subdivision 1, paragraph (d), before the commencement of, or the public announcement of the intent to commence, the tender or exchange offer; and\n(2) pursuant to which the acquiring person will become the owner of over 50 percent of the voting stock of the issuing public corporation outstanding at the time of the transaction.\nFor purposes of this subdivision, shares beneficially owned by a plan described in clause (g), or by a fiduciary of a plan described in clause (g) pursuant to the plan, are not deemed to be beneficially owned by a person who is a fiduciary of the plan.\n\"Issuing public corporation\" means either: (1) a publicly held corporation that has at least 50 shareholders; or (2) any other corporation that has at least 100 shareholders, provided that if, before January 1, 1998, a corporation that has at least 50 shareholders elects to be an issuing public corporation by express amendment contained in the articles or bylaws, including bylaws approved by the board, that corporation is an issuing public corporation if it has at least 50 shareholders.\n\"Publicly held corporation\" means a corporation that has a class of equity securities registered pursuant to section 12, or is subject to section 15(d), of the Securities Exchange Act of 1934.\n(a) \"Beneficial owner,\" when used with respect to shares or other securities, includes, but is not limited to, any person who, directly or indirectly through any written or oral agreement, arrangement, relationship, understanding, or otherwise, has or shares the power to vote, or direct the voting of, the shares or securities or has or shares the power to dispose of, or direct the disposition of, the shares or securities, except that:\n(1) a person shall not be deemed the beneficial owner of shares or securities tendered pursuant to a tender or exchange offer made by the person or any of the person's affiliates or associates until the tendered shares or securities are accepted for purchase or exchange; and\n(2) a person shall not be deemed the beneficial owner of shares or securities with respect to which the person has the power to vote or direct the voting arising solely from a revocable proxy given in response to a proxy solicitation required to be made and made in accordance with the applicable rules and regulations under the Securities Exchange Act of 1934 and is not then reportable under that act on a Schedule 13D or comparable report, or, if the corporation is not subject to the rules and regulations under the Securities Exchange Act of 1934, would have been required to be made and would not have been reportable if the corporation had been subject to the rules and regulations.\n(b) \"Beneficial ownership\" includes, but is not limited to, the right to acquire shares or securities through the exercise of options, warrants, or rights, or the conversion of convertible securities, or otherwise. The shares or securities subject to the options, warrants, rights, or conversion privileges held by a person shall be deemed to be outstanding for the purpose of computing the percentage of outstanding shares or securities of the class or series owned by the person, but shall not be deemed to be outstanding for the purpose of computing the percentage of the class or series owned by any other person. A person shall be deemed the beneficial owner of shares and securities beneficially owned by any relative or spouse of the person or any relative of the spouse, residing in the home of the person, any trust or estate in which the person owns ten percent or more of the total beneficial interest or serves as trustee or executor or in a similar fiduciary capacity, any organization in which the person owns ten percent or more of the equity, and any affiliate of the person.\n(c) When two or more persons act or agree to act as a partnership, limited partnership, syndicate, or other group for the purposes of acquiring, owning, or voting shares or other securities of a corporation, all members of the partnership, syndicate, or other group are deemed to constitute a \"person\" and to have acquired beneficial ownership, as of the date they first so act or agree to act together, of all shares or securities of the corporation beneficially owned by the person.\n\"Interested shares\" means the shares of an issuing public corporation beneficially owned by any of the following persons: (1) the acquiring person, (2) any officer of the issuing public corporation, or (3) any employee of the issuing public corporation who is also a director of the issuing public corporation.\n\"Affiliate\" means a person that directly or indirectly controls, is controlled by, or is under common control with, a specified person.\n\"Announcement date,\" when used in reference to any business combination, means the date of the first public announcement of the final, definitive proposal for the business combination.\n\"Associate,\" when used to indicate a relationship with any person, means any of the following:\n(1) any organization of which the person is an officer or partner or is, directly or indirectly, the beneficial owner of ten percent or more of any class or series of shares entitled to vote or other equity interest;\n(2) any trust or estate in which the person has a substantial beneficial interest or as to which the person serves as trustee or executor or in a similar fiduciary capacity;\n(3) any relative or spouse of the person, or any relative of the spouse, residing in the home of the person.\n\"Business combination,\" when used in reference to any issuing public corporation and any interested shareholder of the issuing public corporation, means any of the following:\n(a) any merger of the issuing public corporation or any subsidiary of the issuing public corporation with (1) the interested shareholder or (2) any other organization (whether or not itself an interested shareholder of the issuing public corporation) that is, or after the merger would be, an affiliate or associate of the interested shareholder, but excluding (i) the merger of a wholly owned subsidiary of the issuing public corporation into the issuing public corporation, (ii) the merger of two or more wholly owned subsidiaries of the issuing public corporation, or (iii) the merger of an organization, other than an interested shareholder or an affiliate or associate of an interested shareholder, with a wholly owned subsidiary of the issuing public corporation pursuant to which the surviving organization, immediately after the merger, becomes a wholly owned subsidiary of the issuing public corporation;\n(b) any exchange, pursuant to a plan of exchange under section 302A.601, subdivision 2, or a comparable statute of any other state or jurisdiction, of shares or other securities of the issuing public corporation or any subsidiary of the issuing corporation or money, or other property for shares, other securities, money, or property of (1) the interested shareholder or (2) any other organization (whether or not itself an interested shareholder of the issuing public corporation) that is, or after the exchange would be, an affiliate or associate of the interested shareholder, but excluding the exchange of shares of a domestic or foreign corporation, other than an interested shareholder or an affiliate or associate of an interested shareholder, pursuant to which the domestic or foreign corporation, immediately after the exchange, becomes a wholly owned subsidiary of the issuing public corporation;\n(c) any sale, lease, exchange, mortgage, pledge, transfer, or other disposition (in a single transaction or a series of transactions), other than sales of goods or services in the ordinary course of business or redemptions pursuant to section 302A.671, subdivision 6, to or with the interested shareholder or any affiliate or associate of the interested shareholder, other than to or with the issuing public corporation or a wholly owned subsidiary of the issuing public corporation, of assets of the issuing public corporation or any subsidiary of the issuing public corporation (1) having an aggregate market value equal to ten percent or more of the aggregate market value of all the assets, determined on a consolidated basis, of the issuing public corporation, (2) having an aggregate market value equal to ten percent or more of the aggregate market value of all the outstanding shares of the issuing public corporation, or (3) representing ten percent or more of the earning power or net income, determined on a consolidated basis, of the issuing public corporation except a cash dividend or distribution paid or made pro rata to all shareholders of the issuing public corporation;\n(d) the issuance or transfer by the issuing public corporation or any subsidiary of the issuing public corporation (in a single transaction or a series of transactions) of any shares of, or other ownership interests in, the issuing public corporation or any subsidiary of the issuing public corporation that have an aggregate market value equal to five percent or more of the aggregate market value of all the outstanding shares of the issuing public corporation to the interested shareholder or any affiliate or associate of the interested shareholder, except pursuant to the exercise of warrants or rights to purchase shares offered, or a dividend or distribution paid or made, pro rata to all shareholders of the issuing public corporation other than for the purpose, directly or indirectly, of facilitating or effecting a subsequent transaction that would have been a business combination if the dividend or distribution had not been made;\n(e) the adoption of any plan or proposal for the liquidation or dissolution of the issuing public corporation, or any reincorporation of the issuing public corporation in another state or jurisdiction, proposed by or on behalf of, or pursuant to any written or oral agreement, arrangement, relationship, understanding, or otherwise with, the interested shareholder or any affiliate or associate of the interested shareholder;\n(f) any reclassification of securities (including without limitation any share dividend or split, reverse share split, or other distribution of shares in respect of shares), recapitalization of the issuing public corporation, merger of the issuing public corporation with any subsidiary of the issuing public corporation, exchange of shares of the issuing public corporation with any subsidiary of the issuing public corporation, or other transaction (whether or not with or into or otherwise involving the interested shareholder), proposed by or on behalf of, or pursuant to any written or oral agreement, arrangement, relationship, understanding, or otherwise with, the interested shareholder or any affiliate or associate of the interested shareholder, that has the effect, directly or indirectly, of increasing the proportionate share of the outstanding shares of any class or series of shares entitled to vote, or securities that are exchangeable for, convertible into, or carry a right to acquire shares entitled to vote, of the issuing public corporation or any subsidiary of the issuing public corporation that is, directly or indirectly, owned by the interested shareholder or any affiliate or associate of the interested shareholder, except as a result of immaterial changes due to fractional share adjustments;\n(g) any receipt by the interested shareholder or any affiliate or associate of the interested shareholder of the benefit, directly or indirectly (except proportionately as a shareholder of the issuing public corporation), of any loans, advances, guarantees, pledges, or other financial assistance, or any tax credits or other tax advantages provided by or through the issuing public corporation or any subsidiary of the issuing public corporation.\n\"Consummation date,\" with respect to any business combination, means the date of consummation of the business combination or, in the case of a business combination as to which a shareholder vote is taken, the later of (1) the business day before the vote or (2) 20 days before the date of consummation of the business combination.\n\"Control,\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with,\" means the possession, directly or indirectly, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of voting securities, by contract, or otherwise. A person's beneficial ownership of ten percent or more of the voting power of a corporation's outstanding shares entitled to vote in the election of directors creates a presumption that the person has control of the corporation. Notwithstanding the foregoing, a person is not considered to have control of a corporation if the person holds voting power, in good faith and not for the purpose of avoiding section 302A.673, as an agent, bank, broker, nominee, custodian, or trustee for one or more beneficial owners who do not individually or as a group have control of the corporation.\n(a) \"Interested shareholder,\" when used in reference to any issuing public corporation, means any person that is (1) the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the outstanding shares entitled to vote of the issuing public corporation or (2) an affiliate or associate of the issuing public corporation that, at any time within the four-year period immediately before the date in question, was the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the then outstanding shares entitled to vote of the issuing public corporation.\n(b) If a person who has not been a beneficial owner of ten percent or more of the voting power of the outstanding shares entitled to vote of the issuing public corporation immediately prior to a repurchase of shares by, or recapitalization of, the issuing public corporation or similar action shall become a beneficial owner of ten percent or more of the voting power solely as a result of the share repurchase, recapitalization, or similar action, the person shall not be deemed to be the beneficial owner of ten percent or more of the voting power for purposes of paragraph (a), clause (1) or (2), unless:\n(1) the repurchase, recapitalization, conversion, or similar action was proposed by or on behalf of, or pursuant to any agreement, arrangement, relationship, understanding, or otherwise (whether or not in writing) with, the person or any affiliate or associate of the person; or\n(2) the person thereafter acquires beneficial ownership, directly or indirectly, of outstanding shares entitled to vote of the issuing public corporation and, immediately after the acquisition, is the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the outstanding shares entitled to vote of the issuing public corporation.\n(c) Interested shareholder does not include:\n(1) the issuing public corporation or any of its subsidiaries;\n(2) a savings, employee stock ownership, or other employee benefit plan of the issuing public corporation or its subsidiary, or a fiduciary of the plan when acting in a fiduciary capacity pursuant to the plan; or\n(3) a licensed broker/dealer or licensed underwriter who:\n(i) purchases shares of an issuing public corporation solely for purposes of resale to the public; and\n(ii) is not acting in concert with an interested shareholder.\n(d) For purposes of this subdivision, shares beneficially owned by a plan described in paragraph (c), clause (2), or by a fiduciary of a plan described in paragraph (c), clause (2), pursuant to the plan, are not deemed to be beneficially owned by a person who is a fiduciary of the plan.\n\"Market value,\" when used in reference to shares or other property of any corporation, means the following:\n(a) In the case of shares, the average closing sale price of a share during the 30 trading days immediately preceding the date in question or, with respect to the references in section 302A.553, subdivision 3, if a person or persons selling the shares have commenced a tender offer or have announced an intention to seek control of the corporation, during the 30 trading days preceding the earlier of the commencement of the tender offer or the making of the announcement, in either case:\n(1) on the composite tape for New York Stock Exchange listed shares; or\n(2) if the shares are not quoted on the composite tape or not listed on the New York Stock Exchange, on the principal United States securities exchange registered under the Securities Exchange Act of 1934, which may include the NASDAQ Stock Market, on which the shares are listed; or\n(3) if the shares are not listed on any such exchange, on any system then in use.\nIf no quotation under clauses (1) through (3) is available, then the market value is the fair market value on the date in question of the shares as determined in good faith by the board of the corporation.\n(b) In the case of property other than cash or shares, the fair market value of the property on the date in question as determined in good faith by the board of the corporation.\n\"Share acquisition date,\" with respect to any person and any issuing public corporation, means the date that the person first becomes an interested shareholder of the issuing public corporation. Notwithstanding the foregoing provisions of this subdivision:\n(a) if a person becomes, on one or more dates, an interested shareholder of the issuing public corporation, but thereafter ceases to be an interested shareholder of the issuing public corporation, and subsequently again becomes an interested shareholder, \"share acquisition date,\" with respect to that person means the date on which the person most recently became an interested shareholder of the issuing public corporation; and\n(b) if, on or after August 1, 2004, a person is the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the outstanding shares entitled to vote of the issuing public corporation at the time the issuing public corporation becomes a publicly held corporation, \"share acquisition date,\" with respect to that person means the date on which the person first became the beneficial owner, directly or indirectly, of ten percent or more of the voting power of the outstanding shares entitled to vote of the corporation.\n\"Offeror\" means a person who makes or in any way participates in making a takeover offer. Offeror does not include a bank or broker-dealer loaning funds to an offeror in the ordinary course of its business or a bank, broker-dealer, attorney, accountant, consultant, employee, or other person furnishing information or advice to or performing ministerial duties for an offeror and not otherwise participating in the takeover offer. When two or more persons act as a partnership, limited partnership, syndicate, or other group pursuant to any agreement, arrangement, relationship, understanding, or otherwise, whether or not in writing, for the purpose of acquiring, owning, or voting shares of a target company, all members of the partnership, syndicate, or other group constitute \"a person.\"\n(a) \"Takeover offer\" means an offer to acquire shares of an issuing public corporation from a shareholder pursuant to a tender offer or request or invitation for tenders, if, after the acquisition of all shares acquired pursuant to the offer:\n(1) the offeror would be directly or indirectly a beneficial owner of more than ten percent of any class or series of the outstanding shares of the issuing public corporation and was directly or indirectly the beneficial owner of ten percent or less of that class or series of the outstanding shares of the issuing public corporation before commencement of the offer; or\n(2) the beneficial ownership by the offeror of any class or series of the outstanding shares of the issuing public corporation would be increased by more than ten percent of that class or series and the offeror was directly or indirectly the beneficial owner of ten percent or more of any class or series of the outstanding shares of the issuing public corporation before commencement of the offer.\n(b) Takeover offer does not include:\n(1) an offer in connection with the acquisition of a share which, together with all other acquisitions by the offeror of shares of the same class or series of shares of the issuer, would not result in the offeror having acquired more than two percent of that class or series during the preceding 12-month period;\n(2) an offer by the issuer to acquire its own shares unless the offer is made during the pendency of a takeover offer by a person who is not an associate or affiliate of the issuer;\n(3) an offer in which the issuing public corporation is an insurance company subject to regulation by the commissioner of commerce, a financial institution regulated by the commissioner, or a public service utility subject to regulation by the public utilities commission.\n\"Division\" or \"combination\" means dividing or combining shares of a class or series, whether issued or unissued, into a greater or lesser number of shares of the same class or series.\n\"Acquiring organization\" means a corporation, foreign corporation, or domestic or foreign limited liability company that acquires in an exchange the shares of a corporation or foreign corporation or the membership interests of a domestic or foreign limited liability company.\n\"Constituent organization\" means a corporation, foreign corporation, limited liability company or foreign limited liability company that:\n(1) in a merger is either the surviving organization or an organization that is merged into the surviving organization; or\n(2) in an exchange is either the acquiring organization or an organization whose securities are acquired by the acquiring organization.\n\"Owners\" means shareholders in the case of a corporation or foreign corporation and members in the case of a limited liability company.\n\"Ownership interests\" means shares in the case of a corporation or foreign corporation, membership interests in the case of a limited liability company, and governance or transferable interests in the case of any other organization.\n\"Surviving organization\" means the corporation or foreign corporation or domestic or foreign limited liability company resulting from a merger.\n\"Electronic communication\" means any form of communication, not directly involving the physical transmission of paper, that creates a record that may be retained, retrieved, and reviewed by a recipient of the communication, and that may be directly reproduced in paper form by the recipient through an automated process.\n\"Remote communication\" means communication via electronic communication, conference telephone, video conference, the Internet, or such other means by which persons not physically present in the same location may communicate with each other on a substantially simultaneous basis.\n\"Authenticated\" means, with respect to an electronic communication, that the communication is delivered to the principal place of business of the corporation, or to an officer or agent of the corporation authorized by the corporation to receive the communication, and that the communication sets forth information from which the corporation can reasonably conclude that the communication was sent by the purported sender.\n\"Converted organization\" means the organization into which a converting organization converts pursuant to sections 302A.682 to 302A.692.\n\"Converting organization\" means an organization that converts into another organization pursuant to sections 302A.682 to 302A.692.\n\"Governing body\" means the body of an organization selected by its owners that has the ultimate power to determine the organization's policies and control its activities. The governing body of a domestic corporation is its board of directors, and the governing body of a domestic limited liability company is its board of governors.\n\"Limited liability company\" means either a domestic or a foreign limited liability company, unless specified otherwise in this chapter.\n\"Converting corporation\" means a converting organization that is a corporation.\n\"Organizational documents\" means:\n(1) for a domestic or foreign general partnership, its partnership agreement;\n(2) for a limited partnership or foreign limited partnership, its certificate of limited partnership and partnership agreement;\n(3) for a domestic or foreign limited liability company, its certificate or articles of organization and operating agreement, or comparable documents as provided in its governing statute;\n(4) for a business trust, its agreement of trust and declaration of trust;\n(5) for a domestic or foreign corporation for profit, its articles of incorporation, bylaws, and other agreements among its shareholders that are authorized by its governing statute, or comparable documents as provided in its governing statute; and\n(6) for any other organization, the basic records that create the organization and determine its internal governance and the relations among the persons that own it, have an interest in it, or are members of it, in each case as provided or authorized by its governing statute.\n\"Personal liability\" means liability for a debt, obligation, or other liability of an organization that is imposed on a person that co-owns, has an interest in, or is a member of the organization:\n(1) by the governing statute solely by reason of the person co-owning, having an interest in, or being a member of the organization; or\n(2) by the organization's organizational documents under a provision of the governing statute authorizing those documents to make one or more specified persons liable for all or specified debts, obligations, or other liabilities of the organization solely by reason of the person or persons co-owning, having an interest in, or being a member of the organization.\n\"Governing statute\" means the statute that governs an organization's internal affairs.\n\"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.",
	"repealed": false
}