{
	"id": "137.0245",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.0245",
	"title": "137.0245 REGENT CANDIDATE ADVISORY COUNCIL.",
	"text": "A Regent Candidate Advisory Council is established to assist in determining criteria for, and identifying and recruiting qualified candidates for membership on the Board of Regents and making recommendations to the joint legislative committee described in section 137.0246, subdivision 2.\nThe Regent Candidate Advisory Council shall consist of 24 members. Twelve members shall be appointed by the majority leader of the senate. Twelve members shall be appointed by the speaker of the house. Each appointing authority must appoint one member who is a student enrolled in a degree program at the University of Minnesota at the time of appointment. No more than one-third of the members appointed by each appointing authority may be current or former legislators. No more than two-thirds of the members appointed by each appointing authority may belong to the same political party; however, political activity or affiliation is not required for the appointment of any member. Geographical representation must be taken into consideration when making appointments. Section 15.0575 shall govern the advisory council, except that:\n(1) the members shall be appointed to six-year terms with one-third appointed each even-numbered year; and\n(2) student members are appointed to two-year terms with two students appointed each even-numbered year.\nA member may not serve more than two full terms.\n(a) The advisory council shall:\n(1) develop, in consultation with current and former regents and the administration of the University of Minnesota, a statement of the selection criteria to be applied and a description of the responsibilities and duties of a regent, and shall distribute this to potential candidates; and\n(2) for each position on the board, identify and recruit qualified candidates for the Board of Regents, based on the background and experience of the candidates, their potential for discharging the responsibilities of a member of the Board of Regents, and the needs of the board. The selection criteria must not include a limitation on the number of terms an individual may serve on the Board of Regents.\n(b) The selection criteria developed under paragraph (a), clause (1), must include a criterion that regents represent diversity in geography; gender; race; occupation, including business and labor; and experience.\n(c) The selection criterion must include an identification of the membership needs of the board for individual skills relevant to the governance of the University of Minnesota and the needs for certain individual characteristics. Individual characteristics relate to qualities such as gender, race, and geographic location of residence.\n(a) The advisory council shall recommend at least two and not more than four candidates. By January 15 of each odd-numbered year, the advisory council shall submit its recommendations to the joint legislative committee described in section 137.0246, subdivision 2.\n(b) The advisory council must submit a report to the joint committee on the needs criterion identified under subdivision 3, paragraph (c), at the same time it submits its recommendations.\nThe Legislative Coordinating Commission shall provide administrative and support services for the advisory council.\nMeetings of the council or subcommittees of the council must be open to the public and are subject to section 3.055.",
	"repealed": false
}