{
	"id": "342.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.37",
	"title": "342.37 CANNABIS TESTING FACILITY LICENSING.",
	"text": "A cannabis testing facility license entitles the license holder to obtain and test immature cannabis plants and seedlings, cannabis flower, cannabis products, hemp plant parts, hemp concentrate, artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products from cannabis microbusinesses, cannabis mezzobusinesses, cannabis cultivators, cannabis manufacturers, cannabis wholesalers, lower-potency hemp edible manufacturers, medical cannabis combination businesses, and industrial hemp growers.\nIn addition to the information required to be submitted under section 342.14, subdivision 1, and rules adopted pursuant to that section, a person, cooperative, or business seeking a cannabis testing facility license must submit the following information in a form approved by the office:\n(1) an operating plan demonstrating the proposed layout of the facility, including a diagram of ventilation and filtration systems and policies to avoid sales to unlicensed businesses;\n(2) proof of accreditation by a laboratory accrediting organization approved by the office that, at a minimum, requires a laboratory to operate formal management systems under the International Organization for Standardization; and\n(3) evidence that the business will comply with the applicable operation requirements for the license being sought.\n(a) A person, cooperative, or business holding a cannabis testing facility license may not own or operate, or be employed by, any other cannabis business or hemp business.\n(b) The office by rule may limit the number of cannabis testing facility licenses a person or business may hold.\n(c) For purposes of this subdivision, a restriction on the number of licenses a business may hold applies to every cooperative member or every director, manager, and general partner of a cannabis business.",
	"repealed": false
}