{
	"id": "256I.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/256I.03",
	"title": "256I.03 DEFINITIONS.",
	"text": "For the purposes of sections 256I.01 to 256I.06, the terms defined in this section have the meanings given them.\n\"Agency\" has the meaning given in section 256P.01, subdivision 2.\n\"Assistance unit\" means an individual who is applying for or receiving benefits under this chapter.\n[Renumbered subd 14a]\n[Renumbered subd 10a]\n[Repealed, 1Sp1993 c 1 art 8 s 29]\n[Renumbered subd 11a]\nMS 2022 [Repealed, 2023 c 70 art 17 s 63]\n(a) \"Countable income\" means all income received by an applicant or recipient as described under section 256P.06, less any applicable exclusions or disregards.\n(b) For a recipient of any cash benefit from the SSI program who does not live in a setting described in section 256I.04, subdivision 2a, paragraph (b), clause (2), countable income equals the SSI benefit limit in effect at the time that the person is a recipient of housing support, less the personal needs allowance under section 256B.35. If the SSI limit or benefit is reduced for a person due to events other than the receipt of additional income, countable income equals actual income less any applicable exclusions and disregards.\n(c) For a recipient of any cash benefit from the SSI program who lives in a setting as described in section 256I.04, subdivision 2a, paragraph (b), clause (2), countable income equals 30 percent of the SSI benefit limit in effect at the time that a person is a recipient of housing support. If the SSI limit or benefit is reduced for a person due to events other than the receipt of additional income, countable income equals 30 percent of the actual income less any applicable exclusions and disregards. For recipients under this paragraph, the personal needs allowance described in section 256B.35 does not apply.\n(d) Notwithstanding the earned income disregard described in section 256P.03, for a recipient of unearned income as defined in section 256P.06, subdivision 3, clause (2), other than SSI and the general assistance personal needs allowance, who lives in a setting described in section 256I.04, subdivision 2a, paragraph (b), clause (2), countable income equals 30 percent of the recipient's total income after applicable exclusions and disregards. Total income includes any unearned income as defined in section 256P.06 and any earned income in the month that the person is a recipient of housing support. For recipients under this paragraph, the personal needs allowance described in section 256B.35 does not apply.\n(e) For a recipient who lives in a setting as described in section 256I.04, subdivision 2a, paragraph (b), clause (2), and receives general assistance, the personal needs allowance described in section 256B.35 is not countable unearned income.\n[Renumbered subd 14b]\n\"Date of application\" has the meaning given in section 256P.01, subdivision 2b.\n\"Direct contact\" means providing face-to-face care, training, supervision, counseling, consultation, or medication assistance to recipients of housing support.\n\"Habitability inspection\" means an inspection to determine whether the housing occupied by an individual meets the habitability standards specified by the commissioner. The standards must be provided to the applicant in writing and posted on the Department of Human Services website.\n\"Housing support\" means assistance that provides at a minimum room and board to persons who meet the eligibility requirements of section 256I.04. To receive payment for housing support, the residence must meet the requirements under section 256I.04, subdivisions 2a to 2f.\n\"Long-term homelessness\" means lacking a permanent place to live:\n(1) continuously for one year or more; or\n(2) at least four times in the past three years.\n\"MSA equivalent rate\" means an amount equal to the total of:\n(1) the combined maximum shelter and basic needs standards for MSA recipients living alone specified in section 256D.44, subdivisions 2, paragraph (a); and 3, paragraph (a); plus\n(2) the maximum allotment authorized by the federal Supplemental Nutrition Assistance Program (SNAP) for a single individual which is in effect on the first day of July each year; less\n(3) the personal needs allowance authorized for medical assistance recipients under section 256B.35.\nThe MSA equivalent rate is to be adjusted on the first day of July each year to reflect changes in any of the component rates under clauses (1) to (3).\n\"Professional statement of need\" means a statement about an individual's illness, injury, or incapacity that is signed by a qualified professional. The statement must specify that the individual has an illness or incapacity which limits the individual's ability to work and provide self-support. The statement must also specify that the individual needs assistance to access or maintain housing, as evidenced by the need for two or more of the following services:\n(1) tenancy supports to assist an individual with finding the individual's own home, landlord negotiation, securing furniture and household supplies, understanding and maintaining tenant responsibilities, conflict negotiation, and budgeting and financial education;\n(2) supportive services to assist with basic living and social skills, household management, monitoring of overall well-being, and problem solving;\n(3) employment supports to assist with maintaining or increasing employment, increasing earnings, understanding and utilizing appropriate benefits and services, improving physical or mental health, moving toward self-sufficiency, and achieving personal goals; or\n(4) health supervision services to assist in the preparation and administration of medications other than injectables, the provision of therapeutic diets, taking vital signs, or providing assistance in dressing, grooming, bathing, or with walking devices.\n\"Prospective budgeting\" has the meaning given in section 256P.01, subdivision 9.\n[See Note.]\n\"Qualified professional\" means an individual as defined in section 245G.11, subdivision 3, 4, or 5, or 256P.01, subdivision 6a; or an individual approved by the director of human services or a designee of the director.\n\"Room and board rate\" means a monthly rate set for shelter, fuel, food, utilities, household supplies, and other costs necessary to provide room and board for eligible individuals. The room and board rate does not include payments for foster care for children who are not blind, child welfare services, medical care, dental care, hospitalization, nursing care, drugs or medical supplies, program costs, or other social services. The rate is negotiated by the county agency according to the provisions of sections 256I.01 to 256I.06.\n\"Supplementary services\" means housing support services provided to individuals in addition to room and board including, but not limited to, oversight and up to 24-hour supervision, medication reminders, assistance with transportation, arranging for meetings and appointments, and arranging for medical and social services, and services identified in section 256I.03, subdivision 12.\n\"Supportive housing\" means housing that is not time-limited, provides or coordinates services necessary for a resident to maintain housing stability, and is not licensed as an assisted living facility under chapter 144G.",
	"repealed": false
}