{
	"id": "97C.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.211",
	"title": "97C.211 PRIVATE FISH HATCHERIES.",
	"text": "A person may not operate a private fish hatchery without a private fish hatchery license. A private fish hatchery is a facility for raising fish, including minnows, for sale, stocking waters, angling, or processing. A private fish hatchery license is valid for five years but must be renewed annually.\nThe commissioner shall prescribe rules that allow a person to maintain and operate a private fish hatchery to raise and dispose of fish. The commissioner shall establish and assess a fee to cover the cost of inspection and disease certification of private hatcheries.\n(a) A private fish hatchery may not obtain fish outside of the state unless the fish or the source of the fish are approved by the commissioner. The commissioner may apply more stringent requirements to fish or a source of fish from outside the state than are applied to fish and sources of fish from within the state. The commissioner must either approve or deny the acquisition within 30 days after receiving a written request for approval. Minnows acquired must be processed and not released into public waters, except as provided in section 97C.515, subdivision 4. A request may be for annual acquisition.\n(b) If the commissioner denies approval, a written notice must be submitted to the applicant stating the reasons for the denial and the commissioner must:\n(1) designate approved sources to obtain the desired fish or fish eggs; or\n(2) sell the fish or fish eggs from state fish hatcheries at fair market value.\nA person may take fish by angling without a fishing license at a licensed private fish hatchery or an artificial pool containing only fish purchased from a private fish hatchery, if the operator of the hatchery or pool furnishes each person catching fish a certificate prescribed by the commissioner. The certificate must state the number and species of the fish caught and other information as prescribed by the commissioner. A person without a fishing license may possess, ship, and transport within the state the fish caught in the same manner as fish taken by a resident with a fishing license.\nA person may not take sucker eggs from public waters for a private fish hatchery without a license to do so.\nThe commissioner may sell or barter game fish or native rough fish fry or eggs for not less than the cost associated with the production of eggs or fry.\nInformation on production, harvest, and sales of aquatic life by a private fish hatchery is nonpublic information.",
	"repealed": false
}