{
	"id": "171.168",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.168",
	"title": "171.168 NOTICE OF VIOLATION BY COMMERCIAL DRIVER.",
	"text": "Each person who operates a commercial motor vehicle, who has a commercial driver's license issued by this state, and who is convicted of a criminal offense; of a serious traffic violation, as defined in Code of Federal Regulations, title 49, part 383; or of violating any other state or local law relating to motor vehicle traffic control, other than a parking violation, in any type of motor vehicle in another state or jurisdiction, shall notify the department's Division of Driver and Vehicle Services of the conviction. The person shall notify the division within 30 days after the date that the person was convicted.\nEach person who operates a commercial motor vehicle, who has a commercial driver's license issued by this state, and who is convicted of violating, in any type of motor vehicle, a Minnesota state or local law relating to motor vehicle traffic control, other than a parking violation, shall notify the person's employer of the conviction. The person shall notify the person's employer within 30 days after the date that the person was convicted. If the person is not currently employed, the person shall notify the division according to subdivision 1.\nNotification to the division must be made in writing and contain the following information:\n(1) the driver's full name;\n(2) the driver's license number;\n(3) the date of conviction;\n(4) the specific criminal or other offense; serious traffic violation, as defined in Code of Federal Regulations, title 49, part 383; and any other violation of state or local law relating to motor vehicle traffic control, for which the person was convicted and any suspension, revocation, or cancellation of certain driving privileges that resulted from the conviction;\n(5) an indication whether the violation was in a commercial motor vehicle;\n(6) the location of the offense; and\n(7) the driver's signature.",
	"repealed": false
}