{
	"id": "219.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.551",
	"title": "219.551 LOCOMOTIVE; WATER AND TOILET FACILITY.",
	"text": "As used in this section, the following words and phrases, unless a different meaning is plainly required, have the meanings given them.\n\"Initial terminal\" means the terminal within the state of Minnesota from which an operating unit is dispatched and at which regular maintenance forces are available to repair defective water coolers and toilet facilities.\n\"Operating unit\" means a locomotive or one of the locomotives in a consist, but does not include a switch engine.\n\"Consist\" means two or more locomotives coupled together and used to propel other railroad rolling stock.\nEach operating unit or a switch engine used as a single unit when put into service from an initial terminal must be provided with paper cups and at least one gallon of potable water supplied by a water cooler which must be sanitary, clean, and operating.\nEach operating unit purchased new, not reconditioned, and put into service from an initial terminal must be equipped with a dry hopper, gas or electric incinerator, or other suitable toilet facility, if the operating unit is used for a road operation of 50 miles or more away from the initial terminal. Each consist used in road operations of 50 miles or more away from the initial terminal must have at least one operating unit equipped with a dry hopper, gas or electric incinerator, or other suitable toilet facility; provided, however, in the case of transfer or switching service or emergency or emergency need for additional diesel power equipment, this requirement does not apply. When put into service from an initial terminal, diesel toilet facilities must be sanitary, clean, and operating. Unless otherwise required by operating conditions or an emergency, the operating unit having the toilet facilities must be positioned at the head end of a consist.\nThe diesel toilet facilities and water cooler facilities required by this section must be kept sanitary, clean, and operating. When a failure of the required equipment and standards of maintenance occurs after a locomotive has commenced to move in service, the railroad operating that locomotive is not in violation of this section if the failure is corrected at the next initial terminal.\nA person, company, corporation, or its receiver operating a railroad in violation of this section is guilty of a misdemeanor and, upon conviction, is liable for a penalty of not less than $25 nor more than $200 for each offense. The use of an operating unit not equipped as provided in this section constitutes a separate offense for every day or part of a day so used. The penalty must be recovered in a suit brought in the name of the state in any court having jurisdiction in the county in which the initial terminal is situated, by the attorney general or by the county attorney of that county.",
	"repealed": false
}