{
	"id": "352D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/352D.09",
	"title": "352D.09 ADMINISTRATION.",
	"text": "The unclassified employees retirement plan and the provisions of this chapter must be administered by the Minnesota State Retirement System. The provisions of chapter 352 govern in all instances where not inconsistent with the provisions of this chapter. Fiduciary activities of the unclassified employees retirement plan must be undertaken in a manner consistent with chapter 356A.\nWhenever redemption or purchases from the supplemental retirement fund are required to be made, the executive director shall make them.\n(a) The executive director shall annually make available by electronic means to each participant the prospectus prepared by the supplemental fund, by July 1 or when received from such fund, whichever is later.\n(b) Any participant may contact the Minnesota State Retirement System and request a copy of the prospectus.\nWhenever benefits or withdrawals are authorized or required to be paid, payment shall be made only after receipt of an application signed by the person or representative authorized to receive the benefit or withdrawal; such application shall be made only on forms authorized by the executive director.\nIf the beneficiary, surviving spouse or estate has not made application for benefits within ten years after the date of the death of a participant, the value of the shares is appropriated to the general state employees retirement fund and the provisions of section 352.12, subdivision 12, govern. If a former participant fails to make a claim for benefits within five years after the termination of covered service or by age 70, whichever is later, the value of the shares is appropriated to the general state employees retirement fund and the provisions of section 352.22, subdivision 8, apply.\nIf a former participant who contributed less than $500 in employee contributions cannot be contacted by the system for five or more years, the value of the shares shall be appropriated to the general employees retirement fund, but upon subsequent contact by the former employee the account shall be reinstated to the amount that would have been payable had the money been left in the unclassified plan.\n[Repealed, 1994 c 528 art 1 s 15]\nThe board of directors shall establish a budget and charge participants a reasonable fee to pay the administrative expenses of the unclassified program. Fees may not be charged on contributions and investment returns attributable to contributions made before July 1, 1992.\n[Repealed, 1998 c 390 art 2 s 21]",
	"repealed": false
}