{
	"id": "253D.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.29",
	"title": "253D.29 TRANSFER.",
	"text": "(a) A person who is committed as a sexually dangerous person or a person with a sexual psychopathic personality shall not be transferred out of a secure treatment facility unless the transfer is appropriate. Transfer may be to other treatment programs under the control of the executive board.\n(b) The following factors must be considered in determining whether a transfer is appropriate:\n(1) the person's clinical progress and present treatment needs;\n(2) the need for security to accomplish continuing treatment;\n(3) the need for continued institutionalization;\n(4) which other treatment program can best meet the person's needs; and\n(5) whether transfer can be accomplished with a reasonable degree of safety for the public.\n(a) After a committed person has been transferred out of a secure treatment facility pursuant to subdivision 1 and with the consent of the executive director, a committed person may voluntarily return to a secure treatment facility for a period of up to 60 days.\n(b) If the committed person is not returned to the other treatment program to which the person was originally transferred pursuant to subdivision 1 within 60 days of being readmitted to a secure treatment facility under this subdivision, the transfer to the other treatment program under subdivision 1 is revoked and the committed person shall remain in a secure treatment facility. The committed person shall immediately be notified in writing of the revocation.\n(c) Within 15 days of receiving notice of the revocation, the committed person may petition the special review board for a review of the revocation. The special review board shall review the circumstances of the revocation and shall recommend to the judicial appeal panel whether or not the revocation shall be upheld. The special review board may also recommend a new transfer at the time of the revocation hearing.\n(d) If the transfer has not been revoked and the committed person is to be returned to the other treatment program to which the committed person was originally transferred pursuant to subdivision 1 with no substantive change to the conditions of the transfer ordered pursuant to subdivision 1, no action by the special review board or judicial appeal panel is required.\n(a) The executive director may revoke a transfer made pursuant to subdivision 1 and require a committed person to return to a secure treatment facility if:\n(1) remaining in a nonsecure setting will not provide a reasonable degree of safety to the committed person or others; or\n(2) the committed person has regressed in clinical progress so that the other treatment program to which the committed person was transferred is no longer sufficient to meet the committed person's needs.\n(b) Upon the revocation of the transfer, the committed person shall be immediately returned to a secure treatment facility. A report documenting reasons for revocation shall be issued by the executive director within seven days after the committed person is returned to the secure treatment facility. Advance notice to the committed person of the revocation is not required.\n(c) The committed person must be provided a copy of the revocation report and informed, orally and in writing, of the rights of a committed person under this section. The revocation report shall be served upon the committed person and the committed person's counsel. The report shall outline the specific reasons for the revocation including, but not limited to, the specific facts upon which the revocation is based.\n(d) If a committed person's transfer is revoked, the committed person may re-petition for transfer according to section 253D.27.\n(e) Any committed person aggrieved by a transfer revocation decision may petition the special review board within seven days, exclusive of Saturdays, Sundays, and legal holidays, after receipt of the revocation report for a review of the revocation. The matter shall be scheduled within 30 days. The special review board shall review the circumstances leading to the revocation and, after considering the factors in subdivision 1, paragraph (b), shall recommend to the judicial appeal panel whether or not the revocation shall be upheld. The special review board may also recommend a new transfer out of a secure treatment facility at the time of the revocation hearing.",
	"repealed": false
}