{
	"id": "148.6420",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6420",
	"title": "148.6420 APPLICATION REQUIREMENTS.",
	"text": "An applicant for licensure must:\n(1) submit a completed application for licensure on forms provided by the board and must supply the information requested on the application, including:\n(i) the applicant's name, business address and business telephone number, business setting, primary email address, and daytime telephone number;\n(ii) the name and location of the occupational therapy program the applicant completed;\n(iii) a description of the applicant's education and training, including a list of degrees received from educational institutions;\n(iv) the applicant's work history for the six years preceding the application;\n(v) a list of all credentials currently and previously held in Minnesota and other jurisdictions;\n(vi) a description of any jurisdiction's refusal to credential the applicant;\n(vii) a description of all professional disciplinary actions initiated against the applicant in any jurisdiction;\n(viii) information on any physical or mental condition or substance use disorder that impairs the person's ability to engage in the practice of occupational therapy with reasonable judgment or safety;\n(ix) a description of any misdemeanor or felony conviction that relates to honesty or to the practice of occupational therapy; and\n(x) a description of any state or federal court order, including a conciliation court judgment or a disciplinary order, related to the individual's occupational therapy practice;\n(2) submit with the application all fees required by section 148.6445;\n(3) sign a statement that the information in the application is true and correct to the best of the applicant's knowledge and belief;\n(4) sign a waiver authorizing the board to obtain access to the applicant's records in this or any other state in which the applicant holds or previously held a credential for the practice of an occupation, has completed an accredited occupational therapy education program, or engaged in the practice of occupational therapy;\n(5) submit additional information as requested by the board; and\n(6) submit the additional information required for licensure by equivalency, licensure by reciprocity, and temporary licensure as specified in sections 148.6408 to 148.6418.\nPersons applying for licensure under section 148.6408 or 148.6410 must submit the materials required in subdivision 1 and the following:\n(1) a certificate of successful completion of the requirements in section 148.6408, subdivision 1, or 148.6410, subdivision 1; and\n(2) the applicant's test results from the examining agency, as evidence that the applicant received a qualifying score on a credentialing examination meeting the requirements of section 148.6408, subdivision 2, or 148.6410, subdivision 2.\nAn applicant who is certified by the National Board for Certification in Occupational Therapy must provide the materials required in subdivision 1 and the following:\n(1) verified documentation from the National Board for Certification in Occupational Therapy stating that the applicant is certified as an occupational therapist, registered or certified occupational therapy assistant, the date certification was granted, and the applicant's certification number. The document must also include a statement regarding disciplinary actions. The applicant is responsible for obtaining this documentation by sending a form provided by the board to the National Board for Certification in Occupational Therapy; and\n(2) a waiver authorizing the board to obtain access to the applicant's records maintained by the National Board for Certification in Occupational Therapy.\nIn addition to providing the materials required in subdivision 1, an applicant credentialed in another jurisdiction must request that the appropriate government body in each jurisdiction in which the applicant holds or held an occupational therapy credential provide documentation to the board that verifies the applicant's credentials. Except as provided in section 148.6418, a license must not be issued until the board receives verification of each of the applicant's credentials. Each verification must include the applicant's name and date of birth, credential number and date of issuance, a statement regarding investigations pending and disciplinary actions taken or pending against the applicant, current status of the credential, and the terms under which the credential was issued.\n(a) The board shall approve, approve with conditions, or deny licensure. The board shall act on an application for licensure according to paragraphs (b) to (d).\n(b) The board shall determine if the applicant meets the requirements for licensure. The board may investigate information provided by an applicant to determine whether the information is accurate and complete.\n(c) The board shall notify an applicant of action taken on the application and, if licensure is denied or approved with conditions, the grounds for the board's determination.\n(d) An applicant denied licensure or granted licensure with conditions may make a written request to the board, within 30 days of the date of the board's determination, for reconsideration of the board's determination. Individuals requesting reconsideration may submit information which the applicant wants considered in the reconsideration. After reconsideration of the board's determination to deny licensure or grant licensure with conditions, the board shall determine whether the original determination should be affirmed or modified. An applicant is allowed no more than one request in any one biennial licensure period for reconsideration of the board's determination to deny licensure or approve licensure with conditions.",
	"repealed": false
}