{
	"id": "336.9-105A",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-105A",
	"title": "336.9-105A CONTROL OF ELECTRONIC MONEY.",
	"text": "(a) General rule: control of electronic money. A person has control of electronic money if:\n(1) the electronic money, a record attached to or logically associated with the electronic money, or a system in which the electronic money is recorded gives the person:\n(A) power to avail itself of substantially all the benefit from the electronic money; and\n(B) exclusive power, subject to subsection (b), to:\n(i) prevent others from availing themselves of substantially all the benefit from the electronic money; and\n(ii) transfer control of the electronic money to another person or cause another person to obtain control of other electronic money as a result of the transfer of the electronic money; and\n(2) the electronic money, a record attached to or logically associated with the electronic money, or a system in which the electronic money is recorded enables the person readily to identify itself in any way, including by name, identifying number, cryptographic key, office, or account number, as having the powers under paragraph (1).\n(b) Meaning of exclusive. Subject to subsection (c), a power is exclusive under subsection (a)(1)(B)(i) and (ii) even if:\n(1) the electronic money, a record attached to or logically associated with the electronic money, or a system in which the electronic money is recorded limits the use of the electronic money or has a protocol programmed to cause a change, including a transfer or loss of control; or\n(2) the power is shared with another person.\n(c) When power not shared with another person. A power of a person is not shared with another person under subsection (b)(2) and the person's power is not exclusive if:\n(1) the person can exercise the power only if the power also is exercised by the other person; and\n(2) the other person:\n(A) can exercise the power without exercise of the power by the person; or\n(B) is the transferor to the person of an interest in the electronic money.\n(d) Presumption of exclusivity of certain powers. If a person has the powers specified in subsection (a)(1)(B)(i) and (ii), the powers are presumed to be exclusive.\n(e) Control through another person. A person has control of electronic money if another person, other than the transferor to the person of an interest in the electronic money:\n(1) has control of the electronic money and acknowledges that it has control on behalf of the person; or\n(2) obtains control of the electronic money after having acknowledged that it will obtain control of the electronic money on behalf of the person.",
	"repealed": false
}