{
	"id": "134.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.51",
	"title": "134.51 ACCESS TO LIBRARY MATERIALS AND RIGHTS PROTECTED.",
	"text": "A public library must not ban, remove, or otherwise restrict access to a book or other material based solely on its viewpoint or the messages, ideas, or opinions it conveys.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Public library\" means:\n(1) a library that provides free access to all residents of a city or county, receives at least half of its financial support from public funds, and is organized under the provisions of this chapter, except that a library under this clause does not include libraries such as law, medical, or other libraries organized to serve a special group of persons and not the general public;\n(2) a library jointly operated by a city and a school district under section 134.195;\n(3) a school district or charter school library or media center under section 124D.991, including libraries operated by an intermediate school district or cooperative unit under section 123A.24, subdivision 2; or\n(4) a public higher education institution library.\n(c) \"Governing body\" means a group of persons that oversees the operations, budget, policies, and other administrative responsibilities of a regional public library system under section 134.20, subdivision 2; a multicounty, multitype library system under section 134.351, subdivision 4; a combination library under section 134.195, subdivision 7; a school library under section 124D.991, including libraries operated by an intermediate school district or cooperative unit under section 123A.24, subdivision 2; or any other public library under section 134.001, subdivision 2.\n(a) Nothing in this section limits a public library's authority to decline to purchase, lend, or shelve or to remove or restrict access to books or other materials legitimately based upon:\n(1) practical reasons, including but not limited to shelf space limitations, rare or antiquarian status, damage, or obsolescence;\n(2) legitimate pedagogical concerns, including but not limited to the appropriateness of potentially sensitive topics for the library's intended audience, the selection of books and materials for a curated collection, or the likelihood of causing a material and substantial disruption of the work and discipline of the school; or\n(3) compliance with state or federal law.\n(b) Nothing in this section impairs or limits the rights of a parent, guardian, or an adult student under section 120B.20.\nA governing body of a public library or any other public body with personnel authority for a public library may not discriminate against or discipline an employee for complying with this section.\n(a) A governing body of a public library must adopt a policy that establishes procedures for selection of, challenges to, and reconsideration of library materials in accordance with this section.\n(b) The policy must not impair or limit the rights of a parent, guardian, or adult student under section 120B.20.\n(c) The policy must establish that the procedures for selection and reconsideration will be administered by:\n(1) a licensed library media specialist under Minnesota Rules, part 8710.4550;\n(2) an individual with a master's degree in library science or library and information science; or\n(3) a professional librarian or a person trained in library collection management.\n(d) Upon the completion of a content challenge or reconsideration process in accordance with the governing body's adopted policy, the governing body must submit a report of the challenge to the commissioner of education that includes:\n(1) the title, author, and other relevant identifying information about the material being challenged;\n(2) the date, time, and location of any public hearing held on the challenge in question, including minutes or transcripts;\n(3) the result of the challenge or reconsideration request; and\n(4) accurate and timely information on who from the governing body the Department of Education may contact with questions or follow-up.",
	"repealed": false
}