{
	"id": "144.4807",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4807",
	"title": "144.4807 NOTICE OF OBLIGATION TO ISOLATE OR EXAMINE.",
	"text": "If the carrier is in a treatment facility, the commissioner or a carrier's attending physician, advanced practice registered nurse, or physician assistant, after obtaining approval from the commissioner, may issue a notice of obligation to isolate to a treatment facility if the commissioner or attending physician, advanced practice registered nurse, or physician assistant has probable cause to believe that a carrier is an endangerment to the public health.\nIf the carrier is clinically suspected of having active tuberculosis, the commissioner may issue a notice of obligation to examine to the carrier's attending physician, advanced practice registered nurse, or physician assistant to conduct a diagnostic examination for tuberculosis on the carrier.\nUpon receiving a notice of obligation to isolate or notice of obligation to examine, a treatment facility shall immediately take all reasonable precautions to prevent the carrier from exposing other persons to tuberculosis, including the use of guards or locks, if appropriate.\nWhen issuing a notice of obligation to isolate or examine to the carrier's physician, advanced practice registered nurse, or physician assistant or a treatment facility, the commissioner shall simultaneously serve a health order on the carrier ordering the carrier to remain in the treatment facility for treatment or examination.\nNo carrier may be detained under subdivision 1 or 2 longer than 72 hours, excluding Saturdays, Sundays, and legal holidays, unless the court issues an order authorizing continued detention of the carrier pursuant to subdivision 7. A carrier may not be released prior to the expiration of the 72-hour hold without the express consent of the commissioner.\nThe commissioner may seek an order extending the hold under subdivision 5 by filing an ex parte application with the probate division of the district court of the county in which the carrier resides. The application may be filed orally by telephone or by facsimile, provided that a written application is filed within 72 hours, excluding Saturdays, Sundays, and legal holidays.\nThe court may extend the hold under subdivision 5 by up to six days, excluding Saturdays, Sundays, and legal holidays, if the court finds that there is probable cause to believe that the carrier is an endangerment to the public health. The court may find probable cause to detain, examine, and isolate the carrier based upon a written statement by facsimile or upon an oral statement by telephone from the carrier's attending physician, nurse, or physician assistant; a public health physician, nurse, or physician assistant; other licensed health professional; or disease prevention officer, stating the grounds and facts that demonstrate that the carrier is an endangerment to the public health, provided that an affidavit from such witness is filed with the court within 72 hours, excluding Saturdays, Sundays, and legal holidays. The order may be issued orally by telephone, or by facsimile, provided that a written order is issued within 72 hours, excluding Saturdays, Sundays, and legal holidays. The oral and written order shall contain a notice of the carrier's rights contained in section 144.4805, subdivision 3, clause (6). A carrier may not be released prior to the hold extended under this subdivision without the express consent of the commissioner.\nIf the carrier does not have counsel at the time the court issues an order to extend the hold under subdivision 7, the court shall promptly appoint counsel for the carrier.\nA disease prevention officer, peace officer, physician, licensed health professional, or treatment facility that acts in good faith under this section is immune from liability in any civil, administrative, disciplinary, or criminal action for acting under this section.",
	"repealed": false
}