{
	"id": "302A.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.405",
	"title": "302A.405 CONSIDERATION FOR SHARES; VALUE AND PAYMENT; LIABILITY.",
	"text": "Subject to any restrictions in the articles:\n(a) Shares may be issued for any consideration, including, without limitation, money or other tangible or intangible property received by the corporation or to be received by the corporation under a written agreement, or services rendered to the corporation or to be rendered to the corporation, as authorized by resolution approved by the affirmative vote of the directors required by section 302A.237, or, if provided for in the articles, approved by the affirmative vote of the shareholders required by section 302A.437, establishing a price in money or other consideration, or a minimum price, or a general formula or method by which the price will be determined; and\n(b) A corporation may, without any new or additional consideration, issue its own shares in exchange for or in conversion of its outstanding shares, or, subject to authorization of share dividends, divisions, and combinations according to section 302A.402, issue its own shares pro rata to its shareholders or the shareholders of one or more classes or series, to effectuate share dividends, divisions, or combinations. No shares of a class or series, shares of which are then outstanding, shall be issued to the holders of shares of another class or series (except in exchange for or in conversion of outstanding shares of the other class or series), unless the issuance either is expressly provided for in the articles or is approved at a meeting by the affirmative vote of the holders of a majority of the voting power of all shares of the same class or series as the shares to be issued.\nThe determinations of the board or the shareholders as to the amount or fair value or the fairness to the corporation of the consideration received or to be received by the corporation for its shares or the terms of payment, as well as the agreement to issue shares for that consideration, are presumed to be proper if they are made in good faith and on the basis of accounting methods, or a fair valuation or other method, reasonable in the circumstances, and, unless otherwise required by the articles, the consideration may be less than the par value, if any, of the shares. Directors or shareholders who are present and entitled to vote, and who, intentionally or without reasonable investigation, fail to vote against approving an issue of shares for a consideration that is unfair to the corporation, or overvalue property or services received or to be received by the corporation as consideration for shares issued, are jointly and severally liable to the corporation for the benefit of the then shareholders who did not consent to and are damaged by the action, to the extent of the damages of those shareholders. A director or shareholder against whom a claim is asserted pursuant to this subdivision, except in case of knowing participation in a deliberate fraud, is entitled to contribution on an equitable basis from other directors or shareholders who are liable under this section.\n(a) A corporation shall issue only shares that are nonassessable or that are assessable but are issued with the unanimous consent of the shareholders. \"Nonassessable\" shares are shares for which the agreed consideration has been fully paid, delivered, or rendered to the corporation. Consideration in the form of a promissory note, a check, or a written agreement to transfer property to a corporation in the future is fully paid when the note, check, or written agreement is delivered to the corporation, and consideration in the form of services to be rendered to the corporation is fully paid when the issuance of the shares is authorized or approved pursuant to subdivision 1, paragraph (a).\n(b) If shares are issued in violation of paragraph (a), the following persons are jointly and severally liable to the corporation for the difference between the agreed consideration for the shares and the consideration actually received by the corporation:\n(1) A director or shareholder who was present and entitled to vote but who failed to vote against the issuance of the shares knowing of the violation;\n(2) The person to whom the shares were issued; and\n(3) A successor or transferee of the interest in the corporation of a person described in clause (1) or (2), including a purchaser of shares, a subsequent assignee, successor, or transferee, a pledgee, a holder of any other security interest in the assets of the corporation or shares granted by the person described in clause (1) or (2), or a legal representative of or for the person or estate of the person, which successor, transferee, purchaser, assignee, pledgee, holder, or representative acquired the interest knowing of the violation.\n(c)(1) A pledgee or holder of any other security interest in all or any shares that have been issued in violation of paragraph (a) is not liable under paragraph (b) if all those shares are surrendered to the corporation. The surrender does not impair any rights of the pledgee or holder of any other security interest against the pledgor or person granting the security interest.\n(2) A pledgee, holder of any other security interest, or legal representative is liable under paragraph (b) only in that capacity. The liability of the person under paragraph (b) is limited to the assets held in that capacity for the person or estate of the person described in clause (1) or (2) of paragraph (b).\n(3) Each person liable under paragraph (b) has a full right of contribution on an equitable basis from all other persons liable under paragraph (b) for the same transaction.\n(4) An action shall not be maintained against a person under paragraph (b) unless commenced within two years from the date on which shares are issued in violation of paragraph (a).",
	"repealed": false
}