{
	"id": "353.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.27",
	"title": "353.27 GENERAL EMPLOYEES RETIREMENT FUND.",
	"text": "There is a special fund known as the \"general employees retirement fund,\" the \"retirement fund,\" or the \"fund,\" which must include all the assets of the general employees retirement plan of the association. This fund must be credited with all contributions, all interest and all other income of the general employees retirement plan of the Public Employees Retirement Association that are authorized by law. From this fund there is appropriated the payments authorized by sections 353.01 to 353.46 and by Minnesota Statutes 2008, chapter 422A, in the amounts and at such time provided herein, including the expenses of administering the general employees retirement plan and fund.\n[Repealed, 2015 c 68 art 14 s 30]\n(a) For a basic member of the general employees retirement plan of the Public Employees Retirement Association, the employee contribution is 9.10 percent of salary. For a coordinated member of the general employees retirement plan of the Public Employees Retirement Association, the employee contribution is the following percentage of salary plus any contribution rate adjustment under subdivision 3b:\n(b) These contributions must be made by deduction from salary as defined in section 353.01, subdivision 10, in the manner provided in subdivision 4. If any portion of a member's salary is paid from other than public funds, the member's employee contribution must be based on the total salary received by the member from all sources.\n(a) For a basic member of the general employees retirement plan of the Public Employees Retirement Association, the employer contribution is 9.10 percent of salary. For a coordinated member of the general employees retirement plan of the Public Employees Retirement Association, the employer contribution is the following percentage of salary plus any contribution rate adjustment under subdivision 3b:\n(b) This contribution must be made from funds available to the employing subdivision by the means and in the manner provided in section 353.28.\n(a) An additional employer contribution to the general employees retirement fund of the Public Employees Retirement Association must be made equal to the following applicable percentage of the total salary amount for \"basic members\" and for \"coordinated members\":\nThese contributions must be made from funds available to the employing subdivision by the means and in the manner provided in section 353.28.\n(b) The coordinated program contribution rates set forth in paragraph (a) effective for January 1, 2010, must not be implemented if, following receipt of the July 1, 2009, annual actuarial valuation report under section 356.215, respectively, the actuarially required contributions are equal to or less than the total rates under this section in effect as of January 1, 2008.\n(c) This subdivision is repealed once the actuarial value of the assets of the general employees retirement plan of the Public Employees Retirement Association equal or exceed the actuarial accrued liability of the plan as determined by the actuary retained under sections 356.214 and 356.215. The repeal is effective on the first day of the first full pay period occurring after March 31 of the calendar year following the issuance of the actuarial valuation upon which the repeal is based.\nMS 2016 [Repealed, 2018 c 211 art 2 s 4]\n(a) For the period July 1, 2019, through December 31, 2031, the member contributions for former members of the Minneapolis Employees Retirement Fund and by the former Minneapolis Employees Retirement Fund-covered employing units are governed by this subdivision.\n(b) The member contribution for a public employee who was a member of the former Minneapolis Employees Retirement Fund on June 29, 2010, is 9.75 percent of the salary of the employee.\n(c) The employer regular contribution with respect to a public employee who was a member of the former Minneapolis Employees Retirement Fund on June 29, 2010, is 9.75 percent of the salary of the employee.\n(d) The annual employer supplemental contribution is the employing unit's share of $21,000,000.\n(e) Each employing unit's share under paragraph (d) is the amount determined from an allocation between each employing unit in the portion equal to the unit's employer supplemental contribution paid or payable under Minnesota Statutes 2012, section 353.50, during calendar year 2014.\n(f) The employer supplemental contribution amount under paragraph (d) for calendar year 2019 must be invoiced by the executive director of the Public Employees Retirement Association by July 1, 2019. For subsequent calendar years, the employer supplemental contribution under paragraph (d) must be invoiced on January 31 of each year. The employer supplemental contribution is payable in two parts, with the first half payable on or before July 31 and with the second half payable on or before December 15. Late payments are payable with interest, compounded annually, at the applicable rate or rates specified in section 356.59, subdivision 3, per month for each month or portion of a month that has elapsed after the due date.\n(g) The employer supplemental contribution under paragraph (d) terminates on December 31, 2031.\n(a) A representative authorized by the head of each department must deduct employee contributions from the salary of each public employee who qualifies for membership in the general employees retirement plan or the public employees police and fire retirement plan under this chapter, the public employees defined contribution plan under chapter 353D, or the local government correctional service retirement plan under chapter 353E at the rate under section 353.27, 353.65, 353D.03, or 353E.03, whichever is applicable, that is in effect on the date the salary is paid. The employer representative must also remit payment in a manner prescribed by the executive director for the aggregate amount of the employee contributions and the required employer contributions to be received by the association within 14 calendar days after each pay date. If the payment is less than the amount required, the employer must pay the shortage amount to the association and collect reimbursement of any employee contribution shortage paid on behalf of a member through subsequent payroll withholdings from the wages of the employee. Payment of shortages in employee contributions and associated employer contributions, if applicable, must include interest at the rate specified in section 353.28, subdivision 5, if not received within 30 days following the date the amount was initially due under this section.\n(b) The head of each department or the person's designee shall submit for each pay period to the association a salary deduction report in the format prescribed by the executive director. The report must be received by the association within 14 calendar days after each pay date or the employer may be assessed a fine of $5 per calendar day until the association receives the required data. Data required as part of salary deduction reporting must include, but are not limited to:\n(1) the legal names and Social Security numbers of employees who are members;\n(2) the amount of each employee's salary deduction;\n(3) the amount of salary defined in section 353.01, subdivision 10, earned in the pay period from which each deduction was made, including a breakdown of the portion of the salary that represents overtime pay that the employee was paid for additional hours worked beyond the regularly scheduled hours, pay for unused compensatory time, and the salary amount earned by a reemployed annuitant under section 353.37, subdivision 1, or 353.371, subdivision 1, or by a disabled member under section 353.33, subdivision 7 or 7a;\n(4) the beginning and ending dates of the payroll period covered and the date of actual payment; and\n(5) adjustments or corrections covering past pay periods as authorized by the executive director.\n(c) Employers must furnish the data required for enrollment for each new or reinstated employee who qualifies for membership in the general employees retirement plan, the public employees police and fire retirement plan, the public employees defined contribution plan, or the local government correctional service retirement plan in the format prescribed by the executive director. The required enrollment data on new members must be submitted to the association prior to or concurrent with the submission of the initial employee salary deduction. Also, the employer shall report to the association all member employment status changes, such as leaves of absence, terminations, and death, and shall report the effective dates of those changes, on an ongoing basis for the payroll cycle in which they occur. If an employer fails to comply with the reporting requirements under this paragraph, the executive director may assess a fine of $25 for each failure if the association staff has notified the employer of the noncompliance and attempted to obtain the missing data or form from the employer for a period of more than three months.\n(d) The employer shall furnish data, forms, and reports as may be required by the executive director for proper administration of the retirement system. Before implementing new or different computerized reporting requirements, the executive director shall give appropriate advance notice to governmental subdivisions to allow time for system modifications.\n(e) Notwithstanding paragraph (a), the executive director may provide for less frequent reporting and payments for small employers.\n(f) The executive director may establish reporting procedures and methods as required to review compliance by employers with the salary and contribution reporting requirements in this chapter. A review of the payroll records of a participating employer may be conducted by the association on a periodic basis or as a result of concerns known to exist within a governmental subdivision. An employer under review must extract requested data and provide records to the association after receiving reasonable advanced notice. Failure to provide requested information or materials will result in the employer being liable to the association for any expenses associated with a field audit, which may include staff salaries, administrative expenses, and travel expenses.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1992 c 443 s 2]\n[Repealed, 1971 c 106 s 40]\n(a) Except as provided in paragraph (b), erroneous employee deductions and erroneous employer contributions and additional employer contributions to the general employees retirement plan of the Public Employees Retirement Association or to the public employees police and fire retirement plan for a person who otherwise does not qualify for membership under this chapter, are considered:\n(1) valid if the initial erroneous deduction began before January 1, 1990. Upon determination of the error by the association, the person may continue membership in the association while employed in the same position for which erroneous deductions were taken, or file a written election to terminate membership and apply for a refund upon termination of public service or defer an annuity under section 353.34; or\n(2) invalid, if the initial erroneous employee deduction began on or after January 1, 1990. Upon determination of the error, the association shall refund all erroneous employee deductions and all erroneous employer contributions as specified in paragraph (e). No person may claim a right to continued or past membership in the association based on erroneous deductions which began on or after January 1, 1990.\n(b) Erroneous deductions taken from the salary of a person who did not qualify for membership in the general employees retirement plan of the Public Employees Retirement Association or in the public employees police and fire retirement plan by virtue of concurrent employment before July 1, 1978, which required contributions to another retirement fund or relief association established for the benefit of officers and employees of a governmental subdivision, are invalid. Upon discovery of the error, allowable service credit for all invalid service if forfeited and, upon termination of public service, the association shall refund all erroneous employee deductions to the person, with interest as determined under section 353.34, subdivision 2, and all erroneous employer contributions without interest to the employer. This paragraph has both retroactive and prospective application.\n(c) Adjustments to correct employer contributions and employee deductions taken in error from amounts which are not salary under section 353.01, subdivision 10, must be made as specified in paragraph (e). The period of adjustment must be limited to the fiscal year in which the error is discovered by the association and the immediate two preceding fiscal years.\n(d) If there is evidence of fraud or other misconduct on the part of the employee or the employer, the board of trustees may authorize adjustments to the account of a member or former member to correct erroneous employee deductions and employer contributions on invalid salary and the recovery of any overpayments for a period longer than provided for under paragraph (c).\n(e) Upon discovery of the receipt of erroneous employee deductions and employer contributions under paragraph (a), clause (2), or paragraph (c), the association must require the employer to discontinue the erroneous employee deductions and erroneous employer contributions reported on behalf of a member. Upon discontinuation, the association must:\n(1) for a member, provide a refund in the amount of the invalid employee deductions with interest on the invalid employee deductions at the rate specified under section 353.34, subdivision 2, from the received date of each invalid salary transaction through the date the credit or refund is made;\n(2) for a former member who:\n(i) is not receiving a retirement annuity or benefit, return the erroneous employee deductions to the former member through a refund with interest at the rate specified under section 353.34, subdivision 2, from the received date of each invalid salary transaction through the date the credit or refund is made; or\n(ii) is receiving a retirement annuity or disability benefit, or a person who is receiving an optional annuity or survivor benefit, for whom it has been determined an overpayment must be recovered, adjust the payment amount and recover the overpayments as provided under this section; and\n(3) return the invalid employer contributions reported on behalf of a member or former member to the employer by providing a credit against future contributions payable by the employer.\n(f) In the event that a salary payment or check from which a deduction for the retirement fund was taken has been canceled or the amount of the payment or check returned to the funds of the department making the payment, a refund of the sum deducted, or any portion of it that is required to adjust the deductions, must be made to the department or institution.\n(g) If the association discovers that a retirement annuity, survivor benefit, or disability benefit has been incorrectly calculated by using invalid service or salary, or due to any erroneous calculation procedure, the association must recalculate the annuity or benefit payable and begin payment of the corrected annuity or benefit effective the first of the month following discovery of the error. Any overpayment resulting from the incorrect calculation must be recovered as provided under subdivision 7b, if the accrual date, or any adjustment in the amount of the annuity or benefit calculated after the accrual date, except adjustments required under section 353.656, subdivision 4, falls within the current fiscal year and the two immediate previous fiscal years.\n(h) Notwithstanding the provisions of this subdivision, the association may apply the Revenue Procedures defined in the federal Internal Revenue Service Employee Plans Compliance Resolution System and not issue a refund of erroneous employee deductions and employer contributions or not recover a small overpayment of benefits if the cost to correct the error would exceed the amount of the member refund or overpayment.\n(i) Any fees or penalties assessed by the federal Internal Revenue Service for any failure by an employer to follow the statutory requirements for reporting eligible members and salary must be paid by the employer.\n(a) If employee deductions and employer contributions under this section, section 353.50, 353.65, or 353E.03 were erroneously transmitted to the association, but should have been transmitted to a plan covered by chapter 352D, 353D, 354B, or 354D, the executive director shall transfer the erroneous employee deductions and employer contributions to the appropriate retirement fund or individual account, as applicable. The time limitations specified in subdivisions 7 and 12 do not apply. The transfer to the applicable defined contribution plan account must include interest at the applicable rate or rates specified in section 356.59, subdivision 3, per month, compounded annually, from the first day of the month following the month in which coverage should have commenced in the defined contribution plan until the end of the month in which the transfer occurs.\n(b) A potential transfer under paragraph (a) that is reasonably determined to cause the plan to fail to be a qualified plan under section 401(a) of the federal Internal Revenue Code, as amended, must not be made by the executive director of the association. Within 30 days after being notified by the Public Employees Retirement Association of an unmade potential transfer under this paragraph, the employer of the affected person must transmit an amount representing the applicable salary deductions and employer contributions, without interest, to the retirement fund of the appropriate Minnesota public pension plan, or to the applicable individual account if the proper coverage is by a defined contribution plan. The association must provide the employing unit a credit for the amount of the erroneous salary deductions and employer contributions against future contributions from the employer. If the employing unit receives a credit under this paragraph, the employing unit is responsible for refunding to the applicable employee any amount that had been erroneously deducted from the person's salary.\n(c) If erroneous employee deductions and employer contributions reflect a plan coverage error involving any Public Employees Retirement Association plan specified in section 356.637 and any other plan specified in that section, section 356.637 applies.\n(a) In the event the executive director determines that an overpaid annuity or benefit from the general employees retirement plan of the Public Employees Retirement Association, the public employees police and fire retirement plan, or the local government correctional employees retirement plan is the result of invalid salary included in the average salary used to calculate the payment amount must be recovered, the association must determine the amount of the employee deductions taken in error on the invalid salary, with interest determined in the manner provided for a former member under subdivision 7, paragraph (e), clause (2), item (i), and must subtract that amount from the total annuity or benefit overpayment, and the remaining balance of the overpaid annuity or benefit, if any, must be recovered.\n(b) If the invalid employee deductions plus interest exceed the amount of the overpaid benefits, the balance must be refunded to the person to whom the benefit or annuity is being paid.\n(c) Any invalid employer contributions reported on the invalid salary must be credited to the employer as provided in subdivision 7, paragraph (e).\n(d) If a member or former member, who is receiving a retirement annuity or disability benefit for which an overpayment is being recovered, dies before recovery of the overpayment is completed and a joint and survivor optional annuity is payable, the remaining balance of the overpaid annuity or benefit must continue to be recovered from the payment to the optional annuity beneficiary.\n(e) If the association finds that a refund has been overpaid to a former member, beneficiary or other person, the amount of the overpayment must be recovered for the benefit of the respective retirement fund or account.\n(f) The board of trustees shall adopt policies directing the period of time and manner for the collection of any overpaid retirement or optional annuity, and survivor or disability benefit, or a refund that the executive director determines must be recovered as provided under this section.\nNo deductions for any plan under this chapter or chapter 353E may be taken from the salary of a person who is employed by a governmental subdivision under section 353.01, subdivision 6, and who is receiving disability benefit payments from any plan under this chapter or chapter 353E unless the person waives the right to further disability benefit payments.\nDeductions from the salary of a district court reporter in a judicial district consisting of two or more counties must be made by the auditor of the county in which the bond and official oath of such district court reporter are filed, from the portion of salary paid by such county.\nAny appointed or elected officer of a governmental subdivision who was or is a \"public employee\" within the meaning of section 353.01 and was or is a member of the general employees retirement plan of the Public Employees Retirement Association and whose salary was or is paid in whole or in part from revenue derived by fees and assessments, shall pay employee contribution in the amount, at the time, and in the manner provided in subdivisions 2 and 4. This subdivision does not apply to district court reporters. The employer contribution as provided in subdivision 3, and the additional employer contribution as provided in subdivision 3a, with respect to such service must be paid by the governmental subdivision. This subdivision has both retroactive and prospective application as to all such members; and every employing governmental subdivision is deemed liable, retroactively and prospectively, for all employer and additional employer contributions for every such member of the general employees retirement plan in its employ. Delinquencies under this section are governed in all respects by section 353.28.\n(a) The head of a department or a designated representative shall annually furnish the executive director with an exclusion report listing and certifying only those employees in potentially PERA general employees retirement plan-eligible positions who were not reported as members of the general employees retirement plan and who worked during the school year for school employees and calendar year for nonschool employees. The executive director shall prescribe the manner and forms, including standardized exclusion codes, to be used by a governmental subdivision in preparing and filing exclusion reports. Also, the executive director shall check the exclusion report to ascertain whether any omissions have been made in the reporting of new public employees for membership. The executive director may delegate an association employee under section 353.03, subdivision 3a, paragraph (b), clause (5), to conduct a field audit to review the payroll records of a governmental subdivision.\n(b) If an employer fails to comply with the reporting requirements under this subdivision, the executive director may assess a fine of $25 for each failure if the association staff has notified the employer of the noncompliance and attempted to obtain the missing data or form from the employer for a period of more than three months.\nIf the determination by the employer under section 353.01, subdivision 2a, paragraph (a), is to exclude a public employee from membership, the governmental subdivision shall provide the employee with a written notice of the exclusion on a form prescribed by the executive director. The notice must include the statutory basis for the exclusion and information about the employee's right to appeal the determination to the association under section 356.96. The employer must provide the exclusion notice to the employee within two weeks of the date of the determination and shall retain a copy in the person's personnel file.\n(a) All governmental subdivisions shall furnish promptly such other information relative to the employment status of all employees or former employees, including, but not limited to, payroll abstracts pertaining to all past and present employees, as may be requested by the executive director, including schedules of salaries applicable to various categories of employment.\n(b) In the event payroll abstract records have been lost or destroyed, for whatever reason or in whatever manner, so that such schedules of salaries cannot be furnished therefrom, the employing governmental subdivision, in lieu thereof, shall furnish to the association an estimate of the earnings of any employee or former employee for any period as may be requested by the executive director. If the association is provided a schedule of estimated earnings, the executive director is authorized to use the same as a basis for making whatever computations might be necessary for determining obligations of the employee and employer to the general employees retirement plan, the public employees police and fire retirement plan, or the local government correctional employees retirement plan. If estimates are not furnished by the employer at the request of the executive director, the executive director may estimate the obligations of the employee and employer to the general employees retirement fund, the public employees police and fire retirement plan, or the local government correctional employees retirement plan based upon those records that are in its possession.\n(a) In the case of omission of required deductions for the general employees retirement plan, the public employees police and fire retirement plan, or the local government correctional employees retirement plan from the salary of an employee, the department head or designee shall immediately, upon discovery, report the employee for membership and deduct the employee deductions under subdivision 4 during the current pay period or during the pay period immediately following the discovery of the omission. Payment for the omitted obligations may only be made in accordance with reporting procedures and methods established by the executive director.\n(b) When the entire omission period of an employee does not exceed 60 days, the governmental subdivision may report and submit payment of the omitted employee deductions and the omitted employer contributions through the reporting processes under subdivision 4.\n(c) When the omission period of an employee exceeds 60 days, the governmental subdivision shall furnish to the association sufficient data and documentation upon which the obligation for omitted employee and employer contributions can be calculated. The omitted employee deductions must be deducted from the employee's subsequent salary payment or payments and remitted to the association for deposit in the applicable retirement fund. The employee shall pay omitted employee deductions due for the 60 days prior to the end of the last pay period in the omission period during which salary was earned. The employer shall pay any remaining omitted employee deductions and any omitted employer contributions, plus interest at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually, from the date or dates each omitted employee contribution was first payable.\n(d) An employer shall not hold an employee liable for omitted employee deductions beyond the pay period dates under paragraph (c), nor attempt to recover from the employee those employee deductions paid by the employer on behalf of the employee. Omitted deductions due under paragraph (c) which are not paid by the employee constitute a liability of the employer that failed to deduct the omitted deductions from the employee's salary. The employer shall make payment with interest at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually. Omitted employee deductions are no longer due if an employee terminates public service before making payment of omitted employee deductions to the association, but the employer remains liable to pay omitted employer contributions plus interest at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually, from the date the contributions were first payable.\n(e) The association may not commence action for the recovery of omitted employee deductions and employer contributions after the expiration of three calendar years after the calendar year in which the contributions and deductions were omitted. Except as provided under paragraph (b), no payment may be made or accepted unless the association has already commenced action for recovery of omitted deductions. An action for recovery commences on the date of the mailing of any written correspondence from the association requesting information from the governmental subdivision upon which to determine whether or not omitted deductions occurred.\nA terminated employee who was a member of the general employees retirement plan of the Public Employees Retirement Association, the public employees police and fire retirement plan, or the local government correctional employees retirement plan and who has a period of employment in which previously omitted employer contributions were made under subdivision 12 but for whom no, or only partial, omitted employee contributions have been made, or a member who had prior coverage in the association for which previously omitted employer contributions were made under subdivision 12 but who terminated service before required omitted employee deductions could be withheld from salary, may pay the omitted employee deductions for the period on which omitted employer contributions were previously paid plus interest at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually. A terminated employee may pay the omitted employee deductions plus interest within six months of an initial notification from the association of eligibility to pay those omitted deductions. If a terminated employee is reemployed in a position covered under a public pension fund under section 356.30, subdivision 3, and elects to pay omitted employee deductions, payment must be made no later than six months after a subsequent termination of public service.\nIf deductions were omitted from salary adjustments or final salary of a terminated employee who was a member of the general employees retirement plan, the public employees police and fire retirement plan, or the local government correctional employees retirement plan and who is immediately eligible to draw a monthly benefit, the employer shall pay the omitted employer and employer additional contributions plus interest on both the employer and employee amounts due at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually. The employee shall pay the employee deductions within six months of an initial notification from the association of eligibility to pay omitted deductions or the employee forfeits the right to make the payment.\nA warrant payable from the general employees retirement fund, the public employees police and fire retirement fund, or the local government correctional retirement fund remaining unpaid for a period of six months must be canceled into the applicable retirement fund and not canceled into the state's general fund.\n(a) If an entity is determined to be a governmental subdivision due to receipt of a written notice of eligibility from the association with respect to the general employees retirement plan, the public employees police and fire retirement plan, or the local government correctional retirement plan, that employer and its employees are subject to the requirements of subdivision 12, effective retroactively to the date that the executive director of the association determines that the entity first met the definition of a governmental subdivision, if that date predates the notice of eligibility.\n(b) If the retroactive time period under paragraph (a) exceeds three years, an employee is authorized to purchase service credit in the applicable Public Employees Retirement Association plan for the portion of the period in excess of three years, by making payment under section 356.551. Notwithstanding any provision of section 356.551, subdivision 2, to the contrary, regarding time limits on purchases, payment of a service credit purchase amount may be made anytime before the termination of public service.\n(c) This subdivision does not apply if the applicable employment under paragraph (a) included coverage by any public or private defined benefit or defined contribution retirement plan, other than a firefighters relief association. If this paragraph applies, an individual is prohibited from purchasing service credit from a Public Employees Retirement Association plan for any period or periods specified in paragraph (a).",
	"repealed": false
}