{
	"id": "290A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/290A.19",
	"title": "290A.19 PARK OWNER TO FURNISH RENT CERTIFICATE.",
	"text": "(a) The park owner of a property for which rent is paid for occupancy as a homestead must furnish a certificate of rent paid to a person who is a renter on December 31, in the form prescribed by the commissioner. If the renter moves before December 31, the park owner may give the certificate to the renter at the time of moving, or mail the certificate to the forwarding address if an address has been provided by the renter. The certificate must be made available to the renter before February 1 of the year following the year in which the rent was paid. The park owner must retain a duplicate of each certificate or an equivalent record showing the same information for a period of three years. The duplicate or other record must be made available to the commissioner upon request.\n(b) The commissioner may require the park owner, through a simple process, to furnish to the commissioner on or before March 1 a copy of each certificate of rent paid furnished to a renter for rent paid in the prior year. The commissioner shall prescribe the content, format, and manner of the form pursuant to section 270C.30. The commissioner may require the Social Security number, individual taxpayer identification number, federal employer identification number, or Minnesota taxpayer identification number of the park owner who is required to furnish a certificate of rent paid under this paragraph. Prior to implementation, the commissioner, after consulting with representatives of park owners, shall develop an implementation and administration plan for the requirements of this paragraph that attempts to minimize financial burdens, administration and compliance costs, and takes into consideration existing systems of park owners.\n(c) For the purposes of this section, \"park owner\" means a park owner as defined under section 327C.015, subdivision 9, and \"property\" includes a lot as defined under section 327C.015, subdivision 6.",
	"repealed": false
}