{
	"id": "299N.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/299N.05",
	"title": "299N.05 LICENSE REQUIRED.",
	"text": "A firefighter employed full time by a fire department is not eligible for permanent employment without being licensed by the board and meeting the following requirements:\n(1) the firefighter successfully completes a firefighter examination under section 299N.04 or completes the examination while serving a probationary period, if any, as determined by the hiring authority; and\n(2) the chief firefighting officer or the chief designee completes the employment verification portion of the licensing process.\nA volunteer firefighter affiliated with a department may receive or apply for licensure under subdivision 1 and section 299N.04 under the same terms as full-time firefighters.\nMS 2014 [Repealed, 2015 c 65 art 4 s 16]\nAny full-time firefighter employed by a fire department must obtain a license from the board. To obtain a license, an individual must provide the board with a statement signed by the chief firefighting officer of the fire department that employs the full-time firefighter that the individual has met the certification requirements of section 299N.04.\nTo obtain a license, a firefighter must be affiliated with a fire department, complete the board application process, and meet the requirements of this section or section 299N.04 or 299N.06. A license is valid for a three-year period determined by the board, and the fee for the license is $75. Fees under this subdivision may be prorated by the board for licenses issued with a three-year licensure period.\n(a) A license must be renewed if the firefighter and the chief firefighting officer or chief designee complete the renewal application and:\n(1) attest to the board that the licensed firefighter has met the required 72 hours of approved firefighter training in the preceding three years;\n(2) upon request, provide evidence the licensed firefighter completed the required 72 hours of approved firefighter training in the preceding three years;\n(3) verify that the licensed firefighter is actively serving on a department; and\n(4) attest that the licensed firefighter has not been convicted of or pled guilty or nolo contendere to a felony, any arson-related charge, or another offense arising from the same set of circumstances.\n(b) The fee to renew a firefighter license is $75. The license is valid for an additional three-year period, unless submitted within the triennial period. Fees under this subdivision may be prorated by the board for licenses reinstated or renewed within the three-year licensure period.\n(c) If a license expires, a firefighter may apply to have it reinstated. In order to receive reinstatement, the firefighter must:\n(1) complete a reinstatement application;\n(2) satisfy all requirements listed in paragraph (a);\n(3) pay any outstanding renewal fees; and\n(4) pay the delayed renewal fee set by the board.\n(d) In lieu of a reinstatement application under paragraph (c), a firefighter may complete a new application for licensure under section 299N.04.\n(a) Every chief firefighting officer has a duty to ensure that every full-time firefighter has a license issued by the board.\n(b) Every chief firefighting officer or designee has the duty to verify that every full-time and volunteer individual applying, reinstating, or renewing a license is affiliated with a Minnesota fire department.\n(c) Every chief firefighting officer, provider, and individual licensee has a duty to ensure proper training records and reports are retained. Records must include, for the three-year period subsequent to the license renewal date:\n(1) the dates, subjects, and duration of programs;\n(2) sponsoring organizations;\n(3) fire training hours earned;\n(4) registration receipts to prove attendance at training sessions; and\n(5) other pertinent information.\n(d) The board may require a licensee, provider, or fire department to provide the information under paragraph (c) to demonstrate compliance with the 72-hour firefighting training requirement under subdivision 6, paragraph (a).\n(a) The board may revoke, suspend, or deny a license issued or applied for under this section to a firefighter or applicant if the firefighter or applicant has been convicted of any arson-related charge or a felony recognized by the board as a crime that would disqualify the licensee from participating in the profession of firefighting.\n(b) Each applicant, licensee, or fire department must notify the board, in writing, within ten days if the applicant or licensee has been convicted of or pled guilty or nolo contendere to a felony, any arson-related charge, or another offense arising from the same set of circumstances.\nFees collected under this section must be deposited in the state treasury and credited to a special account and are appropriated to the board to pay costs incurred under this section and sections 299N.04 and 299N.06.",
	"repealed": false
}