{
	"id": "390.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.225",
	"title": "390.225 PROPERTY.",
	"text": "The coroner or medical examiner may take possession of all articles that may be useful in establishing the cause or manner of death, identification, or next of kin of the deceased, and, if taken, mark them for identification, make an inventory, and retain them securely until they are no longer needed for evidence or investigation. Except as noted in subdivision 2, the coroner or medical examiner shall release any property or articles needed for any criminal investigation to law enforcement officers conducting the investigation.\nWhen a reasonable basis exists for not releasing property or articles to law enforcement officers, the coroner or medical examiner shall consult with the county attorney. If the county attorney determines that a reasonable basis exists for not releasing the property or articles, the coroner or medical examiner may retain them. The coroner or medical examiner shall obtain written confirmation of this opinion and keep a copy in the decedent's file.\nWith the exception of firearms, when property or articles are no longer needed for the investigation or as evidence, the coroner or medical examiner shall release such property or articles to the person or persons entitled to them. Personal property, including wearing apparel, may be released to the person entitled to control the disposition of the body of the decedent or to the personal representative of the decedent. Personal property not otherwise released pursuant to this subdivision must be disposed of pursuant to section 525.393.\nThe coroner or medical examiner shall release all firearms, when no longer needed, to the law enforcement agency handling the investigation.\nIf the name of the decedent is not known, the coroner or medical examiner shall release such property to the county for disposal or sale. If the unknown decedent's identity is established and if a representative shall qualify within six years from the time of such sale, the county administrator, or a designee, shall pay the amount of the proceeds of the sale to the representative on behalf of the estate upon order of the court. If no order is made within six years, the proceeds of the sale shall become a part of the general revenue of the county.",
	"repealed": false
}