{
	"id": "40A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.18",
	"title": "40A.18 LAND USE.",
	"text": "Land within an agricultural preserve must be maintained for agricultural production. The average maximum density of residential structures within an agricultural preserve and the location of a new structure must conform to locally applicable plan or zoning regulations. Commercial and industrial uses are not permitted except as provided in subdivision 2 after the user is issued a permit by the local government. The local government is responsible for enforcing this section.\n(a) Commercial and industrial operations are not allowed on land within an agricultural preserve except:\n(1) small on-farm commercial or industrial operations normally associated with and important to farming in the agricultural preserve area;\n(2) storage use of existing farm buildings that does not disrupt the integrity of the agricultural preserve;\n(3) small commercial use of existing farm buildings for trades not disruptive to the integrity of the agricultural preserve such as a carpentry shop, small scale mechanics shop, and similar activities that a farm operator might conduct;\n(4) wireless communication installments and related equipment and structure capable of providing technology potentially beneficial to farming activities. A property owner who installs wireless communication equipment does not violate a covenant made prior to January 1, 2018, under section 40A.10, subdivision 1; and\n(5) solar energy generating systems with an output capacity of one megawatt or less.\n(b) For purposes of paragraph (a), clauses (2) and (3), \"existing\" means existing on August 1, 1989.\nIf a separate parcel is created for a residential structure, commercial, or industrial use permitted under subdivision 1, the parcel is no longer an agricultural preserve unless the eligibility requirements of section 40A.09 and any county eligibility requirements are met. However, the separate parcel must remain under the maximum residential density restrictions in effect for the original preserve at the time it was placed into the preserve until the agricultural preserve status for the original parcel ends.",
	"repealed": false
}