{
	"id": "60A.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.137",
	"title": "60A.137 NONRENEWALS, CANCELLATIONS, OR REVISIONS OF CEDED REINSURANCE AGREEMENTS.",
	"text": "(a) No nonrenewals, cancellations, or revisions of ceded reinsurance agreements need be reported pursuant to section 60A.135 if the nonrenewals, cancellations, or revisions are not material. For purposes of sections 60A.135 to 60A.137, a material nonrenewal, cancellation, or revision for:\n(1) property and casualty business, including accident and health business when written by a property and casualty insurer is one that affects:\n(i) more than 50 percent of an insurer's ceded written premium; or\n(ii) more than 50 percent of the insurer's total ceded indemnity and loss adjustment reserves; and\n(2) life, annuity, and accident and health business, is one that affects more than 50 percent of the total reserve credit taken for business ceded, on an annualized basis as indicated in the insurer's most recently filed statutory statement.\n(b) With respect to either property and casualty or life, annuity, and accident and health business, either of the following events constitute a material revision that must be reported under section 60A.135:\n(1) an authorized reinsurer representing more than ten percent of a total cession is replaced by one or more unauthorized reinsurers; or\n(2) previously established collateral requirements have been reduced or waived for one or more unauthorized reinsurers representing collectively more than ten percent of a total cession.\n(c) Notwithstanding paragraphs (a) and (b), no filing is required:\n(1) for property and casualty business, including accident and health business written by a property and casualty insurer if the insurer's total ceded written premium represents, on an annualized basis, less than ten percent of its total written premium for direct and assumed business; or\n(2) for life, annuity, and accident and health business if the total reserve credit taken for business ceded represents, on an annualized basis, less than ten percent of the statutory reserve requirement before any cession.\n(a) The following information is required to be disclosed in a report of a material nonrenewal, cancellation, or revision of ceded reinsurance agreements:\n(1) effective date of the nonrenewal, cancellation, or revision;\n(2) the description of the transaction with an identification of the initiating entity;\n(3) purpose of, or reason for, the transaction; and\n(4) if applicable, the identity of the replacement reinsurers.\n(b) Insurers are required to report all material nonrenewals, cancellations, or revisions of ceded reinsurance agreements on a nonconsolidated basis unless the insurer is part of a consolidated group of insurers that utilizes a pooling arrangement or 100 percent reinsurance agreement that affects the solvency and integrity of the insurer's reserves and the insurer ceded substantially all of its direct and assumed business to the pool. An insurer is considered to have ceded substantially all of its direct and assumed business to a pool if the insurer has less than $1,000,000 total direct plus assumed written premiums during a calendar year that are not subject to a pooling arrangement and the net income of the business not subject to the pooling arrangement represents less than five percent of the insurer's capital and surplus.",
	"repealed": false
}