{
	"id": "171.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.22",
	"title": "171.22 UNLAWFUL ACTS RELATING TO DRIVER'S LICENSE.",
	"text": "With regard to any driver's license, including a commercial driver's license, it shall be unlawful for any person:\n(1) to display, cause or permit to be displayed, or have in possession, any fictitious or fraudulently altered driver's license or Minnesota identification card;\n(2) to lend the person's driver's license or Minnesota identification card to any other person or knowingly permit the use thereof by another;\n(3) to display or represent as one's own any driver's license or Minnesota identification card not issued to that person;\n(4) to use a fictitious name or date of birth to any police officer or in any application for a driver's license or Minnesota identification card, or to knowingly make a false statement, or to knowingly conceal a material fact, or otherwise commit a fraud in any such application;\n(5) to alter any driver's license or Minnesota identification card;\n(6) to take any part of the driver's license examination for another or to permit another to take the examination for that person;\n(7) to make a counterfeit driver's license or Minnesota identification card;\n(8) to use the name and date of birth of another person to any police officer for the purpose of falsely identifying oneself to the police officer;\n(9) to display as a valid driver's license any canceled, revoked, or suspended driver's license. A person whose driving privileges have been withdrawn may display a driver's license only for identification purposes; or\n(10) to submit a false affidavit or statement to the department on the certification required under section 171.05, subdivision 2, paragraph (a), clause (1), item (ii), subitem (C), to issue an instruction permit to a homeschool student.\nAny person who violates subdivision 1, clause (7) or (8), is guilty of a gross misdemeanor. Any person who violates any other provision of subdivision 1 is guilty of a misdemeanor.",
	"repealed": false
}