{
	"id": "524.2-709",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-709",
	"title": "524.2-709 REPRESENTATION; PER STIRPES; PER CAPITA AT EACH GENERATION.",
	"text": "(a) Definitions. In this section:\n(1) \"Deceased child\" or \"deceased descendant\" means a child or a descendant who either predeceased the distribution date or is deemed to have predeceased the distribution date under section 524.2-702.\n(2) \"Distribution date,\" with respect to an interest, means the time when the interest is to take effect in possession or enjoyment. The distribution date need not occur at the beginning or end of a calendar day, but can occur at a time during the course of a day.\n(3) \"Surviving ancestor,\" \"surviving child,\" or \"surviving descendant\" means an ancestor, a child, or a descendant who neither predeceased the distribution date nor is deemed to have predeceased the distribution date under section 524.2-702.\n(b) Representation; per stirpes. If an applicable statute or governing instrument calls for property to be distributed by \"representation\" or \"per stirpes,\" the property is divided into as many equal shares as there are (i) surviving children of the designated ancestor and (ii) deceased children who left surviving descendants. Each surviving child, if any, is allocated one share. The share of each deceased child with surviving descendants is divided in the same manner, with subdivision repeating at each succeeding generation until the property is fully allocated among surviving descendants.\n(c) Per capita at each generation. If a governing instrument calls for property to be distributed \"per capita at each generation,\" the property is divided into as many equal shares as there are (i) surviving descendants in the generation nearest to the designated ancestor which contains one or more surviving descendants and (ii) deceased descendants in the same generation who left surviving descendants, if any. Each surviving descendant in the nearest generation is allocated one share. The remaining shares, if any, are combined and then divided in the same manner among the surviving descendants of the deceased descendants as if the surviving descendants who were allocated a share and their surviving descendants had predeceased the distribution date.\n(d) Deceased descendant with no surviving descendant disregarded. For the purposes of paragraphs (b) and (c), an individual who is deceased and left no surviving descendant is disregarded, and an individual who leaves a surviving ancestor who is a descendant of the designated ancestor is not entitled to a share.",
	"repealed": false
}