{
	"id": "515B.3-116",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-116",
	"title": "515B.3-116 LIEN FOR ASSESSMENTS.",
	"text": "(a) The association has a lien on a unit for any assessment levied against that unit from the time the assessment becomes due. If an assessment is payable in installments, the full amount of the assessment is a lien from the time the first installment thereof becomes due. Unless the declaration otherwise provides, fees, charges, late charges, fines and interest charges pursuant to section 515B.3-102(a)(10), (11) and (12) are liens, and are enforceable as assessments, under this section. Recording of the declaration constitutes record notice and perfection of any assessment lien under this section, and no further recording of any notice of or claim for the lien is required.\n(b) Subject to subsection (c), a lien under this section is prior to all other liens and encumbrances on a unit except (i) liens and encumbrances recorded before the declaration and, in a cooperative, liens and encumbrances which the association creates, assumes, or takes subject to, (ii) any first mortgage encumbering the fee simple interest in the unit, or, in a cooperative, any first security interest encumbering only the unit owner's interest in the unit, (iii) liens for real estate taxes and other governmental assessments or charges against the unit, and (iv) a master association lien under section 515B.2-121(h). This subsection shall not affect the priority of mechanic's liens.\n(c) If a first mortgage on a unit is foreclosed, the first mortgage was recorded after June 1, 1994, and no owner or person who acquires the owner's interest in the unit redeems pursuant to chapter 580, 581, or 582, the holder of the sheriff's certificate of sale from the foreclosure of the first mortgage or any person who acquires title to the unit by redemption as a junior creditor shall take title to the unit subject to a lien in favor of the association for unpaid assessments for common expenses levied pursuant to section 515B.3-115(a), (e)(1) to (3), (f), and (i) which became due, without acceleration, during the six months immediately preceding the end of the owner's period of redemption. The common expenses shall be based upon the association's then current annual budget, notwithstanding the use of an alternate common expense plan under section 515B.3-115(a)(2). If a first security interest encumbering a unit owner's interest in a cooperative unit which is personal property is foreclosed, the secured party or the purchaser at the sale shall take title to the unit subject to unpaid assessments for common expenses levied pursuant to section 515B.3-115(a), (e)(1) to (3), (f), and (i) which became due, without acceleration, during the six months immediately preceding the first day following either the disposition date pursuant to section 336.9-610 or the date on which the obligation of the unit owner is discharged pursuant to section 336.9-622.\n(d) Proceedings to enforce an assessment lien shall be instituted within three years after the last installment of the assessment becomes payable, or shall be barred.\n(e) The unit owner of a unit at the time an assessment is due shall be personally liable to the association for payment of the assessment levied against the unit. If there are multiple owners of the unit, they shall be jointly and severally liable.\n(f) This section does not prohibit actions to recover sums for which subsection (a) creates a lien nor prohibit an association from taking a deed in lieu of foreclosure.\n(g) The association shall furnish to a unit owner or the owner's authorized agent upon written request of the unit owner or the authorized agent a statement setting forth the amount of unpaid assessments currently levied against the owner's unit. If the unit owner's interest is real estate, the statement shall be in recordable form. The statement shall be furnished within ten business days after receipt of the request and is binding on the association and every unit owner.\n(h) The association's lien may be foreclosed as provided in this subsection.\n(1) In a condominium or planned community, the association's lien may be foreclosed in a like manner as a mortgage containing a power of sale pursuant to chapter 580, or by action pursuant to chapter 581. The association shall have a power of sale to foreclose the lien pursuant to chapter 580, except that any portion of the assessment that represents attorney fees or costs shall not be included in the amount a unit owner must pay to reinstate under section 580.30 or chapter 581.\n(2) In a cooperative whose unit owners' interests are real estate, the association's lien shall be foreclosed in a like manner as a mortgage on real estate as provided in paragraph (1).\n(3) In a cooperative whose unit owners' interests in the units are personal property, the association's lien shall be foreclosed in a like manner as a security interest under article 9 of chapter 336. In any disposition pursuant to section 336.9-610 or retention pursuant to sections 336.9-620 to 336.9-622, the rights of the parties shall be the same as those provided by law, except (i) notice of sale, disposition, or retention shall be served on the unit owner 90 days prior to sale, disposition, or retention, (ii) the association shall be entitled to its reasonable costs and attorney fees not exceeding the amount provided by section 582.01, subdivision 1a, (iii) the amount of the association's lien shall be deemed to be adequate consideration for the unit subject to disposition or retention, notwithstanding the value of the unit, and (iv) the notice of sale, disposition, or retention shall contain the following statement in capital letters with the name of the association or secured party filled in:\n\"THIS IS TO INFORM YOU THAT BY THIS NOTICE (fill in name of association or secured party) HAS BEGUN PROCEEDINGS UNDER MINNESOTA STATUTES, CHAPTER 515B, TO FORECLOSE ON YOUR INTEREST IN YOUR UNIT FOR THE REASON SPECIFIED IN THIS NOTICE. YOUR INTEREST IN YOUR UNIT WILL TERMINATE 90 DAYS AFTER SERVICE OF THIS NOTICE ON YOU UNLESS BEFORE THEN:\n(a) THE PERSON AUTHORIZED BY (fill in the name of association or secured party) AND DESCRIBED IN THIS NOTICE TO RECEIVE PAYMENTS RECEIVES FROM YOU:\n(1) THE AMOUNT THIS NOTICE SAYS YOU OWE; PLUS\n(2) THE COSTS INCURRED TO SERVE THIS NOTICE ON YOU; PLUS\n(3) $500 TO APPLY TO ATTORNEY FEES ACTUALLY EXPENDED OR INCURRED; PLUS\n(4) ANY ADDITIONAL AMOUNTS FOR YOUR UNIT BECOMING DUE TO (fill in name of association or secured party) AFTER THE DATE OF THIS NOTICE; OR\n(b) YOU SECURE FROM A DISTRICT COURT AN ORDER THAT THE FORECLOSURE OF YOUR RIGHTS TO YOUR UNIT BE SUSPENDED UNTIL YOUR CLAIMS OR DEFENSES ARE FINALLY DISPOSED OF BY TRIAL, HEARING, OR SETTLEMENT. YOUR ACTION MUST SPECIFICALLY STATE THOSE FACTS AND GROUNDS THAT DEMONSTRATE YOUR CLAIMS OR DEFENSES.\nIF YOU DO NOT DO ONE OR THE OTHER OF THE ABOVE THINGS WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE, YOUR OWNERSHIP RIGHTS IN YOUR UNIT WILL TERMINATE AT THE END OF THE PERIOD, YOU WILL LOSE ALL THE MONEY YOU HAVE PAID FOR YOUR UNIT, YOU WILL LOSE YOUR RIGHT TO POSSESSION OF YOUR UNIT, YOU MAY LOSE YOUR RIGHT TO ASSERT ANY CLAIMS OR DEFENSES THAT YOU MIGHT HAVE, AND YOU WILL BE EVICTED. IF YOU HAVE ANY QUESTIONS ABOUT THIS NOTICE, CONTACT AN ATTORNEY IMMEDIATELY.\"\n(4) In any foreclosure pursuant to chapter 580, 581, or 582, the rights of the parties shall be the same as those provided by law, except (i) the period of redemption for unit owners shall be six months from the date of sale or a lesser period authorized by law, (ii) in a foreclosure by advertisement under chapter 580, the foreclosing party shall be entitled to costs and disbursements of foreclosure and attorney fees authorized by the declaration or bylaws, notwithstanding the provisions of section 582.01, subdivisions 1 and 1a, (iii) in a foreclosure by action under chapter 581, the foreclosing party shall be entitled to costs and disbursements of foreclosure and attorney fees as the court shall determine, and (iv) the amount of the association's lien shall be deemed to be adequate consideration for the unit subject to foreclosure, notwithstanding the value of the unit.\n(i) If a holder of a sheriff's certificate of sale, prior to the expiration of the period of redemption, pays any past due or current assessments, or any other charges lienable as assessments, with respect to the unit described in the sheriff's certificate, then the amount paid shall be a part of the sum required to be paid to redeem under section 582.03.\n(j) In a cooperative, if the unit owner fails to redeem before the expiration of the redemption period in a foreclosure of the association's assessment lien, the association may bring an action for eviction against the unit owner and any persons in possession of the unit, and in that case section 504B.291 shall not apply.\n(k) An association may assign its lien rights in the same manner as any other secured party.",
	"repealed": false
}