{
	"id": "299F.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.06",
	"title": "299F.06 TESTIMONIAL POWERS.",
	"text": "(a) In order to establish if reasonable grounds exist to believe that a violation of sections 609.561 to 609.576 has occurred, or to determine compliance with the State Fire Code or corrective orders issued under that code, the state fire marshal and the staff designated by the state fire marshal, in any county of the state, may summon and compel the attendance of witnesses to testify before the state fire marshal, chief assistant fire marshal, or deputy state fire marshals and may require the production of any book, paper, or document deemed pertinent.\n(b) A summons issued under this subdivision must be served in the same manner and has the same effect as a subpoena issued from a district court. All witnesses must receive the same compensation as is paid to witnesses in district courts, which must be paid out of the fire marshal fund upon a voucher certificate signed by the state fire marshal, chief assistant fire marshal, or deputy fire marshal before whom any witnesses have attended and this officer shall, at the close of the investigation in which the witness was subpoenaed, certify to the attendance and mileage of the witness. This certificate must be filed in the Office of the State Fire Marshal. All investigations held by or under the direction of the state fire marshal or any subordinate may, in the state fire marshal's discretion, be private and persons other than those required to be present by the provisions of this chapter may be excluded from the place where the investigation is held, and witnesses may be kept separate and apart from each other and not allowed to communicate with each other until they have been examined.\nThe state fire marshal, chief assistant state fire marshal, and deputy state fire marshals are each hereby authorized and empowered to administer oaths and affirmations to any persons appearing as witnesses before them; and false swearing in any matter or proceeding aforesaid shall be deemed perjury and punished as such.\nAny witness who refuses to be sworn, or who refuses to testify, or who disobeys any lawful order of the state fire marshal, chief assistant fire marshal, or deputy state fire marshal in relation to the investigation, or who fails or refuses to produce any paper, book, or document touching any matter under examination, or who is guilty of any contemptuous conduct, after being summoned to appear before them to give testimony in relation to any matter or subject under examination or investigation may be punished by any district court in the same manner as if the proceedings were pending in that court, subject to the provisions of section 588.01.",
	"repealed": false
}