{
	"id": "245.825",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.825",
	"title": "245.825 AVERSIVE AND DEPRIVATION PROCEDURES; LICENSED FACILITIES AND SERVICES.",
	"text": "The commissioner of human services shall by October, 1983, promulgate rules governing the use of aversive and deprivation procedures in all licensed facilities and licensed services serving persons with developmental disabilities. No provision of these rules shall encourage or require the use of aversive and deprivation procedures. The rules shall prohibit: (1) the application of certain aversive and deprivation procedures in facilities except as authorized and monitored by the commissioner; (2) the use of aversive and deprivation procedures that restrict the consumers' normal access to nutritious diet, drinking water, adequate ventilation, necessary medical care, ordinary hygiene facilities, normal sleeping conditions, and necessary clothing; and (3) the use of faradic shock without a court order. The rule shall further specify that consumers may not be denied ordinary access to legal counsel and next of kin. In addition, the rule may specify other prohibited practices and the specific conditions under which permitted practices are to be carried out. For any persons receiving faradic shock, a plan to reduce and eliminate the use of faradic shock shall be in effect upon implementation of the procedure.\n[Repealed, 1999 c 86 art 2 s 6]\nNotwithstanding the provisions of Minnesota Rules, parts 9525.2700 to 9525.2810, the commissioner may designate the county case manager to authorize the use of controlled procedures as defined in Minnesota Rules, parts 9525.2710, subpart 9, and 9525.2740, subparts 1 and 2, after review and approval by the interdisciplinary team and the internal review committee as required in Minnesota Rules, part 9525.2750, subparts 1a and 2. Use of controlled procedures must be reported to the commissioner in accordance with the requirements of Minnesota Rules, part 9525.2750, subpart 2a.\n[Repealed, 1995 c 207 art 11 s 12]",
	"repealed": false
}