{
	"id": "18C.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.111",
	"title": "18C.111 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall administer, implement, and enforce this chapter and the Department of Agriculture is the lead state agency for the regulation of fertilizer, including storage, handling, distribution, use, and disposal of fertilizer.\nThe commissioner may delegate duties under this chapter to designated employees or agents of the Department of Agriculture.\nThe commissioner may, by written agreements, delegate specific inspection, enforcement, and other regulatory duties of this chapter to officials of other agencies. The delegation may only be made to a state agency, a political subdivision, or a political subdivision's agency that has signed a joint powers agreement with the commissioner as provided in section 471.59. The commissioner may also enter into data sharing agreements with other state agencies to help assess the potential for unreasonable adverse effects to human health and the environment from the use of a fertilizer.\n(a) The commissioner may, under rules adopted under section 18C.121, subdivision 1, certify a person to offer or perform a regulatory compliance inspection of any person or site that stores, handles, or distributes ammonia or anhydrous ammonia fertilizer. The deadlines established in section 14.125 are extended until June 30, 2014, for rules adopted under this subdivision.\n(b) Pursuant to those rules, a person certified under paragraph (a) may issue a certification of compliance to an inspected person or site if the certified person documents in writing full compliance with the provisions of this chapter and rules adopted under this chapter.\n(c) A person or site issued a certification of compliance must provide a copy of the certification to the commissioner immediately upon request or within 90 days following certification.\n(d) Certifications of compliance are valid for a period of three years. The commissioner may determine a different time period in the interest of public safety or for other reasonable cause.\nThe Department of Agriculture is the lead state agency for the regulation of fertilizer containing PFAS, including the storage, handling, distribution, use, and disposal of fertilizer containing PFAS. In order to reduce duplication, a distributor, registrant, or guarantor is not required to provide technical data to another state agency if the distributor, registrant, or guarantor has previously submitted the data to the commissioner and the data is available to the other state agencies.",
	"repealed": false
}