{
	"id": "462A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.31",
	"title": "462A.31 COMMUNITY LAND TRUSTS.",
	"text": "A community land trust must have as one of its purposes the holding of land and the leasing of land for the purpose of preserving the affordability of housing on that land for persons and families of low and moderate income.\nA community land trust may have any or all of the powers permitted to a nonprofit corporation under chapter 317A, except that a community land trust must have the power to buy and sell land, to mortgage and otherwise encumber land, and to negotiate and enter into ground leases with an initial term of up to 99 years.\nA ground lease in which a community land trust is the lessor must contain provisions designed to preserve the affordability of housing on the land. Each ground lease must reserve to the community land trust the first option to purchase any building or improvement on the land, or any condominium or cooperative unit located in a building on the land, at a limited equity price specified in the ground lease. Each ground lease must grant to the Minnesota Housing Finance Agency the right to exercise that first option to purchase if the community land trust does not, for any reason, exercise the first option. Each ground lease must exempt sales to persons and families of low and moderate income from the provisions granting the first option to purchase to the community land trust and to the Minnesota Housing Finance Agency. Sales to persons and families of low and moderate income are not exempt from the limited equity price. A ground lease may also contain appropriate restrictions on:\n(1) subletting or assigning the ground lease;\n(2) construction and renovation of buildings and other improvements; and\n(3) sale of buildings and improvements.\n(a) A ground lease with a community land trust must prohibit the lessee from mortgaging the lessee's interest in the lease or in buildings or other improvements without the consent of the community land trust. A ground lease may obligate a community land trust as lessor and fee title holder to consent to, join in, or subordinate its interest to, a mortgage entered into by a lessee as mortgagor for the purpose of obtaining financing for acquisition, construction, or renovation of housing on the land. A lease provision so obligating a community land trust must specify that the mortgage must provide to the community land trust the right to receive from the mortgagee prompt notice of default in the mortgage and the right to cure the default or to purchase the mortgagee's interest in the mortgage. The limited equity price and provisions in subdivision 3 do not apply if the lessee or the community land trust fails to cure the default or purchase the mortgagee's interest in the mortgage.\n(b) A ground lease with a community land trust must provide that the community land trust will not, during the term of the lease, mortgage or otherwise encumber its interest in the property or permit any liens on its interest in the property to exist. This prohibition does not apply to mortgages that require the mortgagee to subordinate the lien of its mortgage to a mortgage entered into by a lessee as mortgagor for the purpose of obtaining financing for acquisition, construction, or renovation of housing on the land.\nA ground lease with a community land trust must provide that the heirs of the lessee may assume the lease, if the heirs agree to occupy the lease property as their homestead. For purposes of this subdivision, \"the heirs\" means the heirs at law of a lessee who dies intestate or the devises of a lessee who dies testate.\nA city may by resolution determine to act as a community land trust with the powers and duties described in subdivisions 1 to 5.\nAny ground lease held by a community land trust shall include the legal description of the real property subject to the ground lease and shall be recorded with the county recorder or with the registrar of titles in the county in which the real property subject to the ground lease is located.",
	"repealed": false
}