{
	"id": "66A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.08",
	"title": "66A.08 REQUIREMENTS.",
	"text": "No mutual insurance company hereafter organized shall be licensed to transact any of the kinds of business specified in section 60A.06, subdivision 1, clause (3), (5), (6), (8), (9), (10), (12), (13), (14), or (15), except upon compliance with the following conditions:\n(1) It shall have not less than 300 bona fide applications for policies of insurance of each kind sought to be written, signed by at least 300 members, covering at least 300 separate risks, each risk, within the maximum net single risk described in clause (2) and one year's premiums thereon paid in cash, and admitted assets of not less than $100,000, which admitted assets shall not be less than five times the maximum net single risk, and shall have on deposit with the commissioner in accordance with section 60A.10, subdivision 4, as security for all of its policyholders, stock or bonds of this state or of the United States or bonds of any of the municipalities of this state, or personal obligations secured by first mortgage on real estate within this state worth, exclusive of buildings, the amount of the lien, and bearing interest of not less than three percent per annum, to an amount the actual market value of which, exclusive of interest, shall never be less than $100,000;\n(2) It shall not expose itself to any loss on any one risk or hazard, except as provided in this clause, in an amount exceeding ten percent of its net assets, actual and contingent. For the purposes of this section contingent assets mean the aggregate amount of the contingent liability of its members for the payment of loss and expenses not provided for by its cash funds. Contingent liability, for the purposes of this section, means an amount not to exceed one annual premium as stated in the policy. No portion of any risk or hazard which has been reinsured, as authorized by the laws of this state, shall be included in determining the limitation of risk prescribed by this section. For the purpose of transacting employers' liability and workers' compensation insurance, each employee shall be considered a separate risk for determining the maximum single risk;\n(3) It shall maintain unearned premiums and other reserves, separately for each kind of business, upon the same basis as that required of domestic stock insurance companies transacting the same kind of business;\n(4) Except as expressly provided in this chapter, it shall comply with all the provisions of the laws of this state relating to the organization and internal management of mutual fire insurance companies in so far as the same may be applicable and not inconsistent with chapter 66A.\n(1) General. No policy shall be issued by a mutual fire insurance company hereafter organized until not less than $750,000 of insurance, in not less than 300 separate risks, upon property located in this state, has been subscribed for and entered upon the books and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $7,500 in cash.\n(2) Exceptions. When the mutual insurance company is organized to issue policies exclusively upon one of the specified lines of business listed below, it may issue policies insuring such risks by complying with the following requirements:\n(a) Those organized to insure creamery and cheese factory buildings, their contents and equipments, and the dwelling house and contents, and barn, livestock, and vehicles of the owner of the creamery or factory, may issue policies when not less than $50,000 of insurance, in not less than 25 separate risks, upon these buildings and contents in this state, has been subscribed for and so entered and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $1,000 in cash; and the name of every such company shall include the words \"Mutual creamery fire insurance company,\" and it shall issue no policy except upon the class of risks aforesaid.\nAny company heretofore organized and doing business under this clause, which for 15 years prior to the passage of Laws 1935, chapter 97, has insured creamery and cheese factory buildings, their contents and equipments, and the dwelling houses and contents and barn, livestock, and vehicles of the owner of the creamery or factory, and which has assets of $100,000, may issue policies in addition thereto to cover farmers' elevators, cooperatively owned warehouses, cooperative filling stations, cooperative oil companies, and all cooperatively owned or organized enterprises;\n(b) Those organized to insure the stock in trade, tools, and fixtures of retail hardware dealers, the buildings containing the same, and the dwelling house and its contents, barns, livestock, and vehicles owned by these dealers, may issue policies when not less than $500,000 of insurance, in not less than 200 separate risks, upon such property in this state, has been subscribed for and entered upon its books and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $5,000 in cash; and the name of every such company shall include the words \"Mutual retail hardware fire insurance company,\" and it shall issue no policy except as above specified;\n(c) Those organized to insure dwelling houses, their contents, barns, livestock, and vehicles, exclusively, may issue policies when not less than $250,000 of insurance, in not less than 200 separate risks, upon such property located within this state, has been subscribed for and entered upon their books and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $2,500 in cash; and the name of every such company shall include the words \"Mutual dwelling house fire insurance company,\" and it shall issue no policy except upon the class of risks aforesaid;\n(d) Those organized to insure printing material, machinery, and stock in trade of newspaper publishers and printers, the buildings containing the same, and the dwelling house and its contents, barns, livestock, and vehicles, when such buildings and contents are owned and occupied by the owner of the printing material, machinery, and stock in trade may issue policies when not less than $200,000 of insurance, in not less than 200 separate risks, upon such property located in this state, has been subscribed for and entered upon such companies' books and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $2,000 in cash; and the name of every such company shall include the words \"Mutual publishers' fire insurance company,\" and it shall issue no policy except upon the class of risks aforesaid;\n(e) Those organized to insure grain elevators, warehouses and cribs, machinery, grain, sacks, and tools appurtenant to or contained in such elevators, warehouses, and cribs, and dwelling house and contents, barns, livestock, and vehicles when such buildings and contents are owned and occupied by the owner of the grain elevator, may issue such policies when not less than $100,000 of insurance, in not less than 50 separate risks, upon such property in this state, has been subscribed for and entered upon the books of such companies and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $1,000 in cash; and the name of the company shall include the words \"Mutual grain dealers' fire insurance company,\" and it shall issue no policy except upon the class of risks aforesaid; and\n(f) Those organized to insure exclusively the property of any one church or any one religious denomination, and the church property and equipment and furnishings thereof of any one church or any one religious denomination may issue policies when not less than $100,000, in not less than 50 separate risks, upon these properties, has been subscribed for and so entered, and the premiums thereon for one year paid in cash, which premiums shall aggregate not less than $1,000 in cash; and the name of every such company shall include the words \"Mutual denominational fire insurance company,\" and it shall issue no policy except upon the class of risks aforesaid. This section shall not be construed as a repeal of section 66A.311.\n(1) Requirements. Every mutual marine company, before issuing any policy, shall have an agreement duly executed by solvent subscribers to the amount of at least $300,000, substantially as follows: \"We, the subscribers, severally agree to pay to the (name of company), on demand, the whole or such part of the amounts set opposite our names, respectively, as may be called, from time to time, for its use, to pay losses and expenses not otherwise provided for\"; and this agreement, endorsed with the certificate of the president and a majority of the directors that these subscribers are known to them and that they believe each to be solvent, shall be filed with and approved by the commissioner.\nWhen from death or other cause a deficiency exists in the subscription fund, the same shall be made good by new subscriptions certified in the same manner as the original. Subscribers shall be entitled to annual dividends of two percent upon the amount of their subscriptions from the profits of the company and reimbursed from future profits for all money they shall pay to the company for its uses under their agreement, with interest thereon.\n(2) Dividends and retirement of subscriptions. The net profits or dividend surplus of every such company shall be annually divided among the insured whose policies terminated during the year, in proportion to their contribution thereto. These dividends shall be made only in scrip certificates payable out of the accumulated profits or surplus, and this accumulation shall be kept and invested as a separate fund in trust for the redemption of these certificates and for losses and expenses, as herein provided. Until redeemed, these certificates shall be subject to future losses and expenses and reduced in case the redemption fund is drawn upon for payment of these losses and expenses, but no part of this fund shall be used for payment of losses or expenses, except when and to the extent that the cash assets are insufficient therefor; and when any portion thereof is so used the outstanding certificates shall be reduced proportionately so that the fund shall at all times equal the unredeemed certificates. The net income of the redemption fund shall be divided annually among the holders of its certificates, or it may make such certificates with a special rate of interest payable from the income of its invested funds. As these profits accumulate and are invested, subscriptions of an equal amount shall be canceled. The maximum of accumulations and profits shall be $300,000 and all excess of profits beyond that amount shall be applied annually to the payment of the certificates in the order of their issue. The certificates shall be forthwith payable when the company ceases to issue policies and the fund is no longer liable to be drawn upon for the payment of losses.\n(3) Government; liability of officers and directors. Every domestic mutual marine company shall be governed by the provisions applicable to mutual fire companies and each subscriber to the subscription fund shall be a member during the term of subscription and entitled to one vote. If a subscriber fails to pay the subscription or any assessment thereon and it is shown that any director or officer knowingly certified falsely as to that subscriber, the person so certifying shall be liable for the amount thereof. If any such company is at any time liable for losses beyond the amount of its net assets, the president and directors shall be personally liable for all losses on insurance effected while the company remains in such condition.\n(1) Organization. (a) Subscribers and articles of incorporation. Twenty or more persons may form an incorporated mutual employers' liability insurance association for the purpose of insuring themselves and such other persons, firms, or corporations as may become subscribers to the association against liability for compensation payable under the terms of the workers' compensation law and for the purpose of insuring against loss or damage by the sickness, bodily injury, or death by accident of any person employed by the insured or for whose injury or death the insured is responsible.\nThey shall subscribe and acknowledge a certificate specifying:\n(i) the name, general nature of its business, and the principal place of transacting the same; (such name shall distinguish it from all other corporations, domestic or foreign, authorized to do business in this state and end with \"company,\" \"corporation,\" \"association,\" or the word \"incorporated\");\n(ii) the period of its duration;\n(iii) the names and places of residence of the incorporators;\n(iv) in what board its management shall be vested and the names and addresses of those composing the board until the first election, a majority of whom shall always be residents of the state;\n(v) the highest amount of indebtedness or liability to which the corporation shall at any time be subject; and\n(vi) the territory within which the association may do business.\nIt may contain any other lawful provisions defining and regulating the powers or business of the corporation, its officers, directors, trustees, and members.\nThe certificate of incorporation of every such corporation shall be submitted to the commissioner for approval and, if approved, one copy thereof shall be filed with the secretary of state and one copy with the commissioner.\n(b) Bylaws and seal. Such association shall have the power to make bylaws for the government of its officers and the conduct of its affairs, to alter and amend the same, and to adopt a common seal.\n(c) Annual meeting; voting rights. The annual meeting for the election of directors shall be held at such time as the bylaws of the association may direct. Of the time and place of the meeting at least 30 days previous written or printed notice shall be given to the subscribers, or the notice may be given by publication, not less than three times, in at least two daily or weekly newspapers published in the city or county wherein the association has its principal office and in the legal periodical, if any, designated by the rules of court of the proper county for the publication of legal notices. Subscribers who, during the preceding calendar year, have paid into the treasury of the association premiums amounting to more than one-half of the total premiums received by it during that year, shall constitute a quorum. At this annual meeting the subscribers shall elect, by ballot, from their own number, not less than five directors, a majority of whom shall be residents of this state, to serve for at least one year and until their successors are duly chosen. The association may provide in its bylaws for the division of its board of directors into two, three, or four classes, and for the election thereof at its annual meetings in such manner that the members of one class only shall retire and their successors be chosen each year. Vacancies may be filled by election by the board until the next annual meeting. In the choice of directors and in all meetings of the association, each subscriber shall be entitled to one vote for every $100, or any fraction thereof, paid by the subscriber in premiums into the treasury of the association during the preceding calendar year. Subscribers may vote by proxy and the record of all votes shall be made by the secretary and show whether the same were cast in person or by proxy and shall be evidence of all these elections. Not less than three directors shall constitute a quorum. The directors shall annually choose by ballot a president, who shall be a member of the board; a secretary; a treasurer, who may be either the president or secretary; and such other officers as the bylaws may provide; and fix the salaries of the president and the secretary, as well as the salaries or compensation of such other officers and agents as the bylaws prescribe. Vacancies in any office may be filled by the directors or by the subscribers, as the bylaws shall prescribe.\n(2) Requirements. (a) Number of risks to qualify. These associations shall not begin to issue policies until a list of subscribers with the number of employees of each which, in the aggregate, must number not less than 5,000, together with such other information as the commissioner may require, shall have been filed at the Department of Commerce, nor until the president and secretary of the association shall have certified under oath that every subscription in the list so filed is genuine and made with an agreement of all the subscribers that they will take the policies subscribed for within 30 days of the granting of a license by the commissioner. In case of associations organized exclusively for the purpose of insuring creameries, cheese factories, and livestock shipping associations, these associations may begin to issue policies when the number of employees insured aggregates 300.\nUpon the filing of the certificate provided for in this section, the commissioner shall make such investigations as deemed proper and, if the findings warrant it, grant a license to the association to issue policies.\n(b) Number of risks required to continue in business. If at any time the number of subscribers falls below 20, or the number of subscribers' employees within the state falls below 5,000, no further policies shall be issued until the total number of subscribers amounts to not less than 20, whose employees within the state are not less than 5,000. In case of associations organized for the purpose of insuring creameries, cheese factories, and livestock shipping associations, the number of subscribers must not fall below 200, nor the number of subscribers' employees within the state below 300.\n(3) Additional powers. (a) May write automobile insurance. Any such company authorized to write workers' compensation or liability insurance under this subdivision, when its articles of incorporation so provide, shall be permitted to insure against loss or damage to automobiles or other vehicles and their contents by collision, fire, burglary, or theft, and other perils of operation, and against liability for damage to persons or property of others by collision with such vehicles, and to insure against any loss or hazard incident to the ownership, operation, or use of motor or other vehicles, as specified in section 60A.06, subdivision 1, clause (12).\n(b) May write glass insurance. Any company authorized to write workers' compensation or liability insurance under this subdivision when its articles of incorporation so provide shall be permitted to insure against loss or damage by breakage of glass located or in transit.\n(c) Special powers. Any company organized under this subdivision which, for 15 years prior to the passage of Laws 1935, chapter 136, has exclusively insured creameries, cheese factories, and livestock shipping associations, and which has assets of $100,000 or more, may write public liability and compensation insurance coverage of creameries, cheese factories, shipping associations, farmers' elevators, cooperatively owned warehouses, cooperative filling stations, cooperative oil companies and all cooperatively owned or organized enterprises.\n(4) Internal operation. (a) Policies. Policies of insurance issued by any such association may be made either with or without the seal thereof and they shall be signed by the president, or such other officers as may be designated by the directors for that purpose, and attested by the secretary.\n(b) Classification of risks. The board of directors may divide the subscribers into groups in accordance with the nature of their business and the probable risk of injury therein. In such case they shall fix all premiums, make all assessments, and determine and pay all dividends by and for each group in accordance with the experience thereof, but all funds of the association and the contingent liability of all subscribers shall be available for the payment of any claim against the association; provided, that (as between the association and its subscribers) until the whole of the contingent liability of the members of any group shall be exhausted, the general funds of the association and the contingent liability of the members of other groups shall not be available for the payment of losses and expenses incurred by such group in excess of the earned premiums paid by the members thereof.\n(c) Classification to be filed. A statement of any proposed distribution of subscribers into groups shall be filed with the Department of Commerce.\n(d) Rates. The board of directors shall determine the amount of premiums which the subscribers of the association shall pay for their insurance in accordance with the nature of the business in which the subscribers are engaged and the probable risk of injury to their employees under existing conditions, and it shall fix premiums at such amounts as in its judgment shall be sufficient to enable the association to pay to its subscribers all sums which may become due and payable to their employees under provisions of law and the expenses of conducting the business of the association. In fixing the premium payable by any subscriber, the board of directors may take into account the condition of the plant, workroom, shop, farm, or premises of the subscriber in respect to the safety of those employed therein as shown by the report of any inspector appointed by the board and it may from time to time change the amount of premiums payable by any of the subscribers as circumstances may require and the condition of the plant, workroom, shop, farm, or premises of the subscribers in respect to the safety of their employees may justify and may increase the premiums of any subscriber neglecting to provide safety devices required by law, or disobeying the rules or regulations made by the board of directors in accordance with the provisions of clause (4)(g).\n(e) Premiums; contingent liability. Every such company shall charge and collect on each policy a premium equal to one year's premium on the policy issued and state in the policy the estimated annual premium and provide in its bylaws for the determination of the actual premium and for the payment of same when determined. The premium thus determined shall be known as the annual premium on the policy. The company shall provide in its bylaws and specify in its policies the maximum contingent mutual liability of its members for the payment of losses and expenses not provided for by its cash fund. The contingent liability of a member shall not be less than a sum equal and in addition to one annual premium, nor more than a sum equal to five times the amount of the annual premium or, in case of a policy written for less than one year, the contingent liability shall not be less than the proportionate fractional part of the annual premium, nor more than five times the proportionate fractional part of the annual premium. The contingent liability of the policyholder shall be plainly and legibly stated in each policy as follows: \"The maximum contingent liability of the policyholder under this policy shall be a sum equal to ..... annual premium (or premiums).\"\n(f) Assessments. When the liabilities, including unearned premiums and such other reserves as are or may be required by law and the commissioner, are in excess of the admitted assets computed on the basis allowed for its annual statement, it shall make an assessment upon its policyholders based upon the amount of one annual premium as written in the policy and not to exceed the amount of five annual premiums.\nIf it becomes necessary to levy the assessment, as provided by this section, no policies shall be issued until the admitted assets of the association are in excess of its liabilities.\n(g) Power of board of directors. The board of directors shall be entitled to inspect the plant, workroom, shop, farm, or premises of any subscriber and for this purpose to appoint inspectors, who shall have free access to all such premises during regular working hours, and the board of directors shall likewise from time to time be entitled to examine by their auditor or other agent the books, records, and payrolls of any subscribers for the purpose of determining the amount of premium chargeable to the subscriber.\nThe board of directors shall make reasonable rules and regulations for the prevention of injuries upon the premises of subscribers; and may refuse to insure, or may terminate the insurance of, any subscriber who refuses to permit these examinations and disregards such rules or regulations, and forfeit all premiums previously paid, but the termination of the insurance of any subscriber shall not release the subscriber from liability for the payment of assessments then or thereafter made by the board of directors to make up deficiencies existing at the termination of the insurance.\n(h) Investments. The association shall invest and keep invested all its funds of every description, excepting such cash as may be required in the transaction of its business, in accordance with the laws of this state or relating to the investment of funds of domestic insurance companies.\nNo such association shall purchase, hold, or convey real estate except as provided by section 60A.11, subdivision 6.\n(i) Withdrawal of subscriber. Any subscriber of the association who has complied with all its rules and regulations may withdraw therefrom by written notice to that effect sent by the subscriber by certified mail to the association and this withdrawal shall become effective on the first day of the month immediately following the tenth day after the receipt of the notice, but the withdrawal shall not release the subscriber from liability for the payment of assessments thereafter made by the board of directors to make up deficiencies existing at the date of withdrawal and the subscriber shall be entitled to the subscriber's share of any dividends earned at the date of withdrawal.\n(5) Miscellaneous. (a) Perjury by officer. Any officer of the association who shall falsely make oath to any certificate required to be filed with the commissioner shall be guilty of perjury.\n(b) Foreign mutual employers' liability association. Any mutual employers' liability insurance association of another state, upon compliance with all laws governing such corporations in general and the provisions of this subdivision may be admitted to transact business in this state. These associations shall pay to the Department of Commerce the fees prescribed by section 60A.14, subdivision 1.\n(c) Winding up affairs. When the contracts of insurance issued by these associations shall cover in the aggregate less than 5,000 employees or, in the case of associations organized for the purpose of insuring creameries, cheese factories, and livestock shipping associations, less than 300 employees, the association shall forthwith notify the commissioner of that fact and if, at the expiration of six months from the notice, the aggregate number of employees covered by the contracts of insurance shall be less than 5,000, or, in the case of associations organized for the purpose of insuring creameries, cheese factories, and livestock shipping associations, less than 300 employees, the commissioner shall proceed under the provisions of chapter 60B.",
	"repealed": false
}