{
	"id": "144A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.04",
	"title": "144A.04 QUALIFICATIONS FOR LICENSE.",
	"text": "No nursing home license shall be issued to a facility unless the commissioner of health determines that the facility complies with the requirements of this section.\nThe controlling persons of the facility must comply with the application requirements specified by section 144A.03 and the rules of the commissioner of health.\nThe commissioner shall not adopt any rule unconditionally prohibiting locks on patient room doors in nursing homes. The commissioner may adopt a rule requiring locks to be consistent with the applicable rules enforced by the state fire marshal.\n(a) The facility must meet the minimum health, sanitation, safety and comfort standards prescribed by the rules of the commissioner of health with respect to the construction, equipment, maintenance and operation of a nursing home. The commissioner of health may temporarily waive compliance with one or more of the standards if the commissioner determines that:\n(1) temporary noncompliance with the standard will not create an imminent risk of harm to a nursing home resident; and\n(2) a controlling person on behalf of all other controlling persons:\n(i) has entered into a contract to obtain the materials or labor necessary to meet the standard set by the commissioner of health, but the supplier or other contractor has failed to perform the terms of the contract and the inability of the nursing home to meet the standard is due solely to that failure; or\n(ii) is otherwise making a diligent good faith effort to meet the standard.\nThe commissioner shall make available to other nursing homes information on facility-specific waivers related to technology or physical plant that are granted. The commissioner shall, upon the request of a facility, extend a waiver granted to a specific facility related to technology or physical plant to the facility making the request, if the commissioner determines that the facility also satisfies clauses (1) and (2) and any other terms and conditions of the waiver.\nThe commissioner of health shall allow, by rule, a nursing home to provide fewer hours of nursing care to intermediate care residents of a nursing home than required by the present rules of the commissioner if the commissioner determines that the needs of the residents of the home will be adequately met by a lesser amount of nursing care.\n(b) A facility is not required to seek a waiver for room furniture or equipment under paragraph (a) when responding to resident-specific requests, if the facility has discussed health and safety concerns with the resident and the resident request and discussion of health and safety concerns are documented in the resident's patient record.\nThe commissioner shall not adopt any rule which unconditionally prohibits double beds in a nursing home. The commissioner may adopt rules setting criteria for when double beds will be allowed.\n(a) A nursing home provider must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in CDC's Morbidity and Mortality Weekly Report (MMWR). This program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, residents, and volunteers. The Department of Health shall provide technical assistance regarding implementation of the guidelines.\n(b) Written compliance with this subdivision must be maintained by the nursing home.\n(a) The commissioner has discretion to bar any controlling persons of a nursing home if the person was a controlling person of any other nursing home, assisted living facility, long-term care or health care facility, or agency in the previous two-year period and:\n(1) during that period of time the facility or agency incurred two or more uncorrected violations or one or more repeated violations which created an imminent risk to direct resident or client care or safety; or\n(2) during that period of time, was convicted of a felony or gross misdemeanor that related to operation of the facility or agency or directly affected resident safety or care.\n(b) The provisions of this subdivision shall not apply to any controlling person who had no legal authority to affect or change decisions related to the operation of the nursing home which incurred the uncorrected violations.\n(c) When the commissioner bars a controlling person under this subdivision, the controlling person has the right to appeal under chapter 14.\n(a) In lieu of revoking, suspending, or refusing to renew the license of a nursing home with a controlling person disqualified by subdivision 4, paragraph (a), clause (1), the commissioner may issue an order staying the revocation, suspension, or nonrenewal of the nursing home license. The order may, but need not, be contingent upon the nursing home's compliance with restrictions and conditions imposed on the license to ensure the proper operation of the nursing home and to protect the health, safety, comfort, treatment, and well-being of the residents in the home. The decision to issue an order for stay must be made within 90 days of the commissioner's determination that a controlling person is disqualified by subdivision 4, paragraph (a), clause (1), from operating a nursing home.\n(b) In determining whether to issue a stay and to impose conditions and restrictions, the commissioner shall consider the following factors:\n(1) the ability of the controlling persons to operate other nursing homes in accordance with the licensure rules and laws;\n(2) the conditions in the facility that received the number and type of uncorrected or repeated violations described in subdivision 4, paragraph (a), clause (1); and\n(3) the conditions and compliance history of each of the nursing homes operated by the controlling persons.\n(c) The commissioner's decision to exercise the authority under this subdivision in lieu of revoking, suspending, or refusing to renew the license of the nursing home is not subject to administrative or judicial review.\n(d) The order for the stay of revocation, suspension, or nonrenewal of the nursing home license must include any conditions and restrictions on the nursing home license that the commissioner deems necessary based upon the factors listed in paragraph (b).\n(e) Prior to issuing an order for stay of revocation, suspension, or nonrenewal, the commissioner shall inform the controlling persons, in writing, of any conditions and restrictions that will be imposed. The controlling persons shall, within ten working days, notify the commissioner in writing of their decision to accept or reject the conditions and restrictions. If the nursing home rejects any of the conditions and restrictions, the commissioner shall either modify the conditions and restrictions or take action to suspend, revoke, or not renew the nursing home license.\n(f) Upon issuance of the order for stay of revocation, suspension, or nonrenewal, the controlling persons shall be responsible for compliance with the conditions and restrictions contained therein. Any time after the conditions and restrictions have been in place for 180 days, the controlling persons may petition the commissioner for removal or modification of the conditions and restrictions. The commissioner shall respond to the petition within 30 days of the receipt of the written petition. If the commissioner denies the petition, the controlling persons may request a hearing under the provisions of chapter 14. Any hearing shall be limited to a determination of whether the conditions and restrictions shall be modified or removed. At the hearing, the controlling persons will have the burden of proof.\n(g) The failure of the controlling persons to comply with the conditions and restrictions contained in the order for stay shall result in the immediate removal of the stay and the commissioner shall take action to suspend, revoke, or not renew the license.\n(h) The conditions and restrictions are effective for two years after the date they are imposed.\n(i) Nothing in this subdivision shall be construed to limit in any way the commissioner's ability to impose other sanctions against a nursing home license under the standards set forth in state or federal law whether or not a stay of revocation, suspension, or nonrenewal is issued.\nEach nursing home must employ an administrator who must be licensed or permitted as a nursing home administrator by the Board of Executives for Long Term Services and Supports. The nursing home may share the services of a licensed administrator. The administrator must maintain an on-site presence in the facility to effectively manage the facility in compliance with applicable rules and regulations. The administrator must establish procedures and delegate authority for on-site operations in the administrator's absence, but is ultimately responsible for the management of the facility. Each nursing home must have posted at all times the name of the administrator and the name of the person in charge on the premises in the absence of the licensed administrator.\n[Repealed, 2001 c 69 s 2]\nA nursing home may not employ as a managerial official or as its licensed administrator any person who was a managerial official or the licensed administrator of another facility during any period of time in the previous two-year period:\n(1) during which time of employment that other nursing home incurred the following number of uncorrected violations which were in the jurisdiction and control of the managerial official or the administrator:\n(i) two or more uncorrected violations; or\n(ii) four or more uncorrected violations or two or more repeated violations of any nature for which the fines are in the four highest daily fine categories prescribed in rule; or\n(2) who was convicted of a felony or gross misdemeanor that relates to operation of the nursing home or directly affects resident safety or care, during that period.\nThe minimum staffing standard for nursing personnel in certified nursing homes is as specified in this subdivision.\n(a) The minimum number of hours of nursing personnel to be provided in a nursing home is the greater of two hours per resident per 24 hours or 0.95 hours per standardized resident day. Upon transition to the 34 group, RUG-III resident classification system, the 0.95 hours per standardized resident day shall no longer apply.\n(b) For purposes of this subdivision, \"hours of nursing personnel\" means the paid, on-duty, productive nursing hours of all nurses and nursing assistants, calculated on the basis of any given 24-hour period. \"Productive nursing hours\" means all on-duty hours during which nurses and nursing assistants are engaged in nursing duties. Examples of nursing duties may be found in Minnesota Rules, part 4655.6400. Not included are vacations, holidays, sick leave, in-service classroom training, or lunches. Also not included are the nonproductive nursing hours of the in-service training director. In homes with more than 60 licensed beds, the hours of the director of nursing are excluded. \"Standardized resident day\" means the sum of the number of residents in each case mix class multiplied by the case mix weight for that resident class, as found in Minnesota Rules, part 9549.0059, subpart 2, calculated on the basis of a facility's census for any given day. For the purpose of determining a facility's census, the commissioner of health shall exclude the resident days claimed by the facility for resident therapeutic leave or bed hold days.\n(c) Calculation of nursing hours per standardized resident day is performed by dividing total hours of nursing personnel for a given period by the total of standardized resident days for that same period.\n(d) A nursing home that is issued a notice of noncompliance under section 144A.10, subdivision 5, for a violation of this subdivision, shall be assessed a civil fine of $300 for each day of noncompliance, subject to section 144A.10, subdivisions 7 and 8.\n[Repealed, 2001 c 69 s 2]\nA nursing home must accept as a resident a person who is infected with the human immunodeficiency virus or the hepatitis B virus unless the facility cannot provide appropriate care for the person under Minnesota Rules, part 4655.1500, subpart 2, or the person is otherwise not eligible for admission under state laws and rules.\nEffective October 1, 1989, a nursing home must have on duty at all times at least one staff member who is trained in single rescuer adult cardiopulmonary resuscitation and who has completed the initial training or a refresher course within the previous two years.\nUpon federal approval, a nursing home is not required to perform a resident assessment on a resident expected to remain in the facility for 30 days or less. A short-stay resident transferring from a hospital to a nursing home must have a plan of care developed at the hospital before admission to the nursing home. If a short-stay resident remains in the nursing home longer than 30 days, the nursing home must perform the resident assessment in accordance with sections 144.0721 and 144.0722 within 40 days of the resident's admission.\nNotwithstanding Minnesota Rules, part 4658.0520, an incontinent resident must be treated according to the comprehensive assessment and care plan.\nNotwithstanding Minnesota Rules, part 4658.0525, subpart 4, the position of residents unable to change their own position must be changed based on the comprehensive assessment and care plan.",
	"repealed": false
}