{
	"id": "171.187",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.187",
	"title": "171.187 SUSPENSION; CRIMINAL VEHICULAR OPERATION AND MANSLAUGHTER.",
	"text": "The commissioner shall suspend the driver's license of a person:\n(1) for whom a peace officer has made the certification described in section 629.344 that probable cause exists to believe that the person violated section 609.2112, subdivision 1, paragraph (a), clause (2), (3), (4), (5), or (6); 609.2113, subdivision 1, clause (2), (3), (4), (5), or (6); subdivision 2, clause (2), (3), (4), (5), or (6); or subdivision 3, clause (2), (3), (4), (5), or (6); or 609.2114, subdivision 1, paragraph (a), clause (2), (3), (4), (5), or (6), or subdivision 2, clause (2), (3), (4), (5), or (6); or\n(2) who has been formally charged with a violation of section 609.20, 609.205, 609.2112, 609.2113, or 609.2114, resulting from the operation of a motor vehicle.\nA suspension under this section continues until:\n(1) the conviction, acquittal, or dismissal of the underlying crime that resulted in the suspension; or\n(2) the commissioner, acting under subdivision 4, orders the termination of the suspension.\nIf a person whose driver's license was suspended under subdivision 1 is later convicted of the underlying offense that resulted in the suspension and the commissioner revokes the person's license, the commissioner shall credit the time accrued under the suspension period toward the revocation period imposed under section 171.17, subdivision 4, or for violations of section 609.20, 609.205, or 609.2112, subdivision 1, paragraph (a), clause (1), (7), or (8); 609.2113, subdivision 1, clause (1), (7), or (8); subdivision 2, clause (1), (7), or (8); or subdivision 3, clause (1), (7), or (8); or 609.2114, subdivision 1, paragraph (a), clause (1), (7), or (8), or subdivision 2, clause (1), (7), or (8).\n(a) At any time during which a person's driver's license is suspended under this section, the person may request in writing a review of the suspension by the commissioner. Upon receiving a request, the commissioner or the commissioner's designee shall review the order of suspension, the evidence upon which the order was based, and any other material information brought to the attention of the commissioner, and determine whether sufficient cause exists to sustain the order. Within 15 days of receiving the request, the commissioner shall report in writing the results of the review. The review provided in this subdivision is not subject to the contested case provisions in chapter 14.\n(b) In addition to any other reason provided for in this subdivision, a person may request a review of the suspension by the commissioner if the suspension has been in place for at least three months and the person has not been indicted or formally charged with the underlying crime that resulted in the license suspension.",
	"repealed": false
}