{
	"id": "278.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/278.05",
	"title": "278.05 TRIAL OF ISSUES.",
	"text": "The petition, without any answer, return, or other pleading thereto, shall be tried at the next term of court. The Tax Court or district court shall without delay summarily hear and determine the claims, objections or defenses made by the petition and shall direct judgment to sustain, reduce or increase the amount of taxes due, and the trial shall disregard technicalities and matters of form not affecting the merits.\nIf the property on which the taxes have been levied is located in a home rule charter or statutory city or town which employs its own certified assessor, the attorney for that governmental unit may, within 20 days after receipt by the governmental unit of the copy of the petition forwarded by the county auditor, give notice to the county attorney and to the petitioner or the petitioner's attorney that the home rule charter or statutory city or town is taking charge of and prosecuting the proceeding. If the attorney for the home rule charter or statutory city or town does not give notice, the attorney of the county in which these taxes are levied shall take charge of and prosecute the proceedings, but the county board may employ any other attorney to assist the county attorney. If the school board has responded within 30 days of receipt to a notice provided pursuant to section 278.01, indicating that it desires to be notified of further proceedings in the case, a representative of the school district in which the property is located shall be notified of all proceedings and all offers to reduce valuations and shall be given an opportunity to appear and testify on any trial of the issues raised.\nAssessor's records, including certificates of real estate value, assessor's field cards and property appraisal cards shall be made available to the petitioner for inspection and copying and may be offered at the trial subject to the applicable rules of evidence and rules governing pretrial discovery and shall not be excluded from discovery or admissible evidence on the grounds that the documents and the information recorded thereon are confidential or classified as private data on individuals. Evidence of comparable sales of other property shall, within the discretion of the court, be admitted at the trial.\nThe sales ratio studies published by the Department of Revenue, or any part of the studies, or any copy of the studies or records accumulated to prepare the studies which is prepared by the commissioner of revenue for use in determining education aids shall be admissible in evidence as a public record without the laying of a foundation if the sales prices used in the study are adjusted for the terms of the sale to reflect market value and are adjusted to reflect the difference in the date of sale compared to the assessment date. The Department of Revenue sales ratio study shall be prima facie evidence of the level of assessment. Additional evidence relevant to the sales ratio study is also admissible. No sales ratio study received into evidence shall be conclusive or binding on the court and evidence of its reliability or unreliability may be introduced by any party including, but not limited to, evidence of inadequate adjustment of sale prices for terms of financing, inadequate adjustment of sales prices to reflect the difference in the date of sale compared to the assessment date, and inadequate sample size.\nNo reduction in value on the grounds of discrimination shall be granted on the basis of a sales ratio study unless\n(a) the sales prices are adjusted for the terms of the sale to reflect market value,\n(b) the sales prices are adjusted to reflect the difference in the date of sale compared to the assessment date,\n(c) there is an adequate sample size, and\n(d) the median ratio of the same classification of property in the same county, city, or town as the subject property is lower than 90 percent, except that in the case of a county containing a city of the first class, the median ratio for the county shall be the ratio determined excluding sales from the first class city within the county.\nIf a reduction in value on the grounds of discrimination is granted based on the above criteria, the reduction shall equal the difference between 95 percent and the median ratio determined by the court.\nAny time after the filing of the petition and before the trial of the issues raised thereby, when the defense or claim presented is that the property has been partially, unfairly, or unequally assessed, or that the property has been assessed at a valuation greater than its real or actual value, or that a parcel which is classified as homestead under the provisions of section 273.13, subdivision 22 or 23, has been assessed at a valuation which exceeds by ten percent or more the valuation which the parcel would have if it were valued at the average assessment/sales ratio for real property in the same class in that portion of the county in which the parcel is located, for which the commissioner is able to establish and publish a sales ratio study, the attorney representing the state, county, city or town in the proceedings may serve on the petitioner, or the petitioner's attorney, and file with the court administrator of the district court, an offer to reduce the valuation of the property or a portion of the property to a valuation set forth in the offer. If, within ten days thereafter, the petitioner, or the attorney, gives notice in writing to the county attorney, or the attorney for the city or town, that the offer is accepted, the official notified may file the offer with proof of notice, and the court administrator shall enter judgment accordingly. Otherwise, the offer shall be deemed withdrawn and evidence thereof shall not be given; and, unless a lower valuation than specified in the offer is found by the court, no costs or disbursements shall be allowed to the petitioner, but the costs and disbursements of the state, county, city or town, including interest at six percent on the tax based on the amount of the offer from and after the 16th day of October, or, in the case of class 1b agricultural homestead, class 2a agricultural homestead, class 2b(2) agricultural nonhomestead property, and manufactured homes treated as personal property, the 16th day of November, of the year the taxes are payable, shall be taxed in its favor and included in the judgment and when collected shall be credited to the county revenue fund, unless the taxes were paid in full before the 16th day of October, or, in the case of class 1b agricultural homestead, class 2a agricultural homestead, and class 2b(2) agricultural nonhomestead property, and manufactured homes treated as personal property, the 16th day of November, of the year in which the taxes were payable, in which event interest shall not be taxable.\n(a) In cases where the petitioner contests the valuation of income-producing property, the following information must be provided to the county assessor no later than August 1 of the taxes payable year:\n(1) a year-end financial statement for the year prior to the assessment date;\n(2) a year-end financial statement for the year of the assessment date;\n(3) a rent roll on or near the assessment date listing the tenant name, lease start and end dates, base rent, square footage leased and vacant space;\n(4) identification of all lease agreements not disclosed on a rent roll in the response to clause (3), listing the tenant name, lease start and end dates, base rent, and square footage leased;\n(5) net rentable square footage of the building or buildings; and\n(6) anticipated income and expenses in the form of a proposed budget for the year subsequent to the year of the assessment date.\n(b) The information required to be provided to the county assessor under paragraph (a) does not include leases. Failure to provide the information required in paragraph (a) shall result in the dismissal of the petition, unless (1) the failure to provide it was due to the unavailability of the information at the time that the information was due, or (2) the petitioner was not aware of or informed of the requirement to provide the information.\nIf the petitioner proves that the requirements under clause (2) are met, the petitioner has an additional 30 days to provide the information from the time the petitioner became aware of or was informed of the requirement to provide the information, otherwise the petition shall be dismissed.\n(c) If, after the August 1 deadline set in paragraph (a), a county assessor determines that the actual leases in effect on the assessment date are necessary to properly evaluate the income-producing property, then a county assessor may require that the petitioner submit the leases. The petitioner must provide the requested information to the county assessor within 60 days of a county assessor's request. The Tax Court shall hear and decide any issues relating to subsequent information requests by a county assessor. Failure to provide the information required in this paragraph shall be addressed under Rules of Civil Procedure, rule 37.\n(d) Provided that the information as contained in paragraph (a) is timely submitted to the county assessor, the county assessor shall furnish the petitioner at least five days before the hearing under this chapter with the property's appraisal, if any, which will be presented to the court at the hearing. The petitioner shall furnish to the county assessor at least five days before the hearing under this chapter with the property's appraisal, if any, which will be presented to the court at the hearing. An appraisal of the petitioner's property done by or for the county shall not be admissible as evidence if the county assessor does not comply with the provisions in this paragraph. The petition shall be dismissed if the petitioner does not comply with the provisions in this paragraph.",
	"repealed": false
}