{
	"id": "299M.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/299M.03",
	"title": "299M.03 LICENSE OR CERTIFICATE REQUIRED.",
	"text": "Except for residential installations by the owner of an occupied one- or two-family dwelling, a person may not sell, design, install, modify, or inspect a fire protection system, its parts, or related equipment, or offer to do so, unless annually licensed to perform these duties as a fire protection contractor. No license is required under this section for a person licensed as a professional engineer under section 326.03 who is competent in fire protection system design or a person licensed as an alarm and communication contractor under section 326B.34 for performing activities authorized by that license.\nExcept for residential installations by the owner-occupant of a one- or two-family dwelling, a person may not sell, design, install, modify, or inspect a multipurpose potable water piping system, its parts, or related equipment, or offer to do so, unless annually licensed to perform these duties as a multipurpose potable water piping system contractor. No license is required under this section for a person licensed as a professional engineer under section 326.03 who is competent in fire protection system design.\nExcept for residential installations by the owner of an occupied one- or two-family dwelling, a person may not install, connect, alter, repair, or add to a fire protection system, under the supervision of a fire protection contractor, unless annually certified to perform those duties as a journeyman sprinkler fitter or as a registered apprentice sprinkler fitter. This subdivision does not apply to a person maintaining or repairing a fire protection system if the system is located in a facility regulated under the federal Mine Safety and Health Act of 1977, United States Code, title 30, section 801 et seq.\nExcept for residential installations by the owner-occupant of a one- or two-family dwelling, a person may not install, connect, alter, repair, or add to a multipurpose potable water piping system, unless annually certified to perform these duties as a multipurpose potable water piping system installer. A multipurpose potable water piping system installer certificate only allows the certificate holder to work on one- and two-family residential units.\nThe state fire marshal shall charge $55 to conduct and administer the journeyman sprinkler fitter certification process. Money received by the State Fire Marshal Division for the administration of this program must be deposited in the state treasury and credited to a state fire marshal dedicated account in the special revenue fund. All money in the state fire marshal account is annually appropriated to the commissioner of public safety to administer this program.",
	"repealed": false
}