{
	"id": "465.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.74",
	"title": "465.74 AUTHORIZATION TO OPERATE DISTRICT HEATING SYSTEMS.",
	"text": "Any city operating or authorized to operate a public utility pursuant to chapter 452 or its charter is authorized to acquire, construct, own, and operate a municipal district heating system pursuant to the provisions of that chapter or its charter. Acquisition or construction of a municipal district heating system shall not be subject to the election requirement of sections 452.11 and 452.12, or city charter provision, but must be approved by a three-fifths vote of the city's council or other governing body. Loans obtained by a municipality pursuant to Minnesota Statutes 1992, section 216C.36, are not subject to the limitations on the amount of money which may be borrowed upon a pledge of the city's full faith and credit or the election requirements for general obligation borrowing, contained in section 452.08.\nA city with over 50,000 inhabitants that is not a city of the first class is authorized to acquire, construct, improve, and operate a district heating system under the same terms and conditions as a city of the first class except as provided herein. Acquisition or construction and financing of a municipal district heating system is not subject to the election requirements of sections 452.11 and 452.12, however, a resolution for the acquisition or construction and financing must be approved by a two-thirds vote of the governing body of the city.\nA home rule or statutory city of the second, third, or fourth class may, pursuant to sections 412.331 to 412.391, or chapter 455 or its charter acquire, construct, own, and operate a municipal district heating system.\nA municipal district heating system, operating pursuant to this section, may sell energy to customers located outside of the municipality.\nThe loan obligations or debt incurred by a political subdivision pursuant to section 475.525, or Minnesota Statutes 1992, section 216C.36, shall not be considered as a part of its indebtedness under the provisions of its governing charter or of any law of this state fixing a limit of indebtedness.\nNotwithstanding any other law, general or special, or the provisions of any home rule charter city to the contrary, the governing body of a municipality may by ordinance grant a district heating franchise for a term not to exceed 31 years and by resolution or ordinance secure any obligations issued by the municipality for a district heating system with a mortgage or indenture of trust coextensive with the term of the obligations.\nFor the purposes of this section, and chapters 474 and 475, \"district heating system\" means any existing or proposed facility for (1) the production, through cogeneration or otherwise, of hot water or steam to be used for district heating, or (2) the transmission and distribution of hot water or steam for district heating either directly to heating consumers or to another facility or facilities for transmission and distribution, or (3) any part or combination of the foregoing facilities.\nIn keeping with the public purpose to encourage state and local leadership and aid in providing available and economical district heating service, the definition of \"district heating system\" under this section should be broadly construed to allow municipal government sufficient flexibility and authority to evaluate and undertake such policies and projects as will most efficiently and economically encourage local expansion of district heating service.\nA port authority organized pursuant to sections 469.048 to 469.068 or a special law may acquire, own, construct, and operate a district heating system or systems to provide heating and cooling services and other energy services within the statutory or home rule charter city within which it is created. The authority may, in conjunction with a district heating system, acquire, own, construct, and operate an energy management and control system to monitor and control users' energy demand within the city as a related ancillary function of the district heating system. The authority may, in conjunction with a district heating system, acquire, own, construct, and operate ancillary services related to an energy management and control system including, but not limited to, sensing and monitoring services for supervision of fire and life safety systems and building security systems within the city.\nThis section shall be effective for a port authority only after adoption of an ordinance or resolution by the board of the port authority and by the governing body of the city stating their intention to exercise the authority allowed by this section.\nA port authority may, with approval of the city, lease part or all of the district heating system or contract with respect to part or all of the district heating system, with any person, corporation, association, or public utility company for the purpose of constructing, improving, operating, or maintaining the district heating system.\nA statutory or home rule charter city within which a port authority has been created may delegate to the port authority some or all powers and responsibilities for the management and operation of a district heating system.\nA statutory or home rule charter city may contract with a county to operate a district heating system for the provision of district heating services within some or all of the city.\nNotwithstanding any contrary provisions in section 237.163, and rules adopted under that section, public right-of-way users under Minnesota Rules, chapter 7819, including, but not limited to, district heating and district cooling nonprofit corporations organized under chapter 317A that are exempt organizations under section 501(c)(3) of the United States Internal Revenue Code, are eligible to receive grants and federal money for costs of relocating facilities from public rights-of-way to prevent interference with public light rail projects, unless eligibility would impact the project's Federal Transit Authority required cost-effectiveness index.",
	"repealed": false
}