{
	"id": "256B.0919",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0919",
	"title": "256B.0919 ADULT FOSTER CARE AND FAMILY ADULT DAY CARE.",
	"text": "Notwithstanding contrary provisions of the Human Services Licensing Act and rules adopted under it, an adult foster care license holder may care for five adults age 60 years or older who do not have serious and persistent mental illness or a developmental disability.\nAn adult foster care license holder who is not providing care to persons with serious and persistent mental illness or developmental disabilities may also provide family adult day care for adults age 60 years or older who do not have serious and persistent mental illness or a developmental disability. The maximum combined license capacity for adult foster care and family adult day care is five adults. A separate license is not required to provide family adult day care under this subdivision. Foster care homes providing services to five adults shall not be subject to licensure by the commissioner of health under the provisions of chapter 144, 144A, 157, or any other law requiring facility licensure by the commissioner of health.\nA person exempt from licensure under section 245A.03, subdivision 2, who provides adult foster care to a related individual age 65 and older, and who meets the requirements in Minnesota Rules, parts 9555.5105 to 9555.6265, may be certified by the county to provide adult foster care. A person certified by the county to provide adult foster care may be reimbursed for services provided and eligible for funding under chapter 256S, if the relative would suffer a financial hardship as a result of providing care. For purposes of this subdivision, financial hardship refers to a situation in which a relative incurs a substantial reduction in income as a result of resigning from a full-time job or taking a leave of absence without pay from a full-time job to care for the client.\n[Repealed, 2010 c 329 art 1 s 24; 2010 c 352 art 2 s 16]",
	"repealed": false
}