{
	"id": "62C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.15",
	"title": "62C.15 SUBSCRIPTION CHARGES.",
	"text": "A service plan corporation shall establish and adjust from time to time subscription charges to be paid by or on behalf of its subscribers. The charges shall be reasonable, and not unfairly discriminatory, in relation to the benefits, considering actuarial projection of the cost of providing or paying for the health services, considering costs of administration, and in relation to reserves and surplus required by law.\nNo service plan corporation shall deliver, issue for delivery, extend, continue, or renew any form of nongroup subscriber contract until schedules of charges applicable thereto, including any endorsement, rider, amendment or application which is a part thereof, have been filed with the commissioner; nor shall the corporation deliver, issue for delivery, extend, continue or renew any form of group subscriber contract until a schedule of the rating structures and formulae applicable thereto, including any endorsement, rider, amendment or application which is a part thereof, has been filed with the commissioner. The filing for a nongroup subscriber contract shall include the actuarial data needed to justify any increase in subscriber charges. The commissioner may disapprove the schedule of charges for any group or nongroup subscriber contract if:\n(a) the unencumbered reserve or surplus is less than the required minimum or more than the required maximum; or\n(b) the schedule charges meet the criteria specified in section 62A.02, subdivision 3.\nIf subscription charges become subject to disapproval, the commissioner shall within 30 days of filing render an order either disapproving the charges or extending time for review to a specified date, or the charges shall be deemed approved. An order disapproving a charge shall state the reasons therefor and shall be subject to the notice, hearing, and appeal provisions of section 62C.14. The burden of proving and actuarially demonstrating that the charges are not inadequate or excessive shall be on the corporation.\nIt shall be unlawful for a service plan corporation to deliver or issue a subscriber's contract with charges which have been disapproved by the commissioner.",
	"repealed": false
}