{
	"id": "347.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.51",
	"title": "347.51 DANGEROUS DOGS; REGISTRATION.",
	"text": "No person may own a dangerous dog in this state unless the dog is registered as provided in this section.\nAn animal control authority shall issue a certificate of registration to the owner of a dangerous dog if the owner presents sufficient evidence that:\n(1) a proper enclosure exists for the dangerous dog and a posting on the premises with a clearly visible warning sign that there is a dangerous dog on the property, including a warning symbol to inform children;\n(2) a surety bond issued by a surety company authorized to conduct business in this state in a form acceptable to the animal control authority in the sum of at least $300,000, payable to any person injured by the dangerous dog, or a policy of liability insurance issued by an insurance company authorized to conduct business in this state in the amount of at least $300,000, insuring the owner for any personal injuries inflicted by the dangerous dog;\n(3) the owner has paid an annual fee of not more than $500, in addition to any regular dog licensing fees, to obtain a certificate of registration for a dangerous dog under this section; and\n(4) the owner has had microchip identification implanted in the dangerous dog as required under section 347.515.\nIf an animal control authority issues a certificate of registration to the owner of a dangerous dog pursuant to subdivision 2, the animal control authority must provide, for posting on the owner's property, a copy of a warning symbol to inform children that there is a dangerous dog on the property. The warning symbol must be the uniform symbol provided by the commissioner of public safety. The commissioner shall provide the number of copies of the warning symbol requested by the animal control authority and shall charge the animal control authority the actual cost of the warning symbols received. The animal control authority may charge the registrant a reasonable fee to cover its administrative costs and the cost of the warning symbol.\nThe animal control authority may charge the owner an annual fee, in addition to any regular dog licensing fees, to obtain a certificate of registration for a dangerous dog under this section.\nBeginning six months after a dog is declared a dangerous dog, an owner may request annually that the animal control authority review the designation. The owner must provide evidence that the dog's behavior has changed due to the dog's age, neutering, environment, completion of obedience training that includes modification of aggressive behavior, or other factors. If the animal control authority finds sufficient evidence that the dog's behavior has changed, the authority may rescind the dangerous dog designation.\nThe provisions of this section do not apply to dangerous dogs used by law enforcement officials for police work.\nDogs may not be declared dangerous if the threat, injury, or damage was sustained by a person:\n(1) who was committing, at the time, a willful trespass or other tort upon the premises occupied by the owner of the dog;\n(2) who was provoking, tormenting, abusing, or assaulting the dog or who can be shown to have repeatedly, in the past, provoked, tormented, abused, or assaulted the dog; or\n(3) who was committing or attempting to commit a crime.\n[Repealed, 1Sp2001 c 8 art 8 s 30]\nA dangerous dog registered under this section must have a standardized, easily identifiable tag identifying the dog as dangerous and containing the uniform dangerous dog symbol, affixed to the dog's collar at all times.\nA statutory or home rule charter city, or a county, may not adopt an ordinance regulating dangerous or potentially dangerous dogs based solely on the specific breed of the dog. Ordinances inconsistent with this subdivision are void.\nAn animal control authority may contract with another political subdivision or other person to provide the services required under sections 347.50 to 347.565. Notwithstanding any contract entered into under this subdivision, all fees collected under sections 347.50 to 347.54 shall be paid to the animal control authority and all certificates of registration must be issued in the name of the animal control authority.",
	"repealed": false
}