{
	"id": "97B.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.081",
	"title": "97B.081 USING ARTIFICIAL LIGHTS TO LOCATE ANIMALS.",
	"text": "Except as provided in subdivision 3, a person may not cast the rays of a spotlight, headlight, or other artificial light on a highway, or in a field, woodland, or forest, to spot, locate, or take a wild animal while having in possession, either individually or as one of a group of persons, a firearm, bow, or other implement that could be used to take big game, small game, or unprotected wild animals.\n(a) Except as provided in subdivision 3, from two hours after sunset until sunrise, a person may not cast the rays of a spotlight, headlight, or other artificial light on a highway, or in a field, woodland, or forest to spot or locate a wild animal.\n(b) Except as provided in subdivision 3, a person may not cast the rays of a spotlight, headlight, or other artificial light on fenced, agricultural land.\n(c) Except as provided in subdivision 3, a person may not cast an artificial light onto residential property or building sites from a motor vehicle.\n(d) Except as provided in subdivision 3, a person may not at any time cast the rays of a spotlight, headlight, or other artificial light onto property posted with signs prohibiting the shining of lights onto the property. When signs are posted, the signs shall display letters that are at least two inches in height and state \"no shining\" or similar terms and shall be placed at intervals of 500 feet or less along the boundary of the property.\n(a) It is not a violation of this section for a person to:\n(1) cast the rays of a spotlight, headlight, or other artificial light to take raccoons according to section 97B.621, subdivision 3, or tend traps according to section 97B.931;\n(2) hunt fox or coyote from January 1 to March 15 while using a handheld artificial light, provided that the person is:\n(i) on foot;\n(ii) using a shotgun;\n(iii) not within a public road right-of-way;\n(iv) using a handheld or electronic calling device; and\n(v) not within 200 feet of a motor vehicle; or\n(3) cast the rays of a handheld artificial light to retrieve wounded or dead big game animals, provided that the person is:\n(i) on foot; and\n(ii) not in possession of a firearm or bow.\n(b) It is not a violation of subdivision 2 for a person to cast the rays of a spotlight, headlight, or other artificial light to:\n(1) carry out any agricultural, safety, emergency response, normal vehicle operation, or occupation-related activities that do not involve taking wild animals; or\n(2) carry out outdoor recreation as defined in section 97B.001 that is not related to spotting, locating, or taking a wild animal.\n(c) Except as otherwise provided by the game and fish laws, it is not a violation of this section for a person to use an electronic range finder device from one-half hour before sunrise until one-half hour after sunset while lawfully hunting wild animals.\n(d) It is not a violation of this section for a licensed bear hunter to cast the rays of a handheld artificial light to track or retrieve a wounded or dead bear while possessing a firearm:\n(1) if the person:\n(i) has the person's valid bear-hunting license in possession;\n(ii) is on foot; and\n(iii) is following the blood trail of a bear that was shot during legal shooting hours; or\n(2) as provided in section 97B.207.\n(e) It is not a violation of this section for a licensed deer hunter to cast the rays of a handheld artificial light to track or retrieve a wounded deer as provided in section 97B.207.\n(f) For purposes of this subdivision, \"handheld artificial light\" means an artificial light that is carried in the hand or attached to the person.",
	"repealed": false
}