{
	"id": "122A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.33",
	"title": "122A.33 LICENSE AND DEGREE EXEMPTION FOR HEAD COACH.",
	"text": "Notwithstanding section 122A.15, subdivision 1, a school district may employ as a head varsity coach of an interscholastic sport at its secondary school a person who does not have a license as head varsity coach of interscholastic sports and who does not have a bachelor's degree if:\n(1) in the judgment of the school board, the person has the knowledge and experience necessary to coach the sport;\n(2) can verify completion of six quarter credits, or the equivalent, or 60 clock hours of instruction in first aid and the care and prevention of athletic injuries; and\n(3) can verify completion of a coaching methods or theory course.\n(a) Notwithstanding section 122A.58, a person employed as a head varsity coach has an annual contract as a coach that the school board may or may not renew as the board sees fit.\n(b) A school board must provide written notice to a coach whose contract the school board declines to renew for the following school year no more than 60 days after the end of the regular season for the activity, as established by the high school league under chapter 128C. The notice requirement of this paragraph does not apply if the school board declines to renew the contract based on the coach's misconduct or failure to perform duties, or the district's financial limitations.\nA school board that declines to renew the coaching contract of a licensed or nonlicensed head varsity coach must notify the coach within 14 days of that decision. If the coach requests reasons for not renewing the coaching contract, the board must give the coach its reasons in writing within ten days of receiving the request. The existence of parent complaints must not be the sole reason for a board not to renew a coaching contract. Upon request, the board must provide the coach with a reasonable opportunity to respond to the reasons at a board meeting. The hearing may be opened or closed at the election of the coach unless the board closes the meeting under section 13D.05, subdivision 2, to discuss private data.",
	"repealed": false
}