{
	"id": "466.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/466.03",
	"title": "466.03 EXCEPTIONS.",
	"text": "Section 466.02 does not apply to any claim enumerated in this section. As to any such claim every municipality shall be liable only in accordance with the applicable statute and where there is no such statute, every municipality shall be immune from liability.\nMS 1986 [Repealed, 1987 c 346 s 18]\nAny claim in connection with the assessment and collection of taxes.\n(a) Any claim based on snow or ice conditions on any highway or public sidewalk that does not abut a publicly owned building or publicly owned parking lot, except when the condition is affirmatively caused by the negligent acts of the municipality.\n(b) Notwithstanding paragraph (a), a municipality that owns or leases a building or parking lot in another municipality is not immune from a claim based on snow or ice conditions on a public sidewalk abutting the building or parking lot, but the other municipality is immune, except when the condition is affirmatively caused by its own negligent acts.\nAny claim based upon an act or omission of an officer or employee, exercising due care, in the execution of a valid or invalid statute, charter, ordinance, resolution, or rule.\nAny claim based upon the performance or the failure to exercise or perform a discretionary function or duty, whether or not the discretion is abused.\nAny claim for which recovery is prohibited by section 169A.48, subdivision 2.\nAny claim based upon the condition of unimproved real property owned by the municipality.\nAny claim based upon the construction, operation, or maintenance by a municipality of a water access site created by the commissioner of Iron Range resources and rehabilitation. A water access site under this subdivision that provides access to an idled, water filled mine pit also includes the entire water filled area of the pit, and, further, claims related to a mine pit water access site under this subdivision include those based upon the caving or slumping of mine pit walls.\nA claim against a municipality based on the failure of a provider to meet the standards needed for a license to operate a day care facility under chapter 142B for children, unless the municipality had actual knowledge of a failure to meet licensing standards that resulted in a dangerous condition that foreseeably threatened the plaintiff. A municipality shall be immune from liability for a claim arising out of a provider's use of a swimming pool located at a family day care or group family day care home under section 142B.41, subdivision 8, unless the municipality had actual knowledge of a provider's failure to meet the licensing standards under section 142B.41, subdivision 8, paragraph (a), clauses (1) to (3), that resulted in a dangerous condition that foreseeably threatened the plaintiff.\nAny claim based upon the construction, operation, or maintenance of any property owned or leased by the municipality that is intended or permitted to be used as a park, as an open area for recreational purposes, or for the provision of recreational services, or from any claim based on the clearing of land, removal of refuse, and creation of trails or paths without artificial surfaces, if the claim arises from a loss incurred by a user of park and recreation property or services. Nothing in this subdivision limits the liability of a municipality for conduct that would entitle a trespasser to damages against a private person, except as provided in subdivision 23.\n(a) Subject to paragraphs (b) and (c), any claim based upon an injury arising out of the use by any person of a diving board, diving platform, diving raft, water slide, nonwater slide, or dock installed at a beach or swimming pool owned, leased, or operated by a municipality other than a school district, if the injury occurred when the beach or swimming pool was closed as indicated by a sign posted at the beach or pool.\n(b) A municipality has a duty to use reasonable care to warn trespassers of any danger or risk involved with the use of beach or pool equipment described in paragraph (a) if the municipality:\n(1) knows or has reason to know that trespassers regularly use certain portions of the beach or pool equipment;\n(2) installs, operates, or maintains the equipment in a way known as likely to cause death or serious bodily harm; and\n(3) has reason to believe trespassers would not discover the risks involved in the use of the equipment.\nThe requirements of this paragraph do not apply if a trespasser knows or has reason to know of the condition of the equipment and the risk involved in its use.\n(c) Nothing in this subdivision limits the liability of a municipality for conduct that would entitle trespassing children to damages against a private person.\nAny claim against a municipality as to which the municipality is immune from liability by the provisions of any other statute.\nAny claim for a loss other than injury to or loss of property or personal injury or death.\nAny claim for a loss of benefits or compensation due under a program of public assistance or public welfare, except where municipal compensation for loss is expressly required by federal law in order for the municipality to receive federal grants-in-aid.\nAny claim for a loss based on the failure of any person to meet the standards needed for a license, permit, or other authorization issued by the municipality or its agents.\nAny claim for a loss based on the usual care and treatment, or lack of care and treatment, of any person at a municipal hospital or corrections facility where reasonable use of available funds has been made to provide care.\nAny claim for a loss, damage, or destruction of property of a patient or inmate of a municipal institution.\nAny claim for a loss caused by the condition of unimproved real property owned by a municipality, which means land that the municipality has not improved, land that is owned or administered by the municipality that contains idled or abandoned mine pits or shafts, and appurtenances, fixtures, and attachments to land that the municipality has neither affixed nor improved.\nAny claim for a loss for which recovery is prohibited by section 169A.48, subdivision 2.\nAny claim against a municipality, if the same claim would be excluded under section 3.736, if brought against the state.\nAny claim against a county, arising from the operation of an all-terrain vehicle, as defined in section 84.92, subdivision 8, an off-road vehicle, as defined in section 84.797, subdivision 7, or an off-highway motorcycle on land administered by a county under chapter 280, 281, or 282, except that the county is liable for conduct that would entitle a trespasser to damages against a private person.\nAny claim arising out of a person's use of a logging road on public land that is maintained exclusively to provide access to timber on the land by harvesters of the timber, and is not signed or otherwise held out to the public as a public highway.\nAny claim based on injury arising out of a decision by a school or school district to obtain a fire code variance for purposes of school building security, if the decision was made in good faith and in accordance with applicable law governing variances.\nAny claim based upon the acts or omissions of a 911 telecommunicator or dispatcher, who is certified in emergency medical dispatch by a program incorporating nationally recognized standards, acting in good faith in providing prearrival medical instruction based upon the emergency medical dispatch protocols adopted by the dispatching agency.\nAny claim based on the condition, use, or maintenance of land acquired and held by the municipality under section 473.167. Nothing in this subdivision limits the liability of a municipality for conduct that would entitle a trespasser to damages against a private person.\n(a) Any claim against a municipality, based on alleged or actual inaccuracies in geographic information systems data, arising from the public's use of GIS data, if the municipality provides a disclaimer of the accuracy of the information at any point of initial contact with a geographic information system to which the public has general access.\n(b) Geographic information systems data is government data subject to the presumption of section 13.01, subdivision 3. GIS data is data generated by a computer database or system that is designed to electronically capture, organize, store, update, manipulate, analyze, and display all forms of geographically referenced information that is compiled, from private or public sources, either alone or in cooperation with other public or private entities, for use by a municipality. GIS data is accurate for its intended use by a municipality and may be inaccurate for other uses.\nAny claim for a loss involving or arising out of the use or operation of a recreational motor vehicle, as defined in section 84.90, subdivision 1, within the right-of-way of a road or highway as defined in section 160.02, subdivision 26, except that the municipality is liable for conduct that would entitle a trespasser to damages against a private person.\n(a) Any claim for a loss or injury arising from the use of school property or a school facility made available for public recreational activity.\n(b) Nothing in this subdivision:\n(1) limits the liability of a school district for conduct that would entitle a trespasser to damages against a private person; or\n(2) reduces any existing duty owed by the school district.\n(a) Any tort claim against a municipality resulting from the use of public safety equipment donated by the municipality to another municipality, unless the claim is a direct result of fraud or intentional misrepresentation.\n(b) As used in this subdivision, \"public safety equipment\" means vehicles and equipment used in firefighter, ambulance and emergency medical treatment services, rescue, and hazardous material response.\nAny tort claim against a municipality resulting from the use of surplus equipment donated by the municipality to a nonprofit organization under section 471.3459, unless the claim is a direct result of fraud or intentional misrepresentation.",
	"repealed": false
}