{
	"id": "353D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/353D.01",
	"title": "353D.01 PUBLIC EMPLOYEES DEFINED CONTRIBUTION PLAN.",
	"text": "The public employees defined contribution plan is administered by the Public Employees Retirement Association under supervision of the association board of trustees.\nUnless the context clearly indicates that a different meaning is intended, the terms defined in this subdivision, for the purposes of this chapter, have the meanings given:\n(1) \"association\" means the Public Employees Retirement Association; and\n(2) \"plan\" means the public employees defined contribution plan.\n(a) Eligibility to participate in the plan is available to:\n(1) any elected or appointed local government official of a governmental subdivision who elects to participate in the plan under section 353D.02, subdivision 1, and who, for the service rendered to a governmental subdivision, is not a member of the association within the meaning of section 353.01, subdivision 7;\n(2) physicians who, if they did not elect to participate in the plan under section 353D.02, subdivision 2, would meet the definition of member under section 353.01, subdivision 7;\n(3) basic and advanced life-support emergency medical service personnel who are employed by any public ambulance service that elects to participate under section 353D.02, subdivision 3;\n(4) members of a municipal rescue squad associated with the city of Litchfield in Meeker County, or of a county rescue squad associated with Kandiyohi County, if an independent nonprofit rescue squad corporation, incorporated under chapter 317A, performing emergency management services, and if not affiliated with a fire department or ambulance service and if its members are not eligible for membership in that fire department's or ambulance service's relief association or comparable pension plan;\n(5) employees of the Port Authority of the city of St. Paul who elect to participate in the plan under section 353D.02, subdivision 5, and who are not members of the association under section 353.01, subdivision 7;\n(6) city managers who elected to be excluded from the general employees retirement plan of the association under section 353.028 and who elected to participate in the public employees defined contribution plan under section 353.028, subdivision 3, paragraph (b);\n(7) volunteer or emergency on-call firefighters serving in a municipal fire department or an independent nonprofit firefighting corporation who are not covered by the police and fire retirement plan and who are not covered by a firefighters relief association and who elect to participate in the public employees defined contribution plan;\n(8) any elected county sheriff who is a former member of the police and fire plan, is receiving a retirement annuity as provided under section 353.651, who does not have previous employment with the county for which the sheriff was elected; and\n(9) persons appointed to serve on a board or commission of a governmental subdivision or an instrumentality thereof.\n(b) Individuals otherwise eligible to participate in the plan under this subdivision who are currently covered by a public or private pension plan because of their employment or provision of services are not eligible to participate in the public employees defined contribution plan.\n(c) A former participant is a person who has terminated eligible employment or service and has not withdrawn the value of the person's individual account.",
	"repealed": false
}