{
	"id": "524.5-118",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-118",
	"title": "524.5-118 MALTREATMENT AND STATE LICENSING AGENCY CHECKS; CRIMINAL HISTORY CHECK.",
	"text": "(a) The court shall require maltreatment and state licensing agency checks and a criminal history check under this section:\n(1) before the appointment of a guardian or conservator, unless maltreatment and state licensing agency checks and a criminal history check have been done on the person under this section within the previous five years; and\n(2) once every five years after the appointment, if the person continues to serve as a guardian or conservator.\n(b) The maltreatment and state licensing agency checks and the criminal history check must include:\n(1) criminal history data from the Bureau of Criminal Apprehension;\n(2) criminal history data from a national criminal history record check;\n(3) state licensing agency data if a search of the database or databases of the agencies listed in subdivision 2a shows that the proposed guardian or conservator has ever held a professional license directly related to the responsibilities of a professional fiduciary from an agency listed in subdivision 2a that was conditioned, suspended, revoked, or canceled; and\n(4) data on whether the person has been a perpetrator of substantiated maltreatment of a vulnerable adult or a minor.\n(c) If the guardian or conservator is not an individual, the maltreatment and state licensing agency checks and the criminal history check must be done on all individuals currently employed by the proposed guardian or conservator who will be responsible for exercising powers and duties under the guardianship or conservatorship.\n(d) Notwithstanding paragraph (a), if the court determines that it would be in the best interests of the person subject to guardianship or conservatorship to appoint a guardian or conservator before the maltreatment and state licensing agency checks and the criminal history check can be completed, the court may make the appointment pending the results of the checks, however, the maltreatment and state licensing agency checks and the criminal history check must then be completed as soon as reasonably possible after appointment.\n(e) The fees for the maltreatment and state licensing agency checks and the criminal history check conducted under this section are specified in sections 245C.10, subdivision 15, and 299C.10, subdivisions 4 and 5. The fees for conducting maltreatment and state licensing agency checks and the criminal history check for the appointment of a professional guardian or conservator must be paid by the guardian or conservator. In other cases, the fee must be paid as follows:\n(1) if the matter is proceeding in forma pauperis, the fee is an expense for purposes of section 524.5-502, paragraph (a);\n(2) if there is an estate of the person subject to guardianship or conservatorship, the fee must be paid from the estate; or\n(3) in the case of a guardianship or conservatorship of the person that is not proceeding in forma pauperis, the court may order that the fee be paid by the guardian or conservator or by the court.\n(f) The requirements of this subdivision do not apply if the guardian or conservator is:\n(1) a state agency or county;\n(2) a parent or guardian of a person proposed to be subject to guardianship or conservatorship who has a developmental disability, if the parent or guardian has raised the person proposed to be subject to guardianship or conservatorship in the family home until the time the petition is filed, unless counsel appointed for the person proposed to be subject to guardianship or conservatorship under section 524.5-205, paragraph (e); 524.5-304, paragraph (b); 524.5-405, paragraph (a); or 524.5-406, paragraph (b), recommends a background check; or\n(3) a bank with trust powers, bank and trust company, or trust company, organized under the laws of any state or of the United States and which is regulated by the commissioner of commerce or a federal regulator.\n(a) The guardian or conservator shall request the Bureau of Criminal Apprehension to complete a criminal history check. The request must be accompanied by the applicable fee and acknowledgment that the guardian or conservator received a privacy notice. The Bureau of Criminal Apprehension shall conduct a national criminal history record check. The guardian or conservator shall submit a set of classifiable fingerprints. The fingerprints must be recorded on a fingerprint card provided by the Bureau of Criminal Apprehension.\n(b) The Bureau of Criminal Apprehension shall provide the court with criminal history data as defined in section 13.87 and criminal history information from other states or jurisdictions as indicated from a national criminal history record check within 20 working days of receipt of a request.\n(c) In accordance with section 245C.033, the commissioner of human services shall provide the court with data regarding substantiated maltreatment of vulnerable adults under section 626.557 and substantiated maltreatment of minors under chapter 260E within 25 working days of receipt of a request. If the guardian or conservator has been the perpetrator of substantiated maltreatment of a vulnerable adult or minor, the response must include a copy of any available public portion of the investigation memorandum under section 626.557, subdivision 12b, or any available public portion of the investigation memorandum under section 260E.30.\n(d) Notwithstanding section 260E.30 or 626.557, subdivision 12b, if the commissioner of human services or a county lead agency or lead investigative agency has information that a person under this section has been determined to be a perpetrator of maltreatment of a vulnerable adult or minor, the commissioner or the county may provide this information to the court that is determining eligibility for the guardian or conservator.\n(a) In response to a request submitted under section 245C.033, the commissioner of human services shall provide licensing agency data for licenses directly related to the responsibilities of a professional fiduciary if the guardian or conservator has a current or prior affiliation from the following agencies in Minnesota:\n(1) Lawyers Responsibility Board;\n(2) State Board of Accountancy;\n(3) Board of Social Work;\n(4) Board of Psychology;\n(5) Board of Nursing;\n(6) Board of Medical Practice;\n(7) Department of Commerce;\n(8) Board of Chiropractic Examiners;\n(9) Board of Dentistry;\n(10) Board of Marriage and Family Therapy;\n(11) Department of Human Services;\n(12) Peace Officer Standards and Training (POST) Board; and\n(13) Professional Educator Licensing and Standards Board.\n(b) The commissioner shall provide information to the court in accordance with section 245C.033.\nIn accordance with section 245C.033, the commissioner must provide the guardian or conservator with a privacy notice for maltreatment and state licensing agency checks that complies with section 13.04, subdivision 2. The Bureau of Criminal Apprehension must provide the guardian or conservator with a privacy notice for a criminal history check.\nThe court shall notify the guardian or conservator that the guardian or conservator has the following rights:\n(1) the right to be informed that the court will request maltreatment and state licensing checks and a criminal history check on the guardian or conservator for the purpose of determining whether the person's appointment or continued appointment is in the best interests of the person subject to guardianship or conservatorship;\n(2) the right to be informed of the results of the checks and to obtain from the court a copy of the results; and\n(3) the right to challenge the accuracy and completeness of information contained in the results under section 13.04, subdivision 4, except to the extent precluded by section 256.045, subdivision 3.",
	"repealed": false
}