{
	"id": "611A.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.68",
	"title": "611A.68 LIMITING COMMERCIAL EXPLOITATION OF CRIMES; PAYMENT OF VICTIMS.",
	"text": "For purposes of this section, the following terms have the meanings given them in this subdivision.\n(a) \"Contract\" means an agreement regarding, in whole or in part, (1) the reenactment of an offender's crime by way of a movie, book, newspaper or magazine article, radio or television presentation, or live or recorded entertainment of any kind, or (2) the expression of the offender's thoughts, feelings, opinions, or emotions about the crime.\n(b) \"Crime\" means an offense which is a felony under the laws of Minnesota or that would have been a felony if committed in Minnesota, and includes an offense committed or attempted on an Indian reservation or other trust land.\n(c) \"Offender\" means a person convicted of a crime or found not guilty of a crime by reason of insanity.\n(d) \"Person\" includes persons, corporations, partnerships, and other legal entities.\n[Repealed, 1988 c 638 s 17]\nA person that enters into a contract with an offender convicted in this state, and a person that enters into a contract in this state with an offender convicted in this state or elsewhere within the United States, must comply with this section if the person enters into the contract during the ten years after the offender is convicted of a crime or found not guilty by reason of insanity. If an offender is imprisoned or committed to an institution following the conviction or finding of not guilty by reason of insanity, the ten-year period begins on the date of the offender's release. A person subject to this section must notify the Crime Victims Reimbursement Board of the existence of the contract immediately upon its formation, and pay over to the board money owed to the offender or the offender's representatives by virtue of the contract according to the following proportions:\n(1) if the crime occurred in this state, the person shall pay to the board 100 percent of the money owed under the contract;\n(2) if the crime occurred in another jurisdiction having a law applicable to the contract which is substantially similar to this section, this section does not apply, and the person must not pay to the board any of the money owed under the contract; and\n(3) in all other cases, the person shall pay to the board that percentage of money owed under the contract which can fairly be attributed to commerce in this state with respect to the subject matter of the contract.\nWhen the board receives a payment pursuant to this section, it shall attempt to notify any known victims of the crime and shall publish a notice of that fact in a newspaper having general circulation in the county where the crime was committed. The expenses of notification shall be paid from the amount received for that case.\nWhen the board has made reimbursement payments to or on behalf of a victim of the offender's crime pursuant to sections 611A.51 to 611A.68, it shall deduct the amount of the reimbursement award from any payment received under this section by virtue of the offender's contract unless the board has already been reimbursed for the award from another collateral source.\nImmediately after money is deposited with the board under this section, the board may allocate up to ten percent of any money remaining after a deduction is made under subdivision 4 for the benefit of the offender's dependent minor children. The board shall then retain the funds allocated until a claim is made by the dependent minor children or their representative. Upon receiving a claim, the board shall disburse the allocated funds to the dependent minor children if it is shown by clear and convincing evidence that the funds will not be used in a way that benefits the offender.\nA victim of a crime committed by the offender and the estate of a deceased victim of a crime committed by the offender may submit the following claims for reimbursement and damages to the board to be paid from money received by virtue of the offender's contract:\n(1) claims for reimbursement to which the victim is entitled under sections 611A.51 to 611A.68 and for which the victim has not yet received an award from the board;\n(2) claims for reimbursement to which the victim would have been entitled under sections 611A.51 to 611A.68, but for the $50,000 maximum limit contained in section 611A.54, clause (3); and\n(3) claims for other uncompensated damages suffered by the victim as a result of the offender's crime including, but not limited to, damages for pain and suffering.\nThe victim must file the claim within five years of the date on which the board received payment under this section. The board shall determine the victim's claim in accordance with the procedures contained in sections 611A.57 to 611A.63. An award made by the board under this subdivision must be paid from the money received by virtue of the offender's contract that remains after a deduction or allocation, if any, has been made under subdivision 4 or 4a.\nThe board may use money received by virtue of an offender's contract for the purpose of paying reimbursement awarded to victims of other crimes pursuant to sections 611A.51 to 611A.68 under the following circumstances:\n(1) money remain after deductions and allocations have been made under subdivisions 4 and 4a, and claims have been paid under subdivision 4b; or\n(2) no claim is filed under subdivision 4b within five years of the date on which the board received payment under this section.\nNone of this money may be used for purposes other than reimbursement.\n[Repealed, 1988 c 638 s 17]\nNotwithstanding any other provision of this section, the board shall make payments to an offender from the account of amounts received with reference to that offender upon the order of a court of competent jurisdiction after a showing by that offender that the money shall be used for the reasonable costs of defense in the appeal of a criminal conviction or in proceedings pursuant to this section.\nAll money received by the board pursuant to this section shall be deposited in the state treasury, credited to a special account, and are appropriated to the board for the purposes of this section. Money in the special account may be invested pursuant to section 11A.25. When so invested, any interest or profit shall accrue to, and any loss be borne by, the special account. The board shall allocate money in the special account to each case pursuant to this section.\n(a) A person who willfully fails to notify the board of the existence of a contract as required by this section is guilty of a gross misdemeanor.\n(b) Except as otherwise provided in paragraph (a), any person or offender who takes any action, whether by way of execution of a power of attorney, creation of corporate or trust entities or otherwise, to defeat the purpose of this section is guilty of a misdemeanor.",
	"repealed": false
}