{
	"id": "256B.0652",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0652",
	"title": "256B.0652 AUTHORIZATION AND REVIEW OF HOME CARE SERVICES.",
	"text": "The commissioner shall supervise the coordination of the authorization and review of home care services that are reimbursed by medical assistance.\n(a) The commissioner may contract with or employ necessary staff, or contract with qualified agencies, to provide home care authorization and review services for medical assistance recipients who are receiving home care services.\n(b) Reimbursement for the authorization function shall be made through the medical assistance administrative authority. The state shall pay the nonfederal share. The functions will be to:\n(1) assess the recipient's individual need for services required to be cared for safely in the community;\n(2) ensure that a care plan that meets the recipient's needs is developed by the appropriate agency or individual;\n(3) ensure cost-effectiveness and nonduplication of medical assistance home care services;\n(4) recommend the approval or denial of the use of medical assistance funds to pay for home care services;\n(5) reassess the recipient's need for and level of home care services at a frequency determined by the commissioner;\n(6) conduct on-site assessments when determined necessary by the commissioner and recommend changes to care plans that will provide more efficient and appropriate home care; and\n(7) on the department's website:\n(i) provide a link to MinnesotaHelp.info for a list of enrolled home care agencies with the following information: main office address, contact information for the agency, counties in which services are provided, type of home care services provided, whether the personal care assistance choice option is offered, types of qualified professionals employed, number of personal care assistants employed, and data on staff turnover; and\n(ii) post data on home care services including information from both fee-for-service and managed care plans on recipients as available.\n(c) In addition, the commissioner or the commissioner's designee may:\n(1) review care plans, service plans, and reimbursement data for utilization of services that exceed community-based standards for home care, inappropriate home care services, medical necessity, home care services that do not meet quality of care standards, or unauthorized services and make appropriate referrals within the department or to other appropriate entities based on the findings;\n(2) assist the recipient in obtaining services necessary to allow the recipient to remain safely in or return to the community;\n(3) coordinate home care services with other medical assistance services under section 256B.0625;\n(4) assist the recipient with problems related to the provision of home care services;\n(5) assure the quality of home care services; and\n(6) assure that all liable third-party payers including, but not limited to, Medicare have been used prior to medical assistance for home care services.\n(d) For the purposes of this section, \"home care services\" means medical assistance services defined under section 256B.0625, subdivisions 6a, 7, and 19a.\nMS 2008 [Renumbered subd 12]\nThe commissioner, or the commissioner's designee, shall review the assessment, request for temporary services, service plan, and any additional information that is submitted. The commissioner shall, within 30 days after receiving a complete request, assessment, and service plan, authorize home care services as provided in this section.\nHome health services including skilled nurse visits and home health aide visits must be authorized by the commissioner or the commissioner's designee. Authorization must be based on medical necessity and cost-effectiveness when compared with other care options. The commissioner must receive the request for authorization of skilled nurse visits and home health aide visits within 20 working days of the start of service. When home health services are used in combination with personal care and home care nursing, the cost of all home care services shall be considered for cost-effectiveness.\n(a) All home care nursing services shall be authorized by the commissioner or the commissioner's designee. Authorization for home care nursing services shall be based on medical necessity and cost-effectiveness when compared with alternative care options. The commissioner may authorize medically necessary home care nursing services in quarter-hour units when:\n(1) the recipient requires more individual and continuous care than can be provided during a skilled nurse visit; or\n(2) the cares are outside of the scope of services that can be provided by a home health aide or personal care assistant.\n(b) The commissioner may authorize:\n(1) up to two times the average amount of direct care hours provided in nursing facilities statewide for case mix classification \"K\" as established by the annual cost report submitted to the department by nursing facilities in May 1992;\n(2) home care nursing in combination with other home care services and community first services and supports as defined in section 256B.85 up to the total cost allowed under this subdivision and subdivision 7;\n(3) up to 16 hours per day if the recipient requires more nursing than the maximum number of direct care hours as established in clause (1) and, but for the provision of the nursing services, the recipient would require a hospital level of care as defined in Code of Federal Regulations, title 42, section 440.10.\n(c) The commissioner may authorize up to 16 hours per day of medically necessary home care nursing services or up to 24 hours per day of medically necessary home care nursing services until such time as the commissioner is able to make a determination of eligibility for recipients who are cooperatively applying for home care services under the community alternative care program developed under section 256B.49, or until it is determined by the appropriate regulatory agency that a health benefit plan is or is not required to pay for appropriate medically necessary health care services. Recipients or their representatives must cooperatively assist the commissioner in obtaining this determination. Recipients who are eligible for the community alternative care program may not receive more hours of nursing under this section and sections 256B.0651, 256B.0653, and 256B.0659 than would otherwise be authorized under section 256B.49.\n[See Note.]\n(a) All personal care assistance services, supervision by a qualified professional, and additional services beyond the limits established in subdivision 11, must be authorized by the commissioner or the commissioner's designee before services begin except for the assessments established in subdivision 11 and section 256B.0911. The authorization for personal care assistance and qualified professional services under section 256B.0659 must be completed within 30 days after receiving a complete request.\n(b) The amount of personal care assistance services authorized must be based on the recipient's home care rating. The home care rating shall be determined by the commissioner or the commissioner's designee based on information submitted to the commissioner identifying the following for recipients with dependencies in two or more activities of daily living:\n(1) total number of dependencies of activities of daily living as defined in section 256B.0659;\n(2) presence of complex health-related needs as defined in section 256B.0659; and\n(3) presence of Level I behavior as defined in section 256B.0659.\n(c) For purposes meeting the criteria in paragraph (b), the methodology to determine total time for personal care assistance services for each home care rating is based on the median paid units per day for each home care rating from fiscal year 2007 data for the personal care assistance program. Each home care rating has a base level of hours assigned. Additional time is added through the assessment and identification of the following:\n(1) 30 additional minutes per day for a dependency in each critical activity of daily living as defined in section 256B.0659;\n(2) 30 additional minutes per day for each complex health-related function as defined in section 256B.0659; and\n(3) 30 additional minutes per day for each behavior issue as defined in section 256B.0659, subdivision 4, paragraph (d).\n(d) Effective July 1, 2011, the home care rating for recipients who have a dependency in one activity of daily living or Level I behavior shall equal no more than two units per day. Recipients with this home care rating are not subject to the methodology in paragraph (c) and are not eligible for more than two units per day.\n(e) A limit of 96 units of qualified professional supervision may be authorized for each recipient receiving personal care assistance services. A request to the commissioner to exceed this total in a calendar year must be requested by the personal care provider agency on a form approved by the commissioner.\nIf the recipient is ventilator-dependent, the monthly medical assistance authorization for home care services shall not exceed what the commissioner would pay for care at the highest cost hospital designated as a long-term hospital under the Medicare program. For purposes of this subdivision, home care services means all direct care services provided in the home that would be included in the payment for care at the long-term hospital. Recipients who meet the definition of ventilator dependent and the EN home care rating and utilize a combination of home care services are limited up to a total of 24 hours of home care services per day. Additional hours may be authorized when a recipient's assessment indicates a need for two staff to perform activities. Additional time is limited to four hours per day.\n(a) The commissioner or the commissioner's designee shall determine the time period for which an authorization shall be effective. If the recipient continues to require home care services beyond the duration of the authorization, the home care provider must request a new authorization. A personal care provider agency must request a new personal care assistance services assessment, or service update if allowed, at least 60 days prior to the end of the current authorization time period. The request for the assessment must be made on a form approved by the commissioner. An authorization must be valid for no more than 12 months.\n(b) The amount and type of personal care assistance services authorized based upon the assessment and service plan must remain in effect for the recipient whether the recipient chooses a different provider or enrolls or disenrolls from a managed care plan under section 256B.0659, unless the service needs of the recipient change and new assessment is warranted under section 256B.0659, subdivision 3a.\nThe agency nurse, independently enrolled home care nurse, or county public health nurse may request a temporary authorization for home care services. The commissioner may approve a temporary level of home care services based on the assessment, and service or care plan information, and primary payer coverage determination information as required. Authorization for a temporary level of home care services including nurse supervision is limited to the time specified by the commissioner, but shall not exceed 45 days. The level of services authorized under this provision shall have no bearing on a future authorization.\n(a) Home care services provided in an adult or child foster care setting must receive authorization by the commissioner according to the limits established in subdivision 11.\n(b) The commissioner may not authorize:\n(1) home care services that are the responsibility of the foster care provider under the terms of the foster care placement agreement, assessment under sections 142A.607 and 260C.4411, and administrative rules;\n(2) personal care assistance services when the foster care license holder is also the personal care provider or personal care assistant, unless the foster home is the licensed provider's primary residence as defined in section 256B.0625, subdivision 19a; or\n(3) personal care assistant and home care nursing services when the licensed capacity is greater than six, unless all conditions for a variance under section 142B.10, subdivision 17, are satisfied for a sibling, as defined in section 260C.007, subdivision 32.\nA recipient may receive the following home care services during a calendar year:\n(1) up to two face-to-face assessments to determine a recipient's need for personal care assistance services;\n(2) one service update done to determine a recipient's need for personal care assistance services; and\n(3) up to nine face-to-face skilled nurse visits.\nFor purposes of providing informed choice, coordinating of local planning decisions, and streamlining administrative requirements, the assessment and authorization process for persons receiving both home care and home and community-based waivered services for persons with developmental disabilities shall meet the requirements of sections 256B.0651 to 256B.0654 and 256B.0659 with the following exceptions:\n(a) Upon request for home care services and subsequent assessment by the public health nurse under sections 256B.0651 to 256B.0654 and 256B.0659, the public health nurse shall participate in the screening process, as appropriate, and, if home care services are determined to be necessary, participate in the development of a service plan coordinating the need for home care and home and community-based waivered services with the assigned county case manager, the recipient of services, and the recipient's legal representative, if any.\n(b) The public health nurse shall give authorization for home care services to the extent that home care services are:\n(1) medically necessary;\n(2) chosen by the recipient and their legal representative, if any, from the array of home care and home and community-based waivered services available;\n(3) coordinated with other services to be received by the recipient as described in the service plan; and\n(4) provided within the county's reimbursement limits for home care and home and community-based waivered services for persons with developmental disabilities.\n(c) If the public health agency is or may be the provider of home care services to the recipient, the public health agency shall provide the commissioner of human services with a written plan that specifies how the assessment and authorization process will be held separate and distinct from the provision of services.\nA recipient who appeals a reduction in previously authorized home care services may continue previously authorized services, other than temporary services under subdivision 9, pending an appeal under section 256.045. The commissioner must ensure that the recipient has a copy of the most recent service plan that contains a detailed explanation of which areas of covered personal care assistance tasks are reduced, and provide notice of the amount of time per day reduced, and the reasons for the reduction in the recipient's notice of denial, termination, or reduction.\nAll home care services above the limits in subdivision 11 must receive the commissioner's authorization before services begin, except when:\n(1) the home care services were required to treat an emergency medical condition that if not immediately treated could cause a recipient serious physical or mental disability, continuation of severe pain, or death. The provider must request retroactive authorization no later than five working days after giving the initial service. The provider must be able to substantiate the emergency by documentation such as reports, notes, and admission or discharge histories;\n(2) a recipient's medical assistance eligibility has lapsed, is then retroactively reinstated, and an authorization for home care services is completed based on the date of a current assessment, eligibility, and request for authorization;\n(3) a third-party payor for home care services has denied or adjusted a payment. Authorization requests must be submitted by the provider within 20 working days of the notice of denial or adjustment. A copy of the notice must be included with the request;\n(4) the commissioner has determined that a county or state human services agency has made an error; or\n(5) if a recipient enrolled in managed care experiences a temporary disenrollment from a health plan, the commissioner shall accept the current health plan authorization for personal care assistance services for up to 60 days. The request must be received within the first 30 days of the disenrollment. If the recipient's reenrollment in managed care is after the 60 days and before 90 days, the provider shall request an additional 30-day extension of the current health plan authorization, for a total limit of 90 days from the time of disenrollment.",
	"repealed": false
}