{
	"id": "176.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.185",
	"title": "176.185 POLICY OF INSURANCE.",
	"text": "Within ten days after the issuance or renewal of a policy of insurance covering the liability to pay compensation under this chapter written by an insurer licensed to insure such liability in this state, the insurer shall file notice of coverage with the commissioner under rules and on forms prescribed by the commissioner. No policy shall be canceled by the insurer within the policy period nor terminated upon its expiration date until a notice in writing is delivered or mailed to the insured that meets all of the requirements in paragraphs (a) to (c).\n(a) The notice must specify the date the policy will be terminated if the premium is not paid, declare that the insurer intends to cancel the policy by the specified date, or does not intend to renew the policy upon the expiration date.\n(b) The notice must include the following statement, which must be placed on or sent with the premium invoice or other document sent by the insurer to notify the insured of the intended cancellation or termination: \"You must maintain workers' compensation insurance, or obtain permission to self-insure for workers' compensation from the Minnesota Department of Commerce. The failure to maintain workers' compensation coverage is a violation of section 176.181, and could result in criminal prosecution and civil penalties of up to $1,000 per week per uninsured employee.\" This statement must be in at least 12-point font, boldfaced type, and be set out in a separate paragraph.\n(c) The notice must be mailed or delivered to the insured as follows, notwithstanding any contrary time frame for notice to the policyholder in section 60A.36 or 60A.37:\n(1) at least 60 days before the actual date the policy is due to expire or be terminated or canceled for any reason other than as provided in clause (2);\n(2) if the cancellation is due to nonpayment of premium, the notice must be sent at least 30 days before the actual date of cancellation and shall state the amount of premium due and the due date.\n(a) Within ten calendar days after the specified cancellation or termination date, the insurer must send to the insured and file with the commissioner a written notice of cancellation or termination in the manner prescribed by the commissioner. Upon the commissioner's request, the insurer shall provide documentation of the dates the notices required by this subdivision and subdivision 1 were sent to the insured. The effective dates of cancellation or termination specified in paragraphs (b) to (e) apply notwithstanding any contrary time frames in section 60A.36 or 60A.37.\n(b) If within the ten calendar days after the specified cancellation or termination date the notice of cancellation or termination is both sent to the insured and received by the commissioner, the cancellation or termination shall be effective on the date specified on the notice of cancellation or termination, except as otherwise provided in paragraph (d).\n(c) If within the ten calendar days after the specified cancellation or termination date the notice of cancellation or termination is not sent to the insured and received by the commissioner, the cancellation or termination shall not be effective until the notice has been sent to the insured and received by the commissioner, except as otherwise provided in paragraph (d) or (e).\n(d) If the notice required by subdivision 1 is not sent to the insured or does not meet all of the requirements of subdivision 1, the cancellation or termination shall not be effective until 60 days after the notice of cancellation or termination has been sent to the insured and received by the commissioner, except as otherwise provided in paragraph (e).\n(e) Paragraphs (c) and (d) do not extend the effective date of cancellation or termination if, on or before the cancellation or termination date determined under paragraph (c) or (d), the employer obtains other insurance coverage or an order exempting the employer from carrying insurance as provided in section 176.181.\nIf, after receiving a notice of cancellation or termination of a policy under subdivision 1a, the commissioner does not receive a notice of continued or replacement coverage, the commissioner shall notify the insured that the insured must obtain coverage from some other licensed carrier and that, if unable to do so, the insured shall request the commissioner of commerce to require the issuance of a policy as provided in section 79.251, subdivision 4. Upon a cancellation or termination of a policy by the insurer, the employer is entitled to be assigned a policy in accordance with sections 79.251 and 79.252.\nNotice of cancellation or termination by the insured shall be served upon the insurer by written statement mailed or delivered to the insurer. Upon receipt of the notice, the insurer shall notify the commissioner of the cancellation or termination and the commissioner shall ask the employer for the reasons for the cancellation or termination and notify the employer of the duty under this chapter to insure the employer's employees.\nA policy of insurance covering the liability to pay compensation under this chapter written by any insurer licensed to insure such liability in this state shall in every case be subject to the conditions of this section hereinafter named.\nWhere the employer's risk is carried by an insurer the insurance policy shall provide compensation for injury or death in accordance with the full benefits conferred by this chapter.\nEvery insurance policy which insures the payment of compensation shall contain provisions declaring the following:\n(1) Notice to or knowledge by the employer is notice to or knowledge by the insurer.\n(2) Jurisdiction of the employer for any purpose is jurisdiction of the insurer.\n(3) The insurer is bound by an award rendered against the employer.\n(4) The employee has an equitable lien upon any amount which the insurer owes under the policy to the employer. Where the employer is legally incapacitated or otherwise unable to receive this amount and pay it over to the employee or the employee's dependent, the insurer will pay the amount directly to the employee or dependent. This payment by the insurer directly to the employee or dependent discharges the obligation of the insurer to the employee, and the obligations of the insurer and the employer to the employee or dependent.\n(5) The insolvency or bankruptcy of the employer does not relieve the insurer from its obligation to pay compensation.\nSubject to the provisions of subdivision 6, an agreement between an employee and employer under which the employee is to pay any part of the cost of insuring the employer's risk is void. An employer who makes a charge or deduction prohibited by this subdivision is guilty of a misdemeanor.\nAn employer who violates subdivision 5 after notice from the commissioner is subject to a penalty of 400 percent of the amount withheld from or charged the employee. The penalty shall be imposed by the commissioner. Forty percent of this penalty is payable to the commissioner for deposit in the assigned risk safety account and 60 percent is payable to the employee.\nWhere the agreement has been approved by the commissioner of the Department of Labor and Industry the employer and employee may agree to carry the risk provided for in this chapter in conjunction with other and greater risks providing other and greater benefits in the form of additional compensation, or accident, sickness, or old age insurance or benefits. This agreement may provide for appropriate contribution by the employee.\nWhere an employer has properly insured the payment of compensation to an employee, the employee, or the employee's dependent, shall proceed directly against the insurer. In such case but subject to subdivision 8a, the employer is released from further liability in this respect.\n[Repealed, 1977 c 342 s 28]\n(a) If an insurer is or becomes insolvent as defined in section 60C.03, subdivision 8, the insured employer is liable, as of May 23, 2003, for payment of the compensable workers' compensation claims that were covered under the employer's policy with the insolvent insurer, to the extent that the Insurance Guaranty Association has determined that the claims are not covered claims under chapter 60C. This paragraph does not in any way limit the Insurance Guaranty Association's right of recovery from an employer under section 60C.11, subdivision 7, for workers' compensation claims that are covered claims under chapter 60C.\nThe Insurance Guaranty Association shall notify the employer and the commissioners of the Departments of Commerce and Labor and Industry of the association's determination and of the employer's liability under this subdivision. The association's failure to notify the employer or the commissioners shall not relieve the employer of its liability and obligations under this subdivision.\n(b) An employer who is liable for payment of claims under paragraph (a) shall have all of the rights, responsibilities, and obligations of a self-insured employer under this chapter for those claims only, but without the need for an order from the commissioner of commerce. The employer shall not be self-insured for purposes of the workers' compensation self-insurers' security fund under chapter 79A for those claims. The employer shall not be required to pay assessments to the workers' compensation self-insurers' security fund, and the security fund shall not be liable for the claims under section 79A.10. Notwithstanding any contrary provision of chapter 60C, the Insurance Guaranty Association shall pay the claims as covered claims under chapter 60C if the employer fails to pay the claims as required under this chapter and the commissioner of commerce:\n(1) determines that the employer is the subject of a voluntary or involuntary petition under the United States Bankruptcy Code, title 11;\n(2) determines that a court of competent jurisdiction has declared the employer to be bankrupt or insolvent;\n(3) determines that the employer is insolvent; or\n(4) issues a certificate of default against the employer for failure to pay workers' compensation benefits as required under this chapter.\nThe commissioner of labor and industry shall notify the commissioner of commerce and the Insurance Guaranty Association if the commissioner of labor and industry has knowledge that any employer has failed to pay, and will likely continue to fail to pay, workers' compensation benefits as required by this chapter. If clauses (1) to (3) do not apply, but the employer refuses or fails to pay benefits required under this chapter, or if there is a dispute about an employer's liability for the claims, the commissioner of commerce shall issue a certificate of default.\nThe commissioner of commerce shall immediately notify, by certified mail, the Insurance Guaranty Association of the occurrence of any of the circumstances in clauses (1) to (4), and shall order the association to assume the employer's obligations under this chapter. The association shall commence payment of these obligations as soon as possible upon receipt of the employer's claim files. Upon the assumption of obligations by the association pursuant to the commissioner of commerce's notification and order, the association has the right to immediate possession of all relevant workers' compensation claim files and data of the employer or other possessor of the files and data. The possessor of the files and data must provide the files and data, or complete copies of them, to the association within five days of the notification provided under this subdivision.\nIf the possessor of the files and data fails to timely provide the files and data to the association, it is liable to the commissioner of commerce for a penalty of $500 per day for each day after the five-day period has expired. The association is also entitled to recover from the employer reasonable attorney fees and costs in administering and paying benefits owed under this chapter. If the association's payments are made pursuant to a certificate of default as provided in clause (4), the employer is also liable for and shall pay a penalty in the amount of 300 percent of all benefits the association pays to or on behalf of the employee. The commissioner of commerce shall assess the penalties under this paragraph.\nAn appeal from the commissioner of commerce's order or penalties under this paragraph may be instituted pursuant to the contested case procedures of chapter 14. Payment of claims by the association shall not be stayed pending the resolution of the disputes.\n(c) If the employer contracts with an entity or person to administer the claims under paragraph (a), the entity or person must be a licensed workers' compensation insurer or a licensed third-party administrator under section 60A.23, subdivision 8. The commissioner of commerce may require the employer to contract with a licensed third-party administrator when the commissioner determines it is necessary to ensure proper payment of compensation under this chapter.\n(d) For all claims that an employer is liable for under paragraph (a) and pays on or after May 26, 2005, and for all deductible amounts an employer pays on or after May 26, 2005, under an employer's policy with an insurer that became insolvent before May 23, 2003:\n(1) the employer shall file reports and pay assessments to the special compensation fund, according to the requirements of section 176.129 that apply to self-insured employers, based on paid indemnity losses for the claims and deductible amounts it paid; and\n(2) the employer may request supplementary benefit and second injury reimbursement from the special compensation fund for the claims and deductible amounts it paid, subject to section 176.129, subdivision 13. Reimbursement from the special compensation fund is limited to claims that are eligible for supplementary benefit and second injury reimbursement under Minnesota Statutes 1990, section 176.131, and Minnesota Statutes 1994, section 176.132.\n(e) For all claims for which an employer is liable under paragraph (a) and paid between the date of the insurer's insolvency and May 26, 2005, and for all deductible amounts an employer paid between the date of the insurer's insolvency and May 26, 2005, under an employer's policy with an insurer that became insolvent before May 23, 2003, the employer may request supplementary benefit and second injury reimbursement from the special compensation fund, subject to section 176.129, subdivision 13, if:\n(1) the employer files reports and pays all past assessments based on paid indemnity losses, for all claims and deductible amounts it paid from the date of the insolvency of the insurer to May 26, 2005, at the rate that was in effect for self-insured employers under section 176.129 during the applicable assessment reporting period;\n(2) the employer has a pending request for reimbursement of the claims and deductible amounts it paid from the special compensation fund as of May 26, 2005, or files a request for reimbursement within one year after May 26, 2005; and\n(3) the claims are eligible for supplementary benefit and second injury reimbursement under Minnesota Statutes 1990, section 176.131, and Minnesota Statutes 1994, section 176.132.\n(f) An employer who is liable for claims under paragraph (a) shall be eligible for reimbursement from the Workers' Compensation Reinsurance Association under chapter 79 for those claims to the extent they exceed the applicable retention limit selected by the insolvent insurer and if the employer has complied with the requirements for reimbursement established by the Workers' Compensation Reinsurance Association for its self-insured members. The employer is not responsible for payment of premiums to the reinsurance association to the extent the premiums have been paid by the insolvent insurer.\n(g) The expenses of the employer in handling the claims paid under paragraph (a) are accorded the same priority as the liquidator's expenses. The employer must be recognized as a claimant in the liquidation of an insolvent insurer for amounts paid by the employer under this subdivision, and must receive dividends and other distributions at the priority set forth in chapter 60B. The receiver, liquidator, or statutory successor of an insolvent insurer is bound by settlements of claims made by the employer under this subdivision. The court having jurisdiction shall grant the claims priority equal to that which the claimant would have been entitled against the assets of the insolvent insurer in the absence of this subdivision.\n(h) The Workers' Compensation Reinsurance Association and the special compensation fund, as a condition of directly reimbursing an employer eligible for reimbursement, may require the employer to hold it harmless from any claims by a liquidator, receiver, or statutory successor to the insolvent insurer that the Workers' Compensation Reinsurance Association or special compensation fund improperly indemnified or reimbursed the employer. In no event shall the Workers' Compensation Reinsurance Association or the special compensation fund be required to reimburse any amounts for any claim more than once.\nWhere an employer, who has been exempted from the requirement to insure liability for compensation under this chapter, insures any part of that liability, this section applies to such an employer to the extent that its provisions are applicable.\nThe commissioner may contract with other parties regarding the collection of appropriate data to assist in meeting the requirements of this section.\n(a) The following workers' compensation insurance coverage data reported to or collected by the department under this section, or otherwise created or received by the department, is public data, subject to the limitations provided in paragraph (b):\n(1) all action on an insurance policy, but not including the policy itself. Examples of action on a policy are the date of issuance of a new policy, the date of cancellation, or copies of a correction, binder, reinstatement, expiration, cancellation, termination, or declaration page;\n(2) the employer's legal name;\n(3) every \"doing business as\" name used by the employer;\n(4) the employer's legal form of ownership, such as corporation, partnership, limited partnership, or government entity, and the names of all owners and partners including, for limited partnerships, the names of general partners;\n(5) the employer's complete mailing and physical addresses;\n(6) the nature of the employer's business;\n(7) the policy number;\n(8) the effective and expiration dates of the policy;\n(9) the name of the insurance carrier;\n(10) if the policy has been canceled, the type of cancellation, reason for cancellation, and effective date of cancellation; and\n(11) the employer's unemployment account number.\n(b) The commissioner shall release the insurance coverage data listed in paragraph (a) only in response to an inquiry about an employer in which the requester provides employer identifying information required by the commissioner. The commissioner or an entity with whom the department has contracted pursuant to subdivision 10 shall provide a website for such public inquiries and may impose access restrictions necessary to limit access to individual inquiries and to otherwise deter the use of the website for purposes other than insurance verification. Persons who obtain the data prescribed in paragraph (a) from the department are prohibited from using the data for commercial purposes.\n(c) For purposes of this subdivision, \"employer\" includes a policyholder and any other entities listed on the same insurance policy as the employer.\n(d) For purposes of this subdivision, \"commercial purposes\" means the sale or use of insurance coverage data listed in paragraph (a) for marketing or profit.\n(e) An entity with whom the department has contracted pursuant to subdivision 10 has a private right of action to enforce the prohibition in paragraph (b) against a person who uses the data for commercial purposes. The entity may bring a civil action to recover damages and costs and disbursements, including reasonable attorney fees, from the person, and for other equitable relief as determined by the court.",
	"repealed": false
}