{
	"id": "174.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.23",
	"title": "174.23 GENERAL POWERS AND DUTIES.",
	"text": "(a) The commissioner shall have all powers necessary and convenient to carry out the provisions of sections 174.21 to 174.27 including the power to:\n(1) review applications for financial assistance, execute contracts, and obligate and expend program funds, upon conditions and limitations as the commissioner deems necessary for purposes of program and project implementation, operation, and evaluation;\n(2) accept and disburse federal funds available for the purposes of sections 174.21 to 174.27, and such funds are appropriated to the commissioner; and\n(3) act upon request as the designated agent of any eligible person for the receipt and disbursal of federal funds.\n(b) The commissioner shall perform the duties and exercise the powers under sections 174.21 to 174.27 in coordination with and in furtherance of statewide, regional, and local transportation plans and transportation development programs.\n(a) The commissioner must seek out and select eligible recipients of financial assistance under sections 174.21 to 174.27.\n(b) The commissioner must establish procedures and standards for review and approval of applications for financial assistance submitted to the commissioner pursuant to sections 174.21 to 174.27. Any applicant must provide to the commissioner any financial or other information required by the commissioner to carry out the commissioner's duties. The commissioner may require local contributions from applicants as a condition for receiving financial assistance.\nThe commissioner shall offer, use, and apply the information developed pursuant to sections 174.21 to 174.27 to assist and advise political subdivisions and recipients of financial assistance in the planning, promotion, development, operation, and evaluation of programs and projects to accomplish the purposes of sections 174.21 to 174.27. The commissioner shall seek out and select eligible recipients of such technical and professional assistance.\nThe commissioner shall conduct research and shall study, analyze, and evaluate concepts, techniques, programs, and projects to accomplish the purposes of sections 174.21 to 174.27, including traffic operations improvements, preferential treatment and other encouragement of transit and paratransit services and high-occupancy vehicles, improvements in the management and operation of regular route transit services, special provision for pedestrians and bicycles, management and control of parking, changes in work schedules, and reduction of vehicle use in congested and residential areas. The commissioner shall examine and evaluate such concepts, techniques, programs, and projects now or previously employed or proposed in this state and elsewhere. The commissioner or an independent third party under contract to the commissioner shall monitor and evaluate the management and operation of public transportation systems, services, and projects receiving financial or professional and technical assistance under sections 174.21 to 174.27 or other state programs to determine the manner in which and the extent to which such systems, services, and projects contribute or may contribute to the purposes of sections 174.21 to 174.27. The commissioner shall develop and promote proposals and projects to accomplish the purposes of sections 174.21 to 174.27 and shall actively solicit such proposals from municipalities, counties, legislatively established transit commissions and authorities, regional development commissions, and potential vendors. In conducting such activities the commissioner shall make the greatest possible use of already available research and information. The commissioner shall use the information developed under sections 174.21 to 174.27 in developing or revising the state transportation plan.\n[Repealed, 1997 c 7 art 2 s 67]\nThe commissioner may make grants to any project eligible for assistance under sections 174.24 to 174.27, for the purpose of training drivers of vehicles operated by the project. The subjects of the training may include safe driving skills, techniques of assisting elderly and disabled passengers, and first aid. The commissioner may also contract with a public or private agency or institution to provide driver training to drivers of vehicles utilized by eligible projects.\nMS 2022 [Repealed, 2024 c 104 art 2 s 16]\nThe commissioner shall assign the administration of the programs set forth in sections 174.21 to 174.27 to a single division within the Department of Transportation.\nThe commissioner of transportation shall establish reimbursement policies based on the cost principles of the federal acquisition regulations to determine the reasonableness and allowability of various costs, including overhead factors, direct salary costs, and other costs of design and consultant contracts.",
	"repealed": false
}