{
	"id": "174.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.64",
	"title": "174.64 FUNCTIONS AND POWERS RELATING TO CARRIERS.",
	"text": "Some of the functions of the commissioner of transportation, related to motor carriers and common carriers by rail, are quasi-judicial in nature. The commissioner may make investigations and determinations, hold hearings, prescribe rules, and issue orders with respect to the control and conduct of the carrier businesses coming within the commissioner's jurisdiction as authorized by law.\n(a) To the extent allowed under federal law or regulation, the commissioner shall further hold hearings and issue orders in cases brought on the commissioner's own motion or by a third party in the following areas:\n(1) adequacy of services that carriers are providing to the public, including the continuation, termination, or modification of services and facilities;\n(2) reasonableness of tariffs of rates, fares, and charges, or a part or classification of a tariff; and\n(3) issuing permits.\n(b) For purposes of paragraph (a), clause (2), the commissioner may authorize common carriers by rail and motor carriers for hire to file tariffs of rates, fares, and charges individually or by group. Carriers participating in group ratemaking have the free and unrestrained right to take independent action either before or after a determination arrived at through that procedure.\nThe commissioner shall have subpoena power.\n(a) With respect to those matters within the commissioner's jurisdiction, the commissioner shall receive, hear, and determine all petitions filed with the commissioner in accordance with the procedures established by law and may hold hearings and make determinations upon the commissioner's own motion to the same extent, and in every instance, in which the commissioner may do so upon petition.\n(b) If the commissioner receives a written objection and notice of intent to appear at a hearing to object to the petition from any person within 20 days of the notice having been fully given, the request of the petition must be granted or denied only after a contested case hearing has been conducted on the petition, unless the objection is withdrawn before the hearing. The commissioner may elect to hold a contested case hearing if no objections to the petition are received. If a timely objection is not received, or if received and withdrawn, and the request of the petition is denied without hearing, the petitioner may request within 30 days of receiving the notice of denial, and must be granted, a contested case hearing on the petition.",
	"repealed": false
}