{
	"id": "297F.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.14",
	"title": "297F.14 REFUNDS.",
	"text": "If cigarettes or tobacco products, upon which the tax imposed by this chapter has been reported and paid, are shipped or transported by the distributor to consumers to be consumed outside the state, or to retailers or subjobbers outside the state to be sold by those retailers or subjobbers outside the state, or are returned to the manufacturer by the distributor, or destroyed by the distributor, refund of the tax or credit may be made to the distributor.\nAn overpayment of the tax imposed under this chapter may be refunded to the taxpayer.\nThe commissioner may credit the amount determined under this section against taxes otherwise payable under this chapter by the taxpayer.\nFor any reporting period, a taxpayer may offset against taxes payable under this chapter the amount of taxes previously paid under this chapter that is attributable to a bad debt. The taxes must have been included in a transaction the consideration for which was a debt owed to the taxpayer and which became uncollectible, but only in proportion to the portion of debt that became uncollectible. To qualify for offset under this subdivision, the debt must have qualified as a bad debt under section 166(a) of the Internal Revenue Code. The taxpayer may claim the offset within the time period prescribed in section 297F.17, subdivision 6. If the taxpayer is no longer liable for taxes imposed under this chapter, the commissioner shall refund to the taxpayer the amount of the taxes attributable to the bad debt. Any recovery of the tax claimed as a refund or credit must be reported to the commissioner on the tax return for the month in which the recovery is made. If the taxpayer is no longer required to file returns under this chapter, the taxpayer must reimburse the commissioner for tax recovered in the month following the recovery.\nThe commissioner of management and budget shall pay the cigarette tax refund out of the general fund. The refunds are apportioned to the same accounts and funds in the general fund to which the tax payments were deposited, except no refunds may be apportioned to the general obligation special tax bond debt service account.\nThe commissioner of management and budget shall pay the tobacco products tax refund out of the general fund.\nThere is appropriated annually from the general fund to the commissioner of management and budget the amount necessary to make the refunds provided by this section.",
	"repealed": false
}