{
	"id": "325F.694",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.694",
	"title": "325F.694 FALSE OR MISLEADING COMMERCIAL ELECTRONIC MAIL MESSAGES.",
	"text": "(a) The terms used in this section have the meanings given them in this subdivision.\n(b) \"Commercial electronic mail message\" means an electronic mail message sent through an Internet service provider's facilities located in this state to a resident of this state for promoting real property, goods, or services for sale or lease.\n(c) \"Electronic mail address\" means a destination, commonly expressed as a string of characters, to which electronic mail may be sent or delivered.\n(d) \"Electronic mail service provider\" means a business, nonprofit organization, educational institution, library, or government entity that provides a set of users the ability to send or receive electronic mail messages via the Internet.\n(e) \"Initiate the transmission\" refers to the action by the original sender of an electronic mail message, not to the action by an intervening Internet service provider or electronic mail service provider that may handle or retransmit the message.\n(f) \"Internet service provider\" means a business or person who provides users authenticated access to, or presence on, the Internet by means of a switched or dedicated telecommunications channel upon which the provider provides transit routing of Internet Protocol (IP) packets for and on behalf of the user.\n(g) \"Internet domain name\" refers to a globally unique, hierarchical reference to an Internet host or service, assigned through centralized Internet naming authorities, comprising a series of character strings separated by periods, with the rightmost string specifying the top of the hierarchy.\nNo person may initiate the transmission of a commercial electronic mail message that:\n(1) uses a third party's Internet domain name without permission of the third party, or otherwise misrepresents any information in identifying the point of origin or the transmission path of a commercial electronic mail message; or\n(2) contains false or misleading information in the subject line.\nThe subject line of a commercial electronic mail message must include \"ADV\" as the first characters. If the message contains information that consists of material of a sexual nature that may only be viewed by an individual 18 years of age and older, the subject line of the message must include \"ADV-ADULT\" as the first characters.\nFor purposes of this subdivision, \"commercial electronic mail message\" does not include a message:\n(1) if the recipient has consented to receive or has solicited electronic mail messages from the initiator;\n(2) from an organization using electronic mail to communicate exclusively with its members;\n(3) from an entity which uses electronic mail to communicate exclusively with its employees or contractors; or\n(4) if there is a business or personal relationship between the initiator and the recipient.\nFor purposes of this subdivision, \"business relationship\" means a prior or existing relationship formed between the initiator and the recipient, with or without an exchange of consideration, on the basis of an inquiry, application, purchase, or use by the recipient of or regarding products, information, or services offered by the initiator or an affiliate or agent of the initiator. For purposes of this paragraph, \"affiliate\" means a person that directly or indirectly controls, is controlled by, or is under common control with a specified person.\n(a) A sender initiating the transmission of a commercial electronic mail message must establish a toll-free telephone number, a valid sender-operated return electronic mail address, or another easy-to-use electronic method that the recipient of the commercial electronic mail message may call or access by electronic mail or other electronic means to notify the sender not to transmit by electronic mail any further unsolicited commercial electronic mail messages. The notification process may include the ability for the commercial electronic mail messages recipient to direct the initiator to transmit or not transmit particular commercial electronic mail messages based upon products, services, divisions, organizations, companies, or other selections of the recipient's choice.\n(b) A commercial electronic mail message must include a statement informing the recipient of a toll-free telephone number that the recipient may call, or a valid return address to which the recipient may write or access by electronic mail or another electronic method established by the initiator, notifying the sender not to transmit to the recipient any further unsolicited commercial electronic mail messages to the electronic mail address, or addresses, specified by the recipient, and explaining the manner in which the recipient may specify what commercial electronic mail messages the recipient does and does not wish to receive.\nNo electronic mail service provider may be held liable in an action by a recipient for any act voluntarily taken in good faith to block the receipt or transmission through its service of any commercial electronic mail message that the electronic mail service provider reasonably believes is, or will be, sent in violation of this section.\n(a) A person is not liable for a commercial electronic mail message sent in violation of this section if the person can show by a preponderance of the evidence that the commercial electronic mail message was not initiated by the person or was initiated in a manner and form not subject to the control of the person.\n(b) In an action under this section it is a defense that the defendant has established and implemented reasonable practices and procedures to prevent violations of this section.\n(a) A person injured by a violation of this section may recover damages caused by the violation as specified in this subdivision.\n(b) An injured person, other than an electronic mail service provider, may recover:\n(1) the lesser of $25 for each commercial electronic mail message received that violates subdivision 2, or $35,000 per day; or\n(2) the lesser of $10 for each commercial electronic mail message received that violates subdivision 3, or $25,000 per day.\n(c) An injured electronic mail service provider may recover actual damages or elect, in lieu of actual damages, to recover:\n(1) the lesser of $25 for each commercial electronic mail message received that violates subdivision 2, or $35,000 per day; or\n(2) the lesser of $10 for each commercial electronic mail message received that violates subdivision 3, or $25,000 per day.\n(d) At the request of any party to an action brought under this section, the court may, at its discretion, conduct all legal proceedings in such a way as to protect the secrecy and security of the computer, computer network, computer data, computer program, and computer software involved in order to prevent possible recurrence of the same or a similar act by another person and to protect any trade secrets of any party.\n(e) Costs, disbursements, and reasonable attorney fees may be awarded to a party awarded damages for a violation of this section. No class action shall be brought under this section.\n(f) Except as otherwise provided in this subdivision, the remedies in this subdivision are in addition to remedies available under section 8.31, 325F.70, or other law.\nIf federal law is enacted that regulates false, misleading, or unsolicited commercial electronic mail messages but does not preempt state law on the subject, the federal law supersedes any conflicting provisions of this section.",
	"repealed": false
}