{
	"id": "419.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/419.02",
	"title": "419.02 MEMBERSHIP; JOINT POLICE AND FIRE COMMISSION.",
	"text": "This commission shall consist of three members who are citizens of the state and residents of such city, and shall be appointed by the council of the city, and when first created one commissioner shall be appointed for the term of one year, who shall be president of the commission, one for the term of two years, and one for the term of three years, and all commissioners shall hold their office until their successors are appointed and qualified. No commissioner shall, at the time of appointment or while serving, hold any elected office under the city, the United States, the state of Minnesota, or any public corporation or political division thereof, or employment under the city, or employment under a police department of any city, other than as a member of a civil service commission for firefighters or other municipal personnel. Each commissioner, before entering upon duties, shall subscribe and file with the city clerk an oath for the faithful discharge of the duties. There shall be appointed each year thereafter by the city council one member of the commission whose term of office shall be for three years, and each member of the commission shall be president of the commission during the last year of the member's term.\nIn any city establishing or having a firefighters' civil service commission, the city council may, in the ordinance establishing the police or firefighters' civil service commission or in a later ordinance adopted in the same manner, provide that a single commission shall serve as both police and firefighters' civil service commissions. The joint commission shall consist of three members appointed in the same manner, for the same terms, and with the same qualifications as a police civil service commission under sections 419.01 to 419.18. When existing police and firefighters' civil service commissions are combined, all the members of the two commissions shall become the members of the combined commission and shall continue to serve as members of the new commission for the remainder of the terms for which they were originally appointed. No successor shall be appointed for the members whose terms are the first, third, and fifth of the six to end, but at the end of every other term, one member shall be appointed for a three-year term, thus reducing the commission membership to five by the end of the first year, four by the end of the second year, and three by the end of the third year.",
	"repealed": false
}