{
	"id": "246C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.06",
	"title": "246C.06 EXECUTIVE BOARD; MEMBERSHIP; GOVERNANCE.",
	"text": "The Direct Care and Treatment executive board is established.\n(a) The Direct Care and Treatment executive board consists of nine members with seven voting members and two nonvoting members. The seven voting members must include six members appointed by the governor with the advice and consent of the senate in accordance with paragraph (b) and the commissioner of human services or a designee. The two nonvoting members must be appointed in accordance with paragraph (c). Section 15.0597 applies to all executive board appointments except for the commissioner of human services.\n(b) The executive board voting members appointed by the governor must meet the following qualifications:\n(1) one member must be a licensed physician who is a psychiatrist or has experience in serving behavioral health patients;\n(2) two members must have experience serving on a hospital or nonprofit board; and\n(3) three members must have experience working: (i) in the delivery of behavioral health services or care coordination or in traditional healing practices; (ii) as a licensed health care professional; (iii) within health care administration; or (iv) with residential services.\n(c) The executive board nonvoting members must be appointed as follows:\n(1) one member appointed by the Association of Counties; and\n(2) one member who has an active role as a union representative representing staff at Direct Care and Treatment appointed by joint representatives of the following unions: American Federation of State, County and Municipal Employees (AFSCME); Minnesota Association of Professional Employees (MAPE); Minnesota Nurses Association (MNA); Middle Management Association (MMA); and State Residential Schools Education Association (SRSEA).\n(d) Membership on the board must include representation from outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2.\n(e) A voting member of the executive board must not be or must not have been within one year prior to appointment: (1) an employee of Direct Care and Treatment; (2) an employee of a county, including a county commissioner; (3) an active employee or representative of a labor union that represents employees of Direct Care and Treatment; or (4) a member of the state legislature. This paragraph does not apply to the nonvoting members or the commissioner of human services or designee.\nExcept as otherwise provided in this section, the membership terms and removal and filling of vacancies for the executive board are governed by section 15.0575.\n(a) Notwithstanding section 15.0575, subdivision 3, paragraph (a), the nonvoting members of the executive board must not receive daily compensation for executive board activities. Nonvoting members of the executive board may receive expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Nonvoting members who, as a result of time spent attending board meetings, incur child care expenses that would not otherwise have been incurred may be reimbursed for those expenses upon board authorization.\n(b) Notwithstanding section 15.0575, subdivision 3, paragraph (a), the Compensation Council under section 15A.082 must determine the compensation for voting members of the executive board per day spent on executive board activities authorized by the executive board. Voting members of the executive board may also receive the expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Voting members who, as a result of time spent attending board meetings, incur child care expenses that would not otherwise have been incurred may be reimbursed for those expenses upon board authorization.\n(c) The commissioner of management and budget must publish the daily compensation rate for voting members of the executive board determined under paragraph (b) on the Department of Management and Budget's website.\n(d) Voting members of the executive board must adopt internal standards prescribing what constitutes a day spent on board activities for the purposes of making payments authorized under paragraph (b).\n(e) All other requirements under section 15.0575, subdivision 3, apply to the compensation of executive board members.\n(a) The governor shall designate one member from the voting membership appointed by the governor as acting chair of the executive board.\n(b) At the first meeting of the executive board, the executive board must elect a chair from among the voting membership appointed by the governor.\n(c) The executive board must annually elect a chair from among the voting membership appointed by the governor.\n(d) The executive board must elect officers from among the voting membership appointed by the governor. The elected officers shall serve for one year.\n(a) Except for the commissioner of human services, executive board members must not serve more than two consecutive terms unless service beyond two consecutive terms is approved by the majority of voting members. The commissioner of human services or a designee shall serve until replaced by the governor.\n(b) An executive board member may resign at any time by giving written notice to the executive board.\n(c) The initial term of the member appointed under subdivision 2, paragraph (b), clause (1), is two years. The initial term of the members appointed under subdivision 2, paragraph (b), clause (2), is three years. The initial term of the members appointed under subdivision 2, paragraph (b), clause (3), and the members appointed under subdivision 2, paragraph (c), is four years.\n(d) After the initial term, the term length of all appointed executive board members is four years.\nExecutive board members must recuse themselves from discussion of and voting on an official matter if the executive board member has a conflict of interest. A conflict of interest means an association, including a financial or personal association, that has the potential to bias or have the appearance of biasing an executive board member's decision in matters related to Direct Care and Treatment or the conduct of activities under this chapter.\nThe executive board must meet at least four times per fiscal year at a place and time determined by the executive board.\nA majority of the voting members of the executive board constitutes a quorum. The affirmative vote of a majority of the voting members of the executive board is necessary and sufficient for action taken by the executive board.\n(a) Members of the executive board are immune from civil liability for any act or omission occurring within the scope of the performance of their duties under this chapter.\n(b) When performing executive board duties or actions, members of the executive board are employees of the state for purposes of indemnification under section 3.736, subdivision 9.\n(a) The executive board is authorized to adopt, amend, and repeal rules in accordance with chapter 14 to the extent necessary to implement this chapter or any responsibilities of Direct Care and Treatment specified in state law.\n(b) Until July 1, 2027, the executive board may adopt rules using the expedited rulemaking process in section 14.389.\n(c) In accordance with section 15.039, all orders, rules, delegations, permits, and other privileges issued or granted by the Department of Human Services with respect to any function of Direct Care and Treatment and in effect at the time of the establishment of Direct Care and Treatment shall continue in effect as if such establishment had not occurred. The executive board may amend or repeal rules applicable to Direct Care and Treatment that were established by the Department of Human Services in accordance with chapter 14.\n(d) The executive board must not adopt rules that go into effect or enforce rules prior to July 1, 2025.",
	"repealed": false
}