{
	"id": "62W.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.02",
	"title": "62W.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given.\n\"Aggregate retained rebate\" means the percentage of all rebates received by a pharmacy benefit manager from a drug manufacturer for drug utilization that is not passed on to the pharmacy benefit manager's client.\n\"Claims processing service\" means the administrative services performed in connection with the processing and adjudicating of claims relating to pharmacy services that includes:\n(1) receiving payments for pharmacy services;\n(2) making payments to pharmacists or pharmacies for pharmacy services; or\n(3) both clauses (1) and (2).\n\"Commissioner\" means the commissioner of commerce.\n\"Enrollee\" means a natural person covered by a health plan and includes an insured, policyholder, subscriber, contract holder, member, covered person, or certificate holder.\n\"Health carrier\" has the meaning given in section 62A.011, subdivision 2.\n\"Health plan\" means a policy, contract, certificate, or agreement defined in section 62A.011, subdivision 3.\n\"Mail order pharmacy\" means a pharmacy whose primary business is to receive prescriptions by mail, fax, or through electronic submissions, dispense prescription drugs to enrollees through the use of the United States mail or other common carrier services, and provide consultation with patients electronically rather than face-to-face.\n\"Maximum allowable cost price\" means the maximum amount that a pharmacy benefit manager will reimburse a pharmacy for a group of therapeutically and pharmaceutically equivalent multiple source drugs. The maximum allowable cost price does not include a dispensing or professional fee.\n\"Multiple source drugs\" means a therapeutically equivalent drug that is available from at least two manufacturers.\n\"Network pharmacy\" means a retail or other licensed pharmacy provider that directly contracts with a pharmacy benefit manager.\n\"Other prescription drug or device services\" means services other than claims processing services, provided directly or indirectly, whether in connection with or separate from claims processing services, including:\n(1) negotiating rebates, discounts, or other financial incentives and arrangements with drug manufacturers;\n(2) disbursing or distributing rebates;\n(3) managing or participating in incentive programs or arrangements for pharmacy services;\n(4) negotiating or entering into contractual arrangements with pharmacists or pharmacies, or both;\n(5) developing prescription drug formularies;\n(6) designing prescription benefit programs; or\n(7) advertising or promoting services.\n\"Pharmacist\" means an individual with a valid license issued by the Board of Pharmacy under chapter 151.\n\"Pharmacy\" or \"pharmacy provider\" means a place of business licensed by the Board of Pharmacy under chapter 151 in which prescription drugs are prepared, compounded, or dispensed under the supervision of a pharmacist.\n(a) \"Pharmacy benefit manager\" means a person, business, or other entity that contracts with a plan sponsor to perform pharmacy benefits management, including but not limited to:\n(1) contracting directly or indirectly with pharmacies to provide prescription drugs to enrollees or other covered individuals;\n(2) administering a prescription drug benefit;\n(3) processing or paying pharmacy claims;\n(4) creating or updating prescription drug formularies;\n(5) making or assisting in making prior authorization determinations on prescription drugs;\n(6) administering rebates on prescription drugs; or\n(7) establishing a pharmacy network.\n(b) Pharmacy benefit manager does not include the Department of Human Services.\n\"Plan sponsor\" means a group purchaser as defined under section 62J.03; an employer in the case of an employee health benefit plan established or maintained by a single employer; or an employee organization in the case of a health plan established or maintained by an employee organization, an association, joint board trustees, a committee, or other similar group that establishes or maintains the health plan. This term includes a person or entity acting for a pharmacy benefit manager in a contractual or employment relationship in the performance of pharmacy benefit management. Plan sponsor does not include the Department of Human Services.\n\"Rebates\" means all price concessions paid by a drug manufacturer to a pharmacy benefit manager or plan sponsor, including discounts and other price concessions that are based on the actual or estimated utilization of a prescription drug. Rebates also include price concessions based on the effectiveness of a prescription drug as in a value-based or performance-based contract.\n\"Retail pharmacy\" means a chain pharmacy, a supermarket pharmacy, an independent pharmacy, or a network of independent pharmacies, licensed under chapter 151, that dispenses prescription drugs to the public.\n\"Specialty drug\" means a prescription drug that:\n(1) cannot be routinely dispensed at a majority of retail pharmacies;\n(2) is used to treat chronic and complex, or rare medical conditions;\n(3) has special storage, handling, or distribution requirements that typically cannot be met by a retail pharmacy; and\n(4) meets at least three of the following criteria:\n(i) requires complex and extended patient education and counseling;\n(ii) requires intensive monitoring;\n(iii) requires clinical oversight; and\n(iv) requires product support services.\n\"Specialty pharmacy\" means a pharmacy that specializes in dispensing specialty drugs for patients with serious health conditions requiring complex therapies and high cost biotech and injectable medications. A pharmacy benefit manager or health carrier may require a specialty pharmacy to be accredited as a specialty pharmacy from one of the following accrediting organizations:\n(1) Utilization Review Accreditation Commission (URAC);\n(2) Accreditation Commissioner for Health Care, Inc.; or\n(3) Joint Accreditation Commission.",
	"repealed": false
}