{
	"id": "16B.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.54",
	"title": "16B.54 ENTERPRISE FLEET; ESTABLISHMENT.",
	"text": "The commissioner shall manage an enterprise fleet of passenger motor vehicles and trucks used by state agencies with principal offices in the city of St. Paul and may provide for branch enterprise fleets at other places within the state. For purposes of this section, (1) \"agencies\" includes the Minnesota State Colleges and Universities, (2) \"passenger motor vehicle\" means an on-road vehicle capable of transporting people, and (3) \"truck\" means a pickup or panel truck up to one ton carrying capacity.\n(a) The commissioner may direct an agency to make a transfer of a passenger motor vehicle or truck currently assigned to it. The transfer must be made to the commissioner for use in the enterprise fleet. The commissioner shall reimburse an agency whose motor vehicles have been paid for with funds dedicated by the constitution for a special purpose and which are assigned to the enterprise fleet. The amount of reimbursement for a motor vehicle is its average wholesale price as determined from the midwest edition of the National Automobile Dealers Association official used car guide.\n(b) To the extent that funds are available for the purpose, the commissioner may purchase or otherwise acquire additional passenger motor vehicles and trucks necessary for the enterprise fleet. The title to all motor vehicles assigned to or purchased or acquired for the enterprise fleet is in the name of the Department of Administration.\n(c) On the request of an agency, the commissioner may transfer to the enterprise fleet any passenger motor vehicle or truck for the purpose of disposing of it. The department or agency transferring the vehicle or truck must be paid for it from the motor pool revolving account established by this section in an amount equal to two-thirds of the average wholesale price of the vehicle or truck as determined from the midwest edition of the National Automobile Dealers Association official used car guide.\n(d) The commissioner shall provide for the uniform marking of all motor vehicles. Motor vehicle colors must be selected from the regular color chart provided by the manufacturer each year. The commissioner may further provide for the use of motor vehicles without marking by:\n(1) the governor;\n(2) the lieutenant governor;\n(3) the Division of Criminal Apprehension, the Division of Alcohol and Gambling Enforcement, and arson investigators of the Division of Fire Marshal in the Department of Public Safety;\n(4) the Financial Institutions Division and investigative staff of the Department of Commerce;\n(5) the Division of Disease Prevention and Control of the Department of Health;\n(6) the State Lottery;\n(7) criminal investigators of the Department of Revenue;\n(8) state-owned community service facilities in Direct Care and Treatment;\n(9) the Office of the Attorney General;\n(10) the investigative staff of the Gambling Control Board; and\n(11) the Department of Corrections inmate community work crew program under section 352.91, subdivision 3g.\nThe commissioner is responsible for the control, regulation, acquisition, operation, maintenance, repair, and disposal of all motor vehicles of the enterprise fleet. The commissioner may employ a director and other necessary classified employees for the operation of the enterprise fleet in accordance with chapter 43A.\n(a) Maintenance, repair, storage. The commissioner may contract with the head of an agency or another person operating facilities for the maintenance, repair, and storage of motor vehicles to provide for maintenance, repair, and storage of motor vehicles of the enterprise fleet.\n(b) Appropriation. Money received by the head of an agency under a contract with the commissioner under this subdivision is annually appropriated to the agency for the same purposes as money expended by the agency head for the operation of state-owned facilities for the maintenance, repair, and storage of motor pool vehicles.\nThe motor vehicles in the enterprise fleet are for official state business only. An agency requiring the services of a motor vehicle shall request it from the enterprise fleet on either a temporary or permanent basis. No privately owned motor vehicle may be used for official state business except when authorized by the commissioner.\nAn agency using the facilities of the enterprise fleet shall periodically reimburse the commissioner for the services, in accordance with the schedule of charges the commissioner establishes. This schedule of charges must be based on the costs incurred in operating the enterprise fleet, including reasonable overhead costs, vehicle depreciation, insurance for public liability and property damage, and other costs. The commissioner must retain records and reports and all schedules used as a basis for charging state agencies for the services furnished.\nThis section does not apply to motor vehicles of the State Patrol or the University of Minnesota, or to motor vehicles of any other agency which are specially equipped for the needs of that agency.\n(a) Account established. Money or reimbursements the commissioner receives from the operation of the enterprise fleet is deposited in the state treasury and credited to a motor pool revolving account. Money in the account is annually appropriated to the commissioner to carry out this section. The motor pool revolving account may be used to provide material transfer services to agencies.\n(b) Unobligated excess transferred. When the unobligated amount of money in the state treasury credited to the motor pool revolving account exceeds the average monthly operating expense at the end of the fiscal year, the unobligated amount in excess of one month's operating expense must be transferred to the general fund in the state treasury.",
	"repealed": false
}