{
	"id": "204B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.19",
	"title": "204B.19 ELECTION JUDGES; QUALIFICATIONS.",
	"text": "Except as provided in subdivision 6, any individual who is eligible to vote in this state is qualified to be appointed as an election judge.\n(a) Except as provided in paragraph (b), no individual shall be appointed as an election judge for any precinct if that individual:\n(1) is unable to read, write, or speak the English language;\n(2) is the spouse; parent, including a stepparent; child, including a stepchild; or sibling, including a stepsibling; of any election judge serving in the same precinct or of any candidate at that election;\n(3) is domiciled, either permanently or temporarily, with any candidate on the ballot at that election; or\n(4) is a candidate at that election.\n(b) Individuals who are related to each other as provided in paragraph (a), clause (2), may serve as election judges in the same precinct, provided that they serve on separate shifts that do not run concurrently.\n[Repealed, 1985 c 248 s 37]\nThe appointing authority may establish additional qualifications which are not inconsistent with the provisions of this section and which relate to the ability of an individual to perform the duties of an election judge. The appointing authority may examine any individual who seeks appointment as an election judge to determine whether the individual meets any qualification established under this section.\nNo more than half of the election judges in a precinct may be members of the same major political party unless the election board consists of an odd number of election judges, in which case the number of election judges who are members of the same major political party may be one more than half the number of election judges in that precinct.\n(a) Notwithstanding any other requirements of this section, a student enrolled in a high school in Minnesota or who is in a home school in compliance with sections 120A.22 and 120A.24, who has attained the age of 16 is eligible to be appointed as a without party affiliation trainee election judge in the county in which the student maintains residence, or a county adjacent to the county in which the student maintains residence. The student must meet qualifications for trainee election judges specified in rules of the secretary of state. A student appointed under this subdivision while enrolled in a high school or receiving instruction in a home school may continue to serve as a trainee election judge after the student graduates and until the student reaches the age of 18.\n(b) A student appointed as a trainee election judge may be excused from school attendance during the hours that the student is serving as a trainee election judge if the student submits a written request signed and approved by the student's parent or guardian to be absent from school and a certificate from the appointing authority stating the hours during which the student will serve as a trainee election judge to the principal of the school at least ten days prior to the election. A trainee election judge shall not serve after 10:00 p.m. Notwithstanding section 177.24 to the contrary, trainee election judges may be paid not less than two-thirds of the minimum wage for an employer. The principal of the school may approve a request to be absent from school conditioned on acceptable academic performance at the time of service as a trainee election judge.",
	"repealed": false
}