{
	"id": "115B.406",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.406",
	"title": "115B.406 PRIORITY QUALIFIED FACILITIES.",
	"text": "The legislature recognizes the need to protect the public health and welfare and the environment at priority qualified facilities. To implement a timely and effective cleanup and prevent multiparty litigation, the legislature finds it is in the public interest to direct the commissioner of the Pollution Control Agency to:\n(1) take environmental response actions that the commissioner deems reasonable and necessary to protect the public health or welfare or the environment at priority qualified facilities;\n(2) acquire real property interests at priority qualified facilities to ensure the completion and long-term effectiveness of environmental response actions; and\n(3) prevent both an unjust financial windfall to and double liability of owners and operators of priority qualified facilities.\nWithin 30 days after May 31, 2017, or within 30 days after section 115B.39, subdivision 2, paragraph (m), applies to a facility, whichever is later, the commissioner must notify the owner or operator of a qualified facility that the facility is a priority qualified facility under section 115B.39, subdivision 2, paragraph (m). Within 60 days after being notified under this subdivision, the owner or operator of a priority qualified facility must enter into a binding agreement with the commissioner according to section 115B.40, subdivision 4, paragraph (b).\nIf the owner or operator of a priority qualified facility fails to enter into a binding agreement according to subdivision 2:\n(1) the commissioner must assume all obligations for environmental response actions under the federal Superfund Act and any federal or state cleanup orders and undertake further action under section 115B.40, subdivision 1, at or related to the priority qualified facility that the commissioner deems reasonable and necessary;\n(2) the commissioner must not seek recovery against responsible persons who are not the owner or operator of a priority qualified facility of any costs incurred by the commissioner for environmental response action at or related to the facility, except as provided under section 115B.40, subdivision 7, paragraph (b), clause (2), item (i) or (ii); and\n(3) the commissioner and the attorney general must communicate with the United States Environmental Protection Agency regarding the manner and procedure for the state's assumption of federal obligations at the priority qualified facility.\nAn owner or operator of a priority qualified facility is subject to a civil penalty in an amount to be determined by the court of not more than $20,000 per day for each day that the owner or operator fails to comply with subdivision 2. The penalty ceases to accrue when the owner or operator enters into a binding agreement with the commissioner according to section 115B.40, subdivision 4, paragraph (b), and a payment agreement for environmental response costs incurred by the commissioner at or related to the priority qualified facility. The civil penalty may be recovered by an action brought by the attorney general in the name of the state in connection with an action to recover expenses of the agency under subdivision 7 or by a separate action in the District Court of Ramsey County. All penalties recovered under this subdivision must be deposited in the remediation fund.\nIf an owner or operator of a priority qualified facility that is not a local government unit fails to comply with subdivision 2, the owner or operator is ineligible to obtain or renew a state or local permit or license to engage in a business that manages solid waste. Failure of an owner or operator of a priority qualified facility that is not a local government unit to comply with subdivision 2 is prima facie evidence of the lack of fitness of the owner or operator to conduct any solid waste business and is grounds for revocation of any solid waste permit or license held by the owner or operator.\nAny person that the commissioner determines has information regarding the priority qualified facility or the owner or operator of the priority qualified facility must furnish to the commissioner any information that person may have or may reasonably obtain that is relevant to the priority qualified facility or the owner or operator of the priority qualified facility. The commissioner upon presentation of credentials may examine and copy any books, papers, records, memoranda, or data of a person that has a duty to provide information to the commissioner and may enter upon any property, public or private, to take any action authorized by this section, including obtaining information from a person that has a duty to provide the information.\nAny reasonable and necessary expenses incurred by the commissioner pursuant to this section, including all environmental response costs and administrative and legal expenses, may be recovered in a civil action brought by the attorney general against the owner or operator of a priority qualified facility. The commissioner's certification of expenses is prima facie evidence that the expenses are reasonable and necessary. Any expenses incurred pursuant to this section that are recovered by the attorney general, including any award of attorney fees, must be deposited in the remediation fund.\nThe owner or operator of a priority qualified facility is barred from bringing any claim based on contract, tort, or statute or using any remedy available under any other provision of state law, including common law, for personal injury, disease, economic loss, environmental response costs incurred by the owner or operator, environmental response costs incurred by the state, or legal and administrative expenses arising out of a release or threat of release of any hazardous substance, pollutant, contaminant, or decomposition gases related to the priority qualified facility.\n(a) All environmental response costs and reasonable and necessary expenses, including administrative and legal expenses, incurred by the commissioner at a priority qualified facility constitute a lien in favor of the state upon any real property located in the state, other than homestead property, owned by the owner or operator of the priority qualified facility who is subject to the requirements of section 115B.40, subdivision 4 or 5. Notwithstanding section 514.672, a lien under this paragraph continues until the lien is satisfied or is released according to paragraph (c).\n(b) If the commissioner conducts an environmental response action at a priority qualified facility and the environmental response action increases the fair market value of the facility above the fair market value of the facility that existed before the response action was initiated, then the state has a lien on the facility for the increase in fair market value of the property attributable to the response action, valued at the time that construction of the final environmental response action was completed, not including operation and maintenance. Notwithstanding section 514.672, a lien under this paragraph continues until the lien is satisfied or is released according to paragraph (c).\n(c) A lien under paragraph (a) or (b) attaches when the environmental response costs are first incurred. Notice, filing, release, and enforcement of the lien are governed by sections 514.671 to 514.676, except where those requirements specifically are related to only cleanup action expenses as defined in section 514.671. The commissioner may release a lien under this subdivision if the commissioner determines that attachment or enforcement of the lien is not in the public interest. A lien under this subdivision is not subject to the foreclosure limitation described in section 514.674, subdivision 2. Relative priority of a lien under this subdivision is governed by section 514.672, except that a lien attached to property that was included in any permit for the priority qualified facility takes precedence over all other liens regardless of when the other liens were or are perfected. Amounts received to satisfy all or a part of a lien must be deposited in the remediation fund. An environmental lien notice for a lien under paragraph (a) or (b) must state that it is a lien in accordance with this section and identify whether the property described in the notice was included in any permit for the priority qualified facility.",
	"repealed": false
}