{
	"id": "17.4983",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.4983",
	"title": "17.4983 AQUATIC FARM OPERATIONS.",
	"text": "Aquatic life legally possessed may be bought, acquired, and sold by licensed facilities as provided in sections 17.4981 to 17.4997.\n(a) The commissioner may sell aquatic life to licensed facilities at fair wholesale market value. Fair wholesale market value must be determined by the average market price charged in this state and contiguous states and provinces for similar quantities.\n(b) The commissioner shall establish procedures to make aquatic life available to licensed facilities if state aquatic life would otherwise die or go to waste, such as in cases of winterkill lakes, waters where piscicides will be applied, and waters subject to extreme draw-down. The public must be given angling opportunities if public access is available.\n(c) The commissioner shall attempt to provide opportunities to make brood stock available to licensed facilities to reduce reliance on out-of-state sources without causing adverse impacts to game fish and native rough fish populations.\n(d) If the commissioner denies approval to obtain aquatic life outside the state, a written notice must be submitted to the applicant stating the reasons for denial, and the commissioner shall:\n(1) designate approved sources if available to obtain the desired aquatic life; or\n(2) sell the aquatic life from state hatcheries at fair wholesale market value if there is a surplus from state operations.\nLicensed facilities may use all reasonable methods to operate and harvest aquatic life from licensed facilities, including available nets.\nThe discharge from an aquatic farm must comply with discharge permits required by the Minnesota Pollution Control Agency.\n(a) Notwithstanding other provisions of law, aquatic life lawfully acquired and possessed by a licensed facility is private aquatic life and property of the owner of the licensed facility.\n(b) The state may not seize or otherwise confiscate private aquatic life without due process of law, except that private aquatic life in public waters may become property of the state if the waters are not part of a licensed facility. The commissioner shall notify the licensee that the aquatic life in a facility that is no longer licensed will become property of the state if the aquatic life is not removed. If the licensee does not respond in writing within 30 days after receiving the notice and make alternative arrangements, or does not remove the aquatic life by 60 ice-free days after receiving the notice, the private aquatic life becomes property of the state.\n(c) Private aquatic life that is transferred to the state or released into public waters that are not part of a licensed facility is owned by the state and may be considered wildlife.\n(a) If the public cannot legally access waters of the state that are part of a licensed aquatic farm except by permission of the licensee, the use of the waters by the public is subject to restriction by the licensee.\n(b) Waters of the state may not be licensed for aquaculture use to more than one licensee.\nA person may not take fish by angling from waters subject to subdivision 6 unless the person has written permission from the licensee and:\n(1) has an invoice when in possession of fish; or\n(2) takes fish under an angling license, subject to the limits and conditions in the game and fish laws.\nA person may not knowingly damage, disturb, or interfere with legal aquatic farm operations.",
	"repealed": false
}