{
	"id": "16B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.48",
	"title": "16B.48 GENERAL SERVICES REVOLVING FUNDS.",
	"text": "Fees prescribed under section 16B.51, for the rendering of the services provided in that section are deposited in the state treasury by the collecting agency and credited to the general services revolving fund.\nMoney in the state treasury credited to the general services revolving fund and money that is deposited in the fund is appropriated annually to the commissioner for the following purposes:\n(1) to operate the central mailing service, including purchasing postage and related items and refunding postage deposits;\n(2) to operate a documents service as prescribed by section 16B.51;\n(3) to provide services for the maintenance, operation, and upkeep of buildings and grounds managed by the commissioner of administration;\n(4) to provide analytical, statistical, and organizational development services to state agencies, local units of government, metropolitan and regional agencies, and school districts; and\n(5) to perform services for any other agency. Money may be expended for this purpose only when directed by the governor. The agency receiving the services shall reimburse the fund for their cost, and the commissioner shall make the appropriate transfers when requested. The term \"services\" as used in this clause means compensation paid officers and employees of the state government; supplies, materials, equipment, and other articles and things used by or furnished to an agency; and utility services and other services for the maintenance, operation, and upkeep of buildings and offices of the state government.\n[Repealed, 2005 c 156 art 5 s 24]\nExcept as specifically provided otherwise by law, each agency shall reimburse the general services revolving funds for the cost of all services, supplies, materials, labor, and depreciation of equipment, including reasonable overhead costs, which the commissioner is authorized and directed to furnish an agency. The cost of all publications or other materials produced by the commissioner and financed from the general services revolving fund must include reasonable overhead costs. The commissioner of administration shall report the rates to be charged for the general services revolving funds no later than July 1 each year to the chair of the committee or division in the senate and house of representatives with primary jurisdiction over the budget of the Department of Administration. The commissioner of management and budget shall make appropriate transfers to the revolving funds described in this section when requested by the commissioner of administration. The commissioner of administration may make allotments, encumbrances, and, with the approval of the commissioner of management and budget, disbursements in anticipation of such transfers. In addition, the commissioner of administration, with the approval of the commissioner of management and budget, may require an agency to make advance payments to the revolving funds in this section sufficient to cover the agency's estimated obligation for a period of at least 60 days. All reimbursements and other money received by the commissioner of administration under this section must be deposited in the appropriate revolving fund. Any earnings remaining in the fund established to account for the documents service prescribed by section 16B.51 at the end of each fiscal year not otherwise needed for present or future operations, as determined by the commissioners of administration and management and budget, must be transferred to the general fund.\nIf the general services revolving funds are abolished or liquidated, the total net profit from the operation of each fund must be distributed to the various funds from which purchases were made. The amount to be distributed to each fund must bear to the net profit the same ratio as the total purchases from each fund bears to the total purchases from all the funds during the same period of time.",
	"repealed": false
}