{
	"id": "299C.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.106",
	"title": "299C.106 SEXUAL ASSAULT EXAMINATION KIT HANDLING.",
	"text": "(a) As used in this section, the terms in this subdivision have the meanings given.\n(b) \"Forensic laboratory\" has the meaning given in section 299C.157, subdivision 1, clause (2).\n(c) \"Patient\" has the meaning given in section 144.291, subdivision 2, paragraph (g), and means a person who consents to a sexual assault examination.\n(d) \"Release form\" means a document provided by the hospital to the patient at the time of the sexual assault examination that gives the patient the option of authorizing, in writing, the release of the kit to law enforcement.\n(e) \"Restricted sexual assault examination kit\" means a kit that does not have an accompanying release form signed by the patient authorizing law enforcement to submit the kit to a forensic laboratory. A health care professional shall provide the patient with information about how to convert a restricted sexual assault examination kit to unrestricted status.\n(f) \"Sexual assault examination kit\" means a collection of evidence, including biological material, gathered from a patient by a health care professional.\n(g) \"Submitted sexual assault examination kit\" means an unrestricted kit that has been submitted by law enforcement to a forensic laboratory.\n(h) \"Unrestricted sexual assault examination kit\" means a kit that has an accompanying release form signed by the patient allowing law enforcement to submit the kit to a forensic laboratory.\n(i) \"Unsubmitted sexual assault examination kit\" means an unrestricted kit that has not been submitted by law enforcement to a forensic laboratory.\nWhen a sexual assault examination is performed, evidence is collected, and the patient requests that law enforcement officials be notified and signs a release form, the individual performing the examination, or the individual's designee, shall notify the appropriate law enforcement agency of the collection of the evidence in an unrestricted sexual assault examination kit. The agency must retrieve an unrestricted sexual assault examination kit from the health care professional within ten days of receiving notice that the kit is available for transfer. Notification to the agency shall be made in writing, by telephone, or by electronic communication.\n(a) Within 60 days of receiving an unrestricted sexual assault examination kit, a law enforcement agency shall submit the kit for testing to a forensic laboratory. The testing laboratory shall return unrestricted sexual assault examination kits to the submitting agency for storage after testing is complete. The submitting agency must store unrestricted sexual assault examination kits indefinitely.\n(b) Within 60 days of a hospital preparing a restricted sexual assault examination kit or a law enforcement agency receiving a restricted sexual assault examination kit from a hospital, the hospital or the agency shall submit the kit to the Bureau of Criminal Apprehension. The bureau shall store all restricted sexual assault examination kits collected by hospitals or law enforcement agencies in the state. The bureau shall retain a restricted sexual assault examination kit for at least 30 months from the date the bureau receives the kit.\n(c) Beginning July 1, 2024, the receiving forensic laboratory must strive to test the sexual assault examination kit within 90 days of receipt from a hospital or law enforcement agency. Sexual assault examination kits shall be prioritized for testing along with other violent crimes. Upon completion of testing, the forensic laboratory must update the kit-tracking database to indicate that testing is complete. The forensic laboratory must notify the submitting agency when any kit is not tested within 90 days and provide an estimated time frame for testing completion.\n(d) Paragraph (c) sunsets June 30, 2029.\nThe superintendent of the Bureau of Criminal Apprehension shall develop a uniform sexual assault examination kit consent form. The form must clearly explain the differences between designating a kit as unrestricted or restricted. In developing and designing the consent form, the superintendent must consult with hospital administrators, sexual assault nurse examiners, the Minnesota Coalition Against Sexual Assault, and other stakeholders. The uniform consent form shall be widely distributed to law enforcement agencies, medical providers, and other stakeholders. The superintendent must make the form available on the bureau's website.\nThe commissioner, in consultation with the commissioner of administration, must maintain a website with a searchable database providing sexual assault victims with information on the status of their individual sexual assault examination kit. The superintendent must strictly control access to the database to protect the privacy of the victims' data.\nFailure to meet a deadline established in this section is not a basis for dismissal of a criminal action or a bar to the admissibility of the evidence in a criminal action.",
	"repealed": false
}