{
	"id": "290C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.03",
	"title": "290C.03 ELIGIBILITY REQUIREMENTS.",
	"text": "(a) Land may be enrolled in the sustainable forest incentive program under this chapter if all of the following conditions are met:\n(1) the land consists of at least 20 contiguous acres and at least 50 percent of the land must meet the definition of forest land in section 88.01, subdivision 7, during the enrollment;\n(2) a forest management plan for the land must be prepared by an approved plan writer and implemented during the period in which the land is enrolled;\n(3) timber harvesting and forest management guidelines must be used in conjunction with any timber harvesting or forest management activities conducted on the land during the period in which the land is enrolled;\n(4) the land must be enrolled for a minimum of eight years;\n(5) there are no delinquent property taxes on the land;\n(6) claimants enrolling more than 1,920 acres or enrolling any land that is subject to a conservation easement funded under section 97A.056, or a comparable permanent easement conveyed to a governmental or nonprofit entity in the sustainable forest incentive program must allow year-round, nonmotorized access to fish and wildlife resources and motorized access on established and maintained roads and trails, unless the road or trail is temporarily closed for safety, natural resource, or road damage reasons on enrolled land except within one-fourth mile of a permanent dwelling or during periods of high fire hazard as determined by the commissioner of natural resources;\n(7) the claimant has registered the forest management plan under clause (2) with the commissioner of natural resources, who has determined that the land meets qualifications for enrollment and has issued the claimant a registration number; and\n(8) no portion of the tax parcel containing the enrolled land is classified as class 2c managed forest land.\n(b) Claimants required to allow access under paragraph (a), clause (6), do not by that action:\n(1) extend any assurance that the land is safe for any purpose;\n(2) confer upon the person the legal status of an invitee or licensee to whom a duty of care is owed; or\n(3) assume responsibility for or incur liability for any injury to the person or property caused by an act or omission of the person.\n(c) The commissioner of natural resources shall annually provide county assessors verification information regarding plan registration under paragraph (a), clause (7), on a timely basis.\n(d) A minimum of three acres must be excluded from enrolled land when the land is improved with a structure that is not a minor, ancillary, and nonresidential structure.\n(e) An entire tax parcel is ineligible to be enrolled in the program if land contained within the parcel does not meet the definition of forest land in section 290C.02, subdivision 6, for any of the following reasons:\n(1) the land is subject to the Minnesota agricultural property tax under section 273.111; or\n(2) the land is subject to agricultural land preservation controls or restrictions as defined in section 40A.02, or the Metropolitan Agricultural Preserves Act under chapter 473H.\n(f) Any acres enrolled in a state or federal conservation reserve or easement program under sections 103F.501 to 103F.531 are ineligible for inclusion in the program under this chapter.",
	"repealed": false
}