{
	"id": "256B.0625",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0625",
	"title": "256B.0625 COVERED SERVICES.",
	"text": "(a) Medical assistance covers inpatient hospital services performed by hospitals holding Medicare certifications for the services performed.\n(b) When determining medical necessity for inpatient hospital services, the medical review agent shall follow industry standard medical necessity criteria in determining the following:\n(1) whether a recipient's admission is medically necessary;\n(2) whether the inpatient hospital services provided to the recipient were medically necessary;\n(3) whether the recipient's continued stay was or will be medically necessary; and\n(4) whether all medically necessary inpatient hospital services were provided to the recipient.\nThe medical review agent will determine medical necessity of inpatient hospital services, including inpatient psychiatric treatment, based on a review of the patient's medical condition and records, in conjunction with industry standard evidence-based criteria to ensure consistent and optimal application of medical appropriateness criteria.\nMedical assistance does not cover visits to a hospital emergency room that are not for emergency and emergency poststabilization care or urgent care, and does not pay for any services provided in a hospital emergency room that are not for emergency and emergency poststabilization care or urgent care.\n(a) Medical assistance covers skilled nursing home services and services of intermediate care facilities, including training and habilitation services, as defined in section 252.41, subdivision 3, for persons with developmental disabilities who are residing in intermediate care facilities for persons with developmental disabilities. Medical assistance must not be used to pay the costs of nursing care provided to a patient in a swing bed as defined in section 144.562, unless (1) the facility in which the swing bed is located is eligible as a sole community provider, as defined in Code of Federal Regulations, title 42, section 412.92, or the facility is a public hospital owned by a governmental entity with 15 or fewer licensed acute care beds; (2) the Centers for Medicare and Medicaid Services approves the necessary state plan amendments; (3) the patient was screened as provided by law; (4) the patient no longer requires acute care services; and (5) no nursing home beds are available within 25 miles of the facility. The commissioner shall exempt a facility from compliance with the sole community provider requirement in clause (1) if, as of January 1, 2004, the facility had an agreement with the commissioner to provide medical assistance swing bed services.\n(b) Medical assistance also covers up to ten days of nursing care provided to a patient in a swing bed if: (1) the patient's physician, advanced practice registered nurse, or physician assistant certifies that the patient has a terminal illness or condition that is likely to result in death within 30 days and that moving the patient would not be in the best interests of the patient and patient's family; (2) no open nursing home beds are available within 25 miles of the facility; and (3) no open beds are available in any Medicare hospice program within 50 miles of the facility. The daily medical assistance payment for nursing care for the patient in the swing bed is the statewide average medical assistance skilled nursing care per diem as computed annually by the commissioner on July 1 of each year.\nMedical assistance covers skilled nursing facility services for individuals eligible for both medical assistance and Medicare who have waived the Medicare skilled nursing facility room and board benefit and have enrolled in the Medicare hospice program. Medical assistance covers skilled nursing facility services regardless of whether an individual enrolled in the Medicare hospice program prior to, on, or after the date of the hospitalization that qualified the individual for Medicare skilled nursing facility services.\n(a) Medical assistance covers physicians' services.\n(b) Rates paid for anesthesiology services provided by physicians shall be according to the formula utilized in the Medicare program and shall use a conversion factor \"at percentile of calendar year set by legislature,\" except that rates paid to physicians for the medical direction of a certified registered nurse anesthetist shall be the same as the rate paid to the certified registered nurse anesthetist under medical direction.\n(c) Medical assistance does not cover physicians' services related to the provision of care related to a treatment reportable under section 144.7065, subdivision 2, clauses (1), (2), (3), and (5), and subdivision 7, clause (1).\n(d) Medical assistance does not cover physicians' services related to the provision of care (1) for which hospital reimbursement is prohibited under section 256.969, subdivision 3b, paragraph (c), or (2) reportable under section 144.7065, subdivisions 2 to 7, if the physicians' services are billed by a physician who delivered care that contributed to or caused the adverse health care event or hospital-acquired condition.\n(e) The payment limitations in this subdivision shall also apply to MinnesotaCare.\n(f) A physician shall not bill a recipient of services for any payment disallowed under this subdivision.\nMedical assistance covers gender-affirming care, as defined in section 62Q.585.\n(a) Medical assistance covers medically necessary services and consultations delivered by a health care provider through telehealth in the same manner as if the service or consultation was delivered through in-person contact. Services or consultations delivered through telehealth shall be paid at the full allowable rate.\n(b) The commissioner may establish criteria that a health care provider must attest to in order to demonstrate the safety or efficacy of delivering a particular service through telehealth. The attestation may include that the health care provider:\n(1) has identified the categories or types of services the health care provider will provide through telehealth;\n(2) has written policies and procedures specific to services delivered through telehealth that are regularly reviewed and updated;\n(3) has policies and procedures that adequately address patient safety before, during, and after the service is delivered through telehealth;\n(4) has established protocols addressing how and when to discontinue telehealth services; and\n(5) has an established quality assurance process related to delivering services through telehealth.\n(c) As a condition of payment, a licensed health care provider must document each occurrence of a health service delivered through telehealth to a medical assistance enrollee. Health care service records for services delivered through telehealth must meet the requirements set forth in Minnesota Rules, part 9505.2175, subparts 1 and 2, and must document:\n(1) the type of service delivered through telehealth;\n(2) the time the service began and the time the service ended, including an a.m. and p.m. designation;\n(3) the health care provider's basis for determining that telehealth is an appropriate and effective means for delivering the service to the enrollee;\n(4) the mode of transmission used to deliver the service through telehealth and records evidencing that a particular mode of transmission was utilized;\n(5) the location of the originating site and the distant site;\n(6) if the claim for payment is based on a physician's consultation with another physician through telehealth, the written opinion from the consulting physician providing the telehealth consultation; and\n(7) compliance with the criteria attested to by the health care provider in accordance with paragraph (b).\n(d) Telehealth visits provided through audio and visual communication or accessible video-based platforms may be used to satisfy the face-to-face requirement for reimbursement under the payment methods that apply to a federally qualified health center, rural health clinic, Indian health service, 638 tribal clinic, and certified community behavioral health clinic, if the service would have otherwise qualified for payment if performed in person.\n(e) For purposes of this subdivision, unless otherwise covered under this chapter:\n(1) \"telehealth\" means the delivery of health care services or consultations using real-time two-way interactive audio and visual communication or accessible telehealth video-based platforms to provide or support health care delivery and facilitate the assessment, diagnosis, consultation, treatment, education, and care management of a patient's health care. Telehealth includes: the application of secure video conferencing consisting of a real-time, full-motion synchronized video; store-and-forward technology; and synchronous interactions, between a patient located at an originating site and a health care provider located at a distant site. Telehealth does not include communication between health care providers, or between a health care provider and a patient that consists solely of an audio-only communication, email, or facsimile transmission or as specified by law;\n(2) \"health care provider\" means a health care provider as defined under section 62A.673; a community paramedic as defined under section 144E.001, subdivision 5f; a community health worker who meets the criteria under subdivision 49, paragraph (a); a mental health certified peer specialist under section 245I.04, subdivision 10; a mental health certified family peer specialist under section 245I.04, subdivision 12; a mental health rehabilitation worker under section 245I.04, subdivision 14; a mental health behavioral aide under section 245I.04, subdivision 16; a treatment coordinator under section 245G.11, subdivision 7; an alcohol and drug counselor under section 245G.11, subdivision 5; or a recovery peer under section 245G.11, subdivision 8; and\n(3) \"originating site,\" \"distant site,\" and \"store-and-forward technology\" have the meanings given in section 62A.673, subdivision 2.\n(a) The commissioner, after receiving recommendations from professional physician associations, professional associations representing licensed nonphysician health care professionals, and consumer groups, shall establish a 14-member Health Services Advisory Council, which consists of 13 voting members and one nonvoting member. The Health Services Advisory Council shall advise the commissioner regarding (1) health services pertaining to the administration of health care benefits covered under Minnesota health care programs (MHCP); and (2) evidence-based decision-making and health care benefit and coverage policies for MHCP. The Health Services Advisory Council shall consider available evidence regarding quality, safety, and cost-effectiveness when advising the commissioner. The Health Services Advisory Council shall meet at least quarterly. The Health Services Advisory Council shall annually select a chair from among its members who shall work directly with the commissioner's medical director to establish the agenda for each meeting. The Health Services Advisory Council may recommend criteria for verifying centers of excellence for specific aspects of medical care where a specific set of combined services, a volume of patients necessary to maintain a high level of competency, or a specific level of technical capacity is associated with improved health outcomes.\n(b) The commissioner shall establish a dental subcouncil to operate under the Health Services Advisory Council. The dental subcouncil consists of general dentists, dental specialists, safety net providers, dental hygienists, health plan company and county and public health representatives, health researchers, consumers, and a designee of the commissioner of health. The dental subcouncil shall advise the commissioner regarding:\n(1) the critical access dental program under section 256B.76, subdivision 4, including but not limited to criteria for designating and terminating critical access dental providers;\n(2) any changes to the critical access dental provider program necessary to comply with program expenditure limits;\n(3) dental coverage policy based on evidence, quality, continuity of care, and best practices;\n(4) the development of dental delivery models; and\n(5) dental services to be added or eliminated from subdivision 9.\n(c) The Health Services Advisory Council may monitor and track the practice patterns of health care providers who serve MHCP recipients under fee-for-service, managed care, and county-based purchasing. The monitoring and tracking shall focus on services or specialties for which there is a high variation in utilization or quality across providers, or which are associated with high medical costs. The commissioner, based upon the findings of the Health Services Advisory Council, may notify providers whose practice patterns indicate below average quality or higher than average utilization or costs. Managed care and county-based purchasing plans shall provide the commissioner with utilization and cost data necessary to implement this paragraph, and the commissioner shall make these data available to the Health Services Advisory Council.\n(a) The Health Services Advisory Council consists of:\n(1) six voting members who are licensed physicians actively engaged in the practice of medicine in Minnesota, three of whom must represent health plans currently under contract to serve MHCP recipients;\n(2) two voting members who are licensed physician specialists actively practicing their specialty in Minnesota;\n(3) two voting members who are nonphysician health care professionals licensed or registered in their profession and actively engaged in their practice of their profession in Minnesota;\n(4) one voting member who is a health care or mental health professional licensed or registered in the member's profession, actively engaged in the practice of the member's profession in Minnesota, and actively engaged in the treatment of persons with mental illness;\n(5) two consumers who shall serve as voting members; and\n(6) the commissioner's medical director who shall serve as a nonvoting member.\n(b) Members of the Health Services Advisory Council shall not be employed by the state of Minnesota, except for the medical director. A quorum shall comprise a simple majority of the voting members. Vacant seats shall not count toward a quorum.\nMembers shall serve staggered three-year terms, with one-third of the voting members' terms expiring annually. Members may be reappointed by the commissioner. The commissioner may require more frequent Health Services Advisory Council meetings as needed. An honorarium of $200 per meeting and reimbursement for mileage and parking shall be paid to each council member in attendance except the medical director. The Health Services Advisory Council does not expire as provided in section 15.059, subdivision 6.\nCircumcision is not covered, unless the procedure is medically necessary.\n(a) The commissioner shall implement a program to reduce the number of elective inductions of labor prior to 39 weeks' gestation. In this subdivision, the term \"elective induction of labor\" means the use of artificial means to stimulate labor in a woman without the presence of a medical condition affecting the woman or the child that makes the onset of labor a medical necessity. The program must promote the implementation of policies within hospitals providing services to recipients of medical assistance or MinnesotaCare that prohibit the use of elective inductions prior to 39 weeks' gestation, and adherence to such policies by the attending providers.\n(b) For all births covered by medical assistance or MinnesotaCare on or after January 1, 2012, a payment for professional services associated with the delivery of a child in a hospital must not be made unless the provider has submitted information about the nature of the labor and delivery including any induction of labor that was performed in conjunction with that specific birth. The information must be on a form prescribed by the commissioner.\n(c) The requirements in paragraph (b) must not apply to deliveries performed at a hospital that has policies and processes in place that have been approved by the commissioner which prohibit elective inductions prior to 39 weeks' gestation. A process for review of hospital induction policies must be established by the commissioner and review of policies must occur at the discretion of the commissioner. The commissioner's decision to approve or rescind approval must include verification and review of items including, but not limited to:\n(1) policies that prohibit use of elective inductions for gestation less than 39 weeks;\n(2) policies that encourage providers to document and communicate with patients a final expected date of delivery by 20 weeks' gestation that includes data from ultrasound measurements as applicable;\n(3) policies that encourage patient education regarding elective inductions, and requires documentation of the processes used to educate patients;\n(4) ongoing quality improvement review as determined by the commissioner; and\n(5) any data that has been collected by the commissioner.\n(d) All hospitals must report annually to the commissioner induction information for all births that were covered by medical assistance or MinnesotaCare in a format and manner to be established by the commissioner.\n(e) The commissioner at any time may choose not to implement or may discontinue any or all aspects of the program if the commissioner is able to determine that hospitals representing at least 90 percent of births covered by medical assistance or MinnesotaCare have approved policies in place.\n(f) The commissioner of human services may discontinue the evidence-based childbirth program and shall discontinue all affiliated reporting requirements established under this subdivision once the commissioner determines that hospitals representing at least 90 percent of births covered by medical assistance or MinnesotaCare have approved policies and processes in place that prohibit elective inductions prior to 39 weeks' gestation.\n(a) Medical assistance covers telemonitoring services if:\n(1) the telemonitoring service is medically appropriate based on the recipient's medical condition or status;\n(2) the recipient's health care provider has identified that telemonitoring services would likely prevent the recipient's admission or readmission to a hospital, emergency room, or nursing facility;\n(3) the recipient is cognitively and physically capable of operating the monitoring device or equipment, or the recipient has a caregiver who is willing and able to assist with the monitoring device or equipment; and\n(4) the recipient resides in a setting that is suitable for telemonitoring and not in a setting that has health care staff on site.\n(b) For purposes of this subdivision, \"telemonitoring services\" means the remote monitoring of data related to a recipient's vital signs or biometric data by a monitoring device or equipment that transmits the data electronically to a provider for analysis. The assessment and monitoring of the health data transmitted by telemonitoring must be performed by one of the following licensed health care professionals: physician, podiatrist, registered nurse, advanced practice registered nurse, physician assistant, respiratory therapist, or licensed professional working under the supervision of a medical director.\nMedical assistance covers outpatient hospital or physician-directed clinic services. The physician-directed clinic staff shall include at least two physicians and all services shall be provided under the direct supervision of a physician. Hospital outpatient departments are subject to the same limitations and reimbursements as other enrolled vendors for all services, except initial triage, emergency services, and services not provided or immediately available in clinics, physicians' offices, or by other enrolled providers. \"Emergency services\" means those medical services required for the immediate diagnosis and treatment of medical conditions that, if not immediately diagnosed and treated, could lead to serious physical or mental disability or death or are necessary to alleviate severe pain. Neither the hospital, its employees, nor any physician or dentist, shall be liable in any action arising out of a determination not to render emergency services or care if reasonable care is exercised in determining the condition of the person, or in determining the appropriateness of the facilities, or the qualifications and availability of personnel to render these services consistent with this section.\nCertain surgeries require a second medical opinion to confirm the necessity of the procedure, in order for reimbursement to be made. The commissioner shall publish in the State Register a list of surgeries that require a second medical opinion and the criteria and standards for deciding whether a surgery should require a second medical opinion. The list and the criteria and standards are not subject to the requirements of sections 14.01 to 14.69. The commissioner's decision about whether a second medical opinion is required, made according to rules governing that decision, is not subject to administrative appeal.\nMedical assistance covers community mental health center services provided by a community mental health center that meets the requirements in paragraphs (a) to (j).\n(a) The provider must be certified as a mental health clinic under section 245I.20.\n(b) In addition to the policies and procedures required by section 245I.03, the provider must establish, enforce, and maintain the policies and procedures for oversight of clinical services by a doctoral-level psychologist or a board-certified or board-eligible psychiatrist. These policies and procedures must be developed with the involvement of a doctoral-level psychologist and a board-certified or board-eligible psychiatrist, and must include:\n(1) requirements for when to seek clinical consultation with a doctoral-level psychologist or a board-certified or board-eligible psychiatrist;\n(2) requirements for the involvement of a doctoral-level psychologist or a board-certified or board-eligible psychiatrist in the direction of clinical services; and\n(3) involvement of a doctoral-level psychologist or a board-certified or board-eligible psychiatrist in quality improvement initiatives and review as part of a multidisciplinary care team.\n(c) The provider must be a private nonprofit corporation or a governmental agency and have a community board of directors as specified by section 245.66.\n(d) The provider must have a sliding fee scale that meets the requirements in section 245.481, and agree to serve within the limits of its capacity all individuals residing in its service delivery area.\n(e) At a minimum, the provider must provide the following outpatient mental health services: diagnostic assessment; explanation of findings; family, group, and individual psychotherapy, including crisis intervention psychotherapy services, psychological testing, and medication management. In addition, the provider must provide or be capable of providing upon request of the local mental health authority day treatment services, multiple family group psychotherapy, and professional home-based mental health services. The provider must have the capacity to provide such services to specialized populations such as the elderly, families with children, persons who are seriously and persistently mentally ill, and children who are seriously emotionally disturbed.\n(f) The provider must be capable of providing the services specified in paragraph (e) to individuals who are dually diagnosed with mental illness or emotional disturbance, and substance use disorder, and to individuals who are dually diagnosed with a mental illness or emotional disturbance and developmental disability.\n(g) The provider must provide 24-hour emergency care services or demonstrate the capacity to assist recipients in need of such services to access such services on a 24-hour basis.\n(h) The provider must have a contract with the local mental health authority to provide one or more of the services specified in paragraph (e).\n(i) The provider must agree, upon request of the local mental health authority, to enter into a contract with the county to provide mental health services not reimbursable under the medical assistance program.\n(j) The provider may not be enrolled with the medical assistance program as both a hospital and a community mental health center. The community mental health center's administrative, organizational, and financial structure must be separate and distinct from that of the hospital.\n(k) The commissioner may require the provider to annually attest that the provider meets the requirements in this subdivision using a form that the commissioner provides.\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\n[Repealed, 2007 c 147 art 5 s 41]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) Medical assistance covers services provided by a not-for-profit certified community behavioral health clinic (CCBHC) that meets the requirements of section 245.735, subdivision 3.\n(b) The commissioner shall reimburse CCBHCs on a per-day basis for each day that an eligible service is delivered using the CCBHC daily bundled rate system for medical assistance payments as described in paragraph (c). The commissioner shall include a quality incentive payment in the CCBHC daily bundled rate system as described in paragraph (e). There is no county share for medical assistance services when reimbursed through the CCBHC daily bundled rate system.\n(c) The commissioner shall ensure that the CCBHC daily bundled rate system for CCBHC payments under medical assistance meets the following requirements:\n(1) the CCBHC daily bundled rate shall be a provider-specific rate calculated for each CCBHC, based on the daily cost of providing CCBHC services and the total annual allowable CCBHC costs divided by the total annual number of CCBHC visits. For calculating the payment rate, total annual visits include visits covered by medical assistance and visits not covered by medical assistance. Allowable costs include but are not limited to the salaries and benefits of medical assistance providers; the cost of CCBHC services provided under section 245.735, subdivision 3, paragraph (a), clauses (6) and (7); and other costs such as insurance or supplies needed to provide CCBHC services;\n(2) payment shall be limited to one payment per day per medical assistance enrollee when an eligible CCBHC service is provided. A CCBHC visit is eligible for reimbursement if at least one of the CCBHC services listed under section 245.735, subdivision 3, paragraph (a), clause (6), is furnished to a medical assistance enrollee by a health care practitioner or licensed agency employed by or under contract with a CCBHC;\n(3) initial CCBHC daily bundled rates for newly certified CCBHCs under section 245.735, subdivision 3, shall be established by the commissioner using a provider-specific rate based on the newly certified CCBHC's audited historical cost report data adjusted for the expected cost of delivering CCBHC services. Estimates are subject to review by the commissioner and must include the expected cost of providing the full scope of CCBHC services and the expected number of visits for the rate period;\n(4) the commissioner shall rebase CCBHC rates once every two years following the last rebasing and no less than 12 months following an initial rate or a rate change due to a change in the scope of services. For CCBHCs certified after September 31, 2020, and before January 1, 2021, the commissioner shall rebase rates according to this clause for services provided on or after January 1, 2024;\n(5) the commissioner shall provide for a 60-day appeals process after notice of the results of the rebasing;\n(6) an entity that receives a CCBHC daily bundled rate that overlaps with another federal Medicaid rate is not eligible for the CCBHC rate methodology;\n(7) payments for CCBHC services to individuals enrolled in managed care shall be coordinated with the state's phase-out of CCBHC wrap payments. The commissioner shall complete the phase-out of CCBHC wrap payments within 60 days of the implementation of the CCBHC daily bundled rate system in the Medicaid Management Information System (MMIS), for CCBHCs reimbursed under this chapter, with a final settlement of payments due made payable to CCBHCs no later than 18 months thereafter;\n(8) the CCBHC daily bundled rate for each CCBHC shall be updated by trending each provider-specific rate by the Medicare Economic Index for primary care services. This update shall occur each year in between rebasing periods determined by the commissioner in accordance with clause (4). CCBHCs must provide data on costs and visits to the state annually using the CCBHC cost report established by the commissioner; and\n(9) a CCBHC may request a rate adjustment for changes in the CCBHC's scope of services when such changes are expected to result in an adjustment to the CCBHC payment rate by 2.5 percent or more. The CCBHC must provide the commissioner with information regarding the changes in the scope of services, including the estimated cost of providing the new or modified services and any projected increase or decrease in the number of visits resulting from the change. Estimated costs are subject to review by the commissioner. Rate adjustments for changes in scope shall occur no more than once per year in between rebasing periods per CCBHC and are effective on the date of the annual CCBHC rate update.\n(d) Managed care plans and county-based purchasing plans shall reimburse CCBHC providers at the CCBHC daily bundled rate. The commissioner shall monitor the effect of this requirement on the rate of access to the services delivered by CCBHC providers. If, for any contract year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this provision. This paragraph expires if federal approval is not received for this paragraph at any time.\n(e) The commissioner shall implement a quality incentive payment program for CCBHCs that meets the following requirements:\n(1) a CCBHC shall receive a quality incentive payment upon meeting specific numeric thresholds for performance metrics established by the commissioner, in addition to payments for which the CCBHC is eligible under the CCBHC daily bundled rate system described in paragraph (c);\n(2) a CCBHC must be certified and enrolled as a CCBHC for the entire measurement year to be eligible for incentive payments;\n(3) each CCBHC shall receive written notice of the criteria that must be met in order to receive quality incentive payments at least 90 days prior to the measurement year; and\n(4) a CCBHC must provide the commissioner with data needed to determine incentive payment eligibility within six months following the measurement year. The commissioner shall notify CCBHC providers of their performance on the required measures and the incentive payment amount within 12 months following the measurement year.\n(f) All claims to managed care plans for CCBHC services as provided under this section shall be submitted directly to, and paid by, the commissioner on the dates specified no later than January 1 of the following calendar year, if:\n(1) one or more managed care plans does not comply with the federal requirement for payment of clean claims to CCBHCs, as defined in Code of Federal Regulations, title 42, section 447.45(b), and the managed care plan does not resolve the payment issue within 30 days of noncompliance; and\n(2) the total amount of clean claims not paid in accordance with federal requirements by one or more managed care plans is 50 percent of, or greater than, the total CCBHC claims eligible for payment by managed care plans.\nIf the conditions in this paragraph are met between January 1 and June 30 of a calendar year, claims shall be submitted to and paid by the commissioner beginning on January 1 of the following year. If the conditions in this paragraph are met between July 1 and December 31 of a calendar year, claims shall be submitted to and paid by the commissioner beginning on July 1 of the following year.\n(g) Peer services provided by a CCBHC certified under section 245.735 are a covered service under medical assistance when a licensed mental health professional or alcohol and drug counselor determines that peer services are medically necessary. Eligibility under this subdivision for peer services provided by a CCBHC supersede eligibility standards under sections 256B.0615, 256B.0616, and 245G.07, subdivision 2, clause (8).\n[See Note.]\nMedical assistance does not cover conversion therapy as defined in section 214.078, subdivision 1.\n[Repealed, 1991 c 292 art 7 s 26]\nHome health services are those services specified in Minnesota Rules, part 9505.0295 and sections 256B.0651 and 256B.0653. Medical assistance covers home health services at a recipient's home residence or in the community where normal life activities take the recipient. Medical assistance does not cover home health services for residents of a hospital, nursing facility, or intermediate care facility, unless the commissioner of human services has authorized skilled nurse visits for less than 90 days for a resident at an intermediate care facility for persons with developmental disabilities, to prevent an admission to a hospital or nursing facility or unless a resident who is otherwise eligible is on leave from the facility and the facility either pays for the home health services or forgoes the facility per diem for the leave days that home health services are used. Home health services must be provided by a Medicare certified home health agency. All nursing and home health aide services must be provided according to sections 256B.0651 to 256B.0653.\nMedical assistance covers home care nursing services in a recipient's home. Recipients who are authorized to receive home care nursing services in their home may use approved hours outside of the home during hours when normal life activities take them outside of their home. To use home care nursing services at school, the recipient or responsible party must provide written authorization in the care plan identifying the chosen provider and the daily amount of services to be used at school. Medical assistance does not cover home care nursing services for residents of a hospital, nursing facility, intermediate care facility, or a health care facility licensed by the commissioner of health, unless a resident who is otherwise eligible is on leave from the facility and the facility either pays for the home care nursing services or forgoes the facility per diem for the leave days that home care nursing services are used. Total hours of service and payment allowed for services outside the home cannot exceed that which is otherwise allowed in an in-home setting according to sections 256B.0651 and 256B.0654. All home care nursing services must be provided according to the limits established under sections 256B.0651, 256B.0653, and 256B.0654. Home care nursing services may not be reimbursed if the nurse is the family foster care provider of a recipient who is under age 18, unless allowed under section 256B.0654, subdivision 4.\n(a) Medical assistance covers physical therapy and related services. Specialized maintenance therapy is covered for recipients age 20 and under.\n(b) Services provided by a physical therapy assistant shall be reimbursed at the same rate as services performed by a physical therapist when the services of the physical therapy assistant are provided under the direction of a physical therapist who is on the premises. Services provided by a physical therapy assistant that are provided under the direction of a physical therapist who is not on the premises shall be reimbursed at 65 percent of the physical therapist rate.\n(a) Medical assistance covers occupational therapy and related services. Specialized maintenance therapy is covered for recipients age 20 and under.\n(b) Services provided by an occupational therapy assistant shall be reimbursed at the same rate as services performed by an occupational therapist when the services of the occupational therapy assistant are provided under the direction of the occupational therapist who is on the premises. Services provided by an occupational therapy assistant that are provided under the direction of an occupational therapist who is not on the premises shall be reimbursed at 65 percent of the occupational therapist rate.\n(a) Medical assistance covers speech-language pathology and related services. Specialized maintenance therapy is covered for recipients age 20 and under.\n(b) Medical assistance covers audiology services and related services. Services provided by a person who has been issued a temporary registration under section 148.5161 shall be reimbursed at the same rate as services performed by a speech-language pathologist or audiologist as long as the requirements of section 148.5161, subdivision 3, are met.\n(a) A care management approach for authorization of rehabilitation services described in subdivisions 8, 8a, and 8b shall be instituted. The care management approach shall require the provider and the department rehabilitation reviewer to work together directly through written communication, or telephone communication when appropriate, to establish a medically necessary care management plan. Authorization for rehabilitation services shall include approval for up to six months of services at a time without additional documentation from the provider during the extended period, when the rehabilitation services are medically necessary due to an ongoing health condition.\n(b) The commissioner shall implement an expedited five-day turnaround time to review authorization requests for recipients who need emergency rehabilitation services.\nHome infusion therapy services provided by home infusion therapy pharmacies must be paid the lower of the submitted charge or the combined payment rates for component services typically provided.\nPayment for chiropractic services is limited to one annual evaluation and 24 visits per year unless prior authorization of a greater number of visits is obtained.\nMedical assistance covers acupuncture, as defined in section 147B.01, subdivision 3, only when provided by a licensed acupuncturist or by another Minnesota licensed practitioner for whom acupuncture is within the practitioner's scope of practice and who has specific acupuncture training or credentialing.\n(a) Medical assistance covers medically necessary dental services.\n(b) The following guidelines apply to dental services:\n(1) posterior fillings are paid at the amalgam rate;\n(2) application of sealants are covered once every five years per permanent molar; and\n(3) application of fluoride varnish is covered once every six months.\n(c) In addition to the services specified in paragraph (a), medical assistance covers the following services:\n(1) house calls or extended care facility calls for on-site delivery of covered services;\n(2) behavioral management when additional staff time is required to accommodate behavioral challenges and sedation is not used;\n(3) oral or IV sedation, if the covered dental service cannot be performed safely without it or would otherwise require the service to be performed under general anesthesia in a hospital or surgical center; and\n(4) prophylaxis, in accordance with an appropriate individualized treatment plan, but no more than four times per year.\n(d) The commissioner shall not require prior authorization for the services included in paragraph (c), clauses (1) to (3), and shall prohibit managed care and county-based purchasing plans from requiring prior authorization for the services included in paragraph (c), clauses (1) to (3), when provided under sections 256B.69, 256B.692, and 256L.12.\n[See Note.]\n(a) A dentist not already enrolled as a medical assistance provider who is providing volunteer dental services for an enrolled medical assistance dental provider that is a nonprofit entity or government owned and not receiving payment for the services provided shall complete and submit a volunteer agreement form developed by the commissioner. The volunteer agreement shall be used to enroll the dentist in medical assistance only for the purpose of providing volunteer dental services. The volunteer agreement must specify that a volunteer dentist:\n(1) will not be listed in the Minnesota health care programs provider directory;\n(2) will not receive payment for the services the volunteer dentist provides to Minnesota health care program clients; and\n(3) is not required to serve Minnesota health care program clients when providing nonvolunteer services in a private practice.\n(b) A volunteer dentist enrolled under this subdivision as a fee-for-service provider shall not otherwise be enrolled in or receive payments from Minnesota health care programs as a fee-for-service provider.\n(c) The volunteer dentist shall be notified by the dental provider for which they are providing services that medical assistance is being billed for the volunteer services provided.\n(a) A dentist who is not enrolled as a medical assistance provider, is a faculty or adjunct member at the University of Minnesota or a resident dentist licensed under section 150A.06, subdivision 1b, and is providing dental services at a dental clinic owned or operated by the University of Minnesota, may be enrolled as a medical assistance provider if the provider completes and submits to the commissioner an agreement form developed by the commissioner. The agreement must specify that the faculty or adjunct member or resident dentist:\n(1) will not receive payment for the services provided to medical assistance or MinnesotaCare enrollees performed at the dental clinics owned or operated by the University of Minnesota;\n(2) will not be listed in the medical assistance or MinnesotaCare provider directory; and\n(3) is not required to serve medical assistance and MinnesotaCare enrollees when providing nonvolunteer services in a private practice.\n(b) A dentist or resident dentist enrolled under this subdivision as a fee-for-service provider shall not otherwise be enrolled in or receive payments from medical assistance or MinnesotaCare as a fee-for-service provider.\n(a) Medical assistance covers laboratory and x-ray services.\n(b) Medical assistance covers screening and urinalysis tests for opioids without lifetime or annual limits.\n(c) Medical assistance covers laboratory tests ordered and performed by a licensed pharmacist, according to the requirements of section 151.01, subdivision 27, clause (3), at no less than the rate for which the same services are covered when provided by any other licensed practitioner.\n[See Note.]\nMedical assistance covers nurse anesthetist services. Rates paid for anesthesiology services provided by a certified registered nurse anesthetist under the direction of a physician shall be according to the formula utilized in the Medicare program and shall use the conversion factor that is used by the Medicare program. Rates paid for anesthesiology services provided by a certified registered nurse anesthetist who is not directed by a physician shall be the same rate as paid under subdivision 3, paragraph (b).\nMedical assistance covers eyeglasses if prescribed by a licensed practitioner.\n(a) Medical assistance covers drugs, except for fertility drugs when specifically used to enhance fertility, if prescribed by a licensed practitioner and dispensed by a licensed pharmacist, by a physician enrolled in the medical assistance program as a dispensing physician, or by a physician, a physician assistant, or an advanced practice registered nurse employed by or under contract with a community health board as defined in section 145A.02, subdivision 5, for the purposes of communicable disease control.\n(b) The dispensed quantity of a prescription drug must not exceed a 34-day supply unless authorized by the commissioner or as provided in paragraph (h) or the drug appears on the 90-day supply list published by the commissioner. The 90-day supply list shall be published by the commissioner on the department's website. The commissioner may add to, delete from, and otherwise modify the 90-day supply list after providing public notice and the opportunity for a 15-day public comment period. The 90-day supply list may include cost-effective generic drugs and shall not include controlled substances.\n(c) For the purpose of this subdivision and subdivision 13d, an \"active pharmaceutical ingredient\" is defined as a substance that is represented for use in a drug and when used in the manufacturing, processing, or packaging of a drug becomes an active ingredient of the drug product. An \"excipient\" is defined as an inert substance used as a diluent or vehicle for a drug. The commissioner shall establish a list of active pharmaceutical ingredients and excipients which are included in the medical assistance formulary. Medical assistance covers selected active pharmaceutical ingredients and excipients used in compounded prescriptions when the compounded combination is specifically approved by the commissioner or when a commercially available product:\n(1) is not a therapeutic option for the patient;\n(2) does not exist in the same combination of active ingredients in the same strengths as the compounded prescription; and\n(3) cannot be used in place of the active pharmaceutical ingredient in the compounded prescription.\n(d) Medical assistance covers the following over-the-counter drugs when prescribed by a licensed practitioner or by a licensed pharmacist who meets standards established by the commissioner, in consultation with the board of pharmacy: antacids, acetaminophen, family planning products, aspirin, insulin, products for the treatment of lice, vitamins for adults with documented vitamin deficiencies, vitamins for children under the age of seven and pregnant or nursing women, and any other over-the-counter drug identified by the commissioner, in consultation with the Formulary Committee, as necessary, appropriate, and cost-effective for the treatment of certain specified chronic diseases, conditions, or disorders, and this determination shall not be subject to the requirements of chapter 14. A pharmacist may prescribe over-the-counter medications as provided under this paragraph for purposes of receiving reimbursement under Medicaid. When prescribing over-the-counter drugs under this paragraph, licensed pharmacists must consult with the recipient to determine necessity, provide drug counseling, review drug therapy for potential adverse interactions, and make referrals as needed to other health care professionals.\n(e) Effective January 1, 2006, medical assistance shall not cover drugs that are coverable under Medicare Part D as defined in the Medicare Prescription Drug, Improvement, and Modernization Act of 2003, Public Law 108-173, section 1860D-2(e), for individuals eligible for drug coverage as defined in the Medicare Prescription Drug, Improvement, and Modernization Act of 2003, Public Law 108-173, section 1860D-1(a)(3)(A). For these individuals, medical assistance may cover drugs from the drug classes listed in United States Code, title 42, section 1396r-8(d)(2), subject to this subdivision and subdivisions 13a to 13g, except that drugs listed in United States Code, title 42, section 1396r-8(d)(2)(E), shall not be covered.\n(f) Medical assistance covers drugs acquired through the federal 340B Drug Pricing Program and dispensed by 340B covered entities and ambulatory pharmacies under common ownership of the 340B covered entity. Medical assistance does not cover drugs acquired through the federal 340B Drug Pricing Program and dispensed by 340B contract pharmacies.\n(g) Notwithstanding paragraph (a), medical assistance covers self-administered hormonal contraceptives prescribed and dispensed by a licensed pharmacist in accordance with section 151.37, subdivision 14; nicotine replacement medications prescribed and dispensed by a licensed pharmacist in accordance with section 151.37, subdivision 15; and opiate antagonists used for the treatment of an acute opiate overdose prescribed and dispensed by a licensed pharmacist in accordance with section 151.37, subdivision 16.\n(h) Medical assistance coverage for a prescription contraceptive must provide a 12-month supply for any prescription contraceptive if a 12-month supply is prescribed by the prescribing health care provider. The prescribing health care provider must determine the appropriate duration for which to prescribe the prescription contraceptives, up to 12 months. For purposes of this paragraph, \"prescription contraceptive\" means any drug or device that requires a prescription and is approved by the Food and Drug Administration to prevent pregnancy. Prescription contraceptive does not include an emergency contraceptive drug approved to prevent pregnancy when administered after sexual contact. For purposes of this paragraph, \"health plan\" has the meaning provided in section 62Q.01, subdivision 3.\n[Repealed, 2007 c 133 art 2 s 13]\n[Repealed, 1997 c 203 art 4 s 73]\nThe commissioner, after receiving recommendations from professional medical associations and professional pharmacy associations, and consumer groups shall designate a Formulary Committee to carry out duties as described in subdivisions 13 to 13g. The Formulary Committee shall be comprised of at least five licensed physicians actively engaged in the practice of medicine in Minnesota, one of whom is an actively practicing psychiatrist, one of whom specializes in the diagnosis and treatment of rare diseases, one of whom specializes in pediatrics, and one of whom actively treats persons with disabilities; at least three licensed pharmacists actively engaged in the practice of pharmacy in Minnesota, one of whom practices outside the metropolitan counties listed in section 473.121, subdivision 4, one of whom practices in the metropolitan counties listed in section 473.121, subdivision 4, and one of whom is a practicing hospital pharmacist; at least two consumer representatives, all of whom must have a personal or professional connection to medical assistance; and one representative designated by the Minnesota Rare Disease Advisory Council established under section 256.4835; the remainder to be made up of health care professionals who are licensed in their field and have recognized knowledge in the clinically appropriate prescribing, dispensing, and monitoring of covered outpatient drugs. Members of the Formulary Committee shall not be employed by the Department of Human Services or have a personal interest in a pharmaceutical company, pharmacy benefits manager, health plan company, or their affiliate organizations, but the committee shall be staffed by an employee of the department who shall serve as an ex officio, nonvoting member of the committee. For the purposes of this subdivision, \"personal interest\" means that a person owns at least five percent of the voting interest or equity interest in the entity, the equity interest owned by a person represents at least five percent of that person's net worth, or more than five percent of a person's gross income for the preceding year was derived from the entity. A committee member must notify the committee of any potential conflict of interest and recuse themselves from any communications, discussion, or vote on any matter where a conflict of interest exists. A conflict of interest alone, without a personal interest, does not preclude an applicant from serving as a member of the Formulary Committee. Members may be removed from the committee for cause after a recommendation for removal by a majority of the committee membership. For the purposes of this subdivision, \"cause\" does not include offering a differing or dissenting clinical opinion on a drug or drug class. The department's medical director shall also serve as an ex officio, nonvoting member for the committee. Committee members shall serve three-year terms and may be reappointed twice by the commissioner. The committee members shall vote on a chair and vice chair from among their membership. The chair shall preside over all committee meetings, and the vice chair shall preside over the meetings if the chair is not present. The Formulary Committee shall meet at least three times per year. The commissioner may require more frequent Formulary Committee meetings as needed. An honorarium of $100 per meeting and reimbursement for mileage shall be paid to each committee member in attendance. The Formulary Committee expires June 30, 2027. The Formulary Committee is subject to the Open Meeting Law under chapter 13D. For purposes of establishing a quorum to transact business, vacant committee member positions do not count in the calculation as long as at least 60 percent of the committee member positions are filled.\n(a) The commissioner shall establish a drug formulary. Its establishment and publication shall not be subject to the requirements of the Administrative Procedure Act, but the Formulary Committee shall review and comment on the formulary contents.\n(b) The formulary shall not include:\n(1) drugs, active pharmaceutical ingredients, or products for which there is no federal funding;\n(2) over-the-counter drugs, except as provided in subdivision 13;\n(3) drugs or active pharmaceutical ingredients when used for the treatment of impotence or erectile dysfunction;\n(4) drugs or active pharmaceutical ingredients for which medical value has not been established;\n(5) drugs from manufacturers who have not signed a rebate agreement with the Department of Health and Human Services pursuant to section 1927 of title XIX of the Social Security Act; and\n(6) medical cannabis flower as defined in section 342.01, subdivision 54, or medical cannabinoid products as defined in section 342.01, subdivision 52.\n(c) If a single-source drug used by at least two percent of the fee-for-service medical assistance recipients is removed from the formulary due to the failure of the manufacturer to sign a rebate agreement with the Department of Health and Human Services, the commissioner shall notify prescribing practitioners within 30 days of receiving notification from the Centers for Medicare and Medicaid Services (CMS) that a rebate agreement was not signed.\n(a) The basis for determining the amount of payment shall be the lower of the ingredient costs of the drugs plus the professional dispensing fee; or the usual and customary price charged to the public. The usual and customary price means the lowest price charged by the provider to a patient who pays for the prescription by cash, check, or charge account and includes prices the pharmacy charges to a patient enrolled in a prescription savings club or prescription discount club administered by the pharmacy or pharmacy chain, unless the prescription savings club or prescription discount club is one in which an individual pays a recurring monthly access fee for unlimited access to a defined list of drugs for which the pharmacy does not bill the member or a payer on a per-standard-transaction basis. The amount of payment basis must be reduced to reflect all discount amounts applied to the charge by any third-party provider/insurer agreement or contract for submitted charges to medical assistance programs. The net submitted charge may not be greater than the patient liability for the service. The professional dispensing fee shall be $11.55 for prescriptions filled with legend drugs meeting the definition of \"covered outpatient drugs\" according to United States Code, title 42, section 1396r-8(k)(2). The dispensing fee for intravenous solutions that must be compounded by the pharmacist shall be $11.55 per claim. The professional dispensing fee for prescriptions filled with over-the-counter drugs meeting the definition of covered outpatient drugs shall be $11.55 for dispensed quantities equal to or greater than the number of units contained in the manufacturer's original package. The professional dispensing fee shall be prorated based on the percentage of the package dispensed when the pharmacy dispenses a quantity less than the number of units contained in the manufacturer's original package. The pharmacy dispensing fee for prescribed over-the-counter drugs not meeting the definition of covered outpatient drugs shall be $3.65 for quantities equal to or greater than the number of units contained in the manufacturer's original package and shall be prorated based on the percentage of the package dispensed when the pharmacy dispenses a quantity less than the number of units contained in the manufacturer's original package. The National Average Drug Acquisition Cost (NADAC) shall be used to determine the ingredient cost of a drug. For drugs for which a NADAC is not reported, the commissioner shall estimate the ingredient cost at the wholesale acquisition cost minus two percent. The ingredient cost of a drug for a provider participating in the federal 340B Drug Pricing Program shall be either the 340B Drug Pricing Program ceiling price established by the Health Resources and Services Administration or NADAC, whichever is lower. Wholesale acquisition cost is defined as the manufacturer's list price for a drug or biological to wholesalers or direct purchasers in the United States, not including prompt pay or other discounts, rebates, or reductions in price, for the most recent month for which information is available, as reported in wholesale price guides or other publications of drug or biological pricing data. The maximum allowable cost of a multisource drug may be set by the commissioner and it shall be comparable to the actual acquisition cost of the drug product and no higher than the NADAC of the generic product. Establishment of the amount of payment for drugs shall not be subject to the requirements of the Administrative Procedure Act.\n(b) Pharmacies dispensing prescriptions to residents of long-term care facilities using an automated drug distribution system meeting the requirements of section 151.58, or a packaging system meeting the packaging standards set forth in Minnesota Rules, part 6800.2700, that govern the return of unused drugs to the pharmacy for reuse, may employ retrospective billing for prescription drugs dispensed to long-term care facility residents. A retrospectively billing pharmacy must submit a claim only for the quantity of medication used by the enrolled recipient during the defined billing period. A retrospectively billing pharmacy must use a billing period not less than one calendar month or 30 days.\n(c) A pharmacy provider using packaging that meets the standards set forth in Minnesota Rules, part 6800.2700, is required to credit the department for the actual acquisition cost of all unused drugs that are eligible for reuse, unless the pharmacy is using retrospective billing. The commissioner may permit the drug clozapine to be dispensed in a quantity that is less than a 30-day supply.\n(d) If a pharmacy dispenses a multisource drug, the ingredient cost shall be the NADAC of the generic product or the maximum allowable cost established by the commissioner unless prior authorization for the brand name product has been granted according to the criteria established by the Drug Formulary Committee as required by subdivision 13f, paragraph (a), and the prescriber has indicated \"dispense as written\" on the prescription in a manner consistent with section 151.21, subdivision 2.\n(e) The basis for determining the amount of payment for drugs administered in an outpatient setting shall be the lower of the usual and customary cost submitted by the provider, 106 percent of the average sales price as determined by the United States Department of Health and Human Services pursuant to title XVIII, section 1847a of the federal Social Security Act, the specialty pharmacy rate, or the maximum allowable cost set by the commissioner. If average sales price is unavailable, the amount of payment must be lower of the usual and customary cost submitted by the provider, the wholesale acquisition cost, the specialty pharmacy rate, or the maximum allowable cost set by the commissioner. The commissioner shall discount the payment rate for drugs obtained through the federal 340B Drug Pricing Program by 28.6 percent. The payment for drugs administered in an outpatient setting shall be made to the administering facility or practitioner. A retail or specialty pharmacy dispensing a drug for administration in an outpatient setting is not eligible for direct reimbursement.\n(f) The commissioner may establish maximum allowable cost rates for specialty pharmacy products that are lower than the ingredient cost formulas specified in paragraph (a). The commissioner may require individuals enrolled in the health care programs administered by the department to obtain specialty pharmacy products from providers with whom the commissioner has negotiated lower reimbursement rates. Specialty pharmacy products are defined as those used by a small number of recipients or recipients with complex and chronic diseases that require expensive and challenging drug regimens. Examples of these conditions include, but are not limited to: multiple sclerosis, HIV/AIDS, transplantation, hepatitis C, growth hormone deficiency, Crohn's Disease, rheumatoid arthritis, and certain forms of cancer. Specialty pharmaceutical products include injectable and infusion therapies, biotechnology drugs, antihemophilic factor products, high-cost therapies, and therapies that require complex care. The commissioner shall consult with the Formulary Committee to develop a list of specialty pharmacy products subject to maximum allowable cost reimbursement. In consulting with the Formulary Committee in developing this list, the commissioner shall take into consideration the population served by specialty pharmacy products, the current delivery system and standard of care in the state, and access to care issues. The commissioner shall have the discretion to adjust the maximum allowable cost to prevent access to care issues.\n(g) Home infusion therapy services provided by home infusion therapy pharmacies must be paid at rates according to subdivision 8d.\n(h) The commissioner shall contract with a vendor to conduct a cost of dispensing survey for all pharmacies that are physically located in the state of Minnesota that dispense outpatient drugs under medical assistance. The commissioner shall ensure that the vendor has prior experience in conducting cost of dispensing surveys. Each pharmacy enrolled with the department to dispense outpatient prescription drugs to fee-for-service members must respond to the cost of dispensing survey. The commissioner may sanction a pharmacy under section 256B.064 for failure to respond. The commissioner shall require the vendor to measure a single statewide cost of dispensing for specialty prescription drugs and a single statewide cost of dispensing for nonspecialty prescription drugs for all responding pharmacies to measure the mean, mean weighted by total prescription volume, mean weighted by medical assistance prescription volume, median, median weighted by total prescription volume, and median weighted by total medical assistance prescription volume. The commissioner shall post a copy of the final cost of dispensing survey report on the department's website. The initial survey must be completed no later than January 1, 2021, and repeated every three years. The commissioner shall provide a summary of the results of each cost of dispensing survey and provide recommendations for any changes to the dispensing fee to the chairs and ranking minority members of the legislative committees with jurisdiction over medical assistance pharmacy reimbursement. Notwithstanding section 256.01, subdivision 42, this paragraph does not expire.\n(i) The commissioner shall increase the ingredient cost reimbursement calculated in paragraphs (a) and (f) by 1.8 percent for prescription and nonprescription drugs subject to the wholesale drug distributor tax under section 295.52.\n(a) The Formulary Committee shall review and recommend drugs which require prior authorization. The Formulary Committee shall establish general criteria to be used for the prior authorization of brand-name drugs for which generically equivalent drugs are available, but the committee is not required to review each brand-name drug for which a generically equivalent drug is available.\n(b) Prior authorization may be required by the commissioner before certain formulary drugs are eligible for payment. The Formulary Committee may recommend drugs for prior authorization directly to the commissioner. The commissioner may also request that the Formulary Committee review a drug for prior authorization. Before the commissioner may require prior authorization for a drug:\n(1) the commissioner must provide information to the Formulary Committee on the impact that placing the drug on prior authorization may have on the quality of patient care and on program costs, information regarding whether the drug is subject to clinical abuse or misuse, and relevant data from the state Medicaid program if such data is available;\n(2) the Formulary Committee must review the drug, taking into account medical and clinical data and the information provided by the commissioner; and\n(3) the Formulary Committee must hold a public forum and receive public comment for an additional 15 days.\nThe commissioner must provide a 15-day notice period before implementing the prior authorization.\n(c) Except as provided in subdivision 13j, prior authorization shall not be required or utilized for any atypical antipsychotic drug prescribed for the treatment of mental illness if:\n(1) there is no generically equivalent drug available; and\n(2) the drug was initially prescribed for the recipient prior to July 1, 2003; or\n(3) the drug is part of the recipient's current course of treatment.\nThis paragraph applies to any multistate preferred drug list or supplemental drug rebate program established or administered by the commissioner. Prior authorization shall automatically be granted for 60 days for brand name drugs prescribed for treatment of mental illness within 60 days of when a generically equivalent drug becomes available, provided that the brand name drug was part of the recipient's course of treatment at the time the generically equivalent drug became available.\n(d) Prior authorization must not be required for liquid methadone if only one version of liquid methadone is available. If more than one version of liquid methadone is available, the commissioner shall ensure that at least one version of liquid methadone is available without prior authorization.\n(e) Prior authorization may be required for an oral liquid form of a drug, except as described in paragraph (d). A prior authorization request under this paragraph must be automatically approved within 24 hours if the drug is being prescribed for a Food and Drug Administration-approved condition for a patient who utilizes an enteral tube for feedings or medication administration, even if the patient has current or prior claims for pills for that condition. If more than one version of the oral liquid form of a drug is available, the commissioner may select the version that is able to be approved for a Food and Drug Administration-approved condition for a patient who utilizes an enteral tube for feedings or medication administration. This paragraph applies to any multistate preferred drug list or supplemental drug rebate program established or administered by the commissioner. The commissioner shall design and implement a streamlined prior authorization form for patients who utilize an enteral tube for feedings or medication administration and are prescribed an oral liquid form of a drug. The commissioner may require prior authorization for brand name drugs whenever a generically equivalent product is available, even if the prescriber specifically indicates \"dispense as written-brand necessary\" on the prescription as required by section 151.21, subdivision 2.\n(f) Notwithstanding this subdivision, the commissioner may automatically require prior authorization, for a period not to exceed 180 days, for any drug that is approved by the United States Food and Drug Administration on or after July 1, 2005. The 180-day period begins no later than the first day that a drug is available for shipment to pharmacies within the state. The Formulary Committee shall recommend to the commissioner general criteria to be used for the prior authorization of the drugs, but the committee is not required to review each individual drug. In order to continue prior authorizations for a drug after the 180-day period has expired, the commissioner must follow the provisions of this subdivision.\n(g) Prior authorization under this subdivision shall comply with section 62Q.184.\n(h) Any step therapy protocol requirements established by the commissioner must comply with section 62Q.1841.\n(i) Notwithstanding any law to the contrary, prior authorization or step therapy shall not be required or utilized for any class of drugs that is approved by the United States Food and Drug Administration for the treatment or prevention of HIV and AIDS.\n[See Note.]\n(a) The commissioner shall adopt and implement a preferred drug list by January 1, 2004. The commissioner may enter into a contract with a vendor for the purpose of participating in a preferred drug list and supplemental rebate program. The terms of the contract with the vendor must be publicly disclosed on the website of the Department of Human Services. The commissioner shall ensure that any contract meets all federal requirements and maximizes federal financial participation. The commissioner shall publish the preferred drug list annually in the State Register and shall maintain an accurate and up-to-date list on the agency website. The commissioner shall implement and maintain an accurate archive of previous versions of the preferred drug list, and make this archive available to the public on the website of the Department of Human Services beginning January 1, 2024.\n(b) The commissioner may add to, delete from, and otherwise modify the preferred drug list, after consulting with the Formulary Committee and appropriate medical specialists, providing public notice and the opportunity for public comment, and complying with the requirements of paragraph (f).\n(c) The commissioner shall adopt and administer the preferred drug list as part of the administration of the supplemental drug rebate program. Reimbursement for prescription drugs not on the preferred drug list may be subject to prior authorization.\n(d) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"appropriate medical specialist\" means a medical professional who prescribes the relevant class of drug as part of their practice; and\n(2) \"preferred drug list\" means a list of prescription drugs within designated therapeutic classes selected by the commissioner, for which prior authorization based on the identity of the drug or class is not required.\n(e) The commissioner shall seek any federal waivers or approvals necessary to implement this subdivision.\n(f) Before the commissioner may delete a drug from the preferred drug list or modify the inclusion of a drug on the preferred drug list, the commissioner shall consider any implications that the deletion or modification may have on state public health policies or initiatives and any impact that the deletion or modification may have on increasing health disparities in the state. Prior to deleting a drug or modifying the inclusion of a drug, the commissioner shall also conduct a public hearing. The commissioner shall provide adequate notice to the public and the commissioner of health prior to the hearing that specifies the drug that the commissioner is proposing to delete or modify, and shall disclose any public medical or clinical analysis that the commissioner has relied on in proposing the deletion or modification and evidence that the commissioner has evaluated the impact of the proposed deletion or modification on public health and health disparities. Notwithstanding section 331A.05, a public notice of a Formulary Committee meeting must be published at least 30 days in advance of the meeting. The list of drugs to be discussed at the meeting must be announced at least 30 days before the meeting and must include the name and class of drug, the proposed action, and the proposed prior authorization requirements, if applicable.\n(a) Medical assistance covers medication therapy management services for a recipient taking prescriptions to treat or prevent one or more chronic medical conditions. For purposes of this subdivision, \"medication therapy management\" means the provision of the following pharmaceutical care services by a licensed pharmacist to optimize the therapeutic outcomes of the patient's medications:\n(1) performing or obtaining necessary assessments of the patient's health status;\n(2) formulating a medication treatment plan, which may include prescribing medications or products in accordance with section 151.37, subdivision 14, 15, or 16;\n(3) monitoring and evaluating the patient's response to therapy, including safety and effectiveness;\n(4) performing a comprehensive medication review to identify, resolve, and prevent medication-related problems, including adverse drug events;\n(5) documenting the care delivered and communicating essential information to the patient's other primary care providers;\n(6) providing verbal education and training designed to enhance patient understanding and appropriate use of the patient's medications;\n(7) providing information, support services, and resources designed to enhance patient adherence with the patient's therapeutic regimens; and\n(8) coordinating and integrating medication therapy management services within the broader health care management services being provided to the patient.\nNothing in this subdivision shall be construed to expand or modify the scope of practice of the pharmacist as defined in section 151.01, subdivision 27.\n(b) To be eligible for reimbursement for services under this subdivision, a pharmacist must meet the following requirements:\n(1) have a valid license issued by the Board of Pharmacy of the state in which the medication therapy management service is being performed;\n(2) have graduated from an accredited college of pharmacy on or after May 1996, or completed a structured and comprehensive education program approved by the Board of Pharmacy and the American Council of Pharmaceutical Education for the provision and documentation of pharmaceutical care management services that has both clinical and didactic elements; and\n(3) make use of an electronic patient record system that meets state standards.\n(c) For purposes of reimbursement for medication therapy management services, the commissioner may enroll individual pharmacists as medical assistance providers. The commissioner may also establish limits on the number of reimbursable consultations per recipient.\n(d) Medication therapy management services may be provided via telehealth as defined in subdivision 3b and may be delivered into a patient's residence. Reimbursement shall be at the same rates and under the same conditions that would otherwise apply to the services provided. To qualify for reimbursement under this paragraph, the pharmacist providing the services must meet the requirements of paragraph (b).\n(a) A nine-member Drug Utilization Review Board is established. The board must be comprised of at least three but no more than four licensed physicians actively engaged in the practice of medicine in Minnesota; at least three licensed pharmacists actively engaged in the practice of pharmacy in Minnesota; and one consumer representative. The remainder must be made up of health care professionals who are licensed in their field and have recognized knowledge in the clinically appropriate prescribing, dispensing, and monitoring of covered outpatient drugs. Members of the board must be appointed by the commissioner, shall serve three-year terms, and may be reappointed by the commissioner. The board shall annually elect a chair from among its members.\n(b) The board must be staffed by an employee of the department who shall serve as an ex officio nonvoting member of the board.\n(c) The commissioner shall, with the advice of the board:\n(1) implement a medical assistance retrospective and prospective drug utilization review program as required by United States Code, title 42, section 1396r-8, subsection (g), paragraph (3);\n(2) develop and implement the predetermined criteria and practice parameters for appropriate prescribing to be used in retrospective and prospective drug utilization review;\n(3) develop, select, implement, and assess interventions for physicians, pharmacists, and patients that are educational and not punitive in nature;\n(4) establish a grievance and appeals process for physicians and pharmacists under this section;\n(5) publish and disseminate educational information to physicians and pharmacists regarding the board and the review program;\n(6) adopt and implement procedures designed to ensure the confidentiality of any information collected, stored, retrieved, assessed, or analyzed by the board, staff to the board, or contractors to the review program that identifies individual physicians, pharmacists, or recipients;\n(7) establish and implement an ongoing process to:\n(i) receive public comment regarding drug utilization review criteria and standards; and\n(ii) consider the comments along with other scientific and clinical information in order to revise criteria and standards on a timely basis; and\n(8) adopt any rules necessary to carry out this section.\n(d) The board may establish advisory committees. The commissioner may contract with appropriate organizations to assist the board in carrying out the board's duties. The commissioner may enter into contracts for services to develop and implement a retrospective and prospective review program.\n(e) The board shall report to the commissioner annually on the date the drug utilization review annual report is due to the Centers for Medicare and Medicaid Services. This report must cover the preceding federal fiscal year. The commissioner shall make the report available to the public upon request. The report must include information on the activities of the board and the program; the effectiveness of implemented interventions; administrative costs; and any fiscal impact resulting from the program. An honorarium of $100 per meeting and reimbursement for mileage must be paid to each board member in attendance.\n(f) This subdivision is exempt from the provisions of section 15.059.\n(a) The commissioner, in consultation with the Drug Utilization Review Board established in subdivision 13i and actively practicing pediatric mental health professionals, must:\n(1) identify recommended pediatric dose ranges for atypical antipsychotic drugs and drugs used for attention deficit disorder or attention deficit hyperactivity disorder based on available medical, clinical, and safety data and research. The commissioner shall periodically review the list of medications and pediatric dose ranges and update the medications and doses listed as needed after consultation with the Drug Utilization Review Board;\n(2) identify situations where a collaborative psychiatric consultation and prior authorization should be required before the initiation or continuation of drug therapy in pediatric patients including, but not limited to, high-dose regimens, off-label use of prescription medication, a patient's young age, and lack of coordination among multiple prescribing providers; and\n(3) track prescriptive practices and the use of psychotropic medications in children with the goal of reducing the use of medication, where appropriate.\n(b) Effective July 1, 2011, the commissioner shall require prior authorization and a collaborative psychiatric consultation before an atypical antipsychotic and attention deficit disorder and attention deficit hyperactivity disorder medication meeting the criteria identified in paragraph (a), clause (2), is eligible for payment. A collaborative psychiatric consultation must be completed before the identified medications are eligible for payment unless:\n(1) the patient has already been stabilized on the medication regimen; or\n(2) the prescriber indicates that the child is in crisis.\nIf clause (1) or (2) applies, the collaborative psychiatric consultation must be completed within 90 days for payment to continue.\n(c) For purposes of this subdivision, a collaborative psychiatric consultation must meet the criteria described in section 245.4862, subdivision 4.\n(a) The commissioner may enter into a value-based purchasing arrangement under medical assistance or MinnesotaCare, by written arrangement with a drug manufacturer based on agreed-upon metrics. The commissioner may contract with a vendor to implement and administer the value-based purchasing arrangement. A value-based purchasing arrangement may include but is not limited to rebates, discounts, price reductions, risk sharing, reimbursements, guarantees, shared savings payments, withholds, or bonuses. A value-based purchasing arrangement must provide at least the same value or discount in the aggregate as would claiming the mandatory federal drug rebate under the Federal Social Security Act, section 1927.\n(b) Nothing in this section shall be interpreted as requiring a drug manufacturer or the commissioner to enter into an arrangement as described in paragraph (a).\n(c) Nothing in this section shall be interpreted as altering or modifying medical assistance coverage requirements under the federal Social Security Act, section 1927.\n(d) If the commissioner determines that a state plan amendment is necessary before implementing a value-based purchasing arrangement, the commissioner shall request the amendment and may delay implementing this provision until the amendment is approved.\n(e) The commissioner may provide separate reimbursement to hospitals for drugs provided in the inpatient hospital setting as part of a value-based purchasing arrangement. This payment must be separate from the diagnostic related group reimbursement for the inpatient admission or discharge associated with a stay during which the patient received a drug under this section. For payments made under this section, the hospital must not be reimbursed for the drug under the payment methodology in section 256.969. The commissioner shall establish the separate reimbursement rate for drugs provided under this section based on the methodology used for drugs administered in an outpatient setting under section 256B.0625, subdivision 13e, paragraph (e).\n[See Note.]\n(a) Medical assistance covers diagnostic, screening, and preventive services.\n(b) \"Preventive services\" include services related to pregnancy, including:\n(1) services for those conditions which may complicate a pregnancy and which may be available to a pregnant woman determined to be at risk of poor pregnancy outcome;\n(2) prenatal HIV risk assessment, education, counseling, and testing; and\n(3) alcohol abuse assessment, education, and counseling on the effects of alcohol usage while pregnant. Preventive services available to a woman at risk of poor pregnancy outcome may differ in an amount, duration, or scope from those available to other individuals eligible for medical assistance.\n(c) \"Screening services\" include, but are not limited to, blood lead tests.\n(d) The commissioner shall encourage, at the time of the child and teen checkup or at an episodic care visit, the primary care health care provider to perform primary caries preventive services. Primary caries preventive services include, at a minimum:\n(1) a general visual examination of the child's mouth without using probes or other dental equipment or taking radiographs;\n(2) a risk assessment using the factors established by the American Academies of Pediatrics and Pediatric Dentistry; and\n(3) the application of a fluoride varnish beginning at age one to those children assessed by the provider as being high risk in accordance with best practices as defined by the Department of Human Services. The provider must obtain parental or legal guardian consent before a fluoride varnish is applied to a minor child's teeth.\nAt each checkup, if primary caries preventive services are provided, the provider must provide to the child's parent or legal guardian: information on caries etiology and prevention; and information on the importance of finding a dental home for their child by the age of one. The provider must also advise the parent or legal guardian to contact the child's managed care plan or the Department of Human Services in order to secure a dental appointment with a dentist. The provider must indicate in the child's medical record that the parent or legal guardian was provided with this information and document any primary caries prevention services provided to the child.\n(a) Medical assistance covers health care prepayment plan premiums, insurance premiums, and co-payments if determined to be cost-effective by the commissioner. For purposes of obtaining Medicare Part A and Part B, and co-payments, expenditures may be made even if federal funding is not available.\n(b) Effective for all premiums due on or after June 30, 1997, medical assistance does not cover premiums that a recipient is required to pay under a qualified or Medicare supplement plan issued by the Minnesota Comprehensive Health Association. Medical assistance shall continue to cover premiums for recipients who are covered under a plan issued by the Minnesota Comprehensive Health Association on June 30, 1997, for a period of six months following receipt of the notice of termination or until December 31, 1997, whichever is later.\nMedical assistance covers abortions and abortion-related services, including preabortion services and follow-up services.\n(a) \"Nonemergency medical transportation service\" means motor vehicle transportation provided by a public or private person that serves Minnesota health care program beneficiaries who do not require emergency ambulance service, as defined in section 144E.001, subdivision 3, to obtain covered medical services.\n(b) For purposes of this subdivision, \"rural urban commuting area\" or \"RUCA\" means a census-tract based classification system under which a geographical area is determined to be urban, rural, or super rural.\n(c) Medical assistance covers medical transportation costs incurred solely for obtaining emergency medical care or transportation costs incurred by eligible persons in obtaining emergency or nonemergency medical care when paid directly to an ambulance company, nonemergency medical transportation company, or other recognized providers of transportation services. Medical transportation must be provided by:\n(1) nonemergency medical transportation providers who meet the requirements of this subdivision;\n(2) ambulances, as defined in section 144E.001, subdivision 2;\n(3) taxicabs that meet the requirements of this subdivision;\n(4) public transportation, within the meaning of \"public transportation\" as defined in section 174.22, subdivision 7; or\n(5) not-for-hire vehicles, including volunteer drivers, as defined in section 65B.472, subdivision 1, paragraph (p).\n(d) Medical assistance covers nonemergency medical transportation provided by nonemergency medical transportation providers enrolled in the Minnesota health care programs. All nonemergency medical transportation providers must comply with the operating standards for special transportation service as defined in sections 174.29 to 174.30 and Minnesota Rules, chapter 8840, and all drivers must be individually enrolled with the commissioner and reported on the claim as the individual who provided the service. All nonemergency medical transportation providers shall bill for nonemergency medical transportation services in accordance with Minnesota health care programs criteria. Publicly operated transit systems, volunteers, and not-for-hire vehicles are exempt from the requirements outlined in this paragraph.\n(e) An organization may be terminated, denied, or suspended from enrollment if:\n(1) the provider has not initiated background studies on the individuals specified in section 174.30, subdivision 10, paragraph (a), clauses (1) to (3); or\n(2) the provider has initiated background studies on the individuals specified in section 174.30, subdivision 10, paragraph (a), clauses (1) to (3), and:\n(i) the commissioner has sent the provider a notice that the individual has been disqualified under section 245C.14; and\n(ii) the individual has not received a disqualification set-aside specific to the special transportation services provider under sections 245C.22 and 245C.23.\n(f) The administrative agency of nonemergency medical transportation must:\n(1) adhere to the policies defined by the commissioner;\n(2) pay nonemergency medical transportation providers for services provided to Minnesota health care programs beneficiaries to obtain covered medical services;\n(3) provide data monthly to the commissioner on appeals, complaints, no-shows, canceled trips, and number of trips by mode; and\n(4) by July 1, 2016, in accordance with subdivision 18e, utilize a web-based single administrative structure assessment tool that meets the technical requirements established by the commissioner, reconciles trip information with claims being submitted by providers, and ensures prompt payment for nonemergency medical transportation services.\n(g) Until the commissioner implements the single administrative structure and delivery system under subdivision 18e, clients shall obtain their level-of-service certificate from the commissioner or an entity approved by the commissioner that does not dispatch rides for clients using modes of transportation under paragraph (l), clauses (4), (5), (6), and (7).\n(h) The commissioner may use an order by the recipient's attending physician, advanced practice registered nurse, physician assistant, or a medical or mental health professional to certify that the recipient requires nonemergency medical transportation services. Nonemergency medical transportation providers shall perform driver-assisted services for eligible individuals, when appropriate. Driver-assisted service includes passenger pickup at and return to the individual's residence or place of business, assistance with admittance of the individual to the medical facility, and assistance in passenger securement or in securing of wheelchairs, child seats, or stretchers in the vehicle.\n(i) Nonemergency medical transportation providers must take clients to the health care provider using the most direct route, and must not exceed 30 miles for a trip to a primary care provider or 60 miles for a trip to a specialty care provider, unless the client receives authorization from the local agency.\n(j) Nonemergency medical transportation providers may not bill for separate base rates for the continuation of a trip beyond the original destination. Nonemergency medical transportation providers must maintain trip logs, which include pickup and drop-off times, signed by the medical provider or client, whichever is deemed most appropriate, attesting to mileage traveled to obtain covered medical services. Clients requesting client mileage reimbursement must sign the trip log attesting mileage traveled to obtain covered medical services.\n(k) The administrative agency shall use the level of service process established by the commissioner to determine the client's most appropriate mode of transportation. If public transit or a certified transportation provider is not available to provide the appropriate service mode for the client, the client may receive a onetime service upgrade.\n(l) The covered modes of transportation are:\n(1) client reimbursement, which includes client mileage reimbursement provided to clients who have their own transportation, or to family or an acquaintance who provides transportation to the client;\n(2) volunteer transport, which includes transportation by volunteers using their own vehicle;\n(3) unassisted transport, which includes transportation provided to a client by a taxicab or public transit. If a taxicab or public transit is not available, the client can receive transportation from another nonemergency medical transportation provider;\n(4) assisted transport, which includes transport provided to clients who require assistance by a nonemergency medical transportation provider;\n(5) lift-equipped/ramp transport, which includes transport provided to a client who is dependent on a device and requires a nonemergency medical transportation provider with a vehicle containing a lift or ramp;\n(6) protected transport, which includes transport provided to a client who has received a prescreening that has deemed other forms of transportation inappropriate and who requires a provider: (i) with a protected vehicle that is not an ambulance or police car and has safety locks, a video recorder, and a transparent thermoplastic partition between the passenger and the vehicle driver; and (ii) who is certified as a protected transport provider; and\n(7) stretcher transport, which includes transport for a client in a prone or supine position and requires a nonemergency medical transportation provider with a vehicle that can transport a client in a prone or supine position.\n(m) The local agency shall be the single administrative agency and shall administer and reimburse for modes defined in paragraph (l) according to paragraphs (p) and (q) when the commissioner has developed, made available, and funded the web-based single administrative structure, assessment tool, and level of need assessment under subdivision 18e. The local agency's financial obligation is limited to funds provided by the state or federal government.\n(n) The commissioner shall:\n(1) verify that the mode and use of nonemergency medical transportation is appropriate;\n(2) verify that the client is going to an approved medical appointment; and\n(3) investigate all complaints and appeals.\n(o) The administrative agency shall pay for the services provided in this subdivision and seek reimbursement from the commissioner, if appropriate. As vendors of medical care, local agencies are subject to the provisions in section 256B.041, the sanctions and monetary recovery actions in section 256B.064, and Minnesota Rules, parts 9505.2160 to 9505.2245.\n(p) Payments for nonemergency medical transportation must be paid based on the client's assessed mode under paragraph (k), not the type of vehicle used to provide the service. The medical assistance reimbursement rates for nonemergency medical transportation services that are payable by or on behalf of the commissioner for nonemergency medical transportation services are:\n(1) $0.22 per mile for client reimbursement;\n(2) up to 100 percent of the Internal Revenue Service business deduction rate for volunteer transport;\n(3) equivalent to the standard fare for unassisted transport when provided by public transit, and $12.10 for the base rate and $1.43 per mile when provided by a nonemergency medical transportation provider;\n(4) $14.30 for the base rate and $1.43 per mile for assisted transport;\n(5) $19.80 for the base rate and $1.70 per mile for lift-equipped/ramp transport;\n(6) $75 for the base rate and $2.40 per mile for protected transport; and\n(7) $60 for the base rate and $2.40 per mile for stretcher transport, and $9 per trip for an additional attendant if deemed medically necessary.\n(q) The base rate for nonemergency medical transportation services in areas defined under RUCA to be super rural is equal to 111.3 percent of the respective base rate in paragraph (p), clauses (1) to (7). The mileage rate for nonemergency medical transportation services in areas defined under RUCA to be rural or super rural areas is:\n(1) for a trip equal to 17 miles or less, equal to 125 percent of the respective mileage rate in paragraph (p), clauses (1) to (7); and\n(2) for a trip between 18 and 50 miles, equal to 112.5 percent of the respective mileage rate in paragraph (p), clauses (1) to (7).\n(r) For purposes of reimbursement rates for nonemergency medical transportation services under paragraphs (p) and (q), the zip code of the recipient's place of residence shall determine whether the urban, rural, or super rural reimbursement rate applies.\n(s) The commissioner, when determining reimbursement rates for nonemergency medical transportation under paragraphs (p) and (q), shall exempt all modes of transportation listed under paragraph (l) from Minnesota Rules, part 9505.0445, item R, subitem (2).\n(t) Effective for the first day of each calendar quarter in which the price of gasoline as posted publicly by the United States Energy Information Administration exceeds $3.00 per gallon, the commissioner shall adjust the rate paid per mile in paragraph (p) by one percent up or down for every increase or decrease of ten cents for the price of gasoline. The increase or decrease must be calculated using a base gasoline price of $3.00. The percentage increase or decrease must be calculated using the average of the most recently available price of all grades of gasoline for Minnesota as posted publicly by the United States Energy Information Administration.\n[See Note.]\n(a) Medical assistance covers ambulance services. Providers shall bill ambulance services according to Medicare criteria. Nonemergency ambulance services shall not be paid as emergencies. Effective for services rendered on or after July 1, 2001, medical assistance payments for ambulance services shall be paid at the Medicare reimbursement rate or at the medical assistance payment rate in effect on July 1, 2000, whichever is greater.\n(b) Effective for services provided on or after July 1, 2016, medical assistance payment rates for ambulance services identified in this paragraph are increased by five percent. Capitation payments made to managed care plans and county-based purchasing plans for ambulance services provided on or after January 1, 2017, shall be increased to reflect this rate increase. The increased rate described in this paragraph applies to ambulance service providers whose base of operations as defined in section 144E.10 is located:\n(1) outside the metropolitan counties listed in section 473.121, subdivision 4, and outside the cities of Duluth, Mankato, Moorhead, St. Cloud, and Rochester; or\n(2) within a municipality with a population of less than 1,000.\n(c) Effective for the first day of each calendar quarter in which the price of gasoline as posted publicly by the United States Energy Information Administration exceeds $3.00 per gallon, the commissioner shall adjust the rate paid per mile in paragraph (a) by one percent up or down for every increase or decrease of ten cents for the price of gasoline. The increase or decrease must be calculated using a base gasoline price of $3.00. The percentage increase or decrease must be calculated using the average of the most recently available price of all grades of gasoline for Minnesota as posted publicly by the United States Energy Information Administration.\n(d) Managed care plans and county-based purchasing plans must provide a fuel adjustment for ambulance services rates when fuel exceeds $3 per gallon. If, for any contract year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this paragraph. This paragraph expires if federal approval is not received for this paragraph at any time.\n[See Note.]\n(a) As a condition for payment, nonemergency medical transportation providers must document each occurrence of a service provided to a recipient according to this subdivision. Providers must maintain records sufficient to distinguish individual trips with specific vehicles and drivers. The documentation may be collected and maintained using electronic systems or software or in paper form but must be made available and produced upon request. Program funds paid for transportation that is not documented according to this subdivision may be subject to recovery by the commissioner pursuant to section 256B.064.\n(b) A nonemergency medical transportation provider must compile transportation trip records that are written in English and legible according to the standard of a reasonable person and that include each of the following elements:\n(1) the recipient's name;\n(2) the date or dates the service is provided, if different than the date the entry was made;\n(3) either the printed name of the driver sufficient to distinguish the driver of service or the driver's provider number;\n(4) the date and the signature of the driver attesting that the record accurately represents the services provided and the actual miles driven, and acknowledging that misreporting information that results in ineligible or excessive payments may result in civil or criminal action;\n(5) the date and the signature of the recipient or authorized party attesting that transportation services were provided as indicated on the transportation trip record, or the signature of the medical services provider certifying that the recipient was transported to the medical services provider destination. In the event that both the medical services provider and the recipient or authorized party refuse or are unable to provide signatures, the driver must document on the transportation trip record that signatures were requested and not provided;\n(6) the address, or the description if the address is not available, of both the origin and destination, and the mileage for the most direct route from the origin to the destination;\n(7) the name or number of the mode of transportation in which the service is provided;\n(8) the license plate number of the vehicle used to transport the recipient;\n(9) the time of the recipient pickup;\n(10) the time of the recipient drop-off;\n(11) the odometer reading of the vehicle used to transport the recipient taken at the time of pickup;\n(12) the odometer reading of the vehicle used to transport the recipient taken at the time of drop-off;\n(13) the name of the extra attendant when an extra attendant is used to provide special transportation service; and\n(14) the documentation indicating the method that was used to determine the most direct route.\n(c) In determining whether the commissioner will seek recovery, the documentation requirements in this section apply retroactively to audit findings beginning January 1, 2020, and to all audit findings thereafter.\nA Minnesota health care program enrollee residing in, or being discharged from, a licensed nursing facility is exempt from a level of need determination and is eligible for nonemergency medical transportation services until the enrollee no longer resides in a licensed nursing facility, as provided in section 256B.04, subdivision 14a.\nThe commissioner shall contract with a vendor or dedicate staff to oversee providers of nonemergency medical transportation services pursuant to the commissioner's authority in section 256B.04 and Minnesota Rules, parts 9505.2160 to 9505.2245.\n(a) A terminated nonemergency medical transportation provider, including all named individuals on the current enrollment disclosure form and known or discovered affiliates of the nonemergency medical transportation provider, is not eligible to enroll as a nonemergency medical transportation provider for five years following the termination.\n(b) After the five-year period in paragraph (a), if a provider seeks to reenroll as a nonemergency medical transportation provider, the provider must be placed on a one-year probation period. During a provider's probation period the commissioner shall complete unannounced site visits and request documentation to review compliance with program requirements.\n(a) To the extent authorized by rule of the state agency, medical assistance covers the most appropriate and cost-effective form of transportation incurred by any ambulatory eligible person for obtaining nonemergency medical care.\n(b) The commissioner may provide a monthly public transit pass to recipients who are well-served by public transit for the recipient's nonemergency medical transportation needs. Any recipient who is eligible for one public transit trip for a medically necessary covered service may select to receive a transit pass for that month. Recipients who do not have any transportation needs for a medically necessary service in any given month or who have received a transit pass for that month through another program administered by a county or Tribe are not eligible for a transit pass that month. The commissioner shall not require recipients to select a monthly transit pass if the recipient's transportation needs cannot be served by public transit systems. Recipients who receive a monthly transit pass are not eligible for other modes of transportation, unless an unexpected need arises that cannot be accessed through public transit.\n(a) Medical assistance reimbursement for meals for persons traveling to receive medical care may not exceed $5.50 for breakfast, $6.50 for lunch, or $8 for dinner.\n(b) Medical assistance reimbursement for lodging for persons traveling to receive medical care may not exceed $50 per day unless prior authorized by the local agency.\n(c) Regardless of the number of employees that an enrolled health care provider may have, medical assistance covers sign and oral language interpreter services when provided by an enrolled health care provider during the course of providing a direct, person-to-person covered health care service to an enrolled recipient with limited English proficiency or who has a hearing loss and uses interpreting services. Coverage for face-to-face oral language interpreter services shall be provided only if the oral language interpreter used by the enrolled health care provider is listed in the registry or roster established under section 144.058.\nExcept for establishing level of service process, the commissioner shall not use a broker or coordinator for any purpose related to nonemergency medical transportation services under subdivision 18.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\nThe commissioner, in coordination with the commissioner of transportation, shall implement a single administrative structure and delivery system for nonemergency medical transportation, beginning the latter of the date the single administrative assessment tool required in this subdivision is available for use, as determined by the commissioner or by July 1, 2016.\nIn coordination with the Department of Transportation, the commissioner shall develop and authorize a web-based single administrative structure and assessment tool, which must operate 24 hours a day, seven days a week, to facilitate the enrollee assessment process for nonemergency medical transportation services. The web-based tool shall facilitate the transportation eligibility determination process initiated by clients and client advocates; shall include an accessible automated intake and assessment process and real-time identification of level of service eligibility; and shall authorize an appropriate and auditable mode of transportation authorization. The tool shall provide a single framework for reconciling trip information with claiming and collecting complaints regarding inappropriate level of need determinations, inappropriate transportation modes utilized, and interference with accessing nonemergency medical transportation. The web-based single administrative structure shall operate on a trial basis for one year from implementation and, if approved by the commissioner, shall be permanent thereafter.\n[Repealed, 2014 c 312 art 24 s 48]\nBeginning in calendar year 2015, the commissioner shall collect, audit, and analyze performance data on nonemergency medical transportation annually and report this information on the agency's website. The commissioner shall periodically supplement this information with the results of consumer surveys of the quality of services, and shall make these survey findings available to the public on the agency website.\n(a) The following nonemergency medical transportation (NEMT) subdivisions apply to managed care plans and county-based purchasing plans:\n(1) subdivision 17, paragraphs (a), (b), (i), and (n);\n(2) subdivision 18; and\n(3) subdivision 18a.\n(b) A nonemergency medical transportation provider must comply with the operating standards for special transportation service specified in sections 174.29 to 174.30 and Minnesota Rules, chapter 8840. Publicly operated transit systems, volunteers, and not-for-hire vehicles are exempt from the requirements in this paragraph.\n(c) Managed care plans and county-based purchasing plans must provide a fuel adjustment for NEMT rates when fuel exceeds $3 per gallon. If, for any contract year, federal approval is not received for this paragraph, the commissioner must adjust the capitation rates paid to managed care plans and county-based purchasing plans for that contract year to reflect the removal of this provision. Contracts between managed care plans and county-based purchasing plans and providers to whom this paragraph applies must allow recovery of payments from those providers if capitation rates are adjusted in accordance with this paragraph. Payment recoveries must not exceed the amount equal to any increase in rates that results from this paragraph. This paragraph expires if federal approval is not received for this paragraph at any time.\n[Repealed, 1991 c 292 art 7 s 26]\nMedical assistance covers personal care assistance services in a recipient's home. Effective January 1, 2010, to qualify for personal care assistance services, a recipient must require assistance and be determined dependent in one activity of daily living as defined in section 256B.0659, subdivision 1, paragraph (b), or in a Level I behavior as defined in section 256B.0659, subdivision 1, paragraph (c). Recipients or responsible parties must be able to identify the recipient's needs, direct and evaluate task accomplishment, and provide for health and safety. Approved hours may be used outside the home when normal life activities take them outside the home. To use personal care assistance services at school, the recipient or responsible party must provide written authorization in the care plan identifying the chosen provider and the daily amount of services to be used at school. Total hours for services, whether actually performed inside or outside the recipient's home, cannot exceed that which is otherwise allowed for personal care assistance services in an in-home setting according to sections 256B.0651 to 256B.0654. Medical assistance does not cover personal care assistance services for residents of a hospital, nursing facility, intermediate care facility, health care facility licensed by the commissioner of health, or unless a resident who is otherwise eligible is on leave from the facility and the facility either pays for the personal care assistance services or forgoes the facility per diem for the leave days that personal care assistance services are used. All personal care assistance services must be provided according to sections 256B.0651 to 256B.0654. Personal care assistance services may not be reimbursed if the personal care assistant is the spouse or paid guardian of the recipient or the parent of a recipient under age 18, or the responsible party or the family foster care provider of a recipient who cannot direct the recipient's own care unless, in the case of a foster care provider, a county or state case manager visits the recipient as needed, but not less than every six months, to monitor the health and safety of the recipient and to ensure the goals of the care plan are met. Notwithstanding the provisions of section 256B.0659, the unpaid guardian or conservator of an adult, who is not the responsible party and not the personal care provider organization, may be reimbursed to provide personal care assistance services to the recipient if the guardian or conservator meets all criteria for a personal care assistant according to section 256B.0659, and shall not be considered to have a service provider interest for purposes of participation on the screening team under section 256B.092, subdivision 7.\nFor fiscal years beginning on or after July 1, 1993, the commissioner of human services shall not provide automatic annual inflation adjustments for home care services. The commissioner of management and budget shall include as a budget change request in each biennial detailed expenditure budget submitted to the legislature under section 16A.11 annual adjustments in reimbursement rates for home care services.\n(a) Medical assistance covers personal care assistance services provided by an individual who is qualified to provide the services according to subdivision 19a and sections 256B.0651 to 256B.0654, provided in accordance with a plan, and supervised by a qualified professional.\n(b) \"Qualified professional\" means a mental health professional, a registered nurse as defined in sections 148.171 to 148.285, a licensed social worker as defined in sections 148E.010 and 148E.055, or a qualified designated coordinator under section 245D.081, subdivision 2. The qualified professional shall perform the duties required in section 256B.0659.\n(a) To the extent authorized by rule of the state agency, medical assistance covers case management services to persons with serious and persistent mental illness and children with severe emotional disturbance. Services provided under this section must meet the relevant standards in sections 245.461 to 245.4887, the Comprehensive Adult and Children's Mental Health Acts, Minnesota Rules, parts 9520.0900 to 9520.0926, and 9505.0322, excluding subpart 10.\n(b) Entities meeting program standards set out in rules governing family community support services as defined in section 245.4871, subdivision 17, are eligible for medical assistance reimbursement for case management services for children with severe emotional disturbance when these services meet the program standards in Minnesota Rules, parts 9520.0900 to 9520.0926 and 9505.0322, excluding subparts 6 and 10.\n(c) Medical assistance and MinnesotaCare payment for mental health case management shall be made on a monthly basis. In order to receive payment for an eligible child, the provider must document at least a face-to-face contact either in person or by interactive video that meets the requirements of subdivision 20b with the child, the child's parents, or the child's legal representative. To receive payment for an eligible adult, the provider must document:\n(1) at least a face-to-face contact with the adult or the adult's legal representative either in person or by interactive video that meets the requirements of subdivision 20b; or\n(2) at least a telephone contact with the adult or the adult's legal representative and document a face-to-face contact either in person or by interactive video that meets the requirements of subdivision 20b with the adult or the adult's legal representative within the preceding two months.\n(d) Payment for mental health case management provided by county or state staff shall be based on the monthly rate methodology under section 256B.094, subdivision 6, paragraph (b), with separate rates calculated for child welfare and mental health, and within mental health, separate rates for children and adults.\n(e) Payment for mental health case management provided by Indian health services or by agencies operated by Indian tribes may be made according to this section or other relevant federally approved rate setting methodology.\n(f) Payment for mental health case management provided by vendors who contract with a county must be calculated in accordance with section 256B.076, subdivision 2. Payment for mental health case management provided by vendors who contract with a Tribe must be based on a monthly rate negotiated by the Tribe. The rate must not exceed the rate charged by the vendor for the same service to other payers. If the service is provided by a team of contracted vendors, the team shall determine how to distribute the rate among its members. No reimbursement received by contracted vendors shall be returned to the county or tribe, except to reimburse the county or tribe for advance funding provided by the county or tribe to the vendor.\n(g) If the service is provided by a team which includes contracted vendors, tribal staff, and county or state staff, the costs for county or state staff participation in the team shall be included in the rate for county-provided services. In this case, the contracted vendor, the tribal agency, and the county may each receive separate payment for services provided by each entity in the same month. In order to prevent duplication of services, each entity must document, in the recipient's file, the need for team case management and a description of the roles of the team members.\n(h) Notwithstanding section 256B.19, subdivision 1, the nonfederal share of costs for mental health case management shall be provided by the recipient's county of responsibility, as defined in sections 256G.01 to 256G.12, from sources other than federal funds or funds used to match other federal funds. If the service is provided by a tribal agency, the nonfederal share, if any, shall be provided by the recipient's tribe. When this service is paid by the state without a federal share through fee-for-service, 50 percent of the cost shall be provided by the recipient's county of responsibility.\n(i) Notwithstanding any administrative rule to the contrary, prepaid medical assistance and MinnesotaCare include mental health case management. When the service is provided through prepaid capitation, the nonfederal share is paid by the state and the county pays no share.\n(j) The commissioner may suspend, reduce, or terminate the reimbursement to a provider that does not meet the reporting or other requirements of this section. The county of responsibility, as defined in sections 256G.01 to 256G.12, or, if applicable, the tribal agency, is responsible for any federal disallowances. The county or tribe may share this responsibility with its contracted vendors.\n(k) The commissioner shall set aside a portion of the federal funds earned for county expenditures under this section to repay the special revenue maximization account under section 256.01, subdivision 2, paragraph (n). The repayment is limited to:\n(1) the costs of developing and implementing this section; and\n(2) programming the information systems.\n(l) Payments to counties and tribal agencies for case management expenditures under this section shall only be made from federal earnings from services provided under this section. When this service is paid by the state without a federal share through fee-for-service, 50 percent of the cost shall be provided by the state. Payments to county-contracted vendors shall include the federal earnings, the state share, and the county share.\n(m) Case management services under this subdivision do not include therapy, treatment, legal, or outreach services.\n(n) If the recipient is a resident of a nursing facility, intermediate care facility, or hospital, and the recipient's institutional care is paid by medical assistance, payment for case management services under this subdivision is limited to the lesser of:\n(1) the last 180 days of the recipient's residency in that facility and may not exceed more than six months in a calendar year; or\n(2) the limits and conditions which apply to federal Medicaid funding for this service.\n(o) Payment for case management services under this subdivision shall not duplicate payments made under other program authorities for the same purpose.\n(p) If the recipient is receiving care in a hospital, nursing facility, or residential setting licensed under chapter 245A or 245D that is staffed 24 hours a day, seven days a week, mental health targeted case management services must actively support identification of community alternatives for the recipient and discharge planning.\nTo the extent defined in the state Medicaid plan, case management service activities for persons with developmental disabilities as defined in section 256B.092, and rules promulgated thereunder, are covered services under medical assistance.\n(a) Minimum required face-to-face contacts for targeted case management may be provided through interactive video if interactive video is in the best interests of the person and is deemed appropriate by the person receiving targeted case management or the person's legal guardian and the case management provider.\n(b) The person receiving targeted case management or the person's legal guardian has the right to choose and consent to the use of interactive video under this subdivision and has the right to refuse the use of interactive video at any time.\n(c) The commissioner may establish criteria that a targeted case management provider must attest to in order to demonstrate the safety or efficacy of meeting the minimum face-to-face contact requirements for targeted case management through interactive video.\n(d) As a condition of payment, the targeted case management provider must document the following for each occurrence of targeted case management provided by interactive video for the purpose of face-to-face contact:\n(1) the time the contact began and the time the contact ended, including an a.m. and p.m. designation;\n(2) the basis for determining that interactive video is an appropriate and effective means for contacting the person receiving targeted case management services;\n(3) the mode of transmission used to deliver the services and records stating that a particular mode of transmission was utilized; and\n(4) the location of the originating site and the distant site.\n(e) Interactive video must not be used to meet minimum face-to-face contact requirements for children who are in out-of-home placement or receiving case management services for child protection reasons.\n(f) For purposes of this subdivision, \"interactive video\" means the delivery of targeted case management services in real time through the use of two-way interactive audio and visual communication.\n[Repealed, 1989 c 282 art 3 s 98]\nMedical assistance covers hospice care services under Public Law 99-272, section 9505, to the extent authorized by rule, except that a recipient age 21 or under who elects to receive hospice services does not waive coverage for services that are related to the treatment of the condition for which a diagnosis of terminal illness has been made. Hospice respite and end-of-life care under subdivision 22a are not hospice care services under this subdivision.\n(a) Medical assistance covers hospice respite and end-of-life care if the care is for children who elect to receive hospice care delivered in a facility that is licensed under sections 144A.75 to 144A.755 and that is a residential hospice facility under section 144A.75, subdivision 13, paragraph (a). Hospice care services under subdivision 22 are not hospice respite or end-of-life care under this subdivision.\n(b) The payment rates for coverage under this subdivision must be 100 percent of the Medicare rate for continuous home care hospice services as published in the Centers for Medicare and Medicaid Services annual final rule updating payments and policies for hospice care. Payment for hospice respite and end-of-life care under this subdivision must be made from state money, though the commissioner must seek to obtain federal financial participation for the payments. Payment for hospice respite and end-of-life care must be paid to the residential hospice facility and are not included in any limit or cap amount applicable to hospice services payments to the elected hospice services provider.\n(c) Certification of the residential hospice facility by the federal Medicare program must not be a requirement of medical assistance payment for hospice respite and end-of-life care under this subdivision.\nMedical assistance covers day treatment services as specified in sections 245.462, subdivision 8, and 245.4871, subdivision 10, that are provided under contract with the county board. The commissioner may set authorization thresholds for day treatment for adults according to subdivision 25. Medical assistance covers day treatment services for children as specified under section 256B.0943.\nMedical assistance covers any other medical or remedial care licensed and recognized under state law unless otherwise prohibited by law. The commissioner shall publish in the State Register a list of elective surgeries that require a second medical opinion before medical assistance reimbursement, and the criteria and standards for deciding whether an elective surgery should require a second medical opinion. The list and criteria and standards are not subject to the requirements of sections 14.01 to 14.69.\nMedical assistance covers substance use disorder treatment services according to section 254B.05, subdivision 5, except for room and board.\n(a) The commissioner shall publish in the Minnesota health care programs provider manual and on the department's website a list of health services that require prior authorization, the criteria and standards used to select health services on the list, and the criteria and standards used to determine whether certain providers must obtain prior authorization for their services. The list of services requiring prior authorization and the criteria and standards used to formulate the list of services or the selection of providers for whom prior authorization is required are not subject to the requirements of sections 14.001 to 14.69. The commissioner's decision whether prior authorization is required for a health service or is required for a provider is not subject to administrative appeal. Use of criteria or standards to select providers for whom prior authorization is required shall not impede access to the service involved for any group of individuals with unique or special needs due to disability or functional condition.\n(b) The commissioner shall implement a modernized electronic system for providers to request prior authorization. The modernized electronic system must include at least the following functionalities:\n(1) authorizations are recipient-centric, not provider-centric;\n(2) adequate flexibility to support authorizations for an episode of care, continuous drug therapy, or for individual onetime services and allows an ordering and a rendering provider to both submit information into one request;\n(3) allows providers to review previous authorization requests and determine where a submitted request is within the authorization process;\n(4) supports automated workflows that allow providers to securely submit medical information that can be accessed by medical and pharmacy review vendors as well as department staff; and\n(5) supports development of automated clinical algorithms that can verify information and provide responses in real time.\n(c) The system described in paragraph (b) shall be completed by March 1, 2012. All authorization requests submitted on and after March 1, 2012, or upon completion of the modernized authorization system, whichever is later, must be submitted electronically by providers, except requests for drugs dispensed by an outpatient pharmacy, services that are provided outside of the state and surrounding local trade area, and services included on a service agreement.\n(a) Effective January 1, 2010, the commissioner shall require prior authorization or decision support for the ordering providers at the time the service is ordered for the following outpatient diagnostic imaging services: computerized tomography (CT), magnetic resonance imaging (MRI), magnetic resonance angiography (MRA), positive emission tomography (PET), cardiac imaging, and ultrasound diagnostic imaging.\n(b) Prior authorization under this subdivision is not required for diagnostic imaging services performed as part of a hospital emergency room visit, inpatient hospitalization, or if concurrent with or on the same day as an urgent care facility visit.\n(c) This subdivision does not apply to services provided to recipients who are enrolled in Medicare, the prepaid medical assistance program, or the MinnesotaCare program.\n(d) The commissioner may contract with a private entity to provide the prior authorization or decision support required under this subdivision. The contracting entity must incorporate clinical guidelines that are based on evidence-based medical literature, if available. By January 1, 2012, the contracting entity shall report to the commissioner the results of prior authorization or decision support.\n(a) Except as otherwise allowed under this subdivision or required under federal or state regulations, the commissioner must not consider a request for authorization of a service when the recipient has coverage from a third-party payer unless the provider requesting authorization has made a good faith effort to receive payment or authorization from the third-party payer. A good faith effort is established by supplying with the authorization request to the commissioner the following:\n(1) a determination of payment for the service from the third-party payer, a determination of authorization for the service from the third-party payer, or a verification of noncoverage of the service by the third-party payer; and\n(2) the information or records required by the department to document the reason for the determination or to validate noncoverage from the third-party payer.\n(b) A provider requesting authorization for services covered by Medicare is not required to bill Medicare before requesting authorization from the commissioner if the provider has reason to believe that a service covered by Medicare is not eligible for payment. The provider must document that, because of recent claim experiences with Medicare or because of written communication from Medicare, coverage is not available for the service.\n(c) Authorization is not required if a third-party payer has made payment that is equal to or greater than 60 percent of the maximum payment amount for the service allowed under medical assistance.\nEffective January 1, 2026, the following provisions of chapter 62M apply to the commissioner when delivering services under chapters 256B and 256L: 62M.02, subdivisions 1 to 5, 7 to 12, 13, 14 to 18, and 21; 62M.04; 62M.05, subdivisions 1 to 4; 62M.06, subdivisions 1 to 3; 62M.07; 62M.072; 62M.09; 62M.10; 62M.12; 62M.17, subdivision 2; and 62M.18.\n(a) Medical assistance covers evaluations necessary in making a determination for eligibility for individualized education program and individualized family service plan services and for medical services identified in a recipient's individualized education program and individualized family service plan and covered under the medical assistance state plan. Covered services include occupational therapy, physical therapy, speech-language therapy, clinical psychological services, nursing services, school psychological services, school social work services, personal care assistants serving as management aides, assistive technology devices, transportation services, health assessments, and other services covered under the medical assistance state plan. Mental health services eligible for medical assistance reimbursement must be provided or coordinated through a children's mental health collaborative where a collaborative exists if the child is included in the collaborative operational target population. The provision or coordination of services does not require that the individualized education program be developed by the collaborative.\nThe services may be provided by a Minnesota school district that is enrolled as a medical assistance provider or its subcontractor, and only if the services meet all the requirements otherwise applicable if the service had been provided by a provider other than a school district, in the following areas: medical necessity; physician's, advanced practice registered nurse's, or physician assistant's orders; documentation; personnel qualifications; and prior authorization requirements. The nonfederal share of costs for services provided under this subdivision is the responsibility of the local school district as provided in section 125A.74. Services listed in a child's individualized education program are eligible for medical assistance reimbursement only if those services meet criteria for federal financial participation under the Medicaid program.\n(b) Approval of health-related services for inclusion in the individualized education program does not require prior authorization for purposes of reimbursement under this chapter. The commissioner may require physician, advanced practice registered nurse, or physician assistant review and approval of the plan not more than once annually or upon any modification of the individualized education program that reflects a change in health-related services.\n(c) Services of a speech-language pathologist provided under this section are covered notwithstanding Minnesota Rules, part 9505.0390, subpart 1, item L, if the person:\n(1) holds a masters degree in speech-language pathology;\n(2) is licensed by the Professional Educator Licensing and Standards Board as an educational speech-language pathologist; and\n(3) either has a certificate of clinical competence from the American Speech and Hearing Association, has completed the equivalent educational requirements and work experience necessary for the certificate or has completed the academic program and is acquiring supervised work experience to qualify for the certificate.\n(d) Medical assistance coverage for medically necessary services provided under other subdivisions in this section may not be denied solely on the basis that the same or similar services are covered under this subdivision.\n(e) The commissioner shall develop and implement package rates, bundled rates, or per diem rates for special education services under which separately covered services are grouped together and billed as a unit in order to reduce administrative complexity.\n(f) The commissioner shall develop a cost-based payment structure for payment of these services. Only costs reported through the designated Minnesota Department of Education data systems in distinct service categories qualify for inclusion in the cost-based payment structure. The commissioner shall reimburse claims submitted based on an interim rate, and shall settle at a final rate once the department has determined it. The commissioner shall notify the school district of the final rate. The school district has 60 days to appeal the final rate. To appeal the final rate, the school district shall file a written appeal request to the commissioner within 60 days of the date the final rate determination was mailed. The appeal request shall specify (1) the disputed items and (2) the name and address of the person to contact regarding the appeal.\n(g) Effective July 1, 2000, medical assistance services provided under an individualized education program or an individual family service plan by local school districts shall not count against medical assistance authorization thresholds for that child.\n(h) Nursing services as defined in section 148.171, subdivision 15, and provided as an individualized education program health-related service, are eligible for medical assistance payment if they are otherwise a covered service under the medical assistance program. Medical assistance covers the administration of prescription medications by a licensed nurse who is employed by or under contract with a school district when the administration of medications is identified in the child's individualized education program. The simple administration of medications alone is not covered under medical assistance when administered by a provider other than a school district or when it is not identified in the child's individualized education program.\n(i) Services provided by a school social worker as described in paragraph (l) must be provided by a mental health professional as defined in section 245I.04, subdivision 2; a clinical trainee as defined in section 245I.04, subdivision 6, under the supervision of a mental health professional; or a mental health practitioner as defined in section 245I.04, subdivision 4, under the supervision of a mental health professional, to be eligible for medical assistance reimbursement. Services described in paragraph (l) must be provided within the provider's scope of practice as defined in section 245I.04, subdivisions 3, 5, and 7.\n(j) Notwithstanding section 245I.10, subdivision 2, a special education evaluation and assessment for and within an individual family service plan or individualized education program may be used to determine medical necessity for services described under paragraph (l). The special education evaluation and assessments for and within the individualized education program, or individual family service plan, that meet the requirements in section 245I.10, subdivisions 4, and 5 or 6, and that are completed by a licensed mental health professional or clinical trainee supervised by a licensed mental health professional can be used for determining medical necessity. In addition, for services that do not require a diagnosis using an assessment as defined in section 245I.10, subdivisions 4, and 5 or 6, the special education evaluation and assessments for and within the individualized education program, or individual family service plan, that provide an International Classification of Diseases diagnostic code and are completed by a licensed mental health professional or clinical trainee supervised by a licensed mental health professional can be used for determining medical necessity.\n(k) A school social worker or school providing services under paragraph (l) is not required to be certified to provide children's therapeutic services and supports under section 256B.0943.\n(l) Covered services provided by a school social worker under this paragraph are:\n(1) the explanation of findings as described in section 256B.0671, subdivision 4;\n(2) psychotherapy for crisis as described in section 256B.0671, subdivision 11a;\n(3) children's mental health clinical care consultation, as described in section 256B.0671, subdivision 7;\n(4) dialectical behavioral therapy for adolescents, as described in section 256B.0671, subdivision 6;\n(5) family psychoeducation, as described in section 256B.0671, subdivision 5, which includes skill development, peer group sessions, and individual sessions. Notwithstanding section 256B.0671, subdivision 5, family psychoeducation services under this section may be delivered by a mental health practitioner as defined under section 245I.04, subdivision 4; and\n(6) individual, family, and group psychotherapy, as described in section 256B.0671, subdivision 11.\n[See Note.]\nOrgan and tissue transplants are a covered service. Stem cell or bone marrow transplant centers must meet the standards established by the Foundation for the Accreditation of Hematopoietic Cell Therapy.\nMedical assistance covers services performed by a certified pediatric advanced practice registered nurse, a certified family advanced practice registered nurse, a certified adult advanced practice registered nurse, a certified obstetric/gynecological advanced practice registered nurse, a certified neonatal advanced practice registered nurse, or a certified geriatric advanced practice registered nurse in independent practice, if:\n(1) the service provided on an inpatient basis is not included as part of the cost for inpatient services included in the operating payment rate;\n(2) the service is otherwise covered under this chapter as a physician service; and\n(3) the service is within the scope of practice of the advanced practice registered nurse's license as a registered nurse, as defined in section 148.171.\n(a) Medical assistance covers services performed by a licensed physician assistant if the service is otherwise covered under this chapter as a physician service and if the service is within the scope of practice of a licensed physician assistant as defined in section 147A.09.\n(b) Licensed physician assistants may bill for medication management and evaluation and management services provided to medical assistance enrollees in inpatient hospital settings, and in outpatient settings after the licensed physician assistant completes 2,000 hours of clinical experience in the evaluation and treatment of mental health, consistent with their education, training, and experience, with the exception of performing psychotherapy or diagnostic assessments.\nMedical assistance covers doula services provided by a certified doula as defined in section 148.995, subdivision 2, of the mother's choice. For purposes of this section, \"doula services\" means childbirth education and support services, including emotional and physical support provided during pregnancy, labor, birth, and postpartum. The commissioner shall enroll doula agencies and individual treating doulas to provide direct reimbursement.\n[See Note.]\nMedical assistance covers the services of a certified public health nurse or a registered nurse practicing in a public health nursing clinic that is a department of, or that operates under the direct authority of, a unit of government, if the service is within the scope of practice of the public health or registered nurse's license as a registered nurse, as defined in section 148.171.\n(a) Medical assistance covers rural health clinic services, federally qualified health center services, nonprofit community health clinic services, and public health clinic services. Rural health clinic services and federally qualified health center services mean services defined in United States Code, title 42, section 1396d(a)(2)(B) and (C). Payment for rural health clinic and federally qualified health center services shall be made according to applicable federal law and regulation.\n(b) A federally qualified health center (FQHC) that is beginning initial operation shall submit an estimate of budgeted costs and visits for the initial reporting period in the form and detail required by the commissioner. An FQHC that is already in operation shall submit an initial report using actual costs and visits for the initial reporting period. Within 90 days of the end of its reporting period, an FQHC shall submit, in the form and detail required by the commissioner, a report of its operations, including allowable costs actually incurred for the period and the actual number of visits for services furnished during the period, and other information required by the commissioner. FQHCs that file Medicare cost reports shall provide the commissioner with a copy of the most recent Medicare cost report filed with the Medicare program intermediary for the reporting year which support the costs claimed on their cost report to the state.\n(c) In order to continue cost-based payment under the medical assistance program according to paragraphs (a) and (b), an FQHC or rural health clinic must apply for designation as an essential community provider within six months of final adoption of rules by the Department of Health according to section 62Q.19, subdivision 7. For those FQHCs and rural health clinics that have applied for essential community provider status within the six-month time prescribed, medical assistance payments will continue to be made according to paragraphs (a) and (b) for the first three years after application. For FQHCs and rural health clinics that either do not apply within the time specified above or who have had essential community provider status for three years, medical assistance payments for health services provided by these entities shall be according to the same rates and conditions applicable to the same service provided by health care providers that are not FQHCs or rural health clinics.\n(d) Effective July 1, 1999, the provisions of paragraph (c) requiring an FQHC or a rural health clinic to make application for an essential community provider designation in order to have cost-based payments made according to paragraphs (a) and (b) no longer apply.\n(e) Effective January 1, 2000, payments made according to paragraphs (a) and (b) shall be limited to the cost phase-out schedule of the Balanced Budget Act of 1997.\n(f) Effective January 1, 2001, through December 31, 2020, each FQHC and rural health clinic may elect to be paid either under the prospective payment system established in United States Code, title 42, section 1396a(aa), or under an alternative payment methodology consistent with the requirements of United States Code, title 42, section 1396a(aa), and approved by the Centers for Medicare and Medicaid Services. The alternative payment methodology shall be 100 percent of cost as determined according to Medicare cost principles.\n(g) Effective for services provided on or after January 1, 2021, all claims for payment of clinic services provided by FQHCs and rural health clinics shall be paid by the commissioner, according to an annual election by the FQHC or rural health clinic, under the current prospective payment system described in paragraph (f) or the alternative payment methodology described in paragraph (l), or, upon federal approval, for FQHCs that are also urban Indian organizations under Title V of the federal Indian Health Improvement Act, as provided under paragraph (k).\n(h) For purposes of this section, \"nonprofit community clinic\" is a clinic that:\n(1) has nonprofit status as specified in chapter 317A;\n(2) has tax exempt status as provided in Internal Revenue Code, section 501(c)(3);\n(3) is established to provide health services to low-income population groups, uninsured, high-risk and special needs populations, underserved and other special needs populations;\n(4) employs professional staff at least one-half of which are familiar with the cultural background of their clients;\n(5) charges for services on a sliding fee scale designed to provide assistance to low-income clients based on current poverty income guidelines and family size; and\n(6) does not restrict access or services because of a client's financial limitations or public assistance status and provides no-cost care as needed.\n(i) Effective for services provided on or after January 1, 2015, all claims for payment of clinic services provided by FQHCs and rural health clinics shall be paid by the commissioner. the commissioner shall determine the most feasible method for paying claims from the following options:\n(1) FQHCs and rural health clinics submit claims directly to the commissioner for payment, and the commissioner provides claims information for recipients enrolled in a managed care or county-based purchasing plan to the plan, on a regular basis; or\n(2) FQHCs and rural health clinics submit claims for recipients enrolled in a managed care or county-based purchasing plan to the plan, and those claims are submitted by the plan to the commissioner for payment to the clinic.\n(j) For clinic services provided prior to January 1, 2015, the commissioner shall calculate and pay monthly the proposed managed care supplemental payments to clinics, and clinics shall conduct a timely review of the payment calculation data in order to finalize all supplemental payments in accordance with federal law. Any issues arising from a clinic's review must be reported to the commissioner by January 1, 2017. Upon final agreement between the commissioner and a clinic on issues identified under this subdivision, and in accordance with United States Code, title 42, section 1396a(bb), no supplemental payments for managed care plan or county-based purchasing plan claims for services provided prior to January 1, 2015, shall be made after June 30, 2017. If the commissioner and clinics are unable to resolve issues under this subdivision, the parties shall submit the dispute to the arbitration process under section 14.57.\n(k) The commissioner shall establish an encounter payment rate that is equivalent to the all inclusive rate (AIR) payment established by the Indian Health Service and published in the Federal Register. The encounter rate must be updated annually and must reflect the changes in the AIR established by the Indian Health Service each calendar year. FQHCs that are also urban Indian organizations under Title V of the federal Indian Health Improvement Act may elect to be paid: (1) at the encounter rate established under this paragraph; (2) under the alternative payment methodology described in paragraph (l); or (3) under the federally required prospective payment system described in paragraph (f). FQHCs that elect to be paid at the encounter rate established under this paragraph must continue to meet all state and federal requirements related to FQHCs and urban Indian organizations, and must maintain their statuses as FQHCs and urban Indian organizations.\n(l) All claims for payment of clinic services provided by FQHCs and rural health clinics, that have elected to be paid under this paragraph, shall be paid by the commissioner according to the following requirements:\n(1) the commissioner shall establish a single medical and single dental organization encounter rate for each FQHC and rural health clinic when applicable;\n(2) each FQHC and rural health clinic is eligible for same day reimbursement of one medical and one dental organization encounter rate if eligible medical and dental visits are provided on the same day;\n(3) the commissioner shall reimburse FQHCs and rural health clinics, in accordance with current applicable Medicare cost principles, their allowable costs, including direct patient care costs and patient-related support services. Nonallowable costs include, but are not limited to:\n(i) general social services and administrative costs;\n(ii) retail pharmacy;\n(iii) patient incentives, food, housing assistance, and utility assistance;\n(iv) external lab and x-ray;\n(v) navigation services;\n(vi) health care taxes;\n(vii) advertising, public relations, and marketing;\n(viii) office entertainment costs, food, alcohol, and gifts;\n(ix) contributions and donations;\n(x) bad debts or losses on awards or contracts;\n(xi) fines, penalties, damages, or other settlements;\n(xii) fundraising, investment management, and associated administrative costs;\n(xiii) research and associated administrative costs;\n(xiv) nonpaid workers;\n(xv) lobbying;\n(xvi) scholarships and student aid; and\n(xvii) nonmedical assistance covered services;\n(4) the commissioner shall review the list of nonallowable costs in the years between the rebasing process established in clause (5), in consultation with the Minnesota Association of Community Health Centers, FQHCs, and rural health clinics. The commissioner shall publish the list and any updates in the Minnesota health care programs provider manual;\n(5) the initial applicable base year organization encounter rates for FQHCs and rural health clinics shall be computed for services delivered on or after January 1, 2021, and:\n(i) must be determined using each FQHC's and rural health clinic's Medicare cost reports from 2017 and 2018;\n(ii) must be according to current applicable Medicare cost principles as applicable to FQHCs and rural health clinics without the application of productivity screens and upper payment limits or the Medicare prospective payment system FQHC aggregate mean upper payment limit;\n(iii) must be subsequently rebased every two years thereafter using the Medicare cost reports that are three and four years prior to the rebasing year. Years in which organizational cost or claims volume is reduced or altered due to a pandemic, disease, or other public health emergency shall not be used as part of a base year when the base year includes more than one year. The commissioner may use the Medicare cost reports of a year unaffected by a pandemic, disease, or other public health emergency, or previous two consecutive years, inflated to the base year as established under item (iv);\n(iv) must be inflated to the base year using the inflation factor described in clause (6); and\n(v) the commissioner must provide for a 60-day appeals process under section 14.57;\n(6) the commissioner shall annually inflate the applicable organization encounter rates for FQHCs and rural health clinics from the base year payment rate to the effective date by using the CMS FQHC Market Basket inflator established under United States Code, title 42, section 1395m(o), less productivity;\n(7) FQHCs and rural health clinics that have elected the alternative payment methodology under this paragraph shall submit all necessary documentation required by the commissioner to compute the rebased organization encounter rates no later than six months following the date the applicable Medicare cost reports are due to the Centers for Medicare and Medicaid Services;\n(8) the commissioner shall reimburse FQHCs and rural health clinics an additional amount relative to their medical and dental organization encounter rates that is attributable to the tax required to be paid according to section 295.52, if applicable;\n(9) FQHCs and rural health clinics may submit change of scope requests to the commissioner if the change of scope would result in an increase or decrease of 2.5 percent or higher in the medical or dental organization encounter rate currently received by the FQHC or rural health clinic;\n(10) for FQHCs and rural health clinics seeking a change in scope with the commissioner under clause (9) that requires the approval of the scope change by the federal Health Resources Services Administration:\n(i) FQHCs and rural health clinics shall submit the change of scope request, including the start date of services, to the commissioner within seven business days of submission of the scope change to the federal Health Resources Services Administration;\n(ii) the commissioner shall establish the effective date of the payment change as the federal Health Resources Services Administration date of approval of the FQHC's or rural health clinic's scope change request, or the effective start date of services, whichever is later; and\n(iii) within 45 days of one year after the effective date established in item (ii), the commissioner shall conduct a retroactive review to determine if the actual costs established under clause (3) or encounters result in an increase or decrease of 2.5 percent or higher in the medical or dental organization encounter rate, and if this is the case, the commissioner shall revise the rate accordingly and shall adjust payments retrospectively to the effective date established in item (ii);\n(11) for change of scope requests that do not require federal Health Resources Services Administration approval, the FQHC and rural health clinic shall submit the request to the commissioner before implementing the change, and the effective date of the change is the date the commissioner received the FQHC's or rural health clinic's request, or the effective start date of the service, whichever is later. The commissioner shall provide a response to the FQHC's or rural health clinic's request within 45 days of submission and provide a final approval within 120 days of submission. This timeline may be waived at the mutual agreement of the commissioner and the FQHC or rural health clinic if more information is needed to evaluate the request;\n(12) the commissioner, when establishing organization encounter rates for new FQHCs and rural health clinics, shall consider the patient caseload of existing FQHCs and rural health clinics in a 60-mile radius for organizations established outside of the seven-county metropolitan area, and in a 30-mile radius for organizations in the seven-county metropolitan area. If this information is not available, the commissioner may use Medicare cost reports or audited financial statements to establish base rates;\n(13) the commissioner shall establish a quality measures workgroup that includes representatives from the Minnesota Association of Community Health Centers, FQHCs, and rural health clinics, to evaluate clinical and nonclinical measures; and\n(14) the commissioner shall not disallow or reduce costs that are related to an FQHC's or rural health clinic's participation in health care educational programs to the extent that the costs are not accounted for in the alternative payment methodology encounter rate established in this paragraph.\n(m) Effective July 1, 2023, an enrolled Indian health service facility or a Tribal health center operating under a 638 contract or compact may elect to also enroll as a Tribal FQHC. Requirements that otherwise apply to an FQHC covered in this subdivision do not apply to a Tribal FQHC enrolled under this paragraph, except that any requirements necessary to comply with federal regulations do apply to a Tribal FQHC. The commissioner shall establish an alternative payment method for a Tribal FQHC enrolled under this paragraph that uses the same method and rates applicable to a Tribal facility or health center that does not enroll as a Tribal FQHC.\n[See Note.]\n(a) Medical assistance covers medical supplies and equipment. Separate payment outside of the facility's payment rate shall be made for wheelchairs and wheelchair accessories for recipients who are residents of intermediate care facilities for the developmentally disabled. Reimbursement for wheelchairs and wheelchair accessories for ICF/DD recipients shall be subject to the same conditions and limitations as coverage for recipients who do not reside in institutions. A wheelchair purchased outside of the facility's payment rate is the property of the recipient.\n(b) Vendors of durable medical equipment, prosthetics, orthotics, or medical supplies must enroll as a Medicare provider.\n(c) When necessary to ensure access to durable medical equipment, prosthetics, orthotics, or medical supplies, the commissioner may exempt a vendor from the Medicare enrollment requirement if:\n(1) the vendor supplies only one type of durable medical equipment, prosthetic, orthotic, or medical supply;\n(2) the vendor serves ten or fewer medical assistance recipients per year;\n(3) the commissioner finds that other vendors are not available to provide same or similar durable medical equipment, prosthetics, orthotics, or medical supplies; and\n(4) the vendor complies with all screening requirements in this chapter and Code of Federal Regulations, title 42, part 455. The commissioner may also exempt a vendor from the Medicare enrollment requirement if the vendor is accredited by a Centers for Medicare and Medicaid Services approved national accreditation organization as complying with the Medicare program's supplier and quality standards and the vendor serves primarily pediatric patients.\n(d) Durable medical equipment means a device or equipment that:\n(1) can withstand repeated use;\n(2) is generally not useful in the absence of an illness, injury, or disability; and\n(3) is provided to correct or accommodate a physiological disorder or physical condition or is generally used primarily for a medical purpose.\n(e) Electronic tablets may be considered durable medical equipment if the electronic tablet will be used as an augmentative and alternative communication system as defined under subdivision 31a, paragraph (a). To be covered by medical assistance, the device must be locked in order to prevent use not related to communication.\n(f) Notwithstanding the requirement in paragraph (e) that an electronic tablet must be locked to prevent use not as an augmentative communication device, a recipient of waiver services may use an electronic tablet for a use not related to communication when the recipient has been authorized under the waiver to receive one or more additional applications that can be loaded onto the electronic tablet, such that allowing the additional use prevents the purchase of a separate electronic tablet with waiver funds.\n(g) An order or prescription for medical supplies, equipment, or appliances must meet the requirements in Code of Federal Regulations, title 42, part 440.70.\n(h) Allergen-reducing products provided according to subdivision 67, paragraph (c) or (d), shall be considered durable medical equipment.\n(i) Seizure detection devices are covered as durable medical equipment under this subdivision if:\n(1) the seizure detection device is medically appropriate based on the recipient's medical condition or status; and\n(2) the recipient's health care provider has identified that a seizure detection device would:\n(i) likely assist in reducing bodily harm to or death of the recipient as a result of the recipient experiencing a seizure; or\n(ii) provide data to the health care provider necessary to appropriately diagnose or treat a health condition of the recipient that causes the seizure activity.\n(j) For purposes of paragraph (i), \"seizure detection device\" means a United States Food and Drug Administration-approved monitoring device and related service or subscription supporting the prescribed use of the device, including technology that provides ongoing patient monitoring and alert services that detect seizure activity and transmit notification of the seizure activity to a caregiver for appropriate medical response or collects data of the seizure activity of the recipient that can be used by a health care provider to diagnose or appropriately treat a health care condition that causes the seizure activity. The medical assistance reimbursement rate for a subscription supporting the prescribed use of a seizure detection device is 60 percent of the rate for monthly remote monitoring under the medical assistance telemonitoring benefit.\n[See Note.]\n(a) Medical assistance covers augmentative and alternative communication systems consisting of electronic or nonelectronic devices and the related components necessary to enable a person with severe expressive communication limitations to produce or transmit messages or symbols in a manner that compensates for that disability.\n(b) Augmentative and alternative communication systems must be paid the lower of the:\n(1) submitted charge; or\n(2)(i) manufacturer's suggested retail price minus 20 percent for providers that are manufacturers of augmentative and alternative communication systems; or\n(ii) manufacturer's invoice charge plus 20 percent for providers that are not manufacturers of augmentative and alternative communication systems.\n(c) Reimbursement rates established by this purchasing program are not subject to Minnesota Rules, part 9505.0445, item S or T.\n(a) The commissioner shall implement a point-of-sale preferred diabetic testing supply program by January 1, 2014. Medical assistance coverage for diabetic testing supplies shall conform to the limitations established under the program. The commissioner may enter into a contract with a vendor for the purpose of participating in a preferred diabetic testing supply list and supplemental rebate program. The commissioner shall ensure that any contract meets all federal requirements and maximizes federal financial participation. The commissioner shall maintain an accurate and up-to-date list on the department's website.\n(b) The commissioner may add to, delete from, and otherwise modify the preferred diabetic testing supply program drug list after consulting with the Drug Formulary Committee and appropriate medical specialists and providing public notice and the opportunity for public comment.\n(c) The commissioner shall adopt and administer the preferred diabetic testing supply program as part of the administration of the diabetic testing supply rebate program. Reimbursement for diabetic testing supplies not on the preferred diabetic testing supply list may be subject to prior authorization.\n(d) All claims for diabetic testing supplies in categories on the preferred diabetic testing supply list must be submitted by enrolled pharmacy providers using the most current National Council of Prescription Drug Plans electronic claims standard.\n(e) For purposes of this subdivision, \"preferred diabetic testing supply list\" means a list of diabetic testing supplies selected by the commissioner, for which prior authorization is not required.\n(f) The commissioner shall seek any federal waivers or approvals necessary to implement this subdivision.\nMS 2018 [Repealed, 1Sp2019 c 9 art 7 s 47]\nMedical assistance covers nutritional products needed for nutritional supplementation because solid food or nutrients thereof cannot be properly absorbed by the body or needed for treatment of phenylketonuria, hyperlysinemia, maple syrup urine disease, a combined allergy to human milk, cow's milk, and soy formula, or any other childhood or adult diseases, conditions, or disorders identified by the commissioner as requiring a similarly necessary nutritional product. Medical assistance covers amino acid-based elemental formulas in the same manner as is required under section 62Q.531. Nutritional products needed for the treatment of a combined allergy to human milk, cow's milk, and soy formula require prior authorization. Separate payment shall not be made for nutritional products for residents of long-term care facilities. Payment for dietary requirements is a component of the per diem rate paid to these facilities.\nMedical assistance, subject to federal approval, covers child welfare targeted case management services as defined in section 256B.094 to children under age 21 who have been assessed and determined in accordance with section 256F.10 to be:\n(1) at risk of placement or in placement as defined in section 260C.212, subdivision 1;\n(2) at risk of maltreatment or experiencing maltreatment as defined in section 260E.03, subdivision 12; or\n(3) in need of protection or services as defined in section 260C.007, subdivision 6.\nMedical assistance payments and MinnesotaCare payments to facilities of the Indian health service and facilities operated by a Tribe or Tribal organization under funding authorized by United States Code, title 25, sections 450f to 450n, or title III of the Indian Self-Determination and Education Assistance Act, Public Law 93-638, for enrollees who are eligible for federal financial participation, shall be at the option of the facility in accordance with the rate published by the United States Assistant Secretary for Health under the authority of United States Code, title 42, sections 248(a) and 249(b). MinnesotaCare payments for enrollees who are not eligible for federal financial participation at facilities of the Indian health service and facilities operated by a Tribe or Tribal organization for the provision of outpatient medical services must be in accordance with the medical assistance rates paid for the same services when provided in a facility other than a facility of the Indian health service or a facility operated by a Tribe or Tribal organization.\n[Repealed, 1Sp2003 c 14 art 4 s 24]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n[Repealed, 1Sp2003 c 14 art 4 s 24]\nMedical assistance covers individualized rehabilitation services as defined in section 245.492, subdivision 23, that are provided by a collaborative, county, or an entity under contract with a county through an integrated service system, as described in section 245.4931, that is approved by the state coordinating council, subject to federal approval.\nPayments for mental health services covered under the medical assistance program that are provided by masters-prepared mental health professionals shall be 80 percent of the rate paid to doctoral-prepared professionals. Payments for mental health services covered under the medical assistance program that are provided by masters-prepared mental health professionals employed by community mental health centers shall be 100 percent of the rate paid to doctoral-prepared professionals. Payments for mental health services covered under the medical assistance program that are provided by physician assistants shall be 80.4 percent of the base rate paid to psychiatrists.\n(a) Providers who administer pediatric vaccines within the scope of their licensure, and who are enrolled as a medical assistance provider, must enroll in the pediatric vaccine administration program established by section 13631 of the Omnibus Budget Reconciliation Act of 1993. Medical assistance shall pay for administration of the vaccine to children eligible for medical assistance. Medical assistance does not pay for vaccines that are available at no cost from the pediatric vaccine administration program unless the vaccines qualify for 100 percent federal funding or are mandated by the Centers for Medicare and Medicaid Services to be covered outside of the Vaccines for Children program.\n(b) Medical assistance covers vaccines initiated, ordered, or administered by a licensed pharmacist, according to the requirements of section 151.01, subdivision 27, clause (6), at no less than the rate for which the same services are covered when provided by any other licensed practitioner.\n[See Note.]\n(a) For persons infected with tuberculosis, medical assistance covers case management services and direct observation of the intake of drugs prescribed to treat tuberculosis.\n(b) \"Case management services\" means services furnished to assist persons infected with tuberculosis in gaining access to needed medical services. Case management services include at a minimum:\n(1) assessing a person's need for medical services to treat tuberculosis;\n(2) developing a care plan that addresses the needs identified in clause (1);\n(3) assisting the person in accessing medical services identified in the care plan; and\n(4) monitoring the person's compliance with the care plan to ensure completion of tuberculosis therapy. Medical assistance covers case management services under this subdivision only if the services are provided by a certified public health nurse who is employed by a community health board as defined in section 145A.02, subdivision 5.\n(c) To be covered by medical assistance, direct observation of the intake of drugs prescribed to treat tuberculosis must be provided by a community outreach worker, licensed practical nurse, registered nurse who is trained and supervised by a public health nurse employed by a community health board as defined in section 145A.02, subdivision 5, or a public health nurse employed by a community health board.\nMedical assistance covers rehabilitative services in accordance with section 256B.0945 that are provided by a county or an American Indian tribe through a residential facility, for children who have been diagnosed with severe emotional disturbance and have been determined to require the level of care provided in a residential facility.\nNotwithstanding Minnesota Rules, part 9505.0175, subpart 28, the definition of a mental health professional qualified according to section 245I.04, subdivision 2, for the purpose of this section and Minnesota Rules, parts 9505.0170 to 9505.0475.\n(a) Medical assistance covers provider travel time if a recipient requires the provision of mental health services outside of the provider's usual place of business.\n(b) Medical assistance covers under this subdivision the time a provider is in transit to provide a covered mental health service to a recipient at a location that is not the provider's usual place of business. A provider must travel the most direct route available. Mental health provider travel time does not include time for scheduled or unscheduled stops, meal breaks, or vehicle maintenance or repair, including refueling or vehicle emergencies. Recipient transportation is not covered under this subdivision.\n(c) Mental health provider travel time under this subdivision is only covered when the mental health service being provided is covered under medical assistance and only when the covered mental health service is delivered and billed. Mental health provider travel time is not covered when the mental health service being provided otherwise includes provider travel time or when the service is site based.\n(d) A provider must document each trip for which the provider seeks reimbursement under this subdivision in a compiled travel record. Required documentation may be collected and maintained electronically or in paper form but must be made available and produced upon request by the commissioner. The travel record must be written in English and must be legible according to the standard of a reasonable person. The recipient's individual identification number must be on each page of the record. The reason the provider must travel to provide services must be included in the record, if not otherwise documented in the recipient's individual treatment plan. Each entry in the record must document:\n(1) start and stop time (with a.m. and p.m. notations);\n(2) printed name of the recipient;\n(3) date the entry is made;\n(4) date the service is provided;\n(5) origination site and destination site;\n(6) who provided the service;\n(7) the electronic source used to calculate driving directions and distance between locations; and\n(8) the medically necessary mental health service delivered.\n(e) Mental health providers identified by the commissioner to have submitted a fraudulent report may be excluded from participation in Minnesota health care programs.\nMedical assistance covers case management services for vulnerable adults and adults with developmental disabilities, as provided under section 256B.0924.\nMedical assistance covers subacute psychiatric care for person under 21 years of age when:\n(1) the services meet the requirements of Code of Federal Regulations, title 42, section 440.160;\n(2) the facility is accredited as a psychiatric treatment facility by the Joint Commission on Accreditation of Healthcare Organizations, the Commission on Accreditation of Rehabilitation Facilities, or the Council on Accreditation; and\n(3) the facility is licensed by the commissioner of health under section 144.50.\n(a) Medical assistance covers psychiatric residential treatment facility services, according to section 256B.0941, for persons younger than 21 years of age. Individuals who reach age 21 at the time they are receiving services are eligible to continue receiving services until they no longer require services or until they reach age 22, whichever occurs first.\n(b) For purposes of this subdivision, \"psychiatric residential treatment facility\" means a facility other than a hospital that provides psychiatric services, as described in Code of Federal Regulations, title 42, sections 441.151 to 441.182, to individuals under age 21 in an inpatient setting.\n(c) The commissioner shall enroll up to 150 certified psychiatric residential treatment facility services beds. The commissioner may enroll an additional 80 certified psychiatric residential treatment facility services beds beginning July 1, 2020, and an additional 70 certified psychiatric residential treatment facility services beds beginning July 1, 2023. The commissioner shall select psychiatric residential treatment facility services providers through a request for proposals process. Providers of state-operated services may respond to the request for proposals. The commissioner shall prioritize programs that demonstrate the capacity to serve children and youth with aggressive and risky behaviors toward themselves or others, multiple diagnoses, neurodevelopmental disorders, or complex trauma related issues.\nSubject to federal approval, mental health services that are otherwise covered by medical assistance as direct face-to-face services may be provided via telehealth in accordance with subdivision 3b.\nEffective July 1, 2011, and subject to federal approval, medical assistance covers treatment foster care services according to section 256B.0946.\nMedical assistance covers consultation provided by a mental health professional qualified according to section 245I.04, subdivision 2, except a licensed professional clinical counselor licensed under section 148B.5301, via telephone, email, facsimile, or other means of communication to primary care practitioners, including pediatricians. The need for consultation and the receipt of the consultation must be documented in the patient record maintained by the primary care practitioner. If the patient consents, and subject to federal limitations and data privacy provisions, the consultation may be provided without the patient present.\n(a) Medical assistance covers the care coordination and patient education services provided by a community health worker if the community health worker has received a certificate from the Minnesota State Colleges and Universities System approved community health worker curriculum.\n(b) Community health workers must work under the supervision of a medical assistance enrolled physician, registered nurse, advanced practice registered nurse, physician assistant, mental health professional, or dentist, or work under the supervision of a certified public health nurse operating under the direct authority of an enrolled unit of government.\n(c) Care coordination and patient education services covered under this subdivision include, but are not limited to, services relating to oral health and dental care.\n[Repealed, 2015 c 21 art 1 s 110]\nThe commissioner shall develop and implement a provider-directed care coordination program for medical assistance recipients who are not enrolled in the prepaid medical assistance program and who are receiving services on a fee-for-service basis. This program provides payment to primary care clinics for care coordination for people who have complex and chronic medical conditions. Clinics must meet certain criteria such as the capacity to develop care plans; have a dedicated care coordinator; and have an adequate number of fee-for-service clients, evaluation mechanisms, and quality improvement processes to qualify for reimbursement. For purposes of this subdivision, a primary care clinic is a medical clinic designated as the patient's first point of contact for medical care, available 24 hours a day, seven days a week, that provides or arranges for the patient's comprehensive health care needs, and provides overall integration, coordination and continuity over time and referrals for specialty care.\n(a) Effective October 1, 2007, or six months after federal approval, whichever is later, medical assistance covers lead risk assessments provided by a lead risk assessor who is licensed by the commissioner of health under section 144.9505 and employed by an assessing agency as defined in section 144.9501. Medical assistance covers a onetime on-site investigation of a recipient's home or primary residence to determine the existence of lead so long as the recipient is under the age of 21 and has a venous blood lead level specified in section 144.9504, subdivision 2, paragraph (b).\n(b) Medical assistance reimbursement covers the lead risk assessor's time to complete the following activities:\n(1) gathering samples;\n(2) interviewing family members;\n(3) gathering data, including meter readings; and\n(4) providing a report with the results of the investigation and options for reducing lead-based paint hazards.\nMedical assistance coverage of lead risk assessment does not include testing of environmental substances such as water, paint, or soil or any other laboratory services. Medical assistance coverage of lead risk assessments is not included in the capitated services for children enrolled in health plans through the prepaid medical assistance program and the MinnesotaCare program.\n(c) Payment for lead risk assessment must be cost-based and must meet the criteria for federal financial participation under the Medicaid program. The rate must be based on allowable expenditures from cost information gathered. Under section 144.9507, subdivision 5, federal medical assistance funds may not replace existing funding for lead-related activities. The nonfederal share of costs for services provided under this subdivision must be from state or local funds and is the responsibility of the agency providing the risk assessment. When the risk assessment is conducted by the commissioner of health, the state share must be from appropriations to the commissioner of health for this purpose. Eligible expenditures for the nonfederal share of costs may not be made from federal funds or funds used to match other federal funds. Any federal disallowances are the responsibility of the agency providing risk assessment services.\nFor complex medical procedures with a high degree of variation in outcomes, for which the Medicare program requires facilities providing the services to meet certain criteria as a condition of coverage, the commissioner may develop centers of excellence facility criteria in consultation with the Health Services Advisory Council under subdivision 3c. The criteria must reflect facility traits that have been linked to superior patient safety and outcomes for the procedures in question, and must be based on the best available empirical evidence. For medical assistance recipients enrolled on a fee-for-service basis, the commissioner may make coverage for these procedures conditional upon the facility providing the services meeting the specified criteria. Only facilities meeting the criteria may be reimbursed for the procedures in question.\n[See Note.]\n(a) Medical assistance covers services provided in a licensed birth center by a licensed health professional if the service would otherwise be covered if provided in a hospital.\n(b) Facility services provided by a birth center shall be paid at the lower of billed charges or 70 percent of the statewide average for a facility payment rate made to a hospital for an uncomplicated vaginal birth as determined using the most recent calendar year for which complete claims data is available. If a recipient is transported from a birth center to a hospital prior to the delivery, the payment for facility services to the birth center shall be the lower of billed charges or 15 percent of the average facility payment made to a hospital for the services provided for an uncomplicated vaginal delivery as determined using the most recent calendar year for which complete claims data is available.\n(c) Nursery care services provided by a birth center shall be paid the lower of billed charges or 70 percent of the statewide average for a payment rate paid to a hospital for nursery care as determined by using the most recent calendar year for which complete claims data is available.\n(d) Professional services provided by traditional midwives licensed under chapter 147D shall be paid at the lower of billed charges or 100 percent of the rate paid to a physician performing the same services. If a recipient is transported from a birth center to a hospital prior to the delivery, a licensed traditional midwife who does not perform the delivery may not bill for any delivery services. Services are not covered if provided by an unlicensed traditional midwife.\n(e) The commissioner shall apply for any necessary waivers from the Centers for Medicare and Medicaid Services to allow birth centers and birth center providers to be reimbursed.\n(a) Except when specifically prohibited by the commissioner or federal law, a provider may seek payment from the recipient for services not eligible for payment under the medical assistance program when the provider, prior to delivering the service, reviews and considers all other available covered alternatives with the recipient and obtains a signed acknowledgment from the recipient of the potential of the recipient's liability. The signed acknowledgment must be in a form approved by the commissioner.\n(b) Conditions under which a provider must not request payment from the recipient include, but are not limited to:\n(1) a service that requires prior authorization, unless authorization has been denied as not medically necessary and all other therapeutic alternatives have been reviewed;\n(2) a service for which payment has been denied for reasons relating to billing requirements;\n(3) standard shipping or delivery and setup of medical equipment or medical supplies;\n(4) services that are included in the recipient's long term care per diem;\n(5) the recipient is enrolled in the Restricted Recipient Program and the provider is one of a provider type designated for the recipient's health care services; and\n(6) the noncovered service is a prescription drug identified by the commissioner as having the potential for abuse and overuse, except where payment by the recipient is specifically approved by the commissioner on the date of service based upon compelling evidence supplied by the prescribing provider that establishes medical necessity for that particular drug.\n(c) The payment requested from recipients for noncovered services under this subdivision must not exceed the provider's usual and customary charge for the actual service received by the recipient. A recipient must not be billed for the difference between what medical assistance paid for the service or would pay for a less costly alternative service.\n(a)(1) Medical assistance covers in-reach community-based service coordination that is performed through a hospital emergency department as an eligible procedure under a state health care program for a frequent user. A frequent user is defined as an individual who has frequented the hospital emergency department for services three or more times in the previous four consecutive months. In-reach community-based service coordination includes navigating services to address a client's mental health, chemical health, social, economic, and housing needs, or any other activity targeted at reducing the incidence of emergency room and other nonmedically necessary health care utilization.\n(2) Medical assistance covers in-reach community-based service coordination that is performed through a hospital emergency department or inpatient psychiatric unit for a child or young adult up to age 21 with a serious emotional disturbance who has frequented the hospital emergency room two or more times in the previous consecutive three months or been admitted to an inpatient psychiatric unit two or more times in the previous consecutive four months, or is being discharged to a shelter.\n(b) Reimbursement must be made in 15-minute increments and allowed for up to 60 days posthospital discharge based upon the specific identified emergency department visit or inpatient admitting event. In-reach community-based service coordination shall seek to connect frequent users with existing covered services available to them, including, but not limited to, targeted case management, waiver case management, or care coordination in a health care home. For children and young adults with a serious emotional disturbance, in-reach community-based service coordination includes navigating and arranging for community-based services prior to discharge to address a client's mental health, chemical health, social, educational, family support and housing needs, or any other activity targeted at reducing multiple incidents of emergency room use, inpatient readmissions, and other nonmedically necessary health care utilization. In-reach services shall seek to connect them with existing covered services, including targeted case management, waiver case management, care coordination in a health care home, children's therapeutic services and supports, crisis services, and respite care. Eligible in-reach service coordinators must hold a minimum of a bachelor's degree in social work, public health, corrections, or a related field. The commissioner shall submit any necessary application for waivers to the Centers for Medicare and Medicaid Services to implement this subdivision.\n(c)(1) For the purposes of this subdivision, \"in-reach community-based service coordination\" means the practice of a community-based worker with training, knowledge, skills, and ability to access a continuum of services, including housing, transportation, chemical and mental health treatment, employment, education, and peer support services, by working with an organization's staff to transition an individual back into the individual's living environment. In-reach community-based service coordination includes working with the individual during their discharge and for up to a defined amount of time in the individual's living environment, reducing the individual's need for readmittance.\n(2) Hospitals utilizing in-reach service coordinators shall report annually to the commissioner on the number of adults, children, and adolescents served; the postdischarge services which they accessed; and emergency department/psychiatric hospitalization readmissions. The commissioner shall ensure that services and payments provided under in-reach care coordination do not duplicate services or payments provided under subdivision 20 or section 256B.0753 or 256B.0755.\n(a) Medical assistance covers officer-involved community-based care coordination for an individual who:\n(1) has screened positive for benefiting from treatment for a mental illness or substance use disorder using a tool approved by the commissioner;\n(2) does not require the security of a public detention facility and is not considered an inmate of a public institution as defined in Code of Federal Regulations, title 42, section 435.1010;\n(3) meets the eligibility requirements in section 256B.056; and\n(4) has agreed to participate in officer-involved community-based care coordination.\n(b) Officer-involved community-based care coordination means navigating services to address a client's mental health, chemical health, social, economic, and housing needs, or any other activity targeted at reducing the incidence of jail utilization and connecting individuals with existing covered services available to them, including, but not limited to, targeted case management, waiver case management, or care coordination.\n(c) Officer-involved community-based care coordination must be provided by an individual who is an employee of or is under contract with a county, or is an employee of or under contract with an Indian health service facility or facility owned and operated by a tribe or a tribal organization operating under Public Law 93-638 as a 638 facility to provide officer-involved community-based care coordination and is qualified under one of the following criteria:\n(1) a mental health professional;\n(2) a clinical trainee qualified according to section 245I.04, subdivision 6, working under the treatment supervision of a mental health professional according to section 245I.06;\n(3) a mental health practitioner qualified according to section 245I.04, subdivision 4, working under the treatment supervision of a mental health professional according to section 245I.06;\n(4) a mental health certified peer specialist qualified according to section 245I.04, subdivision 10, working under the treatment supervision of a mental health professional according to section 245I.06;\n(5) an individual qualified as an alcohol and drug counselor under section 245G.11, subdivision 5; or\n(6) a recovery peer qualified under section 245G.11, subdivision 8, working under the supervision of an individual qualified as an alcohol and drug counselor under section 245G.11, subdivision 5.\n(d) Reimbursement is allowed for up to 60 days following the initial determination of eligibility.\n(e) Providers of officer-involved community-based care coordination shall annually report to the commissioner on the number of individuals served, and number of the community-based services that were accessed by recipients. The commissioner shall ensure that services and payments provided under officer-involved community-based care coordination do not duplicate services or payments provided under section 256B.0625, subdivision 20, 256B.0753, 256B.0755, or 256B.0757.\n[See Note.]\n(a) Effective for services provided on or after January 1, 2012, medical assistance payment for an enrollee's cost-sharing associated with Medicare Part B is limited to an amount up to the medical assistance total allowed, when the medical assistance rate exceeds the amount paid by Medicare.\n(b) Excluded from this limitation are payments for mental health services and payments for dialysis services provided to end-stage renal disease patients. The exclusion for mental health services does not apply to payments for physician services provided by psychiatrists and advanced practice registered nurses with a specialty in mental health.\n(c) Excluded from this limitation are payments to federally qualified health centers, Indian Health Services, rural health clinics, and CCBHCs subject to the prospective payment system under subdivision 5m.\nFor services rendered on or after July 1, 2003, for facilities reimbursed under this chapter or chapter 256R, the Medicaid program shall only pay a co-payment during a Medicare-covered skilled nursing facility stay if the Medicare rate less the resident's co-payment responsibility is less than the case mix adjusted total payment rate under chapter 256R. The amount that shall be paid by the Medicaid program is equal to the amount by which the case mix adjusted total payment rate exceeds the Medicare rate less the co-payment responsibility. Health plans paying for nursing home services under section 256B.69, subdivision 6a, may limit payments as allowed under this subdivision.\n(a) Medical assistance covers early and periodic screening, diagnosis, and treatment services (EPSDT). In administering the EPSDT program, the commissioner shall, at a minimum:\n(1) provide information to children and families, using the most effective mode identified, regarding:\n(i) the benefits of preventative health care visits;\n(ii) the services available as part of the EPSDT program; and\n(iii) assistance finding a provider, transportation, or interpreter services;\n(2) maintain an up-to-date periodicity schedule published in the department policy manual, taking into consideration the most up-to-date community standard of care; and\n(3) maintain up-to-date policies for providers on the delivery of EPSDT services that are in the provider manual on the department website.\n(b) The commissioner may contract for the administration of the outreach services as required within the EPSDT program.\n(c) The commissioner may contract for the required EPSDT outreach services, including but not limited to children enrolled or attributed to an integrated health partnership demonstration project described in section 256B.0755. Integrated health partnerships that choose to include the EPSDT outreach services within the integrated health partnership's contracted responsibilities must receive compensation from the commissioner on a per-member per-month basis for each included child. Integrated health partnerships must accept responsibility for the effectiveness of outreach services it delivers. For children who are not a part of the demonstration project, the commissioner may contract for the administration of the outreach services.\n(d) The payment amount for a complete EPSDT screening shall not include charges for health care services and products that are available at no cost to the provider and shall not exceed the rate established per Minnesota Rules, part 9505.0445, item M, effective October 1, 2010.\nMedical assistance covers services provided by advanced dental therapists and dental therapists when provided within the scope of practice identified in sections 150A.105 and 150A.106.\n(a) Medical assistance covers services provided by community paramedics who are certified under section 144E.28, subdivision 9, when the services are provided in accordance with this subdivision to an eligible recipient as defined in paragraph (b).\n(b) For purposes of this subdivision, an eligible recipient is defined as an individual who has received hospital emergency department services three or more times in a period of four consecutive months in the past 12 months or an individual who has been identified by the individual's primary health care provider for whom community paramedic services identified in paragraph (c) would likely prevent admission to or would allow discharge from a nursing facility; or would likely prevent readmission to a hospital or nursing facility.\n(c) Payment for services provided by a community paramedic under this subdivision must be a part of a care plan ordered by a primary health care provider in consultation with the medical director of an ambulance service and must be billed by an eligible provider enrolled in medical assistance that employs or contracts with the community paramedic. The care plan must ensure that the services provided by a community paramedic are coordinated with other community health providers and local public health agencies and that community paramedic services do not duplicate services already provided to the patient, including home health and waiver services. Community paramedic services shall include health assessment, chronic disease monitoring and education, medication compliance, immunizations and vaccinations, laboratory specimen collection, hospital discharge follow-up care, and minor medical procedures approved by the ambulance medical director.\n(d) Services provided by a community paramedic to an eligible recipient who is also receiving care coordination services must be in consultation with the providers of the recipient's care coordination services.\n(e) The commissioner shall seek the necessary federal approval to implement this subdivision.\n(a) Medical assistance covers services provided by a community emergency medical technician (CEMT) who is certified under section 144E.275, subdivision 7, when the services are provided in accordance with this subdivision.\n(b) A CEMT may provide a postdischarge visit, after discharge from a hospital or skilled nursing facility, when ordered by a treating physician, advanced practice registered nurse, or physician assistant. The postdischarge visit includes:\n(1) verbal or visual reminders of discharge orders;\n(2) recording and reporting of vital signs to the patient's primary care provider;\n(3) medication access confirmation;\n(4) food access confirmation; and\n(5) identification of home hazards.\n(c) An individual who has repeat ambulance calls due to falls or has been identified by the individual's primary care provider as at risk for nursing home placement, may receive a safety evaluation visit from a CEMT when ordered by a primary care provider in accordance with the individual's care plan. A safety evaluation visit includes:\n(1) medication access confirmation;\n(2) food access confirmation; and\n(3) identification of home hazards.\n(d) A CEMT shall be paid at $9.75 per 15-minute increment. A safety evaluation visit may not be billed for the same day as a postdischarge visit for the same individual.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMS 2018 [Repealed, 1Sp2019 c 9 art 7 s 47]\nMedical assistance and the early periodic screening, diagnosis, and treatment (EPSDT) program do not cover investigational drugs, biological products, or devices as defined in section 151.375 or any other treatment that is part of an approved clinical trial as defined in section 62Q.526. Participation of an enrollee in an approved clinical trial does not preclude coverage of medically necessary services covered under this chapter that are not related to the approved clinical trial. Any items or services that are provided solely to satisfy data collection and analysis for a clinical trial, and not for direct clinical management of the enrollee, are not covered.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMedical assistance covers treatment of pediatric autoimmune neuropsychiatric disorders associated with streptococcal infections (PANDAS) and pediatric acute-onset neuropsychiatric syndrome (PANS). Coverage shall be developed in collaboration with the Health Services Advisory Council established under subdivision 3c.\n(a) Medical assistance covers enhanced asthma care services and related products to be provided in the children's homes for children with poorly controlled asthma. To be eligible for services and products under this subdivision, a child must:\n(1) have poorly controlled asthma defined by having received health care for the child's asthma from a hospital emergency department at least one time in the past year or have been hospitalized for the treatment of asthma at least one time in the past year; and\n(2) receive a referral for services and products under this subdivision from a treating health care provider.\n(b) Covered services include home visits provided by a registered environmental health specialist or lead risk assessor currently credentialed by the Department of Health or a healthy homes specialist credentialed by the Building Performance Institute.\n(c) Covered products include the following allergen-reducing products that are identified as needed and recommended for the child by a registered environmental health specialist, healthy homes specialist, lead risk assessor, certified asthma educator, public health nurse, or other health care professional providing asthma care for the child, and proven to reduce asthma triggers:\n(1) allergen encasements for mattresses, box springs, and pillows;\n(2) an allergen-rated vacuum cleaner, filters, and bags;\n(3) a dehumidifier and filters;\n(4) HEPA single-room air cleaners and filters;\n(5) integrated pest management, including traps and starter packages of food storage containers;\n(6) a damp mopping system;\n(7) if the child does not have access to a bed, a waterproof hospital-grade mattress; and\n(8) for homeowners only, furnace filters.\n(d) The commissioner shall determine additional products that may be covered as new best practices for asthma care are identified.\n(e) A home assessment is a home visit to identify asthma triggers in the home and to provide education on trigger-reducing products. A child is limited to two home assessments except that a child may receive an additional home assessment if the child moves to a new home; if a new asthma trigger, including tobacco smoke, enters the home; or if the child's health care provider identifies a new allergy for the child, including an allergy to mold, pests, pets, or dust mites. The commissioner shall determine the frequency with which a child may receive a product under paragraph (c) or (d) based on the reasonable expected lifetime of the product.\n(a) Medical assistance covers tobacco and nicotine cessation services, drugs to treat tobacco and nicotine addiction or dependence, and drugs to help individuals discontinue use of tobacco and nicotine products. Medical assistance must cover services and drugs as provided in this subdivision consistent with evidence-based or evidence-informed best practices.\n(b) Medical assistance must cover in-person individual and group tobacco and nicotine cessation education and counseling services if provided by a health care practitioner whose scope of practice encompasses tobacco and nicotine cessation education and counseling. Service providers include but are not limited to the following:\n(1) mental health practitioners under section 245.462, subdivision 17;\n(2) mental health professionals under section 245.462, subdivision 18;\n(3) mental health certified peer specialists under section 256B.0615;\n(4) alcohol and drug counselors licensed under chapter 148F;\n(5) recovery peers as defined in section 245F.02, subdivision 21;\n(6) certified tobacco treatment specialists;\n(7) community health workers;\n(8) physicians;\n(9) physician assistants;\n(10) advanced practice registered nurses; or\n(11) other licensed or nonlicensed professionals or paraprofessionals with training in providing tobacco and nicotine cessation education and counseling services.\n(c) Medical assistance covers telephone cessation counseling services provided through a quitline. Notwithstanding section 256B.0625, subdivision 3b, quitline services may be provided through audio-only communications. The commissioner of human services may utilize volume purchasing for quitline services consistent with section 256B.04, subdivision 14.\n(d) Medical assistance must cover all prescription and over-the-counter pharmacotherapy drugs approved by the United States Food and Drug Administration for cessation of tobacco and nicotine use or treatment of tobacco and nicotine dependence, and that are subject to a Medicaid drug rebate agreement.\n(e) Services covered under this subdivision may be provided by telemedicine.\n(f) The commissioner must not:\n(1) restrict or limit the type, duration, or frequency of tobacco and nicotine cessation services;\n(2) prohibit the simultaneous use of multiple cessation services, including but not limited to simultaneous use of counseling and drugs;\n(3) require counseling before receiving drugs or as a condition of receiving drugs;\n(4) limit pharmacotherapy drug dosage amounts for a dosing regimen for treatment of a medically accepted indication as defined in United States Code, title 14, section 1396r-8(K)(6); limit dosing frequency; or impose duration limits;\n(5) prohibit simultaneous use of multiple drugs, including prescription and over-the-counter drugs;\n(6) require or authorize step therapy; or\n(7) require or utilize prior authorization for any tobacco and nicotine cessation services and drugs covered under this subdivision.\nMedical assistance covers biomarker testing to diagnose, treat, manage, and monitor illness or disease. Medical assistance coverage must meet the requirements that would otherwise apply to a health plan under section 62Q.473.\n[See Note.]\nMedical assistance covers recuperative care services according to section 256B.0701.\n(a) Medical assistance covers services related to the diagnosis, monitoring, and treatment of a rare disease or condition. Medical assistance coverage for these services must meet the requirements in section 62Q.451, subdivisions 1 to 3 and 6. Providers must still meet all applicable program requirements.\n(b) Coverage for a service must not be denied solely on the basis that it was provided by, referred for, or ordered by an out-of-network provider.\n(c) Any prior authorization requirements for a service that is provided by, referred for, or ordered by an out-of-network provider must be the same as any prior authorization requirements for a service that is provided by, referred for, or ordered by an in-network provider.\n(d) Nothing in this subdivision requires medical assistance to cover additional services.\nMedical assistance covers orthotic and prosthetic devices, supplies, and services according to section 256B.066.\n[See Note.]\nMedical assistance covers rapid whole genome sequencing (rWGS) testing. Coverage and eligibility for rWGS testing, and the use of genetic data, must meet the requirements specified in section 62A.3098, subdivisions 1 to 3 and 6.\nMedical assistance covers intermittent urinary catheters and insertion supplies if intermittent catheterization is recommended by the enrollee's health care provider. Medical assistance must meet the requirements that would otherwise apply to a health plan under section 62Q.666.\nMedical assistance covers scalp hair prostheses and all equipment and accessories necessary for their regular use under the conditions and in compliance with the requirements specified in section 62A.28, except that the limitation on coverage required per benefit year set forth in section 62A.28, subdivision 2, paragraph (c), does not apply.\nMedical assistance covers the transfer of mothers or newborns between medical facilities. Medical assistance must meet the same requirements that would otherwise apply to a health plan under section 62A.0411.",
	"repealed": false
}