{
	"id": "181.942",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.942",
	"title": "181.942 REINSTATEMENT AFTER LEAVE.",
	"text": "(a) An employee returning from a leave of absence under section 181.939 or 181.941 is entitled to return to employment in the employee's former position or in a position of comparable duties, number of hours, and pay. An employee returning from a leave of absence longer than one month must notify a supervisor at least two weeks prior to return from leave. An employee returning from a leave under section 181.9412 or sections 181.9445 to 181.9448 is entitled to return to employment in the employee's former position.\n(b) If, during a leave under sections 181.939 to 181.944, the employer experiences a layoff and the employee would have lost a position had the employee not been on leave, pursuant to the good faith operation of a bona fide layoff and recall system, including a system under a collective bargaining agreement, the employee is not entitled to reinstatement in the former or comparable position. In such circumstances, the employee retains all rights under the layoff and recall system, including a system under a collective bargaining agreement, as if the employee had not taken the leave.\nAn employee returning from a leave of absence under sections 181.939 to 181.944 is entitled to return to employment at the same rate of pay the employee had been receiving when the leave commenced, plus any automatic adjustments in the employee's pay scale that occurred during leave period. The employee returning from a leave is entitled to retain all accrued preleave benefits of employment and seniority, as if there had been no interruption in service; provided that nothing in sections 181.939 to 181.944 prevents the accrual of benefits or seniority during the leave pursuant to a collective bargaining or other agreement between the employer and employees.\nAn employee, by agreement with the employer, may return to work part time during the leave period without forfeiting the right to return to employment at the end of the leave period, as provided in sections 181.939 to 181.944.",
	"repealed": false
}