{
	"id": "116L.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.99",
	"title": "116L.99 WOMEN AND HIGH-WAGE, HIGH-DEMAND, NONTRADITIONAL JOBS GRANT PROGRAM.",
	"text": "(a) For the purpose of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Eligible organization\" includes, but is not limited to:\n(1) community-based organizations experienced in serving women;\n(2) employers;\n(3) business and trade associations;\n(4) labor unions and employee organizations;\n(5) registered apprenticeship programs;\n(6) secondary and postsecondary education institutions located in Minnesota; and\n(7) workforce and economic development agencies.\n(d) \"High-wage, high-demand\" means occupations that represent at least 0.1 percent of total employment in the base year, have an annual median salary which is higher than the average for the current year, and are projected to have more total openings as a share of employment than the average.\n(e) \"Low-income\" means income less than 200 percent of the federal poverty guideline adjusted for a family size of four.\n(f) \"Nontraditional occupations\" means those occupations in which women make up less than 25 percent of the workforce as defined under United States Code, title 20, section 2302.\n(g) \"Registered apprenticeship program\" means a program registered under United States Code, title 29, section 50.\n(h) \"STEM\" means science, technology, engineering, and math.\n(i) \"Women of color\" means females age 18 and older who are American Indian, Asian, Black, or Hispanic.\n(j) \"Girls of color\" means females under age 18 who are American Indian, Asian, Black, or Hispanic.\nThe commissioner shall establish the women and high-wage, high-demand, nontraditional jobs grant program to increase the number of women in high-wage, high-demand, nontraditional occupations. The commissioner shall make grants to eligible organizations for programs that encourage and assist women to enter high-wage, high-demand, nontraditional occupations including but not limited to those in the skilled trades, and STEM occupations. The commissioner must give priority to programs that encourage and assist women of color to enter high-wage, high-demand, nontraditional occupations and STEM occupations.\n(a) Grant funds awarded under this section may be used for:\n(1) recruitment, preparation, placement, and retention of women, including women of color, low-income women and women over 50 years old, in registered apprenticeships, postsecondary education programs, on-the-job training, and permanent employment in high-wage, high-demand, nontraditional occupations;\n(2) secondary or postsecondary education or other training to prepare women to succeed in high-wage, high-demand, nontraditional occupations. Activities under this clause may be conducted by the grantee or in collaboration with another institution, including but not limited to a public or private secondary or postsecondary school;\n(3) innovative, hands-on, best practices that stimulate interest in high-wage, high-demand, nontraditional occupations among girls, increase awareness among girls about opportunities in high-wage, high-demand, nontraditional occupations, or increase access to secondary programming leading to jobs in high-wage, high-demand, nontraditional occupations. Best practices include but are not limited to mentoring, internships, or apprenticeships for girls in high-wage, high-demand, nontraditional occupations;\n(4) training and other staff development for job seeker counselors and Minnesota family investment program (MFIP) caseworkers on opportunities in high-wage, high-demand, nontraditional occupations;\n(5) incentives for employers and sponsors of registered apprenticeship programs to retain women in high-wage, high-demand, nontraditional occupations for more than one year;\n(6) training and technical assistance for employers to create a safe and healthy workplace environment designed to retain and advance women, including best practices for addressing sexual harassment, and to overcome gender inequity among employers and registered apprenticeship programs;\n(7) public education and outreach activities to overcome stereotypes about women in high-wage, high-demand, nontraditional occupations, including the development of educational and marketing materials;\n(8) services to support women in high-wage, high-demand, nontraditional occupations including but not limited to assistance with balancing work responsibilities; skills training and education; family caregiving; financial assistance for child care, transportation, and safe and stable housing; workplace issues resolution; and access to advocacy assistance and services; and\n(9) recruitment, participation, and support of girls of color in approved training programs or a valid apprenticeship program subject to section 181A.07, subdivision 7.\n(b) Grant applications must include detailed information about how the applicant plans to:\n(1) increase women's participation in high-wage, high-demand occupations in which women are currently underrepresented in the workforce;\n(2) comply with the requirements under subdivision 3;\n(3) use grant funds in conjunction with funding from other public or private sources; and\n(4) collaborate with existing, successful programs for training, education, recruitment, preparation, placement, and retention of women of color in high-wage, high-demand, nontraditional occupations and STEM occupations.\n(c) In awarding grants under this subdivision, the commissioner shall give priority to eligible organizations:\n(1) with demonstrated success in recruiting and preparing women, especially low-income women, women of color, and women over 50 years old, for high-wage, high-demand, nontraditional occupations; and\n(2) that leverage additional public and private resources.\n(d) At least 50 percent of total grant funds must be awarded to programs providing services and activities targeted to low-income women and women of color.\n(e) The commissioner of employment and economic development in conjunction with the commissioner of labor and industry shall monitor the use of funds under this section, collect and compile information on the activities of other state agencies and public or private entities that have purposes similar to those under this section, and identify other public and private funding available for these purposes.\n(f) By January 15, 2019, and each January 15 thereafter, the commissioner must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over workforce development that details the use of grant funds. If data is available, the report must contain data that is disaggregated by race, cultural groups, family income, age, geographical location, migrant or foreign immigrant status, primary language, whether the participant is an English learner under section 124D.59, disability, and status of homelessness.",
	"repealed": false
}