{
	"id": "168.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.28",
	"title": "168.28 VEHICLES SUBJECT TO TAX; EXCEPTIONS.",
	"text": "Every motor vehicle (except those exempted in section 168.012, and except those which are being towed upon the streets and highways and which shall not be deemed to be using the streets and highways within the meaning of this section) shall be deemed to be one using the public streets and highways and hence as such subject to taxation under this chapter if such motor vehicle has since April 23, 1921, used such public streets or highways, or shall actually use them, or if it shall come into the possession of an owner other than as a manufacturer, dealer, warehouse operator, mortgagee or pledgee. New and unused motor vehicles in the possession of a dealer solely for the purpose of sale, and used motor vehicles which have not theretofore used the public streets or highways of this state which are in the possession of a dealer solely for the purpose of sale and which are duly listed as herein provided, shall not be deemed to be vehicles using the public streets or highways. The driving or operating of a motor vehicle upon the public streets or highways of this state by a motor vehicle dealer or any employee of such motor vehicle dealer for demonstration purposes or for any purpose incident to the usual and customary conduct and operation of the business in which licensed under section 168.27 to engage, or solely for the purpose of moving it from points outside or within the state to the place of business or storage of a licensed dealer within the state or solely for the purpose of moving it from the place of business of a manufacturer, or licensed dealer within the state to the place of business or residence of a purchaser outside the state, shall not be deemed to be using the public streets or highways in the state within the meaning of this chapter or of the Constitution of the state of Minnesota, article XIV, and shall not be held to make the motor vehicle subject to taxation under this chapter as one using the public streets or highways, if during such driving or moving the dealer's plates herein provided for shall be duly displayed upon such vehicle. Any dealer or distributor may register a motor vehicle prior to its assessment or taxation as personal property, and pay the license fee and tax thereon for the full calendar year as one using the public streets and highways, and thereafter such vehicle shall be deemed to be one using the public streets and highways and shall not be subject to assessment or taxation as personal property during the calendar year for which it is so registered, whether or not such vehicle shall actually have used the streets or highways. Special mobile equipment is subject to a penalty equal to the tax due under this chapter for the full registration year if it is used to transport persons or property at any time using the public streets.",
	"repealed": false
}