{
	"id": "146A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.03",
	"title": "146A.03 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for disciplinary action relating to complementary and alternative health care practices under this chapter may report the violation to the office.\nA state agency, political subdivision, agency of a local unit of government, private agency, hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the office any action taken by the agency, institution, or organization or any of its administrators or medical or other committees to revoke, suspend, restrict, or condition an unlicensed complementary and alternative health care practitioner's privilege to practice or treat complementary and alternative health care clients in the institution or, as part of the organization, any denial of privileges or any other disciplinary action for conduct that might constitute grounds for disciplinary action by the office under this chapter. The institution, organization, or governmental entity shall also report the resignation of any unlicensed complementary and alternative health care practitioners prior to the conclusion of any disciplinary action proceeding for conduct that might constitute grounds for disciplinary action under this chapter or prior to the commencement of formal charges but after the practitioner had knowledge that formal charges were contemplated or were being prepared.\nA state or local professional society for unlicensed complementary and alternative health care practitioners shall report to the office any termination, revocation, or suspension of membership or any other disciplinary action taken against an unlicensed complementary and alternative health care practitioner. If the society has received a complaint that might be grounds for discipline under this chapter against a member on which it has not taken any disciplinary action, the society shall report the complaint and the reason why it has not taken action on it or shall direct the complainant to the office.\nA licensed health professional shall report to the office personal knowledge of any conduct that the licensed health professional reasonably believes constitutes grounds for disciplinary action under this chapter by any unlicensed complementary and alternative health care practitioner, including conduct indicating that the individual may be incompetent or may be mentally or physically unable to engage safely in the provision of services. If the information was obtained in the course of a client relationship, the client is an unlicensed complementary and alternative health care practitioner, and the treating individual successfully counsels the other practitioner to limit or withdraw from practice to the extent required by the impairment, the office may deem this limitation of or withdrawal from practice to be sufficient disciplinary action.\nFour times each year as prescribed by the commissioner, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to unlicensed complementary and alternative health care practitioners or the medical Joint Underwriting Association under chapter 62F shall submit to the office a report concerning the unlicensed complementary and alternative health care practitioners against whom malpractice settlements or awards have been made. The response must contain at least the following information:\n(1) the total number of malpractice settlements or awards made;\n(2) the date the malpractice settlements or awards were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made;\n(4) the dollar amount of each malpractice settlement or award;\n(5) the regular address of the practice of the unlicensed complementary and alternative health care practitioner against whom an award was made or with whom a settlement was made; and\n(6) the name of the unlicensed complementary and alternative health care practitioner against whom an award was made or with whom a settlement was made.\nThe insurance company shall, in addition to the above information, submit to the office any information, records, and files, including clients' charts and records, it possesses that tend to substantiate a charge that an unlicensed complementary and alternative health care practitioner may have engaged in conduct violating this chapter.\nThe court administrator of district court or any other court of competent jurisdiction shall report to the office any judgment or other determination of the court that adjudges or includes a finding that an unlicensed complementary and alternative health care practitioner is mentally ill, mentally incompetent, guilty of a felony, guilty of a violation of federal or state narcotics laws or controlled substances act, or guilty of abuse or fraud under Medicare or Medicaid; or that appoints a guardian of the unlicensed complementary and alternative health care practitioner under sections 524.5-101 to 524.5-502 or commits an unlicensed complementary and alternative health care practitioner under chapter 253B.\nAn unlicensed complementary and alternative health care practitioner shall report to the office any personal action that would require that a report be filed with the office by any person, health care facility, business, or organization pursuant to subdivisions 2 to 5. The practitioner shall also report the revocation, suspension, restriction, limitation, or other disciplinary action against the practitioner's license, certificate, registration, or right of practice in another state or jurisdiction for offenses that would be subject to disciplinary action in this state and also report the filing of charges regarding the practitioner's license, certificate, registration, or right of practice in another state or jurisdiction.\nReports required by subdivisions 2 to 7 must be submitted not later than 30 days after the reporter learns of the occurrence of the reportable event or transaction. The office may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to ensure prompt and accurate reporting.",
	"repealed": false
}