{
	"id": "260C.148",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.148",
	"title": "260C.148 PROCEDURE; DOMESTIC CHILD ABUSE.",
	"text": "The local welfare agency may bring an emergency petition on behalf of minor family or household members seeking relief from acts of domestic child abuse. The petition shall be brought according to section 260C.141 and shall allege the existence of or immediate and present danger of domestic child abuse. The court has jurisdiction over the parties to a domestic child abuse matter notwithstanding that there is a parent in the child's household who is willing to enforce the court's order and accept services on behalf of the family.\n(a) If it appears from the notarized petition that there are reasonable grounds to believe the child is in immediate and present danger of domestic child abuse, the court may grant an ex parte temporary order for protection, pending a hearing pursuant to section 260C.151, which must be held not later than 14 days after service of the ex parte order on the respondent. The court may grant relief as it deems proper, including an order:\n(1) restraining any party from committing acts of domestic child abuse; or\n(2) excluding the alleged abusing party from the dwelling which the family or household members share or from the residence of the child.\n(b) No order excluding the alleged abusing party from the dwelling may be issued unless the court finds that:\n(1) the order is in the best interests of the child or children remaining in the dwelling; and\n(2) a parent remaining in the child's household is able to care adequately for the child or children in the absence of the excluded party and to seek appropriate assistance in enforcing the provisions of the order.\n(c) Before the temporary order is issued, the local welfare agency shall advise the court and the other parties who are present that appropriate social services will be provided to the family or household members during the effective period of the order. The petition shall identify the parent remaining in the child's household under paragraph (b), clause (2).\nAn ex parte temporary order for protection shall be effective for a fixed period not to exceed 14 days.\nThe court may renew the temporary order for protection one time for a fixed period not to exceed 14 days if the court determines, upon informal review of the case file, that the renewal is appropriate. If the court determines that the petition states a prima facie case that there are reasonable grounds to believe that the child is in immediate danger of domestic child abuse or child abuse without the court's order, at the hearing pursuant to section 260C.151, the court may continue its order issued under this subdivision pending trial under section 260C.163.\nAny order issued under this section or section 260C.201, subdivision 3, shall be served personally upon the respondent. Where necessary, the court shall order the sheriff to assist in service or execution of the order.\nUpon application, notice to all parties, and hearing, the court may modify the terms of an existing order for protection issued under this section or section 260C.201, subdivision 3.\nThe local welfare agency's right to apply for relief on behalf of a child shall not be affected by the child's leaving the dwelling or household to avoid abuse.\nNothing in this section or section 260C.201, subdivision 3, shall affect the title to real estate.\nAny relief ordered under this section or section 260C.201, subdivision 3, shall be in addition to other available civil or criminal remedies.\nAn order for protection granted pursuant to this section or section 260C.201, subdivision 3, shall be forwarded by the court administrator within 24 hours to the local law enforcement agency with jurisdiction over the residence of the child.\nEach appropriate law enforcement agency shall make available to other law enforcement officers through a system of verification, information as to the existence and status of any order for protection issued pursuant to this section or section 260C.201, subdivision 3.",
	"repealed": false
}