{
	"id": "82C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/82C.02",
	"title": "82C.02 DEFINITIONS.",
	"text": "As used in this chapter, the terms in this section have the meanings given them.\nIn conformance with the Uniform Standards of Professional Appraisal Practice (USPAP), \"appraisal\" is defined as: (noun) the act or process of developing an opinion of value; an opinion of value; (adjective) of or pertaining to appraising and related functions such as appraisal practice or appraisal services. For purposes of this chapter, all appraisals or assignments that are referred to involve one to four unit single-family properties.\n\"Appraisal assignment\" means an engagement for which an appraiser is retained to act, as a disinterested third party in giving an unbiased analysis, opinion, or conclusion relating to the nature, quality, value, or utility of named interests in, or aspects of, identified real estate.\n[Renumbered subd 12b]\n\"Appraisal management company\" means a corporation, partnership, sole proprietorship, subsidiary, unit, or other business entity that directly or indirectly performs the following appraisal management services:\n(1) within a given 12-month period, as defined in section 82C.025, administers a network or networks of more than 15 Minnesota state-licensed or state-certified real estate appraisers or 25 or more state-licensed or state-certified real estate appraisers in two or more states, who are independent contractors to the appraisal management company, as described in section 82C.025 to perform residential real estate appraisal assignments for clients;\n(2) receives requests for residential real estate appraisal services from clients and, for a fee paid by the client, enters into an agreement with one or more independent contractor appraisers to perform the real estate appraisal services contained in the request; or\n(3) serves as a third-party broker of appraisal management services between clients and appraisers.\nAn appraisal management company does not include a department or division of an entity that provides appraisal management services only to that entity.\n\"Appraisal management services\" means the process of directly or indirectly performing any of the following functions on behalf of a lender, financial institution, client, or any other person to:\n(1) administer an appraiser panel;\n(2) recruit, qualify, verify licensing or certification, and negotiate fees and service level expectations with persons who are part of an appraiser panel;\n(3) receive an order for an appraisal from one person, and deliver the order for the appraisal to an appraiser that is part of an appraiser panel for completion;\n(4) track and determine the status of orders for appraisals;\n(5) conduct quality control of a completed appraisal prior to the delivery of the appraisal to the person that ordered the appraisal; or\n(6) provide a completed appraisal performed by an appraiser to one or more clients.\n\"Appraiser\" means a person who is expected to perform valuation services competently and in a manner that is independent, impartial, and objective, and who is licensed under chapter 82B.\n\"Appraiser panel\" means a network of licensed or certified appraisers who are independent contractors to the appraisal management company that have:\n(1) responded to an invitation, request, or solicitation from an appraisal management company, in any form, to perform appraisals for persons that have ordered appraisals through the appraisal management company, or to perform appraisals for the appraisal management company directly, on a periodic basis, as requested and assigned by the appraisal management company; and\n(2) been selected and approved by an appraisal management company to perform appraisals for any client of the appraisal management company that has ordered an appraisal through the appraisal management company, or to perform appraisals for the appraisal management company directly, on a periodic basis, as assigned by the appraisal management company.\n\"Appraisal review\" means the act of developing and communicating an opinion about the quality of another appraiser's work that was performed as part of an appraisal assignment, except that an examination of an appraisal for grammatical, typographical, or other similar errors that do not make a substantive valuation change shall not be an appraisal review.\n\"Appraisal Subcommittee\" means the Appraisal Subcommittee of the Federal Financial Institutions Examination Council.\n\"Client\" means any person or entity that contracts with, or otherwise enters into an agreement with, an appraisal management company for the performance of real estate appraisal services or appraisal management services. For purposes of this chapter, the appraisal management company is the party engaging the independent appraiser and can be the appraiser's client. However, this does not preclude an appraisal management company from acting as a duly authorized agent for a lender.\n\"Commissioner\" means the commissioner of commerce.\n\"Controlling person\" means:\n(1) any owner, officer, or director of an appraisal management company seeking to offer appraisal management services in this state;\n(2) an individual employed, appointed, or authorized by an appraisal management company that has the authority to enter into a contractual relationship with other persons for the performance of appraisal management services and has the authority to enter into agreements with appraisers for the performance of appraisals;\n(3) an individual who possesses, directly or indirectly, the power to direct or cause the direction of the management or policies of an appraisal management company; or\n(4) an individual who enters into:\n(i) contractual relationships with clients for the performance of appraisal management services; and\n(ii) agreements with employed and independent appraisers for the performance of real estate appraisal services.\n\"Employee\" means an individual who is treated as an employee for purposes of compliance with federal income tax laws.\n\"Federally regulated appraisal management company\" means an appraisal management company that is owned and controlled by an insured depository institution, as defined in United States Code, title 12, section 1813, and regulated by the Office of the Comptroller of the Currency, the Board of Governors of the Federal Reserve System, or the Federal Deposit Insurance Corporation.\n\"National Registry\" means the registry of state-registered appraisal management companies and federally regulated appraisal management companies maintained by the Appraisal Subcommittee.\n\"Person\" means a natural person, firm, partnership, limited liability partnership, corporation, association, limited liability company, or other form of business organization and the officers, directors, employees, or agents of that person.\n\"USPAP\" means the Uniform Standards of Professional Appraisal Practice as established by the Appraisal Foundation. State and federal regulatory authorities enforce the content of the current or applicable edition of USPAP.",
	"repealed": false
}