{
	"id": "256D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.09",
	"title": "256D.09 PAYMENT; ASSESSMENT; OVERPAYMENT.",
	"text": "Until the county agency has determined the initial eligibility of the applicant in accordance with section 256D.07, grants for emergency general assistance must be in the form of vouchers or vendor payments unless the county agency determines that a cash grant will best resolve the applicant's need for emergency assistance. Thereafter, grants of general assistance must be paid in cash, by electronic benefit transfer, or by direct deposit into the recipient's account in a financial institution, on the first day of the month, except as allowed in this section.\nNotwithstanding the provisions of subdivision 1, the commissioner shall provide by rule for situations in which vouchers or vendor payments may be issued by county agencies because of the inability of the recipient to manage a general assistance grant for personal or family benefit.\nIf, at the time of application or at any other time, there is a reasonable basis for questioning whether a person applying for or receiving financial assistance is drug dependent, as defined in section 254A.02, subdivision 5, the person shall be referred for a chemical health assessment, and only emergency assistance payments or general assistance vendor payments may be provided until the assessment is complete and the results of the assessment made available to the county agency. A reasonable basis for referring an individual for an assessment exists when:\n(1) the person has required detoxification two or more times in the past 12 months;\n(2) the person appears intoxicated at the county agency as indicated by two or more of the following:\n(i) the odor of alcohol;\n(ii) slurred speech;\n(iii) disconjugate gaze;\n(iv) impaired balance;\n(v) difficulty remaining awake;\n(vi) consumption of alcohol;\n(vii) responding to sights or sounds that are not actually present;\n(viii) extreme restlessness, fast speech, or unusual belligerence;\n(3) the person has been involuntarily committed for drug dependency at least once in the past 12 months; or\n(4) the person has received treatment, including domiciliary care, for drug abuse or dependency at least twice in the past 12 months.\nThe assessment and determination of drug dependency, if any, must be made by an assessor qualified under section 245G.11, subdivisions 1 and 5, to perform an assessment of chemical use. The county shall only provide emergency general assistance or vendor payments to an otherwise eligible applicant or recipient who is determined to be drug dependent, except up to 15 percent of the grant amount the person would otherwise receive may be paid in cash. Notwithstanding subdivision 1, the commissioner of human services shall also require county agencies to provide assistance only in the form of vendor payments to all eligible recipients who assert substance use disorder as a basis for eligibility under section 256D.05, subdivision 1, paragraph (a), clauses (1) and (5).\nThe determination of drug dependency shall be reviewed at least every 12 months. If the county determines a recipient is no longer drug dependent, the county may cease vendor payments and provide the recipient payments in cash.\nIf at any time there is verification that the client's disability is dependent upon the client's continued drug addiction or alcoholism, general assistance for rent and utilities must be made in the form of vendor payments.\nVerification of drug addiction or alcoholism can be received from:\n(1) denial of Social Security benefits based on drug addiction or alcoholism;\n(2) a statement from the state medical review team that the person's disability is dependent upon continued drug addiction or alcoholism; or\n(3) a doctor's statement that the person's disability is dependent upon continued drug addiction or alcoholism.\n[Repealed, 1992 c 513 art 8 s 59]\n[Repealed, 1991 c 292 art 5 s 82]\nThe affected county may require that assistance paid under the emergency general assistance program in the form of a rental unit damage deposit, less any amount retained by the landlord to remedy a tenant's default in payment of rent or other funds due to the landlord pursuant to a rental agreement, or to restore the premises to the condition at the commencement of the tenancy, ordinary wear and tear excepted, be returned to the county when the individual vacates the premises or paid to the recipient's new landlord as a vendor payment. The vendor payment of returned funds shall not be considered a new use of emergency assistance.\n[Repealed, 2015 c 71 art 5 s 34]",
	"repealed": false
}