{
	"id": "375.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.101",
	"title": "375.101 VACANCY IN OFFICE OF COUNTY COMMISSIONER.",
	"text": "(a) Except as provided in subdivision 3, a vacancy in the office of county commissioner may be filled as provided in this subdivision and subdivision 2, or as provided in subdivision 4. If the vacancy is to be filled under this subdivision and subdivision 2, it must be filled at a special election. The county board may by resolution call for a special election to be held on a date authorized by section 205.10, subdivision 3a.\n(b) The person elected at the special election shall take office immediately after receipt of the certificate of election and upon filing the bond and taking the oath of office and shall serve the remainder of the unexpired term. If the county has been reapportioned since the commencement of the term of the vacant office, the election shall be based on the district as reapportioned.\nIf a vacancy for which a special election is required occurs less than 120 days before the general election preceding the end of the term, the vacancy shall be filled by the person elected at that election for the ensuing term who shall take office immediately after receiving the certificate of election, filing the bond and taking the oath of office.\nIn addition to the events specified in section 351.02, a vacancy in the office of county commissioner may be declared by the county board when a commissioner is unable to serve in the office or attend board meetings for a 90-day period because of illness, or because of absence from or refusal to attend board meetings for a 90-day period. If any of the preceding conditions occurs, the county board may, after the board by resolution has declared a vacancy to exist, make an appointment to fill the vacancy at a regular or special meeting for the remainder of the unexpired term or until the ill or absent member is again able to resume duties and attend county board meetings, whichever is earlier. If the original member is again able to resume duties and attend board meetings, the board shall by resolution so determine and remove the appointed officeholder and restore the original member to office.\nExcept as provided in subdivision 3, and as an alternative to the procedure provided in subdivisions 1 and 2, any other vacancy in the office of county commissioner may be filled by board appointment at a regular or special meeting. The appointment shall be evidenced by a resolution entered in the minutes and shall continue until an election is held under this subdivision. All elections to fill vacancies shall be for the unexpired term. If one year or more remains in the unexpired term, a special election must be held under subdivision 1. If less than one year remains in the unexpired term, the county board may appoint a person to fill the vacancy for the remainder of the unexpired term, unless the vacancy occurs within 90 days of the next county general election, in which case an appointment shall not be made and the vacancy must be filled at the general election. The person elected to fill a vacancy at the general election takes office immediately in the same manner as for a special election under subdivision 1, and serves the remainder of the unexpired term and the new term for which the election was otherwise held.\nBefore making an appointment to fill a vacancy under subdivision 4, the county board must hold a public hearing not more than 30 days after the vacancy occurs with public notice given in the same manner as for a special meeting of the county board. At the public hearing the board must invite public testimony from persons residing in the district in which the vacancy occurs relating to the qualifications of prospective appointees to fill the vacancy. Before making an appointment, the board also must notify public officials in the affected district on the appointment, including town board and city council members, and must enter into the record at the board meeting in which the appointment is made the names and addresses of the public officials notified. If after the public hearing, the board is unable or decides not to make an appointment under subdivision 4, it must hold a special election under subdivision 1, but the time period in which the election must be held begins to run from the date of the public hearing.",
	"repealed": false
}