{
	"id": "469.050",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.050",
	"title": "469.050 COMMISSIONERS; TERMS, VACANCIES, PAY, CONTINUITY.",
	"text": "The Port Authority of Saint Paul consists of seven commissioners, two of whom must be members of the city council. The mayor shall appoint the commissioners with the consent of the city council.\nThe Seaway Port Authority of Duluth consists of seven commissioners: three appointed by the Duluth city council; two by the St. Louis County board; and two by the governor.\nA member of the St. Louis County delegation of the state house of representatives appointed by that delegation, and a member of the St. Louis County delegation of the state senate appointed by that delegation are advisory members of the authority.\nA port authority established under law by a city council of a city other than a city of the first class may have three members appointed by the city council or seven members appointed as provided in subdivision 1, unless a different number or procedure is set out in the enabling law. A three-member authority under this subdivision may be increased to a seven-member authority appointed as provided under subdivision 1 by resolution of the city council.\nThe first commissioners of a three-member commission are appointed for initial terms as follows: one for two years; one for four years; and one for six years. The first commissioners of a seven-member commission are appointed for initial terms as follows: one member for a term of one, two, three, four, and five years, respectively, and two members for terms of six years. For subsequent terms, the term is six years. A vacancy is created in Saint Paul when a city council member of the authority ends council membership and in Duluth when a county board member of the authority ends county board membership. A vacancy on any port authority must be filled by the appointing authority for the balance of the term subject to the same approval and consent, if any, required for an appointment for a full term. For Duluth, if the governor or the county board fails to make a required appointment within 60 days after a vacancy occurs, the city council has sole power to appoint a successor.\nA commissioner, including the president, must be compensated as provided in section 15.0575, subdivision 3, for each regular or special port authority meeting attended. The advisory members of the Duluth authority from the legislature must not be paid for their service to the authority.",
	"repealed": false
}