{
	"id": "319B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.07",
	"title": "319B.07 OWNERSHIP INTERESTS.",
	"text": "Ownership interests in a professional firm may not be owned or held, either directly or indirectly, except by any of the following:\n(1) professionals who, with respect to at least one category of the pertinent professional services, are licensed and not disqualified;\n(2) general partnerships, other than limited liability partnerships, authorized to furnish at least one category of the professional firm's pertinent professional services;\n(3) other professional firms authorized to furnish at least one category of the professional firm's pertinent professional services;\n(4) a voting trust established with respect to some or all of the ownership interests in the professional firm, if (i) the professional firm's generally applicable governing law permits the establishment of voting trusts, and (ii) all the voting trustees and all the holders of beneficial interests in the trust are professionals licensed to furnish at least one category of the pertinent professional services;\n(5) an employee stock ownership plan as defined in section 4975(e)(7) of the Internal Revenue Code of 1986, as amended, if (i) all the voting trustees of the plan are professionals licensed to furnish at least one category of the pertinent professional services, and (ii) the ownership interests are not directly issued to anyone other than professionals licensed to furnish at least one category of the pertinent professional services; and\n(6) sole ownership by a surviving spouse of a deceased professional who was the sole owner of the professional firm at the time of the professional's death, but only during the period of time ending one year after the death of the professional.\nA professional firm may not sell, grant, give, allocate, issue, or otherwise transfer an ownership interest except to persons who meet the requirements of subdivision 1. No owner may transfer an ownership interest except to persons who meet the requirements of subdivision 1. These restrictions apply regardless of whether a purported sale, grant, gift, allocation, issuance, or other transfer:\n(1) is voluntary or involuntary;\n(2) constitutes a present transfer or an undertaking to make future transfer or to allow the transferee to cause a future transfer to occur; or\n(3) is permanent or subject to defeasement.\n(a) Except as permitted by this paragraph, no professional firm may sell, grant, give, allocate, issue, or otherwise transfer a partial right. Unless prohibited by its generally applicable governing law or some provision of a document or agreement permitted by its generally applicable governing law, a professional firm may:\n(1) subject to section 319B.08, subdivision 3, sell, grant, give, allocate, issue, or otherwise transfer an option to acquire an entire ownership interest to a person who meets the requirements of subdivision 1; and\n(2) subject to its licensing law, undertake to make payments, in the nature of separation, retirement, or death benefits, on account of a former owner who has died, become disqualified, or for any other reason has ceased to be an owner.\n(b) Except as permitted by this paragraph, no owner may transfer any partial right. Unless prohibited by the professional firm's generally applicable governing law or some provision of a document or agreement authorized by the professional firm's generally applicable governing law, an owner may, subject to section 319B.09:\n(1) enter into an agreement with other owners of the professional firm regarding voting rights and other aspects of management; and\n(2) grant a proxy to a person who meets the requirements of subdivision 1.\n(c) Except as permitted by paragraphs (a) and (b), no person may hold or transfer a partial right. These restrictions apply regardless of whether a purported transfer:\n(1) is voluntary or involuntary;\n(2) constitutes a present transfer or an undertaking to make a future transfer or to allow the transferee to cause a future transfer to occur; or\n(3) is permanent or subject to defeasement.\nA sale, grant, gift, allocation, issuance, undertaking, creation, pledge, or other transfer in violation of this section is void.\nIf permitted by its generally applicable governing law, a professional firm may further restrict the transfer of ownership interests and partial rights.\nChapter 80A does not apply to or govern a transaction relating to an ownership interest of a professional firm.",
	"repealed": false
}