{
	"id": "84.804",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.804",
	"title": "84.804 OPERATION REQUIREMENTS; LOCAL REGULATION.",
	"text": "(a) A person may not operate a vehicle off-road within a public road right-of-way in this state except on a trail designated by the commissioner and approved by the unit of government having jurisdiction over the right-of-way.\n(b) A person may not operate a vehicle off-road within a public road right-of-way between the hours of one-half hour after sunset to one-half hour before sunrise, except on the right-hand side of the right-of-way and in the same direction as traffic on the nearest lane of the road.\n(c) A person may not operate an off-road vehicle within the right-of-way of an interstate highway.\n(a) An off-road vehicle not registered under chapter 168 may make a direct crossing of a public road right-of-way for the purpose of continuing on a designated off-road trail if:\n(1) the crossing is made at an angle of approximately 90 degrees to the direction of the road and at a place where no obstruction prevents a quick and safe crossing;\n(2) the vehicle is brought to a complete stop before crossing the shoulder or main-traveled way of the road;\n(3) the driver yields the right-of-way to all traffic;\n(4) in crossing a divided road, the crossing is made only at an intersection of the road with another public road; and\n(5) if the crossing is made between the hours of one-half hour after sunset to one-half hour before sunrise or in conditions of reduced visibility, only if both front and rear lights are on.\n(b) An off-road vehicle not registered under chapter 168 may be operated on a bridge, other than a bridge that is part of the main-traveled lanes of an interstate highway, or a roadway shoulder or inside bank of a public road right-of-way when required to avoid obstructions to travel and no other method of avoidance is possible, provided that the vehicle is operated in the farthest right-hand lane, the entrance to the roadway is made within 100 feet of the bridge or obstacle, and the crossing is made without undue delay.\n(c) A person may not operate an off-road vehicle on a public street or highway unless the off-road vehicle is equipped with at least one headlight and one taillight, each of minimum candlepower as prescribed by rules of the commissioner, and with brakes conforming to standards prescribed by rule of the commissioner, and all of which are subject to the approval of the commissioner of public safety.\n(d) Chapter 169 applies to the operation of off-road vehicles on streets and highways, except that those provisions that by their nature have no application and those provisions relating to required equipment do not apply to vehicles not registered under chapter 168. Chapter 169A applies to the operation of off-road vehicles anywhere in the state and on the ice of boundary waters.\n(e) A road authority, as defined in section 160.02, subdivision 25, may, with the approval of the commissioner, designate access trails on public road rights-of-way for gaining access to established off-road vehicle trails.\nA person may not drive or operate a vehicle off-road:\n(1) at a rate of speed greater than is reasonable under the surrounding circumstances;\n(2) in a careless, reckless, or negligent manner which may endanger or cause injury or damage to the person or property of another;\n(3) without a functioning stoplight if so equipped;\n(4) in a tree nursery or planting in a manner that damages or destroys growing stock;\n(5) without a brake operational by either hand or foot; or\n(6) in a manner that violates rules adopted by the commissioner.\nIt is unlawful for a person to drive or operate an off-road vehicle on an airport, as defined in section 360.013, subdivision 39, except in connection with the operation of the airport.\n(a) Nothing in this section or chapter 169 prohibits the use of vehicles off-road within the right-of-way of a state trunk or county state-aid highway or on public lands or waters under the jurisdiction of the commissioner in an organized contest or event, subject to the consent of the official or board having jurisdiction over the highway or public lands or waters.\n(b) In permitting the contest or event, the official or board having jurisdiction must obtain the commissioner's approval and may prescribe restrictions or conditions it considers advisable.\n(a) Subject to paragraphs (b) and (c), a county, city, or town acting through its governing body may regulate the operation of off-road vehicles on public lands, waters, and property under its jurisdiction, other than public road rights-of-way within its boundaries, by ordinance of the governing body and by giving appropriate notice.\n(b) The ordinance must be consistent with sections 84.797 to 84.804 and rules adopted under section 84.80.\n(c) An ordinance may not impose a fee for the use of public land or water under the jurisdiction of the Department of Natural Resources or another agency of the state, or for the use of an access to the public land or water owned by the state, a county, or a city.",
	"repealed": false
}