{
	"id": "245.4881",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4881",
	"title": "245.4881 CASE MANAGEMENT AND FAMILY COMMUNITY SUPPORT SERVICES.",
	"text": "(a) The county board shall provide case management services for each child with severe emotional disturbance who is a resident of the county and the child's family who request or consent to the services. Case management services must be offered to a child with a serious emotional disturbance who is over the age of 18 consistent with section 245.4875, subdivision 8, or the child's legal representative, provided the child's service needs can be met within the children's service system. Before discontinuing case management services under this subdivision for children between the ages of 17 and 21, a transition plan must be developed. The transition plan must be developed with the child and, with the consent of a child age 18 or over, the child's parent, guardian, or legal representative. The transition plan should include plans for health insurance, housing, education, employment, and treatment. Staffing ratios must be sufficient to serve the needs of the clients. The case manager must meet the requirements in section 245.4871, subdivision 4.\n(b) Except as permitted by law and the commissioner under demonstration projects, case management services provided to children with severe emotional disturbance eligible for medical assistance must be billed to the medical assistance program under sections 256B.02, subdivision 8, and 256B.0625.\n(c) Case management services are eligible for reimbursement under the medical assistance program. Costs of mentoring, supervision, and continuing education may be included in the reimbursement rate methodology used for case management services under the medical assistance program.\n(a) The county board shall notify, as appropriate, the child, child's parent, or child's legal representative of the child's potential eligibility for case management services within five working days after receiving a request from an individual or a referral from a provider under section 245.4876, subdivision 4.\n(b) The county board shall send a notification written in plain language of potential eligibility for case management and family community support services. The notification shall identify the designated case management providers and shall contain:\n(1) a brief description of case management and family community support services;\n(2) the potential benefits of these services;\n(3) the identity and current phone number of the county employee designated to coordinate case management activities;\n(4) an explanation of how to obtain county assistance in obtaining a diagnostic assessment, if needed; and\n(5) an explanation of the appeal process.\nThe county board shall send the notice, as appropriate, to the child, the child's parent, or the child's legal representative, if any.\n(c) The county board must promptly determine whether a child who requests or is referred for case management services meets the criteria of section 245.4871, subdivision 6. If a diagnostic assessment is needed to make the determination, the county board must offer to assist the child and the child's family in obtaining one. The county board shall notify, in writing, the child and the child's representative, if any, of the eligibility determination. If the child is determined to be eligible for case management services, and if the child and the child's family consent to the services, the county board shall refer the child to the case management provider for case management services. If the child is determined not to be eligible or refuses case management services, the county board shall notify the child of the appeal process and shall offer to refer the child to a mental health provider or other appropriate service provider and to assist the child in making an appointment with the provider of the child's choice.\n(a) Upon a determination of eligibility for case management services, the case manager shall develop an individual family community support plan for a child as specified in subdivision 4, review the child's progress, and monitor the provision of services. If services are to be provided in a host county that is not the county of financial responsibility, the case manager shall consult with the host county and obtain a letter demonstrating the concurrence of the host county regarding the provision of services.\n(b) The case manager shall note in the child's record the services needed by the child and the child's family, the services requested by the family, services that are not available, and the unmet needs of the child and child's family. The case manager shall note this provision in the child's record.\n(a) For each child, the case manager must develop an individual family community support plan that incorporates the child's individual treatment plan. The individual treatment plan may not be a substitute for the development of an individual family community support plan. The case manager is responsible for developing the individual family community support plan within 30 days of intake based on a diagnostic assessment and for implementing and monitoring the delivery of services according to the individual family community support plan. The case manager must review the plan at least every 180 calendar days after it is developed, unless the case manager has received a written request from the child's family or an advocate for the child for a review of the plan every 90 days after it is developed. To the extent appropriate, the child with severe emotional disturbance, the child's family, advocates, service providers, and significant others must be involved in all phases of development and implementation of the individual family community support plan. Notwithstanding the lack of an individual family community support plan, the case manager shall assist the child and child's family in accessing the needed services listed in section 245.4884, subdivision 1.\n(b) The child's individual family community support plan must state:\n(1) the goals and expected outcomes of each service and criteria for evaluating the effectiveness and appropriateness of the service;\n(2) the activities for accomplishing each goal;\n(3) a schedule for each activity; and\n(4) the frequency of face-to-face contacts by the case manager, as appropriate to client need and the implementation of the individual family community support plan.\nThe county board must establish procedures that ensure ongoing contact and coordination between the case manager and the family community support services as well as other mental health services for each child.\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]",
	"repealed": false
}