{
	"id": "559.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/559.21",
	"title": "559.21 CONTRACT TERMINATION; NOTICE; SERVICE; COSTS; CONDITIONS.",
	"text": "MS 1984 [Repealed, 1Sp1985 c 18 s 16]\nMS 1984 [Repealed, 1Sp1985 c 18 s 16]\nIf a default occurs in the conditions of a contract for the conveyance of real estate or an interest in real estate executed on or prior to August 1, 1976, that gives the seller a right to terminate it, the seller may terminate the contract by serving upon the purchaser or the purchaser's personal representatives or assigns, within or outside the state, a notice specifying the conditions in which default has been made. The notice must state that the contract will terminate 30 days after the service of the notice, unless prior to the termination date the purchaser:\n(1) complies with the conditions in default;\n(2) pays the costs of service of the notice, including the reasonable costs of service by sheriff, public officer, or private process server; except payment of costs of service is not required unless the seller notifies the purchaser of the actual costs of service by certified mail to the purchaser's last known address at least ten days prior to the date of termination; and\n(3) pays an amount to apply on attorneys' fees actually expended or incurred, of $50 if the amount in default is less than $500, and of $100 if the amount in default is $500 or more; except no amount is required to be paid for attorneys' fees unless some part of the conditions of default has existed for at least 45 days prior to the date of service of the notice.\nIf a default occurs in the conditions of a contract for the conveyance of real estate or an interest in real estate executed after August 1, 1976, and prior to May 1, 1980, that gives the seller a right to terminate it, the seller may terminate the contract by serving upon the purchaser or the purchaser's personal representatives or assigns, within or outside the state, a notice specifying the conditions in which default has been made. The notice must state that the contract will terminate 30 days after the service of the notice if the purchaser has paid less than 30 percent of the purchase price, 45 days after service of the notice if the purchaser has paid 30 percent or more of the purchase price but less than 50 percent, or 60 days after service of the notice if the purchaser has paid 50 percent or more of the purchase price; unless prior to the termination date the purchaser:\n(1) complies with the conditions in default;\n(2) pays the costs of service of the notice, including the reasonable costs of service by sheriff, public officer, or private process server; except payment of costs of service is not required unless the seller notifies the purchaser of the actual costs of service by certified mail to the purchaser's last known address at least ten days prior to the date of termination; and\n(3) pays an amount to apply on attorneys' fees actually expended or incurred, of $75 if the amount in default is less than $750, and of $200 if the amount in default is $750 or more; except no amount is required to be paid for attorneys' fees unless some part of the conditions of default has existed for at least 45 days prior to the date of service of the notice.\nIf a default occurs in the conditions of a contract for the conveyance of real estate or an interest in real estate executed on or after May 1, 1980 and prior to August 1, 1985, that gives the seller a right to terminate it, the seller may terminate the contract by serving upon the purchaser or the purchaser's personal representatives or assigns, within or outside the state, a notice specifying the conditions in which default has been made. The notice must state that the contract will terminate 30 days after the service of the notice if the purchaser has paid less than ten percent of the purchase price, 60 days after service of the notice if the purchaser has paid ten percent or more of the purchase price but less than 25 percent, or 90 days after service of the notice if the purchaser has paid 25 percent or more of the purchase price; unless prior to the termination date the purchaser:\n(1) complies with the conditions in default;\n(2) makes all payments due and owing to the seller under the contract through the date that payment is made;\n(3) pays the costs of service of the notice, including the reasonable costs of service by sheriff, public officer, or private process server; except payment of costs of service is not required unless the seller notifies the purchaser of the actual costs of service by certified mail to the purchaser's last known address at least ten days prior to the date of termination; and\n(4) pays an amount to apply on attorneys' fees actually expended or incurred, of $125 if the amount in default is less than $750, and of $250 if the amount in default is $750 or more; except no amount is required to be paid for attorneys' fees unless some part of the conditions of default has existed for at least 45 days prior to the date of service of the notice.\nFor purposes of determining the purchase price and the amount of the purchase price paid on contracts executed prior to August 1, 1985:\n(a) The purchase price is the sale price under the contract alleged to be in default, including the initial down payment. Mortgages, prior contracts for deed, special assessments, delinquent real estate taxes, or other obligations or encumbrances assumed by the purchaser are excluded in determining the purchase price.\n(b) The amount paid by the purchaser is the total of payments of principal made under the contract alleged to be in default, including the initial down payment. Interest payments and payments made under mortgages, prior contracts for deed, special assessments, delinquent real estate taxes, or other obligations or encumbrances assumed by the purchaser are excluded in determining the amount paid by the purchaser.\nMS 1984 [Repealed, 1Sp1985 c 18 s 16]\nIf a default occurs in the conditions of a contract for the conveyance of real estate or an interest in real estate executed on or after August 1, 1985, that gives the seller a right to terminate it, the seller may terminate the contract by serving upon the purchaser or the purchaser's personal representatives or assigns, within or outside of the state, a notice specifying the conditions in which default has been made. The notice must state that the contract will terminate 60 days, or a shorter period allowed or a longer period required in subdivision 4, after the service of the notice, unless prior to the termination date the purchaser:\n(1) complies with the conditions in default;\n(2) makes all payments due and owing to the seller under the contract through the date that payment is made;\n(3) pays the costs of service of the notice, including the reasonable costs of service by sheriff, public officer, or private process server; except payment of costs of service is not required unless the seller notifies the purchaser of the actual costs of service by certified mail to the purchaser's last known address at least ten days prior to the date of termination;\n(4) except for earnest money contracts, purchase agreements, and exercised options, pays two percent of any amount in default at the time of service, not including the final balloon payment, any taxes, assessments, mortgages, or prior contracts that are assumed by the purchaser; and\n(5) if the contract for deed is executed on or after August 1, 2024, pays an amount to apply on attorneys' fees actually expended or incurred of $1,000; if the contract is executed on or after August 1, 1999, and before August 1, 2024, pays an amount to apply on attorneys' fees actually expended or incurred, of $250 if the amount in default is less than $1,000, and of $500 if the amount in default is $1,000 or more; or if the contract is executed before August 1, 1999, pays an amount to apply on attorneys' fees actually expended or incurred, of $125 if the amount in default is less than $750, and of $250 if the amount in default is $750 or more; except that no amount for attorneys' fees is required to be paid unless some part of the conditions of default has existed for at least 30 days prior to the date of service of the notice.\nFor purposes of this section, the term \"notice\" means a writing stating the information required in this section, stating the name, address and telephone number of the seller or of an attorney authorized by the seller to accept payments pursuant to the notice and the fact that the person named is authorized to receive the payments, stating a mailing address and a street address or location where the seller or the attorney will accept payment pursuant to the notice, and including the following information in 12-point or larger underlined uppercase type, or 8-point type if published, or in large legible handwritten letters:\nTHIS NOTICE IS TO INFORM YOU THAT BY THIS NOTICE THE SELLER HAS BEGUN PROCEEDINGS UNDER MINNESOTA STATUTES, SECTION 559.21, TO TERMINATE YOUR CONTRACT FOR THE PURCHASE OF YOUR PROPERTY FOR THE REASONS SPECIFIED IN THIS NOTICE. THE CONTRACT WILL TERMINATE ..... DAYS AFTER (SERVICE OF THIS NOTICE UPON YOU) (THE FIRST DATE OF PUBLICATION OF THIS NOTICE) (STRIKE ONE) UNLESS BEFORE THEN:\n(a) THE PERSON AUTHORIZED IN THIS NOTICE TO RECEIVE PAYMENTS RECEIVES FROM YOU:\n(1) THE AMOUNT THIS NOTICE SAYS YOU OWE; PLUS\n(2) THE COSTS OF SERVICE (TO BE SENT TO YOU); PLUS\n(3) $........... TO APPLY TO ATTORNEYS' FEES ACTUALLY EXPENDED OR INCURRED; PLUS\n(4) FOR CONTRACTS EXECUTED ON OR AFTER MAY 1, 1980, ANY ADDITIONAL PAYMENTS BECOMING DUE UNDER THE CONTRACT TO THE SELLER AFTER THIS NOTICE WAS SERVED ON YOU; PLUS\n(5) FOR CONTRACTS, OTHER THAN EARNEST MONEY CONTRACTS, PURCHASE AGREEMENTS, AND EXERCISED OPTIONS, EXECUTED ON OR AFTER AUGUST 1, 1985, $.... (WHICH IS TWO PERCENT OF THE AMOUNT IN DEFAULT AT THE TIME OF SERVICE OTHER THAN THE FINAL BALLOON PAYMENT, ANY TAXES, ASSESSMENTS, MORTGAGES, OR PRIOR CONTRACTS THAT ARE ASSUMED BY YOU); OR\n(b) YOU SECURE FROM A COUNTY OR DISTRICT COURT AN ORDER THAT THE TERMINATION OF THE CONTRACT BE SUSPENDED UNTIL YOUR CLAIMS OR DEFENSES ARE FINALLY DISPOSED OF BY TRIAL, HEARING OR SETTLEMENT. YOUR ACTION MUST SPECIFICALLY STATE THOSE FACTS AND GROUNDS THAT DEMONSTRATE YOUR CLAIMS OR DEFENSES.\nIF YOU DO NOT DO ONE OR THE OTHER OF THE ABOVE THINGS WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE, YOUR CONTRACT WILL TERMINATE AT THE END OF THE PERIOD AND YOU WILL LOSE ALL THE MONEY YOU HAVE PAID ON THE CONTRACT; YOU WILL LOSE YOUR RIGHT TO POSSESSION OF THE PROPERTY; YOU MAY LOSE YOUR RIGHT TO ASSERT ANY CLAIMS OR DEFENSES THAT YOU MIGHT HAVE; AND YOU WILL BE EVICTED. IF YOU HAVE ANY QUESTIONS ABOUT THIS NOTICE, CONTACT AN ATTORNEY IMMEDIATELY.\n(a) The notice required by this section must be given notwithstanding any provisions in the contract to the contrary, except that (1) earnest money contracts, purchase agreements, and exercised options that are subject to this section may, unless by their terms they provide for a longer termination period, be terminated on 30 days' notice, or may be canceled under section 559.217 and (2) contracts for deed executed by an investor seller shall be terminated on 90 days' notice. The notice must be served within the state in the same manner as a summons in the district court, and outside of the state, in the same manner, and without securing any sheriff's return of not found, making any preliminary affidavit, mailing a copy of the notice or doing any other preliminary act or thing whatsoever. Service of the notice outside of the state may be proved by the affidavit of the person making the same, made before an authorized officer having a seal, and within the state by such an affidavit or by the return of the sheriff of any county therein.\n(b) If a person to be served is a resident individual who has departed from the state, or cannot be found in the state; or is a nonresident individual or a foreign corporation, partnership, or association, service may be made by publication as provided in this paragraph. Three weeks' published notice has the same effect as personal service of the notice. The published notice must comply with subdivision 3 and state (1) that the person to be served is allowed 90 days after the first date of publication of the notice to comply with the conditions of the contract, and (2) that the contract will terminate 90 days after the first date of publication of the notice, unless before the termination date the purchaser complies with the notice. If the real estate described in the contract is actually occupied, then, in addition to publication, a person in possession must be personally served, in like manner as the service of a summons in a civil action in state district court, within 30 days after the first date of publication of the notice. If an address of a person to be served is known, then within 30 days after the first date of publication of the notice a copy of the notice must be mailed to the person's last known address by first class mail, postage prepaid.\n(c) The contract is reinstated if, within the time mentioned, the person served:\n(1) complies with the conditions in default;\n(2) if subdivision 1d or 2a applies, makes all payments due and owing to the seller under the contract through the date that payment is made;\n(3) pays the costs of service as provided in subdivision 1b, 1c, 1d, or 2a;\n(4) if subdivision 2a applies, pays two percent of the amount in default, not including the final balloon payment, any taxes, assessments, mortgages, or prior contracts that are assumed by the purchaser; and\n(5) pays attorneys' fees as provided in subdivision 1b, 1c, 1d, or 2a.\n(d) The contract is terminated if the provisions of paragraph (c) are not met.\n(e) In the event that the notice was not signed by an attorney for the seller and the seller is not present in the state, or cannot be found in the state, then compliance with the conditions specified in the notice may be made by paying to the court administrator of the district court in the county wherein the real estate or any part thereof is situated any money due and filing proof of compliance with other defaults specified, and the court administrator of the district court shall be deemed the agent of the seller for such purposes. A copy of the notice with proof of service thereof, and the affidavit of the seller, the seller's agent or attorney, showing that the purchaser has not complied with the terms of the notice, may be recorded with the county recorder or registrar of titles, and is prima facie evidence of the facts stated in it; but this section in no case applies to contracts for the sale or conveyance of lands situated in another state or in a foreign country. If the notice is served by publication, the affidavit must state that the affiant believes that the party to be served is not a resident of the state, or cannot be found in the state, and either that the affiant has mailed a copy of the notice by first class mail, postage prepaid, to the party's last known address, or that such address is not known to the affiant.\n(f) No notice under this section may be given for a contract for deed executed by an investor seller unless, at least 30 days prior to the service of the notice, some part of the conditions of default has existed and the investor seller has notified the purchaser of such conditions of default by certified mail to the purchaser's last known address.\n(g) For purposes of this subdivision, \"investor seller\" has the meaning given in section 559A.01, subdivision 6.\n(a) Notwithstanding any provisions in a contract for deed to the contrary, the notice under this section may not be given and no other remedies may be exercised for any contract for deed based on any of the following transfers:\n(1) a transfer on death deed conveying or assigning the deceased purchaser's interest in the property to a grantee beneficiary;\n(2) a transfer by devise, descent, or operation of law on the death of a joint tenant occurs;\n(3) a transfer by which the spouse or children of the purchaser become an owner of the property;\n(4) a transfer resulting from a decree of a dissolution of marriage, legal separation agreement, or from an incidental property settlement agreement, by which the spouse of the purchaser becomes an owner of the property; or\n(5) a transfer into an inter vivos trust by which the purchaser is and remains a beneficiary and which does not relate to a transfer of rights of occupancy in the property.\n(b) For the purposes of this subdivision, \"contract for deed\" has the meaning given in section 507.235, subdivision 1a, paragraph (e).\n(a) Notwithstanding subdivision 2a or any provision to the contrary in a contract for deed, a vendor may not terminate a contract for deed under this section if the contract has not been recorded as required under section 507.235, subdivision 1a, paragraph (b), and the vendor has failed to make a good faith effort to record the contract as provided under section 507.235, subdivision 1a, paragraph (d).\n(b) Nothing contained in this subdivision bars judicial termination of a contract for deed.\n(c) For the purposes of this subdivision, \"contract for deed\" has the meaning given in section 507.235, subdivision 1a, paragraph (e).\nWhen required by and in the manner provided in section 270C.63, subdivision 11, the notice required by this section shall also be given to the commissioner of revenue.\nMS 1988 [Repealed, 1983 c 215 s 16; 1984 c 474 s 7; 1985 c 306 s 26; 1987 c 292 s 36; 1989 c 350 art 16 s 7]\nThe state of Minnesota shall cancel any sale of land made by the state under an installment contract upon default therein only in accord with the provisions of this section.\nAny attorney expressly authorized by the seller to receive payments in the notice of termination under this section is designated as the attorney who may receive service as agent for the seller of all summons, complaints, orders, and motions made in conjunction with an action by the purchaser to restrain the termination. Service in the action may be made upon the seller by mailing a copy of the process to the seller or to the seller's attorney, by first class mail, postage prepaid, to the address stated in the notice where payments will be accepted.\nIn any instance where the copy of the notice of default, proof of service of the notice, and an affidavit showing that the purchaser has not complied with the terms of the notice have been or may be recorded, an affidavit of the seller, the seller's agent, or attorney verified by a person having knowledge of the facts and attesting that the property is not residential real property, the seller is not an investor seller or the seller has complied with the requirements of subdivision 4, paragraph (f), may be recorded with the county recorder or registrar of titles and is prima facie evidence of the facts stated in the affidavit.",
	"repealed": false
}