{
	"id": "176.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.181",
	"title": "176.181 INSURANCE.",
	"text": "Any employer responsible for compensation may insure the risk in any manner authorized by law.\n(a) Every employer, except the state and its municipal subdivisions, liable under this chapter to pay compensation shall insure payment of compensation with some insurance carrier authorized to insure workers' compensation liability in this state, or obtain a written order from the commissioner of commerce exempting the employer from insuring liability for compensation and permitting self-insurance of the liability. The terms, conditions and requirements governing self-insurance shall be established by the commissioner pursuant to chapter 14. The commissioner of commerce shall also adopt, pursuant to paragraph (d), rules permitting two or more employers, whether or not they are in the same industry, to enter into agreements to pool their liabilities under this chapter for the purpose of qualifying as group self-insurers. With the approval of the commissioner of commerce, any employer may exclude medical, chiropractic and hospital benefits as required by this chapter. An employer conducting distinct operations at different locations may either insure or self-insure the other portion of operations as a distinct and separate risk. An employer desiring to be exempted from insuring liability for compensation shall make application to the commissioner of commerce, showing financial ability to pay the compensation, whereupon by written order the commissioner of commerce, on deeming it proper, may make an exemption. An employer may establish financial ability to pay compensation by providing financial statements of the employer to the commissioner of commerce. Upon ten days' written notice the commissioner of commerce may revoke the order granting an exemption, in which event the employer shall immediately insure the liability. As a condition for the granting of an exemption the commissioner of commerce may require the employer to furnish security the commissioner of commerce considers sufficient to insure payment of all claims under this chapter, consistent with subdivision 2b. If the required security is in the form of currency or negotiable bonds, the commissioner of commerce shall deposit it with the commissioner of management and budget. In the event of any default upon the part of a self-insurer to abide by any final order or decision of the commissioner of labor and industry directing and awarding payment of compensation and benefits to any employee or the dependents of any deceased employee, then upon at least ten days' notice to the self-insurer, the commissioner of commerce may by written order to the commissioner of management and budget require the commissioner of management and budget to sell the pledged and assigned securities or a part thereof necessary to pay the full amount of any such claim or award with interest thereon. This authority to sell may be exercised from time to time to satisfy any order or award of the commissioner of labor and industry or any judgment obtained thereon. When securities are sold the money obtained shall be deposited in the state treasury to the credit of the commissioner of commerce and awards made against any such self-insurer by the commissioner of commerce shall be paid to the persons entitled thereto by the commissioner of management and budget upon payments requested by the commissioner of commerce out of the proceeds of the sale of securities. Where the security is in the form of a surety bond or personal guaranty the commissioner of commerce, at any time, upon at least ten days' notice and opportunity to be heard, may require the surety to pay the amount of the award, the payments to be enforced in like manner as the award may be enforced.\n(b) No association, corporation, partnership, sole proprietorship, trust or other business entity shall provide services in the design, establishment or administration of a group self-insurance plan under rules adopted pursuant to this subdivision unless it is licensed, or exempt from licensure, pursuant to section 60A.23, subdivision 8, to do so by the commissioner of commerce. An applicant for a license shall state in writing the type of activities it seeks authorization to engage in and the type of services it seeks authorization to provide. The license shall be granted only when the commissioner of commerce is satisfied that the entity possesses the necessary organization, background, expertise, and financial integrity to supply the services sought to be offered. The commissioner of commerce may issue a license subject to restrictions or limitations, including restrictions or limitations on the type of services which may be supplied or the activities which may be engaged in.\n(c) To assure that group self-insurance plans are financially solvent, administered in a fair and capable fashion, and able to process claims and pay benefits in a prompt, fair and equitable manner, entities licensed to engage in such business are subject to supervision and examination by the commissioner of commerce.\n(d) To carry out the purposes of this subdivision, the commissioner of commerce may promulgate administrative rules pursuant to sections 14.001 to 14.69. These rules may:\n(1) establish reporting requirements for administrators of group self-insurance plans;\n(2) establish standards and guidelines consistent with subdivision 2b to assure the adequacy of the financing and administration of group self-insurance plans;\n(3) establish bonding requirements or other provisions assuring the financial integrity of entities administering group self-insurance plans;\n(4) establish standards, including but not limited to minimum terms of membership in self-insurance plans, as necessary to provide stability for those plans;\n(5) establish standards or guidelines governing the formation, operation, administration, and dissolution of self-insurance plans; and\n(6) establish other reasonable requirements to further the purposes of this subdivision.\nEvery initial application filed pursuant to subdivision 2 requesting authority to self-insure shall be accompanied by a nonrefundable fee of $4,000. When an employer seeks to be added as a member of an existing approved group under section 79A.03, subdivision 6, the proposed new member shall pay a nonrefundable $400 application fee to the commissioner at the time of application. Each annual report due August 1 under section 79A.03, subdivision 9, shall be accompanied by an annual fee of $500.\nMS 2006 [Renumbered 79A.04, subd 3a]\n(a) The commissioner, having reason to believe that an employer is in violation of subdivision 2, may issue an order directing the employer to comply with subdivision 2, to refrain from employing any person at any time without complying with subdivision 2, and to pay a penalty of up to $1,000 per employee per week during which the employer was not in compliance.\n(b) An employer shall have ten working days to contest such an order by filing a written objection with the commissioner, stating in detail its reasons for objecting. If the commissioner does not receive an objection within ten working days, the commissioner's order shall constitute a final order not subject to further review, and violation of that order shall be enforceable by way of civil contempt proceedings in district court. If the commissioner does receive a timely objection, the commissioner shall refer the matter to the Office of Administrative Hearings for an expedited hearing before a compensation judge. The compensation judge shall issue a decision either affirming, reversing, or modifying the commissioner's order within ten days of the close of the hearing. If the compensation judge affirms the commissioner's order, the compensation judge may order the employer to pay an additional penalty if the employer continued to employ persons without complying with subdivision 2 while the proceedings were pending.\n(c) All penalties assessed under this subdivision shall be payable to the commissioner for deposit in the assigned risk safety account. Penalties assessed under this section shall constitute a lien for government services pursuant to section 514.67, on all the employer's property and shall be subject to the Revenue Recapture Act in chapter 270A.\n(d) For purposes of this subdivision, the term \"employer\" includes any owners or officers of a corporation who direct and control the activities of employees.\nIn addition to being subject to the penalty prescribed in subdivision 3, any employer willfully and intentionally failing to comply with the provisions of subdivision 2 is guilty of a gross misdemeanor.\nA political subdivision or association of political subdivisions which is self-insured, may be indemnified by the special compensation fund for payments for which the political subdivision or association is liable under this chapter. This indemnification shall be made only if all other assets together with the interest earned thereon which have been contributed by the subdivision pursuant to rules adopted by the commissioner of commerce as provided for in this section have been exhausted.\nThe commissioner of management and budget, as custodian of the fund, has a cause of action for all money paid out or to be paid out if the political subdivisions or association of subdivisions fail to meet a repayment schedule which the commissioner of management and budget establishes at the time the request for indemnification is granted.\nMS 2020 [Repealed, 7Sp2020 c 1 art 2 s 22]\nAny entity that is self-insured pursuant to subdivision 2, and that knowingly violates any provision of subdivision 2 or any rule adopted pursuant thereto is subject to a civil penalty of not more than $10,000 for each offense.\n(a) The Departments of Labor and Industry, Employment and Economic Development, Human Services, Agriculture, Transportation, and Revenue are authorized to share information regarding the employment status of individuals, including but not limited to Social Security numbers and payroll and withholding and income tax information, and may use that information for purposes consistent with this section and regarding the employment or employer status and federal employer identification numbers of individuals, partnerships, limited liability companies, corporations, or employers, including, but not limited to, general contractors, intermediate contractors, and subcontractors. The commissioner shall request data in writing or pursuant to a state agency agreement, and the responding department shall respond to the request by producing the requested data within 30 days.\n(b) The commissioner is authorized to inspect and to order the production of all payroll and other business records and documents of any alleged employer in order to determine the employment status of persons and compliance with this section. If any person or employer refuses to comply with such an order, the commissioner may apply to the district court of the county where the person or employer is located or may apply to Ramsey County or the county where the nearest office of the Department of Labor and Industry is located, for an order compelling production of the documents.",
	"repealed": false
}