{
	"id": "524.2-201",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-201",
	"title": "524.2-201 DEFINITIONS.",
	"text": "In this part:\n(1) As used in sections other than section 524.2-205, \"decedent's nonprobate transfers to others\" means the amounts that are included in the augmented estate under section 524.2-205.\n(2) \"Interest in property held with right of survivorship\" means the severable interest owned by the person or persons whose interest is being determined in property held in joint tenancy or in other form of common ownership with a right of survivorship. The interest shall be identified and valued as of the time immediately prior to the death of the decedent or the date of the transfer which causes the property to be included in the augmented estate, as the case may be. In the case of an account described in article 6, part 2, the severable interest owned by the person is the amount which belonged to the person determined under section 524.6-203. In the case of property described in article 6, part 3, the severable interest owned by the person is the amount consistent with section 524.6-306.\n(3) \"Marriage,\" as it relates to a transfer by the decedent during marriage, means any marriage of the decedent to the decedent's surviving spouse.\n(4) \"Nonadverse party\" means a person who does not have a substantial beneficial interest in the trust or other property arrangement that would be adversely affected by the exercise or nonexercise of the power that the person possesses respecting the trust or other property arrangement. A person having a general power of appointment over property is deemed to have a beneficial interest in the property.\n(5) \"Power\" or \"power of appointment\" includes a power to designate the beneficiary of an insurance policy or other contractual arrangement.\n(6) \"Presently exercisable general power of appointment\" means a power possessed by a person at the time in question to create a present or future interest in the person, in the person's creditors, in the person's estate, or in the creditor of the person's estate, whether or not the person then had the capacity to exercise the power. \"General power of appointment\" means a power, whether or not presently exercisable, possessed by a person to create a present or future interest in the person, in the person's creditors, in the person's estate, or in creditors of the person's estate.\n(7) \"Probate estate\" means property that would pass by intestate succession if the decedent dies without a valid will.\n(8) \"Property\" includes values subject to a beneficiary designation.\n(9) \"Right to income\" includes a right to payments under a commercial or private annuity, an annuity trust, a unitrust, or a similar arrangement.\n(10) \"Transfer\" includes: (i) the exercise, release, or lapse of a general power of appointment created by the decedent alone or in conjunction with any other person, or exercisable by a nonadverse party; and (ii) the exercise or release by the decedent of a presently exercisable general power of appointment created by someone other than the decedent. \"Transfer\" does not include the lapse, other than a lapse at death, of a power described in clause (ii).\n(11) \"Bona fide purchaser\" means a purchaser for value in good faith and without notice or actual knowledge of an adverse claim, or a person who receives a payment or other item of property in partial or full satisfaction of a legally enforceable obligation in good faith without notice of an adverse claim. In the case of real property located in Minnesota purchased from a successor or successors in interest of a decedent, the purchaser is without notice of an adverse claim arising under this part or, if the decedent was not domiciled in Minnesota at the time of death, arising under similar provisions of the law of the decedent's domicile, unless the decedent's surviving spouse has filed a notice in the office of the county recorder of the county in which the real property is located or, if the property is registered land, in the office of the registrar of titles of the county in which the real property is located, containing the legal description of the property, a brief statement of the nature and extent of the interest claimed, and the venue, title, and file number of the proceeding for an elective share, if any has been commenced. The registrar of titles is authorized to accept for registration any such notice which relates to registered land.",
	"repealed": false
}