{
	"id": "164.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/164.12",
	"title": "164.12 ROAD ON TOWN LINE.",
	"text": "When adjoining towns propose to establish, alter, vacate, or maintain a road on or along the line between such towns they shall proceed as hereinafter provided.\nThe town boards shall divide the length of the road proposed to be established, altered, vacated, or maintained into two parts. When it is proposed to establish or alter a road, the division shall be made so as to divide as nearly equal as possible the cost of right-of-way, construction, and maintenance of the entire road. If the proposal is to vacate a road, the division shall be made so as to divide as nearly equal as possible any damages that may be occasioned thereby.\nAfter the division the boards shall enter into an agreement specifying which part shall be vacated, or opened, constructed, and maintained by each. Thereafter, each board shall proceed in the manner and subject to the same review as provided in section 164.06 or section 164.07.\nWhen a town line road is established, altered, or maintained as provided herein, the boards may jointly let a contract covering all or part of the work to be performed on the road. If a joint contract is not let each town board shall open and construct its portion thereof as expeditiously as possible.\nIf a portion of a town line road is taken over by the state as a trunk highway, or by a county as a county state-aid highway or county highway, the town boards concerned shall divide the portions of the town line road not taken over by the state or county, so that the cost of construction, reconstruction, and maintenance thereof will be apportioned as nearly equal as possible. After such division the boards shall enter into an agreement specifying which part shall be constructed and maintained by each.\n(a) When the town boards cannot agree upon a division as provided in subdivision 2 or subdivision 5, or upon the petition of either town board when a division previously agreed upon has proved to be inequitable, the county board, or where the road is on a county line the county boards of the counties concerned, shall determine the proper division of responsibility. In making such division the county board or boards shall follow the procedure provided for in subdivision 2 or 5. Where deemed necessary the services of the county engineer may be used.\n(b) When for any reason an agreement under paragraph (a) cannot be reached, the town board of either or both towns may request to have the matter determined through mediation, arbitration, mediation-arbitration (med-arb), or other form of alternative dispute resolution as described in Rule 114.02 of the General Rules of Practice for the District Courts. The parties may select a neutral who does not qualify under Rule 114.02. Mediated settlement agreements must be in accordance with the Minnesota Civil Mediation Act, sections 572.31 to 572.40. Arbitrated agreements and med-arb agreements must be final and binding.",
	"repealed": false
}