{
	"id": "221.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.251",
	"title": "221.251 OVERCHARGE REFUND.",
	"text": "Charges for freight, baggage, or express collected by a motor carrier over what the carrier is entitled to receive under the lawful tariff or classification must be refunded by the carrier within 90 days after a claim is filed, provided that a claim is filed as provided in this section.\n(a) Every claim against a motor carrier doing business in this state for an overcharge due to difference in weight or inapplicable rate, or for loss, damage, or injury to property while in its possession, must be adjusted and paid within 90 days after the filing of the claim with the agent of the carrier delivering the freight, baggage, or express, unless the delivering carrier protests the validity of the claim in writing to the claimant within a 90-day period.\n(b) Settlement of claims with the claimant is the responsibility of the carrier delivering the freight, baggage, or express to its ultimate destination. No claim may be filed until after the arrival of a shipment, or of some part of it, at the point of destination, or until after the lapse of a reasonable time for its arrival. For this purpose, a claim, when filed, must consist of:\n(1) an original bill of lading or shipping receipt;\n(2) a paid freight bill;\n(3) a bill of claimant; and\n(4) an original invoice or certified copy when necessary.\n(c) True copies of any of these documents may be used and, in case of absence, an explanation must be attached. The carrier shall acknowledge the filing of a claim, or letters, papers, or documents purporting to be a claim, within ten days after receipt and, if the claim as filed does not comply with the above requirements, the carrier shall inform the claimant and advise the claimant of what may be required to complete the claim.\nIf the claim is not paid or adjusted within 90 days of filing, suit may be commenced in a court having jurisdiction. Persons similarly situated may intervene or be joined and, if claimant prevails, a penalty of ten percent plus legal interest, reasonable attorneys' fees, costs, and disbursements are allowed.",
	"repealed": false
}