{
	"id": "240A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/240A.03",
	"title": "240A.03 GENERAL POWERS OF COMMISSION.",
	"text": "The commission has the powers necessary and convenient to discharge the duties imposed by law, including but not limited to those provided in this section.\nThe commission may sue and be sued and is a public body within the meaning of chapter 562.\nThe commission may acquire by lease, purchase, gift, or devise all necessary right, title, and interest in and to real or personal property or both necessary to the purposes of amateur sports facilities.\nThe commission may own, operate, construct, repair, or refurbish, and enter into contracts for the same purposes for real or personal property or both necessary for amateur sports facilities.\nReal or personal property acquired, owned, leased, controlled, used, or occupied by the commission for the purposes of amateur sports facilities is declared to be acquired, owned, leased, controlled, used, and occupied for public, governmental, and municipal purposes, and is exempt from ad valorem taxation by the state or any political subdivision of the state, provided that the properties are subject to special assessments levied by a political subdivision for a local improvement in amounts proportionate to and not exceeding the special benefit received by the properties from the improvement. The exemption from ad valorem taxation under this subdivision does not apply to land that is leased by the commission to any entity, public or private. No possible use of any of the properties in any manner different from their use under sections 240A.01 to 240A.07 at the time may be considered in determining the special benefit received by the properties. Assessments are subject to confirmation by the commission, whose determination of the benefits is subject to court review. Notwithstanding the provisions of section 272.01, subdivision 2, or 273.19, real or personal property leased by the commission to another person for uses related to the purposes of sections 240A.01 to 240A.07 is exempt from taxation regardless of the length of the lease.\nThe commission may sell or otherwise dispose of any real or personal property acquired by it that is no longer required for accomplishment of its purposes. The property shall be sold in the manner provided by section 469.065, insofar as practical and consistent with sections 473.551 to 473.595.\nThe commission may contract for materials, supplies, and equipment with persons, firms, or corporations to perform one or more or all of the functions of architect, engineer, construction manager, project manager, or contractor for both design and construction, with respect to all or any part of a project to build or remodel sports facilities.\nThe commission may accept gifts of money, property, or services; may apply for and accept grants or loans of money or other property from the United States, the state, a subdivision of the state, or a person for any of its purposes; may enter into an agreement required in connection with it; and may hold, use, and dispose of the money, property, or services in accordance with the terms of the gift, grant, loan, or agreement relating to it. The commission may also make grants, gifts, and bequests of money, property, or services and enter into contracts to carry out the same. Money received under this subdivision is annually appropriated to the commission.\nThe commission may conduct research studies and programs; collect and analyze data; prepare reports, maps, charts, and tables; and conduct necessary hearings and investigations in connection with its functions.\nThe commission may lease, license, or enter into agreements and may fix, alter, charge, and collect rentals, fees, and charges to persons for the use, occupation, and availability of part or all of any premises, property, or facilities under its ownership, operation, or control. Fees charged by the commission are not subject to section 16A.1285. The commission may also impose other fees it deems appropriate with the approval of the legislature according to section 16A.1283. Notwithstanding section 16A.1283, when the legislature is not in session, the commissioner of management and budget may grant interim approval of the fees, until such time as the legislature reconvenes and acts upon the fees. A use agreement may provide that the other contracting party has exclusive use of the premises at the times agreed upon.\nThe commission may require any employee to obtain and file with it an individual bond or fidelity insurance policy. It may obtain insurance in the amounts it considers necessary to protect it against the liability of the commission or its officers and employees for personal injury or death and property damage or destruction, with the effect stated in chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property.\nThe commission may adopt rules and procedures to implement its authority under sections 240A.01 to 240A.07.\nThe commission, and any other state office, agency, or board owning or operating a sport facility designated as an official training center by the national governing body of that sport, may establish nonprofit corporations and charitable foundations.\nThe commission may pay costs incurred by an amateur sports facility in hosting and operating events that are conducted at the facility under an agreement with the national governing body for an amateur sport and sanctioned or sponsored by the commission.\nThe commission may accept paid advertising in its publications. Funds received from advertising are annually appropriated to the commission for its publications. The commission must annually report the amount of funds received under this subdivision to the chair of the house of representatives Ways and Means and senate Finance Committees.\nBy January 15 of each year, the commission must report to the chairs of the legislative committees with jurisdiction over the commission and its finances regarding the revenue received by the commission from leases in the previous fiscal year. The report must detail revenue received from individual lessees and costs incurred by the commission for maintenance and operation of the leased property. The report must also estimate the revenue from leases for the current and following fiscal years.",
	"repealed": false
}