{
	"id": "60A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.201",
	"title": "60A.201 PLACEMENT OF INSURANCE BY BROKER.",
	"text": "Insurance shall not be placed by the surplus lines broker with a nonadmitted insurer when coverage is available from a licensed insurer.\nThere shall be a rebuttable presumption that the following coverages are available from a licensed insurer:\n(a) all mandatory automobile insurance coverages required by chapter 65B;\n(b) private passenger automobile physical damage coverage;\n(c) homeowners and property insurance on owner-occupied dwellings whose value is less than $500,000. This figure shall be changed annually by the commissioner by the same percentage as the Consumer Price Index for the Minneapolis-St. Paul Metropolitan Area is changed;\n(d) any coverage readily available from three or more licensed insurers unless the licensed insurers quote a premium and terms not competitive with a premium and terms quoted by an eligible surplus lines insurer; and\n(e) workers' compensation insurance, except excess workers' compensation insurance which is not available from the Workers' Compensation Reinsurance Association.\nThere shall be a rebuttable presumption that the following coverages are unavailable from a licensed insurer:\n(a) coverages where one portion of the risk is acceptable to licensed insurers but another portion of the same risk is not acceptable. The entire coverage may be placed with eligible surplus lines insurers if it can be shown that the eligible surplus lines insurer will accept the entire coverage but not the rejected portion alone; and\n(b) any coverage that the broker is unable to procure after diligent search among licensed insurers.\n[Repealed, 2009 c 178 art 1 s 69]\nA surplus lines broker is not required to make a diligent search to determine whether the full amount or type of insurance can be obtained from licensed insurers when the broker is seeking to procure or place nonadmitted insurance for an exempt commercial purchaser provided:\n(1) the broker procuring or placing the nonadmitted insurance has disclosed to the exempt commercial purchaser that the insurance may or may not be available from a licensed insurer that may provide greater protection with more regulatory oversight; and\n(2) the exempt commercial purchaser has subsequently requested in writing for the broker to procure or place the insurance from a nonadmitted insurer.\nCoverage for a risk that was referred to a surplus lines broker by a Minnesota licensed insurance producer who is not affiliated with the surplus lines broker is deemed unavailable from a licensed insurer.",
	"repealed": false
}