{
	"id": "290.0134",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0134",
	"title": "290.0134 CORPORATIONS; SUBTRACTIONS FROM FEDERAL TAXABLE INCOME.",
	"text": "(a) For the purposes of this section, \"subtraction\" means an amount that shall be subtracted from federal taxable income in computing net income for the taxable year to which the amount relates.\n(b) The subtractions in this section apply to corporations, other than S corporations, after the additions provided in section 290.0133.\n(c) Unless specifically indicated or unless the context clearly indicates otherwise, no amount deducted, subtracted, or otherwise excluded in computing federal taxable income is a subtraction under this section.\nThe amount of foreign dividend gross-up under section 78 of the Internal Revenue Code is a subtraction.\nThe amount of salary expense not allowed for federal income tax purposes due to claiming the work opportunity credit under section 51 of the Internal Revenue Code is a subtraction.\nAny dividend, not including any distribution in liquidation, paid within the taxable year by a national or state bank to the United States, or to any instrumentality of the United States exempt from federal income taxes, on the preferred stock of the bank owned by the United States or the instrumentality is a subtraction.\nThe deduction for capital losses under sections 1211 and 1212 of the Internal Revenue Code is a subtraction, except that:\n(1) capital loss carrybacks are not allowed; and\n(2) a capital loss carryover to each of the 15 taxable years succeeding the loss year is allowed.\nInterest and expenses relating to income not taxable for federal income tax purposes is a subtraction if (1) the income is taxable under this chapter, and (2) the interest and expenses were disallowed as deductions under the provisions of section 171(a)(2), 265, or 291 of the Internal Revenue Code in computing federal taxable income.\nFor mines, oil and gas wells, other natural deposits, and timber for which percentage depletion was disallowed under section 290.0133, subdivision 9, a reasonable allowance for depletion based on actual cost is a subtraction. For leases, the deduction must be apportioned between the lessor and lessee under rules prescribed by the commissioner. For property held in trust, the allowable deduction must be apportioned between the income beneficiaries and the trustee under the pertinent provisions of the trust instrument, or if there is no provision in the trust instrument, on the basis of the trust's income allocable to each.\nRefunds of income, excise, or franchise taxes based on net income or related minimum taxes paid by the corporation to Minnesota, another state, a political subdivision of another state, the District of Columbia, or a foreign country or possession of the United States to the extent that the taxes were added to federal taxable income under section 290.0133, subdivision 2, in a prior taxable year are a subtraction.\nIncome or gains from the business of mining as defined in section 290.05, subdivision 1, clause (a), that are not subject to Minnesota franchise tax are a subtraction.\nThe amount of disability access expenditures in the taxable year which are not allowed to be deducted or capitalized under section 44(d)(7) of the Internal Revenue Code is a subtraction.\nThe amount of qualified research expenses not allowed for federal income tax purposes under section 280C(c) of the Internal Revenue Code is a subtraction, but only to the extent that the amount exceeds the amount of the credit allowed under section 290.068.\nThe amount of salary expenses not allowed for federal income tax purposes due to claiming the Indian employment credit under section 45A(a) of the Internal Revenue Code is a subtraction.\n(a) In each of the five taxable years immediately following the taxable year in which an addition is required under section 290.0133, subdivision 11, an amount equal to one-fifth of the delayed depreciation is a subtraction.\n(b) For purposes of this subdivision, \"delayed depreciation\" means the amount of the addition made by the taxpayer under section 290.0133, subdivision 11, provided that delayed depreciation cannot be less than zero.\nIn each of the five taxable years immediately following the taxable year in which an addition is required under section 290.0133, subdivision 12, an amount equal to one-fifth of the amount of the addition is a subtraction.\nMS 2018 [Expired]\nThe amount of expenses not allowed for federal income tax purposes due to claiming the railroad track maintenance credit under section 45G(a) of the Internal Revenue Code is a subtraction.\nMS 2022 [Repealed, 2023 c 64 art 1 s 53]\nThe amount of deferred foreign income under section 965 of the Internal Revenue Code included in federal taxable income, is a subtraction.\nThe amount of expenses of a license holder, as defined under section 342.01, subdivision 48, related to the business of cannabis or hemp and not allowed for federal income tax purposes under section 280E of the Internal Revenue Code is a subtraction.\n(a) For each taxable year an addition is required under section 290.0131, subdivision 19, the amount of the addition, less the sum of all amounts subtracted under this paragraph in all prior taxable years, that does not exceed the limitation on business interest in section 163(j) of the Internal Revenue Code of 1986, as amended through December 15, 2022, notwithstanding the special rule in section 163(j)(10) of the Internal Revenue Code, is a subtraction. Any excess is a delayed business interest carryforward, the entire amount of which must be carried to the earliest taxable year. No subtraction is allowed under this paragraph for taxable years beginning after December 31, 2022.\n(b) For each of the five taxable years beginning after December 31, 2022, there is allowed a subtraction equal to one-fifth of the sum of all carryforward amounts that remain after the expiration of paragraph (a).\n(c) Entities that are part of a combined reporting group under the unitary rules of section 290.17, subdivision 4, must compute deductions and additions as required under section 290.34, subdivision 5.",
	"repealed": false
}