{
	"id": "60A.9855",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.9855",
	"title": "60A.9855 CONFIDENTIALITY.",
	"text": "Any documents, materials, or other information in the control or possession of the department that are furnished by a licensee or an employee or agent thereof acting on behalf of a licensee pursuant to section 60A.9851, subdivision 9; section 60A.9853, subdivision 2, clauses (2), (3), (4), (5), (8), (10), and (11); or that are obtained by the commissioner in an investigation or examination pursuant to section 60A.9854 shall be classified as confidential, protected nonpublic, or both; shall not be subject to subpoena; and shall not be subject to discovery or admissible in evidence in any private civil action. However, the commissioner is authorized to use the documents, materials, or other information in the furtherance of any regulatory or legal action brought as a part of the commissioner's duties.\nNeither the commissioner nor any person who received documents, materials, or other information while acting under the authority of the commissioner shall be permitted or required to testify in any private civil action concerning any confidential documents, materials, or information subject to subdivision 1.\nIn order to assist in the performance of the commissioner's duties under sections 60A.985 to 60A.9858, the commissioner:\n(1) may share documents, materials, or other information, including the confidential and privileged documents, materials, or information subject to subdivision 1, with other state, federal, and international regulatory agencies, with the National Association of Insurance Commissioners, its affiliates or subsidiaries, and with state, federal, and international law enforcement authorities, provided that the recipient agrees in writing to maintain the confidentiality and privileged status of the document, material, or other information;\n(2) may receive documents, materials, or information, including otherwise confidential and privileged documents, materials, or information, from the National Association of Insurance Commissioners, its affiliates or subsidiaries, and from regulatory and law enforcement officials of other foreign or domestic jurisdictions, and shall maintain as confidential or privileged any document, material, or information received with notice or the understanding that it is confidential or privileged under the laws of the jurisdiction that is the source of the document, material, or information;\n(3) may share documents, materials, or other information subject to subdivision 1, with a third-party consultant or vendor provided the consultant agrees in writing to maintain the confidentiality and privileged status of the document, material, or other information; and\n(4) may enter into agreements governing sharing and use of information consistent with this subdivision.\nNo waiver of any applicable privilege or claim of confidentiality in the documents, materials, or information shall occur as a result of disclosure to the commissioner under this section or as a result of sharing as authorized in subdivision 3. Any document, material, or information disclosed to the commissioner under this section about a cybersecurity event must be retained and preserved by the licensee for five years.\nNothing in sections 60A.985 to 60A.9857 shall prohibit the commissioner from releasing final, adjudicated actions that are open to public inspection pursuant to chapter 13 to a database or other clearinghouse service maintained by the National Association of Insurance Commissioners, its affiliates, or subsidiaries.\nDocuments, materials, or other information in the possession or control of the National Association of Insurance Commissioners or a third-party consultant pursuant to sections 60A.985 to 60A.9857 are classified as confidential, protected nonpublic, and privileged; are not subject to subpoena; and are not subject to discovery or admissible in evidence in a private civil action.",
	"repealed": false
}