{
	"id": "142G.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.35",
	"title": "142G.35 PAYMENT PROVISIONS; VENDOR PAYMENTS.",
	"text": "The following policies apply to monthly assistance payments and corrective payments:\n(1) grant payments may be issued in the form of warrants immediately redeemable in cash, electronic benefits transfer, or by direct deposit into the recipient's account in a financial institution;\n(2) the commissioner shall mail assistance payment checks to the address where a caregiver lives unless the county agency approves an alternate arrangement;\n(3) the commissioner shall mail monthly assistance payment checks within time to allow postal service delivery to occur no later than the first day of each month. Monthly assistance payment checks must be dated the first day of the month. The commissioner shall issue electronic benefits transfer payments so that caregivers have access to the payments no later than the first of the month;\n(4) the commissioner shall issue replacement checks promptly, but no later than seven calendar days after the provisions of sections 16A.46; 142A.03, subdivision 5; and 471.415 have been met; and\n(5) the commissioner, with the advance approval of the commissioner of management and budget, may issue cash assistance grant payments up to three days before the first day of each month, including three days before the start of each state fiscal year. Of the money appropriated for cash assistance grant payments for each fiscal year, up to three percent of the annual state appropriation is available to the commissioner in the previous fiscal year. If that amount is insufficient for the costs incurred, an additional amount of the appropriation as needed may be transferred with the advance approval of the commissioner of management and budget.\nAlternatives to paying assistance directly to a participant may be used when:\n(1) a county agency determines that a vendor payment is the most effective way to resolve an emergency situation pertaining to basic needs;\n(2) a caregiver makes a written request to the county agency asking that part or all of the assistance payment be issued by protective or vendor payments for shelter and utility service only. The caregiver may withdraw this request in writing at any time;\n(3) the vendor payment is part of a sanction under section 142G.70;\n(4) the vendor payment is required under section 142G.18;\n(5) protective payments are required for minor parents under section 142G.14; or\n(6) a caregiver has exhibited a continuing pattern of mismanaging funds as determined by the county agency.\nThe director of a county agency, or the director's designee, must approve a proposal for protective or vendor payment for money mismanagement when there is a pattern of mismanagement under clause (6). During the time a protective or vendor payment is being made, the county agency must provide services designed to alleviate the causes of the mismanagement.\nThe continuing need for and method of payment must be documented and reviewed every 12 months. The director of a county agency or the director's designee must approve the continuation of protective or vendor payments. When it appears that the need for protective or vendor payments will continue or is likely to continue beyond two years because the county agency's efforts have not resulted in sufficiently improved use of assistance on behalf of the minor child, judicial appointment of a legal guardian or other legal representative must be sought by the county agency.\nA county agency shall consult with a caregiver regarding the selection of the form of payment, the selection of a protective payee, and the distribution of the assistance payment to meet the various costs incurred by the assistance unit. When choosing a protective payee, the county agency shall notify the caregiver of a consultation date. If the caregiver fails to respond to the county agency's request for consultation by the effective date on the notice, the county agency must choose a protective payee for that payment month and subsequent payment months until the caregiver responds to the agency's request for consultation. The county agency must notify the caregiver of the right to appeal the determination that a protective or vendor payment should be made or continued and to appeal the selection of the payee. If a county agency is not able to find another protective payee, a county agency staff member may serve as a protective payee. The following persons may not serve as protective payees: a member of the county board of commissioners; the county agency staff member determining financial eligibility for the family; special investigative or resource staff; the staff member handling accounting or fiscal processes related to the participant; or a landlord, grocer, or other vendor dealing directly with the participant.\nA county agency shall discontinue protective or vendor payments in two years or in the month following the county agency's failure to grant six-month approval to a money management plan, whichever occurs first. At least once every 12 months, a county agency shall review the performance of a protective payee acting under subdivision 2, clause (3), to determine whether a new payee should be selected. When a participant complains about the performance of a protective payee, a review shall occur within 30 calendar days.",
	"repealed": false
}