{
	"id": "103B.621",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.621",
	"title": "103B.621 TREASURER.",
	"text": "Before taking office, the treasurer shall give bond to the district in an amount to be determined by the board.\n(a) The treasurer shall receive and is responsible for all money of the district. The money of the district shall be considered public funds.\n(b) The treasurer shall disburse the funds of the district in accordance with rules of the board.\n(a) If there are funds not currently needed, the treasurer may invest the funds in treasury bonds, certificates of indebtedness, bonds or notes of the United States of America, or bonds, notes or certificates of indebtedness of the state of Minnesota. The bonds, certificates, or notes must mature by three years from the date of purchase. If the board determines that invested funds are needed for current purposes before the maturity dates of the bonds, certificates, or notes, the board shall notify the treasurer and the treasurer shall order the sale or convert the bonds, certificates, or notes into cash in the amount determined by the board.\n(b) The interest and profit on investments shall be credited to and constitute a part of the funds of the district.\nThe treasurer shall keep an account of the funds received and disbursed. At least once a year at times designated by the board, the treasurer must file a financial statement with the municipalities forming the district showing in appropriate and identifiable groupings:\n(1) the receipts and disbursements since the last approved financial statement;\n(2) the money on hand;\n(3) the purposes for which the money of the district is appropriated;\n(4) an account of all bonds, certificates, or notes purchased and the funds from which they were purchased; and\n(5) the interest and profit that has accrued from investments.\nThe district may pay to the treasurer compensation to cover hiring clerks to carry out the treasurer's duties.",
	"repealed": false
}