{
	"id": "179A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.101",
	"title": "179A.101 COURT UNITS.",
	"text": "(a) The state court administrator shall meet and negotiate with the exclusive representative of each of the units specified in this section. The units provided in this section are the only appropriate units for court employees. Court employees, unless otherwise excluded, are included within the units which include the classifications to which they are assigned for purposes of compensation. Initial assignment of classifications to bargaining units shall be made by the state court administrator by August 15 of the year preceding the year in which the state assumes the cost of court administration in the judicial district in which the bargaining unit is located. An exclusive representative may appeal the initial assignment decision of the state court administrator by filing a petition with the commissioner within 45 days of being certified as the exclusive representative for a judicial district. The units in this subdivision are the appropriate units of court employees.\n(b) The Judicial District Unit consists of clerical, administrative, and technical employees of a judicial district under section 480.181, subdivision 1, paragraph (b), or of two or more of these districts that are represented by the same employee organization or one or more subordinate bodies of the same employee organization. The judicial district unit includes individuals, not otherwise excluded, whose work is typically clerical or secretarial in nature, including nontechnical data recording and retrieval and general office work, and individuals, not otherwise excluded, whose work is not typically manual and which requires specialized knowledge or skills acquired through two-year academic programs or equivalent experience or on-the-job training.\n(c) The Appellate Courts Unit consists of clerical, administrative, and technical employees of the court of appeals and clerical, administrative, and technical employees of the supreme court. The Appellate Courts Unit includes individuals, not otherwise excluded, whose work is typically clerical or secretarial in nature, including nontechnical data recording and retrieval and general office work, and individuals, not otherwise excluded, whose work is not typically manual and which requires specialized knowledge or skills acquired through two-year academic programs or equivalent experience or on-the-job training.\n(d) The Court Employees Professional Employee Unit consists of professional employees, not otherwise excluded, that are employed by the supreme court, the court of appeals, or a judicial district under section 480.181, subdivision 1, paragraph (b).\n(e) The Court Employees Court Reporter Unit consists of court reporters not otherwise excluded who are employed by a judicial district under section 480.181, subdivision 1, paragraph (a).\n(f) Notwithstanding any provision of this chapter or any other law to the contrary, judges may appoint and remove court reporters at their pleasure.\n(g) Copies of collective bargaining agreements entered into under this section must be submitted to the Legislative Coordinating Commission for the commission's information.\nThe following employees are excluded from the appropriate units under subdivision 1:\n(1) personal secretaries to judges;\n(2) law clerks;\n(3) managerial employees;\n(4) confidential employees; and\n(5) supervisory employees.\nWhenever an employee organization or one or more subordinate bodies of the same employee organization is certified as the exclusive representative of the employees in more than one judicial district unit, all judicial district units for which the employee organization or one or more subordinate bodies of the same employee organization has been certified will be combined into one unit and the employee organization certified as exclusive representative of the employees of the new, combined unit. The commissioner shall issue a certification within 45 days of receipt of a petition demonstrating that an employee organization or one or more subordinate bodies of the same employee organization is certified as the exclusive representative of employees in more than one judicial district unit.",
	"repealed": false
}