{
	"id": "85.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.33",
	"title": "85.33 ST. CROIX WILD RIVER AREA; LIMITATIONS ON POWER BOATING.",
	"text": "For the purposes of this section, \"motorboat\" means any contrivance used or designed for navigation on water which is propelled in any respect by machinery, including but not limited to detachable motors.\nIn furtherance of the public policy declared by Congress in Public Law 90-542 and Public Law 92-560 of maintaining the essentially wild and scenic character of certain rivers, including a part of the St. Croix, and as an exercise of state powers either recognized or granted by Public Law 90-542 and Public Law 92-560, the commissioner of natural resources may promulgate rules, in the manner provided by chapter 14, which limit or prohibit the operation or use of motorboats on that part of the St. Croix River north of the mouth of the Snake River, located in Section 31, Township 39 North, Range 19 West.\nAfter October 1, 1974, if the commissioner of natural resources has not established rules relating to the use of watercraft on that part of the St. Croix River south of the mouth of the Snake River but north of the nine-foot navigational channel at mile 24.5, measured from the mouth of the St. Croix River, pursuant to the request of a local governmental unit in the manner provided by section 86B.205, subdivision 9, the commissioner may establish such rules pursuant to section 86B.205, subdivision 9, notwithstanding the absence of a request from a local governmental unit and notwithstanding the absence of approval of the rules by a majority of the counties affected.\nRules promulgated by the commissioner pursuant to this section are effective upon adoption of laws or rules providing for similar limitations or prohibitions on the operation and use of motorboats on the same reach of St. Croix River by the state of Wisconsin or its agencies. In exercising the authority granted by this section the commissioner may enter into necessary agreements with either the United States and its agencies, pursuant to section 84.025, or the state of Wisconsin and its agencies.\nA person violating any of the provisions of this section or the rules promulgated thereunder by the commissioner is guilty of a misdemeanor.",
	"repealed": false
}