{
	"id": "571.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.72",
	"title": "571.72 GENERAL GARNISHMENT PROVISIONS.",
	"text": "Unless this chapter specifically provides otherwise, the Rules of Civil Procedure for the District Courts shall apply in all proceedings under this chapter.\nTo enforce a claim asserted in a civil action venued in a court of record, a garnishment summons may be issued by a creditor and served upon the garnishee in the same manner as other summons in that court of record, except that service may not be made by publication. Service of a garnishment summons on the garnishee may also be made by certified mail, return receipt requested. A garnishment summons served by certified mail is effective if served at the garnishee's regular place of business. The effective date of service by certified mail is the time of receipt by the garnishee. A single garnishment summons may be addressed to two or more garnishees but must state whether each is summoned separately or jointly.\nThe garnishment summons must state:\n(1) the full name of the debtor, the debtor's last known mailing address, and the amount of the claim that remains unpaid;\n(2) the date of the entry of judgment against the debtor or that the debtor is in default pursuant to rule 55.01 of the Minnesota Rules of Civil Procedure for the District Courts. Where there is a prejudgment garnishment pursuant to section 571.93, the garnishment summons must include a copy of the court order;\n(3) if the garnishment is on any indebtedness, money, or property other than earnings, the garnishee shall serve upon the creditor and upon the debtor within 20 days after service of the garnishment summons, a written disclosure, of the garnishee's indebtedness, money, or other property owing to the debtor and answers to all written interrogatories that are served with the garnishment summons. The garnishment summons shall also state that if the garnishment is on earnings and the debtor has garnishable earnings, the garnishee shall serve the disclosure within ten days of the last payday to occur within the 90 days after the date of service of the garnishment summons;\n(4) that the creditor shall not require disclosure of the disposable earnings, indebtedness, money, or property of debtor in the garnishee's possession or under the garnishee's control in excess of 110 percent of the amount of the claim that remains unpaid;\n(5) that the garnishee shall retain disposable earnings, indebtedness, money, or property of the debtor in the garnishee's possession or under the garnishee's control not in excess of 110 percent of the amount of the claim that remains unpaid, until the creditor causes a writ of execution to be served upon the garnishee, until the debtor authorizes release to the creditor, until the creditor authorizes release to the debtor, upon court order, or by operation of law;\n(6) that after the expiration of the period of time specified in section 571.79 from the date of service of the garnishment summons, the garnishee's retention obligation automatically expires;\n(7) that an assignment of wages made by the debtor within ten days before the service of the first garnishment summons on a debt is void and that any indebtedness to the garnishee incurred with ten days before the service of the first garnishment summons on a debt may not be set off against amounts otherwise subject to the garnishment.\nWhenever a creditor is represented by an attorney, a responsive pleading or document from the garnishee or debtor under this chapter must be served on the creditor's attorney.\nA copy of the garnishment summons and copies of all other papers served on the garnishee must be served by mail at the last known mailing address of the debtor not later than five days after the service is made upon the garnishee. The first time a garnishment summons is served on the debtor pursuant to section 571.71, clause (2), the creditor shall also serve a copy of the affidavit of service of the original summons and complaint. Service of the garnishment documents on the debtor is effective upon mailing.\nThe creditor shall serve with the garnishment summons the applicable garnishment disclosure form substantially in the form set forth in section 571.75. The creditor may also serve written interrogatories with the garnishment summons.\nIf, in a proceeding brought under subdivision 9, section 571.91, or a similar proceeding under this chapter to determine a claim of exemption, the claim of exemption is not upheld, and the court finds that it was asserted in bad faith, the creditor shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. If the claim of exemption is upheld, and the court finds that the creditor disregarded the claim of exemption in bad faith, the debtor shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. The underlying judgment shall be modified to reflect assessment of damages, costs, and attorney fees. However, if the party in whose favor a penalty assessment is made is not actually indebted to that party's attorney for fees, the attorney's fee award shall be made directly to the attorney and if not paid an appropriate judgment in favor of the attorney shall be entered.\nNo creditor shall use a form that contains alterations or changes from the statutory forms that mislead debtors as to their rights and the garnishment procedure generally. If a court finds that a creditor has used a misleading form, the debtor shall be awarded actual damages, costs, reasonable attorney's fees resulting from additional proceedings, and an amount not to exceed $100. All forms must be clearly legible and printed in not less than the equivalent of 10-point type. A form that uses both sides of a sheet must clearly indicate on the front side that there is additional information on the back side of the sheet.\nForms, including the statutory forms, used in garnishments of earnings for the satisfaction of judgments for child support must be changed by the creditor to reflect the fact that the 90-day period of effectiveness does not apply to these garnishments if the judgment creditor is a county and the employer is notified by the county when the judgment is satisfied.\nIn every garnishment where the debtor is a natural person, the debtor shall be provided with a garnishment exemption notice. If the creditor is garnishing earnings, the earnings exemption notice provided in section 571.924 must be served ten or more days before the service of the first garnishment summons. If the creditor is garnishing funds in a financial institution, the exemption notice provided in section 571.912 must be served with the garnishment summons. In all other cases, the exemption notice must be in the following form and served on the debtor with a copy of the garnishment summons.\nA Garnishment Summons is being served upon you. Some of your property may be exempt and cannot be garnished. The following is a list of some of the more common exemptions. It is not complete and is subject to section 550.37 of the Minnesota Statutes and other state and federal laws. The dollar amounts contained in this list are subject to the provisions of section 550.37, subdivision 4a, at the time of garnishment. If you have questions about an exemption, you should obtain legal advice.\n(1) a homestead or the proceeds from the sale of a homestead;\n(2) household furniture, appliances, phonographs, radios, and televisions up to a total current value of $5,850;\n(3) a manufactured (mobile) home used as your home;\n(4) one motor vehicle currently worth less than $2,600 after deducting any security interest;\n(5) farm machinery used by an individual principally engaged in farming, or tools, machines, or office furniture used in your business or trade. This exemption is limited to $13,000;\n(6) relief based on need. This includes:\n(i) Minnesota Family Investment Program (MFIP) and Work First Program;\n(ii) Medical Assistance (MA);\n(iii) General Assistance (GA);\n(iv) Emergency General Assistance (EGA);\n(v) Minnesota Supplemental AID (MSA);\n(vi) MSA-Emergency Assistance (MSA-EA);\n(vii) Supplemental Security Income (SSI);\n(viii) Energy Assistance; and\n(ix) Emergency Assistance (EA);\n(7) Social Security benefits;\n(8) unemployment benefits, workers' compensation, or veteran's benefits;\n(9) an accident, disability, or retirement pension or annuity;\n(10) life insurance proceeds;\n(11) earnings of your minor child; and\n(12) money from a claim for damage or destruction of exempt property (such as household goods, farm tools, business equipment, a manufactured (mobile) home, or a car).\n(a) This subdivision applies to all garnishment proceedings governed by this chapter. An objection regarding a garnishment must be interposed as provided in section 571.914, subdivision 1, in the form provided under section 571.914, subdivision 2.\n(b) Upon motion of any party in interest, on notice, the court shall determine the validity of any claim of exemption and may make any order necessary to protect the rights of those interested.\n(c) Upon receipt of a claim of exemption by the debtor, the creditor must, within six business days of the receipt of the exemption claim, either return any of the debtor's funds released by the garnishee and held by the creditor or interpose an objection. An objection must be interposed by:\n(1) in the district court that issued the judgment, filing the Notice of Objection and requesting a hearing; and\n(2) mailing or delivering one copy of the Notice of Objection and Notice of Hearing to the garnishee and one copy of the Notice of Objection and Notice of Hearing to the debtor.\n\nEXEMPTION NOTICE\nIMPORTANT NOTICE: A garnishment summons may be served on your employer, bank, or other third parties without any further court proceeding or notice to you. See the attached Notice of Intent to Garnish for more information.\nThe following money and wages may be protected (the legal word is exempt) from garnishment:\n1. Financial institutions/bank\nSome of the money in your account may be protected because you receive government benefits from one or more of the following places:\nMFIP - Minnesota family investment program,\nMFIP Diversionary Work Program,\nWork participation cash benefit,\nGA - general assistance,\nEA - emergency assistance,\nMA - medical assistance,\nEGA - emergency general assistance or county crisis funds,\nMSA - Minnesota supplemental aid,\nMSA-EA - MSA emergency assistance,\nSupplemental Nutrition Assistance Program (SNAP),\nSSI - Supplemental Security Income,\nMinnesotaCare,\nMedicare Part B premium payments,\nMedicare Part D extra help,\nEnergy or fuel assistance,\nSocial Security benefits,\nUnemployment benefits,\nWorkers' compensation,\nVeterans benefits.\nSending the creditor's attorney (or creditor, if no attorney) a copy of BANK STATEMENTS that show what was in your account for the past 60 days may give the creditor enough information about your exemption claim to avoid a garnishment.\n2. Earnings\nAll or some of your earnings may be completely protected from garnishment if:\nAll of your earnings (wages) may be protected if:\nYou get government benefits (see list of government benefits)\nYou currently receive other assistance based on need\nYou have received government benefits in the last six months\nYou were in jail or prison in the last six months\nYour wages are only protected for 60 days after they are deposited in your account so it would be helpful if you immediately send the undersigned creditor a copy of BANK STATEMENTS that show what was in your account for the past 60 days.\nSome of your earnings (wages) may be protected if:\nIf all of your earnings are not exempt, some of your earnings may still be protected for 20 days after they were deposited in your account. The amount protected is the larger amount of:\n75 percent of your wages (after taxes are taken out); or\n(insert the sum of the current federal minimum wage) multiplied by 40.\nThe money from the following are also exempt for 20 days after they are deposited in your account.\nAn accident, disability, or retirement pension or annuity\nPayments to you from a life insurance policy\nEarnings of your child who is under 18 years of age\nChild support\nMoney paid to you from a claim for damage or destruction of property. Property includes household goods, farm tools or machinery, tools for your job, business equipment, a mobile home, a car, a musical instrument, a pew or burial lot, clothes, furniture, or appliances.\nDeath benefits paid to you.\nYOU WILL BE ABLE TO CLAIM THESE EXEMPTIONS WHEN YOU RECEIVE A NOTICE. You will get the notice at least ten days BEFORE a wage garnishment. BUT if the creditor garnishes your bank account, you will not get the notice until AFTER the account has been frozen. IF YOU BELIEVE THE MONEY IN YOUR BANK ACCOUNT OR YOUR WAGES ARE EXEMPT, YOU SHOULD IMMEDIATELY CONTACT THE PERSON BELOW. YOU SHOULD TELL THEM WHY YOU THINK YOUR ACCOUNT OR WAGES ARE EXEMPT TO SEE IF YOU CAN AVOID GARNISHMENT.\nThe notice of intent to garnish must be in substantially the following form:\nIMPORTANT! READ THIS CAREFULLY!\nNOTICE OF INTENT TO GARNISH\nYour money, property, or earnings are in danger of being garnished because you did not send a written \"Answer\" to the Summons and Complaint served on you over 20 days ago.\nThere may not be a case filed in court, BUT because you did not send a written \"Answer\" the creditor may serve a garnishment summons on your employer, bank, or other third parties. This means that your money or wages can be garnished (held or taken). Under Minnesota law, this can happen any time 20 days after the date you receive this notice.\nThere will be NO COURT HEARING or any further notice to you prior to a garnishment if you do nothing. There may not be a file open at the Clerk of the Court's office. There are things you can do to avoid a garnishment, but you must act quickly.\nPlease read these instructions carefully. You have 20 days to do one of the following:\n1. Send an Answer. If you do not think you owe the money or if you have a legal reason that you did not pay, send a written \"Answer\" to the Summons and Complaint. Your \"Answer\" should tell the creditor why you think you do not owe some or all of the money. Contact a lawyer if you do not know what to do, need help with an answer, or have any questions about the debt.\n2. Claim an Exemption. Even if you do not have a defense to the complaint, some of your money may be protected (the legal word is exempt) from garnishment. This means it is protected and cannot be taken. The creditor will send you a form to claim these exemptions at a later time, but you can possibly avoid the garnishment by contacting the person below immediately to claim your exemption. Attached to this notice is a list of exemptions you may be able to claim.\n3. If you do not have a defense and your money is not exempt you can call the person below before the 20 days are up and try to set up a payment plan that works for both you and your creditor. You can contact the person below at any time to try to work out a payment plan, but if you wait too long or cannot agree on a payment plan, they may garnish your wages, bank accounts, or assets.\nIf you do not do any of these things, your money can be garnished. The creditor can garnish your wages, bank accounts, or other assets. They do not have to go to court to let you know when they start taking your money.",
	"repealed": false
}