{
	"id": "136A.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.125",
	"title": "136A.125 CHILD CARE GRANTS.",
	"text": "A child care grant program is established under the supervision of the office. The program makes money available to eligible students to reduce the costs of child care while attending an eligible postsecondary institution. The office shall develop policies and adopt rules as necessary to implement and administer the program.\n(a) An applicant is eligible for a child care grant if the applicant:\n(1) is a resident of the state of Minnesota or the applicant's spouse is a resident of the state of Minnesota;\n(2) has a child 12 years of age or younger, or 14 years of age or younger who is disabled as defined in section 125A.02, and who is receiving or will receive care on a regular basis from a licensed or legal, nonlicensed caregiver;\n(3) is income eligible as determined by the office's policies and rules, but is not a recipient of assistance from the Minnesota family investment program;\n(4) has not received child care grant funds for a period of ten semesters or the equivalent;\n(5) is pursuing a nonsectarian program or course of study that applies to an undergraduate, graduate, or professional degree, diploma, or certificate;\n(6) is enrolled in at least one credit in an undergraduate program or one credit in a graduate or professional program in an eligible institution; and\n(7) is in good academic standing and making satisfactory academic progress.\n(b) A student is entitled to an additional semester or equivalent of grant eligibility and will be considered to be in continuing enrollment status upon return if the student withdraws from enrollment:\n(1) for active military service after December 31, 2002, because the student was ordered to active military service as defined in section 190.05, subdivision 5b or 5c;\n(2) for a serious health condition, while under the care of a medical professional, that substantially limits the student's ability to complete the term; or\n(3) while providing care that substantially limits the student's ability to complete the term to the student's spouse, child, or parent who has a serious health condition.\nA Minnesota public postsecondary institution, a Minnesota private, baccalaureate degree-granting college or university, a Minnesota nonprofit two-year vocational technical school granting associate degrees, or a Minnesota postsecondary institution offering only graduate or professional degrees is eligible to receive child care funds from the office and disburse them to eligible students.\n(a) The maximum award to the applicant shall be $6,500 for each eligible child per academic year, except that the campus financial aid officer may apply to the office for approval to increase grants by up to ten percent to compensate for higher market charges for infant care in a community.\n(b) Applicants with contributions at or below the qualifying contribution as determined by the federal need analysis for the federal Pell Grant, as determined by the commissioner, qualify for the maximum award. Applicants with contributions as determined by the federal need analysis exceeding that threshold but less than 200 percent of the qualifying contribution receive an amount proportional to their contribution as determined by the commissioner.\n(c) The academic year award amount must be disbursed by academic term using the following formula:\n(1) the academic year amount described in paragraph (a);\n(2) divided by the number of terms in the academic year; and\n(3) multiplied by the applicable enrollment factor:\n(i) 1.00 for undergraduate students enrolled in 12 or more semester credits or the equivalent or for graduate students enrolled in six or more semester credits or the equivalent;\n(ii) 0.75 for undergraduate students enrolled in nine, ten, or 11 semester credits or the equivalent or for graduate students enrolled in five semester credits or the equivalent;\n(iii) 0.50 for undergraduate students enrolled in six, seven, or eight semester credits or the equivalent or for graduate students enrolled in three or four semester credits or the equivalent; and\n(iv) 0.25 for undergraduate students enrolled in at least one but less than six semester credits or the equivalent or for graduate students enrolled in one or two semester credits or the equivalent.\n(d) Payments shall be made each academic term to the student or to the child care provider, as determined by the institution. Institutions may make payments more than once within the academic term.\nChild care providers may not charge students receiving grants under this section a rate that is higher than the rate charged to private paying clients.\nAn additional term of child care grant may be awarded to an applicant attending classes outside of the regular academic year who meets the requirements in subdivisions 2 and 4. The annual maximum grant per eligible child must not exceed the calculated annual amount in subdivision 4, plus the additional amount in this subdivision, or the student's estimated annual child care cost for not more than 40 hours per week per eligible child, whichever is less.\nAny unexpended appropriation in the child care grant program in the first year of a biennium shall be used to augment the maximum award in subdivision 4 in the second year of the biennium.\n[Repealed, 1995 c 212 art 3 s 60]\nThe office shall base yearly allocations on the need for funds using relevant factors as determined by the office in consultation with the institutions. Up to five percent of the money spent on students' child care awards, as determined by the office, may be used for an institution's administrative expenses related to the child care grant program. Any money designated, but not used, for this purpose must be reallocated to child care grants. An institution may carry forward or backward ten percent of its annual allocation to be used for awards in the previous or subsequent academic year.\nThe office shall establish procedures to (1) continually monitor the use of funds throughout the year; (2) identify areas of unmet need for grants; and (3) redistribute available funds in a timely manner to meet the needs of eligible recipients.\nThe office shall develop and provide information about the program to eligible postsecondary institutions, human service agencies, and potential applicants.\nInstitutions must submit reports, when requested by the office, on program activity including the number of students served, the child care costs, and the number of students on a waiting list for available funds. The reports must also include the institution's method of prioritizing applicants if insufficient funds are available.",
	"repealed": false
}