{
	"id": "123A.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.215",
	"title": "123A.215 INNOVATIVE TECHNOLOGY COOPERATIVE.",
	"text": "(a) Two or more independent school districts may enter into an agreement to establish an innovative cooperative center to provide for technology and other educational services upon the vote of a majority of the full membership of each of the boards of the districts entering into the agreement. The agreement may also provide for membership by a Minnesota state college or university under section 136F.01. When a resolution approving this action has been adopted by the board of a district, the resolution shall be published once in a newspaper of general circulation in the district.\n(b) The agreement may provide for the center to be organized into up to four regions. A region may consist of only school districts, only higher education institutions, or a combination of both.\nA public corporation so created shall be known as ....(insert name).... Cooperative Center No. ..... and shall have an identification number assigned according to section 123A.56.\n(a) The center must be operated by a center board consisting of 12 members. Membership on the center board must be established according to the bylaws and approved by every member of the cooperative.\n(b) The terms of office of the first members of the center board must be determined by lot as follows: one-third of the members for one year, one-third of the members for two years, and the remainder of the members for three years, all terms to expire on June 30 of the appropriate year. Thereafter the terms shall be for three years commencing on July 1 of each year. If a vacancy occurs on the center board, it must be filled by the district, by the members of the appropriate region, or by the higher education members, within 90 days. A person appointed to the center board shall qualify as a center board member by filing with the chair a written certificate of appointment from the appointing school board.\n(c) The first meeting of a center board must be at a time mutually agreed upon by center board members. At this meeting, the center board must choose its officers and conduct any other necessary organizational business. Thereafter, the center board must meet on July 1 of each year or as soon thereafter as practicable pursuant to notice sent to all center board members by the chief executive officer of the center.\n(d) The officers of the center board shall be a chair, vice-chair, clerk, and treasurer, no two of whom when possible shall be from the same school district. The chair shall preside at all meetings of the center board, except that in the chair's absence the vice-chair shall preside. The clerk shall keep a complete record of the minutes of each meeting and the treasurer shall be the custodian of the funds of the center. Insofar as applicable, sections 123B.09, 123B.14, 123B.143, and 123B.147, shall apply to the board and officers of the center.\n(e) A majority of the center board shall be a quorum. Any motion other than adjournment shall pass only upon receiving a majority of the votes of the entire center board.\n(a) The center board shall have the general charge of the business of the center. Where applicable, sections 123B.51 and 123B.52, subdivision 4, shall apply. The center board may not issue bonds on its behalf.\n(b) The center board may furnish technology offerings to any eligible person residing in any participating district and may provide any other educational programs or services agreed upon by the participating members. Academic offerings shall be provided only under the direction of properly licensed academic supervisory personnel.\n(c) The center board must employ an executive director, contract with necessary qualified teachers and administrators, and may discharge the same for cause pursuant to section 122A.40. The authority for selection and employment of a director shall be vested in the center board. Notwithstanding the provisions of section 122A.40, subdivision 10 or 11, no individual shall have a right to employment as a director based on seniority or order of employment by the center. The center board may employ and discharge other necessary employees and may contract for other services deemed necessary.\n(d) The center board may prescribe rates of tuition for services provided to nonmember students.\n(a) The center board established under this section is a public corporation and agency and may receive and disburse federal, state, and local funds made available to it. A participating school district or member must not have any additional individual liability for the debts or obligations of the center except that assessment which has been certified as its proportionate share in accordance with paragraph (b) and subdivision 4. A member of the center board shall have the liability that is applicable to a member of an independent school district board. Any property, real or personal, acquired or owned by the center board for its purposes shall be exempt from taxation by the state or any of its political subdivisions.\n(b) The center board may, in each year, for the purpose of paying any administrative, planning, operating, or capital expenses incurred or to be incurred, assess and certify to each participating school district its proportionate share of any and all expenses. This share must be based upon an equitable distribution formula agreed upon by the participating districts. Each participating district shall remit its assessment to the center board within 30 days after receipt.\nAs of the effective date of the creation of any center as contained in the agreement establishing the center, the organization, operation, maintenance, and conduct of the affairs of the center shall be governed by the general laws relating to independent school districts of the state unless provided otherwise in statute. The center does not have the authority to issue bonds or impose a property tax levy.\nUpon approval by majority vote of a school board and of the center board, an adjoining district may become a member in the center and be governed by the provisions of this section and the agreement in effect. Any participating district may withdraw from the center and from the agreement in effect by a majority vote of the full board membership of the participating district desiring withdrawal and upon compliance with provisions in the agreement establishing the center. Upon receipt of the withdrawal resolution reciting the necessary facts, the center board must file a certified copy with the county auditors of the counties affected. The withdrawal shall become effective at the end of the next following school year, but the withdrawal shall not affect the continued liability of the withdrawing district for liabilities incurred prior to the effective withdrawal date.\nThe boards of each participating district may agree to dissolve the center effective at the end of any school year or at an earlier time as they may mutually agree. A dissolution must be accomplished in accordance with any applicable provisions of the agreement establishing the center. Upon receipt of the dissolution resolutions from the boards of the participating districts, the center board shall file a certified copy with the county auditors of the counties affected. The dissolution must not affect the continuing liability of the previously participating districts for any continuing obligations, including unemployment benefits.",
	"repealed": false
}