{
	"id": "179A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.03",
	"title": "179A.03 DEFINITIONS.",
	"text": "For the purposes of sections 179A.01 to 179A.25, the terms defined in this section have the meanings given them unless otherwise stated.\n\"Appropriate unit\" or \"unit\" means a unit of employees determined under sections 179A.09 to 179A.11. For school districts, unit means all the teachers in the district.\n\"Board\" means the Public Employment Relations Board under section 179A.041.\n\"Bureau\" means the Minnesota Bureau of Mediation Services.\n\"Confidential employee\" means an employee who as part of the employee's job duties:\n(1) is required to access and use labor relations information as that term is defined in section 13.37, subdivision 1, paragraph (c); or\n(2) actively participates in the meeting and negotiating on behalf of the public employer.\n\"Commissioner\" means the commissioner of the bureau.\n\"Court employee\" means a public employee employed by the supreme court, court of appeals, or a judicial district that is under section 480.181, subdivision 1, paragraph (b).\n\"Employee organization\" means any union or organization of public employees whose purpose is, in whole or in part, to deal with public employers concerning grievances and terms and conditions of employment.\n\"Essential employee\" means firefighters, peace officers subject to licensure under sections 626.84 to 626.863, 911 system and police and fire department public safety dispatchers, guards at correctional facilities, confidential employees, supervisory employees, assistant county attorneys, assistant city attorneys, principals, and assistant principals. However, for state employees, \"essential employee\" means all employees in law enforcement, public safety radio communications operators, health care professionals, correctional guards, professional engineering, and supervisory collective bargaining units, irrespective of severance, and no other employees. For University of Minnesota employees, \"essential employee\" means all employees in law enforcement, nursing professional and supervisory units, irrespective of severance, and no other employees. \"Firefighters\" means salaried employees of a fire department whose duties include, directly or indirectly, controlling, extinguishing, preventing, detecting, or investigating fires. Employees for whom the state court administrator is the negotiating employer are not essential employees. For Hennepin Healthcare System, Inc. employees, \"essential employees\" means all employees.\n\"Exclusive representative\" means an employee organization which has been certified by the commissioner under section 179A.12 to meet and negotiate with the employer on behalf of all employees in the appropriate unit.\n\"Fair share fee challenge\" means any proceeding or action instituted by a public employee, a group of public employees, or any other person, to determine their rights and obligations with respect to the circumstances or the amount of a fair share fee.\n\"Meet and confer\" means the exchange of views and concerns between employers and their employees.\n\"Meet and negotiate\" means the performance of the mutual obligations of public employers and the exclusive representatives of public employees to meet at reasonable times, including where possible meeting in advance of the budget making process, with the good faith intent of entering into an agreement on terms and conditions of employment. This obligation does not compel either party to agree to a proposal or to make a concession.\n\"Principal\" and \"assistant principal\" means any person so licensed by the commissioner of education who devotes more than 50 percent of the time to administrative or supervisory duties.\n\"Professional employee\" means:\n(1) any employee engaged in work (i) predominantly intellectual and varied in character as opposed to routine mental, manual, mechanical, or physical work; (ii) involving the consistent exercise of discretion and judgment in its performance; (iii) of a character that the output produced or the result accomplished cannot be standardized in relation to a given period of time; and (iv) requiring advanced knowledge in a field of science or learning customarily acquired by a prolonged course of specialized intellectual instruction and study in an institution of higher learning or a hospital, as distinguished from a general academic education, an apprenticeship, or training in the performance of routine mental, manual, or physical processes; or\n(2) any employee, who (i) has completed the course of advanced instruction and study described in clause (1), item (iv); and (ii) is performing related work under the supervision of a professional person to qualify as a professional employee as defined in clause (1); or\n(3) a teacher.\n(a) \"Public employee\" or \"employee\" means any person appointed or employed by a public employer except:\n(1) elected public officials;\n(2) election officers;\n(3) commissioned or enlisted personnel of the Minnesota National Guard;\n(4) emergency employees who are employed for emergency work caused by natural disaster;\n(5) part-time employees whose service does not exceed the lesser of 14 hours per week or 35 percent of the normal work week in the employee's appropriate unit;\n(6) employees, other than those working in a school as a paraprofessional or other noninstructional position, whose positions are temporary or seasonal in character and are not for more than 67 working days in any calendar year.\n(7) full-time students under the age of 22, enrolled in a nonprofit or public educational institution prior to being hired by the employer, excluding employment by the Board of Regents of the University of Minnesota, whose positions are temporary or seasonal in character and are not for more than 100 working days in any calendar year, and who have indicated, either in an application for employment or by being enrolled at an educational institution for the next academic year or term, an intention to continue as students during or after their temporary employment;\n(8) employees providing services for not more than two consecutive quarters to the Board of Trustees of the Minnesota State Colleges and Universities under the terms of a professional or technical services contract as defined in section 16C.08, subdivision 1;\n(9) employees of charitable hospitals as defined by section 179.35, subdivision 3, except that employees of charitable hospitals as defined by section 179.35, subdivision 3, are public employees for purposes of sections 179A.051, 179A.052, and 179A.13;\n(10) full-time undergraduate students employed by the school, excluding employment by the Board of Regents of the University of Minnesota, which they attend under a work-study program or in connection with the receipt of financial aid, irrespective of number of hours of service per week;\n(11) an individual who is employed for less than 300 hours in a fiscal year as an instructor in an adult vocational education program;\n(12) with respect to court employees:\n(i) personal secretaries to judges;\n(ii) law clerks;\n(iii) managerial employees;\n(iv) confidential employees; and\n(v) supervisory employees; or\n(13) with respect to employees of Hennepin Healthcare System, Inc., managerial, supervisory, and confidential employees.\n(b) The following individuals are public employees regardless of the exclusions of paragraph (a), clauses (5) to (8) and (10):\n(1) an employee hired by a school district or the Board of Trustees of the Minnesota State Colleges and Universities except at the university established in the Twin Cities metropolitan area under section 136F.10 or for community services or community education instruction offered on a noncredit basis: (i) to replace an absent teacher or faculty member who is a public employee, where the replacement employee is employed more than 30 working days as a replacement for that teacher or faculty member; or (ii) to take a teaching position created due to increased enrollment, curriculum expansion, courses which are a part of the curriculum whether offered annually or not, or other appropriate reasons;\n(2) an employee hired for a position under paragraph (a), clause (6), if that same position has already been filled under paragraph (a), clause (6), in the same calendar year and the cumulative number of days worked in that same position by all employees exceeds 67 calendar days in that year. For the purpose of this paragraph, \"same position\" includes a substantially equivalent position if it is not the same position solely due to a change in the classification or title of the position;\n(3) an early childhood family education teacher employed by a school district;\n(4) an individual hired by the Board of Trustees of the Minnesota State Colleges and Universities or the University of Minnesota as the instructor of record to teach (i) one class for more than three credits in a fiscal year, or (ii) two or more credit-bearing classes in a fiscal year; and\n(5) an individual who: (i) is paid by the Board of Regents of the University of Minnesota for work performed at the direction of the university or any of its employees or contractors; and (ii) is enrolled in three or more university credit-bearing classes or one semester as a full-time student or postdoctoral fellow during the fiscal year in which the work is performed. For purposes of this section, work paid by the university includes but is not limited to work that is required as a condition of receiving a stipend or tuition benefit, whether or not the individual also receives educational benefit from performing that work. Individuals who perform supervisory functions in regard to any individuals who are employees under this clause are not considered supervisory employees for the purpose of section 179A.06, subdivision 2.\n(a) \"Public employer\" or \"employer\" means:\n(1) the state of Minnesota for employees of the state not otherwise provided for in this subdivision or section 179A.10 for executive branch employees;\n(2) the Board of Regents of the University of Minnesota for its employees;\n(3) the state court administrator for court employees;\n(4) the state Board of Public Defense for its employees;\n(5) Hennepin Healthcare System, Inc.; and\n(6) notwithstanding any other law to the contrary, the governing body of a political subdivision or its agency or instrumentality which has final budgetary approval authority for its employees. However, the views of elected appointing authorities who have standing to initiate interest arbitration, and who are responsible for the selection, direction, discipline, and discharge of individual employees shall be considered by the employer in the course of the discharge of rights and duties under sections 179A.01 to 179A.25.\n(b) When two or more units of government subject to sections 179A.01 to 179A.25 undertake a project or form a new agency under law authorizing common or joint action, the employer is the governing person or board of the created agency. The governing official or body of the cooperating governmental units shall be bound by an agreement entered into by the created agency according to sections 179A.01 to 179A.25.\n(c) \"Public employer\" or \"employer\" does not include a \"charitable hospital\" as defined in section 179.35, subdivision 2, except that a charitable hospital as defined by section 179.35, subdivision 2, is a public employer for purposes of sections 179A.051, 179A.052, and 179A.13.\n(d) Nothing in this subdivision diminishes the authority granted pursuant to law to an appointing authority with respect to the selection, direction, discipline, or discharge of an individual employee if this action is consistent with general procedures and standards relating to selection, direction, discipline, or discharge which are the subject of an agreement entered into under sections 179A.01 to 179A.25.\n\"Strike\" means concerted action in failing to report for duty, the willful absence from one's position, the stoppage of work, slowdown, or the abstinence in whole or in part from the full, faithful, and proper performance of the duties of employment for the purposes of inducing, influencing, or coercing a change in the conditions or compensation or the rights, privileges, or obligations of employment.\n(a) \"Supervisory employee\" means a person who has the authority to undertake a majority of the following supervisory functions in the interests of the employer: hiring, transfer, suspension, promotion, discharge, assignment, reward, or discipline of other employees, direction of the work of other employees, or adjustment of other employees' grievances on behalf of the employer. To be included as a supervisory function which the person has authority to undertake, the exercise of the authority by the person may not be merely routine or clerical in nature but must require the use of independent judgment. An employee, other than an essential employee, who has authority to effectively recommend a supervisory function, is deemed to have authority to undertake that supervisory function for the purposes of this subdivision. The administrative head of a municipality, municipal utility, or police or fire department, and the administrative head's assistant, are always considered supervisory employees.\n(b) The removal of employees by the employer from a nonsupervisory appropriate unit for the purpose of designating the employees as \"supervisory employees\" shall require either the prior written agreement of the exclusive representative and the written approval of the commissioner or a separate determination by the commissioner before the redesignation is effective.\n\"Teacher\" means any public employee other than a superintendent or assistant superintendent, principal, assistant principal, or a supervisory or confidential employee, employed by a school district:\n(1) in a position for which the person must be licensed by the Professional Educator Licensing and Standards Board or the commissioner of education;\n(2) in a position as a physical therapist, occupational therapist, art therapist, music therapist, or audiologist; or\n(3) in a position creating and delivering instruction to children in a preschool, school readiness, school readiness plus, or prekindergarten program or other school district or charter school-based early education program, except that employees in a bargaining unit certified before January 1, 2023, may remain in a bargaining unit that does not include teachers unless an exclusive representative files a petition for a unit clarification on the status of a preschool, school readiness, school readiness plus, or prekindergarten program or other school district or charter school-based early education program position.\n\"Terms and conditions of employment\" means the hours of employment, the compensation therefor including fringe benefits except retirement contributions or benefits other than employer payment of, or contributions to, premiums for group insurance coverage of retired employees or severance pay, staffing ratios, and the employer's personnel policies affecting the working conditions of the employees. In the case of professional employees the term does not mean educational policies of a school district. \"Terms and conditions of employment\" is subject to section 179A.07. In the case of school employees, \"terms and conditions of employment\" includes adult-to-student ratios in classrooms, student testing, and student-to-personnel ratios.\nMS 2006 [Renumbered subd 5a]",
	"repealed": false
}