{
	"id": "72A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.51",
	"title": "72A.51 RIGHT TO CANCEL.",
	"text": "For the purposes of this section and section 72A.52 \"date of purchase\" means the date on which the purchaser receives a copy of the policy or contract.\nAny individual person may cancel an individual policy of insurance against loss or damage by reason of the sickness of the assured or the assured's dependents, a nonprofit health service plan contract providing benefits for hospital, surgical and medical care, a health maintenance organization subscriber contract, or a policy of insurance authorized by section 60A.06, subdivision 1, clause (4), except Medicare-related coverage as defined in section 62A.3099, subdivision 17, and long-term care insurance as defined in section 62S.01, subdivision 18, by returning the policy or contract and by giving written notice of cancellation any time before midnight of the tenth day following the date of purchase. Notice of cancellation may be given personally or by mail. The policy or contract may be returned personally or by mail. If by mail, the notice or return of the policy or contract is effective upon being postmarked, properly addressed and postage prepaid.\nWith the exception of a variable annuity contract issued pursuant to sections 61A.13 to 61A.21, a person's cancellation of an insurance policy or contract under this section and section 72A.52 is without liability and the person is entitled to a refund of the entire consideration paid for the policy or contract within ten days after notice of cancellation and the returned policy or contract are received by the insurer or its agent. Cancellation under this section and section 72A.52 of a variable annuity contract issued pursuant to sections 61A.13 to 61A.21 shall entitle a person to an amount equal to the sum of (a) the difference between the premiums paid including any contract fees or other charges and the amounts allocated to any separate accounts under the contract and (b) the cash value of the contract, or, if the contract does not have a cash value, the reserve for the contract, on the date the returned contract is received by the insurer or its agent. Cancellation of an insurance policy or contract under this section or section 72A.52 makes the policy or contract void from its inception.\nA person may not waive or surrender a right to cancel an insurance policy or contract under this section and section 72A.52.",
	"repealed": false
}