{
	"id": "65A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.50",
	"title": "65A.50 TRUST OR ESCROW ACCOUNTS; INSURED REAL PROPERTY FIRE OR EXPLOSION LOSS PROCEEDS.",
	"text": "(a) \"Municipality\" means statutory or home rule charter city or town.\n(b) \"Final settlement\" means a determination of the amount due and owing to the insured, for a loss to insured real property, by any of the following means:\n(1) acceptance of a proof of loss by the insurer;\n(2) execution of a release by the insured;\n(3) acceptance of an arbitration award by both the insured and the insurer; or\n(4) judgment of a court of competent jurisdiction.\nExcept as otherwise provided in this section, with respect to insured real property located in a municipality which has elected to apply this section as provided in subdivision 12, when a claim is filed for a loss to insured real property due to fire or explosion and a final settlement is reached on the loss to the insured real property, an insurer shall withhold from payment 25 percent of the actual cash value of the insured real property at the time of the loss or 25 percent of the final settlement, whichever is less. At the time that 25 percent of the settlement or judgment is withheld, the insurer shall give notice of the withholding to the treasurer of the municipality in which the insured real property is located, to the insured, and to any mortgagee having an existing lien or liens against the insured real property, if the mortgagee is named on the policy. In the case of a judgment, notice shall also be provided to the court in which judgment was entered. The notice shall include all of the following:\n(1) the identity and address of the insurer;\n(2) the name and address of each policyholder, including any mortgagee;\n(3) location of the insured real property;\n(4) the date of loss, policy number, and claim number;\n(5) the amount of money withheld;\n(6) a statement that the municipality may have the withheld amount paid into a trust or escrow account established for the purposes of this section if it shows cause, pursuant to subdivision 3, within 30 days that the money should be withheld to protect the public health and safety, otherwise the withheld amount shall be paid to the insured at the expiration of 30 days; and\n(7) an explanation of the provisions of this section and a verbatim reproduction of subdivision 16.\nIn order for a municipality to escrow the amount withheld by the insurer, and to retain that amount, the following procedure shall be used.\n(a) An affidavit prepared by the chief fire official or another authorized representative of the municipality designated by the governing body of the municipality that the damaged insured structure violates existing named health and safety standards requiring the escrow of the withheld amount as surety for the repair, replacement, or removal of the damaged structure shall constitute cause for the escrowing of the withheld amount.\n(b) In the case of a settlement, the affidavit shall be sent to the insurer, the insured, and any mortgagees. Upon receipt of the affidavit, the insurer shall forward the withheld amount to the treasurer of the municipality and shall provide notice of the forwarding to the insured and any mortgagees.\n(c) In the case of a judgment, the affidavit shall be sent to the insurer, the insured, any mortgagees, and the court in which the judgment was entered. Upon receipt of the affidavit, the insurer shall forward the withheld amount to the treasurer of the municipality and shall provide notice of the forwarding to the insured, any mortgagees, and the court in which judgment was entered.\nUpon receipt of money and information from an insurer as prescribed in subdivisions 2 and 3, the local treasurer shall record the information and the date of receipt of the money and shall immediately deposit the money in a trust or escrow account established for purposes of this section. The account may be interest-bearing. If the mortgage on the insured property is in default, the treasurer of the municipality, upon written request from a first mortgagee of property with respect to which policy proceeds were withheld and placed into a trust or escrow account under subdivisions 2, 3, and this subdivision, shall release to the mortgagee all or any part of the policy proceeds received by the municipality with respect to that property, not later than ten days after receipt of the written request by the mortgagee, to the extent necessary to satisfy any outstanding lien of the mortgagee.\nExcept as provided in subdivision 8, money deposited in an account pursuant to subdivision 4 shall not be commingled with municipal funds. Any interest earned on money placed in a trust or escrow account shall be retained by the municipality to defray expenses incurred under this section.\nExcept as provided in clause (3), the policy proceeds deposited under subdivision 4 shall immediately be forwarded to the insured when the chief fire official or another authorized representative of the municipality designated by the governing body of the municipality receives or is shown reasonable proof of any of the following:\n(1) that the damaged or destroyed portions of the insured structure have been repaired or replaced, except to the extent that the amount withheld under this subdivision is needed to complete repair or replacement;\n(2) that the damaged or destroyed structure and any and all remnants of the structure have been removed from the land on which the structure or the remnants of the structure were situated, by the owner or by any other person, in compliance with the local code requirements of the municipality in which the structure was located; or\n(3) that the insured has entered into a contract to perform repair, replacement, or removal services with respect to the insured real property and that the insured consents to payment of funds directly to the contractor performing the services. Funds released under this clause may be forwarded only to a contractor performing services on the insured property.\nReasonable proof required under subdivision 6 shall include any of the following:\n(1) originals or copies of pertinent contracts, invoices, receipts, and other similar papers evidencing both the work performed or to be performed and the materials used or to be used by all contractors performing repair, replacement, or removal services with respect to the insured real property, other than a contractor subject to clause (2);\n(2) an affidavit executed by the contractor which has performed the greatest amount of repair or replacement work on the structure, or which has done most of the clearing and removal work if structure repair or replacement is not to be performed. The contractor shall attach to the affidavit all pertinent contracts, invoices, and receipts and shall swear that these attached papers correctly indicate the nature and extent of the work performed to date by the contractor and the materials used; or\n(3) an inspection of the insured real property to verify that repair, replacement, or clearing has been completed in accordance with subdivision 6.\nIf with respect to a loss, reasonable proof is not received by or shown to a fire official or another authorized representative of the municipality designated by the governing body of the municipality within 45 days after the policy proceeds portion was received by the treasurer, the municipality shall use the retained proceeds to secure, repair, or demolish the damaged or destroyed structure and clear the property in question, so that the structure and property are in compliance with local code requirements and applicable ordinances of the municipality. If, before the lapse of the 45 days after the proceeds portion was received by the treasurer, the municipality has secured, repaired, or demolished the damaged or destroyed structure under chapter 299F or 463 or other applicable law or ordinance, once the 45 days lapse, the municipality may release the special assessment placed on the property, if any, and reimburse itself from the retained funds. No more than 15 percent of the policy proceeds used by the municipality under this subdivision may be attributed to the municipality's administrative expenses, which must be directly related to the actions authorized under this subdivision. Any unused portion of the retained proceeds shall be returned to the insured.\nA final settlement shall not include the payment of policy proceeds for personal property or contents damage or for additional coverage not contained in the fire coverage portion of the fire insurance policy.\nThere shall not be liability on the part of, and a cause of action shall not arise against, an insurer or an agent or employee of an insurer for withholding or transferring money in the course of complying or attempting to comply with this section.\nThis section applies only to final settlements which exceed 49 percent of the insurance on the insured real property.\nThis section applies only to property located in a municipality if the municipality, pursuant to a resolution by the governing body, notifies the commissioner in writing that the municipality has established a trust or escrow account to be used as prescribed in this section and intends to uniformly apply this section with respect to all property located within the municipality following written notification to the commissioner. The commissioner shall prepare and distribute a list of all municipalities which have elected to apply this section to all insurance companies transacting property insurance in this state.\n(a) A municipality shall remain on the list until a written request for deletion has been received by the commissioner, or until the municipality has failed to comply with paragraph (b), and the amended list has been prepared pursuant to this subdivision.\n(b) Municipalities on the list shall report every two years to the commissioner in writing regarding the extent of the municipality's use of this section and the effect of this section on arson fires in that municipality. The report must be filed with the commissioner no later than 90 days after the two-year anniversary of the municipality's placement on the list and thereafter no later than 90 days after each subsequent two-year period. If the commissioner has not received a report required under this paragraph, the commissioner shall promptly provide the municipality a written reminder notice. If the commissioner has not received the report within 30 days after providing the written notice, the municipality shall be treated as having made a written request for deletion under paragraph (a).\nA municipality may apply to be added to the list by making a written request for addition to the commissioner. When a written request for addition from a municipality has been received by the commissioner, an amended list shall be prepared and distributed indicating the addition. The addition shall be effective on the date specified by the commissioner in the amendment. The commissioner shall notify the municipality and insurance companies of the effective date of the addition which shall be effective not less than 30 days after receipt of notice by the insurance company. A municipality shall not apply this section with respect to any loss which occurred before the effective date of the addition.\nA municipality may cease to apply this section for a period of not less than six months upon not less than 30 days' written notice to the commissioner. After receipt of request to be deleted from the list, the commissioner shall prepare and distribute an amendment to the list indicating the deletion. The deletion shall be effective on the date specified by the commissioner in the amendment. The commissioner shall notify the municipality and insurance companies of the effective date of the deletion which shall be effective not less than 30 days after receipt of the notice by the insurance company. A municipality shall continue to apply this section with respect to any loss which occurred before the effective date of the deletion, notwithstanding the deletion.\nThe withholding requirements of this section do not apply if all of the following occur:\n(1) within 30 days after agreement on a final settlement between the insured and the insurer, the insured has filed with the insurer evidence of a contract to repair as described in subdivision 7;\n(2) the insured consents to the payment of funds directly to the contractor performing the repair services. Funds released under this clause may be forwarded only to a contractor performing the repair services on the insured property; and\n(3) on receipt of the contract to repair, the insurer gives notice to the municipality in which the property is situated that there will not be a withholding under this section because of the repair contract.\nIf the insured and the insurer have agreed on the demolition costs or the debris removal costs as part of the final settlement of the real property insured claim, the insurer shall withhold one of the following sums, whichever sum is the largest, and shall pay that sum in accordance with this section:\n(1) the agreed cost of demolition or debris removal;\n(2) 25 percent of the actual cash value of the insured real property at the time of loss; or\n(3) 25 percent of the final settlement of the insured real property claim.",
	"repealed": false
}