{
	"id": "245.4885",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4885",
	"title": "245.4885 SCREENING FOR INPATIENT AND RESIDENTIAL TREATMENT.",
	"text": "(a) Prior to admission or placement, except in the case of an emergency, all children referred for treatment of severe emotional disturbance in a treatment foster care setting, residential treatment facility, or informally admitted to a regional treatment center shall undergo an assessment to determine the appropriate level of care if county funds are used to pay for the child's services. An emergency includes when a child is in need of and has been referred for crisis stabilization services under section 245.4882, subdivision 6. A child who has been referred to residential treatment for crisis stabilization services in a residential treatment center is not required to undergo an assessment under this section.\n(b) The county board shall determine the appropriate level of care for a child when county-controlled funds are used to pay for the child's residential treatment under this chapter, including residential treatment provided in a qualified residential treatment program as defined in section 260C.007, subdivision 26d. When a county board does not have responsibility for a child's placement and the child is enrolled in a prepaid health program under section 256B.69, the enrolled child's contracted health plan must determine the appropriate level of care for the child. When Indian Health Services funds or funds of a tribally owned facility funded under the Indian Self-Determination and Education Assistance Act, Public Law 93-638, are used for the child, the Indian Health Services or 638 tribal health facility must determine the appropriate level of care for the child. When more than one entity bears responsibility for a child's coverage, the entities shall coordinate level of care determination activities for the child to the extent possible.\n(c) The child's level of care determination shall determine whether the proposed treatment:\n(1) is necessary;\n(2) is appropriate to the child's individual treatment needs;\n(3) cannot be effectively provided in the child's home; and\n(4) provides a length of stay as short as possible consistent with the individual child's needs.\n(d) When a level of care determination is conducted, the county board or other entity may not determine that a screening of a child, referral, or admission to a residential treatment facility is not appropriate solely because services were not first provided to the child in a less restrictive setting and the child failed to make progress toward or meet treatment goals in the less restrictive setting. The level of care determination must be based on a diagnostic assessment of a child that evaluates the child's family, school, and community living situations; and an assessment of the child's need for care out of the home using a validated tool which assesses a child's functional status and assigns an appropriate level of care to the child. The validated tool must be approved by the commissioner of human services and may be the validated tool approved for the child's assessment under section 260C.704 if the juvenile treatment screening team recommended placement of the child in a qualified residential treatment program. If a diagnostic assessment has been completed by a mental health professional within the past 180 days, a new diagnostic assessment need not be completed unless in the opinion of the current treating mental health professional the child's mental health status has changed markedly since the assessment was completed. The child's parent shall be notified if an assessment will not be completed and of the reasons. A copy of the notice shall be placed in the child's file. Recommendations developed as part of the level of care determination process shall include specific community services needed by the child and, if appropriate, the child's family, and shall indicate whether these services are available and accessible to the child and the child's family. The child and the child's family must be invited to any meeting where the level of care determination is discussed and decisions regarding residential treatment are made. The child and the child's family may invite other relatives, friends, or advocates to attend these meetings.\n(e) During the level of care determination process, the child, child's family, or child's legal representative, as appropriate, must be informed of the child's eligibility for case management services and family community support services and that an individual family community support plan is being developed by the case manager, if assigned.\n(f) The level of care determination, placement decision, and recommendations for mental health services must be documented in the child's record and made available to the child's family, as appropriate.\nEffective July 1, 2006, if a child is admitted to a treatment foster care setting, residential treatment facility, or held for emergency care by a regional treatment center under section 253B.051, subdivision 2, the level of care determination must occur within five working days of admission.\nLevel of care determination of children for treatment foster care, residential, and inpatient services must be conducted by a mental health professional. Where appropriate and available, culturally informed mental health consultants must participate in the level of care determination. Mental health professionals providing level of care determination for treatment foster care, inpatient, and residential services must not be financially affiliated with any nongovernment entity which may be providing those services.\nThe county board shall enter into an individual placement agreement with a provider of residential treatment services to a child eligible for county-paid services under this section. The agreement must specify the payment rate and terms and conditions of county payment for the placement.\n[Repealed, 1993 c 337 s 20]\nThe county board shall annually collect summary information on the number of children screened, the age and racial or ethnic background of the children, the presenting problem, and the screening recommendations. The county shall include information on the degree to which these recommendations are followed and the reasons for not following recommendations. Summary data shall be available to the public and shall be used by the county board and local children's advisory council to identify needed service development.",
	"repealed": false
}