{
	"id": "515B.1-103",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.1-103",
	"title": "515B.1-103 DEFINITIONS.",
	"text": "In the declaration and bylaws, unless specifically provided otherwise or the context otherwise requires, and in this chapter:\n(1) \"Additional real estate\" means real estate that may be added to a flexible common interest community.\n(2) \"Affiliate of a declarant\" means any person who controls, is controlled by, or is under common control with a declarant.\n(A) A person \"controls\" a declarant if the person (i) is a general partner, officer, director, or employer of the declarant, (ii) directly or indirectly or acting in concert with one or more other persons, or through one or more subsidiaries, owns, controls, holds with power to vote, or holds proxies representing, more than 20 percent of the voting interest in the declarant, (iii) controls in any manner the election of a majority of the directors of the declarant, or (iv) has contributed more than 20 percent of the capital of the declarant.\n(B) A person \"is controlled by\" a declarant if the declarant (i) is a general partner, officer, director, or employer of the person, (ii) directly or indirectly or acting in concert with one or more other persons, or through one or more subsidiaries, owns, controls, holds with power to vote, or holds proxies representing, more than 20 percent of the voting interest in the person, (iii) controls in any manner the election of a majority of the directors of the person, or (iv) has contributed more than 20 percent of the capital of the person.\n(C) Control does not exist if the powers described in this subsection are held solely as a security interest and have not been exercised.\n(3) \"Allocated interests\" means the following interests allocated to each unit: (i) in a condominium, the undivided interest in the common elements, the common expense liability, and votes in the association; (ii) in a cooperative, the common expense liability and the ownership interest and votes in the association; and (iii) in a planned community, the common expense liability and votes in the association.\n(4) \"Association\" means the unit owners' association organized under section 515B.3-101.\n(5) \"Board\" means the body, regardless of name, designated in the articles of incorporation, bylaws or declaration to act on behalf of the association, or on behalf of a master association when so identified.\n(6) \"CIC plat\" means a common interest community plat described in section 515B.2-110.\n(7) \"Common elements\" means all portions of the common interest community other than the units.\n(8) \"Common expenses\" means expenditures made or liabilities incurred by or on behalf of the association, or master association when so identified, together with any allocations to reserves.\n(9) \"Common expense liability\" means the liability for common expenses allocated to each unit pursuant to section 515B.2-108.\n(10) \"Common interest community\" or \"CIC\" means contiguous or noncontiguous real estate within Minnesota that is subject to an instrument which obligates persons owning a separately described parcel of the real estate, or occupying a part of the real estate pursuant to a proprietary lease, by reason of their ownership or occupancy, to pay for (i) real estate taxes levied against; (ii) insurance premiums payable with respect to; (iii) maintenance of; or (iv) construction, maintenance, repair or replacement of improvements located on, one or more parcels or parts of the real estate other than the parcel or part that the person owns or occupies. Real estate which satisfies the definition of a common interest community is a common interest community whether or not it is subject to this chapter. Real estate subject to a master declaration, regardless of when the master declaration was recorded, shall not collectively constitute a separate common interest community unless so stated in the master declaration.\n(11) \"Condominium\" means a common interest community in which (i) portions of the real estate are designated as units, (ii) the remainder of the real estate is designated for common ownership solely by the owners of the units, and (iii) undivided interests in the common elements are vested in the unit owners.\n(11a) \"Construction defect claim\" means a civil action or an arbitration proceeding based on any legal theory including, but not limited to, claims under chapter 327A for damages, indemnity, or contribution brought against a development party to assert a claim, counterclaim, cross-claim, or third-party claim for damages or loss to, or the loss of use of, real or personal property caused by a defect in the initial design or construction of an improvement to real property that is part of a common interest community, including an improvement that is constructed on additional real estate pursuant to section 515B.2-111. \"Construction defect claim\" does not include claims related to subsequent maintenance, repairs, alterations, or modifications to, or the addition of, improvements that are part of the common interest community, and that are contracted for by the association or a unit owner.\n(12) \"Conversion property\" means real estate on which is located a building that at any time within two years before creation of the common interest community was occupied, in whole or in part, for (i) residential use or (ii) for residential rental purposes by persons other than purchasers and persons who occupy with the consent of purchasers.\n(13) \"Cooperative\" means a common interest community in which the real estate is owned by an association, each of whose members is entitled to a proprietary lease by virtue of the member's ownership interest in the association.\n(14) \"Dealer\" means a person in the business of selling units for the person's own account.\n(15) \"Declarant\" means:\n(i) if the common interest community has been created, (A) any person who has executed a declaration, or a supplemental declaration or amendment to a declaration adding additional real estate, except secured parties, a spouse holding only an inchoate interest, persons whose interests in the real estate will not be transferred to unit owners, or, in the case of a leasehold common interest community, a lessor who possesses no special declarant rights and who is not an affiliate of a declarant who possesses special declarant rights, or (B) any person who reserves, or succeeds under section 515B.3-104 to any special declarant rights;\n(ii) any person or persons acting in concert who have offered prior to creation of the common interest community to transfer their interest in a unit to be created and not previously transferred; or\n(iii) if (A) a unit has been restricted to nonresidential use and sold to a purchaser who has agreed to modify or waive, in whole or in part, sections 515B.4-101 to 515B.4-118, and (B) the restriction expires or is modified or terminated such that residential use of the unit is permitted, the unit owner at the time the restriction expires or is so modified or terminated is a declarant with respect to that unit and any improvements subject to use rights by a purchaser of the unit.\n(16) \"Declaration\" means any instrument, however denominated, that creates a common interest community.\n(16a) \"Development party\" means an architect, contractor, construction manager, subcontractor, developer, declarant, engineer, or private inspector performing or furnishing the design, supervision, inspection, construction, coordination, or observation of the construction of any improvement to real property that is part of a common interest community, or any of the person's affiliates, officers, directors, shareholders, members, or employees.\n(17) \"Dispose\" or \"disposition\" means a voluntary transfer to a purchaser of any legal or equitable interest in the common interest community, but the term does not include the transfer or release of a security interest.\n(18) \"Flexible common interest community\" means a common interest community to which additional real estate may be added.\n(19) \"Leasehold common interest community\" means a common interest community in which all or a portion of the real estate is subject to a lease the expiration or termination of which will terminate the common interest community or reduce its size.\n(20) \"Limited common element\" means a portion of the common elements allocated by the declaration or by operation of section 515B.2-109(c) or (d) for the exclusive use of one or more but fewer than all of the units.\n(21) \"Master association\" means an entity created on or after June 1, 1994, that directly or indirectly exercises any of the powers set forth in section 515B.3-102 on behalf of one or more members described in section 515B.2-121(b), (i), (ii) or (iii), whether or not it also exercises those powers on behalf of one or more property owners' associations described in section 515B.2-121(b)(iv). A person (i) hired by an association to perform maintenance, repair, accounting, bookkeeping or management services, or (ii) granted authority under an instrument recorded primarily for the purpose of creating rights or obligations with respect to utilities, access, drainage, or recreational amenities, is not, solely by reason of that relationship, a master association.\n(22) \"Master declaration\" means a written instrument, however named, (i) recorded on or after June 1, 1994, and (ii) complying with section 515B.2-121, subsection (e).\n(23) \"Master developer\" means a person who is designated in the master declaration as a master developer or, in the absence of such a designation, the owner or owners of the real estate subject to the master declaration at the time the master declaration is recorded, except (i) secured parties and (ii) a spouse holding only an inchoate interest. A master developer is not a declarant unless the master declaration states that the real estate subject to the master declaration collectively is or collectively will be a separate common interest community.\n(24) \"Period of declarant control\" means the time period provided for in section 515B.3-103(c) during which the declarant may appoint and remove officers and directors of the association.\n(25) \"Person\" means an individual, corporation, limited liability company, partnership, trustee under a trust, personal representative, guardian, conservator, government, governmental subdivision or agency, or other legal or commercial entity capable of holding title to real estate.\n(26) \"Planned community\" means a common interest community that is not a condominium or a cooperative. A condominium or cooperative may be a part of a planned community.\n(27) \"Proprietary lease\" means an agreement with a cooperative association whereby a member of the association is entitled to exclusive possession of a unit in the cooperative.\n(28) \"Purchaser\" means a person, other than a declarant, who by means of a voluntary transfer acquires a legal or equitable interest in a unit other than (i) a leasehold interest of less than 20 years, including renewal options, or (ii) a security interest.\n(29) \"Real estate\" means any fee simple, leasehold or other estate or interest in, over, or under land, including structures, fixtures, and other improvements and interests that by custom, usage, or law pass with a conveyance of land though not described in the contract of sale or instrument of conveyance. \"Real estate\" may include spaces with or without upper or lower boundaries, or spaces without physical boundaries.\n(30) \"Residential use\" means use as a dwelling, whether primary, secondary or seasonal, but not (i) transient use such as hotels or motels, (ii) use for residential rental purposes if the individual dwellings are not separate units or if the individual dwellings are not located on separate parcels of real estate. For purposes of this chapter, a unit is restricted to nonresidential use if the unit is subject to a restriction that prohibits residential use as defined in this section whether or not the restriction also prohibits the uses described in this paragraph.\n(31) \"Secured party\" means the person owning a security interest as defined in paragraph (32).\n(32) \"Security interest\" means a perfected interest in real estate or personal property, created by contract or conveyance, which secures payment or performance of an obligation. The term includes a mortgagee's interest in a mortgage, a vendor's interest in a contract for deed, a lessor's interest in a lease intended as security, a holder's interest in a sheriff's certificate of sale during the period of redemption, an assignee's interest in an assignment of leases or rents intended as security, in a cooperative, a lender's interest in a member's ownership interest in the association, a pledgee's interest in the pledge of an ownership interest, or any other interest intended as security for an obligation under a written agreement.\n(33a) This definition of special declarant rights applies only to common interest communities created before August 1, 2010. \"Special declarant rights\" means rights reserved in the declaration for the benefit of a declarant to:\n(i) complete improvements indicated on the CIC plat, planned by the declarant consistent with the disclosure statement or authorized by the municipality in which the CIC is located;\n(ii) add additional real estate to a common interest community;\n(iii) subdivide or combine units, or convert units into common elements, limited common elements, or units;\n(iv) maintain sales offices, management offices, signs advertising the common interest community, and models;\n(v) use easements through the common elements for the purpose of making improvements within the common interest community or any additional real estate;\n(vi) create a master association and provide for the exercise of authority by the master association over the common interest community or its unit owners;\n(vii) merge or consolidate a common interest community with another common interest community of the same form of ownership; or\n(viii) appoint or remove any officer or director of the association, or the master association where applicable, during any period of declarant control.\n(33b) This definition of special declarant rights applies only to common interest communities created on or after August 1, 2010. \"Special declarant rights\" means rights reserved in the declaration for the benefit of a declarant and expressly identified in the declaration as special declarant rights. Such special declarant rights may include but are not limited to the following:\n(i) to complete improvements indicated on the CIC plat, planned by the declarant consistent with the disclosure statement or authorized by the municipality in which the common interest community is located, and to have and use easements for itself and its employees, agents, and contractors through the common elements for such purposes;\n(ii) to add additional real estate to a common interest community;\n(iii) to subdivide or combine units, or convert units into common elements, limited common elements and/or units, pursuant to section 515B.2-112;\n(iv) to maintain and use sales offices, management offices, signs advertising the common interest community, and models, and to have and use easements for itself and its employees, agents, and invitees through the common elements for such purposes;\n(v) to appoint or remove any officer or director of the association during any period of declarant control;\n(vi) to utilize an alternate common expense plan as provided in section 515B.3-115(a)(2);\n(vii) to grant common element licenses as provided in section 515B.2-109(e); or\n(viii) to review, and approve or disapprove, the exterior design, materials, size, site location, and other exterior features of buildings and other structures, landscaping and other exterior improvements, located within the common interest community, and any modifications or alterations thereto.\nSpecial declarant rights shall not be reserved or utilized for the purpose of evading any limitation or obligation imposed on declarants by this chapter.\n(34) \"Time share\" means a right to occupy a unit or any of several units during three or more separate time periods over a period of at least three years, including renewal options, whether or not coupled with a fee title interest in the common interest community or a specified portion thereof.\n(35) \"Unit\" means a portion of a common interest community the boundaries of which are described in the common interest community's declaration and which is intended for separate ownership, or separate occupancy pursuant to a proprietary lease.\n(36) \"Unit identifier\" means English letters or Arabic numerals, or a combination thereof, which identify only one unit in a common interest community and which meet the requirements of section 515B.2-104.\n(37) \"Unit owner\" means a declarant or other person who owns a unit, a lessee under a proprietary lease, or a lessee of a unit in a leasehold common interest community whose lease expires simultaneously with any lease the expiration or termination of which will remove the unit from the common interest community, but does not include a secured party. In a common interest community, the declarant is the unit owner of a unit until that unit has been conveyed to another person.",
	"repealed": false
}