{
	"id": "473.5491",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.5491",
	"title": "473.5491 METROPOLITAN CITIES INFLOW AND INFILTRATION GRANTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Affordability criteria\" means an inflow and infiltration project service area that is located, in whole or in part, in a census tract where at least three of the following apply as determined using the most recently published data from the United States Census Bureau or United States Centers for Disease Control and Prevention:\n(1) 20 percent or more of the residents have income below the federal poverty thresholds;\n(2) the tract has a United States Centers for Disease Control and Prevention Social Vulnerability Index greater than 0.80;\n(3) the upper limit of the lowest quintile of household income is less than the state upper limit of the lowest quintile;\n(4) the housing vacancy rate is greater than the state average; or\n(5) the percent of the population receiving Supplemental Nutrition Assistance Program (SNAP) benefits is greater than the state average.\n(c) \"City\" means a statutory or home rule charter city located within the metropolitan area.\n(a) The council shall make grants to cities for capital improvements in municipal wastewater collection systems to reduce the amount of inflow and infiltration to the council's metropolitan sanitary sewer disposal system.\n(b) A grant under this section may be made in an amount up to 50 percent of the cost to mitigate inflow and infiltration in the publicly owned municipal wastewater collection system. The council may award a grant up to 100 percent of the cost to mitigate inflow and infiltration in the publicly owned municipal wastewater collection system if the project meets affordability criteria.\nTo be eligible for a grant under this section, a city must be identified by the council as a contributor of excessive inflow and infiltration in the metropolitan disposal system or have a measured flow rate within 20 percent of its allowable council-determined inflow and infiltration limits.\nThe council must award grants based on applications from cities that identify eligible capital costs and include a timeline for inflow and infiltration mitigation construction, pursuant to guidelines established by the council. The council must prioritize applications that meet affordability criteria.\nIf a grant is awarded to a city and funds are not encumbered for the grant within four years after the award date, the grant must be canceled.",
	"repealed": false
}