{
	"id": "142B.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.45",
	"title": "142B.45 CRIB SAFETY REQUIREMENTS.",
	"text": "The commissioners of children, youth, and families and human services shall maintain a link from the licensing division website to the United States Consumer Product Safety Commission website that addresses crib safety information.\n(a) All licensed child care providers, children's residential facilities, substance use disorder treatment programs with children in care, and residential habilitation programs serving children with developmental disabilities must maintain the following documentation for every crib used by or that is accessible to any child in care:\n(1) the crib's brand name; and\n(2) the crib's model number.\n(b) Any crib for which the license holder does not have the documentation required under paragraph (a) must not be used by or be accessible to children in care.\n(c) The licensed program must maintain documentation that meets federal documentation requirements to show that every full-size and non-full-size crib that is used by or is accessible to any child in care is compliant with federal crib standards under Code of Federal Regulations, title 16, part 1219, for full-size baby cribs, or Code of Federal Regulations, title 16, part 1220, for non-full-size baby cribs.\n(a) Annually, from the date printed on the license, all license holders shall check all their cribs' brand names and model numbers against the United States Consumer Product Safety Commission website listing of unsafe cribs.\n(b) The license holder shall maintain written documentation to be reviewed on site for each crib showing that the review required in paragraph (a) has been completed, and which of the following conditions applies:\n(1) the crib was not identified as unsafe on the United States Consumer Product Safety Commission website;\n(2) the crib was identified as unsafe on the United States Consumer Product Safety Commission website, but the license holder has taken the action directed by the United States Consumer Product Safety Commission to make the crib safe; or\n(3) the crib was identified as unsafe on the United States Consumer Product Safety Commission website, and the license holder has removed the crib so that it is no longer used by or accessible to children in care.\n(c) Documentation of the review completed under this subdivision shall be maintained by the license holder on site and made available to parents or guardians of children in care and the commissioner.\n(d) Notwithstanding Minnesota Rules, part 9502.0425, a family child care provider that complies with this section may use a mesh-sided or fabric-sided play yard, pack and play, or playpen or crib that has not been identified as unsafe on the United States Consumer Product Safety Commission website for the care or sleeping of infants.\n(e) On at least a monthly basis, the family child care license holder shall perform safety inspections of every mesh-sided or fabric-sided play yard, pack and play, or playpen used by or that is accessible to any child in care, and must document the following:\n(1) there are no tears, holes, or loose or unraveling threads in mesh or fabric sides of crib;\n(2) the weave of the mesh on the crib is no larger than one-fourth of an inch;\n(3) no mesh fabric is unsecure or unattached to top rail and floor plate of crib;\n(4) no tears or holes to top rail of crib;\n(5) the mattress floor board is not soft and does not exceed one inch thick;\n(6) the mattress floor board has no rips or tears in covering;\n(7) the mattress floor board in use is an original mattress or replacement mattress provided by the manufacturer of the crib;\n(8) there are no protruding or loose rivets, metal nuts, or bolts on the crib;\n(9) there are no knobs or wing nuts on outside crib legs;\n(10) there are no missing, loose, or exposed staples; and\n(11) the latches on top and side rails used to collapse crib are secure, they lock properly, and are not loose.\n(f) If a cradleboard is used in a licensed setting, the license holder must check the cradleboard not less than monthly to ensure the cradleboard is structurally sound and there are no loose or protruding parts. The license holder shall maintain written documentation of this review.\n(a) On at least a monthly basis, the license holder shall perform safety inspections of every crib or portable crib of rigid construction including full-size and non-full-size cribs used by or that is accessible to any child in care, and must document the following:\n(1) no mattress supports can be easily dislodged from any point of the crib;\n(2) no screws, bolts, or hardware are loose or not secured, and there is no use of wood screws in components that are designed to be assembled and disassembled by the crib owner;\n(3) no sharp edges, points, or rough surfaces are present;\n(4) no wood surfaces are rough, splintered, split, or cracked; and\n(5) no unacceptable gaps between the mattress and any sides of the crib are present as follows:\n(i) when the noncompressed mattress is centered in the non-full-size crib, at any of the adjustable mattress support positions, the gap between the perimeter of the mattress and the perimeter of the crib cannot be greater than one-half inch at any point. When the mattress is placed against the perimeter of the crib, the resulting gap cannot be greater than one inch at any point; and\n(ii) when the noncompressed mattress is centered in the full-size crib, at any of the adjustable mattress support positions, the gap between the perimeter of the mattress and the perimeter of the crib cannot be greater than 11/16 inch at any point. When the mattress is placed against the perimeter of the crib, the resulting gap cannot be greater than 1-3/8 inch at any point.\n(b) Upon discovery of any unsafe condition identified by the license holder during the safety inspection required under paragraph (a) or subdivision 3, paragraph (e), the license holder shall immediately remove the crib from use and ensure that the crib is not accessible to children in care, and as soon as practicable, but not more than two business days after the inspection, remove the crib from the area where child care services are routinely provided for necessary repairs or to destroy the crib.\n(c) Documentation of the inspections and actions taken with unsafe cribs required in paragraphs (a) and (b), and subdivision 3, paragraph (e), shall be maintained on site by the license holder and made available to parents of children in care and the commissioner.\nDuring routine licensing inspections, and when investigating complaints regarding alleged violations of this section, the commissioner of the licensed program shall review the provider's documentation required under subdivisions 3 and 4.\nThe commissioner of the licensed program may issue a licensing action under section 142B.16 or 142B.18 if a license holder fails to comply with the requirements of this section.",
	"repealed": false
}