{
	"id": "527.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/527.32",
	"title": "527.32 CARE OF CUSTODIAL PROPERTY.",
	"text": "(a) A custodian shall:\n(1) take control of custodial property;\n(2) register or record title to custodial property if appropriate; and\n(3) collect, hold, manage, invest, and reinvest custodial property.\n(b) In dealing with custodial property, a custodian shall comply with the prudent investor rule set forth in section 501C.0901 as if such custodial property were trust property. However, a custodian, in the custodian's discretion and without liability to the minor or the minor's estate, may retain any custodial property received from a transferor.\n(c) A custodian may invest in or pay premiums on life insurance or endowment policies on (i) the life of the minor only if the minor or the minor's estate is the sole beneficiary, or (ii) the life of another person in whom the minor has an insurable interest only to the extent that the minor, the minor's estate, or the custodian in the capacity of custodian, is the irrevocable beneficiary.\n(d) A custodian at all times shall keep custodial property separate and distinct from all other property in a manner sufficient to identify it clearly as custodial property of the minor. Custodial property consisting of certificated securities may be held on deposit at a stock brokerage firm or financial institution registered in a street name or nominee name. Custodial property consisting of an undivided interest is so identified if the minor's interest is held as a tenant in common and is fixed. Custodial property subject to recordation is so identified if it is recorded, and custodial property subject to registration is so identified if it is either registered, or held in an account designated, in the name of the custodian, followed in substance by the words: \"as a custodian for ............ (name of minor) under the Minnesota Uniform Transfers to Minors Act.\"\n(e) A custodian shall keep records of all transactions with respect to custodial property, including information necessary for the preparation of the minor's tax returns, and shall make them available for inspection at reasonable intervals by a parent or legal representative of the minor or by the minor if the minor has attained the age of 14 years.",
	"repealed": false
}