{
	"id": "37.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/37.03",
	"title": "37.03 MEMBERSHIP.",
	"text": "(a) Members of the State Agricultural Society must be citizens of this state. The membership is as follows:\n(1) Three delegates chosen annually by each agricultural society or association in the state which maintains an active existence, holds annual fairs, and is entitled to share in the state appropriation under the provisions of section 38.02. If one of those societies or associations fails to choose delegates, then its president, secretary, and treasurer, by virtue of their offices, are its delegates. If two fairs receiving state aid are operating in one county, each delegate from each society or association is entitled to one-half vote at regular or special meetings of the state society.\n(2) One delegate appointed by the county board of each county in which no county or district agricultural society exists.\n(3) Individuals elected by the society as honorary members for having performed eminent services in agriculture, horticulture, or related arts and sciences or long and faithful service in or benefits to the society. Honorary members must be elected by two-thirds vote at any annual meeting. The number of honorary members may not exceed the society's membership and only one honorary member may be elected annually. Each honorary member is entitled to one vote.\n(4) Two elected delegates and the president may represent each of the following societies and associations: the Minnesota State Horticultural Society, the Minnesota Dairy Goat Association, the Minnesota Honey Producers Association, Inc., the Minnesota Livestock Breeders' Association, the Minnesota Crop Improvement Association, the Minnesota Pork Producers Association, the Minnesota Lamb and Wool Producers Association, the Minnesota Horse Breeders' Association, the Minnesota Veterinary Medical Association, the Minnesota Beef Cattle Improvement Association, the Central Livestock Association, the Minnesota State Poultry Association, the Farm Equipment Association, the Minnesota State Florists Association, the State Fair Exhibitors' Organization, the Minnesota Federation of County Fairs, the Minnesota Forestry Association, the Minnesota Horse Council, Minnesota Nursery and Landscape Association, Minnesota Apple Growers' Association, State Grange of Minnesota, Minnesota Farmers' Union, American Dairy Association of the Midwest, and the Minnesota Farm Bureau Federation.\n(5) The following societies and associations are entitled to one delegate each: Central Minnesota Vegetable Growers Association, the Minnesota Fruit and Vegetable Growers' Association, Minnesota Shorthorn Breeders' Association, the Minnesota Milking Shorthorn Association, Minnesota Guernsey Breeders' Association, Minnesota Jersey Cattle Club, Minnesota Holstein Association, Minnesota Hereford Breeders, the Minnesota Angus Association, Minnesota Ayreshire Breeders' Association, Minnesota Brown Swiss Association, Minnesota Poland China Breeders' Association, Minnesota Duroc Breeders', Minnesota Chester White Association, Minnesota Turkey Growers' Association, Minnesota Gladiolus Society, Minnesota Hampshire Sheep Association, Minnesota Suffolk Sheep Association, North American Dairy Sheep Association, and the Minnesota Berkshire Association.\n(b) The societies and associations listed in paragraph (a), clauses (4) and (5), must be active and statewide in their scope and operation, hold annual meetings, and be incorporated under the laws of the state before they are entitled to a delegate. The societies and associations must file with the secretary of state, on or before December 20, a report showing that the society or association has held a regular annual meeting for that year, a summary of its financial transactions for the current year, and an affidavit of the president and secretary that it has a paid-up membership of at least 25. On or before December 31, the secretary of state shall certify to the secretary of the State Agricultural Society the names of the societies or associations that have complied with these provisions.\n(c) If a society or association ceases to exist or otherwise fails to comply with the requirements of paragraph (b), its membership in the State Agricultural Society and its right to delegates is terminated and it may be replaced by another society or association representing the same or similar interests and chosen by a majority vote of the members of the society at its next annual meeting.\n(d) The members of the board of managers of the State Agricultural Society are members of the society and entitled to one vote each.\nOn all questions arising for determination by the State Agricultural Society, including the election of members of the board of managers, each delegate present is entitled to one vote. The society shall not recognize proxies except that when less than three delegates of a county or district agricultural society shall attend the annual meeting, those present may cast the full vote of that society. All delegates must be accredited, in writing, and their credentials must be signed by the president and secretary of the society or association represented.",
	"repealed": false
}