{
	"id": "60L.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.01",
	"title": "60L.01 DEFINITIONS.",
	"text": "For purposes of sections 60L.01 to 60L.15, the definitions in subdivisions 2 to 15 have the meanings given them.\n\"Admitted assets\" means the assets as shown by an insurer's financial statement most recently required to be filed with the commissioner, or such other financial statement required to be filed with the commissioner as the context may require, but excluding assets allocated to separate accounts. For these purposes, assets must be valued according to valuation regulations prescribed by the National Association of Insurance Commissioners and procedures adopted by the National Association of Insurance Commissioners' Financial Condition Ex.4 Subcommittee if not addressed in another section, unless the commissioner requires or finds another method of valuation reasonable under the circumstances. For purposes of any other investment limitation based on the amount of the admitted assets of a life insurer governed by sections 60L.01 to 60L.15, \"admitted assets\" has the meaning given under this subdivision.\n\"Commissioner\" means the commissioner of commerce.\n\"Derivative instrument\" means an item appropriately reported in schedule DB, derivative instruments, or schedule DC, insurance futures and insurance futures options, of an insurer's statutory financial statement, or successor schedules, as provided under applicable annual statement instructions or statutory accounting guidelines.\n\"Derivative transaction\" means a transaction involving the use of one or more derivative instruments.\n\"Government sponsored enterprise\" means a governmental agency, a corporation, limited liability company, association, partnership, joint stock company, joint venture, trust, or other entity or instrumentality organized under the laws of the United States to accomplish a public policy or other governmental purpose.\n\"Income generation\" means a derivative transaction involving the writing of covered options, caps, or floors that is intended to generate income or enhance return.\n\"Insurer\" means a domestic insurance company, including a fraternal benefit society.\n\"Lower grade investment\" means a rated credit instrument or debt-like preferred stock rated 4, 5, or 6 by the Securities Valuation Office of the National Association of Insurance Commissioners or any successor office.\n\"Medium grade investment\" means a rated credit instrument or debt-like preferred stock rated 3 by the Securities Valuation Office of the National Association of Insurance Commissioners or any successor office.\n\"Minimum asset requirement\" means: (1) in the case of an insurer other than a life insurer, the sum of an insurer's liabilities and its minimum financial security benchmark; and (2) in the case of a life insurer, the sum of the insurer's liabilities, other than the asset valuation reserve, voluntary investment reserves and liabilities on separate accounts, and its minimum financial security benchmark.\n\"Minimum financial security benchmark\" means the amount an insurer is required to have under section 60L.03.\n\"Nationally recognized statistical rating organization\" means a rating organization so designated by the Securities and Exchange Commission of the United States and that has applied to, and whose status as a nationally recognized statistical rating organization has been confirmed by, the Securities Valuation Office of the National Association of Insurance Commissioners, or any other rating organization approved by the commissioner as a nationally recognized statistical rating organization for purposes of sections 60L.01 to 60L.15.\n\"Replicated investment position\" means the statement value of the position reported under the heading \"Replicated (Synthetic) Asset\" on Schedule DB, Part F, of the annual statement of the insurer, or any successor provision.\n\"Replication transaction\" means a derivative transaction that is intended to replicate the performance of one or more assets that an insurer is authorized to acquire under sections 60L.01 to 60L.15. A derivative transaction that is entered into as a hedging transaction is not considered a replication transaction.\n\"SVO listed mutual fund\" means a money market mutual fund or short-term bond fund that is registered with the United States Securities and Exchange Commission under the Investment Company Act of 1940, and that has been determined by the Securities Valuation Office of the National Association of Insurance Commissioners to be eligible for special reserve and reporting treatment other than as common stock.",
	"repealed": false
}