{
	"id": "514.972",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.972",
	"title": "514.972 LIEN AGAINST PROPERTY.",
	"text": "The owner of a self-service storage facility has a lien against the occupant on the personal property stored under a rental agreement in a storage space at the self-service storage facility, or on the proceeds of the personal property subject to the defaulting occupant's rental agreement in the owner's possession. The lien is for rent, labor, and other charges in relation to the personal property specified in the rental agreement that have become due and for expenses necessary for the preservation of the personal property or expenses reasonably incurred in the sale or other disposition of the personal property under law. The lien provided for in this section is superior to other security interests except those perfected before the date the lien attaches.\nThe owner's lien created by this section attaches as of the date the occupant is in default unless the occupant obtains a court order to recover possession of personal property in the self-service storage facility. No lien is created under subdivision 1 or shall attach under this subdivision to any personal property listed under subdivision 5, unless the occupant fails to remove the personal property before the sale authorized by section 514.973. An owner loses the lien on personal property that the owner permits to be removed from the self-service storage facility or unjustifiably refuses to permit to be removed from the facility.\nNo lien is created under subdivision 1 if the owner has possession of a security deposit sufficient to cover rents and other charges at the time of an alleged default.\nUpon default, the owner shall mail notice of default as provided under section 514.974. The owner may deny the occupant access to the personal property contained in the self-service storage facility after default, service of the notice of default, expiration of the date stated for denial of access, and application of any security deposit to unpaid rent.\n(a) Any occupant may remove from the self-storage facility personal papers and health aids upon demand made to any of the persons listed in section 514.976, subdivision 1.\n(b) An occupant who provides documentation from a government or nonprofit agency or legal aid office that the occupant is a recipient of relief based on need, is eligible for legal aid services, or is a survivor of domestic violence or sexual assault may remove, in addition to the items provided in paragraph (a), personal clothing of the occupant and the occupant's dependents and tools of the trade that are necessary for the livelihood of the occupant that has a market value not to exceed $125 per item.\n(c) The occupant shall present a list of the items and may remove the items during the facility's ordinary business hours prior to the sale authorized by section 514.973. If the owner unjustifiably denies the occupant access for the purpose of removing the items specified in this subdivision, the occupant is entitled to request relief from the court for an order allowing access to the storage space for removal of the specified items. The self-service storage facility is liable to the occupant for the costs, disbursements, and attorney fees expended by the occupant to obtain this order.\n(d) For the purposes of this subdivision, \"relief based on need\" includes but is not limited to receipt of a benefit from the Minnesota family investment program, medical assistance, general assistance, emergency general assistance, Minnesota supplemental aid, Minnesota supplemental aid housing assistance, MinnesotaCare, Supplemental Security Income, energy assistance, emergency assistance, Supplemental Nutrition Assistance Program benefits, earned income tax credit, or Minnesota working family tax credit. Relief based on need can also be proven by providing documentation from a legal aid organization that the individual is receiving legal aid assistance, or by providing documentation from a government agency, nonprofit, or housing assistance program that the individual is receiving assistance due to domestic violence or sexual assault.\n[See Note.]",
	"repealed": false
}