{
	"id": "241.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.09",
	"title": "241.09 UNCLAIMED MONEY OR PERSONAL PROPERTY OF INMATES OF CORRECTIONAL FACILITIES.",
	"text": "When the chief executive officer of any state correctional facility under the jurisdiction of the commissioner of corrections obtains money belonging to inmates of the facility who have died, been released or escaped, and the chief executive officer knows no claimant or person entitled to it, the chief executive officer shall, if the money is unclaimed within six months, deposit it in the inmate social welfare fund for the benefit of the inmates of the facility. No money shall be so deposited until it has remained unclaimed for at least six months. If, at any time after the expiration of the six months, the inmate or the legal heirs appear and make proper proof of identity or heirship, the inmate or heirs are entitled to receive from the commissioner of management and budget any money belonging to the inmate and deposited in the inmate social welfare fund pursuant to this subdivision.\nWhen any inmate of a state correctional facility under the jurisdiction of the commissioner of corrections has died, been released or escaped therefrom leaving in the custody of the chief executive officer thereof personal property, other than money, which remains unclaimed for a period of 90 days, and the chief executive officer knows no person entitled to it, the chief executive officer or the chief executive officer's agent may sell or otherwise dispose of the property in the manner provided by law for the sale or disposition of state property. The proceeds of any sale, after deduction of the costs shall be deposited in the inmate social welfare fund for expenditure as provided in subdivision 1. Any inmate whose property has been sold under this subdivision, or heirs of the inmate, may file with, and make proof of ownership to, the chief executive officer of the institution who caused the sale of the property within two years after the sale, and, upon satisfactory proof to the chief executive officer, the chief executive officer shall certify to the commissioner of management and budget the amount received by the sale of such property for payment to the inmate or heirs. No suit shall be brought for damages consequent to the disposal of personal property or use of money in accordance with this section against the state or any official, employee, or agent thereof.",
	"repealed": false
}