{
	"id": "146A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.06",
	"title": "146A.06 PROFESSIONAL COOPERATION; UNLICENSED PRACTITIONER.",
	"text": "An unlicensed complementary and alternative health care practitioner who is the subject of an investigation, or who is questioned in connection with an investigation, by or on behalf of the office, shall cooperate fully with the investigation. Cooperation includes responding fully and promptly to any question raised by or on behalf of the office relating to the subject of the investigation, whether tape recorded or not; providing copies of client records, as reasonably requested by the office, to assist the office in its investigation; and appearing at conferences or hearings scheduled by the commissioner. If the office does not have a written consent from a client permitting access to the client's records, the unlicensed complementary and alternative health care practitioner shall delete in the record any data that identifies the client before providing it to the office. If an unlicensed complementary and alternative health care practitioner refuses to give testimony or produce any documents, books, records, or correspondence on the basis of the fifth amendment to the Constitution of the United States, the commissioner may compel the unlicensed complementary and alternative health care practitioner to provide the testimony or information; however, the testimony or evidence may not be used against the practitioner in any criminal proceeding. Challenges to requests of the office may be brought before the appropriate agency or court.\n(a) Data relating to investigations of complaints and disciplinary actions involving unlicensed complementary and alternative health care practitioners are governed by this subdivision and section 13.41 does not apply. Except as provided in section 13.39, subdivision 2, and paragraph (b), data relating to investigations of complaints and disciplinary actions involving unlicensed complementary and alternative health care practitioners are public data, regardless of the outcome of any investigation, action, or proceeding.\n(b) The following data are private data on individuals, as defined in section 13.02:\n(1) data on a complementary and alternative health care client;\n(2) data on a complainant under section 146A.03; and\n(3) data on the nature or content of unsubstantiated complaints when the information is not maintained in anticipation of legal action.\n(a) The office shall establish internal operating procedures for:\n(1) exchanging information with state boards; agencies, including the Office of Ombudsman for Mental Health and Developmental Disabilities; health-related and law enforcement facilities; departments responsible for licensing health-related occupations, facilities, and programs; and law enforcement personnel in this and other states; and\n(2) coordinating investigations involving matters within the jurisdiction of more than one regulatory agency.\n(b) The procedures for exchanging information must provide for the forwarding to the entities described in paragraph (a), clause (1), of information and evidence, including the results of investigations, that are relevant to matters within the regulatory jurisdiction of the organizations in paragraph (a). The data have the same classification in the hands of the agency receiving the data as they have in the hands of the agency providing the data.\n(c) The office shall establish procedures for exchanging information with other states regarding disciplinary action against unlicensed complementary and alternative health care practitioners.\n(d) The office shall forward to another governmental agency any complaints received by the office that do not relate to the office's jurisdiction but that relate to matters within the jurisdiction of the other governmental agency. The agency to which a complaint is forwarded shall advise the office of the disposition of the complaint. A complaint or other information received by another governmental agency relating to a statute or rule that the office is empowered to enforce must be forwarded to the office to be processed in accordance with this section.\n(e) The office shall furnish to a person who made a complaint a description of the actions of the office relating to the complaint.",
	"repealed": false
}