{
	"id": "308B.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.005",
	"title": "308B.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Address\" means mailing address, including a zip code. In the case of a registered address, the term means the mailing address and the actual office location, which may not be a post office box.\n\"Alternative ballot\" means a method of voting on a candidate or issue prescribed by the board of directors in advance of the vote, and may include voting by electronic, telephonic, Internet, or other means that reasonably allow members the opportunity to vote.\n\"Articles\" means the articles of organization of a cooperative as originally filed and subsequently amended.\n\"Association\" means an organization conducting business on a cooperative plan under the laws of this state or another state that is chartered to conduct business under other laws of this state or another state.\n\"Board\" means the board of directors of a cooperative.\n\"Business entity\" means a company, limited liability company, limited liability partnership, or other legal entity, whether domestic or foreign, association, or body vested with the power or function of a legal entity.\n\"Chapter\" means sections 308B.001 to 308B.975.\n\"Cooperative\" means an association organized under this chapter conducting business on a cooperative plan as provided under this chapter.\n\"Domestic business entity\" means a business entity organized under the laws of this state.\n\"Domestic cooperative\" means a cooperative organized under this chapter or chapter 308A.\n\"Filed with the secretary of state\" means that a document meeting the applicable requirements of this chapter, signed and accompanied by the required filing fee, has been delivered to the secretary of state. The secretary of state shall endorse on the document the word \"filed\" or a similar word determined by the secretary of state and the month, day, and year of filing, record the document in the Office of the Secretary of State, and return a document to the person or entity who delivered it for filing.\n\"Foreign business entity\" means a business entity that is not a domestic business entity.\n\"Foreign cooperative\" means a foreign business entity organized to conduct business on a cooperative plan consistent with this chapter or chapter 308A.\n\"Member\" means a person or entity reflected on the books of the cooperative as the owner of governance rights of a membership interest of the cooperative and includes patron and nonpatron members.\n\"Membership interest\" means a member's interest in a cooperative consisting of a member's financial rights, a member's right to assign financial rights, a member's governance rights, and a member's right to assign governance rights. Membership interest includes patron membership interests and nonpatron membership interests.\n\"Members' meeting\" means a regular or special members' meeting.\n\"Minnesota limited liability company\" means a limited liability company governed by chapter 322C.\n\"Nonpatron membership interest\" means a membership interest that does not require the holder to conduct patronage business for or with the cooperative to receive financial rights or distributions.\n\"Patron\" means a person or entity who conducts patronage business with the cooperative.\n\"Patronage\" means business, transactions, or services done for or with the cooperative as defined by the cooperative.\n\"Patron member\" means a member holding a patron membership interest.\n\"Patron membership interest\" means the membership interest requiring the holder to conduct patronage business for or with the cooperative, as specified by the cooperative to receive financial rights or distributions.\n\"Signed\" means that the signature of a person has been written on a document, and with respect to a document required by this chapter to be filed with the secretary of state, means that the document has been signed by a person authorized to do so by this chapter, the articles or bylaws, or by a resolution approved by the directors or the members. A signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.",
	"repealed": false
}