{
	"id": "62Q.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.185",
	"title": "62Q.185 GUARANTEED RENEWABILITY; LARGE EMPLOYER GROUP.",
	"text": "(a) No health plan company, as defined in section 62Q.01, subdivision 4, shall refuse to renew a health benefit plan, as defined in section 62L.02, subdivision 15, but issued to a large employer, as defined in section 62Q.18, subdivision 1.\n(b) This section does not require renewal if:\n(1) the large employer has failed to pay premiums or contributions as required under the terms of the health benefit plan, or the health plan company has not received timely premium payments unless the late payments were received within a grace period provided under state law;\n(2) the large employer has performed an act or practice that constitutes fraud or misrepresentation of material fact under the terms of the health benefit plan;\n(3) the large employer has failed to comply with a material plan provision relating to employer contribution or group participation rules not prohibited by state law;\n(4) the health plan company is ceasing to offer coverage in the large employer market in this state in compliance with United States Code, title 42, section 300gg-12(c), and applicable state law;\n(5) in the case of a health maintenance organization, there is no longer any enrollee in the large employer's health benefit plan who lives, resides, or works in the approved service area; or\n(6) in the case of a health benefit plan made available to large employers only through one or more bona fide associations, the membership of the large employer in the association ceases, but only if such coverage is terminated uniformly without regard to any health-related factor relating to any covered individual.\n(c) This section does not prohibit a health plan company from modifying the premium rate or from modifying the coverage for purposes of renewal.\n(d) This section does not require renewal of the coverage of individual enrollees under the health benefit plan if the individual enrollee has performed an act or practice that constitutes fraud or misrepresentation of material fact under the terms of the health benefit plan.",
	"repealed": false
}