{
	"id": "211C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/211C.05",
	"title": "211C.05 SUPREME COURT REVIEW OF PROPOSED PETITION.",
	"text": "Upon receiving a proposed petition from the secretary of state, the clerk of the appellate courts shall submit it immediately to the chief justice of the supreme court, or, if the chief justice is the subject of the proposed petition, to the most senior associate justice of the supreme court. The persons proposing the petition shall provide to the reviewing judge any materials supporting the petition. The officer who is named in the proposed petition may submit materials in opposition. The justice, or a designee if the justice has a conflict of interest or is unable to conduct the review in a timely manner, shall review the proposed petition to determine whether it alleges specific facts that, if proven, would constitute grounds for recall of the officer under the Minnesota Constitution, article VIII, section 6, and section 211C.02. If it does not, the justice shall immediately issue an order dismissing the petition and indicating the reason for dismissal. If the proposed petition does allege specific facts that, if proven, would constitute grounds for recall, the justice shall assign the case to a special master for a public hearing. The special master must be an active or retired judge. The justice shall complete the review under this section and dismiss the proposed petition or assign the case for hearing within ten days.\nA public hearing on the allegations of a proposed petition must be held within 21 days after issuance of the order of the justice assigning the case to a special master. The special master shall report to the court within seven days after the end of the public hearing. In the report, the special master shall determine:\n(1) whether the persons proposing the petition have shown by a preponderance of the evidence that the factual allegations supporting the petition are true; and\n(2) if so, whether the persons proposing the petition have shown that the facts found to be true are sufficient grounds for issuing a recall petition.\nIf the special master determines that these standards have been met, the report must include a statement of the specific facts and grounds for the recall petition.\nThe supreme court shall review the report of the special master and make a decision on the petition within 20 days. If the court decides that the standard expressed in subdivision 2 has not been met, the court shall dismiss the petition. If the court decides that the standard for decision expressed in subdivision 2 has been met, the court shall prescribe, by order to the secretary of state, the statement of the specific facts and grounds that must appear on the petition for recall issued under section 211C.06. If the court dismisses a petition under this section because the persons proposing the petition have acted in bad faith in violation of section 211C.09, the court may assess the persons proposing the petition for reasonable costs of conducting the proceeding.",
	"repealed": false
}