{
	"id": "62E.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.24",
	"title": "62E.24 ACCOUNTING, REPORTS, AND AUDITS OF THE ASSOCIATION.",
	"text": "The board must keep an accounting for each benefit year of all:\n(1) funds appropriated for reinsurance payments and administrative and operational expenses;\n(2) requests for reinsurance payments received from eligible health carriers;\n(3) reinsurance payments made to eligible health carriers; and\n(4) administrative and operational expenses incurred for the plan.\n(a) The board must submit to the commissioner and to the chairs and ranking minority members of the legislative committees with jurisdiction over commerce and health and make available to the public quarterly reports on plan operations and an annual report summarizing the plan operations for each benefit year. All reports must be made public by posting the report on the Minnesota Comprehensive Health Association website. The annual summary must be made available by November 1 of the year following the applicable benefit year or 60 calendar days following the final disbursement of reinsurance payments for the applicable benefit year, whichever is later.\n(b) The reports must include information about:\n(1) the reinsurance parameters used;\n(2) the metal levels affected;\n(3) the number of claims payments estimated and submitted for payment per products offered on-exchange and off-exchange and per eligible health carrier;\n(4) the estimated reinsurance payments by plan type based on carrier-submitted templates;\n(5) funds appropriated for reinsurance payments and administrative and operational expenses for each year, including the federal and state contributions received, investment income, and any other revenue or funds received;\n(6) the total amount of reinsurance payments made to each eligible health carrier; and\n(7) administrative and operational expenses incurred for the plan, including the total amount incurred and as a percentage of the plan's operational budget.\nThe Minnesota premium security plan is subject to audit by the legislative auditor. The board must ensure that its contractors, subcontractors, or agents cooperate with the audit.\n(a) The board must engage and cooperate with an independent certified public accountant or CPA firm licensed or permitted under chapter 326A to perform an audit for each benefit year of the plan, in accordance with generally accepted auditing standards. The audit must at a minimum:\n(1) assess compliance with the requirements of sections 62E.21 to 62E.25; and\n(2) identify any material weaknesses or significant deficiencies and address manners in which to correct any such material weaknesses or deficiencies.\n(b) The board, after receiving the completed audit, must:\n(1) provide the commissioner the results of the audit;\n(2) identify to the commissioner any material weakness or significant deficiency identified in the audit and address in writing to the commissioner how the board intends to correct any such material weakness or significant deficiency in compliance with subdivision 5; and\n(3) make public the results of the audit, to the extent the audit contains government data that is public, including any material weakness or significant deficiency and how the board intends to correct the material weakness or significant deficiency, by posting the audit results on the Minnesota Comprehensive Health Association website and making the audit results otherwise available.\n(a) If an audit results in a finding of material weakness or significant deficiency with respect to compliance by the association with any requirement under sections 62E.21 to 62E.25, the board must:\n(1) provide a written corrective action plan to the commissioner for approval within 60 days of the completed audit;\n(2) implement the corrective action plan; and\n(3) provide the commissioner with written documentation of the corrective actions taken.\n(b) By December 1 of each year, the board must submit a report to the standing committees of the legislature having jurisdiction over health and human services and insurance regarding any finding of material weakness or significant deficiency found in an audit.",
	"repealed": false
}