{
	"id": "66A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.41",
	"title": "66A.41 MUTUAL COMPANY CONVERSION TO STOCK COMPANY.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Converting mutual insurer\" means a Minnesota domestic mutual insurance company seeking to reorganize according to this section.\n(c) \"Converting mutual holding company\" means a Minnesota domestic mutual insurance holding company seeking to reorganize according to this section.\n(d) \"Converting mutual company\" means a converting mutual insurer or a converting mutual holding company seeking to convert according to this section.\n(e) \"Reorganized company\" means a converting mutual insurer or a converting mutual holding company, as the case may be, that has reorganized according to this section.\n(f) \"Eligible member\" means:\n(1) for converting mutual insurers, a policyholder whose policy is in force as of the record date. Unless otherwise provided in the plan, a person covered under a group policy is not an eligible member, except that a person insured under a group life insurance policy is an eligible member if, on the record date:\n(i) the person is insured under a group life policy under which cash value has accumulated and some cash value is allocated to the insured person; and\n(ii) the group policyholder makes no contribution to the premiums for the group policy; and\n(2) for converting mutual holding companies, a person who is a member of the converting mutual holding company, as defined by the converting mutual holding company's articles of incorporation and bylaws, determined as of the record date.\n(g) \"Plan of conversion\" or \"plan\" means a plan adopted by a converting mutual company's board of directors under this section.\n(h) \"Policy\" means a policy or contract of insurance, including an annuity contract, issued by a converting mutual insurer or issued by a reorganized insurance company subsidiary of a mutual holding company, but excluding individual noncontributory insurance policies for which the premiums are paid by a financial institution, association, employer, or other institutional entity.\n(i) \"Active participating policy\" means an individual policy of a converting mutual company or its subsidiary that: (1) is a participating policy; (2) is among a class of similar policies that have been credited with policy dividends at any time within the 12 months preceding the effective date of the conversion or that will, under the then current dividend scale, be credited with policy dividends if in force on a future policy anniversary; (3) gives rise to membership interests in the converting mutual company; and (4) is in force on the effective date or some other reasonable date identified in the plan.\n(j) \"Commissioner\" means the commissioner of commerce.\n(k) \"Effective date of a conversion\" means the date determined according to subdivision 6.\n(l) \"Record date\" means the date that the converting mutual company's board of directors adopts a plan of conversion, unless another date is specified in the plan of conversion and approved by the commissioner.\n(m) \"Membership interests\" means all rights as members of the converting mutual company, including, but not limited to, the rights to vote and to participate in any distributions of distributable net worth, whether or not incident to the company's liquidation.\n(n) \"Distributable net worth\" means the value of the converting mutual company as of the record date of the conversion, or other date approved by the commissioner, determined as set forth in the plan and approved by the commissioner. The commissioner may approve a valuation method based on any of the following: (1) the surplus as regards policyholders of a converting mutual insurer determined according to statutory accounting principles, which may be adjusted to reflect the current market values of assets and liabilities, together with any other adjustments that are appropriate in the circumstances; (2) the net equity of a converting mutual holding company or a converting mutual insurer determined according to generally accepted accounting principles, which may be adjusted to reflect the current market values of assets and liabilities, together with any other adjustments that are appropriate in the circumstances; (3) the fair market value of the converting mutual company determined by an independent, qualified person; or (4) any other reasonable valuation method.\n(o) \"Permitted issuer\" means: (1) a corporation organized and owned by the converting mutual company or by any other insurance company or insurance holding company for the purpose of purchasing and holding securities representing a majority of voting control of the reorganized company; (2) a stock insurance company owned by the converting mutual company or by any other insurance company or insurance holding company into which the converting mutual company will be merged; or (3) any other corporation approved by the commissioner.\nIn accordance with a plan of conversion established and approved in the manner provided by this section: (1) a mutual insurance company may become a stock insurance company; and (2) a mutual insurance holding company may: (i) become a corporation organized under chapter 302A; (ii) reorganize according to a plan in which a majority or all of the common stock of the reorganized company is acquired by another institution, which may include a subsidiary of the converting mutual holding company; (iii) reorganize as a part of a liquidation or dissolution of the converting mutual holding company; or (iv) undertake any other reorganization or combination of the foregoing approved by the commissioner.\n(a) A converting mutual company shall, by the affirmative vote of a majority of its board of directors, adopt a plan of conversion consistent with the requirements of this section.\n(b) The converting mutual company, by the affirmative vote of a majority of its board of directors, may amend the plan at any time before approval of the plan by the commissioner and may withdraw the plan at any time before the effective date of the plan.\n(c) The duties of the board of directors of a converting mutual company, in considering or acting upon a proposed plan of conversion or related transaction, shall be as set forth in section 302A.251 and, to the extent not inconsistent with that section, the converting mutual company's articles of incorporation and bylaws.\n(a) Documents to be filed. The converting mutual company shall file with the commissioner an application for approval of, and permission to reorganize according to, the plan of conversion. The application must include the following:\n(1) the plan of conversion;\n(2) the form of notice of meeting for eligible members to vote on the plan;\n(3) the form of any proxies to be solicited from eligible members;\n(4) the proposed articles of incorporation and bylaws of the converted stock company;\n(5) information required under chapter 60D if the plan results in a change of control of the converting mutual company;\n(6) a basis for determining the converting mutual company's distributable net worth for use in the plan of conversion;\n(7) if required by the commissioner, an independent evaluation of the estimated distributable net worth and of the estimated value of any shares to be issued;\n(8) if required by the commissioner, an independent actuarial opinion on matters affecting the structure or fairness of the plan; and\n(9) other information or documentation requested by the commissioner or required by rule.\n(b) Determination of completeness. The commissioner shall determine, within 30 days of submission of the application, whether the application is complete.\n(c) Consultants. The commissioner may retain, at the converting mutual company's expense, qualified experts not otherwise a part of the commissioner's staff to assist in reviewing the plan and supplemental materials and valuations.\n(d) Hearing. The commissioner may, but need not, conduct a public hearing regarding the proposed plan of conversion. If a hearing is to be held, the commissioner shall designate a date for the public hearing promptly upon determining that the application is complete and that the forms of notice are adequate. The public hearing must be held on one or more days, the first beginning within 90 days after the date on which the commissioner determines the application is complete, unless the converting mutual company requests, and the commissioner agrees to, a longer period for the purpose of preparing and distributing the notices required by this paragraph and by subdivision 5, paragraph (b). The hearing must be in the nature of a legislative hearing and must not constitute or be considered a contested case under chapter 14. The hearing may be conducted by the commissioner or by a person designated by the commissioner, which designee may be an administrative law judge. The converting mutual company shall provide its eligible members with at least 45 days' notice of the hearing, the notice to be in the form, and provided in a manner, approved by the commissioner. The purpose of the hearing is to receive comments and information for the purpose of aiding the commissioner in making a decision on the plan of conversion. Persons wishing to make comments and submit information may submit written statements before the public hearing and may appear and be heard at the hearing. The commissioner's order or determination must be issued within 45 days after the closing of the record of the hearing by the commissioner or the hearing officer, as applicable, which record must not be closed until the record includes certification of the vote on the plan of reorganization by the eligible members by the converting mutual company. The commissioner shall issue a written decision detailing the reasons why the converting mutual company's plan of conversion is approved or disapproved.\n(e) The commissioner shall approve the application and permit the reorganization according to the plan of conversion if the commissioner finds that: (1) the provisions of this section have been fully met; and (2) the plan is not unfair or inequitable to the members of the converting mutual company. The commissioner's order approving or disapproving a plan of conversion is a final agency decision subject to appeal according to sections 14.63 to 14.68.\n(a) Notice. Within 90 days following the date of the public hearing, if any, or the date the commissioner determines the application is complete if no hearing is held, the converting mutual company shall give all eligible members notice of a regular or special meeting of the members called for the purpose of considering the plan and any corporate actions that are a part of, or are reasonably attendant to, the accomplishment of the plan.\n(b) Notice requirements. A copy of the plan or a summary of the plan must accompany the notice. The notice must be mailed to each eligible member's last known address, as shown on the converting mutual company's records, not less than 45 days before the date of the meeting, unless the commissioner directs a later date for mailing. If the meeting to vote upon the plan is held coincident with the converting mutual company's annual meeting of members, only one combined notice of meeting is required. The notice of the meeting of eligible members may be combined with the notice of hearing described in subdivision 4, paragraph (d).\n(c) Failure to give notice. If the converting mutual company complies substantially and in good faith with the notice requirements of this section, the converting mutual company's failure to give any member or members any required notice does not impair the validity of any action taken under this section.\n(d) Voting. (1) The plan must be adopted upon receiving the affirmative vote of a majority of the votes cast by eligible members.\n(2) Eligible members may vote in person or by proxy. The form of any proxy must be filed with and approved by the commissioner.\n(3) The number of votes each eligible member may cast shall be determined by the converting mutual company's bylaws. If the bylaws are silent, or if the commissioner determines that the voting requirements under the bylaws would be unfair or would prejudice the rights of the eligible members, each eligible member may cast one vote.\nFollowing approval by the eligible members, the converting mutual company shall file a copy of the company's amended or restated articles of incorporation with the commissioner, together with a certified copy of the minutes of the meeting at which the plan was adopted and a certified copy of the plan. The commissioner shall review and, if appropriate, approve the amended or restated articles. After approval by the commissioner, a converting mutual company shall file the articles with the secretary of state as provided by section 60A.07, subdivision 1d, and chapter 302A.\nA plan of conversion shall not be unfair or inequitable to members. A plan of conversion is not unfair or inequitable if it satisfies the conditions of subdivision 8 or 9. The commissioner may determine that a plan proposed under subdivision 10 or that any other plan proposed under subdivision 12 is not unfair or inequitable to members.\nA plan of conversion under this subdivision shall provide for exchange of membership interests in return for shares in the reorganized company or a permitted issuer, according to paragraphs (a) to (c), and shall provide for the reasonable dividend expectations of policyholders of active participating policies as set forth in subdivision 16a.\n(a) The membership interests of the eligible members shall be exchanged, for all of the common shares of the reorganized company or a permitted issuer, or for a combination of the common shares of the reorganized company or a permitted issuer, or for a combination of: (1) common shares of the reorganized company or a permitted issuer; and (2) consideration equal to the proceeds of the public sale in the market of the common shares by the issuer or by a trust established according to subdivision 11. The consideration must be allocated among the eligible members in a manner that takes into account the estimated proportionate contribution of each class of eligible members to the aggregate consideration being given.\n(b) Unless the anticipated issuance within a shorter period is disclosed in the plan of conversion, the issuer of common shares shall not, within two years after the effective date of reorganization, issue either of the following:\n(1) any of its common shares or any securities convertible with or without consideration into the common shares or carrying any warrant to subscribe to or purchase common shares; and\n(2) any warrant, right, or option to subscribe to or purchase the common shares or other securities described in paragraph (a), except for the issue of common shares to or for the benefit of eligible members according to the plan of conversion and the issue of nontransferable subscription rights for the purchase of common shares being granted to officers, directors, or a tax qualified employee benefit plan of the reorganized company or its parent company, if any, or a permitted issuer, according to subdivision 11.\n(c) Unless the common shares have a public market when issued, the issuer shall use its best efforts to encourage and assist in the establishment of a public market for the common shares within two years of the effective date of the conversion or a longer period as disclosed in the plan of conversion. Within one year after any offering of stock other than the initial distribution, but no later than six years after the effective date of the conversion, the reorganized company shall offer to make available to eligible members who received and retained shares of common stock or securities described in paragraph (b), clause (1), a procedure to dispose of those shares of stock at market value without brokerage commissions or similar fees.\nA plan of conversion under this subdivision shall provide for the exchange of the membership interests of the eligible members in return for a distribution of the converting mutual company's distributable net worth and shall provide for the issuance of new shares of the reorganized company or a permitted issuer, and shall provide for the reasonable expectations of policyholders of active participating policies as set forth in subdivision 16a.\n(a) Distributions by the converting mutual company under this subdivision shall be distributed to eligible members in a form or forms selected by the converting mutual company. The form of distribution may consist of cash, securities of the reorganized company, securities of another institution, a certificate of contribution, additional life insurance, annuity benefits, increased dividends, reduced premiums, or other equitable consideration or any combination of forms of consideration. The consideration, if any, given to a class or category of eligible members may differ from the consideration given to another class or category of eligible members. A certificate of contribution must be repayable in ten years, be equal to 100 percent of the value of the eligible members' membership interest, and bear interest at the highest rate charged by the reorganized company or its insurance company subsidiary for policy loans on the effective date of the conversion.\n(b) The consideration must be allocated among the eligible members in a manner that is fair and equitable and that takes into account the estimated proportionate contribution of each class of eligible members to the aggregate consideration being given.\n(c) The reorganized company or its parent corporation shall issue and sell shares of one or more classes having a total price equal to the estimated value in the market of the shares on the initial offering date. The estimated value must take into account all of the following:\n(1) the pro forma fair market value of the reorganized company;\n(2) the consideration to be given to policyholders according to paragraph (a);\n(3) the proceeds of the sale of the shares; and\n(4) any additional value attributable to the shares as a result of a purchaser or a group of purchasers who acted in concert to obtain shares in the initial offering, attaining, through such purchase, control of the reorganized company or its parent corporation.\n(d) If a purchaser or a group of purchasers acting in concert is to attain control in the initial offering, the converting mutual company shall not, directly or indirectly, pay for any of the costs or expenses of conversion of the converting mutual company, whether or not the conversion is effected, except with permission of the commissioner.\nA plan of conversion under this subdivision shall provide for exchange of the eligible members' membership interests in return for the protection of the reasonable dividend expectations of the policyholders of active participating policies, for the creation of a liquidation account to protect the interests of eligible members, for the issuance of subscription rights to eligible members, and shall provide for the issuance of shares by the reorganized company, each according to paragraphs (a) to (j).\n(a) The plan of conversion shall provide for the protection of the reasonable dividend expectations of policyholders of active participating policies as provided in subdivision 16a.\n(b) The reorganized company or its parent corporation or a permitted issuer shall issue and sell shares of one or more classes having a total price equal to the estimated value of the shares in the market on the initial offering date taking into account the proceeds of the sale of shares and the consideration given to eligible members.\n(c) The eligible members shall receive nontransferable preemptive subscription rights to purchase all of the common shares of the issuer according to paragraph (b).\n(d) The preemptive subscription rights to purchase the common shares must be allocated among the eligible members in whole shares in a fair and equitable manner and as provided in the plan, taking into account the estimated proportionate contribution of each class of eligible members to the total amount of the eligible members' consideration. The plan must provide a fair and equitable means for the allocation of shares in the event of an oversubscription. The plan must further provide that any shares of capital stock not subscribed by eligible members may be sold in a public offering through an underwriter, unless the number of shares unsubscribed is so small in number so as not to warrant the expense of a public offering, in which case the plan may provide for the purchase of the unsubscribed shares by private placement or through any fair and equitable alternative means approved by the commissioner.\n(e) The number of the common shares that a person, together with any affiliates or group of persons acting in concert, may subscribe or purchase in the reorganization, must be limited to not more than five percent of the common shares. For this purpose, neither the members of the board of directors of the reorganized company nor its parent corporation, if any, are considered to be affiliates or a group of persons acting in concert solely by reason of their board membership.\n(f) Unless the common shares have a public market when issued, officers and directors of the issuer and their affiliates shall not, for at least three years after the date of conversion, purchase common shares of the issuer, except with the approval of the commissioner.\n(g) Unless the common shares have a public market when issued, the issuer shall use its best efforts to encourage and assist in the establishment of a public market for the common shares.\n(h) The issuer shall not, for at least three years following the conversion, repurchase any of its common shares except according to a pro rata tender offer to all shareholders, or with the approval of the commissioner.\n(i) A liquidation account must be established for the benefit of eligible members in the event of a complete liquidation of the reorganized company. The liquidation account must be equal to the distributable net worth of the converting mutual company as of the effective date of the conversion. The function of the liquidation account is solely to establish a priority on liquidation and its existence does not restrict the use or application of the distributable net worth of the reorganized company except as specified in paragraph (j). The liquidation account must be allocated equitably as of the effective date of conversion among the then eligible members. The amount allocated to an eligible member must not increase and must be reduced to zero when the policy or contract giving rise to the membership interests of the owner terminates. In the event of a complete liquidation of the reorganized company, the eligible members among which the liquidation account is allocated are entitled to receive a liquidation distribution in the amount of the liquidation account before any liquidation distribution is made with respect to shares.\n(j) Until the liquidation account has been reduced to zero, the reorganized company shall not declare or pay a cash dividend on, or repurchase any of, its common shares (i) in case of a converting mutual insurer, in an amount in excess of its cumulative earned surplus generated after the conversion determined according to statutory accounting principles, or (ii) in the case of a converting mutual holding company, in an amount in excess of its retained earnings, if the effect would be to cause the amount of the distributable net worth of the reorganized company to be reduced below the then amount of the liquidation account.\nA plan under subdivision 8, 9, or 10 may include, with the approval of the commissioner, any of the provisions in paragraphs (a) and (b).\n(a) A plan may provide that any shares of the stock of the reorganized company or its parent corporation or a permitted issuer included in the eligible members' consideration must be placed on the effective date of the conversion in a trust or other entity existing for the exclusive benefit of the eligible members and established solely for the purposes of effecting the reorganization. Under this option, the shares placed in trust must be sold over a period of not more than 40 years and the proceeds of the shares must be distributed using the distribution priorities prescribed in the plan. Eligible members shall have the option to sell their shares at any time following the date specified in the plan, which date may not be later than two years following the effective date of the plan.\n(b) A plan may provide that the directors and officers of the converting mutual company may receive warrants, options, or nontransferable subscription rights to purchase capital stock of the reorganized company or its parent or a permitted issuer.\n(c) A plan may provide that only eligible members whose policies were in force as of a specified date are eligible to receive compensation under the plan, which date must be no earlier than one year before the effective date of the plan.\nIn lieu of selecting a plan of conversion provided for in subdivision 8, 9, or 10, the converting mutual company may convert according to a plan approved by the commissioner if the commissioner finds that the plan does not prejudice the interests of the eligible members, is fair and equitable, and is based upon the fair market value of the converting mutual company, and is a fair and equitable allocation of any consideration to be given eligible members. The commissioner may retain, at the converting mutual company's expense, any qualified expert not otherwise a part of the commissioner's staff to assist in reviewing the fair market value of the company and in determining whether the alternative plan may be approved.\n(a) Upon the conversion of a converting mutual company to a reorganized company according to this section, the corporate existence of the converting mutual company is continued in the reorganized company. All the rights, franchises, and interests of the converting mutual company in and to all property and things in action belonging to this property, is considered transferred to and vested in the reorganized company without any deed or transfer. Simultaneously, the reorganized company is considered to have assumed all the obligations and liabilities of the converting mutual company.\n(b) The directors and officers of the converting mutual company, unless otherwise specified in the plan of conversion, shall serve as directors and officers of the reorganized company until new directors and officers of the reorganized company are duly elected according to the articles of incorporation and bylaws of the reorganized company.\n(c) All policies in force on the effective date of the conversion continue to remain in force under the terms of those policies, except that any voting rights of the members provided for under the policies are extinguished on the effective date of the conversion.\n(d) All membership interests in the converting mutual company are extinguished on the effective date of a conversion.\nNo director, officer, agent, employee of the converting mutual company, or any other person shall receive a fee, commission, or other valuable consideration, other than the person's usual regular salary and compensation, for in any manner aiding, promoting, or assisting in the conversion except as set forth in the plan approved by the commissioner. This provision does not prohibit the payment of reasonable fees and compensation to attorneys, accountants, investment bankers, and actuaries for services performed in the independent practice of their professions.\nAll the costs and expenses connected with a plan of conversion must be paid for or reimbursed by the converting mutual company or the reorganized company except where the plan provides otherwise.\n(a) An action challenging the validity of or arising out of acts taken or proposed to be taken according to this section must be commenced within 180 days after the effective date of the conversion.\n(b) The converting mutual company, the reorganized company, or any defendant in an action described in paragraph (a), may petition the court in the action to order a party to give security for the reasonable attorney fees that may be incurred by a party to the action. The amount of security may be increased or decreased in the discretion of the court having jurisdiction if a showing is made that the security provided is or may become inadequate or excessive.\n(a) To the extent required by this section, the plan of reorganization of a converting mutual insurer that is a mutual life insurance company or of a converting mutual holding company that has a life insurance company subsidiary shall make adequate provision for the protection of the reasonable dividend expectations of the policyholders of active participating policies, either through the establishment of a closed block or other method acceptable by the commissioner.\n(b) A closed block must be operated as follows:\n(1) The converting mutual company's active participating policies may be operated by the reorganized company as a closed block of participating business.\n(2) Assets must be allocated to the closed block of participating business in an amount that ensures that the assets, together with the anticipated revenue from the closed block, are reasonably expected to be sufficient to permit the closed block to pay all policy benefits, including dividends according to the current dividend scale, and other items as appropriate. The plan must be accompanied by an opinion of an independent qualified actuary who meets the standards set forth in the insurance laws or rules for the submission of actuarial opinions as to the adequacy of reserves or assets. The opinion must relate to the adequacy of the assets allocated to support the closed block of business. The actuarial opinion must be based on methods of analysis considered appropriate for those purposes by the actuarial standards board.\n(3) The reorganized company shall keep a separate accounting for the closed block and shall make and include in the annual statement to be filed with the commissioner each year a separate statement showing the gains, losses, and expenses properly attributable to the closed block.\n(4) The closed block must be reviewed periodically by an independent, qualified actuary for compliance with the requirements of the plan and this subdivision and a copy of the report must be provided to the commissioner and the reorganized company.\n(5) Notwithstanding the establishment of a closed block, the entire assets of the company that issued the policies must be available for the payment of benefits to policyholders. Payment must first be made from the assets supporting the closed block until exhausted, and then from the general assets of the company which issued the policies.\nThe commissioner may waive or alter any of the requirements of this section to protect the interests of policyholders or members if the converting mutual company is subject to the commissioner's administrative supervision under chapter 60G or rehabilitation under chapter 60B.\nPrior to and for a period of three years following the date when the distribution of consideration to the eligible members in exchange for their membership interests is completed under a plan of conversion according to this section, no person other than the reorganized company shall directly or indirectly acquire or offer to acquire in any manner ownership or beneficial ownership of ten percent or more of any class of voting security of the reorganized company, or of any affiliate of the reorganized company which controls, directly or indirectly, a majority of the voting power of the reorganized company, without the prior approval of the commissioner. For the purposes of this subdivision, the terms \"affiliate\" and \"person\" have the meanings given in section 60D.15, and the term \"reorganized company\" includes any successor of the reorganized company.",
	"repealed": false
}