{
	"id": "135A.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.121",
	"title": "135A.121 AMERICAN INDIAN SCHOLARS.",
	"text": "The American Indian Scholars program is established to provide a first-dollar tuition and fee free pathway for eligible Minnesota American Indian students to complete an undergraduate education.\nTo be eligible each year for the program a student must:\n(1) be enrolled in an undergraduate certificate, diploma, or degree program at the University of Minnesota or a Minnesota state college or university;\n(2) be either (i) a Minnesota resident for resident tuition purposes who is an enrolled member or citizen of a federally recognized American Indian Tribe or Canadian First Nation, or (ii) an enrolled member or citizen of a Minnesota Tribal Nation, regardless of resident tuition status;\n(3) have not (i) obtained a baccalaureate degree, or (ii) been enrolled for 12 semesters or the equivalent, excluding courses taken that qualify as developmental education or below college-level; and\n(4) meet satisfactory academic progress as defined under section 136A.101, subdivision 10.\nMinnesota State Colleges and Universities must and the University of Minnesota is requested to provide a full tuition and fee waiver to a student eligible under subdivision 2. Funds appropriated with reference to this section may be used to offset the institutional costs of the waivers; fund existing waivers, scholarships, or grant programs for students eligible under subdivision 2; provide student supports for eligible students; and administer these programs.\n(a) Each institution receiving funds under this section must annually report to the commissioner of the Office of Higher Education the following:\n(1) how the systems or institutions have administered, distributed, and awarded the funds;\n(2) enrollment and graduation data for all eligible students, including applicants and recipients of funds; and\n(3) the aggregate awarded financial aid information for all recipients of funds under this program.\n(b) Using the data submitted to the office by institutions pursuant to paragraph (a), as well as other data available to the office, the office shall provide the following on its website by placing a prominent link on its website home page:\n(1) information made available in a searchable database, including but not limited to persistence and completion, debt of graduates, employment and wage information, and other relevant data for each institution subject to paragraph (a); and\n(2) other information and links that are useful to students and parents who are in the process of selecting a college or university.",
	"repealed": false
}