{
	"id": "327.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.15",
	"title": "327.15 LICENSE REQUIRED; RENEWAL; FEES.",
	"text": "No person, firm or corporation shall establish, maintain, conduct or operate a manufactured home park or recreational camping area within this state without first obtaining an annual license from the state Department of Health. Any person wishing to obtain a license shall submit an application, pay the required fee specified in this section, and receive approval for operation, including plan review approval. Application shall be made on forms provided by the commissioner and shall require the applicant to state the full name and address of the owner of the manufactured home park or recreational camping area, the name under which the business is to be conducted, and any other information as may be required by the commissioner to complete the application for license. Any person, firm, or corporation desiring to operate either a manufactured home park or a recreational camping area on the same site in connection with the other, need only obtain one license. The license shall state the number of manufactured home sites and recreational camping sites allowed according to state commissioner of health approval. The number of licensed sites shall not be increased unless the plans for expansion are submitted and the expansion is approved by the Department of Health. The license shall be conspicuously displayed in the office of the manufactured home park or camping area. The license is not transferable to another person or place.\nInitial and renewal licenses for all manufactured home parks and recreational camping areas shall be issued annually and shall have an expiration date included on the license. Any person who operates a manufactured home park or recreational camping area after the expiration date of a license or without having submitted an application and paid the fee shall be deemed to have violated the provisions of this chapter and shall be subject to enforcement action, as provided in the Health Enforcement Consolidation Act, sections 144.989 to 144.993. In addition, a penalty of $120 shall be added to the total of the license fee for any manufactured home park or recreational camping area operating without a license for a period of up to 30 days. A late fee of $360 shall be added to the license fee for any manufactured home park or recreational camping area operating more than 30 days without a license.\n(a) The following fees are required for manufactured home parks and recreational camping areas licensed under this chapter. Fees collected under this section shall be deposited in the state government special revenue fund. Recreational camping areas and manufactured home parks shall pay the highest applicable base fee under paragraph (b). The license fee for new operators of a manufactured home park or recreational camping area previously licensed under this chapter for the same calendar year is one-half of the appropriate annual license fee, plus any penalty that may be required. The license fee for operators opening on or after October 1 is one-half of the appropriate annual license fee, plus any penalty that may be required.\n(b) All manufactured home parks and recreational camping areas shall pay the following annual base fee:\n(1) a manufactured home park, $165; and\n(2) a recreational camping area with:\n(i) 24 or less sites, $55;\n(ii) 25 to 99 sites, $230; and\n(iii) 100 or more sites, $330.\nIn addition to the base fee, manufactured home parks and recreational camping areas shall pay $5 for each licensed site. This paragraph does not apply to special event recreational camping areas. Operators of a manufactured home park or a recreational camping area also licensed under section 157.16 for the same location shall pay only one base fee, whichever is the highest of the base fees found in this section or section 157.16.\n(c) In addition to the fee in paragraph (b), each manufactured home park or recreational camping area shall pay an additional annual fee for each fee category specified in this paragraph:\n(1) Manufactured home parks and recreational camping areas with public swimming pools and spas shall pay the appropriate fees specified in section 157.16.\n(2) Individual private sewer or water, $60. \"Individual private water\" means a fee category with a water supply other than a community public water supply as defined in Minnesota Rules, chapter 4720. \"Individual private sewer\" means a fee category with a subsurface sewage treatment system which uses subsurface treatment and disposal.\n(d) The following fees must accompany a plan review application for initial construction of a manufactured home park or recreational camping area:\n(1) for initial construction of less than 25 sites, $375;\n(2) for initial construction of 25 to 99 sites, $400; and\n(3) for initial construction of 100 or more sites, $500.\n(e) The following fees must accompany a plan review application when an existing manufactured home park or recreational camping area is expanded:\n(1) for expansion of less than 25 sites, $250;\n(2) for expansion of 25 to 99 sites, $300; and\n(3) for expansion of 100 or more sites, $450.\n(a) The following fees are required for special event recreational camping areas licensed under this chapter.\n(b) All special event recreational camping areas shall pay an annual fee of $150 plus $1 for each licensed site.\n(c) A special event recreational camping area shall pay a late fee of $360 for failing to obtain a license prior to operating.\n(d) The following fees must accompany a plan review application for initial construction of a special event recreational camping area:\n(1) for initial construction of less than 25 special event recreational camping sites, $375;\n(2) for initial construction of 25 to 99 sites, $400; and\n(3) for initial construction of 100 or more sites, $500.\n(e) The following fees must accompany a plan review application for expansion of a special event recreational camping area:\n(1) for expansion of less than 25 sites, $250;\n(2) for expansion of 25 to 99 sites, $300; and\n(3) for expansion of 100 or more sites, $450.",
	"repealed": false
}