{
	"id": "124D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.05",
	"title": "124D.05 ATTENDING SCHOOL IN ANOTHER STATE; SEVERANCE PAY.",
	"text": "Any person under 21 years of age residing in any district not maintaining a secondary school who has successfully completed the elementary school may, with the consent of the board of such district, attend any secondary school of a district in an adjoining state willing to admit the person, if the secondary school is nearer to the place of residence than any established secondary school in Minnesota, the distances being measured by the usual traveled routes. Any tuition charged by the district so attended must be paid to the district attended by the district in which the person resides. This tuition must not be more than (a) the district charges nonresident pupils of that state, (b) the average maintenance cost exclusive of transportation per pupil unit in average daily membership in the school attended, nor (c) the tuition rate provided for in section 123A.488, subdivision 2.\nAny pupil attending a secondary school in an adjoining state for whom tuition is paid from district funds is entitled to transportation services in accordance with Minnesota Statutes.\nA board of a district maintaining a secondary school may by a majority vote provide for the instruction of any resident pupil attending an elementary school, a middle school, or a secondary school in a district in an adjoining state. Any charge for tuition or transportation by the district in the adjoining state must be paid by the resident district. The pupil must be considered a pupil of the resident district for the purposes of state aid.\nNotwithstanding subdivisions 1 and 2, if an agreement is reached between the state of Minnesota and an adjoining state pursuant to section 124D.041, the provisions of section 124D.041 and the agreement shall apply to all enrollment transfers between Minnesota and the adjoining state, and provisions of subdivisions 1 and 2 to the contrary, including provisions relating to tuition payments, shall not apply.\nA district must pay severance pay to a teacher who is placed on unrequested leave of absence by the district as a result of an agreement under this section. A teacher is eligible under this subdivision if the teacher:\n(1) is a teacher, as defined in section 122A.40, subdivision 1, but not a superintendent;\n(2) has a continuing contract with the district according to section 122A.40, subdivision 7.\nThe amount of severance pay must be equal to the teacher's salary for the school year during which the teacher was placed on unrequested leave of absence minus the gross amount the teacher was paid during the 12 months following the teacher's termination of salary, by an entity whose teachers by statute or rule must possess a valid Minnesota teaching license, and minus the amount a teacher receives as severance or other similar pay according to a contract with the district or district policy. These entities include, but are not limited to, the district that placed the teacher on unrequested leave of absence, another district in Minnesota, an education district, an intermediate school district, a service cooperative, a board formed under section 471.59, a state residential academy, the Perpich Center for Arts Education, a vocational center, or a special education cooperative. These entities do not include a district in another state, a Minnesota public postsecondary institution, or a state agency. Only amounts earned by the teacher as a substitute teacher or in a position requiring a valid Minnesota teaching license shall be subtracted. A teacher may decline any offer of employment as a teacher without loss of rights to severance pay.\nTo determine the amount of severance pay that is due for the first six months following termination of the teacher's salary, the district may require the teacher to provide documented evidence of the teacher's employers and gross earnings during that period. The district must pay the teacher the amount of severance pay it determines to be due from the proceeds of the levy for this purpose. To determine the amount of severance pay that is due for the second six months of the 12 months following the termination of the teacher's salary, the district may require the teacher to provide documented evidence of the teacher's employers and gross earnings during that period. The district must pay the teacher the amount of severance pay it determines to be due from the proceeds of the levy for this purpose.\nA teacher who receives severance pay under this subdivision waives all further reinstatement rights under section 122A.40, subdivision 10 or 11. If the teacher receives severance pay, the teacher must not receive credit for any years of service in the district paying severance pay prior to the year in which the teacher becomes eligible to receive severance pay.\nThe severance pay is subject to section 465.72. The district may levy annually according to section 126C.43 for the severance pay.",
	"repealed": false
}