{
	"id": "142G.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.22",
	"title": "142G.22 PROSPECTIVE AND RETROSPECTIVE MFIP ELIGIBILITY.",
	"text": "(a) A county agency must determine MFIP eligibility prospectively based on assessing income and the county agency's best estimate of the circumstances that will exist in the payment month.\n(b) A county agency must calculate the amount of the assistance payment using prospective budgeting. To determine MFIP eligibility and the assistance payment amount, a county agency must apply countable income, described in sections 142G.31, subdivisions 5 to 12, and 256P.06, received by members of an assistance unit or by other persons whose income is counted for the assistance unit, described under sections 142G.31, subdivisions 1 to 4, and 256P.06, subdivision 1.\n(c) This income must be applied to the MFIP standard of need or family wage level subject to this section and sections 142G.30, 142G.32, and 142G.33. Countable income as described in section 256P.06, subdivision 3, received must be applied to the needs of an assistance unit.\n(d) An assistance unit is not eligible when the countable income equals or exceeds the MFIP standard of need or the family wage level for the assistance unit.\n[See Note.]\nAn agency must determine whether the eligibility requirements that pertain to an assistance unit, including those in sections 142G.11 to 142G.15 and 256P.02, will be met prospectively for the payment period. The income test will be applied prospectively.\n[See Note.]\nAfter the first two months of MFIP eligibility, a county agency must continue to determine whether an assistance unit is prospectively eligible for the payment month by looking at all factors other than income and then determine whether the assistance unit is retrospectively income eligible by applying the monthly income test to the income from the budget month. When the monthly income test is not satisfied, the assistance payment must be suspended when ineligibility exists for one month or ended when ineligibility exists for more than one month.\n[See Note.]\nA county agency must apply the monthly income test retrospectively for each month of MFIP eligibility. An assistance unit is not eligible when the countable income equals or exceeds the MFIP standard of need or the family wage level for the assistance unit. The income applied against the monthly income test must include:\n(1) gross earned income from employment as described in chapter 256P, prior to mandatory payroll deductions, voluntary payroll deductions, wage authorizations, and after the disregards in section 142G.16, subdivision 3, and the allocations in section 142G.33;\n(2) gross earned income from self-employment less deductions for self-employment expenses in section 142G.31, subdivision 8, but prior to any reductions for personal or business state and federal income taxes, personal FICA, personal health and life insurance, and after the disregards in section 142G.16, subdivision 3, and the allocations in section 142G.33;\n(3) unearned income as described in section 256P.06, subdivision 3, after deductions for allowable expenses in section 142G.31, subdivision 12, and allocations in section 142G.33;\n(4) gross earned income from employment as determined under clause (1) which is received by a member of an assistance unit who is a minor child or minor caregiver and less than a half-time student;\n(5) child support received by an assistance unit, excluded under section 256P.06, subdivision 3, clause (2), item (xvi);\n(6) spousal support received by an assistance unit;\n(7) the income of a parent when that parent is not included in the assistance unit;\n(8) the income of an eligible relative and spouse who seek to be included in the assistance unit; and\n(9) the unearned income of a minor child included in the assistance unit.\n[See Note.]\nWhen an assistance unit is ineligible for MFIP assistance for two consecutive months, the county agency must terminate MFIP assistance.\n[See Note.]",
	"repealed": false
}