{
	"id": "259.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.60",
	"title": "259.60 INTERCOUNTRY ADOPTIONS; OBTAINING AMENDED BIRTH RECORD.",
	"text": "The adoption of a child by a resident of this state under the laws of a foreign country is valid and binding under the laws of this state if the validity of the foreign adoption has been verified by the granting of an IR-3 visa for the child by the United States Citizenship and Immigration Services.\n(a) Under the procedures in paragraph (b), a person, whose adoption of a child under the laws of a foreign country is valid in this state under subdivision 1, may petition the district court in the county where the adoptive parent resides for a decree confirming and recognizing the adoption, changing the child's legal name, if requested in the petition, and authorizing the commissioner of health to issue a new birth record for the child under section 144.218, subdivision 2.\n(b) A court shall issue the decree described in paragraph (a) upon receipt of the following documents:\n(1) a petition by the adoptive parent stating that the adoptive parent completed adoption of the child under the laws of a foreign country and that the adoption is valid in this state under subdivision 1 and requesting that the court issue a decree confirming and recognizing the adoption, changing the child's legal name, if desired, and authorizing the commissioner of health to issue a new birth record for the child under section 144.218, subdivision 2. The petition must be in the form of a signed, sworn, and notarized statement;\n(2) a copy of the child's original birth record, if available;\n(3) a copy of the final adoption certificate or equivalent as issued by the foreign jurisdiction;\n(4) a copy of the child's passport including the United States visa indicating IR-3 immigration status; and\n(5) certified English translations of any of the documents in clauses (2) to (4) that are not written in the English language.\n(c) Upon issuing a decree under this section, the court shall forward to the commissioners of health and human services a copy of the decree. The court shall also complete and forward to the commissioner of health the certificate of adoption, unless another form has been specified by the commissioner of health.\nIf a child is adopted by a resident of this state under the laws of a foreign country or if a resident of this state brings a child into the state under an IR-3 or IR-4 visa issued for the child by the United States Citizenship and Immigration Services, the postadoption reporting requirements of the country in which the child was adopted, applicable at the time of the child's adoption, must be given full faith and credit by the courts of this state and apply to the adoptive placement of that child.",
	"repealed": false
}