{
	"id": "115.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.061",
	"title": "115.061 DUTY TO NOTIFY; AVOIDING WATER POLLUTION.",
	"text": "(a) Except as provided in paragraph (b), it is the duty of every person to notify the agency immediately of the discharge, accidental or otherwise, of any substance or material under its control which, if not recovered, may cause pollution of waters of the state, and the responsible person shall recover as rapidly and as thoroughly as possible such substance or material and take immediately such other action as may be reasonably possible to minimize or abate pollution of waters of the state caused thereby.\n(b) Notification is not required under paragraph (a) for a discharge of five gallons or less of petroleum, as defined in section 115C.02, subdivision 10. This paragraph does not affect the other requirements of paragraph (a).\n(c) Promptly after notifying the agency of a discharge under paragraph (a), a publicly owned treatment works or a publicly or privately owned domestic sewer system owner must provide notice to the potentially impacted public and to any downstream drinking water facility that may be impacted by the discharge. Notice to the public and to any drinking water facility must be made using the most efficient communications system available to the facility owner such as in person, telephone call, radio, social media, web page, or another expedited form. In addition, signage must be posted at all impacted public use areas within the same jurisdiction or notification must be provided to the entity that has jurisdiction over any impacted public use areas. A notice under this paragraph must include the date and time of the discharge, a description of the material released, a warning of the potential public health risk, and the permittee's contact information.\n(d) The agency must provide guidance that includes but is not limited to methods and protocols for providing timely notice under this section.",
	"repealed": false
}