{
	"id": "171.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.13",
	"title": "171.13 EXAMINATION.",
	"text": "(a) Except as otherwise provided in this section, the commissioner must examine each applicant for a driver's license by such agency as the commissioner directs. This examination must include:\n(1) a test of the applicant's eyesight, provided that this requirement is met by submission of a vision examination certificate under section 171.06, subdivision 7;\n(2) a test of the applicant's ability to read and understand highway signs regulating, warning, and directing traffic;\n(3) a test of the applicant's knowledge of (i) traffic laws; (ii) the effects of alcohol and drugs on a driver's ability to operate a motor vehicle safely and legally, and of the legal penalties and financial consequences resulting from violations of laws prohibiting the operation of a motor vehicle while under the influence of alcohol or drugs; (iii) railroad grade crossing safety; (iv) slow-moving vehicle safety; (v) laws relating to pupil transportation safety, including the significance of school bus lights, signals, stop arm, and passing a school bus; (vi) traffic laws related to bicycles; and (vii) the circumstances and dangers of carbon monoxide poisoning;\n(4) an actual demonstration of ability to exercise ordinary and reasonable control in the operation of a motor vehicle; and\n(5) other physical and mental examinations as the commissioner finds necessary to determine the applicant's fitness to operate a motor vehicle safely upon the highways.\n(b) Notwithstanding paragraph (a), the commissioner must not deny an application for a driver's license based on the exclusive grounds that the applicant's eyesight is deficient in color perception or that the applicant has been diagnosed with diabetes mellitus. War veterans operating motor vehicles especially equipped for disabled persons, if otherwise entitled to a license, must be granted such license.\n(c) The commissioner must ensure that an applicant may take an exam either in the county where the applicant resides or in an adjacent county at a reasonably convenient location. The schedule for each exam station must be posted on the department's website.\n(d) The commissioner shall ensure that an applicant is able to obtain an appointment for an examination to demonstrate ability under paragraph (a), clause (4), within 14 days of the applicant's request if, under the applicable statutes and rules of the commissioner, the applicant is eligible to take the examination.\n(e) The commissioner must provide real-time information on the department's website about the availability and location of exam appointments. The website must show the next available exam dates and times for each exam station. The website must also provide an option for a person to enter an address to see the date and time of the next available exam at each exam station sorted by distance from the address provided.\n(a) If the commissioner determines that an applicant for a driver's license is 21 years of age or older and possesses a valid driver's license issued by another state or jurisdiction that requires a comparable examination to obtain a driver's license, the commissioner must waive the requirements that the applicant pass a knowledge examination and demonstrate ability to exercise ordinary and reasonable control in the operation of a motor vehicle.\n(b) If the commissioner determines that an applicant for a motorcycle endorsement is 21 years of age or older and possesses a valid driver's license with a motorcycle endorsement issued by another state or jurisdiction that requires a comparable examination to obtain an endorsement, the commissioner must waive the requirements with respect to the endorsement that the applicant pass a knowledge examination and demonstrate the ability to exercise ordinary and reasonable control in the operation of a motor vehicle.\n(c) For purposes of this subdivision, \"jurisdiction\" includes, but is not limited to, both the active and reserve components of any branch or unit of the United States armed forces, and \"valid driver's license\" includes any driver's license that is recognized by that branch or unit as currently being valid, or as having been valid at the time of the applicant's separation or discharge from the military within a period of time deemed reasonable and fair by the commissioner, up to and including one year past the date of the applicant's separation or discharge.\nMS 2010 [Renumbered 171.0705, subdivision 1]\nMS 2010 [Renumbered 171.0705, subd 6]\nMS 2010 [Renumbered 171.0705, subd 9]\nThe commissioner shall include, in each examination under subdivision 1, an examination of the applicant's knowledge of highway safety with respect to approaching, following, and passing slow-moving vehicles and the significance of the slow-moving vehicle emblem.\nMS 2010 [Renumbered 171.0705, subd 2]\nMS 2010 [Renumbered 171.0705, subd 4]\nMS 2010 [Renumbered 171.0705, subd 8]\nMS 2010 [Renumbered 171.0705, subd 10]\nMS 2010 [Renumbered 171.0705, subd 7]\nMS 2010 [Renumbered 171.0705, subd 5]\n[Renumbered 171.0705, subd 3]\n(a) The department shall issue a driver's license upon renewal:\n(1) when the applicant has passed an examination consisting of a screening of the applicant's eyesight since the last previous license renewal or issuance;\n(2) if applicable, when an applicant has passed a written examination since the last previous license renewal or issuance and after receiving a warning letter or attending a preliminary hearing as a habitual violator, within the meaning of rules adopted by the commissioner; and\n(3) if applicable, when an applicant has passed a road examination since the last previous license renewal or issuance and after having had driving privileges suspended as a habitual violator, within the meaning of rules adopted by the commissioner.\n(b) A screening of eyesight required by this subdivision does not constitute the practice of optometry as defined in section 148.56.\n(c) The commissioner may adopt rules to administer this subdivision.\nThe commissioner may require an examination by such agency as the commissioner directs of any licensed driver, to determine incompetency, physical or mental disability or disease, or any other condition which might affect the driver from exercising reasonable and ordinary control over a motor vehicle, but no examination shall be required only for the reason that any licensed driver has attained a certain age. If as a result of the examination the commissioner believes that the driver is an unsafe person to operate a motor vehicle upon the public highways, the commissioner may cancel the driver's license of the person. The commissioner shall give the person written notice of the cancellation.\nIf a licensee does not submit to any examination required under the provisions of subdivision 3, the commissioner may cancel the driver's license of the licensee. If such license is canceled, the licensee shall immediately surrender to the department all driver's license certificates in possession.\nAny person applying to secure a school bus, tank vehicle, passenger, double-trailer or triple-trailer, or hazardous materials vehicle endorsement on the person's driver's license shall pay a $2.50 examination fee at the place of application.\nA person applying for an initial motorcycle endorsement on a driver's license must pay at the place of examination a $2.50 examination fee, an endorsement fee as prescribed in section 171.06, subdivision 2a, and the appropriate driver's license fee as prescribed in section 171.06, subdivision 2.\n(a) A fee of $10 must be paid by an individual to take a third and any subsequent knowledge test administered by the department if the individual has failed two previous consecutive knowledge tests on the subject.\n(b) A fee of $20 must be paid by an individual to take a third and any subsequent skills or road test administered by the department if the individual has previously failed two consecutive skill or road tests in a specified class of motor vehicle.\n(c) A fee of $20 must be paid by an individual who fails to appear for a scheduled skills or road test or who cancels a skills or road test within 24 hours of the appointment time.\n(d) All fees received under this subdivision must be paid into the state treasury and credited to the driver and vehicle services operating account under section 299A.705.\nThe commissioner must not schedule or reserve recurring time with a public, private, or commercial driver education program for purposes of administering skills or road tests to a class D or commercial driver's license applicant.\n(a) The commissioner must implement online knowledge testing as provided in this subdivision. The commissioner must not charge a fee to a driver education program or an authorized entity for access to the online knowledge testing system or for administering the online knowledge test.\n(b) Upon written request from a driver education program licensed by the department, the commissioner must grant access to the department's web-based knowledge testing system to the driver education program. Once granted access to the online knowledge testing system, a driver education program may administer the online knowledge test to a student of the program.\n(c) An entity other than a driver education program may apply to the commissioner for authority to administer online knowledge tests. The commissioner may approve or disapprove an application for administering the online knowledge tests under this paragraph. Upon approving an application of an entity, the commissioner must grant access to the department's web-based knowledge testing system to that authorized entity. Once granted access to the online knowledge testing system, the authorized entity may administer the online knowledge test.\n(d) A driver education program or authorized entity:\n(1) must provide all computers and equipment for persons that take the online knowledge test;\n(2) must provide appropriate proctors to monitor persons taking the online knowledge test; and\n(3) may charge a fee of no more than $10 for administering the online knowledge test.\n(e) For purposes of paragraph (d), clause (2), a proctor must be:\n(1) an employee of the driver education program, authorized entity, or a state or local government;\n(2) a driver's license agent; or\n(3) a classroom teacher, school administrator, or paraprofessional at a public or private school, excluding a home school.\nThe proctor must be physically present at the location where the test is being administered. A proctor must not be a relative of the person taking the test. For purposes of this paragraph, a relative is a spouse, fiancee, fiance, grandparent, parent, child, sibling, or legal guardian, including adoptive, half, step, and in-law relationships.\n[See Note.]\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"committee\" means the Department of Public Safety, Division of Driver and Vehicle Services Test Maintenance Committee responsible for monitoring, reviewing, and editing the written portion of the driver's knowledge examination on behalf of the Division of Driver and Vehicle Services;\n(2) \"plain language standards\" means the requirements specified in paragraph (b) and the requirements of the Plain Writing Act, Public Law 111-274, and governor's Executive Order 14-07; and\n(3) \"written examination\" means the written portion of the driver's knowledge examination in English and administered under this section.\n(b) By February 1, 2025, the commissioner must implement plain language standards and create a new written portion of the knowledge examination to ensure the written examination is a fair assessment of the state's traffic and driving laws. The new written portion of the knowledge examination, to the extent practicable, must be organized to serve the reader's needs and written using clear, simplified language with the following grammatical standards:\n(1) \"you\" and other pronouns address the test-taker directly;\n(2) utilize the active voice;\n(3) use short, simple sentences and straightforward questions;\n(4) avoid complex and compound sentence structures;\n(5) utilize commonly used and familiar words;\n(6) avoid turning verbs into nouns through nominalization;\n(7) minimize the use of abbreviations;\n(8) place words carefully to avoid large gaps between the subject, verb, and object in a sentence;\n(9) avoid confusing terms such as \"either, or\" and \"neither, nor\";\n(10) utilize simple verb tenses, including the simple present verb tense where practicable, to explain confusing or complex concepts;\n(11) omit double negatives and terms like \"except for,\" \"unless,\" and \"indicated otherwise\";\n(12) avoid hidden terms and use concrete, familiar words to describe confusing or complex concepts or items;\n(13) omit excess and unnecessary words;\n(14) use the word \"must\" to express requirements;\n(15) put exceptions at the end of a question;\n(16) place modifying terms in correct locations; and\n(17) any other recommended strategies and techniques designed to offer clear communication to test-takers.\n(c) Any revisions or additions to the subjects tested on a knowledge examination must be written utilizing the plain language standards specified in paragraph (b). Revisions made to the written examination must assess whether the applicant understands the traffic laws of Minnesota and test knowledge of the requirements specified in subdivision 1, paragraph (a), clauses (2) and (3).\n(d) The committee must convene its first meeting by August 1, 2024. Before publication of the new written examination under plain language requirements, the committee must meet at least four times before January 1, 2025. The commissioner of public safety may enter into an agreement with a third party to propose, draft, and revise the written examination under the requirements of this subdivision.\n(e) The commissioner may adopt plain language standards into other Division of Driver and Vehicle Services materials, including the driver's manual under section 171.0705.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"delay\" or \"delayed\" means a road test examination under this section between 15 and 30 days after an eligible applicant's request for a road test; and\n(2) \"reporting period\" means a calendar year or a fiscal year as identified for each report under paragraph (b).\n(b) By March 1 and September 1 of each year, the commissioner must submit a report on road test examination scheduling to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The report due by September 1 must include information for the most recently ended fiscal year. The report due by March 1 must include information for the most recently ended calendar year.\n(c) At a minimum, the report must:\n(1) identify each performance measure or metric established by the commissioner related to scheduling availability and passage of road tests;\n(2) for the reporting period, identify the results for the performance measures or metrics under clause (1); and\n(3) for the reporting period, identify the rate at which applicants are able to obtain an appointment for a road test in the time period provided under subdivision 1, paragraph (d), compared to the number of individuals who experienced a delay in booking a road test appointment.\n(d) For the reporting period, if a goal is not met in a performance measure or metric under paragraph (c), clause (1), or if the requirements specified under subdivision 1, paragraph (d), are not fully met, the report must also:\n(1) include the number of administered road tests for Class D and commercial drivers' licenses per month for the previous five fiscal years;\n(2) provide information about factors that impact road test examination appointment availability, including information on staffing and the use of overtime at exam stations, budgetary resources, the number of potential applicants seeking a road test, and any other analysis based on the department's experience necessary to identify and project what may cause delays in the next five fiscal years;\n(3) analyze the rate and frequency of which an applicant was administered a road test for either a Class D or commercial driver's license at an exam station outside the applicant's county or exam station region to identify the rate at which an applicant must travel to obtain a road test appointment;\n(4) for the analysis required in clause (3), provide a breakout by county and exam station region; and\n(5) conduct the analysis required in clauses (3) and (4) for retakes of Class D or commercial driver's license road tests.",
	"repealed": false
}