{
	"id": "423A.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/423A.022",
	"title": "423A.022 POLICE AND FIREFIGHTER RETIREMENT SUPPLEMENTAL STATE AID.",
	"text": "Annually, the commissioner of revenue shall allocate police and firefighter retirement supplemental state aid appropriated under subdivision 6 as provided in subdivision 2 and paid as provided in subdivision 4.\n(a) Of the total amount appropriated as supplemental state aid:\n(1) 58.064 percent must be paid to the executive director of the Public Employees Retirement Association for deposit in the public employees police and fire retirement fund established by section 353.65, subdivision 1;\n(2) 35.484 percent must be paid to municipalities other than municipalities solely employing firefighters with retirement coverage provided by the public employees police and fire retirement plan which qualified to receive fire state aid in that calendar year, allocated in proportion to the most recent amount of fire state aid paid under section 477B.04, for the municipality bears to the most recent total fire state aid for all municipalities other than the municipalities solely employing firefighters with retirement coverage provided by the public employees police and fire retirement plan paid under section 477B.04, with the allocated amount for fire departments participating in the statewide lump-sum volunteer firefighter plan paid to the executive director of the Public Employees Retirement Association for deposit in the fund established by section 353G.02, subdivision 3, and credited to the respective account and with the balance paid to the treasurer of each municipality for transmittal within 30 days of receipt to the treasurer of the applicable firefighters relief association for deposit in its special fund; and\n(3) 6.452 percent must be paid to the executive director of the Minnesota State Retirement System for deposit in the state patrol retirement fund.\n(b) For purposes of this section, the term \"municipalities\" includes independent nonprofit firefighting corporations that participate in the statewide lump-sum volunteer firefighter plan under chapter 353G or with subsidiary volunteer firefighter relief associations operating under chapter 424A.\nOn or before September 1, annually, the executive director of the Public Employees Retirement Association shall report to the commissioner of revenue the following:\n(1) the municipalities which employ firefighters with retirement coverage by the public employees police and fire retirement plan;\n(2) the fire departments covered by the statewide lump-sum volunteer firefighter plan; and\n(3) any other information requested by the commissioner to administer the police and firefighter retirement supplemental state aid program.\n(a) The payments under this section must be made on October 1 each year, with interest at one percent for each month, or portion of a month, that the amount remains unpaid after October 1. Any necessary adjustments must be made to subsequent payments.\n(b) The provisions of chapter 477B and section 424A.014 that prevent municipalities and relief associations from being eligible for, or receiving fire state aid under chapter 477B and section 424A.014 until the applicable financial reporting requirements have been complied with, apply to the amounts payable to municipalities and relief associations under this section.\n(a) The aid under subdivision 2, paragraph (a), clauses (1) and (3), continues until the earlier of:\n(1) the December 1 following three consecutive fiscal years in which, for each fiscal year, the actuarial value of assets of both the State Patrol retirement plan and the public employees police and fire retirement plan equals or exceeds 90 percent of the actuarial accrued liabilities as reported by the actuary retained under section 356.214 in the annual actuarial valuation prepared under section 356.215; or\n(2) July 1, 2048.\n(b) The aid under subdivision 2, paragraph (a), clause (2), does not terminate.\n$15,500,000 is appropriated annually to the commissioner of revenue for this aid program.",
	"repealed": false
}