{
	"id": "473.758",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.758",
	"title": "473.758 IMPLEMENTATION.",
	"text": "The county shall be the responsible governmental unit for any environmental impact statement for the ballpark and public infrastructure prepared under section 116D.04. Notwithstanding section 116D.04, subdivision 2b, and implementing rules:\n(1) the environmental impact statement shall not be required to consider alternative ballpark sites; and\n(2) the environmental impact statement must be determined to be adequate before commencing work on the foundation of the ballpark, but the ballpark and public infrastructure may otherwise be started and all preliminary and final government decisions and actions may be made and taken, including but not limited to acquiring land, obtaining financing, imposing the tax under section 473.757, granting permits or other land use approvals, entering into grant, lease, or use agreements, or preparing the site or related public infrastructure prior to a determination of the adequacy of the environmental impact statement.\nIn order to accomplish the objectives of Laws 2006, chapter 257, within the required time frame, it is necessary to establish an alternative process for municipal land use and development review. It is hereby found and declared that the construction of a ballpark within the development area is consistent with the adopted area plan, is the preferred ballpark location, and is a permitted land use. This subdivision establishes a procedure for all land use and development reviews and approvals by the city of Minneapolis for the ballpark and related public infrastructure and supersedes all land use and development rules and restrictions and procedures imposed by other law, charter, or ordinance, including without limitation section 15.99. No later than 30 days after May 27, 2006, the city of Minneapolis and the county shall establish a ballpark implementation committee with equal representation from the city of Minneapolis and the county to make recommendations on the design plans submitted for the ballpark, public infrastructure and related improvements, including but not limited to street vacation, parking, roadways, walkways, skyways, pedestrian bridges, bicycle paths, transit improvements to facilitate public street access to the ballpark and integration into the transportation plan for downtown and the region, lighting, landscaping, utilities, streets, drainage, environmental remediation, and land acquired and prepared for private redevelopment in a manner related to the use of the ballpark. The implementation committee must take action to issue its recommendations within the time frames established in the planning and construction timetable issued by the county which shall provide for no less than 60 days for the committee's review. The recommendations of the implementation committee shall be forwarded to the city of Minneapolis Planning Commission for an advisory recommendation and then to the city council for final action in a single resolution, which final action must be taken within 45 days of the submission of the recommendations to the planning commission. The city council shall not impose any unnecessary or unreasonable conditions on the recommendations of the implementation committee, nor take any action or impose any conditions that will result in delay from the time frames established in the planning and construction timetable or in additional overall costs. Failure of the city council to act within the 45-day period shall be deemed to be approval. The county may seek de novo review in the district court of any city council action. The district court or any appellate court shall expedite review to the maximum extent possible and timely issue relief, orders or opinions as necessary to give effect to the provisions and objectives in Laws 2006, chapter 257.",
	"repealed": false
}