{
	"id": "256B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.04",
	"title": "256B.04 DUTIES OF STATE AGENCY.",
	"text": "The state agency shall supervise the administration of medical assistance for eligible recipients by the county agencies hereunder.\nThe commissioner shall carry out the duties in this section with the participation of the boards of county commissioners, and with full consideration for the interests of counties, to plan and implement a unified, accountable, comprehensive health services system that:\n(1) promotes accessible and quality health care for all Minnesotans;\n(2) assures provision of adequate health care within limited state and county resources;\n(3) avoids shifting funding burdens to county tax resources;\n(4) provides statewide eligibility, benefit, and service expectations;\n(5) manages care, develops risk management strategies, and contains cost in all health and human services; and\n(6) supports effective implementation of publicly funded health and human services for all areas of the state.\nNotwithstanding subdivision 1, the commissioner may contract with federally recognized Indian tribes with a reservation in Minnesota for the provision of early and periodic screening, diagnosis, and treatment administrative services for American Indian children, according to section 256B.0625, subdivision 58, and Code of Federal Regulations, title 42, section 441, subpart B, when the tribe chooses to provide such services. For purposes of this subdivision, \"American Indian\" has the meaning given to persons to whom services will be provided for in Code of Federal Regulations, title 42, section 36.12. The commissioner, the local agency, and the tribe may contract with any entity for the provision of early and periodic screening, diagnosis, and treatment administrative services.\nMake uniform rules, not inconsistent with law, for carrying out and enforcing the provisions hereof in an efficient, economical, and impartial manner, and to the end that the medical assistance system may be administered uniformly throughout the state, having regard for varying costs of medical care in different parts of the state and the conditions in each case, and in all things to carry out the spirit and purpose of this program, which rules shall be furnished immediately to all county agencies, and shall be binding on such county agencies.\nPrescribe the form of, print, and supply to the county agencies, blanks for applications, reports, affidavits, and such other forms as it may deem necessary or advisable.\nCooperate with the federal Centers for Medicare and Medicaid Services in any reasonable manner as may be necessary to qualify for federal aid in connection with the medical assistance program, including the making of such reports in such form and containing such information as the Department of Health, Education, and Welfare may, from time to time, require, and comply with such provisions as such department may, from time to time, find necessary to assure the correctness and verifications of such reports.\nThe commissioner shall perform all duties necessary to administer eligibility determinations for the Medicare Part D prescription drug subsidy and facilitate the enrollment of eligible medical assistance recipients into Medicare prescription drug plans as required by the Medicare Prescription Drug, Improvement, and Modernization Act of 2003 (MMA), Public Law 108-173, and Code of Federal Regulations, title 42, sections 423.30 to 423.56 and 423.771 to 423.800.\nThe state agency within 60 days after the close of each fiscal year, shall prepare and print for the fiscal year a report that includes a full account of the operations and expenditure of funds under this chapter, a full account of the activities undertaken in accordance with subdivision 10, adequate and complete statistics divided by counties about all medical assistance provided in accordance with this chapter, and any other information it may deem advisable.\nPrepare and release a summary statement monthly showing by counties the amount paid hereunder and the total number of persons assisted.\nEstablish and enforce safeguards to prevent unauthorized disclosure or improper use of the information contained in applications, reports of investigations and medical examinations, and correspondence in the individual case records of recipients of medical assistance.\nFurnish information to acquaint needy persons and the public generally with the plan for medical assistance of this state.\nCooperate with agencies in other states in establishing reciprocal agreements to provide for payment of medical assistance to recipients who have moved to another state, consistent with the provisions hereof and of Title XIX of the Social Security Act of the United States of America.\nEstablish by rule general criteria and procedures for the identification and prompt investigation of suspected medical assistance fraud, theft, abuse, presentment of false or duplicate claims, presentment of claims for services not medically necessary, or false statement or representation of material facts by a vendor of medical care, and for the imposition of sanctions against a vendor of medical care. If it appears to the state agency that a vendor of medical care may have acted in a manner warranting civil or criminal proceedings, it shall so inform the attorney general in writing.\n[Repealed, 1997 c 7 art 2 s 67]\n(a) Place limits on the types of services covered by medical assistance, the frequency with which the same or similar services may be covered by medical assistance for an individual recipient, and the amount paid for each covered service. The state agency shall promulgate rules establishing maximum reimbursement rates for emergency and nonemergency transportation.\nThe rules shall provide:\n(1) an opportunity for all recognized transportation providers to be reimbursed for nonemergency transportation consistent with the maximum rates established by the agency; and\n(2) reimbursement of public and private nonprofit providers serving the population with a disability generally at reasonable maximum rates that reflect the cost of providing the service regardless of the fare that might be charged by the provider for similar services to individuals other than those receiving medical assistance or medical care under this chapter.\n(b) The commissioner shall encourage providers reimbursed under this chapter to coordinate their operation with similar services that are operating in the same community. To the extent practicable, the commissioner shall encourage eligible individuals to utilize less expensive providers capable of serving their needs.\n(c) For the purpose of this subdivision and section 256B.02, subdivision 8, and effective on January 1, 1981, \"recognized provider of transportation services\" means an operator of special transportation service as defined in section 174.29 that has been issued a current certificate of compliance with operating standards of the commissioner of transportation or, if those standards do not apply to the operator, that the agency finds is able to provide the required transportation in a safe and reliable manner. Until January 1, 1981, \"recognized transportation provider\" includes an operator of special transportation service that the agency finds is able to provide the required transportation in a safe and reliable manner.\nEach person appointed by the commissioner to participate in decisions whether medical care to be provided to eligible recipients is medically necessary shall abstain from participation in those cases in which the appointee (1) has issued treatment orders in the care of the patient or participated in the formulation or execution of the patient's treatment plan or (2) has, or a member of the appointee's family has, an ownership interest of five percent or more in the institution that provided or proposed to provide the services being reviewed.\n(a) When determined to be effective, economical, and feasible, the commissioner may utilize volume purchase through competitive bidding and negotiation under the provisions of chapter 16C, to provide items under the medical assistance program including but not limited to the following:\n(1) eyeglasses;\n(2) oxygen. The commissioner shall provide for oxygen needed in an emergency situation on a short-term basis, until the vendor can obtain the necessary supply from the contract dealer;\n(3) hearing aids and supplies;\n(4) durable medical equipment, including but not limited to:\n(i) hospital beds;\n(ii) commodes;\n(iii) glide-about chairs;\n(iv) patient lift apparatus;\n(v) wheelchairs and accessories;\n(vi) oxygen administration equipment;\n(vii) respiratory therapy equipment;\n(viii) electronic diagnostic, therapeutic and life-support systems; and\n(ix) allergen-reducing products as described in section 256B.0625, subdivision 67, paragraph (c) or (d);\n(5) nonemergency medical transportation level of need determinations, disbursement of public transportation passes and tokens, and volunteer and recipient mileage and parking reimbursements;\n(6) drugs; and\n(7) quitline services as described in section 256B.0625, subdivision 68, paragraph (c).\n(b) Rate changes and recipient cost-sharing under this chapter and chapter 256L do not affect contract payments under this subdivision unless specifically identified.\n(c) The commissioner may not utilize volume purchase through competitive bidding and negotiation under the provisions of chapter 16C for special transportation services or incontinence products and related supplies.\nNonemergency medical transportation level of need determinations must be performed by a physician, a registered nurse working under direct supervision of a physician, a physician assistant, an advanced practice registered nurse, a licensed practical nurse, or a discharge planner. Nonemergency medical transportation level of need determinations must not be performed more than annually on any individual, unless the individual's circumstances have sufficiently changed so as to require a new level of need determination. Individuals residing in licensed nursing facilities are exempt from a level of need determination and are eligible for special transportation services until the individual no longer resides in a licensed nursing facility. If a person authorized by this subdivision to perform a level of need determination determines that an individual requires stretcher transportation, the individual is presumed to maintain that level of need until otherwise determined by a person authorized to perform a level of need determination, or for six months, whichever is sooner.\n(a) Establish on a statewide basis a new program to safeguard against unnecessary or inappropriate use of medical assistance services, against excess payments, against unnecessary or inappropriate hospital admissions or lengths of stay, and against underutilization of services in prepaid health plans, long-term care facilities or any health care delivery system subject to fixed rate reimbursement. In implementing the program, the state agency shall utilize both prepayment and postpayment review systems to determine if utilization is reasonable and necessary. The determination of whether services are reasonable and necessary shall be made by the commissioner in consultation with a professional services advisory group or health care consultant appointed by the commissioner.\n(b) Contracts entered into for purposes of meeting the requirements of this subdivision shall not be subject to the set-aside provisions of chapter 16C.\n(c) A recipient aggrieved by the commissioner's termination of services or denial of future services may appeal pursuant to section 256.045. Unless otherwise provided by law, a vendor aggrieved by the commissioner's determination that services provided were not reasonable or necessary may appeal pursuant to the contested case procedures of chapter 14. To appeal, the vendor shall notify the commissioner in writing within 30 days of receiving the commissioner's notice. The appeal request shall specify each disputed item, the reason for the dispute, an estimate of the dollar amount involved for each disputed item, the computation that the vendor believes is correct, the authority in statute or rule upon which the vendor relies for each disputed item, the name and address of the person or firm with whom contacts may be made regarding the appeal, and other information required by the commissioner.\n(d) The commissioner may select providers to provide case management services to recipients who use health care services inappropriately or to recipients who are eligible for other managed care projects. The providers shall be selected based upon criteria that may include a comparison with a peer group of providers related to the quality, quantity, or cost of health care services delivered or a review of sanctions previously imposed by health care services programs or the provider's professional licensing board.\n[Repealed, 2014 c 262 art 4 s 9]\n(a) The commissioner of human services shall award a grant to an eligible organization to conduct a statewide media campaign promoting early prenatal care. The goals of the campaign are to increase public awareness of the importance of early and continuous prenatal care and to inform the public about public and private funds available for prenatal care.\n(b) In order to receive a grant under this section, an applicant must:\n(1) have experience conducting prenatal care outreach;\n(2) have an established statewide constituency or service area; and\n(3) demonstrate an ability to accomplish the purposes in this subdivision.\n(c) Money received under this subdivision may be used for purchase of materials and supplies, staff fees and salaries, consulting fees, and other goods and services necessary to accomplish the goals of the campaign. Money may not be used for capital expenditures.\n(a) The state agency shall accept applications for medical assistance by telephone, via mail, in-person, online via an Internet website, and through other commonly available electronic means.\n(b) The commissioner of human services shall modify the Minnesota health care programs application form to add a question asking applicants whether they have ever served in the United States military.\n(c) For each individual who submits an application or whose eligibility is subject to renewal or whose eligibility is being redetermined pursuant to a change in circumstances, if the agency determines the individual is not eligible for medical assistance, the agency shall determine potential eligibility for other insurance affordability programs.\nThe commissioner of human services shall establish a performance data reporting unit that serves counties and the state. The department shall support this unit and provide technical assistance and access to the data warehouse. The performance data reporting unit, which will operate within the department's central office and consist of both county and department staff, shall provide performance data reports to individual counties, share expertise from counties and the department perspective, and participate in joint planning to link with county databases and other county data sources in order to provide information on services provided to public clients from state, federal, and county funding sources. The performance data reporting unit shall provide counties both individual and group summary level standard or unique reports on health care eligibility and services provided to clients for whom they have financial responsibility.\nIn accordance with federal law governing Money Follows the Person Rebalancing funds, amounts equal to the value of enhanced federal funding resulting from the operation of the demonstration project grant must be transferred from the medical assistance account in the general fund to an account in the special revenue fund. Funds in the special revenue fund account do not cancel and are appropriated to the commissioner to carry out the goals of the Money Follows the Person Rebalancing demonstration project as required under the approved federal plan for the use of the funds, and may be transferred to the medical assistance account if applicable.\n(a) The commissioner shall enroll providers and conduct screening activities as required by Code of Federal Regulations, title 42, section 455, subpart E. A provider must enroll each provider-controlled location where direct services are provided. The commissioner may deny a provider's incomplete application if a provider fails to respond to the commissioner's request for additional information within 60 days of the request. The commissioner must conduct a background study under chapter 245C, including a review of databases in section 245C.08, subdivision 1, paragraph (a), clauses (1) to (5), for a provider described in this paragraph. The background study requirement may be satisfied if the commissioner conducted a fingerprint-based background study on the provider that includes a review of databases in section 245C.08, subdivision 1, paragraph (a), clauses (1) to (5).\n(b) The commissioner shall revalidate each: (1) provider under this subdivision at least once every five years; and (2) personal care assistance agency under this subdivision once every three years.\n(c) The commissioner shall conduct revalidation as follows:\n(1) provide 30-day notice of the revalidation due date including instructions for revalidation and a list of materials the provider must submit;\n(2) if a provider fails to submit all required materials by the due date, notify the provider of the deficiency within 30 days after the due date and allow the provider an additional 30 days from the notification date to comply; and\n(3) if a provider fails to remedy a deficiency within the 30-day time period, give 60-day notice of termination and immediately suspend the provider's ability to bill. The provider does not have the right to appeal suspension of ability to bill.\n(d) If a provider fails to comply with any individual provider requirement or condition of participation, the commissioner may suspend the provider's ability to bill until the provider comes into compliance. The commissioner's decision to suspend the provider is not subject to an administrative appeal.\n(e) Correspondence and notifications, including notifications of termination and other actions, may be delivered electronically to a provider's MN-ITS mailbox. This paragraph does not apply to correspondences and notifications related to background studies.\n(f) If the commissioner or the Centers for Medicare and Medicaid Services determines that a provider is designated \"high-risk,\" the commissioner may withhold payment from providers within that category upon initial enrollment for a 90-day period. The withholding for each provider must begin on the date of the first submission of a claim.\n(g) An enrolled provider that is also licensed by the commissioner under chapter 245A, is licensed as a home care provider by the Department of Health under chapter 144A, or is licensed as an assisted living facility under chapter 144G and has a home and community-based services designation on the home care license under section 144A.484, must designate an individual as the entity's compliance officer. The compliance officer must:\n(1) develop policies and procedures to assure adherence to medical assistance laws and regulations and to prevent inappropriate claims submissions;\n(2) train the employees of the provider entity, and any agents or subcontractors of the provider entity including billers, on the policies and procedures under clause (1);\n(3) respond to allegations of improper conduct related to the provision or billing of medical assistance services, and implement action to remediate any resulting problems;\n(4) use evaluation techniques to monitor compliance with medical assistance laws and regulations;\n(5) promptly report to the commissioner any identified violations of medical assistance laws or regulations; and\n(6) within 60 days of discovery by the provider of a medical assistance reimbursement overpayment, report the overpayment to the commissioner and make arrangements with the commissioner for the commissioner's recovery of the overpayment.\nThe commissioner may require, as a condition of enrollment in medical assistance, that a provider within a particular industry sector or category establish a compliance program that contains the core elements established by the Centers for Medicare and Medicaid Services.\n(h) The commissioner may revoke the enrollment of an ordering or rendering provider for a period of not more than one year, if the provider fails to maintain and, upon request from the commissioner, provide access to documentation relating to written orders or requests for payment for durable medical equipment, certifications for home health services, or referrals for other items or services written or ordered by such provider, when the commissioner has identified a pattern of a lack of documentation. A pattern means a failure to maintain documentation or provide access to documentation on more than one occasion. Nothing in this paragraph limits the authority of the commissioner to sanction a provider under the provisions of section 256B.064.\n(i) The commissioner shall terminate or deny the enrollment of any individual or entity if the individual or entity has been terminated from participation in Medicare or under the Medicaid program or Children's Health Insurance Program of any other state. The commissioner may exempt a rehabilitation agency from termination or denial that would otherwise be required under this paragraph, if the agency:\n(1) is unable to retain Medicare certification and enrollment solely due to a lack of billing to the Medicare program;\n(2) meets all other applicable Medicare certification requirements based on an on-site review completed by the commissioner of health; and\n(3) serves primarily a pediatric population.\n(j) As a condition of enrollment in medical assistance, the commissioner shall require that a provider designated \"moderate\" or \"high-risk\" by the Centers for Medicare and Medicaid Services or the commissioner permit the Centers for Medicare and Medicaid Services, its agents, or its designated contractors and the state agency, its agents, or its designated contractors to conduct unannounced on-site inspections of any provider location. The commissioner shall publish in the Minnesota Health Care Program Provider Manual a list of provider types designated \"limited,\" \"moderate,\" or \"high-risk,\" based on the criteria and standards used to designate Medicare providers in Code of Federal Regulations, title 42, section 424.518. The list and criteria are not subject to the requirements of chapter 14. The commissioner's designations are not subject to administrative appeal.\n(k) As a condition of enrollment in medical assistance, the commissioner shall require that a high-risk provider, or a person with a direct or indirect ownership interest in the provider of five percent or higher, consent to criminal background checks, including fingerprinting, when required to do so under state law or by a determination by the commissioner or the Centers for Medicare and Medicaid Services that a provider is designated high-risk for fraud, waste, or abuse.\n(l)(1) Upon initial enrollment, reenrollment, and notification of revalidation, all durable medical equipment, prosthetics, orthotics, and supplies (DMEPOS) medical suppliers meeting the durable medical equipment provider and supplier definition in clause (3), operating in Minnesota and receiving Medicaid funds must purchase a surety bond that is annually renewed and designates the Minnesota Department of Human Services as the obligee, and must be submitted in a form approved by the commissioner. For purposes of this clause, the following medical suppliers are not required to obtain a surety bond: a federally qualified health center, a home health agency, the Indian Health Service, a pharmacy, and a rural health clinic.\n(2) At the time of initial enrollment or reenrollment, durable medical equipment providers and suppliers defined in clause (3) must purchase a surety bond of $50,000. If a revalidating provider's Medicaid revenue in the previous calendar year is up to and including $300,000, the provider agency must purchase a surety bond of $50,000. If a revalidating provider's Medicaid revenue in the previous calendar year is over $300,000, the provider agency must purchase a surety bond of $100,000. The surety bond must allow for recovery of costs and fees in pursuing a claim on the bond.\n(3) \"Durable medical equipment provider or supplier\" means a medical supplier that can purchase medical equipment or supplies for sale or rental to the general public and is able to perform or arrange for necessary repairs to and maintenance of equipment offered for sale or rental.\n(m) The Department of Human Services may require a provider to purchase a surety bond as a condition of initial enrollment, reenrollment, reinstatement, or continued enrollment if: (1) the provider fails to demonstrate financial viability, (2) the department determines there is significant evidence of or potential for fraud and abuse by the provider, or (3) the provider or category of providers is designated high-risk pursuant to paragraph (f) and as per Code of Federal Regulations, title 42, section 455.450. The surety bond must be in an amount of $100,000 or ten percent of the provider's payments from Medicaid during the immediately preceding 12 months, whichever is greater. The surety bond must name the Department of Human Services as an obligee and must allow for recovery of costs and fees in pursuing a claim on the bond. This paragraph does not apply if the provider currently maintains a surety bond under the requirements in section 256B.0659 or 256B.85.\n(a) The commissioner must collect and retain federally required nonrefundable application fees to pay for provider screening activities in accordance with Code of Federal Regulations, title 42, section 455, subpart E. The enrollment application must be made under the procedures specified by the commissioner, in the form specified by the commissioner, and accompanied by the fee described in paragraph (b), or a request for a hardship exception as described in the specified procedures. The fees must be deposited in the provider screening account in the special revenue fund. Amounts in the provider screening account are appropriated to the commissioner for costs associated with the provider screening activities required in Code of Federal Regulations, title 42, section 455, subpart E.\n(b) The application fee under this subdivision is $532 for the calendar year 2013. For calendar year 2014 and subsequent years, the fee:\n(1) is adjusted by the percentage change to the Consumer Price Index for all urban consumers, United States city average, for the 12-month period ending with June of the previous year. The resulting fee must be announced in the Federal Register;\n(2) is effective from January 1 to December 31 of a calendar year;\n(3) is required on the submission of an initial application, an application to establish a new practice location, an application for reenrollment when the provider is not enrolled at the time of application of reenrollment, or at revalidation when required by federal regulation; and\n(4) must be in the amount in effect for the calendar year during which the application for enrollment, new practice location, or reenrollment is being submitted.\n(c) The fee under this subdivision cannot be charged to:\n(1) providers who are enrolled in Medicare or who provide documentation of payment of the fee to, and enrollment with, another state, unless the commissioner is required to rescreen the provider;\n(2) providers who are enrolled but are required to submit new applications for purposes of reenrollment;\n(3) a provider who enrolls as an individual; and\n(4) group practices and clinics that bill on behalf of individually enrolled providers within the practice who have reassigned their billing privileges to the group practice or clinic.\nThe commissioner shall execute an interagency agreement with the commissioner of corrections to recover the state cost attributable to medical assistance eligibility for inmates of public institutions admitted to a medical institution on an inpatient basis. The annual amount to be transferred from the Department of Corrections under the agreement must include all eligible state medical assistance costs, including administrative costs incurred by the Department of Human Services, attributable to inmates under state and county jurisdiction admitted to medical institutions on an inpatient basis that are related to the implementation of section 256B.055, subdivision 14, paragraph (c).\nThe commissioner shall notify the chairs and ranking minority members of the legislative committees with jurisdiction over medical assistance at least 30 days before submitting a new Medicaid waiver request to the federal government. Prior to submitting any Medicaid waiver request or Medicaid state plan amendment to the federal government for approval, the commissioner shall publish the text of the waiver request or state plan amendment, and a summary of and explanation of the need for the request, on the agency's website and provide a 30-day public comment period. The commissioner shall notify the public of the availability of this information through the agency's electronic subscription service. The commissioner shall consider public comments when preparing the final waiver request or state plan amendment that is to be submitted to the federal government for approval. The commissioner shall also publish on the agency's website notice of any federal decision related to the state request for approval, within 30 days of the decision. This notice must describe any modifications to the state request that have been agreed to by the commissioner as a condition of receiving federal approval.\n(a) The commissioner shall increase medical assistance and MinnesotaCare fee-for-service payments by an amount equal to the tax rate defined for hospitals, surgical centers, or health care providers under sections 295.50 to 295.57 for all services subject to those taxes.\n(b) The commissioner shall reflect in the total payments made to managed care organizations, county-based purchasing plans, and other participating entities contracted with the commissioner under section 256B.69, the cost of: (1) payments made to providers for the tax on the services outlined in paragraph (a); and (2) the taxes imposed under sections 297I.05, subdivision 5, and 256.9657, subdivision 3, on premium revenue paid by the state for medical assistance and the MinnesotaCare program. Any increase based on clause (2) must be reflected in provider rates paid by the managed care organization, county-based purchasing plan, or other participating entity, unless the managed care organization, county-based purchasing plan, or other participating entity is a staff model health plan company.\nAt the time of initial enrollment and at least annually thereafter, the commissioner shall provide information on the medical assistance program for employed persons with disabilities under section 256B.057, subdivision 9, to all medical assistance enrollees who indicate they have a disability.\n(a) The commissioner shall regularly update mailing addresses and other contact information for medical assistance and MinnesotaCare enrollees in cases of returned mail and nonresponse using information available through managed care and county-based purchasing plans, state health and human services programs, and other sources.\n(b) The commissioner shall not disenroll an individual from medical assistance or MinnesotaCare in cases of returned mail until the commissioner makes at least two attempts by phone, email, or other methods to contact the individual. The commissioner may disenroll the individual after providing no less than 30 days for the individual to respond to the most recent contact attempt.",
	"repealed": false
}