{
	"id": "326B.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.081",
	"title": "326B.081 DEFINITIONS.",
	"text": "For purposes of sections 326B.081 to 326B.085, the terms defined in this section have the meanings given them.\n\"Administrative order\" means an order issued under section 326B.082, subdivision 7.\n\"Applicable law\" means the provisions of sections 181.165, 181.722, 181.723, 325E.66, 327.31 to 327.36, this chapter, and chapter 341, and all rules, orders, stipulation agreements, settlements, compliance agreements, licenses, registrations, certificates, and permits adopted, issued, or enforced by the department under sections 181.165, 181.722, 181.723, 325E.66, 327.31 to 327.36, this chapter, or chapter 341.\n\"Document\" or \"documents\" includes papers; books; records; memoranda; data; contracts; drawings; graphs; charts; photographs; digital, video, and audio recordings; records; accounts; files; statements; letters; emails; invoices; bills; notes; and calendars maintained in any form or manner.\n\"Final\" when used to describe any order issued under section 326B.082 means that:\n(1) no request for hearing in connection with the order was filed in the manner and within the time provided by section 326B.082;\n(2) all requests for hearing have been withdrawn;\n(3) an agreement that resolves the order has been signed by all the parties; or\n(4) after the filing of a request for hearing, an order has been issued by the commissioner, the court of appeals, or the supreme court, and all appeals have been pursued or forgone.\n\"Licensing order\" means an order issued under section 326B.082, subdivision 12.\n\"Minimum qualifications\" means the educational, experience, fee, examination, application, and other eligibility requirements that an applicant must meet in order to obtain a license, registration, certificate, or permit under the applicable law. For an applicant that is not an individual, the minimum qualifications include the requirement that an employee or other individual associated with the applicant hold a license.\n\"Stop work order\" means an order issued under section 326B.082, subdivision 10.",
	"repealed": false
}