{
	"id": "52.064",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.064",
	"title": "52.064 RECEIVERSHIP.",
	"text": "A receiver shall take possession and control of all the books, assets, and records of the credit union, which shall not be subject to any levy or attachment, and shall cease or continue cessation of all operations except those which have been authorized by the court. For a period of 90 days after the appointment of the receiver, or such longer time as the court may prescribe, the receiver, the board of directors of the credit union, or any group of 15 members of the credit union may apply to the court for permission to file, and if permitted may file, a plan of reorganization, merger, or consolidation for the credit union. If such plan is approved by the commissioner of commerce and the court, the books, assets, and records of the credit union shall be returned to the members pursuant to the plan, and the receiver shall be discharged.\nIf a plan of reorganization, merger, or consolidation is not submitted during the 90-day period, or such other period allowed by the court, or if any such plan is not approved by the commissioner of commerce and the court, the receiver shall proceed to collect and distribute the assets of the credit union, discharge its debts, and do such other acts required in order to wind up its business, and may sue and be sued for the purpose of enforcing its claims, debts, and obligations until its affairs are completed and the receiver discharged. The receiver shall use the assets of the credit union to pay first, expenses incidental to the receivership and liquidation proceedings; second, any creditors other than depositors; and third, depositors. Assets then remaining shall be distributed to the members proportionately to shares held by each member as of the date the receiver is appointed.\nIf the board of directors of the credit union has made a request to the commissioner of commerce to seek court appointment of the National Credit Union Administration Board as its receiver, and the commissioner elects to seek this appointment, then the board of directors of the credit union may waive the right to apply to the court for permission to file, and the right to file, a plan of reorganization, merger, or consolidation for the credit union within 90 days of the appointment of the receiver under subdivision 1. The board of directors of the credit union may waive this right on behalf of itself, and on behalf of the members of the credit union, when the board of directors of the credit union determines that such action is in the best interests of the credit union and its members, so that the deposit insurer may proceed expeditiously to wind up the affairs of the credit union upon appointment as receiver.",
	"repealed": false
}