{
	"id": "110A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/110A.33",
	"title": "110A.33 WORKS; OWNERSHIP; SALE.",
	"text": "No water supply works owned by the district shall be sold, alienated, or mortgaged by the district, except under the circumstances described by this section.\nIf in the judgment of the board of directors it is for the best interest of the district to sell any portion of the district works not needed for the performance of any outstanding contract, and not mortgaged or pledged as provided for in subdivision 3, the board shall pass a resolution to that effect. The board shall call a special election at which the question of selling the portion of the works shall be submitted to the electors of the district qualified to vote for district directors. The board shall mail to each qualified elector, at the last known place of residence or place of business of the elector, a notice stating the time, place, and purpose of the election, and so far as practicable shall conduct the election in all other respects as provided in section 110A.24. If a majority of all qualified electors of the district vote \"yes,\" the board may sell the portion of the works.\nIf, in order to borrow money from the federal government or from any of its agencies, or from the state, it is necessary that the district mortgage or otherwise pledge any or all of its property to secure the payment of loans made to it, the district may mortgage or pledge property and assets for the purpose. Nothing in this section shall prevent the district from assigning, pledging, or otherwise legally committing its revenues, incomes, receipts, or profits to secure the payment of indebtedness to the federal government or any agency thereof, or the state. The state shall never pledge its credit or funds, or any part thereof, for the payment or settlement of any indebtedness or obligation whatsoever of any district created under the provisions of sections 110A.01 to 110A.36. Nothing in sections 110A.01 to 110A.36 authorizes any agency of the state to make loans to a district, unless the agency is otherwise authorized by law.",
	"repealed": false
}