{
	"id": "306.023",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.023",
	"title": "306.023 UNUSED PUBLIC CEMETERY; TRANSFER TO OPERATING PUBLIC CEMETERY.",
	"text": "A public cemetery association that owns a cemetery in which no interments have been made for 40 years may transfer the cemetery and real estate owned by it, together with funds or property that it possesses, to another public cemetery association or corporation serving the same community in the burial of the dead.\nTo accomplish the transfer, the board of trustees of the transferring cemetery association shall adopt a resolution to that effect by an unanimous vote of the board of trustees. The chair or president of the board of trustees and the secretary may then execute the proper instruments and a deed in the name of the association to evidence the transfer. However, the transfer must first have been authorized by a majority vote of all members of the association, present and voting, at any regular meeting or at any special meeting called for that purpose, after written notice to the members specifying the time, place, and purpose of the meeting.\nIf the association is an unincorporated association, a deed executed in the name of the association by the chair or president and the secretary or treasurer of the board of trustees is a valid conveyance of the lands of the association.\nA public cemetery association or corporation serving the community in the burial of the dead may accept a transfer of a cemetery and its lands, property, and funds. Before a transfer is made, the public cemetery association to which the transfer is being made shall adopt a resolution agreeing to accept the cemetery and its real and personal property and funds and agreeing to operate, maintain, control, and manage the cemetery and administer its property and funds in the name of, and in accordance with the rules and laws governing the accepting public cemetery association.\nAfter transfer, lot owners of the former association continue their ownership. They are entitled to the same rights and privileges with respect to their lots accorded to lot owners by the public cemetery association to which the transfer was made and are thereafter subject to all the rules and laws governing the public cemetery association.",
	"repealed": false
}