{
	"id": "355.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/355.095",
	"title": "355.095 OPTIONAL MEDICARE COVERAGE FOR CERTAIN PUBLIC EMPLOYEES.",
	"text": "(a) The director, on behalf of the state, its political subdivisions, and its other governmental employers, is authorized to enter into an agreement with the Secretary of Health and Human Services to extend the provisions of United States Code, title 42, section 426, 426-1, and 1395c, to the employees in paragraph (b) who meet the requirements of United States Code, title 42, section 418(v)(2) and who do not have coverage by the federal old age, survivors, and disability insurance program for that employment under any previous modification of the agreement or previous Medicare referendum.\n(b) The applicable employees are:\n(1) employees who are members of one of the retirement plans in Minnesota Statutes 2008, section 356.30, subdivision 3, except clauses (4) and (7), based on continuous employment since March 31, 1986; and\n(2) employees of a special authority or district who have been continuously employed by the special authority or district since March 31, 1986.\n(a) Each local governmental subdivision or special authority or district desiring inclusion in the state Social Security agreement under subdivision 1 must request such coverage by submitting a formal resolution to the director, including a specification therein of the desired starting date for Social Security coverage.\n(b) The director shall authorize a referendum on the question of extending the provisions of United States Code, title 42, sections 426, 426-1, and 1395c. The director shall supervise the referendum in accordance with the requirements of United States Code, title 42, section 418, on the date or dates set. The cost of the referendum must be borne by the requesting retirement plan, or the requesting special authority or district. The notice of the referendum provided to each eligible employee must contain a statement sufficient to inform the person of the rights available as an employee in Medicare qualified government employment and the employee contribution rates applicable to the program. The referendum must permit each eligible employee the opportunity to vote in the referendum in accordance with the requirements in the Social Security Act. The director, on receiving satisfactory evidence that the conditions specified in United States Code, title 42, section 418(d)(7) have been met, must so certify to the Secretary of Health and Human Services.\nEmployers must pay the necessary employer contributions and make the necessary deductions from salary for employees who elect to participate in the federal Medicare program under this section and as required by federal law.\nAn individual who obtains Medicare coverage through the referendum under subdivision 2 may obtain retroactive coverage for the period specified in the modification of the agreement if employed by the governmental subdivision or by the special authority or district on the date of the modification of the agreement. The individual must pay an amount equal to the Medicare taxes which would have been imposed on the employee had the service been covered at the time performed. The employing local governmental subdivision or special authority or district must pay the necessary employer contributions for the retroactive Medicare coverage period. Nothing in this section shall require an employee or elected official to elect retroactive Medicare coverage.",
	"repealed": false
}