{
	"id": "273.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.01",
	"title": "273.01 LISTING AND ASSESSMENT, TIME.",
	"text": "All real property subject to taxation shall be listed and at least one-fifth of the parcels listed shall be appraised each year with reference to their value on January 2 preceding the assessment so that each parcel shall be reappraised at maximum intervals of five years. All real property becoming taxable in any year shall be listed with reference to its value on January 2 of that year. Except as provided in this section and section 274.01, subdivision 1, all real property assessments shall be completed two weeks prior to the date scheduled for the local board of review or equalization. No changes in valuation or classification which are intended to correct errors in judgment by the county assessor may be made by the county assessor after the board of review or the county board of equalization has adjourned; however, corrections of errors for real or personal property that are merely clerical in nature or changes that extend homestead treatment to property are permitted after adjournment until the tax extension date for that assessment year. Any changes made by the assessor after adjournment must be fully documented and maintained in a file in the assessor's office and shall be available for review by any person. A copy of any changes made during this period shall be sent to the county board no later than December 31 of the assessment year. In the event a valuation and classification is not placed on any real property by the dates scheduled for the local board of review or equalization the valuation and classification determined in the preceding assessment shall be continued in effect and the provisions of section 273.13 shall, in such case, not be applicable, except with respect to real estate which has been constructed since the previous assessment. Real property containing iron ore, the fee to which is owned by the state of Minnesota, shall, if leased by the state after January 2 in any year, be subject to assessment for that year on the value of any iron ore removed under said lease prior to January 2 of the following year. Personal property subject to taxation shall be listed and assessed annually with reference to its value on January 2; and, if acquired on that day, shall be listed by or for the person acquiring it.",
	"repealed": false
}