{
	"id": "115A.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.175",
	"title": "115A.175 SITING AND FACILITY DEVELOPMENT AUTHORITY; LIMITATIONS.",
	"text": "The agency shall terminate all activity under sections 115A.18 to 115A.30 relating to the selection and evaluation of sites for hazardous waste facilities, except as provided in this section.\nAll candidate sites remaining under Minnesota Statutes 1996, section 115A.21, subdivision 1, are dismissed from further consideration as candidate sites for hazardous waste facilities.\nThe agency shall proceed with site evaluation and selection in accordance with sections 115A.191 to 115A.194. In evaluating and selecting sites under sections 115A.191 to 115A.194, the agency shall act in accordance with sections 115A.18 to 115A.20, except as otherwise provided in sections 115A.191 to 115A.194.\n(a) No facility may be sited under sections 115A.18 to 115A.30 except a stabilization and containment facility. The facility must be above grade unless the agency determines, after environmental review under section 115A.194, subdivision 2, that an alternative design would provide greater protection for human health and the environment. No waste may be accepted for containment at the facility except the following:\n(1) waste rendered nonhazardous;\n(2) industrial waste; and\n(3) waste that is not eligible for acceptance under clause (1) or (2), if the agency determines that all of the following requirements are met:\n(i) there is no feasible and prudent alternative to containment of the waste that would minimize adverse impact upon human health and the environment;\n(ii) the waste has been treated using feasible and prudent technology that minimizes the possibility of migration of any hazardous constituents of the waste; and\n(iii) the waste meets the standards adopted to protect human health and the environment under the authority of United States Code, title 42, section 6924(m), and any additional protective standards adopted by the agency under section 116.07, subdivision 4.\n(b) If no federal or state standards have been adopted for a waste as provided in paragraph (a), clause (3), item (iii), the waste may not be accepted for containment.\n(c) A person proposing a waste for containment at the facility has the burden of demonstrating that the waste may be accepted under the requirements of this subdivision. The demonstration under paragraph (a), clause (3), must document in a form satisfactory to the agency the manner in which the person has attempted to meet the standard for acceptance of the waste under paragraph (a), clause (1), and the characteristics of the waste that prevent compliance with that standard.\nThe agency shall adopt rules under chapter 14 establishing procedures by which a person must demonstrate that a hazardous waste can be accepted by the facility as provided in subdivision 4. The agency shall adopt all rules necessary to implement the provisions of subdivision 4 and this subdivision before granting any permit for operation of the facility.",
	"repealed": false
}