{
	"id": "609.1095",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.1095",
	"title": "609.1095 INCREASED SENTENCES FOR CERTAIN DANGEROUS AND REPEAT FELONY OFFENDERS.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Conviction\" means any of the following accepted and recorded by the court: a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by the court. The term includes a conviction by any court in Minnesota or another jurisdiction.\n(c) \"Prior conviction\" means a conviction that occurred before the offender committed the next felony resulting in a conviction and before the offense for which the offender is being sentenced under this section.\n(d) \"Violent crime\" means a violation of or an attempt or conspiracy to violate any of the following laws of this state or any similar laws of the United States or any other state: sections 152.137; 609.165; 609.185; 609.19; 609.195; 609.20; 609.205; 609.2112; 609.2113; 609.2114; 609.221; 609.222; 609.223; 609.228; 609.235; 609.24; 609.245; 609.247; 609.25; 609.255; 609.2661; 609.2662; 609.2663; 609.2664; 609.2665; 609.267; 609.2671; 609.268; 609.322; 609.342; 609.343; 609.344; 609.345; 609.498, subdivision 1 or 1b; 609.561; 609.562; 609.582, subdivision 1; 609.66, subdivision 1e; 609.687; and 609.855, subdivision 5; any provision of sections 609.229; 609.377; 609.378; 609.749; and 624.713 that is punishable by a felony penalty; or any provision of chapter 152 that is punishable by a maximum sentence of 15 years or more; or Minnesota Statutes 2012, section 609.21.\nWhenever a person is convicted of a violent crime that is a felony, and the judge is imposing an executed sentence based on a Sentencing Guidelines presumptive imprisonment sentence, the judge may impose an aggravated durational departure from the presumptive imprisonment sentence up to the statutory maximum sentence if the offender was at least 18 years old at the time the felony was committed, and:\n(1) the court determines on the record at the time of sentencing that the offender has two or more prior convictions for violent crimes; and\n(2) the fact finder determines that the offender is a danger to public safety. The fact finder may base its determination that the offender is a danger to public safety on the following factors:\n(i) the offender's past criminal behavior, such as the offender's high frequency rate of criminal activity or juvenile adjudications, or long involvement in criminal activity including juvenile adjudications; or\n(ii) the fact that the present offense of conviction involved an aggravating factor that would justify a durational departure under the Sentencing Guidelines.\n(a) Unless a longer mandatory minimum sentence is otherwise required by law or the court imposes a longer aggravated durational departure under subdivision 2, a person who is convicted of a violent crime that is a felony must be committed to the commissioner of corrections for a mandatory sentence of at least the length of the presumptive sentence under the Sentencing Guidelines if the court determines on the record at the time of sentencing that the person has two or more prior felony convictions for violent crimes. The court shall impose and execute the prison sentence regardless of whether the guidelines presume an executed prison sentence.\nAny person convicted and sentenced as required by this subdivision is not eligible for probation, parole, discharge, or work release, until that person has served the full term of imprisonment imposed by the court, notwithstanding sections 241.26, 242.19, 243.05, 244.04, 609.12, and 609.135.\n(b) For purposes of this subdivision, \"violent crime\" does not include a violation of section 152.023 or 152.024.\nWhenever a person is convicted of a felony, and the judge is imposing an executed sentence based on a Sentencing Guidelines presumptive imprisonment sentence, the judge may impose an aggravated durational departure from the presumptive sentence up to the statutory maximum sentence if the factfinder determines that the offender has five or more prior felony convictions and that the present offense is a felony that was committed as part of a pattern of criminal conduct.",
	"repealed": false
}