{
	"id": "203B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.11",
	"title": "203B.11 HOSPITAL PATIENTS AND RESIDENTS OF HEALTH CARE FACILITIES.",
	"text": "(a) Each full-time municipal clerk or school district clerk who has authority under section 203B.05 to administer absentee voting laws must designate election judges to deliver absentee ballots in accordance with this section. The county auditor must also designate election judges to perform the duties in this section. A ballot may be delivered only to an eligible voter who is a temporary or permanent resident or patient in one of the following facilities located in the municipality in which the voter maintains residence: a health care facility, hospital, or veterans home operated by the board of directors of the Minnesota veterans homes under chapter 198. The ballots must be delivered by two election judges, each of whom is affiliated with a different major political party. When the election judges deliver or return ballots as provided in this section, they must travel together in the same vehicle. Both election judges must be present when an applicant completes the certificate of eligibility and marks the absentee ballots, and may assist an applicant as provided in section 204C.15. The election judges must deposit the return envelopes containing the marked absentee ballots in a sealed container and return them to the clerk on the same day that they are delivered and marked.\n(b) At the discretion of a full-time municipal clerk, school district clerk, or county auditor, absentee ballots may be delivered in the same manner as prescribed in paragraph (a) to a shelter for battered women as defined in section 611A.37, subdivision 4, or to an assisted living facility licensed under chapter 144G.\nDuring the 35 days preceding an election, the election judges must deliver absentee ballots only to an eligible voter who has applied for absentee ballots to the county auditor or municipal clerk under section 203B.04, subdivision 1.\nOn election day, the election judges shall deliver absentee ballots only to an eligible voter who on the day before the election became a resident or patient in a health care facility or hospital and who has applied for absentee ballots under section 203B.04, subdivision 2.\nDuring the seven days preceding an election and until 8:00 p.m. on election day, an eligible voter who would have difficulty getting to the polls because of incapacitating health reasons, or who is disabled, or who is a patient of a health care facility, a resident of an assisted living facility licensed under chapter 144G, a participant in a residential program for adults licensed under section 245A.02, subdivision 14, or a resident of a shelter for battered women as defined in section 611A.37, subdivision 4, may designate an agent to deliver the ballots to the voter from the county auditor or municipal clerk. An agent must have a preexisting relationship with the voter. A candidate at the election may not be designated as an agent. The voted ballots must be returned to the county auditor or municipal clerk no later than 8:00 p.m. on election day. The voter must complete an affidavit requesting the auditor or clerk to provide the agent with the ballots in a sealed transmittal envelope. The affidavit must include a statement from the voter stating that the ballots were delivered to the voter by the agent in the sealed transmittal envelope. An agent may deliver ballots to no more than three persons in any election. The secretary of state shall provide samples of the affidavit and transmission envelope for use by the county auditors.",
	"repealed": false
}