{
	"id": "116J.0124",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.0124",
	"title": "116J.0124 PLAIN LANGUAGE IN WRITTEN MATERIALS.",
	"text": "(a) To the extent reasonable and consistent with the goals of providing easily understandable and readable materials and complying with federal and state laws governing the programs, all written materials relating to services and determinations of eligibility for or amounts of benefits that will be given to applicants for or recipients of assistance under a program administered or supervised by the commissioner of employment and economic development must be understandable to a person of average intelligence and education.\n(b) All written materials relating to determinations of eligibility for or amounts of benefits that will be given to applicants for or recipients of assistance under programs administered or supervised by the commissioner of employment and economic development must be developed to satisfy the plain language requirements of the Plain Language Contract Act under sections 325G.29 to 325G.36. Materials may be submitted to the attorney general for review and certification. Regardless of section 325G.35, subdivision 1, the attorney general shall review submitted materials to determine whether they comply with the requirements of section 325G.31. The remedies available pursuant to sections 8.31 and 325G.33 to 325G.36 do not apply to these materials. Failure to comply with this section does not provide a basis for suspending the implementation or operation of other laws governing programs administered by the commissioner.\n(c) The requirements of this section apply to all materials modified or developed by the commissioner on or after July 1, 1988. The requirements of this section do not apply to materials that must be submitted to a federal agency for approval, to the extent that application of the requirements prevents federal approval.\n(d) Nothing in this section may be construed to prohibit a lawsuit brought to require the commissioner to comply with this section.",
	"repealed": false
}