{
	"id": "273.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.19",
	"title": "273.19 LESSEES AND EQUITABLE OWNERS.",
	"text": "Except as provided in subdivision 3 or 4, tax-exempt property held under a lease for a term of at least one year, and not taxable under section 272.01, subdivision 2, or under a contract for the purchase thereof, shall be considered, for all purposes of taxation, as the property of the person holding it. In this subdivision, \"tax-exempt property\" means property owned by the United States, the state or any of its political subdivisions, a school, or any religious, scientific, or benevolent society or institution, incorporated or unincorporated, or any corporation whose property is not taxed in the same manner as other property. This subdivision does not apply to property exempt from taxation under section 272.01, subdivision 2, paragraph (b), clauses (2), (3), and (4), or to property exempt from taxation under section 272.0213.\nFor purposes of this section, a lease includes any agreement, except a cooperative farming agreement pursuant to section 97A.135, subdivision 3, or a lease executed pursuant to section 272.68, subdivision 4, permitting a nonexempt person or entity to use the property, regardless of whether the agreement is characterized as a lease. A lease has a \"term of at least one year\" if the term is for a period of less than one year and the lease permits the parties to renew the lease without requiring that similar terms for leasing the property will be offered to other applicants or bidders through a competitive bidding or other form of offer to potential lessees or users.\nThe provisions of subdivision 1 shall not apply to any property owned by a seaway port authority exempt from taxation under the provisions of section 272.01, subdivision 3.\nThe net tax capacity of property held under a lease for a term of at least one year which (i) is located within a federal reservation; (ii) has been conveyed to the state of Minnesota by the federal government; and (iii) had been occupied and used by a branch of the armed services of the United States, shall be no greater than the value added to the property by improvements to the property made by the lessee.\nProperty held under a lease for a term of at least one year which is owned by the United States and located within a national park shall be exempt, provided the property was acquired by the United States by condemnation or purchased by the United States under threat of condemnation, and within a reasonable time leased back for noncommercial residential purposes to the person owning the property at the time of acquisition by the United States. If property exempt under this subdivision is subsequently leased or subleased for a term of at least one year to another person, it shall no longer qualify for the exemption provided in this subdivision and shall be placed on the assessment rolls as provided in section 272.02, subdivision 38, and taxed pursuant to subdivision 1 of this section.\nThe value of improvements made to property otherwise exempt pursuant to this subdivision which are owned by the lessee or to which the lessee has salvage rights shall be taxable to the lessee pursuant to subdivision 1.\nMS 2004 [Repealed, 2005 c 151 art 5 s 46]",
	"repealed": false
}