{
	"id": "299F.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.011",
	"title": "299F.011 STATE FIRE CODE; ADMINISTRATION AND ENFORCEMENT.",
	"text": "MS 2006 [Renumbered 326B.02, subd 6]\n[Repealed, 1981 c 106 s 16]\nThe commissioner of public safety shall adopt rules as may be necessary to administer and enforce the code, specifically including but not limited to rules for inspection of buildings and other structures covered by the code and conforming the code to the governmental organization of Minnesota state agencies, political subdivisions and local governments.\nThe State Fire Code shall be applicable throughout the state and in all political subdivisions and municipalities therein. However, nothing in this subdivision shall prohibit a local unit of government otherwise authorized by law from adopting or enforcing any ordinance or regulation which specifies requirements equal to, in addition to, or more stringent than the requirements of the State Fire Code. Any ordinance or regulation adopted by a local unit which differs from the State Fire Code must be directly related to the safeguarding of life and property from the hazards of fire, must be uniform for each class or kind of building covered, and may not exceed the applicable requirements of the State Building Code adopted pursuant to sections 326B.101 to 326B.151.\n(a) Notwithstanding any contrary provision of this section, the fire marshal shall not adopt or enforce a rule:\n(1) establishing staff ratios, age distribution requirements, and limitations on the number of children in care;\n(2) regulating the means of egress from family or group family day care homes in addition to the egress rules that apply to the home as a single family dwelling; or\n(3) confining family or group family day care home activities to the floor of exit discharge.\n(b) For purposes of this subdivision, \"family or group family day care home\" means a dwelling unit in which the day care provider provides the services referred to in section 142B.01, subdivision 18, to one or more persons.\n(c) Nothing in this subdivision prohibits the Department of Children, Youth, and Families from adopting or enforcing rules regulating day care, including the subjects in paragraph (a), clauses (1) and (3). The department may not, however, adopt or enforce a rule stricter than paragraph (a), clause (2).\n(d) The Department of Human Services may by rule adopt procedures for requesting the state fire marshal or a local fire marshal to conduct an inspection of day care homes to ensure compliance with state or local fire codes.\n(e) The commissioners of public safety and human services may enter into an agreement for the commissioner of human services to perform follow-up inspections of programs, subject to licensure under chapter 245A, to determine whether certain violations cited by the state fire marshal have been corrected. The agreement shall identify specific items the commissioner of human services is permitted to inspect. The list of items is not subject to rulemaking and may be changed by mutual agreement between the state fire marshal and the commissioner. The agreement shall provide for training of individuals who will conduct follow-up inspections. The agreement shall contain procedures for the commissioner of human services to follow when the commissioner requires assistance from the state fire marshal to carry out the duties of the agreement.\n(f) No tort liability is transferred to the commissioner of human services as a result of the commissioner of human services performing activities within the limits of the agreement.\nThe State Fire Code shall not require stairways of existing multiple dwelling buildings of two stories or less to be enclosed. For the purposes of this subdivision the term \"stories\" has the meaning given it in the State Building Code.\n[Repealed, 2005 c 136 art 9 s 15]\nUpon application, the state fire marshal may grant variances from the minimum requirements specified in the code if there is substantial compliance with the provisions of the code, the safety of the public and occupants of such building will not be jeopardized, and undue hardship will result to the applicant unless such variance is granted. No appeal to the state fire marshal for a variance from orders issued by a local fire official from the State Fire Code shall be accepted until the applicant has first made application to the local governing body and the local unit has acted on the application. The state fire marshal shall consider any decisions or recommendations of the local governing body. Any person aggrieved by a decision made by the fire marshal under this subdivision may proceed before the fire marshal as with a contested case in accordance with the Administrative Procedure Act.\nLocal governing bodies may appoint boards of appeal to hear and rule on appeals from orders issued under the fire code. An appeal from a local board of appeal may be made to the local governing body. If a board of appeal is not appointed, the appeals of orders must be made directly to the governing body. Local boards of appeal and governing bodies are not liable for damages in connection with granting variances, abatements, denials, or modifications of orders from the fire code that are made in good faith.\nWhen considering appeals for variances from the fire code, the local appeal board or governing body, the state fire marshal, a state administrative law judge, and a court shall take into consideration the benefit to be obtained by complying with the fire marshal's orders and the effect on affordable housing, provided that the spirit of the code is complied with and public safety secured.\nA person who violates a provision of the State Fire Code shall be guilty of a misdemeanor. No person shall be convicted for violating the State Fire Code unless the person shall have been given notice of the violation in writing and reasonable time to comply. The notice must contain a statement explaining the right to appeal the orders.\nThe state fire marshal shall charge a fee of $100 for each plan review involving:\n(1) flammable liquids;\n(2) motor vehicle fuel-dispensing stations; or\n(3) liquefied petroleum gases.",
	"repealed": false
}