{
	"id": "115B.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.25",
	"title": "115B.25 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 115B.25 to 115B.37.\nExcept when another fund or account is specified, \"fund\" means the remediation fund established in section 116.155.\n\"Agency\" means the Pollution Control Agency.\n\"Compensable loss\" means a loss that is compensable under section 115B.34.\n\"Eligible person\" means a person who is eligible to file a claim with the fund under section 115B.29.\n\"Eligible personal injury\" means personal injury that is eligible for compensation under section 115B.30.\n\"Eligible property damage\" means property damage that is eligible for compensation under section 115B.30.\n\"Facility\" has the meaning given it in section 115B.02, subdivision 5.\n[Renumbered subd 1a]\n\"Harmful substance\" means:\n(1) any commercial chemical designated under the Federal Water Pollution Control Act, United States Code, title 33, section 1321(b)(2)(A);\n(2) any hazardous air pollutant listed under the Clean Air Act, United States Code, title 42, section 7412;\n(3) any hazardous waste;\n(4) petroleum as defined in section 115C.02, subdivision 10; and\n(5) pesticide as defined in chapter 18B, or fertilizer, plant amendment, or soil amendment as defined in chapter 18C.\n\"Hazardous waste\" has the meaning given in section 115B.02, subdivision 9.\n\"Person\" has the meaning given in section 115B.02, subdivision 12.\n\"Protected information\" means information provided to the agency by a nongovernmental third party, or information provided to the agency by a governmental party if access to that information is protected under other law, that is relevant to a determination required of the agency under section 115B.33, subdivisions 1, clauses (2) to (4), and 2, clause (2).\n(a) \"Release\" means any spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, escaping, leaching, dumping, or disposing into the environment which occurred at a point in time or which continues to occur.\n(b) \"Release\" does not include:\n(1) emissions from the engine exhaust of a motor vehicle, rolling stock, aircraft, watercraft, or pipeline pumping station engine;\n(2) release of source, by-product, or special nuclear material from a nuclear incident, as those terms are defined in the Atomic Energy Act of 1954, under United States Code, title 42, section 2014, if the release is subject to requirements with respect to financial protection established by the federal Nuclear Regulatory Commission under United States Code, title 42, section 2210;\n(3) release of source, by-product, or special nuclear material from any processing site designated pursuant to the Uranium Mill Tailings Radiation Control Act of 1978, under United States Code, title 42, section 7912(a)(1) or 7942(a);\n(4) discharges or designed venting of petroleum from a tank allowed under the rules of the Pollution Control Agency; or\n(5) the use of a pesticide, fertilizer, plant amendment, or soil amendment in accordance with its labeling.",
	"repealed": false
}