{
	"id": "469.1814",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1814",
	"title": "469.1814 BONDING AUTHORITY.",
	"text": "A political subdivision may issue bonds or other obligations to provide an amount equal to the sum of the abatements granted for a property under section 469.1813. The maximum principal amount of these bonds may not exceed the estimated sum of the abatements for the property for the years authorized. The bonds may be general obligations of the political subdivision if the governing body of the political subdivision elects to pledge the full faith and credit of the subdivision in the resolution issuing the bonds.\nChapter 475 applies to the obligations authorized by this section, except bonds are excluded from the calculation of the net debt limit.\nIf two or more political subdivisions decide to grant abatements for the same property, the municipality in which the property is located may issue bonds to provide an amount equal to the sum of the abatements for each of the jurisdictions that agrees. The governing body of each of the other jurisdictions must guarantee and pledge to pay annually to the municipality the amount of the abatement. This pledge and guarantee is a binding obligation of the political subdivision and must be included in the abatement resolution.\nIf bonds are issued to provide advance payment of abatements under this section, the amount of abatement is not subject to periodic review by the political subdivision under section 469.1813, subdivision 7.\nThe proceeds of bonds issued under this section may be used to (1) pay for public improvements that benefit the property, (2) to acquire and convey land or other property, as provided under this section, (3) to reimburse the property owner for the cost of improvements made to the property, or (4) to pay the costs of issuance of the bonds.\n(a) This subdivision applies only to abatements pledged to pay preexisting obligations.\n(b) For purposes of this subdivision, \"preexisting obligation\" means a bond or binding contract that:\n(1) was issued or approved before August 1, 2001;\n(2) is secured by abatements approved before August 1, 2001; and\n(3) is not a general obligation.\n(c) If a political subdivision granted an abatement pledged to pay a preexisting obligation and if the changes in the property tax classification rates enacted in calendar year 2001 reduce the abatement by an amount sufficient to prevent payment in full of the preexisting obligation, the political subdivision may add to its levy under section 469.1815 an amount sufficient to provide an abatement equal to the least of:\n(1) the amount of the abatement using the political subdivision's tax rate for the current year and the classification rates for property taxes payable in 2001;\n(2) the amount required to pay the amount due on the preexisting obligation for the year from the political subdivision; or\n(3) the maximum dollar amount of the political subdivision's abatement, if any, under the abatement resolution.",
	"repealed": false
}