{
	"id": "144.0756",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0756",
	"title": "144.0756 AFRICAN AMERICAN HEALTH SPECIAL EMPHASIS GRANT PROGRAM.",
	"text": "The commissioner of health shall establish the African American health special emphasis grant program administered by the Office of African American Health. The purposes of the program are to:\n(1) identify disparities impacting African American health arising from cumulative and historical discrimination and disadvantages in multiple systems, including but not limited to housing, education, employment, gun violence, incarceration, environmental factors, and health care discrimination; and\n(2) develop community-based solutions that incorporate a multisector approach to addressing identified disparities impacting African American health.\nAs directed by the commissioner of health, the Office of African American Health shall:\n(1) develop a request for proposals for an African American health special emphasis grant program in consultation with community stakeholders;\n(2) provide outreach, technical assistance, and program development guidance to potential qualifying organizations or entities;\n(3) review responses to requests for proposals in consultation with community stakeholders and award grants under this section;\n(4) establish a transparent and objective accountability process in consultation with community stakeholders, focused on outcomes that grantees agree to achieve;\n(5) provide grantees with access to summary and other public data to assist grantees in establishing and implementing effective community-led solutions; and\n(6) collect and maintain data on outcomes reported by grantees.\nOrganizations eligible to receive grant funding under this section include nonprofit organizations or entities that work with African American communities or are focused on addressing disparities impacting the health of African American communities.\nIn developing the requests for proposals and awarding the grants, the commissioner and the Office of African American Health shall consider building upon the existing capacity of communities and on developing capacity where it is lacking. Proposals shall focus on addressing health equity issues specific to United States-born African American communities; addressing the health impact of historical trauma; reducing health disparities experienced by United States-born African American communities; and incorporating a multisector approach to addressing identified disparities.\nGrantees must report grant program outcomes to the commissioner on the forms and according to timelines established by the commissioner.",
	"repealed": false
}