{
	"id": "626.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.14",
	"title": "626.14 TIME AND MANNER OF SERVICE; NO-KNOCK SEARCH WARRANTS.",
	"text": "A search warrant may be served only between the hours of 7:00 a.m. and 8:00 p.m. unless the court determines on the basis of facts stated in the affidavits that a nighttime search outside those hours is necessary to prevent the loss, destruction, or removal of the objects of the search or to protect the searchers or the public. The search warrant shall state that it may be served only between the hours of 7:00 a.m. and 8:00 p.m. unless a nighttime search outside those hours is authorized.\nFor the purposes of this section, \"no-knock search warrant\" means a search warrant authorizing peace officers to enter certain premises without first loudly and understandably announcing the officer's presence or purpose and waiting an objectively reasonable amount of time thereafter for the occupant to comply, based on a totality of the circumstances, prior to entering the premises.\nA court may not issue or approve a no-knock search warrant unless the judge determines that the applicant has articulated specific, objective facts that establish probable cause for belief that:\n(1) the search cannot be executed while the premises is unoccupied; and\n(2) the occupant or occupants in the premises present an imminent threat of death or great bodily harm to the officers executing the warrant or other persons.\n(a) No peace officer shall seek a no-knock search warrant unless the warrant application includes at a minimum:\n(1) all documentation and materials the issuing court requires;\n(2) the information specified in paragraph (b); and\n(3) a sworn affidavit as provided in section 626.08.\n(b) Each warrant application seeking a no-knock entry must include, in detailed terms, the following:\n(1) why peace officers are seeking the use of a no-knock entry and are unable to detain the suspect or search the premises safely through the use of a knock and announce warrant;\n(2) what investigative activities have taken place to support issuance of the no-knock search warrant, or why no investigative activity is needed or able to be performed;\n(3) the known or suspected occupant or occupants of the premises, including the number of occupants under age 18; and\n(4) whether the warrant can be effectively executed during daylight hours according to subdivision 1.\n(c) The chief law enforcement officer or designee and another superior officer must review and approve each warrant application. The agency must document the approval of both reviewing parties.\n(d) A no-knock search warrant shall not be issued when the only crime alleged is possession of a controlled substance unless there is probable cause to believe that the controlled substance is for other than personal use.\n(a) Law enforcement agencies shall report to the commissioner of public safety regarding the use of no-knock search warrants in a format prescribed by the commissioner. An agency must report the use of a no-knock search warrant to the commissioner no later than three months after the date the warrant was issued. The report shall include the following information:\n(1) the number of no-knock search warrants requested;\n(2) the number of no-knock search warrants the court issued;\n(3) the number of no-knock search warrants executed;\n(4) the number of injuries and fatalities suffered, if any, by peace officers and by civilians in the execution of no-knock search warrants; and\n(5) any other information the commissioner requests.\n(b) The commissioner of public safety shall report the information provided under paragraph (a) annually to the chairs and ranking minority members of the legislative committees with jurisdiction over public safety.",
	"repealed": false
}