{
	"id": "326B.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.16",
	"title": "326B.16 ENFORCEMENT OF REQUIREMENTS FOR PERSONS WITH DISABILITIES.",
	"text": "The State Building Code's requirements for persons with disabilities apply statewide. A statutory or home rule charter city that does not have in effect an ordinance adopting the State Building Code is responsible for enforcement in the city of the State Building Code's requirements for persons with disabilities. In all other areas where there is no ordinance in effect adopting the State Building Code, the county is responsible for enforcement of the State Building Code's requirements for persons with disabilities.\nMunicipalities which have not adopted the State Building Code shall enforce the State Building Code's requirements for persons with disabilities by: (1) entering into a joint powers agreement for enforcement with another municipality which has adopted the State Building Code; (2) contracting for enforcement with an individual certified under section 326B.133, subdivision 3, to enforce the State Building Code; or (3) hiring or training their own staff.\nMunicipalities shall fulfill code responsibilities including duties and responsibilities for code administration, plan review, and inspection in accordance with the procedures established in the State Building Code.\nIf the commissioner determines that a municipality is not properly administering and enforcing the State Building Code's requirements for persons with disabilities, the commissioner may have the administration and enforcement in the involved municipality undertaken by the state building official or by another building official certified by the state. The commissioner shall notify the affected municipality in writing immediately upon making the determination, and the municipality may challenge the determination as a contested case before the commissioner pursuant to the Administrative Procedure Act. The commissioner shall charge the fees set by section 326B.153 for the administration and enforcement service rendered. Any cost to the state arising from the state administration and enforcement of the State Building Code shall be borne by the subject municipality.",
	"repealed": false
}