{
	"id": "115E.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.042",
	"title": "115E.042 PREPAREDNESS AND RESPONSE FOR CERTAIN RAILROADS.",
	"text": "In addition to the requirements of section 115E.04, a person who owns or operates railroad car rolling stock transporting a unit train must comply with this section.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Exercise\" means an activity or training to evaluate responsibilities, roles, and response plans for the discharge of oil or hazardous substances and includes but is not limited to walkthroughs, tabletop exercises, or functional exercises.\n(c) \"Full-scale exercise\" means training activities to evaluate responsibilities, roles, and response plans for a confirmed discharge or worst-case discharge of oil or hazardous substances and includes utilizing, as much as practicable, the equipment, personnel, and coordinated resources required under subdivision 4.\n(d) \"Functional exercise\" means a guided session where a simulated operational environment trains and evaluates specific personnel, procedures, or resources on scenarios relating to the discharge of oil or hazardous substances.\n(e) \"Tabletop exercise\" means a guided session where the discussion addresses topics, including but not limited to the roles and responsibilities of a rail carrier and its personnel in response to a confirmed discharge of oil or hazardous substances.\n(f) \"Walkthrough\" means drills and training designed to familiarize railroad personnel with the response plans required under this chapter and the response requirements to a confirmed discharge under this section.\n[Renumbered 219.055, subd 2a]\n[Renumbered, 219.055, subd 3a]\n(a) Following confirmation of a discharge, a railroad must deliver and deploy sufficient equipment and trained personnel to (1) contain and recover discharged oil or other hazardous substances, (2) protect the environment, and (3) assist local public safety officials. Within 15 minutes of a rail incident involving a confirmed discharge or release of oil or other hazardous substances, a railroad must contact the applicable emergency manager and applicable fire department, through the local public safety answering point, having jurisdiction along the route where the incident occurred. After learning of the rail incident involving oil or other hazardous substances, the applicable emergency manager and applicable fire department must, as soon as practicable, identify and provide contact information of the responsible incident commander to the reporting railroad.\n(b) Within 15 minutes of local emergency responder arrival on the scene of a rail incident involving oil or other hazardous substances, a railroad must assist the incident commander to determine the nature of any hazardous substance known to have been released and hazardous substance cargo transported on the train. Assistance must include providing information that identifies the chemical content of the hazardous substance, contact information for the shipper, and instructions for dealing with the release of the material. A railroad may provide information on the hazardous substances transported on the train through the train orders on board the train or by facsimile or electronic transmission.\n(c) Within one hour of confirmation of a discharge, a railroad must provide a qualified company representative to advise the incident commander, assist in assessing the situation, initiate railroad response actions as needed, and provide advice and recommendations to the incident commander regarding the response. The representative may be made available by telephone, and must be authorized to deploy all necessary response resources of the railroad.\n(d) Within three hours of confirmation of a discharge, a railroad must be capable of delivering monitoring equipment and a trained operator to assist in protection of responder and public safety. A plan to ensure delivery of monitoring equipment and an operator to a discharge site must be provided each year to the commissioner of public safety.\n(e) Within three hours of confirmation of a discharge, a railroad must provide (1) qualified personnel at a discharge site to assess the discharge and to advise the incident commander, and (2) resources to assist the incident commander with ongoing public safety and scene stabilization.\n(f) A railroad must be capable of deploying containment boom from land across sewer outfalls, creeks, ditches, and other places where oil or other hazardous substances may drain, in order to contain leaked material before it reaches those resources. The arrangement to provide containment boom and staff may be made by:\n(1) training and caching equipment with local jurisdictions;\n(2) training and caching equipment with a fire mutual-aid group;\n(3) means of an industry cooperative or mutual-aid group;\n(4) deployment of a contractor;\n(5) deployment of a response organization under state contract; or\n(6) other dependable means acceptable to the Pollution Control Agency.\n(g) Each arrangement under paragraph (f) must be confirmed each year. Each arrangement must be tested by drill at least once every five years.\n(h) Within eight hours of confirmation of a discharge, a railroad must be capable of delivering and deploying containment boom, boats, oil recovery equipment, trained staff, and all other materials needed to provide:\n(1) on-site containment and recovery of a volume of oil equal to ten percent of the calculated worst case discharge at any location along the route; and\n(2) protection of listed sensitive areas and potable water intakes within one mile of a discharge site and within eight hours of water travel time downstream in any river or stream that the right-of-way intersects.\n(i) Within 60 hours of confirmation of a discharge, a railroad must be capable of delivering and deploying additional containment boom, boats, oil recovery equipment, trained staff, and all other materials needed to provide containment and recovery of a worst case discharge and to protect listed sensitive areas and potable water intakes at any location along the route.\n(a) Each railroad operating unit trains in Minnesota must conduct at least one oil containment, recovery, and sensitive area protection walkthrough, tabletop exercise, or functional exercise involving oil or hazardous substances every year. Subject to the provisions of paragraph (c), each exercise must be at a location and time chosen by the Pollution Control Agency, and attended by safety representatives of railroad employees governed by the Railway Labor Act. Subject to the provisions in paragraph (d) and section 219.055, subdivision 8, each railroad operating unit trains in Minnesota must conduct at least one oil containment, recovery, and sensitive area full-scale exercise every five years in coordination with the commissioner of public safety, local emergency management organizations, local fire chiefs, and safety representatives of railroad employees governed by the Railway Labor Act.\n(b) The exercises under this subdivision must attempt to evaluate, coordinate, and improve the emergency response plans submitted by a railroad under subdivision 3. The exercises under this subdivision and section 219.055, subdivisions 6, 7, and 8, must be coordinated with exercises required by federal agencies.\n(c) The commissioner of the Pollution Control Agency must consult with the Division of Homeland Security and Emergency Management, the state fire marshal, and local emergency management organizations in determining the railroad's annual exercise required under this section. In determining the appropriate exercise for a rail carrier, the commissioner must evaluate whether a rail carrier has conducted a similar exercise within the preceding calendar year and the results from prior years' response and training. To the extent practicable, the commissioner must alternate between requiring a walkthrough, a tabletop exercise, or a functional exercise. The exercise selected for a rail carrier must address specific components, resources, and procedures of a response to a confirmed discharge of oil or other hazardous substances carried by rail. The commissioner must coordinate each exercise with exercises required by federal agencies. If an exercise selected by the commissioner is a tabletop exercise, the commissioner may select to conduct a public safety emergency response exercise or an incident commander response site exercise as provided in section 219.055, subdivision 6 or 7.\n(d) Subject to the requirements in section 219.055, subdivision 8, the full-scale exercise required under paragraph (a) must include the response capability requirements and operate under the response time limits set forth in subdivision 4. In determining the time, location, and manner of the full-scale exercise, the commissioner of the Pollution Control Agency must consult with the Division of Homeland Security and Emergency Management, the state fire marshal, local units of government, local law enforcement, the fire chiefs in the jurisdiction where the full-scale exercise will take place, and safety representatives of railroad employees governed by the Railway Labor Act.\n(e) Exercises conducted by a railroad under this section must include at least one representative from local emergency management organizations, fire departments, and local units of government that each have jurisdiction along the routes over which oil or hazardous substances are transported by railroad.\n(a) A railroad shall submit the prevention and response plan to the commissioner of the Pollution Control Agency on a form designated by the commissioner.\n(b) Every third year following a plan submission under this subdivision, or sooner as provided under section 115E.04, subdivision 2, a railroad must update and resubmit the prevention and response plan to the commissioner.",
	"repealed": false
}