{
	"id": "326.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.10",
	"title": "326.10 LICENSURE AND CERTIFICATION.",
	"text": "The board shall on application therefor on a prescribed form, and upon payment of a fee prescribed by rule of the board, issue a license or certificate as an architect, engineer, land surveyor, landscape architect, geoscientist, or certified interior designer. A separate fee shall be paid for each profession licensed.\n(1) To any person over 25 years of age, who is of good moral character and repute, and who has the experience and educational qualifications which the board by rule may prescribe.\n(2) To any person who holds an unexpired certificate of registration or license issued by proper authority in the District of Columbia, any state or territory of the United States, or any foreign country, in which the requirements for registration or licensure of architects, engineers, land surveyors, landscape architects, geoscientists, or certified interior designers, respectively, at the time of registration or licensure in the other jurisdiction, were equal, in the opinion of the board, to those fixed by the board and by the laws of this state, and in which similar privileges are extended to the holders of certificates of registration or licensure issued by this state. The board may require such person to submit a certificate of technical qualification from the National Council of Architectural Registration Boards in the case of an architect, from the National Council of Examiners for Engineering and Surveying in the case of an engineer, from the Council of Landscape Architectural Registration Boards in the case of a landscape architect, and from the National Council for Interior Design Qualification in the case of a certified interior designer.\nThe board, or a committee of the board, may subject any applicant for licensure or certification to such examinations as may be deemed necessary to establish qualifications.\nIn determining the qualifications of applicants, at least one member determining the qualifications must be licensed or certified in the same profession as that being evaluated.\nExaminations for architect, civil structural engineer, landscape architect, and certified interior designer shall include questions which require the applicant to demonstrate knowledge of the design needs of people with physical disabilities and of the relevant statutes and codes.\n[Repealed, Ex1967 c 28 s 9]\n[Repealed, 1976 c 222 s 209]\n[Repealed, 2003 c 85 s 5]\n[Repealed, Ex1967 c 28 s 9]\n(1) An applicant for certification as an engineer-in-training who is a graduate with a bachelor of engineering degree from a school or college having an accredited engineering curriculum or whose education, in the opinion of the board, is equivalent thereto, shall receive from the board, upon passing an examination in fundamental engineering subjects, a certificate stating that the applicant has passed such examination and that the applicant's name has been recorded as an engineer-in-training.\n(2) An applicant for certification as a land surveyor-in-training who is a graduate with a bachelor's degree from a school or college having an accredited engineering or land surveying curriculum or who has equivalent education, in the opinion of the board, shall receive from the board, upon passing a written examination in the fundamentals of mathematics and the basic principles of land surveying, a certificate stating that the applicant has passed such examination and that the applicant's name has been recorded as a land surveyor-in-training.\n(3) An applicant for certification as a geoscientist-in-training who is a graduate with a baccalaureate degree from a school or college having accreditation defined by the board and a geoscience or associated science curriculum approved by the board, shall receive from the board, upon passing the appropriate examination in fundamental geoscience subjects for the applicant's discipline as approved by the board, a certificate stating that the applicant's name has been recorded as a geoscientist-in-training with the appropriate geoscientist-in-training legend as approved by the board.\n(a) All licenses and certificates, other than in-training certificates, issued by the board expire at midnight on June 30 of each even-numbered calendar year if not renewed. A holder of a license or certificate issued by the board may renew it by completing and filing with the board an application for renewal consisting of a fully completed form provided by the board and the fee specified in section 326.105. Both the fee and the application must be submitted at the same time and by June 30 of each even-numbered calendar year. The form must be signed by the applicant, contain all of the information requested, and clearly show that the licensee or certificate holder has completed the minimum number of required professional development hours or has been granted an exemption under section 326.107, subdivision 4. An application for renewal that does not comply with the requirements of this subdivision is an incomplete application and must not be accepted by the board.\n(b) No later than 30 days before the date a license or certificate expires, the board must send the license or certificate holder a notice by email that indicates the license or certificate is about to expire. The notice must include information on the process and requirements to renew the license or certificate. The application form for a new or renewed license or certificate issued by the board must request that the applicant provide an email address for the purpose of providing the notice under this paragraph. If the board does not possess a record of a license or certificate holder's email address, the board must send the notice to the holder by United States mail.\nA licensee or certificate holder whose license or certificate has expired may reinstate the expired license or certificate by satisfying all prior continuing education requirements to a maximum of 48 professional development hours, by paying all of the renewal fees due for all prior renewal periods that the license or certificate was expired and the current renewal period, and paying a delayed renewal fee in the amount set by the board. The continuing education requirement must be satisfied with professional development hours completed within the four years immediately prior to reinstatement and may not include any professional development hours that had previously been used to renew the license or certificate being reinstated.\nTo reinstate an expired license or certificate, the licensee or certificate holder must file with the board an application for reinstatement consisting of a fully completed form provided by the board and the fees specified in this subdivision. The form must be signed, contain all of the information requested, and clearly show that the licensee or certificate holder either has completed the minimum number of required professional development hours or has been granted an exemption under section 326.107, subdivision 4. An application for reinstatement that does not comply with the requirements of this subdivision is an incomplete application and must not be accepted by the board.\nThe board shall establish a temporary license in accordance with section 197.4552 for the practice of architecture, professional engineering, geosciences, land surveying, landscape architecture, and interior design. The fee for the temporary license under this subdivision for the practice of architecture, professional engineering, geosciences, land surveying, landscape architecture, or interior design is $132.",
	"repealed": false
}