{
	"id": "628.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/628.26",
	"title": "628.26 LIMITATIONS.",
	"text": "(a) Indictments or complaints for any crime resulting in the death of the victim may be found or made at any time after the death of the person killed.\n(b) Indictments or complaints for a violation of section 609.25 may be found or made at any time after the commission of the offense.\n(c) Indictments or complaints for violation of section 609.282 may be found or made at any time after the commission of the offense if the victim was under the age of 18 at the time of the offense.\n(d) Indictments or complaints for violation of section 609.282 where the victim was 18 years of age or older at the time of the offense, or 609.42, subdivision 1, clause (1) or (2), shall be found or made and filed in the proper court within six years after the commission of the offense.\n(e) Indictments or complaints for violation of sections 609.322, 609.342 to 609.345, and 609.3458 may be found or made at any time after the commission of the offense.\n(f) Indictments or complaints for violation of sections 609.466 and 609.52, subdivision 2, paragraph (a), clause (3), item (iii), shall be found or made and filed in the proper court within six years after the commission of the offense.\n(g) Indictments or complaints for violation of section 609.2335, 609.52, subdivision 2, paragraph (a), clause (3), items (i) and (ii), (4), (15), or (16), 609.631, or 609.821, where the value of the property or services stolen is more than $35,000, or for violation of section 609.527 where the offense involves eight or more direct victims or the total combined loss to the direct and indirect victims is more than $35,000, shall be found or made and filed in the proper court within five years after the commission of the offense.\n(h) Except for violations relating to false material statements, representations or omissions, indictments or complaints for violations of section 609.671 shall be found or made and filed in the proper court within five years after the commission of the offense.\n(i) Indictments or complaints for violation of sections 609.561 to 609.563, shall be found or made and filed in the proper court within five years after the commission of the offense.\n(j) Indictments or complaints for violation of section 609.746 shall be found or made and filed in the proper court within the later of three years after the commission of the offense or three years after the offense was reported to law enforcement authorities.\n(k) In all other cases, indictments or complaints shall be found or made and filed in the proper court within three years after the commission of the offense.\n(l) The limitations periods contained in this section shall exclude any period of time during which the defendant was not an inhabitant of or usually resident within this state.\n(m) The limitations periods contained in this section for an offense shall not include any period during which the alleged offender participated under a written agreement in a pretrial diversion program relating to that offense.\n(n) The limitations periods contained in this section shall not include any period of time during which physical evidence relating to the offense was undergoing DNA analysis, as defined in section 299C.155, unless the defendant demonstrates that the prosecuting or law enforcement agency purposefully delayed the DNA analysis process in order to gain an unfair advantage.",
	"repealed": false
}