{
	"id": "62J.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.17",
	"title": "62J.17 EXPENDITURE REPORTING.",
	"text": "To ensure access to affordable health care services for all Minnesotans it is necessary to restrain the rate of growth in health care costs. An important factor believed to contribute to escalating costs may be the purchase of costly new medical equipment, major capital expenditures, and the addition of new specialized services. After spending limits are established under section 62J.04, providers, patients, and communities will have the opportunity to decide for themselves whether they can afford capital expenditures or new equipment or specialized services within the constraints of a spending limit. In this environment, the state's role in reviewing these spending commitments can be more limited. However, during the interim period until spending targets are established, it is important to prevent unrestrained major spending commitments that will contribute further to the escalation of health care costs and make future cost containment efforts more difficult. In addition, it is essential to protect against the possibility that the legislature's expression of its attempt to control health care costs may lead a provider to make major spending commitments before targets or other cost containment constraints are fully implemented because the provider recognizes that the spending commitment may not be considered appropriate, needed, or affordable within the context of a fixed budget for health care spending. Therefore, the legislature finds that a requirement for reporting health care expenditures is necessary.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Capital expenditure\" means an expenditure which, under generally accepted accounting principles, is not properly chargeable as an expense of operation and maintenance.\n(c) \"Health care service\" means:\n(1) a service or item that would be covered by the medical assistance program under chapter 256B if provided in accordance with medical assistance requirements to an eligible medical assistance recipient; and\n(2) a service or item that would be covered by medical assistance except that it is characterized as experimental, cosmetic, or voluntary.\n\"Health care service\" does not include retail, over-the-counter sales of nonprescription drugs and other retail sales of health-related products that are not generally paid for by medical assistance and other third-party coverage.\n(d) \"Major spending commitment\" means an expenditure in excess of $1,000,000 for:\n(1) acquisition of a unit of medical equipment;\n(2) a capital expenditure for a single project for the purposes of providing health care services, other than for the acquisition of medical equipment;\n(3) offering a new specialized service not offered before;\n(4) planning for an activity that would qualify as a major spending commitment under this paragraph; or\n(5) a project involving a combination of two or more of the activities in clauses (1) to (4).\nThe cost of acquisition of medical equipment, and the amount of a capital expenditure, is the total cost to the provider regardless of whether the cost is distributed over time through a lease arrangement or other financing or payment mechanism.\n(e) \"Medical equipment\" means fixed and movable equipment that is used by a provider in the provision of a health care service. \"Medical equipment\" includes, but is not limited to, the following:\n(1) an extracorporeal shock wave lithotripter;\n(2) a computerized axial tomography (CAT) scanner;\n(3) a magnetic resonance imaging (MRI) unit;\n(4) a positron emission tomography (PET) scanner; and\n(5) emergency and nonemergency medical transportation equipment and vehicles.\n(f) \"New specialized service\" means a specialized health care procedure or treatment regimen offered by a provider that was not previously offered by the provider, including, but not limited to:\n(1) cardiac catheterization services involving high-risk patients as defined in the Guidelines for Coronary Angiography established by the American Heart Association and the American College of Cardiology;\n(2) heart, heart-lung, liver, kidney, bowel, or pancreas transplantation service, or any other service for transplantation of any other organ;\n(3) megavoltage radiation therapy;\n(4) open heart surgery;\n(5) neonatal intensive care services; and\n(6) any new medical technology for which premarket approval has been granted by the United States Food and Drug Administration, excluding implantable and wearable devices.\n(g) \"Specialty care\" includes but is not limited to cardiac, neurology, orthopedic, obstetrics, mental health, substance use disorder, and emergency services.\nNothing in this section supersedes or limits the applicability of section 144.551 or 144A.071. This section does not apply to major spending commitments made by nursing homes or intermediate care facilities that are related to the provision of long-term care services to residents.\n[Repealed, 1993 c 345 art 6 s 26]\nEach hospital, outpatient surgical center, diagnostic imaging center, and physician, advanced practice registered nurse, or physician assistant clinic shall report annually to the commissioner on all major spending commitments, in the form and manner specified by the commissioner. The report shall include the following information:\n(1) a description of major spending commitments made during the previous year, including the total dollar amount of major spending commitments and purpose of the expenditures;\n(2) the cost of land acquisition, construction of new facilities, and renovation of existing facilities;\n(3) the cost of purchased or leased medical equipment, by type of equipment;\n(4) expenditures by type for specialty care and new specialized services;\n(5) information on the amount and types of added capacity for diagnostic imaging services, outpatient surgical services, and new specialized services; and\n(6) information on investments in electronic medical records systems.\nFor hospitals and outpatient surgical centers, this information shall be included in reports to the commissioner that are required under section 144.698. For diagnostic imaging centers, this information shall be included in reports to the commissioner that are required under section 144.565. For all other health care providers that are subject to this reporting requirement, reports must be submitted to the commissioner by March 1 each year for the preceding calendar year.\n[Repealed, 1993 c 345 art 6 s 26]\n(a) The commissioner shall retrospectively review each major spending commitment and determine whether the major spending commitment was appropriate. In making the determination, the commissioner may consider the following criteria: the major spending commitment's impact on the cost, access, and quality of health care; the clinical effectiveness and cost-effectiveness of the major spending commitment; and the alternatives available to the provider. If the major expenditure is determined to not be appropriate, the commissioner shall notify the provider.\n(b) The commissioner may not prevent or prohibit a major spending commitment subject to retrospective review. However, if the provider fails the retrospective review, any major spending commitments by that provider for the five-year period following the commissioner's decision are subject to prospective review under subdivision 6a.\n[Repealed, 1993 c 345 art 6 s 26]\n(a) No health care provider subject to prospective review under this subdivision shall make a major spending commitment unless:\n(1) the provider has filed an application with the commissioner to proceed with the major spending commitment and has provided all supporting documentation and evidence requested by the commissioner; and\n(2) the commissioner determines, based upon this documentation and evidence, that the major spending commitment is appropriate under the criteria provided in subdivision 5a in light of the alternatives available to the provider.\n(b) A provider subject to prospective review and approval shall submit an application to the commissioner before proceeding with any major spending commitment. The provider may submit information, with supporting documentation, regarding why the major spending commitment should be excepted from prospective review under subdivision 7.\n(c) The commissioner shall determine, based upon the information submitted, whether the major spending commitment is appropriate under the criteria provided in subdivision 5a, or whether it should be excepted from prospective review under subdivision 7. In making this determination, the commissioner may also consider relevant information from other sources. At the request of the commissioner, the health technology advisory committee shall convene an expert review panel made up of persons with knowledge and expertise regarding medical equipment, specialized services, health care expenditures, and capital expenditures to review applications and make recommendations to the commissioner. The commissioner shall make a decision on the application within 60 days after an application is received.\n(d) The commissioner of health has the authority to issue fines, seek injunctions, and pursue other remedies as provided by law.\n(a) The reporting requirement in subdivision 4a does not apply to:\n(1) a major spending commitment made by a research and teaching institution for purposes of conducting medical education, medical research supported or sponsored by a medical school, or by a federal or foundation grant or clinical trials;\n(2) a major spending commitment for building maintenance including heating, water, electricity, and other maintenance-related expenditures; and\n(3) a major spending commitment for activities, not directly related to the delivery of patient care services, including food service, laundry, housekeeping, and other service-related activities.\n(b) In addition to the exceptions listed in paragraph (a), the reporting requirement in subdivision 4a does not apply to mergers, acquisitions, and other changes in ownership or control that, in the judgment of the commissioner, do not involve a substantial expansion of service capacity or a substantial change in the nature of health care services provided.\n(a) This subdivision shall apply only to those major spending commitments that are related to the purchase, construction, or leasing of a radiation therapy facility.\n(b) The term \"provider\" shall mean:\n(1) a provider as defined in section 62J.03, subdivision 8;\n(2) a person or organization that, upon engaging in an activity related to a major spending commitment, will become a provider as defined in section 62J.03, subdivision 8;\n(3) an organization under common control with an organization described in clause (1) or (2); or\n(4) an organization that manages a person or organization described in clause (1), (2), or (3).\n(c) In conducting the retrospective or prospective review, the commissioner shall consider the criteria described in subdivision 5a, paragraph (a), in determining whether the major spending commitment was appropriate. In addition, the commissioner shall consider the following criteria:\n(1) the alternatives available to patients in terms of avoiding an unwarranted duplication based on whether additional capacity is needed of services, facilities, or equipment in and around the location of the major spending commitment; and\n(2) the best interests of the patients, including conflicts of interest that may be present in influencing the utilization of the services, facility, or equipment relating to the major spending commitment.\n(d) In addition to subdivision 6a, paragraph (c), the commissioner has the authority to pursue the following remedies:\n(1) assessment of fines against providers violating subdivision 6a, paragraph (a), of up to triple the amount of the major spending commitment;\n(2) securing a permanent injunction against providers violating subdivision 6a, paragraph (a), halting the purchase or construction of a facility, prohibiting the operation of a facility, or the providing of a service related to the major spending commitment; and\n(3) obtaining a court order to invalidate any purchase agreement, management agreement, lease, or other contract relating to the major spending commitment or the conduct of any activity relating to the major spending commitment.\n(e) If a provider fails the retrospective review of a major spending commitment that is identified under this subdivision, the prospective review and approval required under subdivision 6a shall be limited to major spending commitments that are identified under this subdivision.\n(f) The provisions of this subdivision do not apply to radiation therapy facilities owned and operated or managed by a hospital licensed under chapter 144.",
	"repealed": false
}