{
	"id": "62Q.6651",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.6651",
	"title": "62Q.6651 MEDICAL NECESSITY AND NONDISCRIMINATION STANDARDS FOR COVERAGE OF PROSTHETICS OR ORTHOTICS.",
	"text": "(a) When performing a utilization review for a request for coverage of prosthetic or orthotic benefits, a health plan company shall apply the most recent version of evidence-based treatment and fit criteria as recognized by relevant clinical specialists.\n(b) A health plan company shall render utilization review determinations in a nondiscriminatory manner and shall not deny coverage for habilitative or rehabilitative benefits, including prosthetics or orthotics, solely on the basis of an enrollee's actual or perceived disability.\n(c) A health plan company shall not deny a prosthetic or orthotic benefit for an individual with limb loss or absence that would otherwise be covered for a nondisabled person seeking medical or surgical intervention to restore or maintain the ability to perform the same physical activity.\n(d) A health plan offered, issued, or renewed in Minnesota that offers coverage for prosthetics and custom orthotic devices shall include language describing an enrollee's rights pursuant to paragraphs (b) and (c) in its evidence of coverage and any benefit denial letters.\n(e) A health plan that provides coverage for prosthetic or orthotic services shall ensure access to medically necessary clinical care and to prosthetic and custom orthotic devices and technology from not less than two distinct prosthetic and custom orthotic providers in the plan's provider network located in Minnesota. In the event that medically necessary covered orthotics and prosthetics are not available from an in-network provider, the health plan company shall provide processes to refer a member to an out-of-network provider and shall fully reimburse the out-of-network provider at a mutually agreed upon rate less member cost sharing determined on an in-network basis.\n(f) If coverage for prosthetic or custom orthotic devices is provided, payment shall be made for the replacement of a prosthetic or custom orthotic device or for the replacement of any part of the devices, without regard to continuous use or useful lifetime restrictions, if an ordering health care provider determines that the provision of a replacement device, or a replacement part of a device, is necessary because:\n(1) of a change in the physiological condition of the patient;\n(2) of an irreparable change in the condition of the device or in a part of the device; or\n(3) the condition of the device, or the part of the device, requires repairs and the cost of the repairs would be more than 60 percent of the cost of a replacement device or of the part being replaced.\n(g) Confirmation from a prescribing health care provider may be required if the prosthetic or custom orthotic device or part being replaced is less than three years old.",
	"repealed": false
}