{
	"id": "17A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/17A.04",
	"title": "17A.04 LICENSES.",
	"text": "Licenses shall be issued to livestock market agencies and public stockyards annually and shall expire on December 31 each year, renewable annually thereafter. A separate license must be obtained for each separate geographical location even though operated under the same management or same person, partnership, firm, corporation, or livestock market. The license issued to a livestock market agency and public stockyard shall be conspicuously posted at the licensee's place of business. Licenses shall be required for livestock dealers and their agents for the period beginning July 1 each year and ending June 30. The license issued to a livestock dealer or the agent of a livestock dealer shall be carried by the person so licensed. The livestock dealer shall be responsible for the acts of the dealer's agents. Licensed livestock market agencies, public stockyards, and livestock dealers shall be responsible for the faithful performance of duty of the public livestock weighers at their places of business. The license issued to a livestock market agency, public stockyard or livestock dealer or agent of a livestock dealer is not transferable. The operation of livestock market agencies, livestock dealers, agents and packers at a public stockyard are exempt from sections 17A.01 to 17A.09 and 17A.12 to 17A.17.\n[Repealed, 1986 c 322 s 4]\nAny person desiring to carry on the business of a livestock market agency or livestock dealer, or both, or a public stockyard shall make application to the commissioner on a form or forms provided by the commissioner.\nEach new applicant for a license to operate as a livestock market agency or livestock dealer shall file with the application a current balance sheet and financial statement and shall with each subsequent annual renewal application file a report of the business volume for the preceding calendar or fiscal year on a form prescribed by the commissioner, which report shall be for the purpose of determining the amount and adequacy of the applicant's bond. The commissioner may at any time require an applicant or licensee to submit a current balance sheet and financial statement if the commissioner deems it necessary for the protection of the public.\nEach livestock market agency and livestock dealer applying for a license under Laws 1974, chapter 347 shall file with the commissioner a valid and effective bond issued by a surety company licensed to do business in this state, or meeting the requirements of section 17A.05, in the form and amount set forth in section 17A.05. No bond shall be required of a public stockyard or any agent of a bonded livestock dealer. The commissioner may at any time raise or lower bond requirements if it appears that a modification of such bond requirements is justified and will protect the public. The bonds of livestock market agencies and dealers whose residence or principal place of business is within the state of Minnesota shall name the commissioner as the trustee. Any license issued under Laws 1974, chapter 347 shall automatically become void upon the termination of the surety bond covering the licensed operations.\nThe applicant shall submit to the commissioner the following applicable fees and penalties for late renewal:\n(a) $300 for each livestock market agency and public stockyard license, penalty $75;\n(b) $100 for each livestock dealer license, penalty $25;\n(c) $50 for each agent of a livestock dealer license, penalty $15;\n(d) $100 for each meat packing company license, penalty $25;\n(e) $50 for each agent of a meat packing company license, penalty $15.\nThe commissioner shall refuse to issue a livestock market agency or livestock dealer license if the applicant has not filed a surety bond in the form and amount required under this section and section 17A.05; the commissioner may refuse to issue a license if the applicant (1) has not satisfactorily demonstrated by a current balance sheet and financial statement that the applicant's assets exceed liabilities; (2) has been found by the department to have failed to pay, without reasonable cause, obligations incurred in connection with livestock transactions; (3) has failed to maintain and operate livestock or monorail scales in a manner to ensure accurate and correct weights; or (4) has failed to comply with other statutes, rules, or regulations enforced by the commissioner, the Board of Animal Health, the Division of Weights and Measures of the Department of Commerce, or the federal Packers and Stockyards Administration.\nWhenever the commissioner finds that any livestock market agency or livestock dealer has violated the provisions of this chapter, or has failed to comply with other laws, rules, or regulations enforced by the Board of Animal Health, the Division of Weights and Measures of the Department of Commerce, or the federal Packers and Stockyards Administration, the commissioner may, by order, pursuant to the provisions of chapter 14, and this subdivision, revoke the license of the offender. Before any such license shall be revoked, the licensee shall be furnished with a statement of the complaints made against the licensee, and a hearing shall be had before the commissioner upon at least ten days' notice to the licensee to determine whether such license shall be revoked, which notice may be served either by certified mail addressed to the address of the licensee as shown in the license application or in the manner provided by law for the service of a summons. At the time and place fixed for hearing, the commissioner or any official, employee or agent of the department authorized by the commissioner, shall receive evidence, administer oaths, examine witnesses, hear the testimony and thereafter file an order either dismissing the proceedings or revoking the license.\nWhenever the commissioner finds that the licensee has violated provisions of this chapter, or has failed to comply with other laws, rules, or regulations enforced by the Board of Animal Health, the Division of Weights and Measures of the Department of Commerce, or the federal Packers and Stockyards Administration, and that the continued activity of a licensee may cause irreparable injury or loss to persons engaged in business with the licensee, the commissioner may, without hearing, suspend the license of the licensee, provided that when a license is so suspended, the commissioner shall immediately initiate procedures to afford the licensee a hearing pursuant to subdivision 7 except that the ten days' notice required in subdivision 7 may be waived by the licensee.",
	"repealed": false
}