{
	"id": "155A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.25",
	"title": "155A.25 COSMETOLOGY FEES; LICENSE EXPIRATION DATE.",
	"text": "[Repealed, 2013 c 85 art 5 s 50]\n(a) The schedule for fees and penalties is as provided in this subdivision.\n(b) Three-year license fees are as follows:\n(1) $195 initial practitioner, manager, or instructor license, divided as follows:\n(i) $155 for each initial license; and\n(ii) $40 for each initial license application fee;\n(2) $115 renewal of practitioner license, divided as follows:\n(i) $100 for each renewal license; and\n(ii) $15 for each renewal application fee;\n(3) $145 renewal of manager or instructor license, divided as follows:\n(i) $130 for each renewal license; and\n(ii) $15 for each renewal application fee;\n(4) $350 initial salon license, divided as follows:\n(i) $250 for each initial license; and\n(ii) $100 for each initial license application fee;\n(5) $225 renewal of salon license, divided as follows:\n(i) $175 for each renewal; and\n(ii) $50 for each renewal application fee;\n(6) $4,000 initial school license, divided as follows:\n(i) $3,000 for each initial license; and\n(ii) $1,000 for each initial license application fee; and\n(7) $2,500 renewal of school license, divided as follows:\n(i) $2,000 for each renewal; and\n(ii) $500 for each renewal application fee.\n(c) Penalties may be assessed in amounts up to the following:\n(1) reinspection fee, $150;\n(2) manager and owner with expired practitioner found on inspection, $150 each;\n(3) expired practitioner or instructor found on inspection, $200;\n(4) expired salon found on inspection, $500;\n(5) expired school found on inspection, $1,000;\n(6) failure to display current license, $100;\n(7) failure to dispose of single-use equipment, implements, or materials as provided under section 155A.355, subdivision 1, $500;\n(8) use of prohibited razor-type callus shavers, rasps, or graters under section 155A.355, subdivision 2, $500;\n(9) performing nail or cosmetology services in esthetician salon, or performing esthetician or cosmetology services in a nail salon, $500;\n(10) owner and manager allowing an operator to work as an independent contractor, $200;\n(11) operator working as an independent contractor, $100;\n(12) refusal or failure to cooperate with an inspection, $500;\n(13) practitioner late renewal fee, $45; and\n(14) salon or school late renewal fee, $50.\n(d) Administrative fees are as follows:\n(1) homebound service permit, $50 three-year fee;\n(2) name change, $20;\n(3) certification of licensure, $30 each;\n(4) duplicate license, $20;\n(5) special event permit, $75 per year;\n(6) $100 for each temporary military license for a cosmetologist, nail technician, esthetician, or advanced practice esthetician one-year fee;\n(7) expedited initial individual license, $150;\n(8) expedited initial salon license, $300;\n(9) instructor continuing education provider approval, $150 each year; and\n(10) practitioner continuing education provider approval, $150 each year.\n(a) All fees established in subdivisions 1 and 1a must be paid to the executive secretary of the board.\n(b) The executive secretary of the board shall deposit all fees in the general fund in the state treasury.\nRefunds shall be given in the following situations: overpayment; death or permanent disability before the effective date of a license; or an individual's ineligibility for licensure. Applicants determined ineligible to receive a license will be refunded the license fee minus any processing fee and minus any application fee this section requires.\nA licensee who applies for licensing in a second category shall pay the full license fee and application fee for the second category of license.\nIndividual licenses expire on the last day of the licensee's birth month of the year due. Salon and school licenses expire on the last day of the month of initial licensure of the year due.\nWithin 15 working days of receiving a complete application and the required fees to apply for or renew an individual or salon license that is not an expedited license or a military license, the board must (1) issue the license, (2) deny the license and notify the applicant of the denial, or (3) if the conditions in subdivision 6 are met, notify the applicant that the board must conduct additional review.\nIf an application contains discrepancies, the applicant is the subject of a complaint investigation, or the applicant has pending disciplinary actions before the board, the board will comply with the time limits prescribed in section 15.992 to process the application.\nWithin five business days of receiving a completed application and the required fees for an individual or salon license that meets requirements for an expedited license or a temporary military license, the board must: (1) issue the license; (2) deny the license and notify the applicant of the denial; or (3) notify the applicant that the board must conduct additional review if the application meets the conditions in subdivision 8.\nIf an application under subdivision 7 contains discrepancies, the applicant is the subject of a complaint investigation, or the applicant has pending disciplinary actions before the board, the board will process the application according to the time limits in section 15.992.",
	"repealed": false
}