{
	"id": "256S.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.18",
	"title": "256S.18 MONTHLY CASE MIX BUDGET CAPS; GENERALLY.",
	"text": "(a) The elderly waiver case mix classifications A to K shall be the resident classes A to K established under Minnesota Rules, parts 9549.0058 and 9549.0059.\n(b) A participant assigned to elderly waiver case mix classification A must be reassigned to elderly waiver case mix classification L if an assessment or reassessment performed under section 256B.0911 determines that the participant has:\n(1) no dependencies in activities of daily living; or\n(2) up to two dependencies in bathing, dressing, grooming, walking, or eating when the dependency score in eating is three or greater.\n(c) A participant must be assigned to elderly waiver case mix classification V if the participant meets the definition of ventilator-dependent in section 256B.0651, subdivision 1, paragraph (g).\nThe monthly total cost, as determined under this chapter, for all elderly waiver services authorized for a participant must not exceed the participant's monthly case mix budget cap. The monthly total cost must include the monthly cost of all elderly waiver services and state plan home care services.\n(a) Effective each July 1, the monthly case mix budget cap for all case mix classifications shall be the monthly case mix budget cap in effect on the prior June 30 for the case mix classification to which the participant is assigned, adjusted as required under subdivisions 5 and 6.\n(b) The commissioner shall determine and publish monthly case mix budget caps for each case mix classification at least annually and whenever other adjustments are legislatively enacted.\nThe monthly case mix budget caps for each case mix classification for consumer-directed community supports must be equal to the monthly case mix budget caps in subdivision 3.\n[See Note.]\nIf specialized supplies and equipment or environmental accessibility and adaptations are or will be purchased for a participant, these costs may be prorated for up to 12 consecutive months beginning with the month of purchase. If the monthly cost of a participant's elderly waiver services exceeds the participant's monthly case mix budget cap established under subdivision 3, 5, or 6, the annual cost of all elderly waiver services shall be determined. In this event, the annual cost of all elderly waiver services shall not exceed 12 times the applicable monthly case mix budget cap under subdivision 3, 5, or 6.\n(a) The commissioner shall adjust the monthly case mix budget caps under subdivision 3 by any legislatively enacted home and community-based services percentage rate adjustments.\n(b) If a legislatively enacted home and community-based rate adjustment is service-specific, the commissioner shall adjust the monthly case mix budget caps under subdivision 3 based on the overall effect of the adjustment on the elderly waiver.\n(a) Each January 1, the commissioner shall increase the monthly case mix budget caps under subdivision 3 in effect on the previous December 31 by the difference between:\n(1) the sum of any enacted home and community-based provider rate increases effective on January 1 and since the previous January 1; and\n(2) the annual average statewide percentage increase in nursing facility operating payment rates under chapter 256R, effective the previous January 1.\n(b) This subdivision only applies if the average statewide percentage increase in nursing facility operating payment rates is greater than any legislatively enacted home and community-based provider rate increases effective on January 1, or occurring since the previous January 1.\nThe commissioner shall approve an exception to the monthly case mix budget cap in subdivision 3 to account for the additional cost of providing enhanced rate personal care assistance services under section 256B.0659 or enhanced rate community first services and supports under section 256B.85. The commissioner must calculate the difference between the rate for personal care assistance services and enhanced rate personal care assistance services. The additional budget amount approved under an exception must not exceed this difference. The exception must be reapproved on an annual basis at the time of a participant's annual reassessment.",
	"repealed": false
}