{
	"id": "308C.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.121",
	"title": "308C.121 ANNUAL RENEWAL.",
	"text": "A cooperative governed by this chapter must file an annual renewal with the secretary of state in each calendar year following the calendar year in which the cooperative was incorporated. The secretary of state may send annually to the cooperative, using the information provided by the cooperative pursuant to section 5.002 or 5.34 or the articles of incorporation, a notice announcing the need to file the annual renewal, informing the cooperative that the annual renewal may be filed online and that paper filings may also be made, and informing the cooperative that failing to file the annual renewal will result in an administrative dissolution of the cooperative.\nIn each calendar year in which a renewal is to be filed, a cooperative must file with the secretary of state an annual renewal by December 31 of that calendar year containing the items required by section 5.34.\nThe information required by subdivision 2 is public data.\n(a) A cooperative that has failed to file a renewal pursuant to the requirements of this section by December 31 of the calendar year for which the renewal is required must be dissolved by the secretary of state as described in paragraph (b).\n(b) If the cooperative has not filed the renewal by December 31 of that calendar year, the secretary of state must issue a certificate of involuntary dissolution, and the certificate must be filed with the secretary of state. The secretary of state must make available in an electronic format the names of the dissolved cooperatives. A cooperative dissolved in this manner is not entitled to the benefits of section 308C.975.\nA cooperative may retroactively reinstate its existence by filing a single annual renewal and paying a $25 fee. Filing the annual renewal with the secretary of state:\n(1) returns the cooperative to active status as of the date of the dissolution;\n(2) validates contracts or other acts within the authority of the articles, and the cooperative is liable for those contracts or acts; and\n(3) restores to the cooperative all assets and rights of the cooperative and its shareholders or members to the extent that assets or rights were held by the cooperative and its shareholders or members before the dissolution occurred, except to the extent that assets or rights were affected by acts occurring after the dissolution or sold or otherwise distributed after that time.",
	"repealed": false
}