{
	"id": "641.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.155",
	"title": "641.155 DISCHARGE PLANS.",
	"text": "The commissioner of corrections shall develop and distribute a model discharge planning process for every county jail or county regional jail. The commissioner may specify different model discharge plans for prisoners who have been detained pretrial and prisoners who have been sentenced to jail. The commissioner must consult best practices and the most current correctional health care standards from national accrediting organizations. The commissioner must review and update the model process as needed.\nA person with a serious and persistent mental illness, as defined in section 245.462, subdivision 20, paragraph (c), who has been convicted and sentenced to serve three or more months and is being released from a county jail or county regional jail shall be referred to the appropriate staff in the county human services department at least 60 days before being released. The county human services department must complete a discharge plan with the prisoner no less than 14 days before release that may include:\n(1) providing assistance in filling out an application for medical assistance or MinnesotaCare;\n(2) making a referral for case management as outlined under section 245.467, subdivision 4;\n(3) providing assistance in obtaining a state photo identification;\n(4) securing a timely appointment with a psychiatrist or other appropriate community mental health providers; and\n(5) providing prescriptions for a 30-day supply of all necessary medications.\nA county may establish a program to provide services and assist prisoners with reentering the community. Reentry services may include but are not limited to:\n(1) providing assistance in meeting the basic needs of the prisoner immediately after release, including but not limited to provisions for transportation, clothing, food, and shelter;\n(2) providing assistance in filling out an application for medical assistance or MinnesotaCare;\n(3) providing assistance in obtaining a state photo identification;\n(4) providing assistance in obtaining prescriptions for all necessary medications;\n(5) coordinating services with the local county services agency or the social services agency in the county where the prisoner is a resident; and\n(6) coordinating services with a community mental health or substance use disorder provider.",
	"repealed": false
}