{
	"id": "611.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.57",
	"title": "611.57 CERTIFICATION ADVISORY COMMITTEE.",
	"text": "The Certification Advisory Committee is established to provide the Minnesota Competency Attainment Board with advice and expertise related to the certification of competency attainment programs, including jail-based programs.\n(a) The Certification Advisory Committee consists of the following members:\n(1) a mental health professional, as defined in section 245I.02, subdivision 27, with community behavioral health experience, appointed by the governor;\n(2) a board-certified forensic psychiatrist with experience in competency evaluations, providing competency attainment services, or both, appointed by the governor;\n(3) a board-certified forensic psychologist with experience in competency evaluations, providing competency attainment services, or both, appointed by the governor;\n(4) the president of the Minnesota Corrections Association or a designee;\n(5) the direct care and treatment deputy commissioner or a designee;\n(6) the president of the Minnesota Association of County Social Service Administrators or a designee;\n(7) the president of the Minnesota Association of Community Mental Health Providers or a designee;\n(8) the president of the Minnesota Sheriffs' Association or a designee; and\n(9) the executive director of the National Alliance on Mental Illness Minnesota or a designee.\n(b) Members of the advisory committee serve without compensation and at the pleasure of the appointing authority. Vacancies shall be filled by the appointing authority consistent with the qualifications of the vacating member required by this subdivision.\nAt its first meeting, the advisory committee shall elect a chair and may elect a vice-chair. The advisory committee shall meet at least monthly or upon the call the chair. The advisory committee shall meet sufficiently enough to accomplish the tasks identified in this section.\nThe Certification Advisory Committee shall consult with the Department of Human Services, the Department of Health, and the Department of Corrections; make recommendations to the Minnesota Competency Attainment Board regarding competency attainment curriculum, certification requirements for competency attainment programs including jail-based programs, and certification of individuals to provide competency attainment services; and provide information and recommendations on other issues relevant to competency attainment as requested by the board.",
	"repealed": false
}