{
	"id": "116J.8747",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8747",
	"title": "116J.8747 JOB TRAINING PROGRAM GRANT.",
	"text": "The commissioner may provide a grant to a qualified job training program from money appropriated for the purposes of this section as follows:\n(1) an $11,000 placement grant paid to a job training program upon placement in employment of a qualified graduate of the program; and\n(2) an $11,000 retention grant paid to a job training program upon retention in employment of a qualified graduate of the program for at least one year.\nTo qualify for grants under this section, a job training program must satisfy the following requirements:\n(1) the program must be operated by a nonprofit corporation that qualifies under section 501(c)(3) of the Internal Revenue Code;\n(2) the program may spend up to $5,500 in total training per participant;\n(3) the program must provide education and training in:\n(i) basic skills, such as reading, writing, financial literacy, digital literacy, mathematics, and communications;\n(ii) long-term plans for success including participant coaching for two years after placement;\n(iii) soft skills, including skills critical to success on the job; and\n(iv) access to internships, technology training, personal and emotional intelligence skill development, and other support services;\n(4) the program may provide income supplements not to exceed $2,000 per participant, when needed, to participants for housing, counseling, tuition, and other basic needs;\n(5) individuals served by the program must be 18 years of age or older as of the date of enrollment, and have household income in the six months immediately before entering the program that is 200 percent or less of the federal poverty guideline for Minnesota, based on family size; and\n(6) the program must be certified by the commissioner of employment and economic development as meeting the requirements of this subdivision.\nFor purposes of a placement grant under this section, a qualified graduate is a graduate of a job training program qualifying under subdivision 2 who is placed in a job in Minnesota that pays at least the current state minimum wage. To qualify for a retention grant under this section for a retention fee, a job in which the graduate is retained must pay at least the current state minimum wage.\n(a) A program certified by the commissioner under subdivision 2 must comply with the requirements of this subdivision.\n(b) A program must maintain records for each qualified graduate. The records must include information sufficient to verify the graduate's eligibility under this section, identify the employer, and describe the job including its compensation rate and benefits.\n(c) A program is subject to the reporting requirements under section 116L.98.",
	"repealed": false
}