{
	"id": "299A.296",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.296",
	"title": "299A.296 COMMUNITY CRIME INTERVENTION AND PREVENTION PROGRAMS; GRANTS.",
	"text": "The commissioner shall administer a grant program to fund community-based programs that operate crime or violence prevention and intervention programs that provide direct services to community members. Programs must be culturally competent and identify specific outcomes that can be tracked and measured to demonstrate the impact the program has on community crime and violence. Examples of qualifying programs include, but are not limited to, the following:\n(1) community-based programs designed to provide services for children and youth who are juvenile offenders. The programs must give priority to:\n(i) juvenile restitution;\n(ii) prearrest or pretrial diversion, including through mediation;\n(iii) probation innovation;\n(iv) teen courts, community service; or\n(v) post-incarceration alternatives to assist youth in returning to their communities;\n(2) community-based programs designed to provide at-risk children and youth with after-school and summer enrichment activities;\n(3) community-based programs designed to discourage young people from involvement in unlawful drug or street gang activities, such as neighborhood youth centers;\n(4) neighborhood block clubs and innovative community-based crime prevention programs;\n(5) community- and school-based programs designed to enrich the educational, cultural, or recreational opportunities of at-risk children and youth, including programs designed to keep at-risk youth from dropping out of school and encourage school dropouts to return to school;\n(6) community-based programs designed to intervene with juvenile offenders who are identified as likely to engage in repeated criminal activity in the future unless intervention is undertaken;\n(7) community-based collaboratives that coordinate multiple programs and funding sources to address the needs of at-risk children and youth, including, but not limited to, collaboratives that address the continuum of services for juvenile offenders and those who are at risk of becoming juvenile offenders;\n(8) programs that are proven successful at increasing the rate of school success or the rate of postsecondary education attendance for high-risk students;\n(9) homeless assistance programs;\n(10) programs designed to reduce truancy;\n(11) other community- and school-based crime prevention programs that are innovative and encourage substantial involvement by members of the community served by the program;\n(12) community-based programs that attempt to prevent and educate on the risks of sex trafficking, ameliorate the effects of sex trafficking, or both;\n(13) programs for mentoring at-risk youth, including youth at risk of gang involvement;\n(14) programs operated by community violence prevention councils;\n(15) programs that intervene in volatile situations to mediate disputes before they become violent; and\n(16) programs that provide services to individuals and families harmed by gun violence.\n(a) A local unit of government or a nonprofit community-based entity may apply for a grant by submitting an application with the commissioner. The applicant shall specify the following in its application:\n(1) a description of each program for which funding is sought;\n(2) specific outcomes and performance indicators for the program;\n(3) a description of the planning process that identifies local community needs, surveys existing programs, provides for coordination with existing programs, and involves all affected sectors of the community;\n(4) the geographical area to be served by the program; and\n(5) crime data or other statistical information to demonstrate the need for the proposed services.\n(b) The commissioner shall give priority to funding community-based collaboratives, programs that demonstrate involvement by members of the community served by the program, programs that have local government or law enforcement support, community intervention and prevention programs that are reducing disparities in the communities they serve, and programs that serve communities disproportionately impacted by violent crime.\n[See Note.]",
	"repealed": false
}