{
	"id": "576.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/576.21",
	"title": "576.21 DEFINITIONS.",
	"text": "(a) The definitions in this section apply throughout this chapter unless the context requires otherwise.\n(b) \"Court\" means the district court in which the receivership is pending unless the context requires otherwise.\n(c) \"Entity\" means a person other than a natural person.\n(d) \"Executory contract\" means a contract, including a lease, where the obligations of both the respondent and the other party to the contract are unperformed to the extent that the failure of either party to complete performance of its obligations would constitute a material breach of the contract, thereby excusing the other party's performance of its obligations under the contract.\n(e) \"Foreign receiver\" means a receiver appointed in any foreign jurisdiction.\n(f) \"Foreign jurisdiction\" means any state or federal jurisdiction other than that of this state.\n(g) \"General receiver\" means the receiver appointed in a general receivership.\n(h) \"General receivership\" means a receivership over all or substantially all of the nonexempt property of a respondent for the purpose of liquidation and distribution to creditors and other parties in interest, including, without limitation, a receivership resulting from the appointment of a receiver pursuant to section 302A.753, 308A.945, 308B.935, or 317A.753.\n(i) \"Lien\" means a charge against or interest in property to secure payment of a debt or the performance of an obligation, including any mortgage or security interest.\n(j) \"Limited receiver\" means the receiver appointed in a limited receivership.\n(k) \"Limited receivership\" means a receivership other than a general receivership.\n(l) \"Party\" means a person who is a party within the meaning of the Minnesota Rules of Civil Procedure in the action in which a receiver is appointed.\n(m) \"Party in interest\" includes the respondent, any equity security holder in the respondent, any person with an ownership interest in or lien on receivership property, and, in a general receivership, any creditor of the respondent.\n(n) \"Person\" has the meaning given it in section 645.44 and shall include limited liability companies, limited liability partnerships, and other entities recognized under the laws of this state.\n(o) \"Property\" means all of respondent's right, title, and interest, both legal and equitable, in real and personal property, regardless of the manner by which any of the same were or are acquired. Property includes, but is not limited to, any proceeds, products, offspring, rents, or profits of or from the property. Property does not include: (1) any power that the respondent may exercise solely for the benefit of another person, or (2) property impressed with a trust except to the extent that the respondent has a residual interest.\n(p) \"Receiver\" means a person appointed by the court as the court's agent, and subject to the court's direction, to take possession of, manage, and, if authorized by this chapter or order of the court, dispose of receivership property.\n(q) \"Receivership\" means the case in which the receiver is appointed, and, as the context requires, the proceeding in which the receiver takes possession of, manages, or disposes of the respondent's property.\n(r) \"Receivership property\" means (1) in the case of a general receivership, all or substantially all of the nonexempt property of the respondent, or (2) in the case of a limited receivership, that property of the respondent identified in the order appointing the receiver, or in any subsequent order.\n(s) \"Respondent\" means the person over whose property the receiver is appointed.\n(t) \"State agent\" and \"state agency\" means any office, department, division, bureau, board, commission, or other agency of the state of Minnesota or of any subdivision thereof, or any individual acting in an official capacity on behalf of any state agent or state agency.\n(u) \"Time of appointment\" means the date and time specified in the first order of appointment of a receiver or, if the date and time are not specified in the order of appointment, the date and time that the court ruled on the motion for the appointment of a receiver. Time of appointment does not mean any subsequent date or time, including the execution of a written order, the filing or docketing of a written order, or the posting of a bond.\n(v) \"Utility\" means a person providing any service regulated by the Public Utilities Commission.",
	"repealed": false
}