{
	"id": "336.2A-103",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.2A-103",
	"title": "336.2A-103 DEFINITIONS AND INDEX OF DEFINITIONS.",
	"text": "(1) In this article unless the context otherwise requires:\n(a) \"Buyer in ordinary course of business\" means a person who in good faith and without knowledge that the sale is in violation of the ownership rights or security interest or leasehold interest of a third party in the goods, buys in ordinary course from a person in the business of selling goods of that kind but does not include a pawnbroker. \"Buying\" may be for cash or by exchange of other property or on secured or unsecured credit and includes acquiring goods or documents of title under a preexisting contract for sale but does not include a transfer in bulk or as security for or in total or partial satisfaction of a money debt.\n(b) \"Cancellation\" occurs when either party puts an end to the lease contract for default by the other party.\n(c) \"Commercial unit\" means a unit of goods that by commercial usage is a single whole for purposes of lease and division of which materially impairs its character or value on the market or in use. A commercial unit may be a single article, as a machine, or a set of articles, as a suite of furniture or a line of machinery, or a quantity, as a gross or carload, or any other unit treated in use or in the relevant market as a single whole.\n(d) \"Conforming\" goods or performance under a lease contract means goods or performance that are in accordance with the obligations under the lease contract.\n(e) \"Consumer lease\" means a lease that a lessor regularly engaged in the business of leasing or selling makes to a lessee who is an individual and who takes under the lease primarily for a personal, family, or household purpose, if the total payments to be made under the lease contract, excluding payments for options to renew or buy, do not exceed $25,000.\n(f) \"Fault\" means wrongful act, omission, breach, or default.\n(g) \"Finance lease\" means a lease in which\n(1) the lessor does not select, manufacture, or supply the goods,\n(2) the lessor acquires the goods or the right to possession and use of the goods in connection with the lease, and\n(3) either\n(i) the lessee receives a copy of the contract evidencing the lessor's purchase of the goods or a disclaimer statement on or before signing the lease contract, or\n(ii) the lessee's approval of the contract evidencing the lessor's purchase of the goods or a disclaimer statement is a condition to effectiveness of the lease contract.\n\"Disclaimer statement\" means a written statement that is part of or separate from the lease contract that discloses all warranties and other rights provided to the lessee by the lessor and supplier in connection with the lease contract and informs the lessee in a conspicuous manner that there are no warranties or other rights provided to the lessee by the lessor and supplier other than those disclosed in the statement.\n(h) \"Goods\" means all things that are movable at the time of identification to the lease contract, or are fixtures (section 336.2A-309), but the term does not include money, documents, instruments, accounts, chattel paper, general intangibles, or minerals or the like, including oil and gas, before extraction. The term also includes the unborn young of animals.\n(h.1) \"Hybrid lease\" means a single transaction involving a lease of goods and:\n(i) the provision of services;\n(ii) a sale of other goods; or\n(iii) a sale, lease, or license of property other than goods.\n(i) \"Installment lease contract\" means a lease contract that authorizes or requires the delivery of goods in separate lots to be separately accepted, even though the lease contract contains a clause \"each delivery is a separate lease\" or its equivalent.\n(j) \"Lease\" means a transfer of the right to possession and use of goods for a term in return for consideration, but a sale, including a sale on approval or a sale or return, or retention or creation of a security interest is not a lease. Unless the context clearly indicates otherwise, the term includes a sublease.\n(k) \"Lease agreement\" means the bargain, with respect to the lease, of the lessor and the lessee in fact as found in their language or by implication from other circumstances including course of dealing or usage of trade or course of performance as provided in this article. Unless the context clearly indicates otherwise, the term includes a sublease agreement.\n(l) \"Lease contract\" means the total legal obligation that results from the lease agreement as affected by this article and any other applicable rules of law. Unless the context clearly indicates otherwise, the term includes a sublease contract.\n(m) \"Leasehold interest\" means the interest of the lessor or the lessee under a lease contract.\n(n) \"Lessee\" means a person who acquires the right to possession and use of goods under a lease. Unless the context clearly indicates otherwise, the term includes a sublessee.\n(o) \"Lessee in ordinary course of business\" means a person who in good faith and without knowledge that the lease is in violation of the ownership rights or security interest or leasehold interest of a third party in the goods leases in ordinary course from a person in the business of selling or leasing goods of that kind but does not include a pawnbroker. \"Leasing\" may be for cash or by exchange of other property or on secured or unsecured credit and includes acquiring goods or documents of title under a preexisting lease contract but does not include a transfer in bulk or as security for or in total or partial satisfaction of a money debt.\n(p) \"Lessor\" means a person who transfers the right to possession and use of goods under a lease. Unless the context clearly indicates otherwise, the term includes a sublessor.\n(q) \"Lessor's residual interest\" means the lessor's interest in the goods after expiration, termination, or cancellation of the lease contract.\n(r) \"Lien\" means a charge against or interest in goods to secure payment of a debt or performance of an obligation, but the term does not include a security interest.\n(s) \"Lot\" means a parcel or a single article that is the subject matter of a separate lease or delivery, whether or not it is sufficient to perform the lease contract.\n(t) \"Merchant lessee\" means a lessee that is a merchant with respect to goods of the kind subject to the lease.\n(u) \"Present value\" means the amount as of a date certain of one or more sums payable in the future, discounted to the date certain. The discount is determined by the interest rate specified by the parties if the rate was not manifestly unreasonable at the time the transaction was entered into; otherwise, the discount is determined by a commercially reasonable rate that takes into account the facts and circumstances of each case at the time the transaction was entered into.\n(v) \"Purchase\" includes taking by sale, lease, mortgage, security interest, pledge, gift, or any other voluntary transaction creating an interest in goods.\n(w) \"Sublease\" means a lease of goods the right to possession and use of which was acquired by the lessor as a lessee under an existing lease.\n(x) \"Supplier\" means a person from whom a lessor buys or leases goods to be leased under a finance lease.\n(y) \"Supply contract\" means a contract under which a lessor buys or leases goods to be leased.\n(z) \"Termination\" occurs when either party pursuant to a power created by agreement or law puts an end to the lease contract otherwise than for default.\n(2) Other definitions applying to this article and the sections in which they appear are:\n\"Accessions.\" Section 336.2A-310(1).\n\"Construction mortgage.\" Section 336.2A-309(1)(d).\n\"Encumbrance.\" Section 336.2A-309(1)(e).\n\"Fixtures.\" Section 336.2A-309(1)(a).\n\"Fixture filing.\" Section 336.2A-309(1)(b).\n\"Purchase money lease.\" Section 336.2A-309(1)(c).\n(3) The following definitions in other articles apply to this article:\n\"Account.\" Section 336.9-102(a)(2).\n\"Between merchants.\" Section 336.2-104(3).\n\"Buyer.\" Section 336.2-103(1)(a).\n\"Chattel paper.\" Section 336.9-102(a)(11).\n\"Consumer goods.\" Section 336.9-102(a)(23).\n\"Document.\" Section 336.9-102(a)(30).\n\"Entrusting.\" Section 336.2-403(3).\n\"General intangible.\" Section 336.9-102(a)(42).\n\"Instrument.\" Section 336.9-102(a)(47).\n\"Merchant.\" Section 336.2-104(1).\n\"Mortgage.\" Section 336.9-102(a)(55).\n\"Pursuant to commitment.\" Section 336.9-102(a)(69).\n\"Receipt.\" Section 336.2-103(1)(c).\n\"Sale.\" Section 336.2-106(1).\n\"Sale on approval.\" Section 336.2-326.\n\"Sale or return.\" Section 336.2-326.\n\"Seller.\" Section 336.2-103(1)(d).\n(4) In addition, sections 336.1-101 to 336.1-310 contain general definitions and principles of construction and interpretation applicable throughout this article.",
	"repealed": false
}