{
	"id": "103E.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.401",
	"title": "103E.401 USE OF DRAINAGE SYSTEM AS OUTLET.",
	"text": "If the commissioner purchases wetlands under section 97A.145, the commissioner must recognize that when a majority of landowners or owners of a majority of the land in the watershed petition for a drainage outlet, the state should not interfere with or unnecessarily delay the drainage proceedings if the proceedings are conducted according to this chapter.\nAfter the construction of a drainage project, a public or private drainage system that drains property not assessed for benefits for the established drainage system may not be constructed to use the established drainage system as an outlet without obtaining express authority from the drainage authority having jurisdiction over the drainage system proposed to be used as the outlet. This section is applicable to the construction of a public or private drainage system that outlets water into an established drainage system regardless of the actual physical connection.\nA person seeking authority to use an established drainage system as an outlet must petition the drainage authority. When the petition is filed, the drainage authority in consultation with the auditor shall set a time and location for a hearing on the petition and shall give notice by mail and notice by publication of the hearing. The auditor must be paid the actual costs for the hearing notices by the petitioner.\nAt the hearing the drainage authority shall consider the capacity of the outlet drainage system. If express authority is given to use the drainage system as an outlet, the drainage authority shall state, by order, the terms and conditions for use of the established drainage system as an outlet and shall set the amount to be paid as an outlet fee. The order must describe the property to be benefited by the drainage system and must state the amount of benefits to the property for the outlet. The property benefited is liable for assessments levied after that time in the drainage system, on the basis of the benefits as if the benefits had been determined in the order establishing the drainage system.\nA private drainage system may not be constructed to use the established drainage system as an outlet until the outlet fee, set by order, is paid by the petitioner to the county treasurer where the petitioner's property is located.\nThe outlet fee for a proposed drainage project is a part of the cost of the proposed drainage project and is to be paid by assessment against the property benefited by the proposed drainage project, under section 103E.601, and credited to the established drainage system account.\n(a) The drainage authority must notify an owner of property where an unauthorized outlet into a drainage system is located and direct the property owner to block the outlet or otherwise make the outlet ineffective by a specified time. The outlet must be blocked and remain ineffective until:\n(1) an outlet fee is paid, which is determined by the drainage authority based on the benefits received by the property for the period the unauthorized outlet was operational; and\n(2) the drainage authority approves a petition for the outlet and establishes the outlet fee.\n(b) If a property owner does not block or make the outlet ineffective after being notified, the drainage authority must issue an order to have the work performed to bring the outlet into compliance. After the work is completed, the drainage authority must send a statement to the auditor of the county where the property is located and to the property owner where the unauthorized outlet is located, containing the expenses incurred to bring the outlet into compliance and the outlet fee based on the benefits received by the property during the period the unauthorized outlet was operational.\n(a) The amount of the expenses and outlet fee is a lien in favor of the drainage authority against the property where the unauthorized outlet is located. The auditor must certify the expenses and outlet fee and enter the amount in the same manner as other drainage liens on the tax list for the following year. The amount must be collected in the same manner as real estate taxes for the property. The provisions of law relating to the collection of real estate taxes shall be used to enforce payment of amounts due under this section. The auditor must include a notice of collection of unauthorized outlet compliance expenses with the tax statement.\n(b) The amounts collected under this subdivision must be deposited in the drainage system account.",
	"repealed": false
}