{
	"id": "273.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.05",
	"title": "273.05 ASSESSORS; APPOINTMENT, TERM, AND OATH.",
	"text": "Notwithstanding any other provision of law all town assessors shall be appointed by the town board, and notwithstanding any charter provisions to the contrary, all city assessors shall be appointed by the city council or other appointing authority as provided by law or charter. They shall be selected and appointed because of their knowledge and training in the field of property taxation. All town and statutory city assessors shall be appointed for indefinite terms. A town or statutory city assessor who is an employee may be dismissed by the appointing authority for cause. The term of the town or city assessors may be terminated at any time by the town board or city council on charges by the commissioner of revenue of inefficiency or neglect of duty. Vacancies in the office of town or city assessor shall be filled within 90 days by appointment of the respective appointing authority indicated above. If the vacancy is not filled within 90 days, the office shall be terminated. When a vacancy in the office of town or city assessor is not filled by appointment, and it is imperative that the office of assessor be filled, the county auditor shall appoint some resident of the county as assessor for such town or city. The county auditor may appoint the county assessor as assessor for such town or city, in which case the town or city shall pay to the county treasurer the amount determined by the county auditor to be due for the services performed and expenses incurred by the county assessor in acting as assessor for such town or city. The term of any town or statutory city assessor in a county electing in accordance with section 273.052 shall be terminated as provided in section 273.055.\nThe commissioner of revenue may recommend to the state board of assessors the nonrenewal, suspension, or revocation of an assessor's license as provided in sections 270.41 to 270.50.\nEvery person elected or appointed to the office of assessor, at or before the time of receiving the assessment books, shall take and subscribe an oath to be diligent, faithful, and impartial in performance of the duties enjoined on the assessor by law. Failure to take the oath within the time prescribed shall be deemed a refusal to serve.\nIn the case of cities or townships, except cities or towns located in Ramsey County or which have elected a county assessor system in accordance with section 273.055, the commissioner shall allow the city or town 90 days from the date of incorporation or organization to employ a licensed assessor.",
	"repealed": false
}