{
	"id": "144.565",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.565",
	"title": "144.565 DIAGNOSTIC IMAGING FACILITIES.",
	"text": "The commissioner shall require diagnostic imaging facilities and providers of diagnostic imaging services in Minnesota to report by March 1 each year for the preceding fiscal year to the commissioner, in the form and manner specified by the commissioner:\n(1) utilization data for each health plan company and each public program, including workers' compensation, of diagnostic imaging services as defined in subdivision 4, paragraph (c);\n(2) the names of all physicians with any financial or economic interest excluding salaried physicians, unless the physicians' salary is adjusted for volume of service, and all other individuals with a ten percent or greater financial or economic interest in the facility;\n(3) the location where procedures were performed;\n(4) the number of units of each type of fixed, portable, and mobile scanner used at each location;\n(5) the average number of hours per month each mobile scanner was operated at each location;\n(6) the number of hours per month each scanner was leased, if applicable;\n(7) the total number of diagnostic imaging procedures billed for by the provider at each location, by type of diagnostic imaging service as defined in subdivision 4, paragraph (c); and\n(8) a report on major health care capital expenditures during the previous year, as required by section 62J.17.\nIf the report is not filed or the commissioner of health has reason to believe the report is incomplete or false, the commissioner shall have the right to inspect diagnostic imaging facility books, audits, and records.\nIf any entity owns more than one diagnostic imaging facility, that entity must report by individual facility. Reports must include only services that were billed by the provider of diagnostic imaging services submitting the report. If a diagnostic imaging facility leases capacity, technical services, or professional services to one or more other providers of diagnostic imaging services, each provider must submit a separate annual report to the commissioner for all diagnostic imaging services that it provided and billed. The owner of the leased capacity must provide a report listing the names and addresses of providers to whom the diagnostic imaging services and equipment were leased.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Diagnostic imaging facility\" means a health care facility that is not a hospital or location licensed as a hospital which offers diagnostic imaging services in Minnesota, regardless of whether the equipment used to provide the service is owned or leased. For the purposes of this section, diagnostic imaging facility includes, but is not limited to, facilities such as a physician's office, clinic, mobile transport vehicle, outpatient imaging center, or surgical center. A dental clinic or office is not considered a diagnostic imaging facility for the purpose of this section when the clinic or office performs diagnostic imaging through dental cone beam computerized tomography.\n(c) \"Diagnostic imaging service\" means the use of ionizing radiation or other imaging technique on a human patient including but not limited to magnetic resonance imaging (MRI) or computerized tomography (CT) other than dental cone beam computerized tomography, positron emission tomography (PET), or single photon emission computerized tomography (SPECT) scans using fixed, portable, or mobile equipment.\n(d) \"Financial or economic interest\" means a direct or indirect:\n(1) equity or debt security issued by an entity, including, but not limited to, shares of stock in a corporation, membership in a limited liability company, beneficial interest in a trust, units or other interests in a partnership, bonds, debentures, notes or other equity interests or debt instruments, or any contractual arrangements;\n(2) membership, proprietary interest, or co-ownership with an individual, group, or organization to which patients, clients, or customers are referred to; or\n(3) employer-employee or independent contractor relationship, including, but not limited to, those that may occur in a limited partnership, profit-sharing arrangement, or other similar arrangement with any facility to which patients are referred, including any compensation between a facility and a health care provider, the group practice of which the provider is a member or employee or a related party with respect to any of them.\n(e) \"Fixed equipment\" means a stationary diagnostic imaging machine installed in a permanent location.\n(f) \"Mobile equipment\" means a diagnostic imaging machine in a self-contained transport vehicle designed to be brought to a temporary off-site location to perform diagnostic imaging services.\n(g) \"Portable equipment\" means a diagnostic imaging machine designed to be temporarily transported within a permanent location to perform diagnostic imaging services.\n(h) \"Provider of diagnostic imaging services\" means a diagnostic imaging facility or an entity that offers and bills for diagnostic imaging services at a facility owned or leased by the entity.\nAll reports filed pursuant to this section shall be open to public inspection.",
	"repealed": false
}