{
	"id": "259.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.75",
	"title": "259.75 STATE ADOPTION EXCHANGE.",
	"text": "The commissioner of children, youth, and families shall establish an adoption exchange that contains a photograph and description of each child who has been legally freed for adoption. The exchange service shall be available to all local social service agencies and licensed child-placing agencies whose purpose is to assist in the adoptive placement of children.\nAll local social service agencies, and licensed child-placing agencies shall send to the state adoption exchange, within 45 days of the time a child becomes free for adoption, a recent photograph and description of each child in its care who has been legally freed for adoption by the termination of parental rights, and for whom no adoptive home has been found.\nAll children identified under subdivision 2 must be listed on the state adoption exchange within 20 days of the receipt of the information from the local social service agency or licensed child-placing agency.\nChanges in the status of a child listed in the state adoption exchange shall be reported by the local social service agency and the licensed child-placing agency to the exchange within ten working days after the change occurs.\nChildren remaining registered for 12 months shall have their photographs and written descriptions updated by the local social service agency and the licensed child-placing agency within ten working days of the expiration of the 12 months, and every 12 months thereafter.\nA child's registration shall be withdrawn when the exchange service has been notified in writing by the local social service agency or the licensed child-placing agency that the child has been placed in an adoptive home, has died, or is no longer under the guardianship of the commissioner and is no longer seeking an adoptive home.\n(a) The commissioner shall review the state adoption exchange status of children identified under subdivision 2, including a child whose registration was withdrawn pursuant to subdivision 5. The commissioner may determine that a child who is unregistered, or whose registration has been deferred, must be registered and require the authorized child-placing agency to register the child with the state adoption exchange within ten working days of the commissioner's determination.\n(b) Periodic reviews shall be made by the commissioner to determine the progress toward adoption of children registered in the state adoption exchange.\nA local social service agency and a licensed child-placing agency may voluntarily refer any child legally freed for adoption to the exchange service; or the exchange service may determine that the recruitment of an adoptive family through the exchange book is appropriate for a child not registered with the service and require the child to be registered with the exchange service within ten working days.\nDeferral of the listing of a child with the state adoption exchange shall be only for one or more of the following reasons:\n(a) the child is in an adoptive placement but is not legally adopted;\n(b) the child's foster parents or other individuals are now considering adoption;\n(c) diagnostic study or testing is required to clarify the child's problem and provide an adequate description; or\n(d) the child is currently in a hospital and continuing need for daily professional care will not permit placement in a family setting.\nApproval of a request to defer listing for any of the reasons specified in paragraph (b) or (c) shall be valid for a period not to exceed 90 days, with no subsequent deferrals for those reasons.\nThe commissioner of children, youth, and families shall make rules as necessary to administer this section and shall employ necessary staff to carry out the purposes of this section. The commissioner may contract for services to carry out the purposes of this section.",
	"repealed": false
}