{
	"id": "325G.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.205",
	"title": "325G.205 ASSISTIVE DEVICE REPLACEMENT OR REFUND.",
	"text": "If, after a reasonable attempt to repair, the nonconformity is not repaired, the manufacturer shall carry out, at the option of the consumer, the requirements under paragraph (a) or (b), whichever is appropriate.\n(a) To provide for refunds, at the request of the consumer, the manufacturer shall do one of the following:\n(1) accept return of the assistive device and refund to the consumer and to a holder of a perfected security interest in the consumer's assistive device, as their interest may appear, the full purchase price plus any finance charge, amount paid by the consumer at the point of sale and collateral costs, less a reasonable allowance for use; or\n(2) accept return of the assistive device, refund to the assistive device lessor and to a holder of a perfected security interest in the assistive device, as their interest may appear, the current value of the written lease and refund to the consumer the amount that the consumer paid under the written lease plus collateral costs, less a reasonable allowance for use.\n(b) To receive a comparable new assistive device, a consumer shall offer to the manufacturer of the assistive device having the nonconformity to transfer possession of that assistive device to that manufacturer. No later than 30 days after that offer, the manufacturer shall provide the consumer with the comparable new assistive device or a refund. When the manufacturer provides the new assistive device or refund, the consumer shall return the assistive device having the nonconformity to the manufacturer, along with any endorsements necessary to transfer real possession to the manufacturer.\nIf, after a reasonable attempt to repair, the nonconformity is not repaired, an assistive device lessor shall receive a refund from the manufacturer. To receive a refund, the assistive device lessor shall offer to transfer possession of a nonconforming assistive device to its manufacturer. No later than 30 days after that offer, the manufacturer shall provide the refund to the assistive device lessor. When the manufacturer provides the refund, the assistive device lessor shall provide to the manufacturer any endorsements necessary to transfer legal possession to the manufacturer.\nUnder this section, the current value of the written lease equals the total amount for which that lease obligates the consumer during the period of the lease remaining after its early termination, plus the assistive device dealer's early termination costs and the value of the assistive device at the lease expiration date if the lease sets forth that value, less the assistive device lessor's early termination savings.\nUnder this section, a reasonable allowance for use may not exceed the amount obtained by multiplying the total amount the consumer paid or for which the written lease obligates the consumer by a fraction, the denominator of which is 1,825 and the numerator of which is the number of days that the consumer used the assistive device before first reporting the nonconformity to the manufacturer, assistive device lessor, or assistive device dealer.\nNo person may enforce the lease against the consumer after the consumer receives a refund.",
	"repealed": false
}