{
	"id": "473.858",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.858",
	"title": "473.858 COMPREHENSIVE PLANS; LOCAL GOVERNMENTAL UNITS.",
	"text": "Within nine months following the receipt of a metropolitan system statement for an amendment to a metropolitan system plan and within three years following the receipt of a metropolitan system statement issued in conjunction with the decennial review required under section 473.864, subdivision 2, every local governmental unit shall have reviewed and, if necessary, amended its comprehensive plan in accordance with sections 462.355, 473.175, and 473.851 to 473.871 and the applicable planning statute and shall have submitted the plan to the Metropolitan Council for review pursuant to section 473.175. The provisions of sections 462.355, 473.175, and 473.851 to 473.871 shall supersede the provisions of the applicable planning statute wherever a conflict may exist. If the comprehensive municipal plan is in conflict with the zoning ordinance, the zoning ordinance shall be brought into conformance with the plan by local government units in conjunction with the review and, if necessary, amendment of its comprehensive plan required under section 473.864, subdivision 2. A local government unit shall not adopt any fiscal device or official control which is in conflict with its comprehensive plan, including any amendments to the plan, or which permits activity in conflict with metropolitan system plans, as defined by section 473.852, subdivision 8. The comprehensive plan shall provide guidelines for the timing and sequence of the adoption of official controls to ensure planned, orderly, and staged development and redevelopment consistent with the comprehensive plan. For purposes of this section, a fiscal device or official control shall not be considered to be in conflict with a local government unit's comprehensive plan or to permit an activity in conflict with metropolitan system plans if such fiscal device or official control is adopted to ensure the planned, orderly, and staged development of urbanization or redevelopment areas designated in the comprehensive plan pursuant to section 473.859, subdivision 5.\nLocal governmental units shall submit their proposed plans to adjacent governmental units, affected special districts lying in whole or in part within the metropolitan area, and affected school districts for review and comment at least six months prior to submission of the plan to the council and shall submit copies to them on the submission of the plan to the council. For minor plan amendments, the council may prescribe a shorter review and comment period, or may waive the review and comment period if the minor plan amendments involve lands that are not contiguous to other local governmental units.\nThe plans shall be submitted to the council following recommendation by the planning agency of the unit and after consideration but before final approval by the governing body of the unit.\nComprehensive plans, capital improvement programs, sewer policy plans and official controls of local governmental units adopted prior to the requirements of sections 462.355, 473.175, and 473.851 to 473.871 shall remain in force and effect until amended, repealed or superseded by plans or controls adopted pursuant to sections 462.355, 473.175, and 473.851 to 473.871. Existing comprehensive plans, capital improvement programs, sewer policy plans, and official controls may be amended and new capital improvement programs and official controls may be prepared and adopted prior to the submission to the council of comprehensive plans required by sections 462.355, 473.175, and 473.851 to 473.871.",
	"repealed": false
}