{
	"id": "16B.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.33",
	"title": "16B.33 DESIGNER SELECTION BOARD.",
	"text": "(a) As used in this section, the following terms have the meanings given them:\n(b) \"Agency\" has the meaning given in section 16B.01.\n(c) \"Architect\" means an architect or landscape architect registered to practice under sections 326.02 to 326.15.\n(d) \"Board\" means the state Designer Selection Board.\n(e) \"Design-build\" means the process of entering into and managing a single contract between the commissioner and the design-builder in which the design-builder agrees to both design and construct a project as specified in the contract at a guaranteed maximum or a fixed price.\n(f) \"Design-builder\" means a person who proposes to design and construct a project in accordance with the requirements of section 16C.33.\n(g) \"Designer\" means an architect or engineer, or a partnership, association, or corporation comprised primarily of architects or engineers or of both architects and engineers.\n(h) \"Engineer\" means an engineer registered to practice under sections 326.02 to 326.15.\n(i) \"Person\" includes an individual, corporation, partnership, association, or any other legal entity.\n(j) \"Primary designer\" means the designer who is to have primary design responsibility for a project, and does not include designers who are merely consulted by the user agency and do not have substantial design responsibility, or designers who will or may be employed or consulted by the primary designer.\n(k) \"Project\" means an undertaking to construct, erect, or remodel a building by or for the state or an agency. Capital projects exempt from the requirements of this section include demolition or decommissioning of state assets; hazardous materials abatement; repair and replacement of utility infrastructure, parking lots, and parking structures; security upgrades; building systems replacement or repair, including alterations to building interiors needed to accommodate the systems; and other asset preservation work not involving remodeling of occupied space.\n(l) \"User agency\" means the agency undertaking a specific project. For projects undertaken by the state of Minnesota, \"user agency\" means the Department of Administration or a state agency with an appropriate delegation to act on behalf of the Department of Administration.\n(a) Membership. The state Designer Selection Board consists of seven individuals, the majority of whom must be Minnesota residents. Each of the following four organizations shall nominate one individual whose name and qualifications shall be submitted to the commissioner of administration for consideration: the Consulting Engineers Council of Minnesota after consultation with other professional engineering societies in the state; the AIA Minnesota; the Minnesota chapter of the Associated General Contractors after consultation with other commercial contractor associations in the state; and the Minnesota Board of the Arts. The commissioner may appoint the four named individuals to the board but may reject a nominated individual and request another nomination. The fifth member shall be a representative of the user agency, the University of Minnesota, or the Minnesota State Colleges and Universities, designated by the user agency. The remaining two citizen members shall also be appointed by the commissioner.\n(b) Nonvoting member. In addition to the seven members of the board, one nonvoting member representing the commissioner shall participate in the interviewing and selection of designers pursuant to this section.\n(c) Terms; compensation; removal; vacancies. The membership terms, compensation, removal of members, and filling of vacancies on the board are as provided in section 15.0575. No individual may serve for more than two consecutive terms.\n(d) Officers, rules. At its first meeting, the board shall elect a voting member of the board as chair. The board shall also elect other officers necessary for the conduct of its affairs. The board shall adopt rules governing its operations and the conduct of its meetings. The rules shall provide for the terms of the chair and other officers.\n(e) Meetings. The board shall meet as often as is necessary, not less than twice annually, in order to act expeditiously on requests submitted to it for selection of primary designers.\n(f) Office, staff, records. The Department of Administration shall provide the board with suitable quarters to maintain an office, hold meetings, and keep records. The commissioner shall designate an employee of the Department of Administration to serve as executive secretary to the board and shall furnish a secretarial staff to the board as necessary for the expeditious conduct of the board's duties and responsibilities.\n(a) Application. Upon undertaking a project with an estimated cost greater than $4,000,000 or a planning project with estimated fees greater than $400,000, every user agency, except the Capitol Area Architectural and Planning Board, shall submit a written request for a primary designer for its project to the commissioner, who shall forward the request to the board. The University of Minnesota and the Minnesota State Colleges and Universities shall follow the process in subdivision 3a to select designers for their projects. The written request must include a description of the project, the estimated cost of completing the project, a description of any special requirements or unique features of the proposed project, and other information which will assist the board in carrying out its duties and responsibilities set forth in this section.\n(b) Reactivated project. If a project for which a designer has been selected by the board becomes inactive, lapses, or changes as a result of project phasing, insufficient appropriations, or other reasons, the commissioner, the Minnesota State Colleges and Universities, or the University of Minnesota may, if the project is reactivated, retain the same designer to complete the project.\n(c) Fee limit reached after designer selected. If a project initially estimated to be below the cost and planning fee limits of this subdivision has its cost or planning fees revised so that the limits are exceeded, the project must be referred to the board for designer selection even if a primary designer has already been selected. In this event, the board may, without conducting interviews, elect to retain the previously selected designer if it determines that the interests of the state are best served by that decision and shall notify the commissioner of its determination.\n(a) When the University of Minnesota or the Minnesota State Colleges and Universities undertakes a project involving construction or major remodeling, as defined in section 16B.335, subdivision 1, with an estimated cost greater than $4,000,000 or a planning project with estimated fees greater than $400,000, the system shall submit a written request for a primary designer to the commissioner, as provided in subdivision 3.\n(b) When the University of Minnesota or the Minnesota State Colleges and Universities undertakes a project involving renovation, repair, replacement, or rehabilitation, the system office may submit a written request for a primary designer to the commissioner as provided in subdivision 3.\n(c) For projects at the University of Minnesota or the State Colleges and Universities, the board shall select at least two primary designers under subdivision 4 for recommendation to the Board of Regents or the Board of Trustees. Meeting records or written evaluations that document the final selection are public records. The Board of Regents or the Board of Trustees shall notify the commissioner of the designer selected from the recommendations.\n(a) Publicity. Upon receipt of a request from a user agency for a primary designer, the board shall publicize the proposed project in order to determine the identity of designers interested in the design work on the project. The board shall establish criteria for the selection process and make this information public, and shall compile data on and conduct interviews of designers. The board's selection criteria must include consideration of each interested designer's performance on previous projects for the state or any other person. Upon completing the process, the board shall select the primary designer and shall state its reasons in writing. If the board's vote for the selection of a primary designer results in a tie vote, the nonvoting member appointed under subdivision 2, paragraph (b), must vote for the selection of the primary designer. Notification to the commissioner of the selection shall be made not more than 60 days after receipt from a user agency of a request for a primary designer. The commissioner shall promptly notify the designer and the user agency. The commissioner shall negotiate the designer's fee and prepare the contract to be entered into between the designer and the user agency.\n(b) Conflict of interest. A board member may not participate in the review, discussion, or selection of a designer or firm in which the member has a financial interest.\n(c) Selection by commissioner. In the event the board receives a request for a primary designer on a project, the estimated cost of which is less than the limit established by subdivision 3, or a planning project with estimated fees of less than the limit established by subdivision 3, the board may submit the request to the commissioner of administration, with or without recommendations, and the commissioner shall thereupon select the primary designer for the project.\n(d) Second selection. If the designer selected for a project declines the appointment or is unable to reach agreement with the commissioner on the fee or the terms of the contract, the commissioner shall, within 60 days after the first appointment, request the board to make another selection.\n(e) Sixty days to select. If the board fails to make a selection and forward its recommendation to the commissioner within 60 days of the user agency's request for a designer, the commissioner may appoint a designer to the project without the recommendation of the board.\n(f) Less than satisfactory performance. The commissioner, or the University of Minnesota and the Minnesota State Colleges and Universities for projects under their supervision, shall forward to the board a written report describing each instance in which the performance of a designer selected by the board or the commissioner has been less than satisfactory. Criteria for determining satisfaction include the ability of the designer to complete design work on time, to provide a design responsive to program needs within the constraints of the budget, to solve design problems and achieve a design consistent with the proposed function of the building, to avoid costly design errors or omissions, and to observe the construction work. These reports are public data and are available for inspection under section 13.03.\n[Expired]\nNo later than December 31 of every fifth year starting in 2025, the commissioner shall determine the percentage increase in the rate of inflation, as measured by the Means Quarterly Construction Cost Index, during the four-year period preceding that year. The thresholds in subdivisions 3, paragraph (a); and 3a, paragraph (a), shall be increased by the percentage calculated by the commissioner to the nearest ten-thousandth dollar.",
	"repealed": false
}