{
	"id": "206.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.90",
	"title": "206.90 OPTICAL SCAN VOTING SYSTEMS.",
	"text": "For the purposes of this section, \"optical scan voting system\" means an electronic voting system approved for use under sections 206.80 to 206.81 in which the voter records votes by marking with a pencil or other device, including an electronic ballot marker, a ballot on which the names of candidates, office titles, party designation in a partisan primary or election, and a statement of any question accompanied by the words \"Yes\" and \"No\" are printed.\nTo the extent possible, procedures for using an optical scan voting system must be the same as those used for other electronic voting systems, unless this section provides otherwise.\nAt a state or county election where an optical scan voting system will be in use, the county auditor may provide ballot cards meeting the requirements of this section in lieu of paper ballots otherwise required to be prepared by the county auditor. In an election jurisdiction where an optical scan voting system has been adopted, the election official may provide paper ballots prepared in the same format used for the voting system.\nAn optical scan voting system may be used for absentee voting. The county auditor may supply an appropriate marking instrument to the voter along with the ballot.\nIn instructing judges and voters under section 206.84, subdivision 1, officials in charge of election precincts using optical scan voting systems shall include instruction on the proper mark for recording votes on ballot cards marked with a pencil or other writing instrument and the insertion by the voter of the ballot card into automatic tabulating equipment that examines and counts votes as the ballot card is deposited into the ballot box.\nOfficials shall include instruction on the insertion by the voter of the ballot card into an electronic ballot marker that can examine votes before the ballot card is deposited into the ballot box.\nIn precincts using optical scan voting systems, a single ballot card on which all ballot information is included must be printed in black ink on white colored material except that marks not to be read by the automatic tabulating equipment may be printed in another color ink. In state elections, a single ballot title must be used, as provided in sections 204D.08, subdivision 6, and 204D.11, subdivision 1. When both municipal and school district offices or questions appear on the ballot, the single ballot title \"City (or Town) and School District Ballot\" must be used.\nOn the front of the ballot must be printed the words \"Official Ballot\" and the date of the election and lines for the initials of at least two election judges.\nWhen optical scan ballots are used, the offices to be elected must appear in the following order: federal offices; state legislative offices; constitutional offices; proposed constitutional amendments; county offices and questions; municipal offices and questions; school district offices and questions; special district offices and questions; and judicial offices.\nOn optical scan ballots, the names of candidates and the words \"yes\" and \"no\" for ballot questions must be printed as close to their corresponding vote targets as possible.\nThe line on an optical scan ballot for write-in votes must contain the words \"write-in, if any.\"\nIf a primary ballot contains both a partisan ballot and a nonpartisan ballot, the instructions to voters must include a statement that reads substantially as follows: \"This ballot card contains a partisan ballot and a nonpartisan ballot. On the partisan ballot you are permitted to vote for candidates of one political party only.\" If a primary ballot contains political party columns on both sides of the ballot, the instructions to voters must include a statement that reads substantially as follows: \"Additional political parties are printed on the other side of this ballot. Vote for one political party only.\" At the bottom of each political party column on the primary ballot, the ballot must contain a statement that reads substantially as follows: \"Continue voting on the nonpartisan ballot.\" The instructions in section 204D.08, subdivision 4, do not apply to optical scan partisan primary ballots. Electronic ballot displays and audio ballot readers must follow the order of offices and questions on the optical scan or paper ballot used in the same precinct, or the sample ballot posted for that precinct.\nIn precincts where an optical scan voting system is used, the number of voting booths must be sufficient to provide for the number of voters expected. Information needed to enable voters to mark ballot cards quickly and correctly must be posted in each voting booth.\nThe official in charge of elections in each municipality where an optical scan voting system is used shall have the electronic ballot marker that examines and marks votes on ballot cards and the automatic tabulating equipment that examines and counts votes as ballot cards are deposited into ballot boxes put in order, set, adjusted, and made ready for voting when delivered to the election precincts. Whenever a ballot card created by an electronic ballot marker certified by the secretary of state is rejected by an optical scan voting system, two election judges who are members of different major political parties shall transcribe the votes on the ballot rejected by the optical scan voting system pursuant to the procedures set forth in section 206.86, subdivision 5.\nAutomatic tabulating equipment and electronic ballot markers must be capable of examining a ballot card for defects and returning it to the voter before it is counted and deposited into the ballot box and must be programmed to return as a spoiled ballot a ballot card with votes for an office or question which exceed the number which the voter is entitled to cast and at a primary a ballot card with votes for candidates of more than one party.\nNotwithstanding section 204C.22, subdivision 4, in precincts using optical scan voting systems, the ballot must be marked in the oval or other target shape opposite the blank when a voter writes an individual's name on the line provided for write-in votes in order to be counted. The judges shall count the write-in votes and enter the number of those votes on forms provided for the purpose. When the write-in votes are recorded on a medium that cannot be examined for write-in votes by the automatic tabulating equipment or the automatic tabulating equipment does not reject, with respect to write-in votes, all votes for an office or question when the number of votes cast on it exceeds the number which the voter is entitled to count, all ballot envelopes or other medium on which write-in votes have been recorded must be serially numbered, starting with the number one and the same number must be placed on the ballot card of the voter. The judges shall compare the write-in votes with the votes cast on the ballot card. If the total number of votes for any office exceeds the number allowed by law, a notation to that effect must be entered on the back of the ballot card and the card must be returned to the counting center in an envelope marked \"defective ballots\"; however, valid votes on ballot cards containing invalid votes must be counted as provided in section 206.86, subdivision 5.\nWhen the write-in votes are recorded on ballot cards that can be examined for write-in votes by the automatic tabulating equipment and the automatic tabulating equipment rejects all votes for an office or question when the number of votes cast on it exceeds the number which the voter is entitled to cast, the judges shall examine the ballot cards with write-in votes and count the valid write-in votes.",
	"repealed": false
}