{
	"id": "83.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.20",
	"title": "83.20 DEFINITIONS.",
	"text": "\"Advertisement\" means any written or printed communication or any communication by telephone or transmitted on radio, television, electronic means or similar communications media published in connection with the offer or sale of subdivided lands or any communication made to induce prospective purchasers to visit or attend an offer or sales presentation.\n\"Agent\" means any person who represents, or acts for or on behalf of, a subdivider in disposing of subdivided lands or lots in a subdivision, and includes a real estate salesperson or broker, but does not include an attorney at law whose representation of another person consists solely of rendering legal services.\n\"Blanket encumbrance\" means a trust deed or mortgage or mechanics lien or any other lien or financial encumbrance, securing or evidencing money debt and affecting lands to be subdivided or affecting more than one lot, parcel, unit or interest of subdivided land; or an agreement affecting more than one lot, parcel unit or interest by which the subdivider holds the subdivision under an option, contract for deed, contract to purchase or trust agreement, except a lien or other encumbrance arising as a result of the imposition of a tax assessment by a public authority so long as no portion thereof is past due.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota or the commissioner's authorized delegate.\n\"Sale\" or \"sell\" means every contract or agreement to convey an interest, including a leasehold interest, in subdivided land for value.\n\"Notice\" means a communication from the commissioner. Notice to subdividers shall be deemed complete when personally served upon or mailed to the subdivider's address currently on file with the commissioner.\n\"Offer\" includes every inducement, solicitation or attempt to encourage a person to acquire a lot, unit, parcel or interest in land.\n\"Option\" means, and is limited to, an offer to sell or to purchase respecting which a consideration of not more than 15 percent of the total purchase price is exchanged to guarantee that the offer will not be withdrawn or revoked for an agreed period of time.\n\"Person\" means an individual, corporation, government or governmental division or agency, business trust, estate, trust, partnership, unincorporated association, two or more of any of the foregoing having a joint or common interest or any other legal or commercial entity.\n\"Purchaser\" means a person who acquires or attempts to acquire or succeeds to an interest in land.\n\"Subdivision\" or \"subdivided land\" means any real estate, wherever located, improved or unimproved, which is divided or proposed to be divided for the purpose of sale or lease, including sales or leases of any timeshare interest, unit in a common interest community, or similar interest in real estate.\n\"Subdivider\" means a person whose interest in subdivided land is offered or advertised, by the person or the person's agent, for disposition.\n\"Timeshare interest\" means a right to occupy a unit or any of several units during intermittent time periods over a period of at least three years, including renewal options, whether or not coupled with a freehold estate or an estate for years.\n\"Improved lots\" means lots which have or will have within a two-year period from the date of purchase, a permanent residential structure thereon, and are not devoted to or used as a time share interest, unit in a common interest community, or similar interest in real estate.\n\"Advance payment\" means any money paid in advance regardless of its descriptive nomenclature, including but not limited to, management fee, listing, security, or advance fee or payment in connection with the resale of a timeshare interest.",
	"repealed": false
}