{
	"id": "315.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.15",
	"title": "315.15 PARISH CORPORATIONS, ORGANIZATION.",
	"text": "The bishop of a religious denomination may join with the vicar general of the diocese and the pastor of the parish where the corporation is to be located, within the bishop's diocese for the purpose of incorporating. The bishop, vicar general, and pastor, or a majority of them, shall designate and join with two lay members of the denomination. These five shall adopt, sign, and acknowledge a certificate of incorporation reciting the fact of association, and the selection of lay members, and containing the name, general purpose, and place of location of the corporation. When they have recorded the certificate with the county recorder of the county where the corporation is located, they and their successors become a corporation, subject to the requirements, and with the rights, powers, and privileges, of a religious corporation.\nThe persons at any time holding the offices specified in any diocese are, by virtue of their respective offices, members of the corporation and, with the two lay members, constitute it, but on ceasing to hold office, they cease to be members, and their successors in office become members. The two lay members designated remain members for two years from the date of the certificate, after that their term of office is two years, in either case until their successors are chosen. They must always be designated and appointed by the bishop, vicar general, and pastor, who shall also fill vacancies in their number. Their appointment must be in writing and entered upon the records of the corporation. If there is a vacancy in the office of bishop of any diocese, or if another person is appointed in the bishop's stead to administer the spiritual and temporal affairs of the diocese, then, during the vacancy or suspension of authority, the administrator of the affairs of the diocese, or any other person appointed under the rules of the denomination to preside over and administer its affairs, is, while acting as administrator or appointee, a member of the corporation, with the rights and powers of membership; but the membership ends when the vacancy is filled or suspension of authority removed.\nIf a diocese in which the corporation is located is subdivided according to the rules and practice of the denomination, and one or more new dioceses formed from it or its parts, the bishop and vicar general of the new diocese and their successors in office, as soon as appointed and instituted, by virtue of their respective offices, immediately become members of the corporation within the new diocese, with the rights, duties, privileges, powers, and obligations of members. The bishop and vicar general of the diocese where the corporation was located before the subdivision cease to be members of the corporation.",
	"repealed": false
}