{
	"id": "46.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.04",
	"title": "46.04 REGULATORY AUTHORITY OF COMMISSIONER.",
	"text": "The commissioner of commerce, referred to as the commissioner in chapters 46 to 59A, 216C, 332A, and 332B, is vested with all the powers, authority, and privileges which, prior to the enactment of Laws 1909, chapter 201, were conferred by law upon the public examiner, and shall take over all duties in relation to state banks, savings banks, trust companies, savings associations, and other financial institutions within the state which, prior to the enactment of chapter 201, were imposed upon the public examiner. The commissioner of commerce shall exercise a constant supervision, either personally or through the examiners herein provided for, over the books and affairs of all state banks, savings banks, trust companies, savings associations, credit unions, industrial loan and thrift companies, and other financial institutions doing business within this state; and shall, through examiners, examine each financial institution at least once every 24 calendar months. In satisfying this examination requirement, the commissioner may accept reports of examination prepared by a federal agency having comparable supervisory powers and examination procedures. With the exception of industrial loan and thrift companies which do not have deposit liabilities and licensed regulated lenders, it shall be the principal purpose of these examinations to inspect and verify the assets and liabilities of each and so far investigate the character and value of the assets of each institution as to determine with reasonable certainty that the values are correctly carried on its books. Assets and liabilities shall be verified in accordance with methods of procedure which the commissioner may determine to be adequate to carry out the intentions of this section. It shall be the further purpose of these examinations to assess the adequacy of capital protection and the capacity of the institution to meet usual and reasonably anticipated deposit withdrawals and other cash commitments without resorting to excessive borrowing or sale of assets at a significant loss, and to investigate each institution's compliance with applicable laws and rules. Based on the examination findings, the commissioner shall make a determination as to whether the institution is being operated in a safe and sound manner. None of the above provisions limits the commissioner in making additional examinations as deemed necessary or advisable. The commissioner shall investigate the methods of operation and conduct of these institutions and their systems of accounting, to ascertain whether these methods and systems are in accordance with law and sound banking principles. The commissioner may make requirements as to records as deemed necessary to facilitate the carrying out of the commissioner's duties and to properly protect the public interest. The commissioner may examine, or cause to be examined by these examiners, on oath, any officer, director, trustee, owner, agent, clerk, customer, or depositor of any financial institution touching the affairs and business thereof, and may issue, or cause to be issued by the examiners, subpoenas, and administer, or cause to be administered by the examiners, oaths. In case of any refusal to obey any subpoena issued under the commissioner's direction, the refusal may at once be reported to the district court of the district in which the bank or other financial institution is located, and this court shall enforce obedience to these subpoenas in the manner provided by law for enforcing obedience to subpoenas of the court. In all matters relating to official duties, the commissioner of commerce has the power possessed by courts of law to issue subpoenas and cause them to be served and enforced, and all officers, directors, trustees, and employees of state banks, savings banks, trust companies, savings associations, and other financial institutions within the state, and all persons having dealings with or knowledge of the affairs or methods of these institutions, shall afford reasonable facilities for these examinations, make returns and reports to the commissioner of commerce as the commissioner may require; attend and answer, under oath, the commissioner's lawful inquiries; produce and exhibit any books, accounts, documents, and property as the commissioner may desire to inspect, and in all things aid the commissioner in the performance of duties.\nWith respect to specific transactions between a bank holding company and a state bank affiliate, the commissioner of commerce shall have the authority to examine the records of such holding company that directly pertain to such transactions to the same extent such holding company were a state bank or trust company. For purposes of this subdivision, a bank holding company is defined as a company registered as such with the Federal Reserve System pursuant to the Bank Holding Company Act of 1956, as amended.\nFor purposes of examination and regulation of those entities referred to in subdivisions 1 and 2, records may be maintained on optical image storage systems acceptable to the commissioner. Electronically maintained and stored records must meet the following minimum standards:\n(1) a document or record may be transferred to and stored on a nonerasable imaging system and retained only in that format if all documents and records preserved on nonerasable optical imaging systems meet nationally recognized standards for permanent records and are available for retrieval for as long as applicable law requires;\n(2) a backup copy of the record is created and stored at a site other than the site where the original is kept. The backup copy must be preserved either: (i) on a nonerasable optical imaging system; or (ii) by another reproduction method approved by the commissioner; and\n(3) all contracts for third-party maintenance and storage of those records must include assurance of access by the commissioner consistent with the purposes of this section.\n(a) The commissioner when providing forms and procedural guidance to persons governed by or seeking approval to operate under the chapters referred to in this section may prescribe alternatives to paper forms and delivery in person or by mail. In considering accepting filings by facsimile or electronic media, the commissioner may accept fees and reimbursement for costs associated with the applications and notices by wire transfer and debit card.\n(b) Certifications required to authenticate, officiate, or establish standing of the application or notice as a matter of law, rule, or sound business practice may be authenticated in an alternative to paper-based original signatures or notarial seals on facsimile or electronic media submissions in a technically competent means at the discretion of the commissioner, including but not limited to, document imaging meeting the standard in subdivision 3, bar coding, personal identification numbers, or other reliable communicated verification technique.",
	"repealed": false
}