{
	"id": "246C.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.091",
	"title": "246C.091 DIRECT CARE AND TREATMENT ACCOUNTS.",
	"text": "(a) A gifts, grants, and contributions account is created in the special revenue fund in the state treasury. All money received by the executive board as a gift, grant, or contribution must be deposited in the gifts, grants, and contributions account. Beginning July 1, 2025, except as provided in paragraph (b), money in the account is annually appropriated to the Direct Care and Treatment executive board to accomplish the purposes of this chapter. Gifts, grants, or contributions received by the executive board exceeding current agency needs must be invested by the State Board of Investment in accordance with section 11A.24. Disbursements from the gifts, grants, and contributions account must be made in the manner provided for the issuance of other state payments.\n(b) If the gift or contribution is designated for a certain person, institution, or purpose, the Direct Care and Treatment executive board must use the gift or contribution as specified in accordance with the conditions of the gift or contribution if compatible with the best interests of the person and the state. If a gift or contribution is accepted for the use and benefit of a person with a developmental disability, including those within a state hospital, research relating to persons with a developmental disability must be considered an appropriate use of the gift or contribution. Such money must not be used for any structures or installations which by their nature would require state expenditures for their operation or maintenance without specific legislative enactment.\nA facilities management account is created in the special revenue fund of the state treasury. Beginning July 1, 2025, money in the account is appropriated to the Direct Care and Treatment executive board and may be used to maintain buildings, acquire facilities, renovate existing buildings, or acquire land for the design and construction of buildings for Direct Care and Treatment use. Money received for maintaining state property under control of the executive board may be deposited into this account.\n(a) The Direct Care and Treatment systems account is created in the special revenue fund of the state treasury. Beginning July 1, 2025, money in the account is appropriated to the Direct Care and Treatment executive board and may be used for security systems and information technology projects, services, and support under the control of the executive board.\n(b) The commissioner of human services shall transfer all money allocated to the Direct Care and Treatment systems projects under section 256.014 to the Direct Care and Treatment systems account by June 30, 2026.\nThe cemetery maintenance account is created in the special revenue fund of the state treasury. Money in the account is appropriated to the executive board for the maintenance of cemeteries under control of the executive board. Money allocated to Direct Care and Treatment cemeteries may be transferred to this account.",
	"repealed": false
}