{
	"id": "144.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.121",
	"title": "144.121 X-RAY MACHINES; OTHER SOURCES OF IONIZING RADIATION.",
	"text": "The fee for the registration for x-ray equipment and other sources of ionizing radiation required to be registered under rules adopted by the state commissioner of health pursuant to section 144.12, shall be in an amount as described in subdivision 1a pursuant to section 144.122. The registration shall expire and be renewed as prescribed by the commissioner pursuant to section 144.122.\n(a) A facility with ionizing radiation-producing equipment and other sources of ionizing radiation must pay an initial or annual renewal registration fee consisting of a base facility fee of $100 and an additional fee for each x-ray tube, as follows:\n(b) A facility with radiation therapy and accelerator equipment must pay an initial or annual registration fee of $500. A facility with an industrial accelerator must pay an initial or annual registration fee of $150.\n(c) Electron microscopy equipment is exempt from the registration fee requirements of this section.\n(d) For purposes of this section, a security screening system means ionizing radiation-producing equipment designed and used for security screening of humans who are in the custody of a correctional or detention facility, and used by the facility to image and identify contraband items concealed within or on all sides of a human body. For purposes of this section, a correctional or detention facility is a facility licensed under section 241.021 and operated by a state agency or political subdivision charged with detection, enforcement, or incarceration in respect to state criminal and traffic laws.\nApplications for initial or renewal registrations submitted to the commissioner after the time specified by the commissioner shall be accompanied by an amount equal to 25 percent of the fee due in addition to the fees prescribed in subdivision 1a.\n[Repealed, 2007 c 85 s 5]\nA facility that uses handheld dental x-ray equipment according to section 144.1215 must comply with this section.\nPeriodic radiation safety inspections of the x-ray equipment and other sources of ionizing radiation shall be made by the commissioner of health. The frequency of safety inspections shall be prescribed by the commissioner on the basis of the frequency of use of the x-ray equipment and other source of ionizing radiation, provided that each source shall be inspected at least once every four years.\nMS 2018 [Repealed, 2020 c 115 art 1 s 17]\n[Repealed, 2007 c 85 s 5]\n(a) An individual in a facility with x-ray systems for use on living humans that is registered under subdivision 1 may not operate, nor may the facility allow the individual to operate, x-ray systems unless the individual has passed a national or state examination.\n(b) Individuals who may operate x-ray systems include:\n(1) an individual who has passed the American Registry of Radiologic Technologists (ARRT) registry for radiography examination;\n(2) an individual who has passed the American Chiropractic Registry of Radiologic Technologists (ACRRT) registry examination and is limited to radiography of spines and extremities;\n(3) a registered limited scope x-ray operator and a registered bone densitometry equipment operator who passed the examination requirements in paragraphs (d) and (e) and practices according to subdivision 5a;\n(4) an x-ray operator who has the original certificate or the original letter of passing the examination that was required before January 1, 2008, under Minnesota Statutes 2008, section 144.121, subdivision 5a, paragraph (b), clause (1);\n(5) an individual who has passed the American Registry of Radiologic Technologists (ARRT) registry for radiation therapy examination according to subdivision 5e;\n(6) a cardiovascular technologist according to subdivision 5c;\n(7) a nuclear medicine technologist according to subdivision 5d;\n(8) an individual who has passed the examination for a dental hygienist under section 150A.06 and only operates dental x-ray systems;\n(9) an individual who has passed the examination for a dental therapist under section 150A.06 and only operates dental x-ray systems;\n(10) an individual who has passed the examination for a dental assistant under section 150A.06 and only operates dental x-ray systems;\n(11) an individual who has passed the examination under Minnesota Rules, part 3100.8500, subpart 3, and only operates dental x-ray systems; and\n(12) a qualified practitioner who is licensed by a health-related licensing board with active practice authority and is working within the practitioner's scope of practice.\n(c) Except for individuals under clauses (3) and (4), an individual who is participating in a training or educational program in any of the occupations listed in paragraph (b) is exempt from the examination requirement within the scope and for the duration of the training or educational program.\n(d) The Minnesota examination for limited scope x-ray operators must include:\n(1) radiation protection, radiation physics and radiobiology, equipment operation and quality assurance, image acquisition and technical evaluation, and patient interactions and management; and\n(2) at least one of the following regions of the human anatomy: chest, extremities, skull and sinus, spine, or podiatry. The examinations must include the anatomy of, and radiographic positions and projections for, the specific regions.\n(e) The examination for bone densitometry equipment operators must include:\n(1) osteoporosis, bone physiology, bone health and patient education, patient preparation, fundamental principals, biological effects of radiation, units of measurements, radiation protection in bone densitometry, fundamentals of x-ray production, quality control, measuring bone mineral testing, determining quality in bone mineral testing, file and database management; and\n(2) dual x-ray absorptiometry scanning of the lumbar spine, proximal femur, and forearm. The examination must include the anatomy, scan acquisition, and scan analysis for these three procedures.\n(f) A limited scope x-ray operator, and a bone densitometry equipment operator, who are required to take an examination under this subdivision must submit to the commissioner a registration application for the examination and a $25 processing fee. The processing fee shall be deposited in the state treasury and credited to the state government special revenue fund.\nA registered limited scope x-ray operator and a registered bone densitometry equipment operator may only practice medical radiography on limited regions of the human anatomy for which the operator has successfully passed an examination identified in subdivision 5, paragraphs (d) and (e), and may not operate computed tomography, cone beam computed tomography, the use of contrast media, and the use of fluoroscopic or mammographic x-ray systems.\nMS 2018 [Repealed, 2020 c 115 art 1 s 17]\n(a) Cardiovascular technologists may assist with the operation of fluoroscopy equipment if they:\n(1) are credentialed by Cardiovascular Credentialing International as a registered cardiovascular invasive specialist or as a registered cardiac electrophysiology specialist, are a graduate of an educational program accredited by the Commission on Accreditation of Allied Health Education Programs, which uses the standards and criteria established by the Joint Review Committee on Education in Cardiovascular Technology, or are designated on a variance granted by the commissioner effective July 31, 2019; and\n(2) are under the personal supervision and in the physical presence of a qualified practitioner for diagnosing or treating a disease or condition of the cardiovascular system in fluoroscopically guided interventional procedures. Cardiovascular technologists may not activate the fluoroscopic system or evaluate quality control tests.\n(b) A cardiovascular technologist who is participating in a training or educational program in any of the occupations listed in this subdivision is exempt from the examination requirement within the scope and for the duration of the training or educational program.\n(a) Nuclear medicine technologists who have passed the primary pathway credential in Nuclear Medicine Technology Certification Board (NMTCB) for nuclear medicine or the American Registry of Radiologic Technologists (ARRT) for nuclear medicine technology or the American Society of Clinical Pathologists (NM) (ASCP) may operate a fusion imaging device or a dual imaging device that uses radioactive material as a point source in transmission scanning and attenuation correction.\n(b) A nuclear medicine technologist in paragraph (a) may only operate a stand-alone computed tomography x-ray system if the technologist has passed the Nuclear Medicine Technology Certification Board for computed tomography (CT) or is credentialed in computed tomography (CT) from the American Registry of Radiologic Technologists (ARRT).\n(c) A nuclear medicine technologist who meets the requirements under paragraph (a) and who is participating in a training or educational program to obtain a credential under paragraph (b) is exempt from the examination requirement within the scope and for the duration of the training or educational program.\n(a) A radiation therapy technologist who has passed the primary pathway credential in radiation therapy may operate radiation therapy accelerator and simulator x-ray systems.\n(b) A radiation therapy technologist in paragraph (a) may only operate a stand-alone computed tomography x-ray system if the technologist has passed and is credentialed in computed tomography (CT) from the American Registry of Radiologic Technologists (ARRT).\n(c) A radiation therapy technologist who meets the requirements under paragraph (a) and who is participating in a training or educational program to obtain a credential under paragraph (b) is exempt from the examination requirement within the scope and for the duration of the training or educational program.\nAt the time a facility with x-ray equipment is inspected by the commissioner of health in accordance with subdivision 2, an individual operating x-ray equipment in the facility must be able to show compliance with the requirements of subdivision 5.\n[Repealed, 1999 c 86 art 2 s 6]\n(a) This subdivision applies to a bone densitometer that is used on humans to estimate bone mineral content and bone mineral density in a region of a finger on a person's nondominant hand, gives an x-ray dose equivalent of less than 0.001 microsieverts per scan, and has an x-ray leakage exposure rate of less than two milliroentgens per hour at a distance of one meter, provided that the bone densitometer is operating in accordance with manufacturer specifications.\n(b) An individual who operates a bone densitometer that satisfies the definition in paragraph (a) and the facility in which an individual operates such a bone densitometer are exempt from the requirements of subdivisions 5 and 6.\n(a) An employee of a correctional or detention facility who operates a security screening system and the facility in which the system is being operated are exempt from the requirements of subdivisions 5 and 6.\n(b) An employee of a correctional or detention facility who operates a security screening system and the facility in which the system is being operated must meet the requirements of a variance to Minnesota Rules, parts 4732.0305 and 4732.0565, issued under Minnesota Rules, parts 4717.7000 to 4717.7050. This paragraph expires on December 31 of the year that the permanent rules adopted by the commissioner governing security screening systems are published in the State Register.",
	"repealed": false
}