{
	"id": "151.252",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.252",
	"title": "151.252 LICENSING OF DRUG MANUFACTURERS; FEES; PROHIBITIONS.",
	"text": "(a) No person shall act as a drug manufacturer without first obtaining a license from the board and paying any applicable fee specified in section 151.065.\n(b) In addition to the license required under paragraph (a), each manufacturer required to pay the registration fee under section 151.066 must pay the fee by June 1 of each year, beginning June 1, 2020. In the event of a change of ownership of the manufacturer, the new owner must pay the registration fee specified under section 151.066, subdivision 3, that the original owner would have been assessed had the original owner retained ownership. The registration fee collected under this paragraph shall be deposited in the opiate epidemic response fund established under section 256.043.\n(c) Application for a drug manufacturer license under this section shall be made in a manner specified by the board.\n(d) No license shall be issued or renewed for a drug manufacturer unless the applicant agrees to operate in a manner prescribed by federal and state law and according to Minnesota Rules.\n(e) No license shall be issued or renewed for a drug manufacturer that is required to be registered pursuant to United States Code, title 21, section 360, unless the applicant supplies the board with proof of registration. The board may establish by rule the standards for licensure of drug manufacturers that are not required to be registered under United States Code, title 21, section 360.\n(f) No license shall be issued or renewed for a drug manufacturer that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of licensure or registration. The board may establish, by rule, standards for the licensure of a drug manufacturer that is not required to be licensed or registered by the state in which it is physically located.\n(g) The board shall require a separate license for each facility located within the state at which drug manufacturing occurs and for each facility located outside of the state at which drugs that are shipped into the state are manufactured, except a manufacturer of opiate-containing controlled substances shall not be required to pay the fee under section 151.065, subdivision 1, clause (16), or subdivision 3, clause (14), for more than one facility.\n(h) Prior to the issuance of an initial or renewed license for a drug manufacturing facility, the board may require the facility to pass a current good manufacturing practices inspection conducted by an authorized representative of the board. In the case of a drug manufacturing facility located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located or by the United States Food and Drug Administration, of an inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\n(a) No person shall act as an outsourcing facility without first obtaining a license from the board and paying any applicable manufacturer licensing fee specified in section 151.065.\n(b) Application for an outsourcing facility license under this section shall be made in a manner specified by the board and may differ from the application required of other drug manufacturers.\n(c) No license shall be issued or renewed for an outsourcing facility unless the applicant agrees to operate in a manner prescribed for outsourcing facilities by federal and state law and according to Minnesota Rules.\n(d) No license shall be issued or renewed for an outsourcing facility unless the applicant supplies the board with proof of such registration by the United States Food and Drug Administration as required by United States Code, title 21, section 353b.\n(e) No license shall be issued or renewed for an outsourcing facility that is required to be licensed or registered by the state in which it is physically located unless the applicant supplies the board with proof of such licensure or registration. The board may establish, by rule, standards for the licensure of an outsourcing facility that is not required to be licensed or registered by the state in which it is physically located.\n(f) The board shall require a separate license for each outsourcing facility located within the state and for each outsourcing facility located outside of the state at which drugs that are shipped into the state are prepared.\n(g) The board shall not issue an initial or renewed license for an outsourcing facility unless the facility passes a current good manufacturing practices inspection conducted by an authorized representative of the board. In the case of an outsourcing facility located outside of the state, the board may require the applicant to pay the cost of the inspection, in addition to the license fee in section 151.065, unless the applicant furnishes the board with a report, issued by the appropriate regulatory agency of the state in which the facility is located or by the United States Food and Drug Administration, of a current good manufacturing practices inspection that has occurred within the 24 months immediately preceding receipt of the license application by the board. The board may deny licensure unless the applicant submits documentation satisfactory to the board that any deficiencies noted in an inspection report have been corrected.\nIt is unlawful for any person engaged in drug manufacturing to sell legend drugs to anyone located in this state except as provided in this chapter.\nUnless prohibited by United States Code, title 42, section 1320a-7h, a drug manufacturer or outsourcing facility shall file with the board an annual report, in a form and on the date prescribed by the board, identifying all payments, honoraria, reimbursement, or other compensation authorized under section 151.461, clauses (4) and (5), paid to practitioners in Minnesota during the preceding calendar year. The report shall identify the nature and value of any payments totaling $100 or more to a particular practitioner during the year, and shall identify the practitioner. Reports filed under this subdivision are public data.",
	"repealed": false
}