{
	"id": "611.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.55",
	"title": "611.55 FORENSIC NAVIGATOR SERVICES.",
	"text": "As used in this section, \"board\" means the Minnesota Competency Attainment Board established in section 611.56.\nThe board must provide or contract for enough forensic navigator services to meet the needs of adult defendants in each judicial district who are found incompetent to proceed.\n(a) Forensic navigators shall assist and supervise defendants when appointed to do so by a court. Forensic navigators shall be impartial in all legal matters relating to the criminal case. Nothing shall be construed to permit the forensic navigator to provide legal counsel as a representative of the court, prosecutor, or defense counsel.\n(b) Forensic navigators shall provide services to assist defendants with mental illnesses and cognitive impairments. Services may include, but are not limited to:\n(1) developing bridge plans;\n(2) assisting defendants in participating in court-ordered examinations and hearings;\n(3) coordinating timely placement in court-ordered competency attainment programs;\n(4) providing competency attainment education;\n(5) reporting to the court on the progress of defendants found incompetent to stand trial;\n(6) providing coordinating services to help defendants access mental health services, medical care, stable housing and housing assistance, financial assistance, social services, transportation, precharge and pretrial diversion, and other necessary services provided by other programs and community service providers;\n(7) communicating with and offering supportive resources to defendants and family members of defendants; and\n(8) providing consultation and education to court officials on emerging issues and innovations in serving defendants with mental illnesses in the court system.\n(c) When ordered to supervise a defendant, a forensic navigator shall report to the court on a defendant's compliance or noncompliance with conditions of pretrial supervision and any order of the court.\n(d) If a defendant's charges are dismissed, the appointed forensic navigator may continue assertive outreach with the individual for up to 90 days to assist in attaining stability in the community.\n(a) A forensic navigator must prepare a bridge plan with the defendant and submit the bridge plan to the court. Bridge plans must be submitted before the time the court makes a competency finding pursuant to section 611.45. A bridge plan must include:\n(1) a confirmed housing address the defendant will use upon release, including but not limited to emergency shelters;\n(2) if possible, the dates, times, locations, and contact information for any appointments made to further coordinate support and assistance for the defendant in the community, including but not limited to mental health and substance use disorder treatment, or a list of referrals to services; and\n(3) any other referrals, resources, or recommendations the forensic navigator or court deems necessary.\n(b) Bridge plans and any supporting records or other data submitted with those plans are not accessible to the public.",
	"repealed": false
}