{
	"id": "5B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/5B.02",
	"title": "5B.02 DEFINITIONS.",
	"text": "(a) For purposes of this chapter and unless the context clearly requires otherwise, the definitions in this section have the meanings given them.\n(b) \"Address\" means an individual's work address, school address, or residential street address, as specified on the individual's application to be a program participant under this chapter.\n(c) \"Applicant\" means an adult, a parent or guardian acting on behalf of an eligible minor, or a guardian acting on behalf of an incapacitated person, as defined in section 524.5-102.\n(d) \"Domestic violence\" means an act as defined in section 518B.01, subdivision 2, paragraph (a), and includes a threat of such acts committed against an individual in a domestic situation, regardless of whether these acts or threats have been reported to law enforcement officers.\n(e) \"Eligible person\" means an adult, a minor, or an incapacitated person, as defined in section 524.5-102 for whom there is good reason to believe (1) that the eligible person is a victim of domestic violence, sexual assault, or harassment or stalking, or (2) that the eligible person fears for the person's safety, the safety of another person who resides in the same household, or the safety of persons on whose behalf the application is made. In order to be an eligible person, an individual must reside in Minnesota or must certify that the individual intends to reside in Minnesota within 60 days. A person registered or required to register as a predatory offender under section 243.166 or 243.167, or the law of another jurisdiction, is not an eligible person.\n(f) \"Mail\" means first class letters and flats delivered via the United States Postal Service, including priority, express, and certified mail, and excluding (1) periodicals and catalogues, and (2) packages and parcels unless they are clearly identifiable as nonrefrigerated pharmaceuticals or clearly indicate that they are sent by the federal government or a state or county government agency of the continental United States, Hawaii, District of Columbia, or United States territories.\n(g) \"Program participant\" means an individual certified as a program participant under section 5B.03.\n(h) \"Harassment\" or \"stalking\" means acts criminalized under section 609.749 and includes a threat of such acts committed against an individual, regardless of whether these acts or threats have been reported to law enforcement officers.",
	"repealed": false
}