{
	"id": "61A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.53",
	"title": "61A.53 DEFINITIONS.",
	"text": "For purposes of sections 61A.53 to 61A.60, the terms defined in this section have the meanings given.\n\"Replacement\" means any transaction in which new life insurance or a new annuity is to be purchased, and it is known or should be known to the proposing agent or broker or to the proposing insurer if there is no agent, that by reason of the transaction, existing life insurance or annuity has been or is to be:\n(1) lapsed, forfeited, surrendered, or otherwise terminated;\n(2) converted to reduced paid-up insurance, continued as extended term insurance, or otherwise reduced in value by the use of nonforfeiture benefits or other policy values;\n(3) amended so as to effect either a reduction in benefits or in the term for which coverage would otherwise remain in force or for which benefits would be paid;\n(4) reissued with any reduction in cash value; or\n(5) pledged as collateral or subjected to borrowing, whether in a single loan or under a schedule of borrowing over a period of time for amounts in the aggregate exceeding 25 percent of the loan value set forth in the policy.\n\"Conservation\" means any attempt by the existing insurer or its agent or broker to dissuade a policy owner or contract holder from the replacement of existing life insurance or annuity. Conservation does not include routine administrative procedures such as late payment reminders, late payment offers, or reinstatement offers.\n\"Direct-response sale\" means any sale of life insurance or annuity where the insurer does not use an agent in the sale or delivery of the policy or contract.\n\"Existing insurer\" means the insurance company whose policy or contract is or will be changed or terminated in such a manner as described within the definition of \"replacement.\"\n\"Existing life insurance or annuity\" means any life insurance or annuity in force, including life insurance under a binding or conditional receipt or a life insurance policy or annuity contract that is within an unconditional refund period.\n\"Replacing insurer\" means the insurance company that issues or proposes to issue a new policy or contract which is a replacement of existing life insurance or annuity.",
	"repealed": false
}