{
	"id": "204C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.05",
	"title": "204C.05 STATE ELECTIONS; HOURS FOR VOTING.",
	"text": "Except as otherwise provided in this section, at the state primary and the state general election the hours for voting in every precinct in the state shall begin at 7:00 a.m. and shall extend continuously until 8:00 p.m.\nThe governing body of a town with less than 500 inhabitants according to the most recent federal decennial census, which is located outside the metropolitan area as defined in section 200.02, subdivision 24, may fix a later time for voting to begin at state primary, special, or general elections, if approved by a vote of the town electors at the annual town meeting. The question of shorter voting hours must be included in the notice of the annual town meeting before the question may be submitted to the electors at the meeting. The later time may not be later than 10:00 a.m. for special, primary, or general elections. The town clerk shall either post or publish notice of the changed hours and notify the county auditor and the secretary of state of the change 30 days before the election.\nAn unorganized territory or unorganized territories which constitute a voting district may have shorter voting hours if at least 20 percent of the registered voters residing in the voting district sign a petition for shorter hours and present it to the county auditor and secretary of state at least 30 days before the election. The later time may not be later than 10:00 a.m. for special, primary, or general elections. The county auditor shall either post or publish notice of the changed hours, within the voting district, 30 days before the election.\n(a) At or before the hour when voting is scheduled to begin, the election judges shall agree upon the standard of time they will use to determine when voting will begin and end. Voting shall not be allowed after the time when it is scheduled to end, unless individuals are waiting in the polling place or waiting in line at the door to register or to vote. The voting shall continue until those individuals have been allowed to vote. No individual who comes to the polling place or to a line outside the polling place after the time when voting is scheduled to end shall be allowed to vote.\n(b) The local election official may extend polling place hours to accommodate voters that would have been in line at the regular polling place if the polling place had not been combined or moved on election day pursuant to section 204B.14, subdivision 2, or 204B.175. Polling place hours may be extended at the new polling place for one hour. The local election official must immediately provide notice to the county auditor, secretary of state, and election judges of the extension in polling place hours. The local election official must also request that the local media outlets publicly announce the extended polling place hours. Voters in the polling place or waiting in line at the door to register or to vote at the end of the extended polling place hours shall be allowed to vote pursuant to paragraph (a).",
	"repealed": false
}