{
	"id": "116D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/116D.04",
	"title": "116D.04 ENVIRONMENTAL IMPACT STATEMENTS.",
	"text": "[Repealed, 1980 c 447 s 10]\nFor the purposes of this chapter, the following terms have the meanings given to them in this subdivision.\n(a) \"Natural resources\" has the meaning given it in section 116B.02, subdivision 4.\n(b) \"Pollution, impairment, or destruction\" has the meaning given it in section 116B.02, subdivision 5.\n(c) \"Environmental assessment worksheet\" means a brief document which is designed to set out the basic facts necessary to determine whether an environmental impact statement is required for a proposed action.\n(d) \"Governmental action\" means activities, including projects wholly or partially conducted, permitted, assisted, financed, regulated, or approved by units of government including the federal government.\n(e) \"Governmental unit\" means any state agency and any general or special purpose unit of government in the state including, but not limited to, watershed districts organized under chapter 103D, counties, towns, cities, port authorities, housing authorities, and economic development authorities established under sections 469.090 to 469.108, but not including courts, school districts, the Department of Iron Range Resources and Rehabilitation, and regional development commissions other than the Metropolitan Council.\n[Repealed, 1980 c 447 s 10]\n(a) Where there is potential for significant environmental effects resulting from any major governmental action, the action must be preceded by a detailed environmental impact statement prepared by the responsible governmental unit. The environmental impact statement must be an analytical rather than an encyclopedic document that describes the proposed action in detail, analyzes its significant environmental impacts, discusses appropriate alternatives to the proposed action and their impacts, and explores methods by which adverse environmental impacts of an action could be mitigated. The environmental impact statement must also analyze those economic, employment, and sociological effects that cannot be avoided should the action be implemented. To ensure its use in the decision-making process, the environmental impact statement must be prepared as early as practical in the formulation of an action.\n(b) The board shall by rule establish categories of actions for which environmental impact statements and for which environmental assessment worksheets must be prepared as well as categories of actions for which no environmental review is required under this section. A mandatory environmental assessment worksheet is not required for the expansion of an ethanol plant, as defined in section 41A.09, subdivision 2a, paragraph (b), or the conversion of an ethanol plant to a biobutanol facility or the expansion of a biobutanol facility as defined in section 41A.15, subdivision 2d, based on the capacity of the expanded or converted facility to produce alcohol fuel, but must be required if the ethanol plant or biobutanol facility meets or exceeds thresholds of other categories of actions for which environmental assessment worksheets must be prepared. The responsible governmental unit for an ethanol plant or biobutanol facility project for which an environmental assessment worksheet is prepared is the state agency with the greatest responsibility for supervising or approving the project as a whole.\n(c) A mandatory environmental impact statement is not required for a facility or plant located outside the seven-county metropolitan area that produces less than 125,000,000 gallons of ethanol, biobutanol, or cellulosic biofuel annually, or produces less than 400,000 tons of chemicals annually, if the facility or plant is: an ethanol plant, as defined in section 41A.09, subdivision 2a, paragraph (b); a biobutanol facility, as defined in section 41A.15, subdivision 2d; or a cellulosic biofuel facility. A facility or plant that only uses a cellulosic feedstock to produce chemical products for use by another facility as a feedstock is not considered a fuel conversion facility as used in rules adopted under this chapter.\n(d) The responsible governmental unit shall promptly publish notice of the completion of an environmental assessment worksheet by publishing the notice in at least one newspaper of general circulation in the geographic area where the project is proposed, by posting the notice on a website that has been designated as the official publication site for publication of proceedings, public notices, and summaries of a political subdivision in which the project is proposed, or in any other manner determined by the board and shall provide copies of the environmental assessment worksheet to the board and its member agencies. Comments on the need for an environmental impact statement may be submitted to the responsible governmental unit during a 30-day period following publication of the notice that an environmental assessment worksheet has been completed. The responsible governmental unit may extend the 30-day comment period for an additional 30 days one time. Further extensions of the comment period may not be made unless approved by the project's proposer. The responsible governmental unit's decision on the need for an environmental impact statement must be based on the environmental assessment worksheet and the comments received during the comment period, and must be made within 15 days after the close of the comment period. The board's chair may extend the 15-day period by not more than 15 additional days upon the request of the responsible governmental unit.\n(e) An environmental assessment worksheet must also be prepared for a proposed action whenever material evidence accompanying a petition by not less than 100 individuals who reside or own property in the state, submitted before the proposed project has received final approval by the appropriate governmental units, demonstrates that, because of the nature or location of a proposed action, there may be potential for significant environmental effects. Petitions requesting the preparation of an environmental assessment worksheet must be submitted to the board. The chair of the board shall determine the appropriate responsible governmental unit and forward the petition to it. A decision on the need for an environmental assessment worksheet must be made by the responsible governmental unit within 15 days after the petition is received by the responsible governmental unit. The board's chair may extend the 15-day period by not more than 15 additional days upon request of the responsible governmental unit.\n(f) Except in an environmentally sensitive location where Minnesota Rules, part 4410.4300, subpart 29, item B, applies, the proposed action is exempt from environmental review under this chapter and rules of the board, if:\n(1) the proposed action is:\n(i) an animal feedlot facility with a capacity of less than 1,000 animal units; or\n(ii) an expansion of an existing animal feedlot facility with a total cumulative capacity of less than 1,000 animal units;\n(2) the application for the animal feedlot facility includes a written commitment by the proposer to design, construct, and operate the facility in full compliance with Pollution Control Agency feedlot rules; and\n(3) the county board holds a public meeting for citizen input at least ten business days before the Pollution Control Agency or county issuing a feedlot permit for the animal feedlot facility unless another public meeting for citizen input has been held with regard to the feedlot facility to be permitted. The exemption in this paragraph is in addition to other exemptions provided under other law and rules of the board.\n(g) The board may, before final approval of a proposed project, require preparation of an environmental assessment worksheet by a responsible governmental unit selected by the board for any action where environmental review under this section has not been specifically provided for by rule or otherwise initiated.\n(h) An early and open process must be used to limit the scope of the environmental impact statement to a discussion of those impacts that, because of the nature or location of the project, have the potential for significant environmental effects. The same process must be used to determine the form, content, and level of detail of the statement as well as the alternatives that are appropriate for consideration in the statement. In addition, the permits that will be required for the proposed action must be identified during the scoping process. Further, the process must identify those permits for which information will be developed concurrently with the environmental impact statement. The board shall provide in its rules for the expeditious completion of the scoping process. The determinations reached in the process must be incorporated into the order requiring the preparation of an environmental impact statement.\n(i) The responsible governmental unit shall, to the extent practicable, avoid duplication and ensure coordination between state and federal environmental review and between environmental review and environmental permitting. Whenever practical, information needed by a governmental unit for making final decisions on permits or other actions required for a proposed project must be developed in conjunction with the preparation of an environmental impact statement. When an environmental impact statement is prepared for a project requiring multiple permits for which two or more agencies' decision processes include either mandatory or discretionary hearings before a hearing officer before the agencies' decision on the permit, the agencies may, notwithstanding any law or rule to the contrary, conduct the hearings in a single consolidated hearing process if requested by the proposer. All agencies having jurisdiction over a permit that is included in the consolidated hearing shall participate. The responsible governmental unit shall establish appropriate procedures for the consolidated hearing process, including procedures to ensure that the consolidated hearing process is consistent with the applicable requirements for each permit regarding the rights and duties of parties to the hearing, and shall use the earliest applicable hearing procedure to initiate the hearing. All agencies having jurisdiction over a permit identified in the draft environmental assessment worksheet scoping document must begin reviewing any permit application upon publication of the notice of preparation of the environmental impact statement.\n(j) An environmental impact statement must be prepared and its adequacy determined within 280 days after notice of its preparation unless the time is extended by consent of the parties or by the governor for good cause. The responsible governmental unit shall determine the adequacy of an environmental impact statement, unless within 60 days after notice is published that an environmental impact statement will be prepared, the board chooses to determine the adequacy of an environmental impact statement. If an environmental impact statement is found to be inadequate, the responsible governmental unit has 60 days to prepare an adequate environmental impact statement.\n(k) The proposer of a specific action may include in the information submitted to the responsible governmental unit a preliminary draft environmental impact statement under this section on that action for review, modification, and determination of completeness and adequacy by the responsible governmental unit. A preliminary draft environmental impact statement prepared by the project proposer and submitted to the responsible governmental unit must identify or include as an appendix all studies and other sources of information used to substantiate the analysis contained in the preliminary draft environmental impact statement. The responsible governmental unit shall require additional studies, if needed, and obtain from the project proposer all additional studies and information necessary for the responsible governmental unit to perform its responsibility to review, modify, and determine the completeness and adequacy of the environmental impact statement.\nIf an environmental assessment worksheet or an environmental impact statement is required for a governmental action under subdivision 2a, a project may not be started and a final governmental decision may not be made to grant a permit, approve a project, or begin a project, until:\n(1) a petition for an environmental assessment worksheet is dismissed;\n(2) a negative declaration has been issued on the need for an environmental impact statement;\n(3) the environmental impact statement has been determined adequate; or\n(4) a variance has been granted from making an environmental impact statement by the environmental quality board.\n[Repealed, 1980 c 447 s 10]\nWithin 30 days after final approval of an environmental impact statement, final decisions shall be made by the appropriate governmental units on those permits which were identified as required and for which information was developed concurrently with the preparation of the environmental impact statement. Provided, however, that the 30-day period may be extended where a longer period is permitted by section 15.99 or required by federal law or state statute or is consented to by the permit applicant. The permit decision shall include the reasons for the decision, including any conditions under which the permit is issued, together with a final order granting or denying the permit.\n[Repealed, 1980 c 447 s 10]\nThe board shall by rule identify alternative forms of environmental review which will address the same issues and utilize similar procedures as an environmental impact statement in a more timely or more efficient manner to be utilized in lieu of an environmental impact statement.\n[Repealed, 1980 c 447 s 10]\nThe board shall, by January 1, 1981, promulgate rules in conformity with this chapter and the provisions of chapter 15, establishing:\n(1) the governmental unit which shall be responsible for environmental review of a proposed action;\n(2) the form and content of environmental assessment worksheets;\n(3) a scoping process in conformance with subdivision 2a, paragraph (h);\n(4) a procedure for identifying during the scoping process the permits necessary for a proposed action and a process for coordinating review of appropriate permits with the preparation of the environmental impact statement;\n(5) a standard format for environmental impact statements;\n(6) standards for determining the alternatives to be discussed in an environmental impact statement;\n(7) alternative forms of environmental review which are acceptable pursuant to subdivision 4a;\n(8) a model ordinance which may be adopted and implemented by local governmental units in lieu of the environmental impact statement process required by this section, providing for an alternative form of environmental review where an action does not require a state agency permit and is consistent with an applicable comprehensive plan. The model ordinance shall provide for adequate consideration of appropriate alternatives, and shall ensure that decisions are made in accordance with the policies and purposes of Laws 1980, chapter 447;\n(9) procedures to reduce paperwork and delay through intergovernmental cooperation and the elimination of unnecessary duplication of environmental reviews;\n(10) procedures for expediting the selection of consultants by the governmental unit responsible for the preparation of an environmental impact statement; and\n(11) any additional rules which are reasonably necessary to carry out the requirements of this section.\nBy December 1, 2018, and every three years thereafter, the Environmental Quality Board, Pollution Control Agency, Department of Natural Resources, and Department of Transportation, after consultation with political subdivisions, shall submit to the governor and the chairs of the house of representatives and senate committees having jurisdiction over environment and natural resources a list of mandatory environmental assessment worksheet and mandatory environmental impact statement categories for which the agency or a political subdivision is designated as the responsible government unit, and for each worksheet or statement category, a document including:\n(1) intended historical purposes of the category;\n(2) whether projects that fall within the category are also subject to local, state, or federal permits; and\n(3) an analysis of and recommendations for whether the mandatory category should be modified, eliminated, or unchanged based on its intended outcomes and relationship to existing permits or other federal, state, or local laws or ordinances.\nNo state action significantly affecting the quality of the environment shall be allowed, nor shall any permit for natural resources management and development be granted, where such action or permit has caused or is likely to cause pollution, impairment, or destruction of the air, water, land or other natural resources located within the state, so long as there is a feasible and prudent alternative consistent with the reasonable requirements of the public health, safety, and welfare and the state's paramount concern for the protection of its air, water, land and other natural resources from pollution, impairment, or destruction. Economic considerations alone shall not justify such conduct.\nPrior to the preparation of a final environmental impact statement, the governmental unit responsible for the statement shall consult with and request the comments of every governmental office which has jurisdiction by law or special expertise with respect to any environmental effect involved. Copies of the drafts of such statements and the comments and views of the appropriate offices shall be made available to the public. The final detailed environmental impact statement and the comments received thereon shall precede final decisions on the proposed action and shall accompany the proposal through an administrative review process.\nRegardless of whether a detailed written environmental impact statement is required by the board to accompany an application for a permit for natural resources management and development, or a recommendation, project, or program for action, officials responsible for issuance of aforementioned permits or for other activities described herein shall give due consideration to the provisions of Laws 1973, chapter 412, as set forth in section 116D.03, in the execution of their duties.\nIn order to facilitate coordination of environmental decision making and the timely review of agency decisions, the board shall establish by rule a procedure for early notice to the board and the public of natural resource management and development permit applications and other impending state actions having significant environmental effects.\nPrior to the final decision upon any state project or action significantly affecting the environment or for which an environmental impact statement is required, or within ten days thereafter, the board may delay implementation of the action or project by notice to the agency or department and to interested parties. Thereafter, within 45 days of such notice, the board may reverse or modify the decisions or proposal where it finds, upon notice and hearing, that the action or project is inconsistent with the policy and standards of sections 116D.01 to 116D.06. Any aggrieved party may seek judicial review pursuant to chapter 14.\nA person aggrieved by a final decision on the need for an environmental assessment worksheet, the need for an environmental impact statement, or the adequacy of an environmental impact statement is entitled to judicial review of the decision under sections 14.63 to 14.68. A petition for a writ of certiorari by an aggrieved person for judicial review under sections 14.63 to 14.68 must be filed with the court of appeals and served on the responsible governmental unit not more than 30 days after the responsible governmental unit provides notice of the final decision in the EQB Monitor. Proceedings for review under this section must be instituted by serving a petition for a writ of certiorari personally or by certified mail upon the responsible governmental unit and by promptly filing the proof of service in the Office of the Clerk of the Appellate Courts and the matter will proceed in the manner provided by the Rules of Civil Appellate Procedure. A copy of the petition must be provided to the attorney general at the time of service. Copies of the writ must be served, personally or by certified mail, upon the responsible governmental unit and the project proposer. The filing of the writ of certiorari does not stay the enforcement of any other governmental action, provided that the responsible governmental unit may stay enforcement or the court of appeals may order a stay upon terms it deems proper. A bond may be required under section 562.02 unless at the time of hearing on the application for the bond the petitioner-relator has shown that the claim is likely to succeed on the merits. The board may initiate judicial review of decisions referred to herein and the board or a project proposer may intervene as of right in any proceeding brought under this subdivision.\nIf the board or governmental unit which is required to act within a time period specified in this section fails to so act, any person may seek an order of the district court requiring the board or governmental unit to immediately take the action mandated by subdivisions 2a and 3a.\nNo attempt need be made to tabulate, analyze or otherwise evaluate the potential impact of elections made pursuant to section 216I.21, subdivision 4, in environmental impact statements done for large electric power facilities. It is sufficient for purposes of this chapter that such statements note the existence of section 216I.21, subdivision 4.\nThis section may be enforced by injunction, action to compel performance, or other appropriate action in the district court of the county where the violation takes place. Upon the request of the board or the chair of the board, the attorney general may bring an action under this subdivision.\n(a) The commissioners of natural resources and the Pollution Control Agency and the board shall periodically review mandatory environmental assessment worksheet categories under rules adopted under this section, and other project types that are frequently subject to environmental review, and develop customized environmental assessment worksheet forms for the category or project type. The forms must include specific questions that focus on key environmental issues for the category or project type. In assessing categories and project types and developing forms, the board shall seek the input of governmental units that are frequently responsible for the preparation of a worksheet for the particular category or project type. The commissioners and the board shall also seek input from the general public on the development of customized forms. The commissioners and board shall make the customized forms available online.\n(b) The commissioners of natural resources and the Pollution Control Agency shall allow for the electronic submission of environmental assessment worksheets and permits.\nTo the extent practicable and so as not to conflict with other requirements of this section, the board shall not require, unless necessary, information in an environmental assessment worksheet for a proposed action when the information is also required as part of any necessary permitting process for the proposed action.\nWhen an environmental assessment worksheet is required for a proposed action that has the potential to require a groundwater appropriation permit from the commissioner of natural resources, the board shall require that the environmental assessment worksheet include an assessment of the water resources available for appropriation.\nThe commissioners of natural resources and the Pollution Control Agency, when ordering the preparation of a discretionary environmental impact statement or discretionary environmental assessment worksheet for a proposed action, must notify the proposer of the action by certified mail at least 14 calendar days prior to making the order.",
	"repealed": false
}