{
	"id": "60M.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/60M.01",
	"title": "60M.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given.\n\"Bail bond\" means a three-party contract between the state, the accused, and the surety whereby an individual is released to the custody of the surety, and the surety guarantees to the state the appearance of the individual at all criminal proceedings for which the surety bond is posted.\n\"Bail bond agency\" means an agency contracted by a surety to supervise or otherwise manage the bail bond business written in Minnesota by producers appointed by the surety.\n\"Commissioner\" means the commissioner of commerce.\n\"Department\" means the Department of Commerce.\n\"Depositor\" means:\n(1) an individual that has paid money to a surety, bail bond agency, or producer as premium or premium toward a bail bond product transaction, as defined in section 60M.02; or\n(2) an individual that deposited money, property, or assets with a surety, bail bond agency, or producer to be held as collateral or used toward the liability of a bail bond product transaction, as defined in section 60M.03.\n\"Negotiate\" means the act of conferring directly with or offering advice directly to a purchaser or prospective purchaser of a particular insurance contract concerning any of the substantive benefits, terms, or conditions of the contract, if the person engaged in the act either sells insurance or obtains insurance from insurers for purchasers.\n\"Net premium\" means a bond's premium, less any commission agreed to in advance and in writing between a producer and the surety or bail bond agency.\n\"Personal information\" has the meaning given in section 72A.491, subdivision 17.\n\"Principal\" is an individual who has engaged with a bail bond agency or producer to arrange for the individual's bail bond to be posted on the individual's behalf, securing the individual's release pretrial on a bail bond.\n\"Privileged information\" has the meaning given in section 72A.491, subdivision 19.\n\"Producer\" means a person that is licensed to write bail bonds, has been approved by the state court administrator's office, is a contractor or employee for a bail bond agency, and is appointed by a surety to execute or countersign bail bonds for the surety in connection with judicial proceedings.\n\"Sell\" means to exchange a bail bond product for money on behalf of a surety company.\n\"Surety\" means a domestic, foreign, or alien insurance company that is licensed to transact surety business in Minnesota under section 60A.06.",
	"repealed": false
}