{
	"id": "216A.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/216A.035",
	"title": "216A.035 CONFLICT OF INTEREST.",
	"text": "(a) No person, while a member of the Public Utilities Commission, while acting as executive secretary of the commission, or while employed in a professional capacity by the commission, shall receive any income, other than dividends or other earnings from a mutual fund or trust if these earnings do not constitute a significant portion of the person's income, directly or indirectly from any public utility or other organization subject to regulation by the commission.\n(b) No person is eligible to be appointed as a member of the commission if the person has been employed with an entity, or an affiliated company of an entity, that is subject to rate regulation by the commission within one year from the date when the person's term on the commission will begin.\n(c) No person who is an employee of the Department of Commerce shall participate in any manner in any decision or action of the commission where that person has a direct or indirect financial interest. Each commissioner or employee of the department who is in the general professional, supervisory, or technical units established in section 179A.10 or who is a professional, supervisory, or technical employee defined as confidential in section 179A.03, subdivision 4, or who is a management classification employee and whose duties are related to public utility, telephone company, or telecommunications company regulation shall report to the Campaign Finance and Public Disclosure Board annually before April 15 any interest in an industry or business regulated by the commission. Each commissioner shall file a statement of economic interest as required by section 10A.09 with the Campaign Finance and Public Disclosure Board and the Public Utilities Commission before taking office. The statement of economic interest must state any interest that the commissioner has in an industry or business regulated by the commission.\n(d) A professional employee of the commission or department must immediately disclose to the commission or to the commissioner of the department, respectively, any communication, direct or indirect, with a person who is a party to a pending proceeding before the commission regarding future benefits, compensation, or employment to be received from that person.",
	"repealed": false
}