{
	"id": "176.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.645",
	"title": "176.645 ADJUSTMENT OF BENEFITS.",
	"text": "For injuries occurring after October 1, 1975, for which benefits are payable under section 176.101, subdivisions 1, 2 and 4, and section 176.111, subdivision 5, the total benefits due the employee or any dependents shall be adjusted in accordance with this section. On October 1, 1981, and thereafter on the anniversary of the date of the employee's injury the total benefits due shall be adjusted by multiplying the total benefits due prior to each adjustment by a fraction, the denominator of which is the statewide average weekly wage for December 31, of the year two years previous to the adjustment and the numerator of which is the statewide average weekly wage for December 31, of the year previous to the adjustment. For injuries occurring after October 1, 1975, all adjustments provided for in this section shall be included in computing any benefit due under this section. Any limitations of amounts due for daily or weekly compensation under this chapter shall not apply to adjustments made under this section. No adjustment increase made on or after October 1, 1977, but prior to October 1, 1992, under this section shall exceed six percent a year; in those instances where the adjustment under the formula of this section would exceed this maximum, the increase shall be deemed to be six percent. No adjustment increase made on or after October 1, 1992, under this section shall exceed four percent a year; in those instances where the adjustment under the formula of this section would exceed this maximum, the increase shall be deemed to be four percent. For injuries occurring on and after October 1, 1995, no adjustment increase made on or after October 1, 1995, shall exceed two percent a year; in those instances where the adjustment under the formula of this section would exceed this maximum, the increase shall be deemed to be two percent. For injuries occurring on and after October 1, 2013, no adjustment increase shall exceed three percent a year. If the adjustment under the formula of this section would exceed three percent, the increase shall be three percent. No adjustment under this section shall be less than zero percent. The Workers' Compensation Advisory Council may consider adjustment or other further increases and make recommendations to the legislature.\nFor injuries occurring on or after October 1, 1981, the initial adjustment made pursuant to subdivision 1 is deferred until the first anniversary of the date of the injury. For injuries occurring on or after October 1, 1992, the initial adjustment under subdivision 1 is deferred until the second anniversary of the date of the injury. The adjustment made at that time shall be that of the last year only. For injuries occurring on or after October 1, 1995, the initial adjustment under subdivision 1 is deferred until the fourth anniversary of the date of injury. The adjustment at that time shall be that of the last year only. For injuries occurring on or after October 1, 2013, the initial adjustment under subdivision 1 is deferred until the third anniversary of the date of injury. The adjustment made at that time shall be that of the last year only.",
	"repealed": false
}