{
	"id": "162.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.08",
	"title": "162.08 ALLOCATION OF APPORTIONMENTS.",
	"text": "Upon determining the sum of money to be apportioned to each county as hereinbefore provided, the commissioner shall allocate a percentage of such sum for expenditure solely on those portions of each county's county state-aid highways located within cities having a population of less than 5,000, according to the last federal decennial census, or, if incorporated during the ten-year period between federal decennial censuses, according to their incorporation census. The percentage so allocated shall equal the percentage that the total needs of the county state-aid highway system in such cities bears to the total county state-aid highway needs in each county. Money so allocated shall be set apart and credited to the municipal account of each county.\nUpon determining the amount of money to be apportioned to each of the counties and the sum of such amount to be allocated for expenditure on those county state-aid highways located within cities having a population of less than 5,000, the commissioner shall forthwith send a statement of the amount to the commissioner of management and budget, and the county auditor and county engineer of each county. The amounts so apportioned and allocated to each county shall be paid by the state to the treasurer of each county out of the county state-aid highway fund as hereinafter provided, and in accordance with rules made and promulgated by the commissioner not inconsistent herewith.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\n(a) Money so apportioned and allocated to each county shall be used for aid in the establishment, location, construction, reconstruction, improvement, and maintenance of the county state-aid highway system within each county, including the expense of sidewalks, commissioner-approved signals and safety devices on county state-aid highways, and systems that permit an emergency vehicle operator to activate a green traffic signal for the emergency vehicle; provided, that in the event of hardship, or in the event that the county state-aid highway system of any county is improved to the standards set forth in the commissioner's rules, a portion of the money apportioned other than the money allocated for expenditures within cities having a population of less than 5,000, may be used on other roads within the county with the consent and in accordance with the commissioner's rules.\n(b) If the portion of the county state-aid highway system lying within cities having a population of less than 5,000 is improved to the standard set forth in the commissioner's rules, a portion of the money credited to the municipal account may be used on other county highways or other streets lying within such cities. Upon the authorization of the commissioner, a county may expend accumulated municipal account funds on county state-aid highways within the county outside of cities having a population of less than 5,000. The commissioner shall authorize the expenditure if:\n(1) the county submits a written request to the commissioner and holds a hearing within 30 days of the request to receive and consider any objections by the governing bodies of cities within the county having a population of less than 5,000; and\n(2) no written objection is filed with the commissioner by any such city within 14 days of that hearing as provided in this subdivision.\nThe county shall notify all of the cities of the public hearing by certified mail and shall notify the commissioner in writing of the results of the hearing and any objections to the use of the funds as requested by the county.\n(c) If, within 14 days of the hearing under paragraph (b), a city having a population of less than 5,000 files a written objection with the commissioner identifying a specific county state-aid highway within the city which is requested for improvement, the commissioner shall investigate the nature of the requested improvement. Notwithstanding paragraph (b), clause (2), the commissioner may authorize the expenditure requested by the county if:\n(1) the identified highway is not deficient in meeting minimum state-aid street standards;\n(2) the county shows evidence that the identified highway has been programmed for construction in the county's five-year capital improvement budget in a manner consistent with the county's transportation plan; or\n(3) there are conditions created by or within the city and beyond the control of the county that prohibit programming or constructing the identified highway.\n(d) Notwithstanding any contrary provisions of paragraph (b) or (c), accumulated balances in excess of two years of municipal account apportionments may be spent on projects located outside of municipalities under 5,000 population when approved solely by resolution of the county board.\n(e) Authorization for use of municipal account funds on county state-aid highways outside of cities having a population of less than 5,000 shall be applicable only to the county's accumulated and current year allocation. Future municipal account allocations shall be used as directed by law unless subsequent requests are made by the county and approved by the commissioner, or approved by resolution of the county board, as applicable, in accordance with the applicable provisions of this section.\nAny county may make advances from any available funds, including funds made available by a city pursuant to subdivision 6 to the municipal account for the purpose of completing work on any portion of its county state-aid highway system within cities having a population of less than 5,000. Any advances shall be repaid by deducting an amount equal thereto from money accruing to the municipal account. Advances heretofore made shall be repaid in like manner.\nAny city having a population of less than 5,000 may, by agreement with the county pursuant to section 162.17, subdivision 2, and under rules of the commissioner and with the commissioner's consent, use available funds for the purpose of accelerating construction of any portion of the county state-aid highway system within its limits. To finance such construction, the city may issue its obligations to the same extent and in the same manner as for financing construction of any other street. By such agreement, the county may pledge itself to use any part of one or more future allotments to its municipal account to reimburse the city for all or any portion of the money so spent by the city, not including interest on obligations issued to finance the project. A copy of the agreement shall be filed with the commissioner. Thereafter, as allotments are credited annually to the municipal account of the county, the commissioner shall certify to the commissioner of management and budget that payments to the county may be made in the amounts and at the times specified in the agreement within the limits of the amounts so credited. The county shall pay funds so received to the city in accordance with the terms of the agreement.\nAny county may make advances from any available funds for the purpose of expediting the construction, reconstruction, improvement and maintenance of its county state-aid highway system. Advances made by any county as provided herein, other than advances made to the municipal account, shall be repaid out of subsequent apportionments to the county's maintenance or construction account in accordance with the commissioner's rules.\nThe amount of money to be appropriated by the counties from other funds for use in the establishment, location, construction, reconstruction, improvement, and maintenance of the county state-aid highway system is left to the discretion of the individual county boards. Nothing contained herein shall restrict or prohibit a county board from using money collected from county road and bridge levies to provide, by mutual agreement, financial assistance or services not otherwise prohibited by law to townships and municipalities within its borders.\nNot more than 40 percent of the money so apportioned and allocated to each county shall be set aside in separate accounts for the maintenance of the county state-aid highway system in the counties; provided, that upon good cause shown and in accordance with the commissioner's rules, the commissioner may set aside an additional percentage for the maintenance of any county state-aid highway system. Money so set aside shall be paid to the several counties in accordance with the rules of the commissioner.\nWhen the county board of any county determines to do any construction work on a county state-aid highway or other road eligible for the expenditure of state aid funds within the county, and desires to expend on such work a portion of the money apportioned or allocated to it out of the county state-aid highway fund, the county shall first obtain approval of the project by the commissioner. Thereafter the county engineer shall make such reports in such manner as the commissioner requires under rules of the commissioner. Upon receipt of satisfactory reports, the commissioner shall certify to the commissioner of management and budget the amount of money that is eligible to be paid from the county's apportionment or allocation for the work under contract or actually completed. The commissioner of management and budget shall thereupon issue a payment in that amount payable to the county treasurer. In no event shall the payment with all other payments issued exceed the amount apportioned and allocated to the county.\nThe commissioner of management and budget shall not issue any payments without the certification of the commissioner.",
	"repealed": false
}