{
	"id": "148E.110",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.110",
	"title": "148E.110 LICENSED INDEPENDENT SOCIAL WORKERS; SUPERVISED PRACTICE.",
	"text": "Before becoming licensed as a licensed independent social worker, a person must have obtained at least 100 hours of supervision during 4,000 hours of postgraduate social work practice required by law according to the requirements of section 148E.105. At least four hours of supervision must be obtained during every 160 hours of practice.\n(a) Notwithstanding subdivision 1, the board shall approve supervised practice hours completed prior to August 1, 2011, which comply with Minnesota Statutes 2010, sections 148D.100 to 148D.125. These hours must apply to supervised practice requirements in effect as specified in this section.\n(b) Any additional hours of supervised practice obtained on or after August 1, 2011, must comply with the increased requirements in this section.\nAfter licensure, a licensed independent social worker must not engage in clinical social work practice except under supervision by a licensed independent clinical social worker who meets the requirements in section 148E.120, subdivision 1, or an alternate supervisor designated according to section 148E.120, subdivision 2.\n(a) Except as provided in paragraph (b), a licensed independent social worker must not engage in clinical social work practice under supervision for more than 8,000 hours. In order to practice clinical social work for more than 8,000 hours, a licensed independent social worker must obtain a licensed independent clinical social worker license.\n(b) Notwithstanding the requirements of paragraph (a), the board may grant a licensed independent social worker permission to engage in clinical social work practice for more than 8,000 hours if the licensed independent social worker petitions the board and demonstrates to the board's satisfaction that for reasons of personal hardship the licensed independent social worker should be granted an extension to continue practicing clinical social work under supervision for up to an additional 2,000 hours.\nAfter licensure, a licensed independent social worker is not required to be supervised if the licensed independent social worker does not practice clinical social work.\n(a) After receiving a license from the board as a licensed independent social worker, a licensed independent social worker engaged in clinical social work practice must obtain at least 200 hours of supervision according to the requirements of this section.\n(b) A minimum of four hours and a maximum of eight hours of supervision must be obtained during every 160 hours of practice until the licensed independent social worker is issued a licensed independent clinical social worker license.\n(c) A minimum of 200 hours of supervision must be completed, in addition to all other requirements according to sections 148E.115 to 148E.125, to be eligible to apply for the licensed independent clinical social worker license.\n(d) The supervisee and supervisor are required to adjust the rate of supervision obtained based on the ratio of four hours of supervision during every 160 hours of practice to ensure compliance with the requirements in subdivision 1a.\n(a) The supervision required by subdivision 5 must be obtained:\n(1) in no less than 4,000 hours and no more than 8,000 hours of postgraduate clinical social work practice authorized by law, including at least 1,800 hours of direct clinical client contact; and\n(2) a minimum of four hours and a maximum of eight hours of supervision must be obtained during every 160 hours of practice.\n(b) Notwithstanding paragraph (a), clause (1), direct clinical client contact hours are (i) not required prior to August 1, 2011, and (ii) not required of a licensed independent social worker engaged in clinical practice with a licensed independent social worker license issue date prior to August 1, 2011.\nOf the 200 hours of supervision required under subdivision 5:\n(1) 100 hours must be provided through one-on-one supervision. The supervision must be provided either in person or via eye-to-eye electronic media, while maintaining visual contact. The board must allow a licensed independent social worker to satisfy the supervision requirement of this clause with all required hours of supervision provided via eye-to-eye electronic media, while maintaining visual contact; and\n(2) 100 hours must be provided through: (i) one-on-one supervision; or (ii) group supervision. The supervision may be in person, by telephone, or via eye-to-eye electronic media, while maintaining visual contact. The supervision must not be provided by email. Group supervision is limited to six supervisees.\nThe supervision required by subdivision 5 must be provided by a supervisor who meets the requirements specified in section 148E.120. The supervision must be provided by a:\n(1) licensed independent clinical social worker; or\n(2) supervisor who meets the requirements specified in section 148E.120, subdivision 2.\nThe supervisee must:\n(1) to the satisfaction of the supervisor, practice competently and ethically according to professional social work knowledge, skills, and values;\n(2) receive supervision in the following content areas:\n(i) development of professional values and responsibilities;\n(ii) practice skills;\n(iii) authorized scope of practice;\n(iv) ensuring continuing competence; and\n(v) ethical standards of practice;\n(3) submit a supervision plan according to section 148E.125, subdivision 1; and\n(4) verify supervised practice according to section 148E.125, subdivision 3, when:\n(i) a licensed independent social worker applies for the renewal of a license; or\n(ii) a licensed independent social worker applies for a licensed independent clinical social worker license.\n(a) Except as provided in paragraph (b), a licensed independent social worker must not engage in clinical social work practice under supervision for more than 8,000 hours. In order to practice clinical social work for more than 8,000 hours, a licensed independent social worker must obtain a licensed independent clinical social worker license.\n(b) Notwithstanding the requirements of paragraph (a), the board may grant a licensed independent social worker permission to engage in clinical social work practice for more than 8,000 hours if the licensed independent social worker petitions the board and demonstrates to the board's satisfaction that for reasons of personal hardship the licensed independent social worker should be granted an extension to continue practicing clinical social work under supervision for up to an additional 2,000 hours.\nUpon completion of not less than 4,000 hours and not more than 8,000 hours of clinical social work practice, including at least 1,800 hours of direct clinical client contact and 200 hours of supervision according to the requirements of this section, a licensed independent social worker is eligible to apply for a licensed independent clinical social worker license under section 148E.115, subdivision 1.\nA social worker and the social worker's supervisor must submit verification that the supervisee has met or has made progress on meeting the applicable supervision requirements according to section 148E.125, subdivision 3.",
	"repealed": false
}