{
	"id": "383A.286",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.286",
	"title": "383A.286 UNCLASSIFIED SERVICE.",
	"text": "An appointing authority may appoint employees to the unclassified service in accordance with this section. Positions in the unclassified service shall not be required to be filled by competitive examination, but shall be subject to an open application and screening process. The appointing authority may discharge employees in the unclassified service with or without cause. Employees in the unclassified service have no right to a grievance appeal from discharge or other disciplinary action under sections 383A.281 to 383A.301. An employee in an unclassified position shall not have tenure but shall be entitled to all benefits associated with tenure such as vacation leave, sick leave, health insurance, and other benefits as determined by the county board.\nThe following positions shall be in the unclassified service:\n(a) positions held by elected officials or persons appointed to fill an elected office;\n(b) one assistant for each elected official;\n(c) the director or principal administrative officer of a department of county government or agency created by law, except that the affirmative action officer, human resources director, internal auditor, and director of budgeting and accounting shall be positions in the classified service;\n(d) doctors, residents, and student nurses employed by the county or county agency;\n(e) members of a board or commission appointed by the county, or the county and the city, and acting in an advisory capacity;\n(f) weed inspectors, election judges, or election clerks;\n(g) special police officers or special deputy sheriffs serving without pay;\n(h) judges, court administrators, court reporters, receivers, referees, the examiner or assistant examiners of titles, public defenders, arbiters, jurors, court administrator of district court, or persons appointed by the district court to make or conduct a special inquiry of a judicial or temporary character;\n(i) all positions in the Second Judicial District administrator's office;\n(j) the executive director and eight principal assistants;\n(k) the chief executive officer of the medical center and seven principal assistants;\n(l) interns, student workers, law clerks, or other employees employed for a limited duration as determined by the county board;\n(m) positions designated by the county board as unclassified pursuant to subdivision 3;\n(n) the sheriff, the sheriff's chief deputy, three principal assistants, and a personal secretary; and\n(o) the county attorney, the county attorney's first assistant, one principal assistant, and a personal secretary.\nThe county board may designate additional positions in the unclassified service if the following criteria are met:\n(a) designation of the position is not contrary to the provisions of other law relating specifically to that department;\n(b) the person occupying the position of supervisor or a department assistant would report directly to the department head and would be designated as part of the department head's management team; and\n(c) the duties of the position involve significant discretion and substantial involvement in the development, interpretation, and implementation of department policy.\nThe human resources director shall certify whether the designation is consistent or inconsistent with the standards and criteria in this section. The county board may appeal certification decisions to the Personnel Review Board.",
	"repealed": false
}