{
	"id": "245.4711",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4711",
	"title": "245.4711 CASE MANAGEMENT SERVICES.",
	"text": "(a) By January 1, 1989, the county board shall provide case management services for all adults with serious and persistent mental illness who are residents of the county and who request or consent to the services and to each adult for whom the court appoints a case manager. Staffing ratios must be sufficient to serve the needs of the clients. The case manager must meet the requirements in section 245.462, subdivision 4.\n(b) Case management services provided to adults with serious and persistent mental illness eligible for medical assistance must be billed to the medical assistance program under sections 256B.02, subdivision 8, and 256B.0625.\n(c) Case management services are eligible for reimbursement under the medical assistance program. Costs associated with mentoring, supervision, and continuing education may be included in the reimbursement rate methodology used for case management services under the medical assistance program.\n(a) The county board shall notify the adult of the adult's potential eligibility for case management services within five working days after receiving a request from an individual or a referral from a provider under section 245.467, subdivision 4. The county board shall send a written notice to the adult and the adult's representative, if any, that identifies the designated case management providers.\n(b) The county board must determine whether an adult who requests or is referred for case management services meets the criteria of section 245.462, subdivision 20, paragraph (c). If a diagnostic assessment is needed to make the determination, the county board shall offer to assist the adult in obtaining a diagnostic assessment. The county board shall notify, in writing, the adult and the adult's representative, if any, of the eligibility determination. If the adult is determined to be eligible for case management services, the county board shall refer the adult to the case management provider for case management services. If the adult is determined not to be eligible or refuses case management services, the local agency shall offer to refer the adult to a mental health provider or other appropriate service provider and to assist the adult in making an appointment with the provider of the adult's choice.\nUpon a determination of eligibility for case management services, and if the adult consents to the services, the case manager shall complete a written functional assessment according to section 245.462, subdivision 11a. The case manager shall develop an individual community support plan for the adult according to subdivision 4, paragraph (a), review the adult's progress, and monitor the provision of services. If services are to be provided in a host county that is not the county of financial responsibility, the case manager shall consult with the host county and obtain a letter demonstrating the concurrence of the host county regarding the provision of services.\n(a) The case manager must develop an individual community support plan for each adult that incorporates the client's individual treatment plan. The individual treatment plan may not be a substitute for the development of an individual community support plan. The individual community support plan must be developed within 30 days of client intake and reviewed at least every 180 days after it is developed, unless the case manager receives a written request from the client or the client's family for a review of the plan every 90 days after it is developed. The case manager is responsible for developing the individual community support plan based on a diagnostic assessment and a functional assessment and for implementing and monitoring the delivery of services according to the individual community support plan. To the extent possible, the adult with serious and persistent mental illness, the person's family, advocates, service providers, and significant others must be involved in all phases of development and implementation of the individual community support plan.\n(b) The client's individual community support plan must state:\n(1) the goals of each service;\n(2) the activities for accomplishing each goal;\n(3) a schedule for each activity; and\n(4) the frequency of face-to-face contacts by the case manager, as appropriate to client need and the implementation of the individual community support plan.\nThe county board must establish procedures that ensure ongoing contact and coordination between the case manager and the community support services program as well as other mental health services.\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1990 c 568 art 5 s 35]\n[Repealed, 1997 c 93 s 4]",
	"repealed": false
}