{
	"id": "134.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.31",
	"title": "134.31 DEPARTMENT OF EDUCATION; LIBRARY RESPONSIBILITIES.",
	"text": "The state shall, as an integral part of its responsibility for public education, support the provision of library service for every resident, the development of cooperative programs for the sharing of resources and services among all libraries, and the establishment of jointly operated library services at a single location where appropriate.\nThe Department of Education shall give advice and instruction to the managers of any public library or to any governing body maintaining a library or empowered to do so by law upon any matter pertaining to the organization, maintenance, or administration of libraries. The department may also give advice and instruction, as requested, to postsecondary educational institutions, school districts or charter schools, state agencies, governmental units, nonprofit organizations, or private entities. It shall assist, to the extent possible, in the establishment and organization of library service in those areas where adequate services do not exist, and may aid in improving previously established library services. The department shall also provide assistance to school districts, regional library systems, and member libraries interested in offering joint library services at a single location.\nThe department may provide, for any library in the state, books, journals, audiovisual items, information services or resource materials it deems appropriate and necessary and shall encourage the sharing of library resources and the development of interlibrary cooperation.\nThe department shall collect statistics on the receipts, expenditures, services, and use of the regional public library systems and the public libraries of the state. It shall also collect statistics on all activities undertaken pursuant to sections 134.31 to 134.355.\nThe Minnesota Department of Education shall provide specialized services to people with visual and physical disabilities through the Minnesota Braille and Talking Book Library under a cooperative plan with the National Library Service for the Blind and Print Disabled of the Library of Congress.\n[Repealed, 2001 c 161 s 58]\nThe commissioner shall appoint an advisory committee of five members to advise the staff of the Minnesota Braille and Talking Book Library on long-range plans and library services. Members shall be people who use the library. Section 15.059 governs this committee.\n(a) Notwithstanding section 13D.01, the Advisory Committee for the Minnesota Braille and Talking Book Library may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the committee participating in the meeting, wherever their physical locations, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the committee can hear all discussion, testimony, and votes of the members of the committee;\n(3) at least one member of the committee is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(b) Each member of the committee participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining quorum and participating in all proceedings.\n(c) If telephone or other electronic means is used to conduct a meeting, to the extent practical, the committee shall allow a person to monitor the meeting electronically from a remote location. The committee may require the person making the connection to pay for the documented additional costs that the committee incurs as a result of the additional connection.\n(d) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the committee shall provide notice of the regular meeting location, the fact that some members may participate by telephone or other electronic means, and the provisions of paragraph (c). The timing and method of providing notice is governed by section 13D.04.",
	"repealed": false
}