{
	"id": "624.7171",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7171",
	"title": "624.7171 EXTREME RISK PROTECTION ORDERS.",
	"text": "(a) As used in sections 624.7171 to 624.7178, the following terms have the meanings given.\n(b) \"Family or household members\" means:\n(1) spouses and former spouses of the respondent;\n(2) parents and children of the respondent;\n(3) persons who are presently residing with the respondent; or\n(4) a person involved in a significant romantic or sexual relationship with the respondent.\nIn determining whether persons are in a significant romantic or sexual relationship under clause (4), the court shall consider the length of time of the relationship; type of relationship; and frequency of interaction between the parties.\n(c) \"Firearm\" has the meaning given in section 609.666, subdivision 1, paragraph (a).\n(d) \"Mental health professional\" has the meaning given in section 245I.02, subdivision 27.\n(a) An application for relief under sections 624.7172 and 624.7174 may be filed in the county of residence of the respondent except as provided for in paragraph (b). Actions under sections 624.7172 and 624.7174 shall be given docket priorities by the court.\n(b) At the time of filing, a petitioner may request that the court allow the petitioner to appear virtually at all proceedings. If the court denies the petitioner's request for virtual participation, the petitioner may refile the petition in the county where the petitioner resides or is officed.\nUpon the petitioner's request, information maintained by the court regarding the petitioner's location or residence is not accessible to the public and may be disclosed only to court personnel or law enforcement for purposes of service of process, conducting an investigation, or enforcing an order.\n(a) There shall exist an action known as a petition for an extreme risk protection order, which order shall enjoin and prohibit the respondent from possessing or purchasing firearms for as long as the order remains in effect.\n(b) A petition for relief under sections 624.7171 to 624.7178 may be made by the chief law enforcement officer, the chief law enforcement officer's designee, a city or county attorney, any family or household members of the respondent, or a guardian, as defined in section 524.1-201, clause (27), of the respondent.\n(c) A petition for relief shall allege that the respondent poses a significant danger of bodily harm to other persons or is at significant risk of suicide by possessing a firearm. The petition shall be accompanied by an affidavit made under oath stating specific facts and circumstances forming a basis to allege that an extreme risk protection order should be granted. The affidavit may include but is not limited to evidence showing any of the factors described in section 624.7172, subdivision 2.\n(d) A petition for emergency relief under section 624.7174 shall additionally allege that the respondent presents an immediate and present danger of either bodily harm to others or of taking their life.\n(e) A petition for relief must describe, to the best of the petitioner's knowledge, the types and location of any firearms believed by the petitioner to be possessed by the respondent.\n(f) The court shall provide simplified forms and clerical assistance to help with the writing and filing of a petition under this section.\n(g) The state court administrator shall create all forms necessary under sections 624.7171 to 624.7178.\n(h) The filing fees for an extreme risk protection order under this section are waived for the petitioner and respondent. The court administrator, the sheriff of any county in this state, and other law enforcement and corrections officers shall perform their duties relating to service of process without charge to the petitioner. The court shall direct payment of the reasonable costs of service of process if served by a private process server when the sheriff or other law enforcement or corrections officer is unavailable or if service is made by publication, without requiring the petitioner to make application under section 563.01.\n(i) The court shall advise the petitioner of the right to serve the respondent by alternate notice under section 624.7172, subdivision 1, paragraph (e), if the respondent is avoiding personal service by concealment or otherwise, and shall assist in the writing and filing of the affidavit.\n(j) The court shall advise the petitioner of the right to request a hearing under section 624.7174. If the petitioner does not request a hearing, the court shall advise the petitioner that the respondent may request a hearing and that notice of the hearing date and time will be provided to the petitioner by mail at least five days before the hearing.\n(k) Any proceeding under sections 624.7171 to 624.7178 shall be in addition to other civil or criminal remedies.\n(l) All health records and other health information provided in a petition or considered as evidence in a proceeding under sections 624.7171 to 624.7178 shall be protected from public disclosure but may be provided to law enforcement agencies as described in this section.\n(m) Any extreme risk protection order or subsequent extension issued under sections 624.7171 to 624.7178 shall be forwarded by the court administrator within 24 hours to the local law enforcement agency with jurisdiction over the residence of the respondent and electronically transmitted within three business days to the National Instant Criminal Background Check System. When an order expires or is terminated by the court, the court must submit a request that the order be removed from the National Instant Background Check System. Each appropriate law enforcement agency shall make available to other law enforcement officers, through a system for verification, information as to the existence and status of any extreme risk protection order issued under sections 624.7171 to 624.7178.\nWhen a mental health professional has a statutory duty to warn another of a client's serious threat of physically violent behavior or determines that a client presents a significant risk of suicide by possessing a firearm, the mental health professional must communicate the threat or risk to the sheriff of the county where the client resides and make a recommendation to the sheriff regarding the client's fitness to possess firearms.",
	"repealed": false
}