{
	"id": "60A.803",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.803",
	"title": "60A.803 LIFE AND HEALTH REINSURANCE AGREEMENTS.",
	"text": "This section applies to:\n(1) all domestic life and accident and sickness insurers;\n(2) all other licensed life and accident and sickness insurers which are not subject to a substantially similar regulation in their domiciliary state; and\n(3) licensed insurers with respect to their accident and sickness business.\nThis section does not apply to assumption reinsurance, yearly renewable term reinsurance, or certain nonproportional reinsurance such as stop loss or catastrophe reinsurance.\nNo insurer subject to this section shall, for reinsurance ceded, reduce any liability or establish any asset in any financial statement filed with the commissioner if, by the terms of the reinsurance agreement, in substance or effect, any of the conditions in paragraphs (a) to (k) exist:\n(a) The renewal expense allowances provided or to be provided to the ceding insurer by the reinsurer in any accounting period, are not sufficient to cover anticipated allocable renewal expenses of the ceding insurer on the portion of the business reinsured, unless a liability is established for the present value of the shortfall, using assumptions equal to the applicable statutory reserve basis on the business reinsured. Those expenses include commissions, premium taxes, and direct expenses including, but not limited to, billing, valuation, claims, and maintenance expected by the company at the time the business is reinsured.\n(b) The ceding insurer can be deprived of surplus or assets at the reinsurer's option or automatically upon the occurrence of some event, such as the insolvency of the ceding insurer, except that termination of the reinsurance agreement by the reinsurer for nonpayment of reinsurance premiums or other amounts due, such as modified coinsurance reserve adjustments, interest and adjustments on funds withheld, and tax reimbursements, shall not be considered to be a deprivation of surplus or assets.\n(c) The ceding insurer is required to reimburse the reinsurer for negative experience under the reinsurance agreement, except that neither offsetting experience refunds against current and prior years' losses under the agreement nor payment by the ceding insurer of an amount equal to the current and prior years' losses under the agreement upon voluntary termination of in force reinsurance by the ceding insurer is considered such a reimbursement to the reinsurer for negative experience. Voluntary termination does not include situations where termination occurs because of unreasonable provisions which allow the reinsurer to reduce its risk under the agreement. An example of such a provision is the right of the reinsurer to increase reinsurance premiums or risk and expense charges to excessive levels forcing the ceding company to prematurely terminate the reinsurance treaty.\n(d) The ceding insurer must, at specific points in time scheduled in the agreement, terminate or automatically recapture all or part of the reinsurance ceded.\n(e) The reinsurance agreement involves the possible payment by the ceding insurer to the reinsurer of amounts other than from income realized from the reinsured policies. It is improper for a ceding company to pay reinsurance premiums, or other fees or charges to a reinsurer, which are greater than the direct premiums collected by the ceding company.\n(f) The reinsurance agreement does not transfer all of the significant risk inherent in the business being reinsured. The following table identifies, for a representative sampling of products or type of business, the risks that are considered to be significant. For products not specifically included, the risks determined to be significant must be consistent with this table.\nRisk categories:\n(1) morbidity;\n(2) mortality;\n(3) lapse, which is the risk that a policy will voluntarily terminate prior to the recoupment of a statutory surplus strain experienced at issue of the policy;\n(4) credit quality (C1), which is the risk that invested assets supporting the reinsured business will decrease in value. The main hazards are that assets will default or that there will be a decrease in earning power. It excludes market value declines due to changes in interest rate;\n(5) reinvestment (C3), which is the risk that interest rates will fall and funds reinvested (coupon payments or money received upon asset maturity or call) will therefore earn less than expected. If asset durations are less than liability durations, the mismatch will increase; and\n(6) disintermediation (C3), which is the risk that interest rates rise and policy loans and surrenders increase or maturing contracts do not renew at anticipated rates of renewal. If asset durations are greater than the liability durations, the mismatch will increase. Policyholders will move their funds into new products offering higher rates. The company may have to sell assets at a loss to provide for these withdrawals.\nRISK CATEGORY\n+ = Significant\n0 = Insignificant\n*LTC = Long-Term Care Insurance\nLTD = Long-Term Disability Insurance\n(g)(1) The credit quality, reinvestment, or disintermediation risk is significant for the business reinsured and the ceding company does not, other than for the classes of business excepted in clause (2), either transfer the underlying assets to the reinsurer or legally segregate such assets in a trust or escrow account or otherwise establish a mechanism satisfactory to the commissioner that legally segregates, by contract or contract provision, the underlying assets.\n(2) Notwithstanding the requirements of clause (1), the assets supporting the reserves for the following classes of business and any classes of business that do not have a significant credit quality, reinvestment or disintermediation risk, may be held by the ceding company without segregation of the assets:\n(i) Health Insurance - LTC/LTD;\n(ii) Traditional Nonpar Permanent;\n(iii) Traditional Par Permanent;\n(iv) Adjustable Premium Permanent;\n(v) Indeterminate Premium Permanent; and/or\n(vi) Universal Life Fixed Premium (no dump-in premiums allowed).\nThe associated formula for determining the reserve interest rate adjustment must reflect the ceding company's investment earnings and incorporate all realized and unrealized gains and losses reflected in the statutory statement. The following is an acceptable formula:\nRate = 2(I+CG) / (X + Y - I - CG)\n(h) Settlements are made less frequently than quarterly or payments due from the reinsurer are not made in cash within 90 days of the settlement date.\n(i) The ceding insurer is required to make representations or warranties not reasonably related to the business being reinsured.\n(j) The ceding insurer is required to make representations or warranties about future performance of the business being reinsured.\n(k) The reinsurance agreement is entered into for the principal purpose of producing significant surplus aid for the ceding insurer, typically on a temporary basis, while not transferring all of the significant risks inherent in the business reinsured and, in substance or effect, the expected potential liability to the ceding insurer remains basically unchanged.\nNotwithstanding subdivision 2, an insurer subject to this section may, with the prior approval of the commissioner, take such reserve credit or establish such asset as the commissioner deems consistent with state insurance law or rules.\n(a) Agreements entered into after August 1, 1994, that involve the reinsurance of business issued prior to the effective date of the agreements, along with any subsequent amendments thereto, shall be filed by the ceding company with the commissioner within 30 days from their date of execution. Each filing shall include data detailing the financial impact of the transaction. The ceding insurer's actuary who signs the financial statement actuarial opinion with respect to valuation of reserves shall consider this section and any applicable actuarial standards of practice when determining the proper credit in financial statements filed with the commissioner. The actuary shall maintain adequate documentation and be prepared upon request to describe the actuarial work performed for inclusion in the financial statements and to demonstrate that the work conforms to this section.\n(b) Any increase in surplus net of federal income tax resulting from arrangements described in paragraph (a) must be identified separately on the insurer's statutory financial statement as a surplus item (aggregate write-ins for gains and losses in surplus in the capital and surplus account of the annual statement) and recognition of the surplus increase as income must be reflected on a net of tax basis in the \"Reinsurance ceded\" line of the annual statement as earnings emerge from the business reinsured.\nNo reinsurance agreement or amendment to any agreement may be used to reduce any liability or to establish any asset in any financial statement filed with the commissioner, unless the agreement, amendment, or a binding letter or intent has been duly executed by both parties no later than the \"as of date\" of the financial statement. In the case of a letter of intent, a reinsurance agreement or an amendment to a reinsurance agreement must be executed within a reasonable period of time, not exceeding 90 days from the execution date of the letter of intent, in order for credit to be granted for the reinsurance ceded. The reinsurance agreement must provide that:\n(1) the agreement constitutes the entire agreement between the parties with respect to the business being reinsured under it and that there are no understandings between the parties other than as expressed in the agreement; and\n(2) any change or modification to the agreement is null and void unless made by amendment to the agreement and signed by both parties.\nInsurers subject to this section shall reduce to zero by December 31, 1995, any reserve credits or assets established with respect to reinsurance agreements entered into prior to August 1, 1994, that under the provisions of this section would not be entitled to recognition of the reserve credits or assets; provided, however, that the reinsurance agreements have been in compliance with laws or regulations in existence immediately preceding August 1, 1994.",
	"repealed": false
}