{
	"id": "182.6555",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.6555",
	"title": "182.6555 REDUCING OCCUPATIONAL EXPOSURES TO BLOOD-BORNE PATHOGENS THROUGH SHARPS INJURIES.",
	"text": "(a) Employers must comply with Code of Federal Regulations, title 29, section 1910.1030, to eliminate or minimize employee exposure to blood-borne pathogens through sharps injuries.\n(b) Written exposure control plans prepared by employers must be reviewed at least annually and whenever necessary to reflect new or modified tasks and procedures which affect occupational exposures and to reflect new or revised employee positions with occupational exposure. The requirement to review and update the plan means that the plan must reflect changes in technology that eliminate or reduce exposure to blood-borne pathogens. The exposure control plan must document consideration and implementation of appropriate commercially available and effective engineering controls, for example, needleless systems and sharps with engineered sharps injury protection, designed to eliminate or minimize exposure.\n(c) A safety committee established under section 182.676 must make advisory recommendations for the use of effective engineering controls. The recommendations are not binding on the employer. One-half of the members of the safety committee must be employee representatives of job classifications that would use or may reasonably anticipate encountering any device in the category being evaluated in the performance of the employee's duties. The employer may establish a subcommittee of the safety committee to meet the requirements of this paragraph. One-half of the members of this subcommittee must be employee representatives of job classifications that would use or may reasonably anticipate encountering any device in the category being evaluated in the performance of the employee's duties. Employers not required to establish a safety committee under section 182.676 must involve their employees in the evaluation of effective engineering controls.\n(d) MS 2002 [Expired, 2000 c 351 s 1]\n(e) Employers must establish internal procedures to document the route of exposure and the circumstances under which an exposure incident occurred. This information should include:\n(1) engineering controls in use at the time;\n(2) work practices followed;\n(3) a description and brand name of the device in use;\n(4) protective equipment or clothing that was used at the time of the exposure incident;\n(5) location;\n(6) procedure being performed when the incident occurred;\n(7) the employee's training; and\n(8) the injured employee's opinion about whether any other engineering, administrative, or work practice control could have prevented the injury and the basis for that opinion.",
	"repealed": false
}