{
	"id": "176.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.191",
	"title": "176.191 DISPUTE BETWEEN TWO OR MORE EMPLOYERS OR INSURERS REGARDING LIABILITY.",
	"text": "Where compensation benefits are payable under this chapter, and a dispute exists between two or more employers or two or more insurers or the special compensation fund as to which is liable for payment, the commissioner, compensation judge, or court of appeals upon appeal shall direct that one or more of the employers or insurers or the special compensation fund make payment of the benefits pending a determination of which has liability. The special compensation fund may be ordered to make payment only if it has been made a party to the claim because the petitioner has alleged that one or more of the employers is uninsured for workers' compensation under section 176.183. A temporary order may be issued under this subdivision whether or not the employers, insurers, or special compensation fund agree to pay under the order, and whether or not they agree that benefits are payable under this chapter. A temporary order shall be issued if the commissioner or compensation judge determines based on evidence submitted by the employee that benefits are payable under this chapter and if two or more employers, insurers, or the special compensation fund deny liability based on an assertion that another employer, insurer, or the special compensation fund is liable. A temporary order shall not be withheld where the denials of liability are frivolous as defined in section 176.225, subdivision 1, or nonspecific as defined in section 176.84, subdivision 1.\nIf the parties do not agree to a temporary order, the commissioner or compensation judge shall summarily hear and determine the issues and issue an order without the need for a formal evidentiary hearing. At any time after a temporary order is issued, the paying party may request to discontinue payment of benefits based on new evidence that benefits are not payable under this chapter by following the procedures of section 176.238 or 176.239.\nAt any time after a temporary order is issued, the paying party may also petition for a formal hearing before a compensation judge for a determination of liability among the parties. If the petition is filed within one year after a temporary order was issued, the hearing shall be held within 45 days after the petition was filed. Payments under a temporary order shall continue pending the determination of the compensation judge. The compensation judge shall have jurisdiction to resolve all issues properly raised, including equitable apportionment. The procedures and monetary thresholds contained in section 176.191, subdivisions 1a and 5, shall not apply to these proceedings. This subdivision applies to all dates of injury.\nWhen liability has been determined, the party held liable for the benefits shall be ordered to reimburse any other party for payments which the latter has made, including interest at the rate of 12 percent a year. The claimant shall also be awarded a reasonable attorney fee, to be paid by the party held liable for the benefits.\nAn order directing payment of benefits pending a determination of liability may not be used as evidence before a compensation judge, the Workers' Compensation Court of Appeals, or court in which the dispute is pending.\nEquitable apportionment of liability for an injury under this chapter is not allowed except that apportionment among employers and insurers is allowed in a settlement agreement filed pursuant to section 176.521, and an employer or insurer may request equitable apportionment of liability for workers' compensation benefits among employer and insurers by arbitration pursuant to subdivision 5. For purposes of this subdivision, the term \"equitable apportionment of liability\" shall include all attempts to obtain contribution and/or reimbursement from other employers or insurers. To the same extent limited by this subdivision, contribution and reimbursement actions based on equitable apportionment are not allowed under this chapter. If the insurers choose to arbitrate apportionment, contribution, or reimbursement issues pursuant to subdivision 5, the arbitration proceeding is for the limited purpose of apportioning liability for workers' compensation benefits payable among employers and insurers. This subdivision applies without regard to whether one or more of the injuries results from cumulative trauma or a specific injury, but does not apply to an occupational disease. In the case of an occupational disease, section 176.66 applies. Apportionment against preexisting disability is allowed only for permanent partial disability as provided in section 176.101, subdivision 4a. Nothing in this subdivision shall be interpreted to repeal or in any way affect the law with respect to special compensation fund statutory liability or benefits.\n[Repealed, 1995 c 231 art 2 s 110]\nIf a dispute exists as to whether an employee's injury is compensable under this chapter and the employee is otherwise covered by an insurer or entity pursuant to chapters 62A, 62C, 62D, 62E, 62R, and 62T, that insurer or entity shall pay any medical costs incurred by the employee for the injury up to the limits of the applicable coverage and shall make any disability payments otherwise payable by that insurer or entity in the absence of or in addition to workers' compensation liability. If the injury is subsequently determined to be compensable pursuant to this chapter, the workers' compensation insurer shall be ordered to reimburse the insurer or entity that made the payments for all payments made under this subdivision by the insurer or entity, including interest at a rate of 12 percent a year. If a payment pursuant to this subdivision exceeds the reasonable value as permitted by sections 176.135 and 176.136, the provider shall reimburse the workers' compensation insurer for all the excess as provided by rules promulgated by the commissioner.\nIf the employee's medical expenses for a personal injury are paid pursuant to any program administered by the commissioner of human services, or if the employee or spouse or dependents living with the employee receive subsistence or other payments pursuant to such a program, and it is subsequently determined that the injury is compensable pursuant to this chapter, the workers' compensation insurer shall reimburse the commissioner of human services for the payments made, including interest at a rate of 12 percent a year.\nAmounts paid to an injured employee or spouse or dependents living with the employee pursuant to such a program and attributable to the personal injury shall be deducted from any settlement or award of compensation or benefits under this chapter, including, but not limited to, temporary and permanent disability benefits.\nThe insurer shall attempt, with due diligence, to ascertain whether payments have been made to an injured employee pursuant to such a program prior to any settlement or issuance of a binding award and shall notify the Department of Human Services, Benefit Recovery Section, when such payments have been made. An employee who has received public assistance payments shall notify the Department of Human Services, Benefit Recovery Section, of its potential intervention claim prior to making or settling a claim for benefits under this chapter. Notice served on local human services agencies is not sufficient to meet the notification requirement in this subdivision.\nWhere a dispute exists between an employer, insurer, the special compensation fund, or the Workers' Compensation Reinsurance Association, regarding apportionment of liability for benefits payable under this chapter, and the requesting party has expended over $10,000 in medical or 52 weeks worth of indemnity benefits and made the request within one year thereafter, a party may require submission of the dispute as to apportionment of liability among employers and insurers to binding arbitration. However, these monetary thresholds shall not apply in any case where the employers and insurers agree to submit the apportionment dispute to arbitration. The decision of the arbitrator shall be conclusive on the issue of apportionment among employers and insurers. Consent of the employee is not required for submission of a dispute to arbitration pursuant to this section and the employee is not bound by the results of the arbitration. An arbitration award shall not be admissible in any other proceeding under this chapter. Notice of the proceeding shall be given to the employee.\nThe employee, or any person with material information to the facts to be arbitrated, shall attend the arbitration proceeding if any party to the proceeding deems it necessary. Nothing said by an employee in connection with any arbitration proceeding may be used against the employee in any other proceeding under this chapter. Reasonable expenses of meals, lost wages, and travel of the employee or witnesses in attending shall be reimbursed on a pro rata basis. Arbitration costs shall be paid by the parties, except the employee, on a pro rata basis.\nIf the employee commences an action under this chapter for benefits arising out of the same injury which resulted in the dispute arbitrated under subdivision 5, and if the benefits awarded to the employee under the employee's claim are inconsistent with the arbitration decision, any increase in benefits over those paid pursuant to the arbitration proceeding is paid by the party or parties who ordinarily would have been required to pay the increased benefits but for the arbitration. Any reimbursement from the employee of any decrease in benefits from those paid pursuant to the arbitration is paid to the party or parties who previously had paid the increased benefits. The provisions of this subdivision apply regardless of whether more or fewer employers and insurers or the special fund have been added or omitted as parties to the employee's subsequent action after arbitration.\nIf an employee brings an action under the circumstances described in subdivision 6, the parties to the previous arbitration may be represented at the new action by a common or joint attorney.\nNo attorney's fees shall be awarded under either section 176.081 or 176.191 against any employer or insurer in connection with any arbitration proceeding unless the employee chooses to retain an attorney to represent the employee's interests during arbitration.",
	"repealed": false
}