{
	"id": "260B.141",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.141",
	"title": "260B.141 PETITION.",
	"text": "Any reputable person, including but not limited to any agent of the commissioner of children, youth, and families, having knowledge of a child in this state or of a child who is a resident of this state, who appears to be delinquent, may petition the juvenile court in the manner provided in this section.\nThe petition shall be verified by the person having knowledge of the facts and may be on information and belief. Unless otherwise provided by this section or by rule or order of the court, the county attorney shall draft the petition upon the showing of reasonable grounds to support the petition.\nThe petition and all subsequent court documents shall be entitled substantially as follows:\n\"Juvenile Court, County of .................\nIn the matter of the welfare of ...........\"\nThe petition shall set forth plainly:\n(a) The facts which bring the child within the jurisdiction of the court;\n(b) The name, date of birth, residence, and post office address of the child;\n(c) The names, residences, and post office addresses of the child's parents;\n(d) The name, residence, and post office address of the child's guardian if there is one, of the person having custody or control of the child, and of the nearest known relative if no parent or guardian can be found; and\n(e) The spouse of the child, if there is one. If any of the facts required by the petition are not known or cannot be ascertained by the petitioner, the petition shall so state.\nWhen a prosecutor files a delinquency petition alleging that a child committed a felony offense for which there is a presumptive commitment to prison according to the Sentencing Guidelines and applicable statutes or in which the child used a firearm, after reaching the age of 16 years, the prosecutor shall indicate in the petition whether the prosecutor designates the proceeding an extended jurisdiction juvenile prosecution. When a prosecutor files a delinquency petition alleging that a child aged 14 to 17 years committed a felony offense, the prosecutor may request that the court designate the proceeding an extended jurisdiction juvenile prosecution.\nWhen a petition is filed alleging that a child has engaged in prostitution as defined in section 609.321, subdivision 9, the county attorney shall determine whether concurrent jurisdiction is necessary to provide appropriate intervention and, if so, proceed to file a petition alleging the child to be both delinquent and in need of protection or services.",
	"repealed": false
}