{
	"id": "336.9-607",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-607",
	"title": "336.9-607 COLLECTION AND ENFORCEMENT BY SECURED PARTY.",
	"text": "(a) Collection and enforcement generally. (1) If so agreed, and in any event after default, a secured party:\n(A) may notify an account debtor or other person obligated on collateral to make payment or otherwise render performance to or for the benefit of the secured party;\n(B) may take any proceeds to which the secured party is entitled under section 336.9-315;\n(C) may enforce the obligations of an account debtor or other person obligated on collateral and exercise the rights of the debtor with respect to the obligation of the account debtor or other person obligated on collateral to make payment or otherwise render performance to the debtor, and with respect to any property that secures the obligations of the account debtor or other person obligated on the collateral;\n(D) if it holds a security interest in a deposit account perfected by control under section 336.9-104(a)(1), may apply the balance of the deposit account to the obligation secured by the deposit account; and\n(E) if it holds a security interest in a deposit account perfected by control under section 336.9-104(a)(2) or (3), may instruct the bank to pay the balance of the deposit account to or for the benefit of the secured party.\n(2) If a secured party exercises its rights under subsection (a)(1), the following rules apply:\n(A) Except as otherwise provided in subsection (B), if the obligation of the account debtor or other person obligated on collateral is secured by an interest in real property and the account debtor or other person obligated on collateral satisfies its obligation, the secured party must furnish the account debtor or the other person obligated on collateral with a release or satisfaction of the interest in real property sufficient for recording in the real property records applicable to that real property.\n(B) This subsection applies in the case of an executory contract for the sale of real property or of an interest in real property that entitles the purchaser to possession of the real property. If the purchaser satisfies its obligations under that contract, the secured party shall deliver to the purchaser a deed to the real property in accordance with the terms of the contract.\n(b) Nonjudicial enforcement of mortgage. (1) In the case of a mortgage that is not an executory contract for the sale of real property or of an interest in real property that entitles the purchaser to possession of the real property, to exercise under subsection (a)(1)(C) the right of a debtor to enforce a mortgage nonjudicially, the secured party must record in the office in which a record of the mortgage is recorded:\n(A) an assignment of the mortgage to the secured party; or\n(B) the secured party's sworn affidavit of assignment in recordable form stating:\n(i) a default has occurred under a security agreement that creates or provides for a security interest in the obligation secured by the mortgage;\n(ii) a true and correct copy of the security agreement is attached to the affidavit;\n(iii) the secured party is entitled to enforce the mortgage nonjudicially;\n(iv) the legal description of the real property encumbered by the mortgage;\n(v) the parties to the mortgage, the date of the mortgage, the date of recording of the mortgage, the place of recording of the mortgage, and the identifying number or other indexing information that identifies the mortgage in the office of the county recorder or registrar of titles where the mortgage is recorded;\n(vi) the secured party has succeeded to the interest of the debtor under the mortgage; and\n(vii) the affidavit of assignment shall be an assignment to the secured party of the interest of the debtor under the mortgage.\n(2) The affidavit of assignment is entitled to be recorded with the county recorder or the registrar of titles and upon recording, the affidavit of assignment shall be deemed an assignment to the secured party of the interest of the debtor under the mortgage.\n(3) This subsection applies in the case of an executory contract for the sale of real property or of an interest in real property that entitles the purchaser to possession of the real property. To exercise under subsection (a)(1)(C) the right of a debtor to terminate the contract nonjudicially, the secured party shall record a transfer statement, as provided in section 336.9-619, with the county recorder or the registrar of titles in the county where the real property is located. The transferee is entitled to have the statement recorded with the county recorder or the registrar of titles. When recorded, the transfer statement is a conveyance of the interest of the debtor under the contract.\n(c) Commercially reasonable collection and enforcement. A secured party shall proceed in a commercially reasonable manner if the secured party:\n(1) undertakes to collect from or enforce an obligation of an account debtor or other person obligated on collateral; and\n(2) is entitled to charge back uncollected collateral or otherwise to full or limited recourse against the debtor or a secondary obligor.\n(d) Expenses of collection and enforcement. A secured party may deduct from the collections made pursuant to subsection (c) reasonable expenses of collection and enforcement, including reasonable attorneys fees and legal expenses incurred by the secured party.\n(e) Duties to secured party not affected. This section does not determine whether an account debtor, bank, or other person obligated on collateral owes a duty to a secured party.\n(f) Secured party to obtain assignment of debtor's interest under the mortgage. (1) This subsection applies if the obligation of an account debtor or other person obligated on collateral is secured by an interest in real property.\n(2) If the interest is under an executory contract for the sale of real property or of an interest in real property that entitles the account debtor to possession of the real property, then promptly after beginning to exercise a right under this section, the secured party shall record a transfer statement as provided in section 336.9-619. The statement must be recorded with the county recorder or registrar of titles in the county where the real property is located.\n(3) If the interest is not under a record described in paragraph (2), then promptly after beginning to exercise a right under this section, the secured party shall:\n(A) file an assignment of the mortgage to the secured party;\n(B) record a transfer statement, as provided in section 336.9-619, with the county recorder or registrar of titles in the county where the real property is located; or\n(C) file an affidavit of assignment as provided under subsection (b).",
	"repealed": false
}