{
	"id": "174.256",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.256",
	"title": "174.256 PARK-AND-RIDE PROGRAM.",
	"text": "It is the purpose of this section to encourage citizens of Minnesota to transfer from low-occupancy vehicles to multioccupancy vehicles, to reduce the use of the automobile and provide for more efficient usage of existing facilities in heavily traveled corridors and congested areas, to divert automobile drivers from parking spaces in metro areas, to decrease low-occupancy vehicle miles driven and the congestion, pollution, energy consumption, highway damage, and other costs associated with highway use, and to increase the efficiency and productivity of and benefit from public investments in public park-and-ride facilities and systems in the state, reducing the need for increases in urban land used for parking. It is also the purpose of this section to encourage the use of vanpools, car pools, and ride sharing by the citizens of the state.\nFor purposes of this section the following terms have the meanings given them in this subdivision:\n(a) \"Commissioner\" means the commissioner of transportation.\n(b) \"Park-and-ride facility\" means a facility consisting of a park-and-ride lot where commuters' automobiles are parked and, within a reasonable walking distance, a station or some transfer point where commuters board the transit mode.\n(c) \"Transit mode\" includes transportation by bus, car pool, vanpool, and other similar services.\n(d) \"Exclusive use park-and-ride lot\" means a parking lot that is intended to be used exclusively for park-and-ride purposes, is constructed with public money, and is located within 100 miles of a central business district.\n(e) \"Joint use park-and-ride lot\" means a parking lot that is intended to be used for other purposes in addition to park and ride and is located within 100 miles of a central business district.\n(f) \"Fringe parking lot\" means a parking lot located outside but near a central business district.\n(a) The commissioner shall have the power to:\n(1) develop and monitor a comprehensive park-and-ride facility program throughout the state. The program shall coordinate and provide money for the development of a statewide program of park-and-ride facilities, including joint use park-and-ride lots, exclusive use park-and-ride lots, and fringe park-and-ride lots;\n(2) offer, use, and apply the information developed pursuant to clause (1) to assist and advise political subdivisions and recipients of financial assistance in the planning, promotion, development, operation, and evaluation of park-and-ride service facilities. The political subdivision or eligible recipient is responsible for the repair and maintenance of the facility by using local money;\n(3) act upon request as the designated agent of any eligible person for the receipt and disbursal of federal money;\n(4) contract for or provide services as needed in the design or construction of park-and-ride facilities; and\n(5) establish rules necessary for implementation of the program.\n(b) The commissioner shall perform the duties and exercise the powers under this section in coordination with and in furtherance of statewide, regional, and local transportation plans and transportation development programs.\nA statutory or home rule charter city, county, school district, independent board, or agency is eligible to receive financial assistance through the park-and-ride grant program. Applications for grants shall be approved or denied by the commissioner within 120 days of receipt.\n[Repealed, 2014 c 227 art 1 s 23]",
	"repealed": false
}