{
	"id": "216I.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.19",
	"title": "216I.19 WIND TURBINE LIGHTING SYSTEMS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Duration\" means the length of time during which the lights of a wind turbine lighting system are lit.\n(c) \"Intensity\" means the brightness of a wind turbine lighting system's lights.\n(d) \"Light-mitigating technology\" means a sensor-based system that reduces the duration or intensity of wind turbine lighting systems by:\n(1) using radio frequency or other sensors to detect aircraft approaching one or more wind turbines, or detecting visibility conditions at turbine sites; and\n(2) automatically activating appropriate lights until the lights are no longer needed by the aircraft and are turned off or dimmed.\nA light-mitigating technology may include an audio feature that transmits an audible warning message to provide a pilot additional information regarding a wind turbine the aircraft is approaching.\n(e) \"Repowering project\" has the meaning given in section 216B.243, subdivision 8, paragraph (b).\n(f) \"Wind turbine lighting system\" means a system of lights installed on an LWECS that meets the applicable Federal Aviation Administration requirements.\nThis section applies to an LWECS issued a site permit or site permit amendment, including a site permit amendment for an LWECS repowering project, by the commission under section 216F.04 or by a county under section 216F.08, provided that the application for a site permit or permit amendment is filed after July 1, 2021.\n(a) An LWECS subject to this section must be equipped with a light-mitigating technology that meets the requirements established in Chapter 14 of the Federal Aviation Administration's Advisory Circular 70/760-1, Obstruction Marking and Lighting, as updated, unless the Federal Aviation Administration, after reviewing the LWECS site plan, rejects the use of the light-mitigating technology for the LWECS. A light-mitigating technology installed on a wind turbine in Minnesota must be purchased from a vendor approved by the Federal Aviation Administration.\n(b) If the Federal Aviation Administration, after reviewing the LWECS site plan, rejects the use of a light-mitigating technology for the LWECS under paragraph (a), the LWECS must be equipped with a wind turbine lighting system that minimizes the duration or intensity of the lighting system while maintaining full compliance with the lighting standards established in Chapter 13 of the Federal Aviation Administration's Advisory Circular 70/760-1, Obstruction Marking and Lighting, as updated.\n(a) The Public Utilities Commission or a county that has assumed permitting authority under section 216F.08 must grant an owner of an LWECS an exemption from subdivision 3, paragraph (a), if the Federal Aviation Administration denies the owner's application to equip an LWECS with a light-mitigating technology.\n(b) The Public Utilities Commission or a county that has assumed permitting authority under section 216F.08 must grant an owner of an LWECS an exemption from or an extension of time to comply with subdivision 3, paragraph (a), if after notice and public hearing the owner of the LWECS demonstrates to the satisfaction of the commission or county that:\n(1) equipping an LWECS with a light-mitigating technology is technically infeasible;\n(2) equipping an LWECS with a light-mitigating technology imposes a significant financial burden on the permittee; or\n(3) a vendor approved by the Federal Aviation Administration cannot deliver a light-mitigating technology to the LWECS owner in a reasonable amount of time.",
	"repealed": false
}