{
	"id": "171.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.16",
	"title": "171.16 COURT MAY RECOMMEND SUSPENSION.",
	"text": "Every court having jurisdiction over offenses committed under any law of this state or ordinance of a political subdivision regulating the operation of motor vehicles, shall forward to the department, within ten days, a record of the conviction of any person in the court for a violation of any laws or ordinances, except parking violations and defective vehicle equipment or vehicle size or weight violations.\n(a) The court may recommend the suspension of the driver's license of the person so convicted, and, subject to the limitations in this section, the commissioner shall suspend such license as recommended by the court, without a hearing as provided herein.\n(b) The commissioner is prohibited from suspending a person's driver's license if the person was convicted only under section 171.24, subdivision 1 or 2.\nThe commissioner is prohibited from suspending a person's driver's license based solely on the fact that a person:\n(1) has been convicted of:\n(i) violating a law of this state or an ordinance of a political subdivision which regulates the operation or parking of motor vehicles;\n(ii) a violation under section 169.06, subdivision 10; or\n(iii) a violation under section 169.14, subdivision 13;\n(2) has been sentenced to the payment of a fine or had a surcharge levied against that person, or sentenced to a fine upon which a surcharge was levied; and\n(3) has refused or failed to comply with that sentence or to pay the surcharge.\n(a) Upon receiving a report from the court, or from the driver licensing authority of a state, district, territory, or possession of the United States or a province of a foreign country which has an agreement in effect with this state pursuant to section 169.91, that a resident of this state or a person licensed as a driver in this state did not appear in court in compliance with the terms of a citation, the commissioner of public safety shall notify the driver that the driver's license will be suspended unless the commissioner receives notice within 30 days that the driver has appeared in the appropriate court. If the commissioner does not receive notice of the appearance in the appropriate court or payment of the fine within 30 days of the date of the commissioner's notice to the driver, the commissioner may suspend the driver's license, subject to the notice requirements of section 171.18, subdivision 2. Notwithstanding the requirements in this subdivision, the commissioner is prohibited from suspending the driver's license of a person based solely on the fact that the person did not appear in court (1) in compliance with the terms of a citation for a petty misdemeanor, or (2) for a violation of section 171.24, subdivision 1.\n(b) The order of suspension shall indicate the reason for the order and shall notify the driver that the driver's license remains suspended until the driver has furnished evidence, satisfactory to the commissioner, of compliance with any order entered by the court.\n(c) Suspension shall be ordered under this subdivision only when the report clearly identifies the person arrested; describes the violation, specifying the section of the traffic law, ordinance or rule violated; indicates the location and date of the offense; and describes the vehicle involved and its registration number.\n[Repealed, 1973 c 698 s 8]\nWhen any judge of a juvenile court, or any of its duly authorized agents, shall determine formally or informally that any person under the age of 18 years has violated any of the provisions of any law of this state, or ordinances of political subdivisions thereof, regulating the operation of motor vehicles on streets and highways, except parking violations, and except traffic offenses involving a violation of section 169A.20 that must be reported under section 171.17, the judge, or duly authorized agent, shall immediately report the determination to the department and may recommend the suspension of the person's license, and the commissioner is hereby authorized to suspend the license, without a hearing.\nA suspension under this section is subject to the notice requirements of section 171.18, subdivision 2.\n(a) For purposes of this subdivision:\n(1) \"issuing jurisdiction\" means a state, district, territory, or possession of the United States or a province of a foreign country which has an agreement in effect with this state pursuant to the nonresident violator compact; and\n(2) \"traffic violation\" means a violation of a traffic regulation relating to the operation of a motor vehicle and excludes a parking, vehicle equipment, or vehicle weight limit violation.\n(b) Notwithstanding subdivisions 3 and 3a, the commissioner may suspend the driver's license of a person licensed in this state upon receiving a report from an issuing jurisdiction that the person:\n(1) did not appear in court in compliance with the terms of a citation for a traffic violation that, if committed in this state, is a petty misdemeanor or a violation under section 171.24, subdivision 1; or\n(2) is convicted of a traffic violation, is subject to a fine or surcharge, and has failed to pay the fine or surcharge.\n(c) A suspension is authorized under this subdivision only as necessary to conform with the requirements of the nonresident violator compact.\n(d) A suspension under this subdivision is subject to the notice requirements under section 171.18, subdivision 2.",
	"repealed": false
}