{
	"id": "65A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.36",
	"title": "65A.36 UNDERWRITING.",
	"text": "Agents are not permitted to bind coverage. The Minnesota FAIR plan shall issue a policy if the risk meets preliminary underwriting requirements. The plan may request an inspection report to obtain further underwriting information. If the inspection reveals that the applicant is not eligible for the coverage applied for, the plan shall inform the applicant within 59 days of the inception of the policy that the policy will be rescinded under section 65A.01, subdivision 3, paragraph (b), or canceled under section 65A.38. If the applicant is eligible for other coverage provided by the plan, the plan will offer to replace the rescinded or canceled policy with a policy providing coverage for which the applicant is eligible.\nBefore the 60th day after the inception of the policy, the FAIR plan shall advise the applicant that:\n(1) the risk is acceptable with or without a condition charge or adjustment of policy limits. If a condition charge applies, the plan will tell the insured what improvements are necessary in order to remove the charge;\n(2) the risk is not acceptable unless improvements noted by the plan are made by the applicant and confirmed by the plan; or\n(3) the risk is not acceptable for the reasons stated by the plan.\nIf the risk is accepted, an invoice will be delivered to the applicant requiring remittance of the appropriate premium.\nIn the event a risk is declined because it fails to meet reasonable underwriting standards, the applicant must be so notified. Reasonable underwriting standards include, but are not limited to:\n(1) the physical condition of the property, such as its construction, heating, wiring, evidence of previous fires, significant unrepaired damage, or general deterioration;\n(2) the present use or housekeeping of the property such as vacancy, overcrowding, storage of rubbish, or flammable materials; or\n(3) other specific characteristics of ownership, condition, occupancy, or maintenance which are violative of public policy and result in increased exposure to loss.\nNeighborhood or area location or any environmental hazard beyond the control of the property owner are not acceptable criteria for declining a risk.\nIn the event that a risk is declined on the basis that it does not meet reasonable underwriting standards, or the coverage will be written on condition that the property be improved, the plan shall, within five business days, send copies of the inspection report to the applicant and the commissioner, and shall advise the applicant of the right to and the procedure for an appeal to the governing board and to the commissioner.\nThe plan must within five business days of the receipt of a completed application advise the applicant that the risk has been declined, the risk has been accepted, or that the limit of coverage has been adjusted to reflect the insurable value of the subject property.",
	"repealed": false
}