{
	"id": "163.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.12",
	"title": "163.12 ALTERNATIVE PROCEDURE FOR ACQUISITION.",
	"text": "If the county board so elects, it may adopt the procedure hereinafter set forth for the acquisition of lands or properties needed for the acquisition or alteration of a county highway and county state-aid highways.\n(a) Upon passage of the resolution specified in section 163.11, subdivision 2, a petition must be presented to the district court of the county in which the land is located. The petition must describe each tract of land through which the highway passes, state the purposes for which the land is proposed to be taken, and list the names of all persons appearing of record or known to the county to be the landowners.\n(b) Notice of the objects of the petition and of the time and place of presenting the notice must be served, together with a copy of the resolution, upon each occupant of each tract of land through which the highway passes at least 20 days before the hearing under subdivision 1b. If an owner is not a resident of the state, or the owner's place of residence is unknown to the county, service may be made by three weeks' published notice following the filing of an affidavit on behalf of the county by the county's agent or attorney stating that the county:\n(1) believes that the owner is not a resident of the state; and\n(2) has either mailed a copy of the notice to the owner at the owner's last known residence address or, after diligent inquiry, the owner's place of residence cannot be ascertained by the county.\nIf the state is an owner, the notice must be served upon the attorney general. An owner not served as provided in this subdivision is not bound by the proceeding, except if the owner voluntarily appears in the proceeding.\n(c) Within ten days of an owner's demand, the owner must be furnished a right-of-way map or plat of all that part of the owner's land to be taken. Any applicable plans or profiles that the county possesses must be made available to the owner for inspection.\nWhen proof of service of the notice required in subdivision 1a is filed with the court, the court shall hear all competent evidence offered for or against granting the petition at the time and place fixed in the notice or otherwise set by the court. On finding that the proposed taking is necessary and authorized by law the court shall order the proceedings to commence pursuant to the remaining provisions of this section.\nUpon order by the court under subdivision 1b to commence the proceedings the board shall fix the time and place it will meet. Notice of the meeting, together with a copy of the resolution, shall be served upon each occupant of each tract of land through which the highway passes at least ten days before the meeting. Ten days' posted notice of the meeting shall also be given. Proof of service and affidavit of posting shall be filed with the county auditor.\nThe county board shall meet at the time and place designated and shall proceed to view the premises affected. It shall hear all interested parties regarding damages occasioned by the establishment or alteration of the highway.\nThe damages may be determined by written agreement. Every such agreement shall be filed with the county auditor and shall be final as to the matters therein contained.\nThe county board shall determine the damages of those with whom no agreement can be reached or who are unknown. In making the determination the board shall deduct from the damages sustained by each tract the money value of the benefits, if any, accruing thereto, and award the difference as damages.\nThe award of damages shall be filed with the county auditor. Within seven days after filing the county auditor shall notify, in writing, each known owner and occupant of each tract of the filing of the awards. The notification shall set forth the date of the filing, the amount of the award of damages and any terms or conditions of the award.\nWithin 40 days after the filing of the award of damages, any owner or occupant may appeal from the award by filing a notice of the appeal with the court administrator of the district court of the county where the lands lie. The notice of appeal shall be accompanied by a bond of not less than $250, with sufficient surety approved by the judge or by the county auditor, conditioned to pay all costs arising from the appeal in case the award is sustained. A copy of the notice together with a copy of the bond shall be served upon the county auditor. The notice of appeal shall specify the award or failure to award appealed from, the land to which it relates, the nature and amount of the claim of appellant, and the grounds of the appeal.\nThe appeal shall be entered upon the calendar for trial at the next general term of court occurring more than 20 days after the appeal is perfected. It shall be tried in the same manner as an appeal in eminent domain proceedings under chapter 117. The prevailing party shall recover costs and disbursements to be fixed and allowed as in other civil cases and judgment shall be entered upon the verdict.\nUpon stipulation in lieu of judgment or upon final judgment, the county board shall promptly pay the amount so stipulated or the amount of the judgment. If no appeal is taken from an award, the county board shall pay the award within 20 days after the time for appeal has expired. The duty of the county board to pay the award or final judgment shall be held and construed to be just compensation or the securing of just compensation within the meaning of the constitution.\nAfter the award of damages has been filed, the board may proceed to open, construct, alter, or change the highway. An appeal from the award of damages shall not delay the prosecution of the proposed improvement, and the county board may proceed as if no appeal had been taken.",
	"repealed": false
}