{
	"id": "325K.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/325K.05",
	"title": "325K.05 LICENSURE AND QUALIFICATIONS OF CERTIFICATION AUTHORITIES.",
	"text": "To obtain or retain a license, a certification authority must:\n(1) be the subscriber of a certificate issued by the secretary and published in a recognized repository;\n(2) employ as operative personnel only persons who have not been convicted within the past 15 years of a felony or a crime involving fraud, false statement, or deception;\n(3) employ as operative personnel only persons who have demonstrated knowledge and proficiency in following the requirements of this chapter;\n(4) file with the secretary a suitable guaranty, unless the certification authority is a department, office, or official of a federal, state, city, or county governmental entity that is self-insured;\n(5) use a trustworthy system, including a secure means for limiting access to its private key;\n(6) present proof to the secretary of having working capital reasonably sufficient, according to rules adopted by the secretary, to enable the applicant to conduct business as a certification authority;\n(7) register its business organization with the secretary, unless the applicant is a governmental entity or is otherwise prohibited from registering;\n(8) require a potential subscriber to appear in person before the certification authority, or an agent of the certification authority, to prove the subscriber's identity before a certificate is issued to the subscriber; and\n(9) comply with all further licensing requirements established by rule by the secretary.\nThe secretary may, by rule, establish standards by which the in-person registration required in clause (8) may be waived.\nThe secretary must issue a license to a certification authority that:\n(1) is qualified under subdivision 1;\n(2) applies in writing to the secretary for a license; and\n(3) pays a filing fee adopted by rule by the secretary.\n[Repealed, 1998 c 321 s 31]\n(a) The secretary may revoke or suspend a certification authority's license, in accordance with the Administrative Procedure Act, chapter 14, for failure to comply with this chapter or for failure to remain qualified under subdivision 1.\n(b) The secretary may order a summary suspension of a license. The written order for summary suspension may include a finding that the certification authority has:\n(1) used its license in the commission of a state or federal crime or of a violation of sections 325F.68 to 325F.70; or\n(2) engaged in conduct giving rise to serious risk of loss to public or private parties if the license is not immediately suspended.\nThe secretary may recognize by rule the licensing or authorization of certification authorities by non-Minnesota governmental entities, provided that those licensing or authorization requirements are substantially similar to those of this state. If licensing by another governmental entity is so recognized:\n(1) sections 325K.19 to 325K.24 apply to certificates issued by the certification authorities licensed or authorized by that governmental entity in the same manner as it applies to licensed certification authorities of this state; and\n(2) the liability limits of section 325K.17 apply to the certification authorities licensed or authorized by that governmental entity in the same manner as they apply to licensed certification authorities of this state.\nParties may provide by contract for the effectiveness, enforceability, or validity of any digital signature as between those parties. Sections 325K.19 to 325K.24 do not apply to a certificate and associated digital signature issued by an unlicensed certification authority.\nA certification authority that has not obtained a license is not subject to the provisions of this chapter, except as specifically provided.",
	"repealed": false
}