{
	"id": "206.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.95",
	"title": "206.95 VOTING EQUIPMENT GRANT ACCOUNT.",
	"text": "A voting equipment grant account is established in the special revenue fund. Funds in the account are appropriated to the secretary of state to provide grants to political subdivisions as authorized by this section. Funds in the account are available until expended.\nA political subdivision may apply to receive a grant under this section for the purchase or lease of the following:\n(1) an electronic voting system, or any individual components of an electronic voting system as provided in section 206.56, subdivision 8;\n(2) assistive voting technology;\n(3) an electronic roster system meeting the technology requirements of section 201.225, subdivision 2; and\n(4) any other equipment or technology approved by the secretary of state for use in conducting a state or local election in Minnesota consistent with the requirements of law.\n(a) The secretary of state may make a grant from the account to a political subdivision only after receiving an application from the political subdivision. The application must contain the following information:\n(1) the date the application is submitted;\n(2) the name of the political subdivision;\n(3) the name and title of the individual who prepared the application;\n(4) the type of voting system currently used in each precinct in the political subdivision;\n(5) the date the system currently used was acquired and at what cost;\n(6) the total number of registered voters, as of the date of the application, in each precinct in the political subdivision;\n(7) the total amount of the grant requested;\n(8) the total amount and source of the political subdivision's money to be used to match a grant from the account;\n(9) the type of voting system to be acquired with the grant money and whether the voting system will permit individuals with disabilities to cast a secret ballot;\n(10) the proposed schedule for purchasing and implementing the new voting system and the precincts in which the new voting system would be used;\n(11) whether the political subdivision has previously applied for a grant from the account and the disposition of that application;\n(12) a certified statement by the political subdivision that the grant will be used only to purchase authorized equipment under subdivision 2 and that the political subdivision has insufficient resources to purchase the voting system without obtaining a grant from the account; and\n(13) any other information required by the secretary of state.\n(b) The secretary of state must establish a deadline for receipt of grant applications, a procedure for awarding and distributing grants, and a process for verifying the proper use of the grants after distribution.\nA political subdivision is eligible to receive a grant of no more than 75 percent of the total cost of electronic roster equipment and 50 percent of the total cost of all other equipment or technology authorized for a grant under subdivision 2. In evaluating the application, the secretary of state shall consider only the information set forth in the application and is not subject to chapter 14. If the secretary of state determines that the application has been fully and properly completed, and that there is a sufficient balance in the account to fund the grant, either in whole or in part, the secretary of state may approve the application.\nNo later than January 15, 2018, and annually thereafter until the appropriations provided for grants under this section have been exhausted, the secretary of state must submit a report to the legislative committees with jurisdiction over elections policy on grants awarded by this section. The report must detail each grant awarded, including the jurisdiction, the amount of the grant, and the type of equipment purchased.",
	"repealed": false
}