{
	"id": "259.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.59",
	"title": "259.59 EFFECT OF ADOPTION.",
	"text": "Upon adoption, the adopted person shall become the legal child of the adopting persons and they shall become the legal parents of the child with all the rights and duties between them of birth parents and legitimate child. By virtue of the adoption the adopted person shall inherit from the adoptive parents or their relatives the same as though the adopted person were the natural child of the parents, and in case of the adopted person's death intestate the adoptive parents and their relatives shall inherit the adopted person's estate as if the adopted person had been the child's birth parents and relatives. After a decree of adoption is entered the birth parents of an adopted person shall be relieved of all parental responsibilities for the adopted person, and they shall not exercise or have any rights over the adopted person or the adopted person's property. The adopted person shall not owe the birth parents or their relatives any legal duty nor shall the adopted person inherit from the birth parents or kindred, except as provided in subdivision 1a and section 257C.08, subdivision 6.\nNotwithstanding any other provisions to the contrary in this section, the adoption of a child by a stepparent shall not in any way change the status of the relationship between the child and the child's birth parent who is the spouse of the petitioning stepparent.\nIf a parent dies and a child is subsequently adopted by a stepparent who is the spouse of a surviving parent, any rights of inheritance of the child or the child's issue from or through the deceased parent of the child which exist at the time of the death of that parent shall not be affected by the adoption.\nNotwithstanding the provisions of subdivision 1, the adoption of a person whose birth parent or parents are enrolled in an American Indian tribe shall not change the person's enrollment in that tribe.\nThis section does not prohibit birth parents, birth relatives, and adoptive parents from entering a communication or contact agreement under section 259.58.",
	"repealed": false
}