{
	"id": "142E.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.18",
	"title": "142E.18 FAIR HEARING PROCESS.",
	"text": "(a) An applicant or recipient adversely affected by an action of a county agency or the commissioner, for an action taken directly against the applicant or recipient, may request and receive a fair hearing in accordance with this subdivision and section 142A.20. An applicant or recipient does not have a right to a fair hearing if a county agency or the commissioner takes action against a provider.\n(b) A county agency must offer an informal conference to an applicant or recipient who is entitled to a fair hearing under this section. A county agency must advise an applicant or recipient that a request for a conference is optional and does not delay or replace the right to a fair hearing.\n(c) If a provider's authorization is suspended, denied, or revoked, a county agency or the commissioner must mail notice to each child care assistance program recipient receiving care from the provider.\n(a) This subdivision applies to providers caring for children receiving child care assistance.\n(b) A provider may request a fair hearing according to section 142A.20 only if a county agency or the commissioner:\n(1) denies or revokes a provider's authorization, unless the action entitles the provider to:\n(i) an administrative review under section 142E.19; or\n(ii) a contested case hearing or an administrative reconsideration under section 142A.12;\n(2) assigns responsibility for an overpayment to a provider under section 142E.14, subdivision 2;\n(3) establishes an overpayment for failure to comply with section 142E.16, subdivision 7;\n(4) seeks monetary recovery or recoupment under section 142E.51, subdivision 7, paragraph (c), clause (2);\n(5) ends a provider's rate differential under section 142E.17, subdivision 4 or 5;\n(6) initiates an administrative fraud disqualification; or\n(7) issues a payment and the provider disagrees with the amount of the payment.\n(c) A provider may request a fair hearing by submitting a written request to the state agency. A provider's request must be received by the state agency no later than 30 days after the date a county or the commissioner sends the notice under subdivision 4.\n(d) The provider's appeal request must contain the following:\n(1) each disputed item, the reason for the dispute, and, if applicable, an estimate of the dollar amount involved for each disputed item;\n(2) the computation the provider believes to be correct, if applicable;\n(3) the statute or rule relied on for each disputed item; and\n(4) the name, address, and telephone number of the person at the provider's place of business with whom contact may be made regarding the appeal.\nThe human services judge assigned to a fair hearing may join a family or a provider as a party to the fair hearing whenever joinder of that party is necessary to fully and fairly resolve issues raised in the appeal.\n(a) Before taking an action appealable under subdivision 2, paragraph (b), clauses (1) to (5), a county agency or the commissioner must send written notice to the provider against whom the action is being taken. Unless otherwise specified under this chapter or Minnesota Rules, chapter 3400, a county agency or the commissioner must send the written notice at least 15 calendar days before the adverse action's effective date. If the appealable action is a denial of an authorization under subdivision 2, paragraph (b), clause (1), the provider's notice is effective on the date the notice is sent.\n(b) The notice of adverse action in paragraph (a) shall state (1) the factual basis for the county agency or department's determination, (2) the action the county agency or department intends to take, (3) the dollar amount of the monetary recovery or recoupment, if known, and (4) the provider's right to appeal the department's proposed action.\n(c) Notice requirements for administrative fraud disqualifications under subdivision 2, paragraph (b), clause (6), are set forth in section 142E.51, subdivision 5.\n(d) A provider must receive notices that include:\n(1) the right to appeal if a county issues a payment and the provider disagrees with the amount of the payment under subdivision 2, paragraph (b), clause (7), at the time of authorization and reauthorization under section 142E.16, subdivision 7; and\n(2) the amount of each payment when a payment is issued.\n(e) A provider's request to appeal a payment amount must be received by the state agency no later than 30 days after the date a county sends the notice informing the provider of its payment amount.\n[See Note.]\n(a) If the commissioner denies or revokes a provider's authorization based on a licensing action under section 142B.18, and the provider appeals, the provider's fair hearing must be stayed until the commissioner issues an order as required under section 142B.20, subdivision 6.\n(b) If the commissioner denies or revokes a provider's authorization based on decertification under section 142C.07, and the provider appeals, the provider's fair hearing must be stayed until the commissioner issues a final order as required under section 142C.07.\n[See Note.]\nUnless the commissioner receives a timely and proper request for an appeal, a county agency's or the commissioner's action shall be considered a final department action.",
	"repealed": false
}