{
	"id": "3.739",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.739",
	"title": "3.739 INJURY OR DEATH OF CERTAIN INMATES OR PERSONS.",
	"text": "Claims and demands arising out of the circumstances described in this subdivision shall be presented to, heard, and determined as provided in subdivision 2:\n(1) an injury to or death of an inmate of a state, regional, or local correctional facility or county jail while performing compensated or uncompensated work in the community for a state agency, a political subdivision or public corporation of this state, a nonprofit educational, medical, or social service agency, or a private business or individual, while performing the work;\n(2) an injury to or death of a person sentenced by a court, granted a suspended sentence by a court, or subject to a court disposition order, and who is performing work (i) in restitution, (ii) in lieu of or to work off fines, court-ordered costs, or other statutorily authorized correctional fees, (iii) in lieu of incarceration, or (iv) as a term or condition of a sentence, suspended sentence, or disposition order, while performing the work;\n(3) an injury to or death of a person, who has been diverted from the court system and who is performing work as described in clause (1) or (2) under a written agreement signed by the person, and if a juvenile, by a parent or guardian; and\n(4) an injury to or death of any person caused by an individual who was performing work as described in clause (1), (2), or (3).\nClaims of $7,000 or less subject to this section shall be investigated by the state or local agency responsible for supervising the work to determine if the claim is valid and if the loss is covered by the claimant's insurance. The investigating agency shall submit all appropriate claims to the Department of Corrections. Subject to the limitations contained in subdivision 2a, the department shall pay the portion of an approved claim that is not covered by the claimant's insurance. This payment shall be made within a reasonable time. On or before the first day of each legislative session, the department shall submit to the appropriate committees of the senate and the house of representatives a list of the claims paid by it during the preceding calendar year and shall be reimbursed by legislative appropriation for the claims paid. For the purposes of this paragraph, in the case of a juvenile claimant the term \"claimant's insurance\" includes the insurance of the juvenile's parents if the juvenile is covered by the insurance.\nA claim in excess of $7,000, and a claim that was not paid by the department may be presented to, heard, and determined by the appropriate committees of the senate and the house of representatives and, if approved, shall be paid pursuant to legislative claims procedure.\nNo juvenile claimant receiving payment under this section may be identified by name either in the list of claimants submitted by the department or in the legislative appropriation.\nCompensation paid under this section is limited to reimbursement for medical expenses and compensation for permanent total disability, permanent partial disability, or death. Reimbursement for medical expenses under this section is limited to the amount which would be payable for the same expenses under the medical assistance program authorized under chapter 256B. No compensation shall be paid under this section for pain and suffering. Payments made under this section shall be reduced by any proceeds received by the claimant or the medical care provider from any insurance policy covering the loss. For the purposes of this section, \"insurance policy\" does not include the medical assistance program authorized under chapter 256B.\nThe procedure established by this section is exclusive of all other legal, equitable, and statutory remedies against the state, its political subdivisions, or employees of the state or its political subdivisions.",
	"repealed": false
}