{
	"id": "144.651",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.651",
	"title": "144.651 HEALTH CARE BILL OF RIGHTS.",
	"text": "It is the intent of the legislature and the purpose of this section to promote the interests and well being of the patients and residents of health care facilities. No health care facility may require a patient or resident to waive these rights as a condition of admission to the facility. Any guardian or conservator of a patient or resident or, in the absence of a guardian or conservator, an interested person, may seek enforcement of these rights on behalf of a patient or resident. An interested person may also seek enforcement of these rights on behalf of a patient or resident who has a guardian or conservator through administrative agencies or in district court having jurisdiction over guardianships and conservatorships. Pending the outcome of an enforcement proceeding the health care facility may, in good faith, comply with the instructions of a guardian or conservator. It is the intent of this section that every patient's civil and religious liberties, including the right to independent personal decisions and knowledge of available choices, shall not be infringed and that the facility shall encourage and assist in the fullest possible exercise of these rights.\nFor the purposes of this section, \"patient\" means a person who is admitted to an acute care inpatient facility for a continuous period longer than 24 hours, for the purpose of diagnosis or treatment bearing on the physical or mental health of that person. For purposes of subdivisions 4 to 9, 12, 13, 15, 16, and 18 to 20, \"patient\" also means a person who receives health care services at an outpatient surgical center or at a birth center licensed under section 144.615. \"Patient\" also means a minor who is admitted to a residential program as defined in section 253C.01. For purposes of subdivisions 1, 3 to 16, 18, 20 and 30, \"patient\" also means any person who is receiving mental health treatment on an outpatient basis or in a community support program or other community-based program. \"Resident\" means a person who is admitted to a nonacute care facility including extended care facilities, nursing homes, and boarding care homes for care required because of prolonged mental or physical illness or disability, recovery from injury or disease, or advancing age. For purposes of all subdivisions except subdivisions 28 and 29, \"resident\" also means a person who is admitted to a facility licensed as a board and lodging facility under Minnesota Rules, parts 4625.0100 to 4625.2355, a boarding care home under sections 144.50 to 144.56, or a supervised living facility under Minnesota Rules, parts 4665.0100 to 4665.9900, and which operates a rehabilitation program licensed under chapter 245G or 245I, or Minnesota Rules, parts 9530.6510 to 9530.6590.\n[See Note.]\nIt is declared to be the public policy of this state that the interests of each patient and resident be protected by a declaration of a patients' bill of rights which shall include but not be limited to the rights specified in this section.\nPatients and residents shall, at admission, be told that there are legal rights for their protection during their stay at the facility or throughout their course of treatment and maintenance in the community and that these are described in an accompanying written statement of the applicable rights and responsibilities set forth in this section. In the case of patients admitted to residential programs as defined in section 253C.01, the written statement shall also describe the right of a person 16 years old or older to request release as provided in section 253B.04, subdivision 2, and shall list the names and telephone numbers of individuals and organizations that provide advocacy and legal services for patients in residential programs. Reasonable accommodations shall be made for people who have communication disabilities and those who speak a language other than English. Current facility policies, inspection findings of state and local health authorities, and further explanation of the written statement of rights shall be available to patients, residents, their guardians or their chosen representatives upon reasonable request to the administrator or other designated staff person, consistent with chapter 13, the Data Practices Act, and section 626.557, relating to vulnerable adults.\nPatients and residents have the right to be treated with courtesy and respect for their individuality by employees of or persons providing service in a health care facility.\nPatients and residents shall have the right to appropriate medical and personal care based on individual needs. Appropriate care for residents means care designed to enable residents to achieve their highest level of physical and mental functioning. This right is limited where the service is not reimbursable by public or private resources.\nPatients and residents shall have or be given, in writing, the name, business address, telephone number, and specialty, if any, of the physician, advanced practice registered nurse, or physician assistant responsible for coordination of their care. In cases where it is medically inadvisable, as documented by the attending physician, advanced practice registered nurse, or physician assistant in a patient's or resident's care record, the information shall be given to the patient's or resident's guardian or other person designated by the patient or resident as a representative.\nPatients and residents who receive services from an outside provider are entitled, upon request, to be told the identity of the provider. Residents shall be informed, in writing, of any health care services which are provided to those residents by individuals, corporations, or organizations other than their facility. Information shall include the name of the outside provider, the address, and a description of the service which may be rendered. In cases where it is medically inadvisable, as documented by the attending physician, advanced practice registered nurse, or physician assistant in a patient's or resident's care record, the information shall be given to the patient's or resident's guardian or other person designated by the patient or resident as a representative.\nPatients and residents shall be given by their physicians, advanced practice registered nurses, or physician assistants complete and current information concerning their diagnosis, treatment, alternatives, risks, and prognosis as required by the physician's, advanced practice registered nurse's, or physician assistant's legal duty to disclose. This information shall be in terms and language the patients or residents can reasonably be expected to understand. Patients and residents may be accompanied by a family member or other chosen representative, or both. This information shall include the likely medical or major psychological results of the treatment and its alternatives. In cases where it is medically inadvisable, as documented by the attending physician, advanced practice registered nurse, or physician assistant in a patient's or resident's medical record, the information shall be given to the patient's or resident's guardian or other person designated by the patient or resident as a representative. Individuals have the right to refuse this information.\nEvery patient or resident suffering from any form of breast cancer shall be fully informed, prior to or at the time of admission and during her stay, of all alternative effective methods of treatment of which the treating physician, advanced practice registered nurse, or physician assistant is knowledgeable, including surgical, radiological, or chemotherapeutic treatments or combinations of treatments and the risks associated with each of those methods.\n(a) Patients and residents shall have the right to participate in the planning of their health care. This right includes the opportunity to discuss treatment and alternatives with individual caregivers, the opportunity to request and participate in formal care conferences, and the right to include a family member or other chosen representative, or both. In the event that the patient or resident cannot be present, a family member or other representative chosen by the patient or resident may be included in such conferences. A chosen representative may include a doula of the patient's choice.\n(b) If a patient or resident who enters a facility is unconscious or comatose or is unable to communicate, the facility shall make reasonable efforts as required under paragraph (c) to notify either a family member or a person designated in writing by the patient as the person to contact in an emergency that the patient or resident has been admitted to the facility. The facility shall allow the family member to participate in treatment planning, unless the facility knows or has reason to believe the patient or resident has an effective advance directive to the contrary or knows the patient or resident has specified in writing that they do not want a family member included in treatment planning. After notifying a family member but prior to allowing a family member to participate in treatment planning, the facility must make reasonable efforts, consistent with reasonable medical practice, to determine if the patient or resident has executed an advance directive relative to the patient or resident's health care decisions. For purposes of this paragraph, \"reasonable efforts\" include:\n(1) examining the personal effects of the patient or resident;\n(2) examining the medical records of the patient or resident in the possession of the facility;\n(3) inquiring of any emergency contact or family member contacted under this section whether the patient or resident has executed an advance directive and whether the patient or resident has a physician, advanced practice registered nurse, or physician assistant to whom the patient or resident normally goes for care; and\n(4) inquiring of the physician, advanced practice registered nurse, or physician assistant to whom the patient or resident normally goes for care, if known, whether the patient or resident has executed an advance directive. If a facility notifies a family member or designated emergency contact or allows a family member to participate in treatment planning in accordance with this paragraph, the facility is not liable to the patient or resident for damages on the grounds that the notification of the family member or emergency contact or the participation of the family member was improper or violated the patient's privacy rights.\n(c) In making reasonable efforts to notify a family member or designated emergency contact, the facility shall attempt to identify family members or a designated emergency contact by examining the personal effects of the patient or resident and the medical records of the patient or resident in the possession of the facility. If the facility is unable to notify a family member or designated emergency contact within 24 hours after the admission, the facility shall notify the county social service agency or local law enforcement agency that the patient or resident has been admitted and the facility has been unable to notify a family member or designated emergency contact. The county social service agency and local law enforcement agency shall assist the facility in identifying and notifying a family member or designated emergency contact. A county social service agency or local law enforcement agency that assists a facility in implementing this subdivision is not liable to the patient or resident for damages on the grounds that the notification of the family member or emergency contact or the participation of the family member was improper or violated the patient's privacy rights.\n(a) Subject to paragraph (c), a health care provider and a health care facility must allow, at a minimum, one designated support person chosen by a patient, including but not limited to a pregnant patient, to be physically present while the patient is receiving health care services including during a hospital stay.\n(b) For purposes of this subdivision, \"designated support person\" means any person chosen by the patient to provide comfort to the patient including but not limited to the patient's spouse, partner, family member, or another person related by affinity. Certified doulas and traditional midwives may not be counted toward the limit of one designated support person.\n(c) A facility may restrict or prohibit the presence of a designated support person in treatment rooms, procedure rooms, and operating rooms when such a restriction or prohibition is strictly necessary to meet the appropriate standard of care. A facility may also restrict or prohibit the presence of a designated support person if the designated support person is acting in a violent or threatening manner toward others. Any restriction or prohibition of a designated support person by the facility is subject to the facility's written internal grievance procedure required by subdivision 20.\nPatients and residents shall have the right to be cared for with reasonable regularity and continuity of staff assignment as far as facility policy allows.\nCompetent patients and residents shall have the right to refuse treatment based on the information required in subdivision 9. Residents who refuse treatment, medication, or dietary restrictions shall be informed of the likely medical or major psychological results of the refusal, with documentation in the individual medical record. In cases where a patient or resident is incapable of understanding the circumstances but has not been adjudicated incompetent, or when legal requirements limit the right to refuse treatment, the conditions and circumstances shall be fully documented by the attending physician, advanced practice registered nurse, or physician assistant in the patient's or resident's medical record.\nWritten, informed consent must be obtained prior to a patient's or resident's participation in experimental research. Patients and residents have the right to refuse participation. Both consent and refusal shall be documented in the individual care record.\nPatients and residents shall be free from maltreatment as defined in the Vulnerable Adults Protection Act. \"Maltreatment\" means conduct described in section 626.5572, subdivision 15, or the intentional and nontherapeutic infliction of physical pain or injury, or any persistent course of conduct intended to produce mental or emotional distress. Every patient and resident shall also be free from nontherapeutic chemical and physical restraints, except in fully documented emergencies, or as authorized in writing after examination by a patient's or resident's physician, advanced practice registered nurse, or physician assistant for a specified and limited period of time, and only when necessary to protect the resident from self-injury or injury to others.\nPatients and residents shall have the right to respectfulness and privacy as it relates to their medical and personal care program. Case discussion, consultation, examination, and treatment are confidential and shall be conducted discreetly. Privacy shall be respected during toileting, bathing, and other activities of personal hygiene, except as needed for patient or resident safety or assistance.\nPatients and residents shall be assured confidential treatment of their personal and medical records, and may approve or refuse their release to any individual outside the facility. Residents shall be notified when personal records are requested by any individual outside the facility and may select someone to accompany them when the records or information are the subject of a personal interview. Copies of records and written information from the records shall be made available in accordance with this subdivision and sections 144.291 to 144.298. This right does not apply to complaint investigations and inspections by the Department of Health, where required by third-party payment contracts, or where otherwise provided by law.\nPatients and residents shall be informed, prior to or at the time of admission and during their stay, of services which are included in the facility's basic per diem or daily room rate and that other services are available at additional charges. Facilities shall make every effort to assist patients and residents in obtaining information regarding whether the Medicare or medical assistance program will pay for any or all of the aforementioned services.\nPatients and residents shall have the right to a prompt and reasonable response to their questions and requests.\nPatients and residents shall have the right to every consideration of their privacy, individuality, and cultural identity as related to their social, religious, and psychological well-being. Facility staff shall respect the privacy of a resident's room by knocking on the door and seeking consent before entering, except in an emergency or where clearly inadvisable.\nPatients and residents shall be encouraged and assisted, throughout their stay in a facility or their course of treatment, to understand and exercise their rights as patients, residents, and citizens. Patients and residents may voice grievances and recommend changes in policies and services to facility staff and others of their choice, free from restraint, interference, coercion, discrimination, or reprisal, including threat of discharge. Notice of the grievance procedure of the facility or program, as well as addresses and telephone numbers for the Office of Health Facility Complaints and the area nursing home ombudsman pursuant to the Older Americans Act, section 307(a)(12) shall be posted in a conspicuous place.\nEvery acute care inpatient facility, every residential program as defined in section 253C.01, every nonacute care facility, and every facility employing more than two people that provides outpatient mental health services shall have a written internal grievance procedure that, at a minimum, sets forth the process to be followed; specifies time limits, including time limits for facility response; provides for the patient or resident to have the assistance of an advocate; requires a written response to written grievances; and provides for a timely decision by an impartial decision maker if the grievance is not otherwise resolved. Compliance by hospitals, residential programs as defined in section 253C.01 which are hospital-based primary treatment programs, and outpatient surgery centers with section 144.691 and compliance by health maintenance organizations with section 62D.11 is deemed to be compliance with the requirement for a written internal grievance procedure.\nPatients and residents may associate and communicate privately with persons of their choice and enter and, except as provided by the Minnesota Commitment Act, leave the facility as they choose. Patients and residents shall have access, at their expense, to writing instruments, stationery, and postage. Personal mail shall be sent without interference and received unopened unless medically or programmatically contraindicated and documented by the physician or advanced practice registered nurse in the medical record. There shall be access to a telephone where patients and residents can make and receive calls as well as speak privately. Facilities which are unable to provide a private area shall make reasonable arrangements to accommodate the privacy of patients' or residents' calls. Upon admission to a facility where federal law prohibits unauthorized disclosure of patient or resident identifying information to callers and visitors, the patient or resident, or the legal guardian or conservator of the patient or resident, shall be given the opportunity to authorize disclosure of the patient's or resident's presence in the facility to callers and visitors who may seek to communicate with the patient or resident. To the extent possible, the legal guardian or conservator of a patient or resident shall consider the opinions of the patient or resident regarding the disclosure of the patient's or resident's presence in the facility. This right is limited where medically inadvisable, as documented by the attending physician or advanced practice registered nurse in a patient's or resident's care record. Where programmatically limited by a facility abuse prevention plan pursuant to section 626.557, subdivision 14, paragraph (b), this right shall also be limited accordingly.\nPatients and residents may retain and use their personal clothing and possessions as space permits, unless to do so would infringe upon rights of other patients or residents, and unless medically or programmatically contraindicated for documented medical, safety, or programmatic reasons. The facility must either maintain a central locked depository or provide individual locked storage areas in which residents may store their valuables for safekeeping. The facility may, but is not required to, provide compensation for or replacement of lost or stolen items.\nPatients and residents shall not perform labor or services for the facility unless those activities are included for therapeutic purposes and appropriately goal-related in their individual medical record.\nResidents may purchase or rent goods or services not included in the per diem rate from a supplier of their choice unless otherwise provided by law. The supplier shall ensure that these purchases are sufficient to meet the medical or treatment needs of the residents.\nCompetent residents may manage their personal financial affairs, or shall be given at least a quarterly accounting of financial transactions on their behalf if they delegate this responsibility in accordance with the laws of Minnesota to the facility for any period of time.\n(a) Residents may meet with and receive visitors and participate in activities of commercial, religious, political, as defined in section 203B.11 and community groups without interference at their discretion if the activities do not infringe on the right to privacy of other residents or are not programmatically contraindicated. This includes:\n(1) the right to join with other individuals within and outside the facility to work for improvements in long-term care;\n(2) the right to visitation by an individual the patient has appointed as the patient's health care agent under chapter 145C;\n(3) the right to visitation and health care decision making by an individual designated by the patient under paragraph (c).\n(b) Upon admission to a facility where federal law prohibits unauthorized disclosure of patient or resident identifying information to callers and visitors, the patient or resident, or the legal guardian or conservator of the patient or resident, shall be given the opportunity to authorize disclosure of the patient's or resident's presence in the facility to callers and visitors who may seek to communicate with the patient or resident. To the extent possible, the legal guardian or conservator of a patient or resident shall consider the opinions of the patient or resident regarding the disclosure of the patient's or resident's presence in the facility.\n(c) Upon admission to a facility, the patient or resident, or the legal guardian or conservator of the patient or resident, must be given the opportunity to designate a person who is not related who will have the status of the patient's next of kin with respect to visitation and making a health care decision. A designation must be included in the patient's health record. With respect to making a health care decision, a health care directive or appointment of a health care agent under chapter 145C prevails over a designation made under this paragraph. The unrelated person may also be identified as such by the patient or by the patient's family.\nResidents and their families shall have the right to organize, maintain, and participate in resident advisory and family councils. Each facility shall provide assistance and space for meetings. Council meetings shall be afforded privacy, with staff or visitors attending only upon the council's invitation. A staff person shall be designated the responsibility of providing this assistance and responding to written requests which result from council meetings. Resident and family councils shall be encouraged to make recommendations regarding facility policies.\nResidents, if married, shall be assured privacy for visits by their spouses and, if both spouses are residents of the facility, they shall be permitted to share a room, unless medically contraindicated and documented by their physicians in the medical records.\nResidents shall not be arbitrarily transferred or discharged. Residents must be notified, in writing, of the proposed discharge or transfer and its justification no later than 30 days before discharge from the facility and seven days before transfer to another room within the facility. This notice shall include the resident's right to contest the proposed action, with the address and telephone number of the area nursing home ombudsman pursuant to the Older Americans Act, section 307(a)(12). The resident, informed of this right, may choose to relocate before the notice period ends. The notice period may be shortened in situations outside the facility's control, such as a determination by utilization review, the accommodation of newly admitted residents, a change in the resident's medical or treatment program, the resident's own or another resident's welfare, or nonpayment for stay unless prohibited by the public program or programs paying for the resident's care, as documented in the medical record. Facilities shall make a reasonable effort to accommodate new residents without disrupting room assignments.\nPatients and residents shall have the right of reasonable access at reasonable times to any available rights protection services and advocacy services so that the patient may receive assistance in understanding, exercising, and protecting the rights described in this section and in other law. This right shall include the opportunity for private communication between the patient and a representative of the rights protection service or advocacy service.\nA minor patient who has been admitted to a residential program as defined in section 253C.01 has the right to be free from physical restraint and isolation except in emergency situations involving a likelihood that the patient will physically harm the patient's self or others. These procedures may not be used for disciplinary purposes, to enforce program rules, or for the convenience of staff. Isolation or restraint may be used only upon the prior authorization of a physician, advanced practice registered nurse, physician assistant, psychiatrist, or licensed psychologist, only when less restrictive measures are ineffective or not feasible and only for the shortest time necessary.\nA minor patient who has been admitted to a residential program as defined in section 253C.01 has the right to a written treatment plan that describes in behavioral terms the case problems, the precise goals of the plan, and the procedures that will be utilized to minimize the length of time that the minor requires inpatient treatment. The plan shall also state goals for release to a less restrictive facility and follow-up treatment measures and services, if appropriate. To the degree possible, the minor patient and the minor patient's parents or guardian shall be involved in the development of the treatment and discharge plan.\n(a) Competent nursing home residents, family members of residents who are not competent, and legally appointed conservators, guardians, and health care agents as defined under section 145C.01, have the right to request and consent to the use of a physical restraint in order to treat the medical symptoms of the resident.\n(b) Upon receiving a request for a physical restraint, a nursing home shall inform the resident, family member, or legal representative of alternatives to and the risks involved with physical restraint use. The nursing home shall provide a physical restraint to a resident only upon receipt of a signed consent form authorizing restraint use and a written order from the attending physician, advanced practice registered nurse, or physician assistant that contains statements and determinations regarding medical symptoms and specifies the circumstances under which restraints are to be used.\n(c) A nursing home providing a restraint under paragraph (b) must:\n(1) document that the procedures outlined in that paragraph have been followed;\n(2) monitor the use of the restraint by the resident; and\n(3) periodically, in consultation with the resident, the family, and the attending physician, advanced practice registered nurse, or physician assistant, reevaluate the resident's need for the restraint.\n(d) A nursing home shall not be subject to fines, civil money penalties, or other state or federal survey enforcement remedies solely as the result of allowing the use of a physical restraint as authorized in this subdivision. Nothing in this subdivision shall preclude the commissioner from taking action to protect the health and safety of a resident if:\n(1) the use of the restraint has jeopardized the health and safety of the resident; and\n(2) the nursing home failed to take reasonable measures to protect the health and safety of the resident.\n(e) For purposes of this subdivision, \"medical symptoms\" include:\n(1) a concern for the physical safety of the resident; and\n(2) physical or psychological needs expressed by a resident. A resident's fear of falling may be the basis of a medical symptom.\nA written order from the attending physician, advanced practice registered nurse, or physician assistant that contains statements and determinations regarding medical symptoms is sufficient evidence of the medical necessity of the physical restraint.\n(f) When determining nursing facility compliance with state and federal standards for the use of physical restraints, the commissioner of health is bound by the statements and determinations contained in the attending physician's, advanced practice registered nurse's, or physician assistant's order regarding medical symptoms. For purposes of this order, \"medical symptoms\" include the request by a competent resident, family member of a resident who is not competent, or legally appointed conservator, guardian, or health care agent as defined under section 145C.01, that the facility provide a physical restraint in order to enhance the physical safety of the resident.",
	"repealed": false
}