{
	"id": "161.3426",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.3426",
	"title": "161.3426 DESIGN-BUILD AWARD.",
	"text": "Except as provided in subdivision 2, a design-build contract shall be awarded as follows:\n(a) The Technical Review Committee shall score the technical proposals using the selection criteria in the request for proposals (RFP). The Technical Review Committee shall then submit a technical proposal score for each design-builder to the commissioner. The Technical Review Committee shall reject any proposal it deems nonresponsive.\n(b) The commissioner shall announce the technical proposal score for each design-builder and shall publicly open the sealed price proposals and shall divide each design-builder's price by the technical score that the Technical Review Committee has given to it to obtain an adjusted score. The design-builder selected must be that responsive and responsible design-builder whose adjusted score is the lowest.\n(c) If a time factor is included with the selection criteria in the RFP package, the commissioner may also adjust the bids using a value of the time factor established by the commissioner. The value of the time factor must be expressed as a value per day. The adjustment must be based on the total time value. The total time value is the design-builder's total number of days to complete the project multiplied by the factor. The time-adjusted price is the total time value plus the bid amount. This adjustment must be used for selection purposes only, and must not affect the Department of Transportation's liquidated damages schedule or incentive or disincentive program. An adjusted score must then be obtained by dividing each design-builder's time-adjusted price by the score given by the technical review team. The commissioner shall select the responsive and responsible design-builder whose adjusted score is the lowest.\n(d) Unless all proposals are rejected, the commissioner shall award the contract to the responsive and responsible design-builder with the lowest adjusted score. The commissioner shall reserve the right to reject all proposals.\n(a) The commissioner may elect to use the process in paragraph (b) for a design-build contract for a project with an estimated project cost of less than $5,000,000.\n(b) The commissioner shall give the lowest cost proposal the full number of price points defined in the request for proposals (RFP). The commissioner shall award each of the other proposals a percentage of the price points based on a ratio of the lowest price divided by the responder's price. The commissioner shall add the technical score and price score and award the contract to the responder with the highest total score.\nThe commissioner shall award a stipulated fee not less than two-tenths of one percent of the department's estimated cost of design and construction to each short-listed, responsible proposer who provides a responsive but unsuccessful proposal. When the request for proposals specifies a maximum price, the stipend shall be awarded if the proposal is responsive in all other aspects but comes in above the maximum price. If the commissioner does not award a contract, all short-listed proposers must receive the stipulated fee. If the commissioner cancels the contract before reviewing the technical proposals, the commissioner shall award each design-builder on the short list a stipulated fee of not less than two-tenths of one percent of the commissioner's estimated cost of design and construction. The commissioner shall pay the stipulated fee to each proposer within 90 days after the award of the contract or the decision not to award a contract. In consideration for paying the stipulated fee, the commissioner may use any ideas or information contained in the proposals in connection with any contract awarded for the project or in connection with a subsequent procurement, without any obligation to pay any additional compensation to the unsuccessful proposers. Notwithstanding the other provisions of this subdivision, an unsuccessful short-list proposer may elect to waive the stipulated fee. If an unsuccessful short-list proposer elects to waive the stipulated fee, the commissioner may not use ideas and information contained in that proposer's proposal. Upon the request of the commissioner, a proposer who waived a stipulated fee may withdraw the waiver, in which case the commissioner shall pay the stipulated fee to the proposer and thereafter may use ideas and information in the proposer's proposal.\n(a) The commissioner may also use low-bid, design-build procedures to award a design-build contract where the scope of the work can be clearly defined.\n(b) Low-bid design-build projects may require a request for qualifications (RFQ) and short-listing, and must require a request for proposals (RFP).\n(c) Submitted proposals under this subdivision must include separately a technical proposal and a price proposal. The low-bid, design-build procedures must follow a two-step process for review of the responses to the RFP as follows:\n(1) The first step is the review of the technical proposal by the Technical Review Committee as provided in section 161.3420, subdivision 2. The Technical Review Committee must open the technical proposal first and must determine if it complies with the requirements of the RFP and is responsive. The Technical Review Committee may not perform any ranking or scoring of the technical proposals.\n(2) The second step is the determination of the low bidder based on the price proposal. The commissioner may not open the price proposal until the review of the technical proposal is complete.\n(d) The contract award under low-bid, design-build procedures must be made to the proposer whose sealed bid is responsive to the technical requirements as determined by the Technical Review Committee and that is also the lowest bid.\n(e) A stipulated fee may be paid for unsuccessful bids on low-bid, design-build projects only when the commissioner has required an RFQ and short-listed the most highly qualified responsive bidders.\nThe commissioner may reject all bids under this section.\nIf the commissioner rejects all bids or does not execute the contract, the commissioner may reissue the request for proposals and allow only short-listed teams to resubmit proposals. The commissioner shall then pay a reasonable stipulated fee to each short-listed, responsible proposer who provides a responsive but unsuccessful proposal in response to the reissued request for proposals. When the reissued request for proposals specifies a maximum price, the stipend shall be awarded if the proposal is responsive in all other aspects but comes in above the maximum price.",
	"repealed": false
}