{
	"id": "221.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.221",
	"title": "221.221 ENFORCEMENT POWERS.",
	"text": "The commissioner shall enforce the provisions of this chapter and rules, orders, and directives issued or adopted by the commissioner under this chapter.\n(a) Transportation program specialists and hazardous material program specialists of the department are authorized to enforce (1) this chapter, sections 169.781 to 169.783 relating to commercial vehicle inspections, and sections 168D.05 and 168D.12 relating to motor carrier licenses and trip permits, (2) Code of Federal Regulations, title 49, parts 40 and 382, (3) the applicable rules, orders, or directives of the commissioner of transportation and the commissioner of revenue, issued under this chapter and chapter 168D or 296A, and (4) the North American Standard Out-Of-Service Criteria, including issuing out-of-service orders, as defined in Code of Federal Regulations, title 49, section 383.5, and they may conduct inspections at designated highway weigh stations or under other appropriate circumstances.\n(b) Transportation program specialists and hazardous material program specialists of the department must not be armed and, except as provided in this section, have none of the other powers and privileges reserved to peace officers, including the power to enforce traffic laws and regulations.\nRepresentatives of the department to whom authority has been delegated by the commissioner for the purpose of enforcing sections 169.781 to 169.783 and 221.171 and the rules, orders, or directives of the commissioner adopted or issued under those sections, and for no other purpose, shall have the powers conferred by law upon police officers. The representatives of the department have the power to inspect records, logs, freight bills, bills of lading, or other documents which may provide evidence to determine compliance with sections 169.781 to 169.783 and 221.171.\nRecords, log books, certificates, licenses, shipping documents, or other papers or documents required to determine compliance with this chapter, rules adopted under this chapter, and Code of Federal Regulations, title 49, parts 40 and 382, must be presented for inspection, upon request, to a peace officer or police officer or other person empowered to enforce this chapter.",
	"repealed": false
}