{
	"id": "115A.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.551",
	"title": "115A.551 RECYCLING.",
	"text": "(a) For the purposes of this section, \"recycling\" means, in addition to the meaning given in section 115A.03, subdivision 25b, yard waste and source-separated compostable materials composting and recycling that occurs through mechanical or hand separation of materials that are then delivered for use in manufacturing processes that do not cause the destruction of recyclable materials in a manner that precludes further use.\n(b) For the purposes of this section, \"total solid waste generation\" means the total by weight of:\n(1) materials separated for recycling;\n(2) materials separated for yard waste and source-separated compostable materials composting;\n(3) mixed municipal solid waste plus motor and vehicle fluids and filters, tires, lead acid batteries, and major appliances; and\n(4) residential waste materials that would be mixed municipal solid waste but for the fact that they are not collected as such.\n[Repealed, 2014 c 312 art 13 s 48]\n(a) By December 31, 2030, each county will have as a goal to recycle the following amounts:\n(1) for a county outside of the metropolitan area, 35 percent by weight of total solid waste generation; and\n(2) for a metropolitan county, 75 percent by weight of total solid waste generation.\n(b) Each county will develop and implement or require political subdivisions within the county to develop and implement programs, practices, or methods designed to meet its recycling goal. Nothing in this section or in any other law may be construed to prohibit a county from establishing a higher recycling goal.\n(c) Any quantified recyclable materials that meet the definition in subdivision 1, paragraph (a), or section 115A.03, subdivision 25a, are eligible to be counted toward a county's recycling goal under this subdivision.\nThe commissioner shall establish interim recycling goals for the nonmetropolitan counties to assist them in meeting the goals established in subdivision 2a.\nThe commissioner shall monitor the progress of each county toward meeting the recycling goals in subdivision 2a. The commissioner shall report to the senate and house of representatives committees having jurisdiction over environment and natural resources as part of the report required under section 115A.411. If the commissioner finds that a county is not progressing toward the goals in subdivision 2a, the commissioner shall negotiate with the county to develop and implement solid waste management techniques designed to assist the county in meeting the goals, such as organized collection, curbside collection of source-separated materials, and volume-based pricing.\n(a) A county failing to meet the interim goals in subdivision 3 shall, as a minimum:\n(1) notify county residents of the failure to achieve the goal and why the goal was not achieved; and\n(2) provide county residents with information on recycling programs offered by the county.\n(b) If, based on the recycling monitoring described in subdivision 4, the commissioner finds that a county will be unable to meet the recycling goals established in subdivision 2a, the commissioner shall, after consideration of the reasons for the county's inability to meet the goals, recommend legislation for consideration by the senate and house of representatives committees having jurisdiction over environment and natural resources and environment and natural resources finance to establish mandatory recycling standards and to authorize the commissioner to mandate appropriate solid waste management techniques designed to meet the standards in those counties that are unable to meet the goals.\nEach county shall include in its solid waste management plan described in section 115A.46, or its solid waste master plan described in section 473.803, a recycling implementation strategy for meeting the recycling goal established in subdivision 2a along with mechanisms for providing financial incentives to solid waste generators to reduce the amount of waste generated and to separate recyclable materials from the waste stream.\nEach county shall submit to the commissioner for approval the recycling implementation strategy required in subdivision 6. The recycling implementation strategy must be submitted by October 31, 1995, and must:\n(1) be consistent with the approved county solid waste management plan;\n(2) identify the materials that are being and will be recycled in the county to meet the goals under this section and the parties responsible and methods for recycling the material;\n(3) provide a budget to ensure adequate funding for needed county and local programs and demonstrate an ongoing commitment to spending the money on recycling programs; and\n(4) include a schedule for implementing recycling activities needed to meet the goals in subdivision 2a.",
	"repealed": false
}