{
	"id": "144.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.215",
	"title": "144.215 BIRTH REGISTRATION.",
	"text": "A record of birth for each live birth which occurs in this state shall be filed with the state registrar within five days after the birth.\nThe commissioner shall establish by rule an orderly mechanism for the registration of births including at least a designation for who must file the birth record, a procedure for registering births which occur in moving conveyances, and a provision governing the names of the parent or parents to be entered on the birth record.\nIn any case in which paternity of a child is determined by a court of competent jurisdiction, or a recognition of parentage is executed under section 257.75, the name of the father shall be entered on the birth record. If the order of the court declares the name of the child, it shall also be entered on the birth record. If the order of the court does not declare the name of the child, or there is no court order, then upon the request of both parents in writing, the surname of the child shall be defined by both parents.\n(a) Parents of a child born within this state shall give the parents' Social Security numbers to the Office of Vital Records at the time of filing the birth record, but the numbers shall not appear on the certified record.\n(b) The Social Security numbers are classified as private data, but the Office of Vital Records shall provide a Social Security number to the public authority responsible for child support services upon request by the public authority for use in the establishment of parentage and the enforcement of child support obligations.\nWhen a birth occurs in an institution or en route to an institution, the person in charge of the institution or that person's authorized designee shall obtain the personal data required under this section and shall prepare the record of birth. For purposes of this section, \"institution\" means a hospital or other facility that provides childbirth services.\nWhen a birth occurs outside of an institution as defined in subdivision 5, the record of birth shall be filed by one of the following persons, in the indicated order of preference:\n(1) the physician present at the time of the birth or immediately thereafter;\n(2) in the absence of a physician, a person, other than the mother, present at the time of the birth or immediately thereafter;\n(3) the father of the child;\n(4) the mother of the child; or\n(5) in the absence of the father and if the mother is unable, the person with primary responsibility for the premises where the child was born.\nWhen a birth occurs in this state outside of an institution, as defined in subdivision 5, and the birth record is filed before the first birthday, evidence in support of the facts of birth shall be required. Evidence shall be presented by the individual responsible for filing the vital record under subdivision 6. Evidence shall consist of proof that the child was born alive, proof of pregnancy, and evidence of the mother's presence in this state on the date of the birth. If the evidence is not acceptable, the state registrar shall advise the applicant of the reason for not filing a birth record and shall further advise the applicant of the right of appeal to a court of competent jurisdiction.",
	"repealed": false
}