{
	"id": "169.965",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.965",
	"title": "169.965 UNIVERSITY REGENTS TO REGULATE TRAFFIC AND PARKING.",
	"text": "The regents of the University of Minnesota may, from time to time, make, adopt, and enforce such rules, regulations, or ordinances as it may find expedient or necessary relating to the regulation of traffic and parking, upon parking facilities, highways, streets, private roads, and roadways situated on property owned, leased, or occupied by the regents of the University of Minnesota or the University of Minnesota.\nAny person who violates such rule, regulation, or ordinance shall be guilty of a petty misdemeanor and subject to the provisions of sections 169.891 and 169.90, subdivision 1.\nThe prosecution may be before a district court having jurisdiction over the place where the violation occurs.\nEvery sheriff, police officer, or other peace officer shall see that all rules, regulations, and ordinances are obeyed, and shall arrest and prosecute offenders.\nThe regents of the University of Minnesota are hereby authorized to appoint and employ, and fix the compensation to be paid out of funds of the regents of the University of Minnesota, persons who shall have and may exercise on property owned, leased, or occupied by the regents of the University of Minnesota or the University of Minnesota the same powers of arrest for violation of rules, regulations, or ordinances adopted by the regents of the University of Minnesota pursuant to the Highway Traffic Regulation Act, chapters 169 and 169A, as amended, as possessed by a sheriff, police officer, or peace officer.\nAll persons shall take notice of such rules, regulations, and ordinances without pleading and proof of the same.\n(a) The regents of the University of Minnesota shall fix a date for a public hearing on the adoption of any such proposed rule, regulation, or ordinance. Notice of such hearing shall be published in a legal newspaper in the county in which the property affected by the rule, regulation, or ordinance is located. The publication shall be at least 15 days and not more than 45 days before the date of the hearing.\n(b) If, after the public hearing, the proposed rule, regulation, or ordinance shall be adopted by a majority of the members of the Board of Regents of the University of Minnesota, the same shall be considered to have been enacted by the regents of the University of Minnesota. A copy of the same shall be signed by the president, attested by the secretary, and filed with the secretary of state of the state of Minnesota, together with proof of publication. Upon such filing, the rule, regulation, or ordinance, as the case may be, shall thenceforth be in full force and effect.\nThe fines collected in Hennepin, St. Louis, and Stevens Counties shall be paid into the treasury of the University of Minnesota, except that the portion of the fines necessary to cover all costs and disbursements incurred in processing and prosecuting the violations in the court shall be retained by the court administrator in Hennepin and St. Louis Counties and by the city of Morris in Stevens County.",
	"repealed": false
}