{
	"id": "136A.861",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.861",
	"title": "136A.861 INTERVENTION FOR COLLEGE ATTENDANCE PROGRAM GRANTS.",
	"text": "(a) The commissioner shall award grants to foster postsecondary attendance and retention by providing outreach services to historically underserved students in grades six through 12 and historically underrepresented college students. Grants must be awarded to programs that provide precollege services, including, but not limited to:\n(1) academic counseling;\n(2) mentoring;\n(3) fostering and improving parental involvement in planning for and facilitating a college education;\n(4) services for students with English as a second language;\n(5) academic enrichment activities;\n(6) tutoring;\n(7) career awareness and exploration;\n(8) orientation to college life;\n(9) assistance with high school course selection and information about college admission requirements; and\n(10) financial aid counseling.\n(b) To the extent there are sufficient applications, the commissioner shall award an approximate equal amount of grants for program-eligible students who are from communities located outside the metropolitan area, as defined in section 473.121, subdivision 2, as for students from communities within the metropolitan area. If necessary to achieve the approximately equal metropolitan area and nonmetropolitan area allocation, the commissioner may award a preference to a nonmetropolitan area application in the form of five points on a one hundred point application review scale.\n(c) Grants shall be awarded to postsecondary institutions, professional organizations, community-based organizations, or others deemed appropriate by the commissioner.\n(d) Grants shall be awarded for one year and may be renewed for a second year with documentation to the office of successful program outcomes.\n(a) Eligible students include students in grades six through 12 who meet one or more of the following criteria:\n(1) are counted under section 1124(c) of the Elementary and Secondary Education Act of 1965 (Title I);\n(2) are eligible for free or reduced-price meals under the National School Lunch Act;\n(3) receive assistance under the Temporary Assistance for Needy Families Law (Title I of the Personal Responsibility and Work Opportunity Reconciliation Act of 1996); or\n(4) are a member of a group traditionally underrepresented in higher education.\n(b) Eligible undergraduate students include those who met the student eligibility criteria as 6th through 12th graders.\n(a) The commissioner shall develop a grant application process. The commissioner shall attempt to support projects in a manner that ensures that eligible students throughout the state have access to program services.\n(b) The grant application must include, at a minimum, the following information:\n(1) a description of the characteristics of the students to be served reflective of the need for services listed in subdivision 1;\n(2) a description of the services to be provided and a timeline for implementation of the activities;\n(3) a description of how the services provided will foster postsecondary attendance and support postsecondary retention;\n(4) a description of how the services will be evaluated to determine whether the program goals were met; and\n(5) other information as identified by the commissioner.\nGrant recipients must specify both program and student outcome goals, and performance measures for each goal.\nApplicants are required to match the grant amount dollar-for-dollar. The match may be in cash or an in-kind contribution.\nThe commissioner must establish and convene a grant selection committee to review applications and award grants. The members of the committee may include representatives of postsecondary institutions, school districts, organizations providing precollege outreach services, and others deemed appropriate by the commissioner.\nEach grant recipient must annually submit a report to the office delineating its program and student outcome goals, and activities implemented to achieve the stated outcomes. The goals must be clearly stated and measurable. Grant recipients are required to collect, analyze, and report on participation and outcome data that enable the office to verify that the program goals were met. The office shall maintain:\n(1) information about successful precollege program and undergraduate student retention program activities for dissemination to individuals throughout the state interested in adopting or replicating successful program practices; and\n(2) data on the success of the funded projects in increasing the high school graduation, college participation, and college graduation rates of students served by the grant recipients. The office may convene meetings of the grant recipients, as needed, to discuss issues pertaining to the implementation of precollege services and undergraduate retention programs.\nBy January 15 of each odd-numbered year, the office shall submit a report to the committees in the legislature with jurisdiction over higher education finance regarding the grant recipients and their activities. The report shall include information about the students served, the organizations providing services, program activities, program goals and outcomes, and program revenue sources and funding levels.",
	"repealed": false
}