{
	"id": "46.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.07",
	"title": "46.07 RECORDS.",
	"text": "The commissioner of commerce shall keep all proper records and files pertaining to the duties and work of that office.\nThe commissioner shall divulge facts and information obtained in the course of examining financial institutions under the commissioner's supervision only when and to the extent required or permitted by law to report upon or take special action regarding the affairs of an institution, or ordered by a court of law to testify or produce evidence in a civil or criminal proceeding, except that the commissioner may furnish information as to matters of mutual interest to an official or examiner of the Federal Reserve System, the Federal Deposit Insurance Corporation, the Federal Office of Thrift Supervision, the Federal Home Loan Bank System, the National Credit Union Administration, comptroller of the currency, other state bank supervisory agencies subject to cooperative agreements authorized by section 49.411, subdivision 7, the United States Small Business Administration, for purposes of sections 53.09, subdivision 2a, and 56.10, subdivision 1, or state and federal law enforcement agencies. The commissioner shall not be required to disclose the name of a debtor of a financial institution under the commissioner's supervision, or anything relative to the private accounts, ownership, or transactions of an institution, or any fact obtained in the course of an examination thereof, except as herein provided. For purposes of this subdivision, a subpoena is not an order of a court of law. These records are classified confidential or protected nonpublic for purposes of the Minnesota Government Data Practices Act and their destruction, as prescribed in section 46.21, is exempt from the provisions of chapter 138 and Laws 1971, chapter 529, so far as their deposit with the state archives.\nNotwithstanding the provisions of subdivision 2 to the contrary, data gathered and maintained in relation to a complaint filed with the commissioner is private or nonpublic pursuant to the Minnesota Government Data Practices Act.",
	"repealed": false
}