{
	"id": "97A.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.425",
	"title": "97A.425 RECORD AND REPORTING REQUIREMENTS FOR DEALERS, TANNERS, AND TAXIDERMISTS.",
	"text": "(a) A person must have the required license under the game and fish laws to buy or sell wild animals, to tan animal hides or dress raw furs, or to mount specimens of wild animals and must keep complete records of all transactions and activities covered by the license and submit reports to the commissioner.\n(b) A person is not required to be licensed to tan animal hides or dress raw furs or to mount specimens of wild animals if the person is not compensated for the service.\n(a) The records must show:\n(1) the names and addresses of persons from whom wild animals were obtained and to whom they were transferred;\n(2) the dates of receipt, shipment, and sale of wild animals;\n(3) detailed descriptions of the number and type of wild animals purchased, sold, and shipped;\n(4) serial numbers of seals, tags, or permits required to be attached to the wild animals; and\n(5) trapping license numbers for protected fur-bearing animals, unless the trapper is exempt from the license requirement, which must be noted.\n(b) A licensed fur dealer, buying for one employer at the employer's place of business, is not required to keep separate records if the employer notifies the commissioner in writing that the employer will account for the fur dealer.\n(c) The records required under this section must be available for inspection by the commissioner, the director, or their agents at all reasonable times. The records must be preserved and available for two years after the expiration of a license that required them.\n(d) Records required of persons licensed to buy or sell wild animals, or to tan or dress raw furs, must be kept in a book supplied by the commissioner.\nExcept for persons licensed to mount specimens of wild animals, an annual report covering the preceding license year must be submitted to the commissioner by March 15. The commissioner may require other reports for statistical purposes. The reports must be on forms supplied or approved by the commissioner.\n(a) Licensed taxidermists must dispose of all cervid carcasses or cervid parts not returned to the patron, all biosolids resulting from cleaning cervid skulls, and all carrion beetles and beetle waste used to clean cervid skulls. All disposals must be to a disposal facility or transfer station that is permitted to accept it, and proof of the disposal must be retained for inspection.\n(b) The following cervid parts are exempt from the disposal requirement:\n(1) cervid hides from which all excess tissue has been removed;\n(2) if free of brain and muscle tissues, whole or portions of skulls, antlers, or teeth; and\n(3) finished taxidermy mounts.\nThe commissioner may adopt rules, not inconsistent with subdivisions 1 to 3a, governing record keeping, reporting, and marking of specimens by taxidermists.",
	"repealed": false
}