{
	"id": "414.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.12",
	"title": "414.12 CHIEF ADMINISTRATIVE LAW JUDGE'S POWERS.",
	"text": "(a) Notwithstanding anything to the contrary in sections 414.01 to 414.09, before assigning a matter to an administrative law judge for hearing, the chief administrative law judge, upon consultation with affected parties and considering the procedures and principles established in sections 414.01 to 414.09, may require that disputes over proposed boundary adjustments be addressed in whole or in part by means of alternative dispute resolution processes in place of, or in connection with, hearings that would otherwise be required pursuant to sections 414.01 to 414.09, including those provided in chapter 14.\n(b) In all proceedings, the chief administrative law judge has the authority and responsibility to conduct hearings and issue final orders related to the hearings under sections 414.01 to 414.09.\nMS 2006 [Repealed, 2008 c 196 art 1 s 22]\n(a) The parties to any matter directed to alternative dispute resolution under subdivision 1 must pay the costs of the alternative dispute resolution process or hearing in the proportions that they agree to.\n(b) Notwithstanding section 14.53 or other law, the Office of Administrative Hearings is not liable for the costs.\n(c) If the parties do not agree to a division of the costs before the commencement of mediation, arbitration, or hearing, the costs must be allocated on an equitable basis by the mediator, arbitrator, or chief administrative law judge.\n(d) The chief administrative law judge may contract with the parties to a matter for the purpose of providing administrative law judges and reporters for an administrative proceeding or alternative dispute resolution.\n(e) The chief administrative law judge shall assess the cost of services rendered by the Office of Administrative Hearings as provided by section 14.53.\nIn this section, \"party\" means:\n(1) a property owner, group of property owners, municipality, or township that files an initiating document or timely objection under this chapter;\n(2) the municipality or township within which the subject area is located;\n(3) a municipality abutting the subject area; and\n(4) any other person, group of persons, or governmental agency residing in, owning property in, or exercising jurisdiction over the subject area that submits a timely request, and is determined by the presiding administrative law judge to have a direct legal interest that will be affected by the outcome of the proceeding.\nMatters resolved or agreed to by the parties as a result of an alternative dispute resolution process, or otherwise, may be incorporated into a joint resolution adopted pursuant to section 414.0325, subdivision 1, or into one or more stipulations for purposes of further proceedings in accordance with the applicable procedures and statutory criteria of this chapter.\nNothing in this section shall be construed to permit any municipality, town, or other political subdivision to take, or agree to take, any action that is not otherwise authorized by this chapter.",
	"repealed": false
}