{
	"id": "178.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.091",
	"title": "178.091 INVESTIGATIONS AND ENFORCEMENT; APPRENTICESHIP PROGRAMS AND STANDARDS.",
	"text": "In order to carry out the purposes of this chapter, the commissioner may investigate registered apprenticeship programs and applicants for program registration to determine whether there are any grounds for deregistration of a registered program or for the denial of an application. Persons requested by the commissioner to provide information or produce documents shall respond within 30 days of the commissioner's service of the request.\n(a) The commissioner may deregister a registered apprenticeship program or deny an application for registration if:\n(1) the program does not comply with any requirement of Code of Federal Regulations, title 29, part 29 or 30, this chapter, or any rule adopted pursuant to section 178.041;\n(2) the program does not have at least one registered apprentice in each trade or occupation, except for the following specified periods of time:\n(i) within the first 45 days after the date a program is registered; or\n(ii) within one year of the date that a program graduates an apprentice in a trade or occupation and the date of registration for the next apprentice in that trade or occupation; or\n(3) the program is not conducted, operated, or administered in accordance with the program's registered standards or with the requirements of this chapter, including but not limited to:\n(i) failure to provide on-the-job learning;\n(ii) failure to provide related instruction;\n(iii) failure of an employer to pay the apprentice a progressively increasing schedule of wages consistent with the apprentice's skills acquired; or\n(iv) persistent and significant failure to perform successfully.\n(b) The commissioner may deregister an apprenticeship program at the written request of the sponsor in a manner consistent with the provisions of Code of Federal Regulations, title 29, part 29, section 29.8(a).\nIf the commissioner deregisters a registered apprenticeship program, the sponsor may request reinstatement not before one year after the effective date of the deregistration. The commissioner may, as a condition of reinstatement, require the sponsor to comply with reasonable conditions the commissioner considers necessary to effectuate the purposes of this chapter.\nIf the commissioner determines that a registered apprenticeship program should be deregistered or that an application for registration should be denied, the commissioner shall issue to and serve on the sponsor a notice to correct containing the following:\n(1) the deficiency and the required remedy or corrective action;\n(2) the time period to effectuate the required remedy or corrective action, which shall be no less than 30 days and no more than 60 days; and\n(3) any other requirement consistent with Code of Federal Regulations, title 29, part 29, section 29.8(b).\nIf an applicant for registration does not take the required corrective action within the allotted time, the commissioner may deny the application for registration.\nIf the registered apprenticeship program does not take the required corrective action within the allotted time, the commissioner may issue an order of deregistration containing the following:\n(1) that certain deficiencies were identified in the notice to correct and the registered apprenticeship program did not take the required corrective action;\n(2) based on the deficiencies stated in the notice to correct and the failure of the registered apprentice program to remedy those deficiencies, a determination has been made that there is reasonable cause to deregister the program;\n(3) that the registered apprenticeship program may appeal this determination within 15 days to the commissioner consistent with subdivision 7; and\n(4) that, if the registered apprenticeship program does not appeal the determination, the order becomes final.\nAny person aggrieved by an order of deregistration may appeal to the commissioner. If no appeal is filed with the commissioner within 15 days of the date of service, the order of deregistration shall become the final order of the commissioner. If an appeal is filed, the commissioner shall appoint and convene a hearing board to be composed of three members of the Apprenticeship Advisory Board appointed under section 178.02, one member being a representative of an employer organization, one representative being a member of an employee organization, and one member representing the general public. The board shall hold a hearing on the appeal after due notice to the interested parties and shall submit to the commissioner findings of fact and a recommended decision accompanied by a memorandum of the reasons for the recommended decision. Within 30 days after submission, the commissioner may adopt the recommended decision of the board or disregard the recommended decision of the board and prepare a decision based on the findings of fact and accompanied by a memorandum of reasons for that decision. Written notice of the commissioner's determination and order shall be served on all parties affected by the commissioner's determination. Any person aggrieved by the commissioner's determination and order under this section is entitled to judicial review under sections 14.63 to 14.68 in the same manner that a person aggrieved by a final decision in a contested case is entitled to judicial review. The commissioner's determination and order under this section shall be a final decision and order of the department for purposes of sections 14.63 to 14.68.",
	"repealed": false
}