{
	"id": "79.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.361",
	"title": "79.361 POST-1992 DISTRIBUTION OF WORKERS' COMPENSATION REINSURANCE ASSOCIATION SURPLUS.",
	"text": "This section governs the distribution of excess surplus of the Workers' Compensation Reinsurance Association declared after January 1, 1993. A distribution of excess surplus is declared on the date the board votes to make a distribution. No distribution of excess surplus other than that provided by this section may be made.\nA self-insurer shall receive a distribution of excess surplus in an amount equal to the self-insurer's share of the premiums paid to the Workers' Compensation Reinsurance Association for the period and for each retention layer for which the distribution is made.\nA policyholder, other than a policyholder insured by the assigned risk plan or the State Fund Mutual Insurance Company, shall receive a refund of a share of the distribution equal to the policyholder's share of the annual total earned Minnesota workers' compensation insurance premium, as reported to the commissioner of commerce in the most recent annual statements of insurers, including the assigned risk plan and the State Fund Mutual Insurance Company.\nA policyholder of the assigned risk plan shall receive a refund of a share of the distribution equal to the policyholder's share of the annual total earned Minnesota workers' compensation insurance premium, as reported to the commissioner of commerce in the most recent annual statements of insurers, including the assigned risk plan and the State Fund Mutual Insurance Company.\nA policyholder of the State Fund Mutual Insurance Company shall receive a refund of a share of the distribution equal to the policyholder's share of the annual total earned Minnesota workers' compensation insurance premium, as reported to the commissioner of commerce in the most recent annual statements of insurers, including the assigned risk plan and the state fund mutual insurance company.\nFor the purpose of subdivisions 3 to 5, \"distribution\" means a distribution described in subdivision 1 minus a distribution to self-insurers under subdivision 2.\nFor the purpose of this section \"policyholder\" means a workers' compensation insurance policyholder in the calendar year preceding a declaration of excess surplus by the board of the reinsurance association.\nInsurers and the Workers' Compensation Insurers Rating Association of Minnesota must provide the Workers' Compensation Reinsurance Association with information necessary to administer and calculate the refunds to policyholders governed by this section within 60 days of a request by the association. For the purpose of this subdivision, \"insurer\" includes the assigned risk plan.\nPolicyholders must receive the refund within 60 days of the day the reinsurance association receives the information required to be provided by subdivision 8.\nAny part of the refund not distributed within one year after the due date of a refund under this section due to the inability to identify or locate policyholders remains with the Workers' Compensation Reinsurance Association.\nThe reinsurance association may pay the actual and reasonable costs of the refunds made under this section from earnings on a declared excess surplus prior to its distribution.",
	"repealed": false
}