{
	"id": "10A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.17",
	"title": "10A.17 EXPENDITURES.",
	"text": "A political committee, political fund, principal campaign committee, or party unit may not expend money unless the expenditure is authorized by the treasurer or deputy treasurer of that committee, fund, or party unit.\nAn individual or association may not make an approved expenditure of more than $20 without receiving written authorization from the treasurer of the principal campaign committee of the candidate who approved the expenditure stating the amount that may be spent and the purpose of the expenditure.\nThe treasurer or deputy treasurer of a political committee, principal campaign committee, or party unit may sign vouchers for petty cash of up to $100 per week for statewide elections or $20 per week for legislative elections, to be used for miscellaneous expenditures.\nA principal campaign committee, political committee, political fund, or party unit may not lend money it has raised to anyone for purposes not related to the conduct of a campaign.\nAn individual, political committee, political fund, principal campaign committee, or party unit that independently solicits or accepts contributions or makes independent expenditures on behalf of a candidate or local candidate must publicly disclose that the expenditure is an independent expenditure. All written and broadcast communications with those from whom contributions are independently solicited or accepted or to whom independent expenditures are made on behalf of a candidate or local candidate must contain a statement in substantially the form provided in section 211B.04, subdivision 2. The statement must be on the front page of all written communications and at the end of all broadcast communications made by that individual, political committee, political fund, principal campaign committee, or party unit on the candidate's or local candidate's behalf.\nA person who violates subdivision 2 or 6 is subject to a civil penalty imposed by the board of up to $1,000. A person who knowingly violates subdivision 3a or 4 or falsely claims that an expenditure was an independent expenditure is guilty of a gross misdemeanor and subject to a civil penalty imposed by the board of up to $3,000.\nA political committee, political fund, principal campaign committee, or party unit may not expend money unless the expenditure or other disbursement is made using petty cash or a depository of that committee, fund, or party unit.",
	"repealed": false
}