{
	"id": "13.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.55",
	"title": "13.55 CONVENTION CENTER DATA.",
	"text": "The following data received, created, or maintained by or for publicly owned and operated convention facilities, civic center authorities, or the Metropolitan Sports Facilities Commission are classified as nonpublic data pursuant to section 13.02, subdivision 9; or private data on individuals pursuant to section 13.02, subdivision 12:\n(a) a letter or other documentation from any person who makes inquiry to or who is contacted by the facility regarding the availability of the facility for staging events;\n(b) identity of firms and corporations which contact the facility;\n(c) type of event which they wish to stage in the facility;\n(d) suggested terms of rentals; and\n(e) responses of authority staff to these inquiries.\nThe data made not public by the provisions of subdivision 1 shall become public upon the occurrence of any of the following:\n(a) five years elapse from the date on which the lease or contract is entered into between the facility and the inquiring party or parties or the event which was the subject of inquiry occurs at the facility, whichever occurs earlier;\n(b) the event which was the subject of inquiry does not occur; or\n(c) the event which was the subject of inquiry occurs elsewhere.\nThe names, addresses, and contact persons for individual exhibitors at an exhibition may be withheld at the discretion of the facility to protect the competitive position of the facility or its customers.\n(a) For purposes of this subdivision, \"nonprofit organization\" means the nonprofit organization with which the city of St. Paul contracts to market and promote the city as a tourist or convention center.\n(b) Data collected, received, created, or maintained by the nonprofit organization in the course of preparing or submitting any responses to requests for proposals or requests for bids relating to events hosted, conducted, or sponsored by the nonprofit organization is classified as nonpublic data under section 13.02, subdivision 9; or private data under section 13.02, subdivision 12, until the time provided in subdivision 2, paragraph (a) or (b). The nonprofit organization is a \"civic center authority\" for purposes of this section.",
	"repealed": false
}