{
	"id": "403.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.40",
	"title": "403.40 ADVISORY COMMITTEES.",
	"text": "The Statewide Radio Board shall facilitate the formation of a regional advisory committee in each region of development. A regional advisory committee may create a regional radio board under section 403.39 and conduct its affairs in accordance with the joint powers agreement. During the initial phase of development within a region, the Statewide Radio Board shall act cooperatively with the regional advisory committee or the regional radio board to complete development of the basic communication infrastructure and interoperability infrastructure. Upon the completion of the initial phase of development within a region, the Statewide Radio Board shall cooperate with and assist the regional advisory committee or the regional radio board in implementing its regional plan and with subsequent development within the region.\nThe Statewide Radio Board may establish one or more advisory groups for the purpose of advising on the plan, design, implementation, and administration of statewide interoperable public safety communications with representatives from each region of implementation to advise on, at least, the following topical areas specified for each committee:\n(1) a committee of users representing all regions where the system backbone has been implemented to make recommendations on how capital and operating costs of the system should be apportioned among users, including the cost of additional participants;\n(2) a committee to make recommendations on performance and operational standards for the system to the extent that performance and operational standards impact the operation of the system backbone and interoperability infrastructure;\n(3) an operations and technical committee to make recommendations on the plan and operational issues related to the technical aspects of the system backbone and interoperability infrastructure; and\n(4) in cases where the board has made an election under section 403.382, a 911 operations and technical committee to make recommendations on the 911 service plan and operational issues related to the technical aspects of the implementation of Next Generation 911 service throughout the state.",
	"repealed": false
}