{
	"id": "41A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.15",
	"title": "41A.15 DEFINITIONS.",
	"text": "For the purposes of sections 41A.15 to 41A.18, the terms defined in this section have the meanings given them.\n\"Advanced biofuel\" means a renewable fuel, other than ethanol derived from corn starch, that has lifecycle greenhouse gas emissions that are at least 50 percent less than baseline lifecycle greenhouse gas emissions.\nMS 2018 [Repealed, 1Sp2019 c 1 art 3 s 13]\nMS 2018 [Repealed, 1Sp2019 c 1 art 3 s 13]\n\"Biobutanol\" means fermentation isobutyl alcohol that is derived from agricultural products, including potatoes, cereal grains, cheese whey, and sugar beets; forest products; or other renewable resources, including residue and waste generated from the production, processing, and marketing of agricultural products, forest products, and other renewable resources.\n\"Biobutanol facility\" means a facility at which biobutanol is produced.\n\"Biomass\" means any organic matter that is available on a renewable or recurring basis, including agricultural crops and trees, wood and wood waste and residues, plants including aquatic plants, grasses, residues, fibers, animal waste, and the organic portion of solid wastes.\n\"Biomass thermal production\" means the generation of energy for commercial heat or industrial process heat from a cellulosic material or other material composed of forestry or agricultural feedstocks for a new or expanding capacity facility or a facility that is displacing existing use of fossil fuel after July 1, 2015.\n\"Cellulosic biomass\" means material primarily made up of cellulose, hemicellulose, or lignin, or a combination of those ingredients.\n\"Cellulosic sugar\" means sugar derived from cellulosic biomass from agricultural or forestry resources.\n\"Commissioner\" means the commissioner of agriculture.\n\"Cover crops\" means grasses, legumes, forbs, or other herbaceous plants that are known to be noninvasive and not listed as a noxious weed in Minnesota and that are either interseeded into living cash crops or planted on agricultural fields during fallow periods for seasonal cover and conservation purposes.\n\"MMbtu\" means 1,000,000 British thermal units.\n\"Perennial crops\" means agriculturally produced plants that are known to be noninvasive and not listed as a noxious weed in Minnesota and that have a life cycle of at least three years at the location where the plants are being cultivated. Biomass from alfalfa produced in a two-year rotation shall be considered a perennial crop.\n\"Quarterly\" means any of the following three-month intervals in a calendar year: January through March, April through June, July through September, or October through December.\n\"Renewable chemical\" means a chemical, polymer, monomer, plastic, or composite material that is entirely produced from biomass.",
	"repealed": false
}