{
	"id": "507.0945",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.0945",
	"title": "507.0945 ADMINISTRATION.",
	"text": "(a) An Electronic Real Estate Recording Commission is created to evaluate and then may adopt standards to implement sections 507.0941 to 507.0948.\n(b) The Electronic Real Estate Recording Commission shall consist of the following:\n(1) three members appointed by the Minnesota Association of County Officials who are county employees, including one from within the seven-county metropolitan area, one from outside the seven-county metropolitan area, and at least one of whom is a county recorder and at least one of whom is a registrar of titles;\n(2) one member appointed by the Minnesota Land Title Association;\n(3) one member who represents the Minnesota Bankers Association;\n(4) one member who represents the Section of Real Property Law of the Minnesota State Bar Association;\n(5) one nonvoting member who is appointed by the other members of the commission and an expert in the technological aspects of electronic real estate recording; and\n(6) one member who is the state archivist appointed pursuant to section 138.17.\n(c) Members of the Electronic Real Estate Recording Commission shall serve four-year terms, except that (1) the initial appointments of county employees shall be for two years and (2) the expert in the technological aspects of electronic real estate recording shall serve at the pleasure of a majority of the other members of the commission. All initial terms shall commence on July 1, 2008. Members shall serve until their successors are appointed. Any member may be reappointed for successive terms.\n(d) The state archivist shall call the first meeting of the Electronic Real Estate Recording Commission. At the first meeting and biennially thereafter, the commission shall elect from its membership a chair and vice-chair to serve two-year terms. Meetings may be called by the chair or the vice-chair. Meetings shall be held as often as necessary, but at least once a year.\n(e) A majority of the voting members of the Electronic Real Estate Recording Commission constitutes a quorum to do business, and a majority of a quorum may act in any matter within the jurisdiction of the commission.\n(f) As soon as practicable and as needed thereafter, the Electronic Real Estate Recording Commission shall identify the information technology and any other expertise it requires and report its needs to the committees of the house of representatives and the senate that have jurisdiction.",
	"repealed": false
}