{
	"id": "524.2-1107",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-1107",
	"title": "524.2-1107 POWER TO DISCLAIM; GENERAL REQUIREMENTS; WHEN IRREVOCABLE.",
	"text": "(a) A person may disclaim, in whole or in part, any interest in or power over property, including a power of appointment. A person may disclaim the interest or power even if its creator imposed a spendthrift provision or similar restriction on transfer or a restriction or limitation on the right to disclaim.\n(b) With court approval, a fiduciary may disclaim, in whole or in part, any interest in or power over property, including a power of appointment when acting in a representative capacity. Without court approval, a fiduciary may disclaim, in whole or in part, any interest in or power over property, including a power of appointment, if and to the extent that the instrument creating the fiduciary relationship explicitly grants the fiduciary the right to disclaim. With court approval, a custodial parent may disclaim on behalf of a minor child for whom no conservator has been appointed, in whole or in part, any interest in or power over property, including a power of appointment, which the minor child is to receive.\n(c) To be effective, a disclaimer must be in writing, declare the writing as a disclaimer, describe the interest or power disclaimed, and be signed by the person or fiduciary making the disclaimer and acknowledged in the manner provided for deeds of real estate to be recorded in this state. In addition, for a disclaimer to be effective, an original of the disclaimer must be delivered or filed in the manner provided in section 524.2-1114.\n(d) A partial disclaimer may be expressed as a fraction, percentage, monetary amount, specific property, term of years, portion of a beneficial interest in or right to distributions from a trust, limitation of a power, or any other interest or estate in the property.\n(e) A disclaimer becomes irrevocable when the disclaimer is delivered or filed pursuant to section 524.2-1114 or it becomes effective as provided in sections 524.2-1108 to 524.2-1113, whichever occurs later.\n(f) A disclaimer made under sections 524.2-1101 to 524.2-1116 is not a transfer, assignment, or release.",
	"repealed": false
}