{
	"id": "204B.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.27",
	"title": "204B.27 DUTIES OF SECRETARY OF STATE.",
	"text": "At least 14 days before every state election the secretary of state shall transmit to each county auditor examples of any blank forms to be used as the secretary of state deems necessary for the conduct of the election. County abstract forms may be provided to auditors electronically via the Minnesota State Election Reporting System maintained by the secretary of state, and must be available at least one week prior to the election.\nThe secretary of state shall prepare and publish a volume containing all state general laws relating to elections. The attorney general shall provide annotations to the secretary of state for this volume. On or before August 1 of every odd-numbered year the secretary of state shall furnish to the county auditors and municipal clerks enough copies of this volume so that each county auditor and municipal clerk will have at least one copy. On or before July 1 of every even-numbered year, the secretary of state shall prepare and make an electronic copy available on the office's website. The secretary of state may prepare and transmit to the county auditors and municipal clerks detailed written instructions for complying with election laws relating to the conduct of elections, conduct of voter registration and voting procedures.\nAt least 25 days before every state primary election, the secretary of state shall prepare and furnish to the county auditor of each county voter instruction posters printed in large type upon cards or heavy paper. The instruction posters must contain the information needed to enable the voters to cast their paper ballots quickly and correctly and indicate the types of assistance available for elderly and disabled voters. Two instruction posters shall be furnished for each precinct. Upon mutual agreement, the secretary of state may provide the posters in an electronic format.\nThe secretary of state shall prepare and distribute to election officials pamphlets for voters containing impartial instructions relating to voter registration and election procedures. The pamphlets must indicate the types of registration and voting assistance available for elderly and disabled individuals and residents of health care facilities and hospitals.\nBefore each state primary the secretary of state shall conduct conferences with county auditors to instruct them on the administration of election laws and the training of local election officials and election judges.\nThe secretary of state may sponsor or participate in nonpartisan activities to promote voter participation in Minnesota elections and in efforts to increase voter registration and voter turnout.\nThe secretary of state may authorize educational activities related to voting and elections for elementary or secondary school students in the polling place on the day of a state, county, municipal, or school district election. Ballots used for educational activities must be a different color than any ballot used at the election. Activities authorized under this subdivision must be administered in a manner that does not interfere with the conduct of the election.\nThe secretary of state shall provide a voter information telephone line. A toll-free number must be provided for use by persons residing outside the metropolitan calling area. The secretary of state shall make available information concerning voter registration, absentee voting, election results, and other election-related information considered by the secretary of state to be useful to the public.\nThe secretary of state may enter into a statewide contract from which any county auditor may purchase ballots, forms, or other election supplies.\nThe secretary of state shall develop a training program in election administration for county auditors and shall certify each county auditor who successfully completes the training program. The secretary of state shall provide each county auditor with materials for use in training local election officials and election judges.\nThe secretary of state may develop voting instructions in languages other than English, to be posted and made available in polling places during elections. The state demographer shall determine and report to the secretary of state the languages that are so common in this state that there is a need for translated voting instructions.",
	"repealed": false
}