{
	"id": "51A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.51",
	"title": "51A.51 FEES.",
	"text": "An association shall pay fees by delivering to the commissioner a check payable to the commissioner of management and budget.\nAt the time of filing the application for a certificate of incorporation, the incorporators shall pay a $1,000 filing fee which shall be paid into the state treasury and credited to the general fund, and shall pay to the banking department a $500 investigation fee. If an application is contested, 50 percent of an additional fee equal to the actual costs incurred by the Department of Commerce in approving or disapproving the application, payable to the commissioner of management and budget and credited by the commissioner of management and budget to the general fund, shall be paid by the applicant and 50 percent equally by the intervening parties.\nThere shall accompany each application to the commissioner for leave to change the location of an established office, a fee of $50 payable to the banking department. In the event of a hearing on the application to change the location of an established office, an additional fee of $1,000 payable to the state treasury and $450 payable to the banking department shall be delivered to the office of the commissioner of commerce prior to the publication of the notice of hearing.\nThere shall accompany each application to the commissioner for establishment of other than the principal office a $1,000 filing fee payable to the state treasury and $500 payable to the banking department. If an application is contested, 50 percent of an additional fee equal to the actual costs incurred by the Department of Commerce in approving or disapproving the application, payable to the commissioner of management and budget and credited by the commissioner of management and budget to the general fund, shall be paid by the applicant and 50 percent equally by the intervening parties.\nAt the time of filing its annual report each association shall pay to the commissioner as a fee for supervision and examination an annual assessment as determined by the commissioner pursuant to the provisions of section 46.131. Such assessment shall be in lieu of all other license fees and charges of any kind whatsoever to any other state department or office, municipality, county, or other political subdivision; provided that the commissioner may assess against any such association the actual and necessary per diem expenses of and incidental to any additional examinations, or to supervision, or to any appraisal or special audit made pursuant to an order of the commissioner acting under authority of sections 51A.01 to 51A.58.\nAt the time of filing with the commissioner of any proposed merger or consolidation plan, the associations proposing so to merge or consolidate shall submit therewith a fee of $250 payable to the banking department, which fee shall be paid in equal parts by the associations parties to the proposal.",
	"repealed": false
}