{
	"id": "260E.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.22",
	"title": "260E.22 INTERVIEWS.",
	"text": "(a) The agency responsible for assessing or investigating reports of maltreatment has the authority to interview the child, the person or persons responsible for the child's care, the alleged offender, and any other person with knowledge of the maltreatment for the purpose of gathering facts, assessing safety and risk to the child, and formulating a plan.\n(b) Authority of the local welfare agency responsible for assessing or investigating the maltreatment report, the agency responsible for assessing or investigating the report, and the local law enforcement agency responsible for investigating the alleged maltreatment includes but is not limited to authority to interview, without parental consent, the alleged victim and any other children who currently reside with or who have resided with the alleged offender.\n(a) The interview may take place at school or at any facility or other place where the alleged victim or other children might be found or the child may be transported to, and the interview may be conducted at a place appropriate for the interview of a child designated by the local welfare agency or law enforcement agency.\n(b) When it is possible and the report alleges substantial child endangerment or sexual abuse, the interview may take place outside the presence of the alleged offender and may take place prior to any interviews of the alleged offender.\n(a) Except as provided in this subdivision, the parent, legal custodian, or guardian shall be notified by the responsible agency or local law enforcement agency no later than the conclusion of the investigation or assessment that the interview has occurred.\n(b) Notwithstanding notice required under the Minnesota Rules of Juvenile Protection, the juvenile court may, after hearing on an ex parte motion by the local welfare agency, order that, where reasonable cause exists, the agency withhold notification of the interview from the parent, legal custodian, or guardian. If the interview took place or is to take place on school property, the order shall specify that school officials may not disclose to the parent, legal custodian, or guardian the contents of the notification of intent to interview the child on school property, as provided under this subdivision, and any other related information regarding the interview that may be a part of the child's school record. A copy of the order shall be sent by the local welfare or law enforcement agency to the appropriate school official.\nIn conducting investigations and assessments pursuant to this chapter, the notice required by section 13.04, subdivision 2, need not be provided to a child under the age of ten who is the alleged victim of maltreatment.\n(a) Where the alleged offender or a person responsible for the care of the alleged victim or other child prevents access to the victim or other child by the local welfare agency, the juvenile court may order the parent, legal custodian, or guardian to produce the alleged victim or other child for questioning by the local welfare agency or the local law enforcement agency outside the presence of the alleged offender or any person responsible for the child's care at reasonable places and times as specified by court order.\n(b) Before making an order under paragraph (a), the court shall issue an order to show cause, either upon its own motion or upon a verified petition, specifying the basis for the requested interview and fixing the time and place of the hearing. The order to show cause shall be served personally and shall be heard in the same manner as provided in other cases in the juvenile court. The court shall consider the need for appointment of a guardian ad litem to protect the best interests of the child. If appointed, the guardian ad litem shall be present at the hearing on the order to show cause.\n(a) When conducting an investigation, the local welfare agency shall use a question and answer interviewing format with questioning as nondirective as possible to elicit spontaneous responses.\n(b) For investigations only, the following interviewing methods and procedures must be used whenever possible when collecting information:\n(1) audio recording of all interviews with witnesses and collateral sources; and\n(2) in a case of alleged sexual abuse, audio-video recording of each interview with the alleged victim and a child witness.\n(a) When the local welfare agency, local law enforcement agency, or the agency responsible for assessing or investigating a report of maltreatment determines that an interview should take place on school property, written notification of intent to interview the child on school property must be received by school officials before the interview. The notification shall include the name of the child to be interviewed, the purpose of the interview, and a reference to the statutory authority to conduct an interview on school property. For an interview conducted by the local welfare agency, the notification shall be signed by the chair of the local welfare agency or the chair's designee. The notification shall be private data on individuals subject to the provisions of this subdivision. School officials may not disclose to the parent, legal custodian, or guardian the contents of the notification or any other related information regarding the interview until notified in writing by the local welfare agency or local law enforcement agency that the investigation or assessment has been concluded, unless a school employee or agent is alleged to have maltreated the child. Until that time, the local welfare agency, local law enforcement agency, or the agency responsible for assessing or investigating a report of maltreatment shall be solely responsible for any disclosure regarding the nature of the assessment or investigation.\n(b) Except where the alleged offender is believed to be a school official or employee, the time, place, and manner of the interview on school premises shall be within the discretion of school officials, but the local welfare agency or local law enforcement agency shall have the exclusive authority to determine who may attend the interview. The conditions as to time, place, and manner of the interview set by the school officials shall be reasonable, and the interview shall be conducted not more than 24 hours after the receipt of the notification unless another time is considered necessary by agreement between the school officials and the local welfare agency or local law enforcement agency. Where the school fails to comply with the provisions of this paragraph, the juvenile court may order the school to comply. Every effort must be made to reduce the disruption of the educational program of the child, other students, or school staff when an interview is conducted on school premises.",
	"repealed": false
}