{
	"id": "146B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.03",
	"title": "146B.03 LICENSURE FOR BODY ART TECHNICIANS.",
	"text": "(a) Effective January 1, 2011, no individual may perform tattooing unless the individual holds a valid tattoo technician license issued by the commissioner under this chapter, except as provided in subdivision 3.\n(b) Effective January 1, 2011, no individual may perform body piercing unless the individual holds a valid body piercing technician license issued by the commissioner under this chapter, except as provided in subdivision 3.\n(c) If an individual performs both tattooing and body piercing, the individual must hold a valid dual body art technician license.\n(a) No individual may use the title of \"tattooist,\" \"tattoo artist,\" \"tattoo technician,\" \"body art practitioner,\" \"body art technician,\" or other letters, words, or titles in connection with that individual's name which in any way represents that the individual is engaged in the practice of tattooing or authorized to do so, unless the individual is licensed and authorized to perform tattooing under this chapter.\n(b) No individual may use the title \"body piercer,\" \"body piercing artist,\" \"body art practitioner,\" \"body art technician,\" or other letters, words, or titles in connection with that individual's name which in any way represents that the individual is engaged in the practice of body piercing or authorized to do so, unless the individual is licensed and authorized to perform body piercing under this chapter.\n(c) Any representation made to the public by a licensed technician must specify the types of body art procedures the technician is licensed to perform.\n(a) The following individuals may perform body art procedures within the scope of their practice without a technician's license:\n(1) a physician licensed under chapter 147;\n(2) a nurse licensed under sections 148.171 to 148.285;\n(3) a chiropractor licensed under chapter 148;\n(4) an acupuncturist licensed under chapter 147B;\n(5) a physician assistant licensed under chapter 147A; or\n(6) a dental professional licensed under chapter 150A.\n(b) A guest artist under section 146B.04 may perform body art procedures in accordance with the requirements of section 146B.04.\n(a) An applicant for licensure under this section must submit to the commissioner on a form provided by the commissioner:\n(1) proof that the applicant is over the age of 18;\n(2) the type of license the applicant is applying for;\n(3) all fees required under section 146B.10;\n(4) proof of completing a minimum of 200 hours of supervised experience within each area for which the applicant is seeking a license, and must include an affidavit from the supervising licensed technician;\n(5) proof of having satisfactorily completed coursework within the year preceding application and approved by the commissioner on bloodborne pathogens, the prevention of disease transmission, infection control, and aseptic technique. Courses to be considered for approval by the commissioner may include, but are not limited to, those administered by one of the following:\n(i) the American Red Cross;\n(ii) United States Occupational Safety and Health Administration (OSHA); or\n(iii) the Alliance of Professional Tattooists; and\n(6) any other relevant information requested by the commissioner.\nThe licensure requirements in this paragraph are effective for all applications for new licenses received before January 1, 2017.\n(b) An applicant for licensure under this section must submit to the commissioner on a form provided by the commissioner:\n(1) proof that the applicant is over the age of 18;\n(2) the type of license the applicant is applying for;\n(3) all fees required under section 146B.10;\n(4) a log showing the completion of the required supervised experience described under subdivision 12 that includes a list of each licensed technician who provided the required supervision;\n(5) a signed affidavit from each licensed technician who the applicant listed in the log described in clause (4);\n(6) proof of having satisfactorily completed a minimum of five hours of coursework, within the year preceding application and approval by the commissioner, on bloodborne pathogens, the prevention of disease transmission, infection control, and aseptic technique. Courses to be considered for approval by the commissioner may include, but are not limited to, those administered by one of the following:\n(i) the American Red Cross;\n(ii) the United States Occupational Safety and Health Administration (OSHA); or\n(iii) the Alliance of Professional Tattooists; and\n(7) any other relevant information requested by the commissioner.\nThe licensure requirements in this paragraph are effective for all applications for new licenses received on or after January 1, 2017.\n(a) The commissioner shall notify the applicant in writing of the action taken on the application. If the application is approved, the commissioner shall issue a tattoo technician license, a body piercing technician license, or a dual body art technician license.\n(b) If licensure is denied, the applicant must be notified of the determination and the grounds for it, and the applicant may request a hearing under chapter 14 on the determination by filing a written statement with the commissioner within 30 days after receipt of the notice of denial. After the hearing, the commissioner shall notify the applicant in writing of the decision.\n(a) A technician's license is valid for two years from the date of issuance and may be renewed upon payment of the renewal fee established under section 146B.10.\n(b) At renewal, a licensee must submit proof of continuing education approved by the commissioner in the areas identified in subdivision 4.\n(c) The commissioner shall notify the technician of the pending expiration of a technician license at least 60 days prior to license expiration.\n(d) A technician previously licensed in Minnesota whose license has lapsed for less than six years may apply to renew. A technician previously licensed in Minnesota whose license has lapsed for less than ten years and who was licensed in another jurisdiction or jurisdictions during the entire time of lapse may apply to renew, but must submit proof of licensure in good standing in all other jurisdictions in which the technician was licensed as a body artist during the time of lapse. A technician previously licensed in Minnesota whose license has lapsed for more than six years and who was not continuously licensed in another jurisdiction during the period of Minnesota lapse must reapply for licensure under subdivision 4.\n(a) The commissioner may issue a temporary license to an applicant who submits to the commissioner on a form provided by the commissioner:\n(1) proof that the applicant is over the age of 18;\n(2) all fees required under section 146B.10; and\n(3) a letter from a licensed technician who has agreed to provide the supervision to meet the supervised experience requirement under subdivision 4.\n(b) Upon completion of the required supervised experience, the temporary licensee shall submit documentation of satisfactorily completing the requirements under subdivision 4, and the applicable fee under section 146B.10. The commissioner shall issue a new license in accordance with subdivision 4.\n(c) A temporary license issued under this subdivision is valid for one year and may be renewed twice.\n(a) A technician must have been licensed in Minnesota or in a jurisdiction with which Minnesota has reciprocity for at least:\n(1) two years as a tattoo technician licensed under section 146B.03, subdivision 4, 6, or 8, in order to supervise a temporary tattoo technician; or\n(2) one year as a body piercing technician licensed under section 146B.03, subdivision 4, 6, or 8, or must have performed at least 500 body piercings, in order to supervise a temporary body piercing technician.\n(b) Any technician who agrees to supervise more than two temporary tattoo technicians during the same time period, or more than four body piercing technicians during the same time period, must provide to the commissioner a supervisory plan that describes how the technician will provide supervision to each temporary technician in accordance with section 146B.01, subdivision 28.\n(c) The supervisory plan must include, at a minimum:\n(1) the areas of practice under supervision;\n(2) the anticipated supervision hours per week;\n(3) the anticipated duration of the training period; and\n(4) the method of providing supervision if there are multiple technicians being supervised during the same time period.\n(d) If the supervisory plan is terminated before completion of the technician's supervised practice, the supervisor must notify the commissioner in writing within 14 days of the change in supervision and include an explanation of why the plan was not completed.\n(e) The commissioner may refuse to approve as a supervisor a technician who has been disciplined in Minnesota or in another jurisdiction after considering the criteria in section 146B.02, subdivision 10, paragraph (b).\nThe commissioner shall issue a technician's license to a person who holds a current license, certification, or registration from another state if the commissioner determines that the standards for licensure, certification, or registration in the other jurisdiction meet or exceed the requirements for licensure stated in this chapter and a letter is received from that jurisdiction stating that the applicant is in good standing.\nA license issued under this section is not transferable to another individual. A valid license must be displayed at the establishment site and available to the public upon request.\n[Repealed, 2013 c 43 s 32]\nAny person who violates the provisions of subdivision 1 is guilty of a gross misdemeanor.\nAn applicant for a body art technician license must complete the following minimum supervised experience for licensure:\n(1) for a tattoo technician license an applicant must complete a minimum of 200 hours of tattoo experience under supervision;\n(2) for a body piercing technician license an applicant must perform 250 body piercings under direct supervision and 250 body piercings under indirect supervision; and\n(3) for a dual body art technician license an applicant must complete a minimum of 200 hours of tattoo experience under supervision and perform 250 body piercings under direct supervision and 250 body piercings under indirect supervision.",
	"repealed": false
}