{
	"id": "116J.545",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.545",
	"title": "116J.545 GETTING TO WORK GRANT PROGRAM.",
	"text": "The commissioner of employment and economic development shall make grants to nonprofit organizations to establish and operate programs under this section that provide, repair, or maintain motor vehicles to assist eligible individuals to obtain or maintain employment. All grants shall be for two years.\nA grantee must:\n(1) qualify under section 501(c)(3) of the Internal Revenue Code; and\n(2) at the time of application, offer or have the demonstrated capacity to offer a motor vehicle program that provides the services required under subdivision 3.\n(a) A program must offer one or more of the following services:\n(1) provision of new or used motor vehicles by gift, sale, or lease;\n(2) motor vehicle repair and maintenance services; or\n(3) motor vehicle loans.\n(b) In addition to the requirements of paragraph (a), a program must offer one or more of the following services:\n(1) financial literacy education;\n(2) education on budgeting for vehicle ownership;\n(3) car maintenance and repair instruction;\n(4) credit counseling; or\n(5) job training related to motor vehicle maintenance and repair.\nApplications for a grant must be on a form provided by the commissioner and on a schedule set by the commissioner. Applications must, in addition to any other information required by the commissioner, include the following:\n(1) a detailed description of all services to be offered;\n(2) the area to be served;\n(3) the estimated number of program participants to be served by the grant; and\n(4) a plan for leveraging resources from partners that may include but are not limited to:\n(i) automobile dealers;\n(ii) automobile parts dealers;\n(iii) independent local mechanics and automobile repair facilities;\n(iv) banks and credit unions;\n(v) employers;\n(vi) employment and training agencies;\n(vii) insurance companies and agents;\n(viii) local workforce centers; and\n(ix) educational institutions, including vocational institutions and jobs or skills training programs.\n(a) To be eligible to receive program services, a person must:\n(1) have a household income at or below 200 percent of the federal poverty level;\n(2) be at least 18 years of age;\n(3) have a valid driver's license;\n(4) provide the grantee with proof of motor vehicle insurance; and\n(5) demonstrate to the grantee that a motor vehicle is required by the person to obtain or maintain employment.\n(b) This subdivision does not preclude a grantee from imposing additional requirements, not inconsistent with paragraph (a), for the receipt of program services.\nBy January 15, 2026, and each January 15 in an even-numbered year thereafter, the commissioner shall submit a report to the chairs of the house of representatives and senate committees with jurisdiction over workforce and economic development on program outcomes. At a minimum, the report must include:\n(1) the total number of program participants;\n(2) the number of program participants who received each of the following:\n(i) provision of a motor vehicle;\n(ii) motor vehicle repair services; and\n(iii) motor vehicle loans;\n(3) the number of program participants who report that they or their children were able to increase their participation in community activities such as after school programs, other youth programs, church or civic groups, or library services as a result of participation in the program; and\n(4) an analysis of the impact of the getting to work grant program on the employment rate and wages of program participants.",
	"repealed": false
}