{
	"id": "103F.612",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.612",
	"title": "103F.612 WETLAND PRESERVATION AREAS.",
	"text": "For purposes of sections 103F.612 to 103F.616, \"wetland\" has the meaning given in section 103G.005, subdivision 19.\n(a) A wetland owner may apply to the county where a wetland is located for designation of a wetland preservation area in a high priority wetland area designated by the Board of Water and Soil Resources, if the county chooses to accept wetland preservation area applications. The application must be made on forms provided by the board. If a wetland is located in more than one county, the application must be submitted to the county where the majority of the wetland is located.\n(b) The application shall be executed and acknowledged in the manner required by law to execute and acknowledge a deed and must contain at least the following information and other information the Board of Water and Soil Resources requires:\n(1) legal description of the area to be approved, which must include an upland strip at least 16-1/2 feet in width around the perimeter of wetlands within the area and may include total upland area of up to four acres for each acre of wetland;\n(2) parcel identification numbers where designated by the county auditor;\n(3) name and address of the owner;\n(4) a statement by the owner covenanting that the land will be preserved as a wetland and will only be used in accordance with conditions prescribed by the Board of Water and Soil Resources and providing that the restrictive covenant will be binding on the owner and the owner's successors or assigns, and will run with the land.\n(c) The upland strip required in paragraph (b), clause (1), must be planted with permanent vegetation other than a noxious weed.\nUpon receipt of an application, the county shall determine if all material required by subdivision 2 has been submitted and, if so, shall determine that the application is complete. The term \"date of application\" means the date the application is determined to be complete by the county. The county shall send a copy of the application to the county assessor, the Board of Water and Soil Resources, and the soil and water conservation district where the land is located. The soil and water conservation district shall prepare an advisory statement of existing and potential preservation problems or conflicts and send the statement to the owner of record and to the county. The county shall notify the landowner of the acceptance or denial of the application within 60 days from the date of the application.\nWithin five days of the date of application, the county shall forward the application to the county recorder for recording or to the registrar of titles for filing if the land is registered. The county recorder shall record the application containing the restrictive covenant and return it to the applicant. If the land is registered, the registrar of titles shall memorialize the application containing the restrictive covenant upon the certificate of title. The recorder or registrar of titles shall notify the county that the application has been recorded or memorialized.\nThe wetland is a wetland preservation area commencing 30 days from the date the county notifies the landowner of acceptance of the application under subdivision 3.\nThe county may require an application fee to defray administrative costs of the program.\nThe county shall maintain wetland preservation area maps illustrating land covenanted as wetland preservation areas.\nA watershed management organization with an approved watershed management plan under section 103B.231 has the same authority as a county to receive and act on applications under sections 103F.612 to 103F.616.",
	"repealed": false
}