{
	"id": "383C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.16",
	"title": "383C.16 COUNTY FAIR; MAINTAINING.",
	"text": "The St. Louis County Board may annually appropriate funding to assist in maintaining one or more county fairs, which shall be under the management and control of a county agricultural society or another entity designated by the board. The appropriation shall be made either to the treasurer of such society or to some other suitable person, but before such money is paid to such treasurer or other person, the payee shall file with the county auditor a satisfactory bond in double the sum of said appropriation, conditioned upon a faithful disbursing and accounting for all of said funds so appropriated. Said funds so appropriated shall be used solely for the purpose of obtaining, preparing, and arranging exhibits and paying premiums to exhibitors. The treasurer or other person to whom said appropriation is paid shall within four months after the holding of any such aided annual fair, file with the county auditor a verified and detailed report showing the name and address of every person to whom any of said money was paid, together with the date of payment and a full description of the purposes for which the money was so paid and shall attach thereto receipts and subvouchers for each payment so made and shall return to the county treasurer all of the unexpended portion thereof. After said report and receipts and subvouchers have been audited by the county board and found to be correct, they may by resolution release said treasurer or other person and sureties from all further liabilities under such bond.\nThe county board may also annually appropriate such further sum as it may desire not exceeding $7,500, for the purpose of procuring a suitable site and the erection of a suitable county building thereon, for the building or repairing of a racetrack and for grading and improving the grounds, to be used in connection with such county fair, but said site and said building and improvements shall be and remain the property of such county and such annual appropriation shall be used only for the purpose of so acquiring such site and building and grading and for the necessary care, repair, maintenance and upkeep thereof.",
	"repealed": false
}