{
	"id": "440.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/440.135",
	"title": "440.135 VACATING STREETS IN THIRD CLASS CHARTER CITY.",
	"text": "This section applies to every home rule charter city of the third class.\nIn addition to any other method provided by law, the council of such city, upon the presentation and filing of a verified petition signed by or on behalf of any owner, natural or corporate, of any real estate abutting thereon, may vacate any street or segment of street or any portion of the width thereof within its geographical limits, provided only that the street, segment, or portion thereof so vacated pursuant to such petition shall not be longer than the distance intervening between any two adjacent intersecting streets. If any street, segment, or portion thereof proposed to be vacated terminates at or abuts upon any public water, the petitioners shall serve notice of the petition by certified mail upon the commissioner of natural resources at least 30 days before the council hearing on the matter. The notice under this subdivision is for notification purposes only and does not create a right of intervention by the commissioner of natural resources.\nSuch action of such council may be taken at any regular or special meeting duly called for such purpose and shall be by resolution, and a copy of the resolution duly certified by the city clerk shall be recorded in the office of the county recorder in the county where such city is located before the action shall be effective.\nThe vacation of any street or segment thereof under this section shall not destroy or interfere with the right of any person, corporation, or municipality owning or having control of any electric light or telephone pole or lines existing upon such street at the time of the vacation thereof or with any sewer or water pipes, mains or hydrants thereon or thereunder to enter upon such street or portion thereof vacated for the purpose of repairing the same or otherwise attending thereto.",
	"repealed": false
}