{
	"id": "250.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/250.05",
	"title": "250.05 CREATION; ADMINISTRATION; POWERS AND DUTIES.",
	"text": "MS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nAll employees of the Gillette Children's Hospital who are in the classified service of the state on March 28, 1974, shall be continued as employees of the Gillette Children's Hospital Board without loss of status, seniority, or benefits. The Departments of Administration and Personnel shall endeavor to assist in the transfer elsewhere within state service of any classified employee who desires such assistance. Classified personnel may, with their individual approval and the approval of the Gillette Children's Hospital Board, enter the unclassified service. Employees who remain in the classified service of the state under the provisions of this section, may do so as long as they continue to occupy the position occupied on March 28, 1974. If such an employee at a subsequent date is appointed, transferred, promoted, or demoted to a different position under the Gillette Children's Hospital Board, that position and employee shall be in the unclassified service. All other employees of the Gillette Children's Hospital Board shall be in the unclassified service. The Gillette Children's Hospital Board may prescribe all terms and conditions of employment of unclassified employees, including but not limited to the fixing of classification and compensation, without regard to the provisions of chapter 15A. Full-time employees of the Gillette Children's Hospital Board may be members of the Minnesota State Retirement System for classified employees, to which the Gillette Children's Hospital Board shall make employer's contributions.\nMS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nMS 1988 [Repealed, 1988 c 599 s 5]\nThe Gillette Children's Hospital may be dissolved upon the adoption of a plan to dissolve by two-thirds of the Gillette Children's Hospital Board. In the event of dissolution of the Gillette Children's Hospital, no liquidating or other dividends shall be declared or paid to any private individual and the net assets of the Gillette Children's Hospital shall be distributed as follows:\n(1) all liabilities and obligations of the Gillette Children's Hospital shall be paid, satisfied, or discharged, or adequate provision shall be made to do so; and\n(2) remaining assets shall be distributed to the state of Minnesota or public, charitable, scientific, or educational organizations described in sections 170(c)(2), 501(c)(3), 2055(a)(2), and 2522(a)(2) of the Internal Revenue Code of 1986, as amended, as determined in the plan to dissolve.",
	"repealed": false
}