{
	"id": "84.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.95",
	"title": "84.95 REINVEST IN MINNESOTA RESOURCES FUND.",
	"text": "A reinvest in Minnesota resources fund is created as a separate fund in the state treasury. The fund shall be managed to earn the highest interest compatible with prudent investment, preservation of principal, and reasonable liquidity. The principal and interest attributable to the principal shall remain in the fund until spent. Proceeds of state bonds issued for purposes of the fund shall be segregated in a special account and disbursed only for capital costs of the acquisition and betterment of public land and easements in land and improvements in land for which the proceeds are appropriated.\nMoney from the reinvest in Minnesota resources fund may only be spent for the following fish and wildlife conservation enhancement purposes:\n(1) development and implementation of the fish and wildlife management plans under section 84.942;\n(2) implementation of the reinvest in Minnesota reserve program established by section 103F.515;\n(3) soil and water conservation practices to improve water quality, reduce soil erosion and crop surpluses;\n(4) enhancement or restoration of fish and wildlife habitat on lakes, streams, wetlands, and public and private forest lands;\n(5) acquisition and development of public access sites and recreation easements to lakes, streams, and rivers for fish and wildlife oriented recreation;\n(6) matching funds with government agencies, federally recognized Indian tribes and bands, and the private sector for acquisition and improvement of fish and wildlife habitat;\n(7) research and surveys of fish and wildlife species and habitat;\n(8) enforcement of natural resource laws and rules;\n(9) information and education;\n(10) implementing the aspen recycling program under section 88.80 and for other forest wildlife management projects; and\n(11) necessary support services to carry out these purposes.\n[Repealed, 2004 c 255 s 51]",
	"repealed": false
}