{
	"id": "256.4773",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.4773",
	"title": "256.4773 TECHNOLOGY FOR HOME GRANT.",
	"text": "The commissioner must establish a technology for home grant program that provides assistive technology consultations and resources for people with disabilities who want to stay in their own home, move to their own home, or remain in a less restrictive residential setting. The grant program may be administered using a team approach that allows multiple professionals to assess and meet a person's assistive technology needs. The team may include but is not limited to occupational therapists, physical therapists, speech therapists, nurses, and engineers.\nAn eligible applicant is a person who uses or is eligible for home care services under section 256B.0651, home and community-based services under section 256B.092 or 256B.49, personal care assistance under section 256B.0659, or community first services and supports under section 256B.85, and who meets one of the following conditions:\n(1) lives in the applicant's own home and may benefit from assistive technology for safety, communication, community engagement, or independence;\n(2) is currently seeking to live in the applicant's own home and needs assistive technology to meet that goal; or\n(3) resides in a residential setting under section 256B.4914, subdivision 3, and is seeking to reduce reliance on paid staff to live more independently in the setting.\nThe technology for home grant program must provide at-home, in-person assistive technology consultation and technical assistance to help people with disabilities live more independently. Allowable activities include but are not limited to:\n(1) consultations in people's homes, workplaces, or community locations;\n(2) connecting people to resources to help them live in their own homes, transition to their own homes, or live more independently in residential settings;\n(3) conducting training for and set up and installation of assistive technology; and\n(4) participating on a person's care team to develop a plan to ensure assistive technology goals are met.\nGrantees must provide data summaries to the commissioner for the purpose of evaluating the effectiveness of the grant program. The commissioner must identify outcome measures to evaluate program activities to assess whether the grant programs help people transition to or remain in the least restrictive setting.",
	"repealed": false
}