{
	"id": "176.253",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.253",
	"title": "176.253 INSURER, EMPLOYER, AND THIRD-PARTY ADMINISTRATOR; PERFORMANCE OF ACTS.",
	"text": "(a) The terms used in this section have the meanings given to them in this subdivision.\n(b) \"Department\" has the meaning in section 176.011, subdivision 8b.\n(c) \"Employer\" means an employer as defined in section 176.011, subdivision 10, against whom a workers' compensation claim has been asserted or who is liable for a workers' compensation injury under this chapter. Employer includes:\n(1) an employer authorized to self-insure by the Department of Commerce under chapter 79A; and\n(2) the state or a political subdivision that is not required to be authorized to self-insure by the commissioner of commerce in order to pay its workers' compensation claims.\n(d) \"Insurer\" means a workers' compensation insurer licensed by the Department of Commerce under section 60A.\n(e) \"Third-party administrator\" means an administrator that is licensed by the Department of Commerce to administer a workers' compensation self-insurance or insurance plan under section 60A.23, subdivision 8, with a contract to act on behalf of an employer or insurer.\nWhere this chapter requires an employer to perform an act, the insurer of the employer may perform that act. Where the insurer acts on behalf of the employer, the employer is responsible for the authorized acts of the insurer and for any delay, failure, or refusal of the insurer to perform the act. This section does not relieve the employer from any penalty or forfeiture which this chapter imposes on the employer.\nA third-party administrator that has an active account in CAMPUS under section 176.2612 may act on behalf of the employer or insurer as provided in the contract between the administrator and the employer or insurer. If the department or commissioner issues an order or assesses a penalty against an employer or insurer, the order or penalty must be served on any administrator acting on behalf of the employer or insurer. A third-party administrator has the authority to act on behalf of the employer or insurer in responding to a commissioner or department inquiry, order or penalty assessment, or paying a penalty, until the insurer or administrator notifies the department in writing that the administrator does not have authority.",
	"repealed": false
}