{
	"id": "169A.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.275",
	"title": "169A.275 MANDATORY PENALTIES; NONFELONY VIOLATIONS.",
	"text": "(a) The court shall sentence a person who is convicted of a violation of section 169A.20 (driving while impaired) within ten years of a qualified prior impaired driving incident to either:\n(1) a minimum of 30 days of incarceration, at least 48 hours of which must be served in a local correctional facility; or\n(2) eight hours of community work service for each day less than 30 days that the person is ordered to serve in a local correctional facility.\nNotwithstanding section 609.135 (stay of imposition or execution of sentence), the penalties in this paragraph must be executed, unless the court departs from the mandatory minimum sentence under paragraph (b) or (c).\n(b) Prior to sentencing, the prosecutor may file a motion to have a defendant described in paragraph (a) sentenced without regard to the mandatory minimum sentence established by that paragraph. The motion must be accompanied by a statement on the record of the reasons for it. When presented with the prosecutor's motion and if it finds that substantial mitigating factors exist, the court shall sentence the defendant without regard to the mandatory minimum sentence established by paragraph (a).\n(c) The court may, on its own motion, sentence a defendant described in paragraph (a) without regard to the mandatory minimum sentence established by that paragraph if it finds that substantial mitigating factors exist and if its sentencing departure is accompanied by a statement on the record of the reasons for it. The court also may sentence the defendant without regard to the mandatory minimum sentence established by paragraph (a) if the defendant is sentenced to probation and ordered to participate in a program established under section 169A.74 (pilot programs of intensive probation for repeat DWI offenders).\n(d) When any portion of the sentence required by paragraph (a) is not executed, the court should impose a sentence that is proportional to the extent of the offender's prior criminal and moving traffic violation record. Any sentence required under paragraph (a) must include a mandatory sentence that is not subject to suspension or a stay of imposition or execution, and that includes incarceration for not less than 48 hours or at least 80 hours of community work service.\n(a) The court shall sentence a person who is convicted of a violation of section 169A.20 (driving while impaired) within ten years of the first of two qualified prior impaired driving incidents to either:\n(1) a minimum of 90 days of incarceration, at least 30 days of which must be served consecutively in a local correctional facility; or\n(2) a program of intensive supervision of the type described in section 169A.74 (pilot programs of intensive probation for repeat DWI offenders) that requires the person to consecutively serve at least six days in a local correctional facility.\n(b) The court may order that the person serve not more than 60 days of the minimum penalty under paragraph (a), clause (1), on home detention or in an intensive probation program described in section 169A.74.\n(c) Notwithstanding section 609.135, the penalties in this subdivision must be imposed and executed.\n(a) Unless the court commits the person to the custody of the commissioner of corrections as provided in section 169A.276 (mandatory penalties; felony violations), the court shall sentence a person who is convicted of a violation of section 169A.20 (driving while impaired) within ten years of the first of three qualified prior impaired driving incidents to either:\n(1) a minimum of 180 days of incarceration, at least 30 days of which must be served consecutively in a local correctional facility;\n(2) a program of intensive supervision of the type described in section 169A.74 (pilot programs of intensive probation for repeat DWI offenders) that requires the person to consecutively serve at least six days in a local correctional facility; or\n(3) a program of staggered sentencing involving a minimum of 180 days of incarceration, at least 30 days of which must be served consecutively in a local correctional facility.\n(b) The court may order that the person serve not more than 150 days of the minimum penalty under paragraph (a), clause (1), on home detention or in an intensive probation program described in section 169A.74. Notwithstanding section 609.135, the penalties in this subdivision must be imposed and executed.\n(a) Unless the court commits the person to the custody of the commissioner of corrections as provided in section 169A.276 (mandatory penalties; felony violations), the court shall sentence a person who is convicted of a violation of section 169A.20 (driving while impaired) within ten years of the first of four or more qualified prior impaired driving incidents to either:\n(1) a minimum of one year of incarceration, at least 60 days of which must be served consecutively in a local correctional facility;\n(2) a program of intensive supervision of the type described in section 169A.74 (pilot programs of intensive probation for repeat DWI offenders) that requires the person to consecutively serve at least six days in a local correctional facility; or\n(3) a program of staggered sentencing involving a minimum of one year of incarceration, at least 60 days of which must be served consecutively in a local correctional facility.\n(b) The court may order that the person serve the remainder of the minimum penalty under paragraph (a), clause (1), on intensive probation using an electronic monitoring system or, if such a system is unavailable, on home detention. Notwithstanding section 609.135, the penalties in this subdivision must be imposed and executed.\nUnless the court commits the person to the custody of the commissioner of corrections as provided in section 169A.276 (mandatory penalties; felony violations), in addition to other penalties required under this section, the court shall order a person to submit to the level of care recommended in the chemical use assessment conducted under section 169A.70 (alcohol safety program; chemical use assessments) if the person is convicted of violating section 169A.20 (driving while impaired) while having an alcohol concentration of 0.16 or more as measured at the time, or within two hours of the time, of the offense or if the violation occurs within ten years of one or more qualified prior impaired driving incidents.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Staggered sentencing\" means a sentencing procedure in which the court sentences a person convicted of a gross misdemeanor or felony violation of section 169A.20 (driving while impaired) to an executed sentence of incarceration in a local correctional facility, to be served in equal segments in three or more consecutive years. Before reporting for any subsequent segment of incarceration after the first segment, the offender shall be regularly involved in a structured sobriety group and may bring a motion before the court requesting to have that segment of incarceration stayed. The motion must be brought before the same judge who initially pronounced the sentence. Before bringing the motion, the offender shall participate for 30 days in a remote electronic alcohol-monitoring program under the direction of the person's probation agent. It is within the court's discretion to stay the second or subsequent segment of remote electronic alcohol monitoring or incarceration that has previously been ordered. The court shall consider any alcohol-monitoring results and the recommendation of the probation agent, together with any other factors deemed relevant by the court, in deciding whether to modify the sentence by ordering a stay of the next following segment of remote electronic alcohol monitoring or incarceration that the court had initially ordered to be executed.\n(c) When the court stays a segment of incarceration that it has previously ordered to be executed, that portion of the sentence must be added to the total number of days the defendant is subject to serving in custody if the person subsequently violates any of the conditions of that stay of execution.\n(d) A structured sobriety group is an organization that has regular meetings focusing on sobriety and includes, but is not limited to, Alcoholics Anonymous.\nA judge is not required to sentence a person as provided in subdivisions 1 to 4 if the judge requires the person as a condition of probation to drive only motor vehicles equipped with an ignition interlock device meeting the standards described in section 171.306.",
	"repealed": false
}