{
	"id": "473.852",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.852",
	"title": "473.852 DEFINITIONS.",
	"text": "As used in sections 462.355, 473.175, and 473.851 to 473.871, the following terms shall have the meanings given them.\n\"Advisory Metropolitan Land Use Committee\" or \"advisory committee\" means an advisory committee established by the Metropolitan Council pursuant to section 473.853.\n\"Applicable planning statute\" means sections 394.21 to 394.37 for counties and sections 462.351 to 462.364 for cities and towns.\n\"Capital improvement program\" means an itemized program for a five-year prospective period, and any amendments thereto, subject to at least biennial review, setting forth the schedule, timing, and details of specific contemplated capital improvements by year, together with their estimated cost, the need for each improvement, financial sources, and the financial impact that the improvements will have on the local governmental unit.\n\"Comprehensive plan\" means the comprehensive plan of each local governmental unit described in sections 473.858 to 473.862, and any amendments to the plan.\n\"Fiscal devices\" means the valuation of property pursuant to section 273.111, the designation of urban and rural service districts, pursuant to section 272.67, and the establishment of development districts pursuant to sections 469.124 to 469.133, and any other statutes authorizing the creation of districts in which the use of tax increment bonding is authorized.\n\"Local governmental unit\" or \"unit\" means all cities, counties and towns lying in whole or in part within the metropolitan area, but does not include school districts.\n\"Metropolitan system plans\" means the transportation portion of the Metropolitan Development Guide, and the policy plans, and capital budgets for metropolitan wastewater service, transportation, and regional recreation open space.\n\"Official controls\" or \"controls\" means ordinances and rules which control the physical development of a city, county or town or any part thereof or any detail thereof and implement the general objectives of the comprehensive plan. Official controls may include ordinances establishing zoning, subdivision controls, site plan regulations, sanitary codes, building codes and official maps.\n\"Private sewer facility\" means a single lot, multiple lot or other sewage collection or treatment facility owned, constructed or operated by any person other than a local governmental unit or the council.\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]",
	"repealed": false
}