{
	"id": "147.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.01",
	"title": "147.01 BOARD OF MEDICAL PRACTICE.",
	"text": "The Board of Medical Practice consists of 16 residents of the state of Minnesota appointed by the governor. Eleven board members must be licensed to practice medicine under this chapter. At least one board member must hold a degree of doctor of medicine, and at least one board member must hold a degree of doctor of osteopathic medicine. Five board members must be public members as defined by section 214.02. The governor shall make appointments to the board which reflect the geography of the state. In making these appointments, the governor shall ensure that no more than one public member resides in each United States congressional district, and that at least one member who is not a public member resides in each United States congressional district. The board members holding the degree of doctor of medicine or doctor of osteopathic medicine must, as a whole, reflect the broad mix of expertise of physicians practicing in Minnesota. A member may be reappointed but shall not serve more than eight years consecutively. Membership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements are as provided in sections 214.07 to 214.09. The provision of staff, administrative services and office space; the review and processing of complaints; the setting of board fees; and other provisions relating to board operations are as provided in chapter 214.\nPrior to the end of the term of a doctor of medicine or public member on the board, or within 60 days after a doctor of medicine or public member position on the board becomes vacant, the State Medical Association, the Mental Health Association of Minnesota, and other interested persons and organizations may recommend to the governor doctors of medicine and public members qualified to serve on the board. Prior to the end of the term of an osteopathic physician, or within 60 days after an osteopathic physician membership becomes vacant, the Minnesota Osteopathic Medical Society may recommend to the governor three osteopathic physicians qualified to serve on the board. The governor may appoint members to the board from the list of persons recommended or from among other qualified candidates.\nThe board shall elect from among its number a president, a vice-president, and a secretary-treasurer, who shall each serve for one year, or until a successor is elected and qualifies. The board shall have authority to adopt rules as may be found necessary to carry out the purposes of this chapter. The members of the board shall have authority to administer oaths and the board, in session, to take testimony as to matters pertaining to the duties of the board. Nine members of the board shall constitute a quorum for the transaction of business. The board shall have a common seal, which shall be kept by the executive director, whose duty it shall be to keep a record of all proceedings of the board, including a register of all applicants for license under this chapter, giving their names, addresses, ages, educational qualifications, and the result of their examination. These books and registers shall be prima facie evidence of all the matters therein recorded.\nSubject to the exceptions listed in this subdivision, all communications or information received by or disclosed to the board relating to any person or matter subject to its regulatory jurisdiction are confidential and privileged and any disciplinary hearing shall be closed to the public.\n(a) Upon application of a party in a proceeding before the board under section 147.091, the board shall produce and permit the inspection and copying, by or on behalf of the moving party, of any designated documents or papers relevant to the proceedings, in accordance with the provisions of rule 34, Minnesota Rules of Civil Procedure.\n(b) If the board takes corrective action or imposes disciplinary measures of any kind, whether by contested case or by settlement agreement, the name and business address of the licensee, the nature of the misconduct, and the action taken by the board are public data. If disciplinary action is taken by settlement agreement, the entire agreement is public data. The board shall decide disciplinary matters, whether by settlement or by contested case, by roll call vote. The votes are public data.\n(c) The board shall exchange information with other licensing boards, agencies, or departments within the state, as required under section 214.10, subdivision 8, paragraph (c), and may release information in the reports required under section 147.02, subdivision 6.\n(d) The board shall upon request furnish to a person who made a complaint, or the alleged victim of a violation of section 147.091, subdivision 1, paragraph (t), or both, a description of the activities and actions of the board relating to that complaint, a summary of the results of an investigation of that complaint, and the reasons for actions taken by the board.\n(e) A probable cause hearing held pursuant to section 147.092 shall be closed to the public, except for the notices of hearing made public by operation of section 147.092.\n(f) Findings of fact, conclusions, and recommendations issued by the administrative law judge, and transcripts of oral arguments before the board pursuant to a contested case proceeding in which an administrative law judge found a violation of section 147.091, subdivision 1, paragraph (t), are public data.\nThe Board of Medical Practice shall provide blanks, books, certificates, and such stationery and assistance as is necessary for the transaction of the business pertaining to the duties of such board. The expenses of administering this chapter shall be paid from the appropriations made to the Board of Medical Practice. The board shall employ an executive director subject to the terms described in section 214.04, subdivision 2a.\n[Repealed, 1997 c 225 art 2 s 63]\n(a) The board may charge the following nonrefundable application and license fees processed pursuant to sections 147.02, 147.03, 147.037, 147.0375, and 147.38:\n(1) physician application fee, $200;\n(2) physician annual registration renewal fee, $192;\n(3) physician endorsement to other states, $40;\n(4) physician emeritus license, $50;\n(5) physician late fee, $60;\n(6) duplicate license fee, $20;\n(7) certification letter fee, $25;\n(8) education or training program approval fee, $100;\n(9) report creation and generation fee, $60 per hour;\n(10) examination administration fee (half day), $50;\n(11) examination administration fee (full day), $80;\n(12) fees developed by the Interstate Commission for determining physician qualification to register and participate in the interstate medical licensure compact, as established in rules authorized in and pursuant to section 147.38, not to exceed $1,000; and\n(13) verification fee, $25.\n(b) The board may prorate the initial annual license fee. All licensees are required to pay the full fee upon license renewal. The revenue generated from the fee must be deposited in an account in the state government special revenue fund.",
	"repealed": false
}