{
	"id": "121A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.37",
	"title": "121A.37 YOUTH SPORTS PROGRAMS.",
	"text": "(a) Consistent with section 121A.38, any municipality, business, or nonprofit organization that organizes a youth athletic activity for which an activity fee is charged shall:\n(1) make information accessible to all participating coaches, officials, and youth athletes and their parents or guardians about the nature and risks of concussions, including the effects and risks of continuing to play after receiving a concussion, and the protocols and content, consistent with current medical knowledge from the Centers for Disease Control and Prevention, related to:\n(i) the nature and risks of concussions associated with athletic activity;\n(ii) the signs, symptoms, and behaviors consistent with a concussion;\n(iii) the need to alert appropriate medical professionals for urgent diagnosis and treatment when a youth athlete is suspected or observed to have received a concussion; and\n(iv) the need for a youth athlete who sustains a concussion to follow proper medical direction and protocols for treatment and returning to play; and\n(2) require all participating coaches and officials to receive initial online training and online training at least once every three calendar years thereafter, consistent with clause (1) and the Concussion in Youth Sports online training program available on the Centers for Disease Control and Prevention website.\n(b) A coach or official shall remove a youth athlete from participating in any youth athletic activity when the youth athlete:\n(1) exhibits signs, symptoms, or behaviors consistent with a concussion; or\n(2) is suspected of sustaining a concussion.\n(c) When a coach or official removes a youth athlete from participating in a youth athletic activity because of a concussion, the youth athlete may not again participate in the activity until the youth athlete:\n(1) no longer exhibits signs, symptoms, or behaviors consistent with a concussion; and\n(2) is evaluated by a provider trained and experienced in evaluating and managing concussions and the provider gives the youth athlete written permission to again participate in the activity.\n(d) Failing to remove a youth athlete from an activity under this section does not violate section 604A.11, subdivision 2, clause (6), consistent with paragraph (e).\n(e) This section does not create any additional liability for, or create any new cause of legal action against, a municipality, business, or nonprofit organization or any officer, employee, or volunteer of a municipality, business, or nonprofit organization.\n(f) For the purposes of this section, a municipality means a home rule charter city, a statutory city, or a town.",
	"repealed": false
}