{
	"id": "325F.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.87",
	"title": "325F.87 FORM REQUIREMENTS.",
	"text": "The disclosure information required by section 325F.86 must be disclosed in a rental-purchase agreement and:\n(1) must be made clearly and conspicuously with items appearing in logical order and segregated as appropriate for readability and clarity;\n(2) must be made in writing;\n(3) need not be contained in a single writing or made in the order set forth in section 325F.86; and\n(4) may be supplemented by additional information or explanations supplied by the lessor, but none shall be stated, used, or placed so as to mislead or confuse the lessee or to contradict, obscure, or detract attention from the information required by section 325F.86, and so long as the additional information or explanations do not have the effect of circumventing, evading, or unduly complicating the information required to be disclosed by section 325F.86.\nThe lessor shall disclose all information required by section 325F.86 before the rental-purchase agreement is executed. These disclosures must be made on the face of the writing evidencing the rental-purchase agreement.\nBefore any payment is due, the lessor shall furnish the lessee with an exact copy of each rental-purchase agreement. The agreement shall be signed by the lessee and is evidence of the lessee's agreement. If there is more than one lessee in a rental-purchase agreement, delivery of a copy of the rental-purchase agreement to one of the lessees constitutes compliance with this subdivision; however, a lessee not signing the agreement is not liable under it.\nThe terms of the rental-purchase agreement, except as otherwise provided in this section, must be set forth in not less than eight-point standard type.\nAll blank spaces on the rental-purchase agreement form must be filled in before the rental-purchase agreement is executed. Blank spaces that are provided for items or terms not applicable to the agreement must be crossed out.",
	"repealed": false
}