{
	"id": "135A.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.046",
	"title": "135A.046 ASSET PRESERVATION AND REPLACEMENT.",
	"text": "The legislature recognizes that postsecondary governing boards operate campus physical plants that in number, size, and programmatic use differ significantly from the physical plants operated by state departments and agencies. However, the legislature recognizes the need for standards to aid in categorizing and funding capital projects. The purpose of this section is to provide standards for those higher education projects that are intended to preserve and replace existing campus facilities.\nCapital budget expenditures for Higher Education Asset Preservation and Replacement (HEAPR) projects must be for one or more of the following: code compliance including health and safety, Americans with Disabilities Act requirements, hazardous material abatement, access improvement, or air quality improvement; building energy efficiency improvements using current best practices; or building or infrastructure repairs necessary to preserve the interior and exterior of existing buildings; or renewal to support the existing programmatic mission of the campuses. Up to ten percent of an appropriation awarded under this section may be used for design costs for projects eligible to be funded from this account in anticipation of future funding from the account.\nEach postsecondary governing board shall establish priorities within its Higher Education Asset Preservation and Replacement projects. By January 15 of each year, it shall submit to the commissioner of management and budget and to the chairs of the higher education finance divisions, the senate Finance Committee, and the house of representatives Capital Investment Committee a list of the projects that have been paid for with money from a higher education asset preservation and replacement appropriation during the preceding calendar year as well as a list of those priority projects for which Higher Education Asset Preservation and Replacement appropriations will be sought in that year's legislative session.",
	"repealed": false
}