{
	"id": "152.136",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.136",
	"title": "152.136 ANHYDROUS AMMONIA; PROHIBITED CONDUCT; CRIMINAL PENALTIES; CIVIL LIABILITY.",
	"text": "As used in this section, \"tamper\" means action taken by a person not authorized to take that action by law or by the owner or authorized custodian of an anhydrous ammonia container or of equipment where anhydrous ammonia is used, stored, distributed, or transported.\n(a) A person may not:\n(1) steal or unlawfully take or carry away any amount of anhydrous ammonia;\n(2) purchase, possess, transfer, or distribute any amount of anhydrous ammonia, knowing, or having reason to know, that it will be used to unlawfully manufacture a controlled substance;\n(3) place, have placed, or possess anhydrous ammonia in a container that is not designed, constructed, maintained, and authorized to contain or transport anhydrous ammonia;\n(4) transport anhydrous ammonia in a container that is not designed, constructed, maintained, and authorized to transport anhydrous ammonia;\n(5) use, deliver, receive, sell, or transport a container designed and constructed to contain anhydrous ammonia without the express consent of the owner or authorized custodian of the container; or\n(6) tamper with any equipment or facility used to contain, store, or transport anhydrous ammonia.\n(b) For the purposes of this subdivision, containers designed and constructed for the storage and transport of anhydrous ammonia are described in rules adopted under section 18C.121, subdivision 1, or in Code of Federal Regulations, title 49.\n(a) Except as provided in paragraph (b), a person tampering with anhydrous ammonia containers or equipment under subdivision 2 shall have no cause of action for damages arising out of the tampering against:\n(1) the owner or lawful custodian of the container or equipment;\n(2) a person responsible for the installation or maintenance of the container or equipment; or\n(3) a person lawfully selling or offering for sale the anhydrous ammonia.\n(b) Paragraph (a) does not apply to a cause of action against a person who unlawfully obtained the anhydrous ammonia or anhydrous ammonia container or who possesses the anhydrous ammonia or anhydrous ammonia container for any unlawful purpose.\nA person who knowingly violates subdivision 2 is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $50,000, or both.",
	"repealed": false
}