{
	"id": "383B.257",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.257",
	"title": "383B.257 COUNTY MAY RUN CENTRAL MOBILE EQUIPMENT DIVISION.",
	"text": "The county board in any county now or hereafter having a population of 600,000 or more may establish and operate a central mobile equipment division upon property owned by any such county.\nThe county board may place the general supervision of the central mobile equipment division under the jurisdiction of the county highway engineer, hereinafter designated the \"county engineer.\" The county board may provide the county engineer with office space, equipment, supplies, and assistants to perform the duties of the office.\nUpon the establishment of the central mobile equipment division, all mobile, maintenance and construction equipment then owned by the county or any department thereof shall be transferred to the central mobile equipment division. Equipment needed by the central mobile equipment division which has not been acquired either by transfer or purchase may be rented until acquired under the provisions of this section.\nIt shall be the duty of the county engineer to provide for the service, maintenance and repair of all equipment transferred to or acquired by the central mobile equipment division, and to make such periodic reports with respect to the operation thereof as the county board may require.\nAny county department or any town, home rule charter or statutory city, school district, or other public corporation within such county that may require the use of any mobile, maintenance or construction equipment within the jurisdiction of the central mobile equipment division may requisition for its use to the central mobile equipment division.\nThe county engineer shall have authority to determine and calculate the cost of furnishing the equipment requisitioned, which cost shall be designated \"rental charge,\" and shall be sufficient to provide for the cost of maintenance, operation, repair, depreciation and replacement of such equipment, and such rental charge shall be paid to the central mobile equipment division by the department, or the town, home rule charter or statutory city, school district, or other public corporation using such equipment.\nThe county engineer shall at the same time and in the same manner as other county departments submit to the county board an annual statement of receipts and disbursements of the central mobile equipment division. Such report shall include the estimated cost of acquiring new construction and maintenance equipment needed by the central mobile equipment division, and the cost of replacing obsolete and outworn equipment. The county board shall examine the report and may appropriate from the general revenue funds of the county the amounts necessary to operate the central mobile equipment division and to purchase new and replace obsolete and outworn construction and maintenance equipment.\nAll contracts and purchases made under the authority of this section shall be made subject to and in compliance with existing laws regulating the manner of purchases and contracts applicable to such county.",
	"repealed": false
}