{
	"id": "14.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.14",
	"title": "14.14 HEARING ON RULE.",
	"text": "When a public hearing is required under section 14.25 or when an agency decides to proceed directly to a public hearing, the agency shall proceed under the provisions of sections 14.14 to 14.20 and hold a public hearing affording all affected interests an opportunity to participate.\n(a) Each agency shall maintain a list of all persons who have registered with the agency for the purpose of receiving notice of rule proceedings. Persons may register to receive notice of rule proceedings by submitting to the agency:\n(1) their electronic mail address; or\n(2) their name and United States mail address.\nThe agency may inquire as to whether those persons on the list wish to remain on it and may remove persons for whom there is a negative reply or no reply within 60 days. The agency shall, at least 30 days before the date set for the hearing, give notice of its intention to adopt rules by United States mail or electronic mail to all persons on its list, and by publication in the State Register. The mailed notice must include either a copy of the proposed rule or an easily readable and understandable description of its nature and effect and an announcement that a free copy of the proposed rule is available on request from the agency. In addition, each agency shall make reasonable efforts to notify persons or classes of persons who may be significantly affected by the rule being proposed by giving notice of its intention in newsletters, newspapers, or other publications, or through other means of communication. The notice in the State Register must include the proposed rule or an amended rule in the form required by the revisor under section 14.07, together with an easily readable and understandable summary of the overall nature and effect of the proposed rule, a citation to the most specific statutory authority for the proposed rule, a statement of the place, date, and time of the public hearing, a statement that persons may register with the agency for the purpose of receiving notice of rule proceedings and notice that the agency intends to adopt a rule and other information required by law or rule. When an entire rule is proposed to be repealed, the agency need only publish that fact, along with an easily readable and understandable summary of the overall nature of the rules proposed for repeal, and a citation to the rule to be repealed.\n(b) The chief administrative law judge may authorize an agency to omit from the notice of rule hearing the text of any proposed rule, the publication of which would be unduly cumbersome, expensive, or otherwise inexpedient if:\n(1) knowledge of the rule is likely to be important to only a small class of persons;\n(2) the notice of rule hearing states that a free copy of the entire rule is available upon request to the agency; and\n(3) the notice of rule hearing states in detail the specific subject matter of the omitted rule, cites the statutory authority for the proposed rule, and details the proposed rule's purpose and motivation.\nWhen a public hearing is conducted on a proposed rule that affects farming operations, at least one public hearing must be conducted in an agricultural area of the state.\nAt the public hearing the agency shall make an affirmative presentation of facts establishing the need for and reasonableness of the proposed rule and fulfilling any relevant substantive or procedural requirements imposed on the agency by law or rule. The agency may, in addition to its affirmative presentation, rely upon facts presented by others on the record during the rule proceeding to support the rule adopted.\nWhen a hearing is held on a proposed rule, it shall be conducted by an administrative law judge assigned by the chief administrative law judge. The administrative law judge shall ensure that all persons involved in the rule hearing are treated fairly and impartially. The agency shall submit into the record the jurisdictional documents, including the statement of need and reasonableness, and any written exhibits in support of the proposed rule. The agency may also present additional oral evidence. Interested persons may present written and oral evidence. The administrative law judge shall allow questioning of agency representatives or witnesses, or of interested persons making oral statements, in order to explain the purpose or intended operation of a proposed rule, or a suggested modification, or for other purposes if material to the evaluation or formulation of the proposed rule. The administrative law judge may limit repetitive or immaterial oral statements and questioning.\nIf the agency, the chief administrative law judge, or the attorney general requests, the administrative law judge shall cause a transcript to be prepared of the hearing.",
	"repealed": false
}