{
	"id": "18B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.36",
	"title": "18B.36 PRIVATE APPLICATOR CERTIFICATION.",
	"text": "(a) Except for a licensed commercial or noncommercial applicator, only a certified private applicator may use a restricted use pesticide to produce an agricultural commodity:\n(1) as a traditional exchange of services without financial compensation;\n(2) on a site owned, rented, or managed by the person or the person's employees; or\n(3) when the private applicator is one of two or fewer employees and the owner or operator is a certified private applicator or is licensed as a noncommercial applicator.\n(b) A person may not purchase a restricted use pesticide without presenting a license card, certified private applicator card, or the card number.\n(c) A person certified under this section is considered qualified and is not required to verify, document, or otherwise prove a particular need prior to use, except as required by the federal label.\n(d) A person certified under this section must be 18 years of age or older.\n(a) The commissioner shall prescribe certification requirements and provide training that meets or exceeds United States Environmental Protection Agency standards to certify private applicators and provide information relating to changing technology to help ensure a continuing level of competency and ability to use pesticides properly and safely. Private applicator certification requirements and training must meet or exceed the competency standards in Code of Federal Regulations, title 40, part 171. Competency standards for private applicator certification and training must be published on the Department of Agriculture website. The training may be done through cooperation with other government agencies and must be a minimum of three hours in duration.\n(b) A person must apply to the commissioner for certification as a private applicator. After completing the certification requirements, which must include a proctored examination as determined by the commissioner, an applicant must be certified as a private applicator to use restricted use pesticides. The certification shall expire March 1 of the third calendar year after the initial year of certification.\n(c) The commissioner shall issue a private applicator card to a private applicator.\n(a) A person applying to be certified as a private applicator must pay a nonrefundable $10 application fee for the certification period.\n(b) A $5 fee must be paid for the issuance of a duplicate private applicator card.",
	"repealed": false
}