{
	"id": "609.685",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.685",
	"title": "609.685 SALE OF TOBACCO TO PERSONS UNDER AGE 21.",
	"text": "For the purposes of this section, the following terms shall have the meanings respectively ascribed to them in this section.\n(a) \"Tobacco\" means cigarettes and any product containing, made, or derived from tobacco that is intended for human consumption, whether chewed, smoked, absorbed, dissolved, inhaled, snorted, sniffed, or ingested by any other means, or any component, part, or accessory of a tobacco product including but not limited to cigars; cheroots; stogies; perique; granulated, plug cut, crimp cut, ready rubbed, and other smoking tobacco; snuff; snuff flour; cavendish; plug and twist tobacco; fine cut and other chewing tobaccos; shorts; refuse scraps, clippings, cuttings and sweepings of tobacco; and other kinds and forms of tobacco. Tobacco excludes any drugs, devices, or combination products, as those terms are defined in the Federal Food, Drug, and Cosmetic Act, that are authorized for sale by the United States Food and Drug Administration.\n(b) \"Tobacco-related devices\" means cigarette papers or pipes for smoking or other devices intentionally designed or intended to be used in a manner which enables the chewing, sniffing, smoking, or inhalation of aerosol or vapor of tobacco or tobacco products. Tobacco-related devices include components of tobacco-related devices which may be marketed or sold separately.\n(c) \"Electronic delivery device\" means any product containing or delivering nicotine, lobelia, or any other substance, whether natural or synthetic, intended for human consumption through inhalation of aerosol or vapor from the product. Electronic delivery device includes but is not limited to devices manufactured, marketed, or sold as electronic cigarettes, electronic cigars, electronic pipe, vape pens, modes, tank systems, or under any other product name or descriptor. Electronic delivery device includes any component part of a product, whether or not marketed or sold separately. Electronic delivery device excludes drugs, devices, or combination products, as those terms are defined in the Federal Food, Drug, and Cosmetic Act, that are authorized for sale by the United States Food and Drug Administration.\n(a) Any person 21 years of age or older who sells, gives, or otherwise furnishes tobacco, tobacco-related devices, or electronic delivery devices to a person under the age of 21 years is guilty of a petty misdemeanor for the first violation. Whoever violates this subdivision a subsequent time within five years of a previous conviction under this subdivision is guilty of a misdemeanor.\n(b) It is an affirmative defense to a charge under this subdivision if the defendant proves by a preponderance of the evidence that the defendant reasonably and in good faith relied on proof of age as described in section 340A.503, subdivision 6.\nA person under the age of 21 years who purchases or attempts to purchase tobacco, tobacco-related devices, or electronic delivery devices and who uses a driver's license, permit, Minnesota identification card, or any type of false identification to misrepresent the person's age, shall only be subject to an alternative civil penalty, in accordance with subdivision 2a.\nLaw enforcement and court system representatives shall consult, as applicable, with interested persons, including but not limited to parents, guardians, educators, and persons under the age of 21 years, to develop alternative civil penalties for persons under the age of 21 years who violate this section. Consulting participants shall consider a variety of alternative civil penalties including but not limited to tobacco-free education programs, community service, court diversion programs, and tobacco cessation programs, and for persons under the age of 18 years, notice to schools and to parents or guardians. Alternative civil penalties developed under this subdivision shall not include fines or monetary penalties.\nMS 2018 [Repealed by amendment, 2020 c 88 s 11]\nNothing in subdivisions 1 to 2a shall supersede or preclude the continuation or adoption of any local ordinance which provides for more stringent regulation of the subject matter in subdivisions 1 to 2a.\n(a) Notwithstanding subdivision 1a, an Indian may furnish tobacco to an Indian under the age of 21 years if the tobacco is furnished as part of a traditional Indian spiritual or cultural ceremony. For purposes of this paragraph, an Indian is a person who is a member of an Indian tribe as defined in section 260.755, subdivision 12.\n(b) The penalties in this section do not apply to a person under the age of 21 years who purchases or attempts to purchase tobacco, tobacco-related devices, or electronic delivery devices while under the direct supervision of a responsible adult for training, education, research, or enforcement purposes.\nA licensee may seize a form of identification listed in section 340A.503, subdivision 6, if the licensee has reasonable grounds to believe that the form of identification has been altered or falsified or is being used to violate any law. A licensee that seizes a form of identification as authorized under this subdivision shall deliver it to a law enforcement agency within 24 hours of seizing it.",
	"repealed": false
}