{
	"id": "356A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/356A.07",
	"title": "356A.07 BENEFIT SUMMARY; ANNUAL REPORTS; ADDITIONAL DUTIES.",
	"text": "The chief administrative officer of a covered pension plan shall prepare and provide each active plan participant with a summary of the benefit provisions of the plan document. The summary must be provided within 30 days of the start or resumption of a participant's membership in the plan, or within 30 days of the date on which the start or resumption of membership was reported to a covered pension plan by a covered governmental entity, whichever is later. The summary must contain a notice that it is a summary of the plan document but is not itself the plan document, and that in the event of a discrepancy between the summary and the plan document as amended, the plan document governs. A copy of the plan document as amended must be furnished to a plan participant or benefit recipient upon request. The chief administrative officer may utilize the services of the covered governmental entity in providing the summary. The summary must be in a form reasonably calculated to be understood by an average plan participant.\nA covered pension plan shall provide each active plan participant and benefit recipient with a copy of the most recent annual financial report required by section 356.20 and a copy of the most recent actuarial evaluation, if any, required by section 356.215, 356.216, or 424A.093, or by Laws 2013, chapter 111, article 5, section 39, or a summary of those reports.\nA covered pension plan may distribute the summaries required by this section through covered governmental entities so long as the plan has made arrangements with the entities to assure, with reasonable certainty, that the summaries will be distributed, or made easily available, to active plan participants.\nIf a review procedure is not specified by law for a covered pension plan, the chief administrative officer of the plan shall propose, and the governing board of the plan shall adopt and implement, a procedure for reviewing a determination of eligibility, benefits, or other rights under the plan that is adverse to a plan participant or benefit recipient. The review procedure must include provisions for timely notice to the plan participant or benefit recipient and reasonable opportunity to be heard in any review proceeding conducted and may, but need not be, a contested case under chapter 14.",
	"repealed": false
}