{
	"id": "62A.318",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.318",
	"title": "62A.318 MEDICARE SELECT POLICIES AND CERTIFICATES.",
	"text": "(a) This section applies to Medicare select policies and certificates, as defined in this section, including those issued by health maintenance organizations.\n(b) No policy or certificate may be advertised as a Medicare select policy or certificate unless it meets the requirements of this section.\nFor the purposes of this section:\n(1) \"complaint\" means any dissatisfaction expressed by an individual concerning a Medicare select issuer or its network providers;\n(2) \"grievance\" means dissatisfaction expressed in writing by an individual insured under a Medicare select policy or certificate with the administration, claims practices, or provision of services concerning a Medicare select issuer or its network providers;\n(3) \"Medicare select issuer\" means an issuer offering, or seeking to offer, a Medicare select policy or certificate;\n(4) \"Medicare select policy\" or \"Medicare select certificate\" means a Medicare supplement policy or certificate that contains restricted network provisions;\n(5) \"network provider\" means a provider of health care, or a group of providers of health care, that has entered into a written agreement with the issuer to provide benefits insured under a Medicare select policy or certificate;\n(6) \"restricted network provision\" means a provision that conditions the payment of benefits, in whole or in part, on the use of network providers; and\n(7) \"service area\" means the geographic area approved by the commissioner within which an issuer is authorized to offer a Medicare select policy or certificate.\nThe commissioner may authorize an issuer to offer a Medicare select policy or certificate pursuant to this section and section 4358 of the Omnibus Budget Reconciliation Act (OBRA) of 1990, Public Law 101-508, if the commissioner finds that the issuer has satisfied all of the requirements of Minnesota Statutes.\nA Medicare select issuer shall not issue a Medicare select policy or certificate in this state until its plan of operation has been approved by the commissioner.\nA Medicare select issuer shall file a proposed plan of operation with the commissioner, in a format prescribed by the commissioner. The plan of operation shall contain at least the following information:\n(1) evidence that all covered services that are subject to restricted network provisions are available and accessible through network providers, including a demonstration that:\n(i) the services can be provided by network providers with reasonable promptness with respect to geographic location, hours of operation, and after-hour care. The hours of operation and availability of after-hour care shall reflect usual practice in the local area. Geographic availability shall reflect the usual travel times within the community;\n(ii) the number of network providers in the service area is sufficient, with respect to current and expected policyholders, either:\n(A) to deliver adequately all services that are subject to a restricted network provision; or\n(B) to make appropriate referrals;\n(iii) there are written agreements with network providers describing specific responsibilities;\n(iv) emergency care is available 24 hours per day and seven days per week; and\n(v) in the case of covered services that are subject to a restricted network provision and are provided on a prepaid basis, there are written agreements with network providers prohibiting the providers from billing or otherwise seeking reimbursement from or recourse against an individual insured under a Medicare select policy or certificate. This section does not apply to supplemental charges or coinsurance amounts as stated in the Medicare select policy or certificate;\n(2) a statement or map providing a clear description of the service area;\n(3) a description of the grievance procedure to be used;\n(4) a description of the quality assurance program, including:\n(i) the formal organizational structure;\n(ii) the written criteria for selection, retention, and removal of network providers; and\n(iii) the procedures for evaluating quality of care provided by network providers, and the process to initiate corrective action when warranted;\n(5) a list and description, by specialty, of the network providers;\n(6) copies of the written information proposed to be used by the issuer to comply with paragraph (i); and\n(7) any other information requested by the commissioner.\nA Medicare select issuer shall file proposed changes to the plan of operation, except for changes to the list of network providers, with the commissioner before implementing the changes. The changes shall be considered approved by the commissioner after 30 days unless specifically disapproved.\nAn updated list of network providers shall be filed with the commissioner at least quarterly.\nA Medicare select policy or certificate shall not restrict payment for covered services provided by nonnetwork providers if:\n(1) the services are for symptoms requiring emergency care or are immediately required for an unforeseen illness, injury, or condition; and\n(2) it is not reasonable to obtain the services through a network provider.\nA Medicare select policy or certificate shall provide payment for full coverage under the policy or certificate for covered services that are not available through network providers.\nA Medicare select issuer shall make full and fair disclosure in writing of the provisions, restrictions, and limitations of the Medicare select policy or certificate to each applicant. This disclosure must include at least the following:\n(1) an outline of coverage sufficient to permit the applicant to compare the coverage and premiums of the Medicare select policy or certificate with:\n(i) other Medicare supplement policies or certificates offered by the issuer; and\n(ii) other Medicare select policies or certificates;\n(2) a description, including address, phone number, and hours of operation, of the network providers, including primary care physicians, specialty physicians, hospitals, and other providers;\n(3) a description of the restricted network provisions, including payments for coinsurance and deductibles when providers other than network providers are used;\n(4) a description of coverage for emergency and urgently needed care and other out-of-service area coverage;\n(5) a description of limitations on referrals to restricted network providers and to other providers;\n(6) a description of the policyholder's rights to purchase any other Medicare supplement policy or certificate otherwise offered by the issuer; and\n(7) a description of the Medicare select issuer's quality assurance program and grievance procedure.\nBefore the sale of a Medicare select policy or certificate, a Medicare select issuer shall obtain from the applicant a signed and dated form stating that the applicant has received the information provided pursuant to paragraph (i) and that the applicant understands the restrictions of the Medicare select policy or certificate.\nA Medicare select issuer shall have and use procedures for hearing complaints and resolving written grievances from the subscribers. The procedures shall be aimed at mutual agreement for settlement and may include arbitration procedures.\n(1) The grievance procedure must be described in the policy and certificates and in the outline of coverage.\n(2) At the time the policy or certificate is issued, the issuer shall provide detailed information to the policyholder describing how a grievance may be registered with the issuer.\n(3) Grievances must be considered in a timely manner and must be transmitted to appropriate decision makers who have authority to fully investigate the issue and take corrective action.\n(4) If a grievance is found to be valid, corrective action must be taken promptly.\n(5) All concerned parties must be notified about the results of a grievance.\n(6) The issuer shall report no later than March 31 of each year to the commissioner regarding the grievance procedure. The report shall be in a format prescribed by the commissioner and shall contain the number of grievances filed in the past year and a summary of the subject, nature, and resolution of the grievances.\nAt the time of initial purchase, a Medicare select issuer shall make available to each applicant for a Medicare select policy or certificate the opportunity to purchase a Medicare supplement policy or certificate otherwise offered by the issuer.\n(a) At the request of an individual insured under a Medicare select policy or certificate, a Medicare select issuer shall make available to the individual insured the opportunity to purchase a Medicare supplement policy or certificate offered by the issuer that has comparable or lesser benefits and that does not contain a restricted network provision. The issuer shall make the policies or certificates available without requiring evidence of insurability after the Medicare select policy or certificate has been in force for six months. If the issuer does not have available for sale a policy or certificate without restrictive network provisions, the issuer shall provide enrollment information for the Minnesota comprehensive health association Medicare supplement plans.\n(b) For the purposes of this subdivision, a Medicare supplement policy or certificate will be considered to have comparable or lesser benefits unless it contains one or more significant benefits not included in the Medicare select policy or certificate being replaced. For the purposes of this paragraph, a significant benefit means coverage for the Medicare Part A deductible, coverage for prescription drugs, coverage for at-home recovery services, or coverage for Part B excess charges. Coverage for outpatient prescription drugs is not permitted in Medicare supplement policies or certificates issued on or after January 1, 2006.\n(a) Medicare select policies and certificates shall provide for continuation of coverage if the secretary of health and human services determines that Medicare select policies and certificates issued pursuant to this section should be discontinued due to either the failure of the Medicare select program to be reauthorized under law or its substantial amendment.\n(b) In the event of a determination under paragraph (a), each Medicare select issuer shall make available to each individual insured under a Medicare select policy or certificate the opportunity to purchase a Medicare supplement policy or certificate offered by the issuer that has comparable or lesser benefits and that does not contain a restricted network provision. The issuer shall make the policies and certificates available without requiring evidence of insurability.\n(c) For the purposes of this subdivision, a Medicare supplement policy or certificate will be considered to have comparable or lesser benefits unless it contains one or more significant benefits not included in the Medicare select policy or certificate being replaced. For the purposes of this subdivision, a significant benefit means coverage for the Medicare Part A deductible, coverage for prescription drugs, coverage for at-home recovery services, or coverage for Part B excess charges. Coverage for outpatient prescription drugs must not be included for sale or issuance of a Medicare supplement policy or certificate issued on or after January 1, 2006.\nA Medicare select issuer shall comply with reasonable requests for data made by state or federal agencies, including the United States Department of Health and Human Services, for the purpose of evaluating the Medicare select program.\nMedicare select policies and certificates under this section shall be regulated and approved by the Department of Commerce.\n(a) Medicare select policies and certificates offered by the issuer must provide the coverages specified in sections 62A.315 to 62A.3165. Before a Medicare select policy or certificate is sold or issued in this state, the applicant must be provided with an explanation of coverage for each of the coverages specified in sections 62A.315 to 62A.3165 and must be provided with the opportunity of purchasing such coverage if offered by the issuer. The basic plan may also include any of the optional benefit riders authorized by section 62A.316. Preventive care provided by Medicare select policies or certificates must be provided as set forth in section 62A.315 or 62A.316, except that the benefits are as defined in chapter 62D.\n(b) Medicare select policies and certificates must provide the benefits contained in this section, but must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual.",
	"repealed": false
}