{
	"id": "268B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.09",
	"title": "268B.09 EMPLOYMENT PROTECTIONS.",
	"text": "(a) An employer must not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for requesting or obtaining benefits or leave, or for exercising any other right under this chapter.\n(b) For the purposes of this section, the term \"leave\" includes but is not limited to:\n(1) leave taken for any day for which the commissioner has determined that the employee is eligible for benefits or leave under this chapter; or\n(2) any day for which the employee meets the eligibility criteria under section 268B.06, subdivision 1, paragraph (a), clauses (2) and (3), or the employee has applied for benefits in good faith under this chapter. For the purposes of this subdivision, \"good faith\" is defined as anything that is not knowingly false or in reckless disregard of the truth.\n(c) In addition to the remedies provided in subdivision 8, the commissioner of labor and industry may also issue a penalty to the employer of not less than $1,000 and not more than $10,000 per violation, payable to the employee aggrieved. In determining the amount of the penalty under this subdivision, the appropriateness of the penalty to the size of the employer's business and the gravity of the violation shall be considered.\n[See Note.]\nAn employer must not obstruct or impede an application for leave or benefits or the exercise of any other right under this chapter. In addition to the remedies provided in subdivision 8, the commissioner of labor and industry may also issue a penalty to the employer of not less than $1,000 and not more than $10,000 per violation, payable to the employee aggrieved. In determining the amount of the penalty under this subdivision, the appropriateness of the penalty to the size of the employer's business and the gravity of the violation shall be considered.\n[See Note.]\n(a) Any agreement to waive, release, or commute rights to benefits or any other right under this chapter is void, except for a voluntary settlement agreement resolving disputed claims or a valid separation agreement releasing putative claims.\n(b) Any provision, whether oral or written, of a lease, contract, or other agreement or instrument that purports to be a waiver by an individual of any right or remedy provided in this chapter is contrary to public policy and void if the waiver or release purports to waive claims arising out of acts or practices that occur after the execution of the waiver or release.\n(c) A waiver or release of rights or remedies secured by this chapter that purports to apply to claims arising out of acts or practices prior to, or concurrent with, the execution of the waiver or release may be rescinded within 15 calendar days of its execution, except that a waiver or release given in settlement of a claim filed with the department or with another administrative agency or judicial body is valid and final upon execution. A waiving or releasing party must be informed in writing of the right to rescind the waiver or release. To be effective, the rescission must be in writing and delivered to the waived or released party by hand, electronically with the receiving party's consent, or by mail within the 15-day period. If delivered by mail, the rescission must be:\n(1) postmarked within the 15-day period;\n(2) properly addressed to the waived or released party; and\n(3) sent by certified mail, return receipt requested.\n[See Note.]\nAny assignment, pledge, or encumbrance of benefits is void, unless otherwise provided in this chapter. Benefits are exempt from levy, execution, attachment, or any other remedy provided for the collection of debt. Any waiver of this subdivision is void.\n[See Note.]\n(a) During any leave for which an employee is entitled to benefits or leave under this chapter, the employer must maintain coverage under any group insurance policy, group subscriber contract, or health care plan for the employee and any dependents as if the employee was not on leave, provided, however, that the employee must continue to pay any employee share of the cost of such benefits.\n(b) This subdivision may be waived for employees who are working in the construction industry under a bona fide collective bargaining agreement that requires employer contributions to a multiemployer health plan pursuant to United States Code, title 29, section 186(c)(5), but only if the waiver is set forth in clear and unambiguous terms in the collective bargaining agreement and explicitly cites this subdivision.\n[See Note.]\n(a) On return from leave under this chapter, an employee is entitled to be returned to the same position the employee held when leave commenced or to an equivalent position with equivalent benefits, pay, and other terms and conditions of employment. Except as provided under subdivision 7, an employee is entitled to reinstatement even if the employee has been replaced or the employee's position has been restructured to accommodate the employee's absence.\n(b)(1) An equivalent position is one that is virtually identical to the employee's former position in terms of pay, benefits, and working conditions, including privileges, prerequisites, and status. It must involve the same or substantially similar duties and responsibilities, which must entail substantially equivalent skill, effort, responsibility, and authority.\n(2) If an employee is no longer qualified for the position because of the employee's inability to attend a necessary course, renew a license, fly a minimum number of hours, or similar condition, as a result of the leave, the employee must be given a reasonable opportunity to fulfill those conditions upon return from leave.\n(c)(1) An employee is entitled to any unconditional pay increases which may have occurred during the leave period, such as cost of living increases. Pay increases conditioned upon seniority, length of service, or work performed must be granted in accordance with the employer's policy, practice, or contract with respect to other employees on an equivalent leave status for a reason that does not qualify for leave under this chapter. An employee is entitled to be restored to a position with the same or equivalent pay premiums, such as a shift differential. If an employee departed from a position for which they receive overtime pay, the employee is ordinarily entitled to a position with overtime pay and overtime hours on return from leave under this chapter. If a pay premium, such as a shift differential, or overtime has been decreased or eliminated for other similarly classified employees, an employee is not entitled to restoration of the pay premium or overtime.\n(2) Equivalent pay includes any bonus or payment, whether it is discretionary or nondiscretionary, made to employees consistent with clause (1). If a bonus or other payment is based on the achievement of a specified goal such as hours worked, products sold, or perfect attendance, and the employee has not met the goal due to leave under this chapter, the payment may be denied, unless otherwise paid to employees on an equivalent leave status for a reason that does not qualify for leave under this chapter.\n(d) Benefits under this section include all benefits provided or made available to employees by an employer, including group life insurance, health insurance, disability insurance, sick leave, annual leave, educational benefits, and pensions, regardless of whether benefits are provided by a practice or written policy of an employer through an employee benefit plan as defined in section 3(3) of United States Code, title 29, section 1002(3).\n(1) At the end of an employee's leave under this chapter, benefits must be resumed in the same manner and at the same levels as provided when the leave began, and subject to any changes in benefit levels that may have taken place during the period of leave affecting the entire workforce, unless otherwise elected by the employee. Upon return from a leave under this chapter, an employee must not be required to requalify for any benefits the employee enjoyed before leave began, including family or dependent coverages.\n(2) An employee may, but is not entitled to, accrue any additional benefits or seniority during a leave under this chapter. Benefits accrued at the time leave began must be available to an employee upon return from leave.\n(3) With respect to pension and other retirement plans, leave under this chapter must not be treated as or counted toward a break in service for purposes of vesting and eligibility to participate. If the plan requires an employee to be employed on a specific date in order to be credited with a year of service for vesting, contributions, or participation purposes, an employee on leave under this chapter must be treated as employed on that date. Periods of leave under this chapter need not be treated as credited service for purposes of benefit accrual, vesting, and eligibility to participate.\n(4) Employees on leave under this chapter must be treated as if they continued to work for purposes of changes to benefit plans. Employees on leave under this chapter are entitled to changes in benefit plans, except those which may be dependent upon seniority or accrual during the leave period, immediately upon return from leave or to the same extent they would have qualified if no leave had been taken.\n(e) An equivalent position must have substantially similar duties, conditions, responsibilities, privileges, and status as the employee's original position.\n(1) The employee must be reinstated to the same or a geographically proximate worksite from where the employee had previously been employed. If the employee's original worksite has been closed, the employee is entitled to the same rights as if the employee had not been on leave when the worksite closed.\n(2) The employee is ordinarily entitled to return to the same shift or the same or an equivalent work schedule.\n(3) The employee must have the same or an equivalent opportunity for bonuses, profit-sharing, and other similar discretionary and nondiscretionary payments, excluding any bonus paid to another employee or employees for covering the work of the employee while the employee was on leave.\n(4) This chapter does not prohibit an employer from accommodating an employee's request to be restored to a different shift, schedule, or position which better suits the employee's personal needs on return from leave, or to offer a promotion to a better position. However, an employee must not be induced by the employer to accept a different position against the employee's wishes.\n(f) The requirement that an employee be restored to the same or equivalent job with the same or equivalent pay, benefits, and terms and conditions of employment does not extend to de minimis, intangible, or unmeasurable aspects of the job.\n(g) Nothing in this section shall be deemed to affect the Americans with Disabilities Act, United States Code, title 42, chapter 126.\n(h) Ninety calendar days from the date of hire, an employee has a right and is entitled to reinstatement as provided under this subdivision for any day for which:\n(1) the employee has been deemed eligible for benefits under this chapter; or\n(2) the employee meets the eligibility criteria under section 268B.06, subdivision 1, paragraph (a), clauses (2) and (3), or the employee has applied for benefits in good faith under this chapter. For the purposes of this paragraph, good faith is defined as anything that is not knowingly false or in reckless disregard of the truth.\n(i) This subdivision and subdivision 7 may be waived for employees who are working in the construction industry under a bona fide collective bargaining agreement with a construction trade union that maintains a referral-to-work procedure for employees to obtain employment with multiple signatory employers, but only if the waiver is set forth in clear and unambiguous terms in the collective bargaining agreement and explicitly cites this subdivision and subdivision 7.\n[See Note.]\nAn employee has no greater right to reinstatement or to other benefits and conditions of employment than if the employee had been continuously employed during the period of leave under this chapter. An employer must be able to show that an employee would not otherwise have been employed at the time reinstatement is requested in order to deny restoration to employment.\n(1) If an employee is laid off during the course of taking a leave under this chapter and employment is terminated, the employer's responsibility to continue the leave, maintain group health plan benefits, and restore the employee cease at the time the employee is laid off, provided the employer has no continuing obligations under a collective bargaining agreement or otherwise. An employer has the burden of proving that an employee would have been laid off during the period of leave under this chapter and, therefore, would not be entitled to restoration to a job slated for layoff when the employee's original position would not meet the requirements of an equivalent position.\n(2) If a shift has been eliminated or overtime has been decreased, an employee would not be entitled to return to work that shift or the original overtime hours upon restoration. However, if a position on, for example, a night shift has been filled by another employee, the employee is entitled to return to the same shift on which employed before taking leave under this chapter.\n(3) If an employee was hired for a specific term or only to perform work on a discrete project, the employer has no obligation to maintain group health plan benefits and restore the employee if the employment term or project is over and the employer would not otherwise have continued to employ the employee.\n[See Note.]\n(a) In addition to any other remedies available to an employee in law or equity, an employer who violates the provisions of this section is liable to any employee affected for:\n(1) damages equal to the amount of:\n(i) any and all damages recoverable by law;\n(ii) reasonable interest on the amount of damages awarded; and\n(iii) an additional amount as liquidated damages equal to the sum of the amount described in item (i) and the interest described in item (ii), except that if an employer who has violated the provisions of this section proves to the satisfaction of the court that the act or omission which violated the provisions of this section was in good faith and that the employer had reasonable grounds for believing that the act or omission was not a violation of the provisions of this section, the court may, in the discretion of the court, reduce the amount of the liability to the amount and interest determined under items (i) and (ii), respectively; and\n(2) such injunctive and other equitable relief as determined by a court or jury, including employment, reinstatement, and promotion.\n(b) An action to recover damages or equitable relief prescribed in paragraph (a) may be maintained against any employer in any federal or state court of competent jurisdiction by any one or more employees for and on behalf of:\n(1) the employees; or\n(2) the employees and other employees similarly situated.\n(c) Rule 23 of the Rules of Civil Procedure applies to this section.\n(d) The court in an action under this section must, in addition to any judgment awarded to the plaintiff or plaintiffs, allow reasonable attorney fees, reasonable expert witness fees, and other costs of the action to be paid by the defendant.\n(e) Nothing in this section shall be construed to allow an employee to recover damages from an employer for the denial of benefits under this chapter by the department, unless the employer unlawfully interfered with the application for benefits under subdivision 2.\n(f) An employee bringing a civil action under this section is entitled to a jury trial. An employee cannot waive their right to a jury trial under this section including, but not limited to, by signing an agreement to submit claims to arbitration.\n[See Note.]",
	"repealed": false
}