{
	"id": "149A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.05",
	"title": "149A.05 CORRECTION ORDERS.",
	"text": "The regulatory agency may issue correction orders that require a person subject to regulation under this chapter to correct violations of this chapter or rules, orders, stipulation agreements, settlements, compliance agreements, licenses, and permits adopted or issued by the regulatory agency.\nThe correction order must include:\n(1) a concise statement of the deficiencies alleged to constitute the violation;\n(2) a reference to the section of law, rule, order, stipulation agreement, settlement, compliance agreement, license, or permit that has been violated;\n(3) a statement of the time by and the manner in which the violation must be corrected; and\n(4) a statement of the right to request a hearing under sections 14.57 to 14.62.\nA request for hearing must be in writing, delivered to the regulatory agency by certified mail within 20 calendar days after the receipt of the correction order, and specifically state the reasons for seeking review of the order. The regulatory agency must initiate a hearing within 30 calendar days from the date of receipt of the written request for hearing. The hearing shall be conducted pursuant to the contested case procedures in sections 14.57 to 14.62. No earlier than ten calendar days after and within 30 calendar days of receipt of the presiding administrative law judge's report, the regulatory agency shall issue a final order modifying, vacating, or making permanent the correction order as the facts require. If, within 20 calendar days of receipt of the correction order, the person that is the subject of the order fails to request a hearing in writing, the correction order becomes the final order of the regulatory agency.\nA judicial review of the final order issued by the regulatory agency subsequent to a contested case hearing may be requested in the manner prescribed in sections 14.63 to 14.69. Failure to request a contested case hearing pursuant to subdivision 3 shall constitute a waiver of the right to further agency or judicial review of the final order.\nIf upon reinspection, or in the determination of the regulatory agency, it is found that any deficiency specified in a correction order has not been corrected by the person that is subject to the correction order, that person or entity is in noncompliance. The regulatory agency shall issue a notice of noncompliance and may impose any additional remedy available under this chapter.",
	"repealed": false
}