{
	"id": "80G.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/80G.10",
	"title": "80G.10 INVESTIGATIONS AND CIVIL ENFORCEMENT.",
	"text": "If the commissioner believes that a person has engaged, is engaging, or is about to engage in an act, practice, or course of business constituting a violation of this chapter or a rule adopted or order issued under this chapter or that a person has, is, or is about to engage in an act, practice, or course of business that materially aids a violation of this chapter or a rule adopted or order issued under this chapter, the commissioner may maintain an action in the district court to enjoin the act, practice, or course of business and to enforce compliance with this chapter or a rule adopted or order issued under this chapter.\nIn an action under this section and on a proper showing, the court may:\n(1) issue a permanent or temporary injunction, restraining order, or declaratory judgment;\n(2) order other appropriate or ancillary relief, which may include:\n(i) an asset freeze, accounting, writ of attachment, writ of general or specific execution, and appointment of a receiver or conservator, that may be the commissioner, for the defendant or the defendant's assets;\n(ii) ordering the commissioner to take charge and control of a defendant's property, including investment accounts and accounts in a depository institution, rents, and profits; to collect debts; and to acquire and dispose of property;\n(iii) imposing a civil penalty up to $10,000 for each violation; an order of rescission, restitution, or disgorgement directed to a person that has engaged in an act, practice, or course of business constituting a violation of this chapter or a rule adopted or order issued under this chapter or the predecessor act; and\n(iv) ordering the payment of prejudgment and postjudgment interest; or\n(3) order such other relief as the court considers appropriate.\nThe commissioner may not be required to post a bond in an action or proceeding under this chapter.\n(a) If the commissioner determines that a person has engaged, is engaged, or is about to engage in an act, practice, or course of conduct constituting a violation of this chapter or a rule adopted or order issued under this chapter or that a person has materially aided, is materially aiding, or is about to materially aid an act, practice, or course of conduct constituting a violation of this chapter or rule adopted or order issued under this chapter the commissioner may:\n(1) issue an order directing the person to cease and desist from engaging in the act, practice, or conduct or to take other action necessary or appropriate to comply with this chapter; or\n(2) issue an order denying, suspending, revoking, or conditioning the registration of the dealer or dealer representative.\n(b) Upon issuance of an order, the commissioner shall promptly serve each person subject to the order with a copy of the order and a notice that the order has been issued. The order must include a statement of the reasons for the order and whether the commissioner will seek a civil penalty or costs of the investigation, and notice that the person must within 30 days of being served with the order, request in writing a hearing and that within 15 days after receipt of a written hearing request from the person, the matter will be scheduled for a hearing. If a person subject to the order does not request a hearing within 30 days after the date of service of the order, the order becomes final as to that person by operation of law. If a hearing is requested, the commissioner, after notice of an opportunity for hearing to each person subject to the order, may modify or vacate the order or extend it until final determination.\n(c) If a hearing is requested pursuant to paragraph (b), a hearing must be held under chapter 14 and a final order may not be issued unless the commissioner makes findings of fact and conclusions of law in a record according to chapter 14. The final order may make final, vacate, or modify the order issued under paragraph (a).\n(d) If a petition for judicial review of a final order is not filed in accordance with chapter 14, the commissioner may file a certified copy of the final order with the clerk of a court of competent jurisdiction. The order so filed has the same effect as a judgment of the court and may be recorded, enforced, or satisfied in the same manner as a judgment of the court.\n(e) If a person does not comply with an order under this section, the commissioner may petition a court of competent jurisdiction to enforce the order. The court may not require the commissioner to post a bond in an action or proceeding under this section. If the court finds, after service and opportunity for hearing, that the person was not in compliance with the order, the court may adjudge the person in civil contempt of the order. The court may impose a further civil penalty against the person for contempt in an amount up to $10,000 for each violation and may grant any other relief the court determines is just and proper in the circumstances.\n(f) In addition to the authority granted under this chapter, the commissioner has all the authority provided under section 45.027 to ensure compliance with this chapter.",
	"repealed": false
}