{
	"id": "168.1293",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1293",
	"title": "168.1293 CERTAIN SPECIAL PLATES; AUTHORIZATION, DISCONTINUANCE.",
	"text": "For purposes of this section, the following terms have the meanings given them:\n(1) \"new special plate\" or \"proposed special plate\" means a special plate that is not authorized under this chapter and for which legislation authorizing the plate, including but not limited to a bill or amendment, is introduced or presented to the legislature; and\n(2) \"proximate special plate\" means a special plate (i) authorized under section 168.12, subdivisions 2b and 2e; 168.1235; or 168.129; or (ii) authorized in law on or after August 1, 2010.\nThe commissioner may only establish a special plate as authorized under this chapter. This requirement does not apply to alternative or additional designs for a special plate.\n(a) A person, legal entity, or other requester, however organized, that plans to seek legislation establishing a new special plate, or is a proponent of a new special plate, shall submit the following information and fee to the commissioner:\n(1) The requester shall submit a request for the special plate being sought, describing the special plate in general terms, the purpose of the plate, and the proposed fee or minimum contribution required for the plate.\n(2) The requester shall submit the results of a scientific sample survey of Minnesota motor vehicle owners that indicates that at least 10,000 motor vehicle owners intend to purchase the proposed plate with the proposed fee or minimum contribution. The requester's plan to undertake the survey must be reported to the commissioner before the survey is undertaken. The survey must be performed independently of the requester by another person or legal entity, however organized, that conducts similar sample surveys in the normal course of business.\n(3) The requester shall submit an application fee of $20,000, to cover the cost of reviewing the application for a new plate and developing the new special plate if authorized by law. State funds may not be used to pay the application fee. This requirement does not apply if legislation or a bill introduced to the legislature proposing the new special plate contains a mechanism by which all costs incurred by the commissioner for development and implementation of the plate are covered, provided that the application fee subsequently does apply if such a mechanism is not enacted in the law authorizing the new special plate.\n(4) The requester shall submit a marketing strategy that contains (i) short-term and long-term marketing plans for the requested plate, and (ii) a financial analysis showing the anticipated revenues and the planned expenditures of any fee or contribution derived from the requested plate.\n(b) The requester shall submit the information required under paragraph (a) to the commissioner at least 120 days before the convening of the next regular legislative session at which the requester will submit the proposal.\n(a) Within 15 days of the introduction of a bill proposing a new special plate, the commissioner shall submit a briefing to the chairs and ranking minority members of the house of representatives and senate committees to which the bill was referred. At a minimum, the briefing must:\n(1) summarize the requirements for a special plate under this section; and\n(2) identify which of the requirements have been met for the proposed special plate.\n(b) If a proposed special plate is a topic of discussion at a legislative committee hearing, the commissioner shall make every reasonable effort to provide testimony. The testimony must include the information required in the briefing under paragraph (a).\n(c) Notwithstanding section 3.195, the commissioner may submit the briefing under paragraph (a) by submitting an electronic version rather than a printed version.\n(a) If the proposed special plate sought by the requester is approved by law, the requester shall submit the proposed design for the plate to the commissioner as soon as practicable, but not later than 120 days after the effective date of the law authorizing issuance of the plate. The commissioner is responsible for selecting the final design for the special plate.\n(b) The requester that originally requested a new special plate subsequently approved by law may not submit a new design for the plate within the five years following the date of first issuance of the plate unless the inventory of those plates has been exhausted. The requester may deplete the remaining inventory of the plates by reimbursing the commissioner for the cost of the plates.\nIf the special plate requested is not authorized in the legislative session at which authorization was sought, the commissioner shall, if applicable, refund $17,500 of the application fee to the requester.\n(a) The commissioner shall discontinue the issuance or renewal of any proximate special plate if (1) fewer than 1,000 sets of those plates are currently registered at the end of the first six years during which the plates are available, or (2) fewer than 1,000 sets of those plates are currently registered at the end of any subsequent two-year period following the first six years of availability.\n(b) The commissioner shall discontinue the issuance or renewal of any proximate special plate, and distribution of any contributions resulting from that plate, if the commissioner determines that (1) the fund or requester receiving the contributions no longer exists, (2) the requester has stopped providing services that are authorized to be funded from the contribution proceeds, (3) the requester has requested discontinuance, or (4) contributions have been used in violation of subdivision 6.\n(c) Nothing in this subdivision applies to plates issued under section 168.123, 168.124, 168.125, or 168.1255.\n(d) Upon commencing discontinuance of a proximate special plate under this subdivision, the commissioner (1) shall not issue the plate, including as a duplicate; and (2) shall allow retention of any existing plate for the regular period. For purposes of this paragraph, \"regular period\" may be, as appropriate, the period specified under section 168.12, subdivision 1; the time until issuance of a duplicate plate for that vehicle; or as otherwise provided by law.\nContributions made as a condition of obtaining a proximate special plate, and interest earned on the contributions, may not be spent for commercial or for-profit purposes.\nThe commissioner shall deposit the application fee under subdivision 2, paragraph (a), clause (3), in the driver and vehicle services operating account under section 299A.705. An amount sufficient to pay the department's cost in implementing and administering this section, including payment of refunds under subdivision 4, is appropriated to the commissioner from that account.\n(a) By February 1 annually, the commissioner must submit a report on special plates to the legislative committees with jurisdiction over transportation policy and finance. At a minimum, the report must:\n(1) identify the number of special plate issuances and total plate counts for each type of special plate, with a breakout by each alternative or additional design; and\n(2) for each special plate in which a onetime or annual contribution is required:\n(i) provide a fiscal summary of the contributions, including to specify the appropriate contribution account, identify total contributions received in the two most recently completed fiscal years, and identify the direct recipients of contribution funds; and\n(ii) provide a description of how contribution funds were spent in the prior fiscal or calendar year, as provided by each direct recipient.\n(b) An entity that receives special plate special contribution funds under this chapter directly from the commissioner must submit information on contribution funds expenditures in the form and manner specified by the commissioner.",
	"repealed": false
}