{
	"id": "245C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.15",
	"title": "245C.15 DISQUALIFYING CRIMES OR CONDUCT.",
	"text": "(a) An individual is disqualified under section 245C.14 if: (1) regardless of how much time has passed since the discharge of the sentence imposed, if any, for the offense; and (2) unless otherwise specified, regardless of the level of the offense, the individual has committed any of the following offenses: sections 243.166 (violation of predatory offender registration law); 609.185 (murder in the first degree); 609.19 (murder in the second degree); 609.195 (murder in the third degree); 609.20 (manslaughter in the first degree); 609.205 (manslaughter in the second degree); a felony offense under 609.221 or 609.222 (assault in the first or second degree); a felony offense under sections 609.2242 and 609.2243 (domestic assault), spousal abuse, child abuse or neglect, or a crime against children; 609.2247 (domestic assault by strangulation); 609.228 (great bodily harm caused by distribution of drugs); 609.245 (aggravated robbery); 609.247, subdivision 2 or 3 (carjacking in the first or second degree); 609.25 (kidnapping); 609.2661 (murder of an unborn child in the first degree); 609.2662 (murder of an unborn child in the second degree); 609.2663 (murder of an unborn child in the third degree); 609.322 (solicitation, inducement, and promotion of prostitution); 609.324, subdivision 1 (other prohibited acts); 609.342 (criminal sexual conduct in the first degree); 609.343 (criminal sexual conduct in the second degree); 609.344 (criminal sexual conduct in the third degree); 609.345 (criminal sexual conduct in the fourth degree); 609.3451 (criminal sexual conduct in the fifth degree); 609.3453 (criminal sexual predatory conduct); 609.3458 (sexual extortion); 609.352 (solicitation of children to engage in sexual conduct); 609.365 (incest); a felony offense under 609.377 (malicious punishment of a child); a felony offense under 609.378 (neglect or endangerment of a child); 609.561 (arson in the first degree); 609.66, subdivision 1e (drive-by shooting); 609.749, subdivision 3, 4, or 5 (felony-level harassment or stalking); 609.855, subdivision 5 (shooting at or in a public transit vehicle or facility); 617.23, subdivision 2, clause (1), or subdivision 3, clause (1) (indecent exposure involving a minor); 617.246 (use of minors in sexual performance prohibited); 617.247 (possession of pictorial representations of minors); or, for a child care background study subject, conviction of a crime that would make the individual ineligible for employment under United States Code, title 42, section 9858f, except for a felony drug conviction, regardless of whether a period of disqualification under subdivisions 2 to 4, would apply if the individual were not a child care background study subject.\n(b) An individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraph (a), as each of these offenses is defined in Minnesota Statutes, permanently disqualifies the individual under section 245C.14.\n(c) An individual's offense in any other state or country, where the elements of the offense are substantially similar to any of the offenses listed in paragraph (a), permanently disqualifies the individual under section 245C.14.\n(d) When a disqualification is based on a judicial determination other than a conviction, the disqualification period begins from the date of the court order. When a disqualification is based on an admission, the disqualification period begins from the date of an admission in court. When a disqualification is based on an Alford Plea, the disqualification period begins from the date the Alford Plea is entered in court. When a disqualification is based on a preponderance of evidence of a disqualifying act, the disqualification date begins from the date of the dismissal, the date of discharge of the sentence imposed for a conviction for a disqualifying crime of similar elements, or the date of the incident, whichever occurs last.\n(e) If the individual studied commits one of the offenses listed in paragraph (a) that is specified as a felony-level only offense, but the sentence or level of offense is a gross misdemeanor or misdemeanor, the individual is disqualified, but the disqualification look-back period for the offense is the period applicable to gross misdemeanor or misdemeanor offenses.\n(f) A child care background study subject shall be disqualified if the individual is registered, or required to be registered, on a state sex offender registry or repository or the National Sex Offender Registry.\n(a) An individual is disqualified under section 245C.14 if: (1) less than 15 years have passed since the discharge of the sentence imposed, if any, for the offense; and (2) the individual has committed a felony-level violation of any of the following offenses: sections 152.021, subdivision 1 or 2b, (aggravated controlled substance crime in the first degree; sale crimes); 152.022, subdivision 1 (controlled substance crime in the second degree; sale crimes); 152.023, subdivision 1 (controlled substance crime in the third degree; sale crimes); 152.024, subdivision 1 (controlled substance crime in the fourth degree; sale crimes); 256.98 (wrongfully obtaining assistance); 268.182 (fraud); 393.07, subdivision 10, paragraph (c) (federal SNAP fraud); 518B.01, subdivision 14 (violation of an order for protection); 609.165 (felon ineligible to possess firearm); 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.215 (suicide); 609.223 or 609.2231 (assault in the third or fourth degree); repeat offenses under 609.224 (assault in the fifth degree); 609.229 (crimes committed for benefit of a gang); 609.2325 (criminal abuse of a vulnerable adult); 609.2335 (financial exploitation of a vulnerable adult); 609.235 (use of drugs to injure or facilitate crime); 609.24 (simple robbery); 609.247, subdivision 4 (carjacking in the third degree); 609.255 (false imprisonment); 609.2664 (manslaughter of an unborn child in the first degree); 609.2665 (manslaughter of an unborn child in the second degree); 609.267 (assault of an unborn child in the first degree); 609.2671 (assault of an unborn child in the second degree); 609.268 (injury or death of an unborn child in the commission of a crime); 609.27 (coercion); 609.275 (attempt to coerce); 609.466 (medical assistance fraud); 609.495 (aiding an offender); 609.498, subdivision 1 or 1b (aggravated first-degree or first-degree tampering with a witness); 609.52 (theft); 609.521 (possession of shoplifting gear); 609.522 (organized retail theft); 609.525 (bringing stolen goods into Minnesota); 609.527 (identity theft); 609.53 (receiving stolen property); 609.535 (issuance of dishonored checks); 609.562 (arson in the second degree); 609.563 (arson in the third degree); 609.582 (burglary); 609.59 (possession of burglary tools); 609.611 (insurance fraud); 609.625 (aggravated forgery); 609.63 (forgery); 609.631 (check forgery; offering a forged check); 609.635 (obtaining signature by false pretense); 609.66 (dangerous weapons); 609.67 (machine guns and short-barreled shotguns); 609.687 (adulteration); 609.71 (riot); 609.713 (terroristic threats); 609.746 (interference with privacy); 609.82 (fraud in obtaining credit); 609.821 (financial transaction card fraud); 617.23 (indecent exposure), not involving a minor; repeat offenses under 617.241 (obscene materials and performances; distribution and exhibition prohibited; penalty); or 624.713 (certain persons not to possess firearms).\n(b) An individual is disqualified under section 245C.14 if less than 15 years has passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraph (a), as each of these offenses is defined in Minnesota Statutes.\n(c) An individual is disqualified under section 245C.14 if less than 15 years has passed since the termination of the individual's parental rights under section 260C.301, subdivision 1, paragraph (b), or subdivision 3.\n(d) An individual is disqualified under section 245C.14 if less than 15 years has passed since the discharge of the sentence imposed for an offense in any other state or country, the elements of which are substantially similar to the elements of the offenses listed in paragraph (a) or since the termination of parental rights in any other state or country, the elements of which are substantially similar to the elements listed in paragraph (c).\n(e) If the individual studied commits one of the offenses listed in paragraph (a), but the sentence or level of offense is a gross misdemeanor or misdemeanor, the individual is disqualified but the disqualification look-back period for the offense is the period applicable to the gross misdemeanor or misdemeanor disposition.\n(f) When a disqualification is based on a judicial determination other than a conviction, the disqualification period begins from the date of the court order. When a disqualification is based on an admission, the disqualification period begins from the date of an admission in court. When a disqualification is based on an Alford Plea, the disqualification period begins from the date the Alford Plea is entered in court. When a disqualification is based on a preponderance of evidence of a disqualifying act, the disqualification date begins from the date of the dismissal, the date of discharge of the sentence imposed for a conviction for a disqualifying crime of similar elements, or the date of the incident, whichever occurs last.\n(a) An individual is disqualified under section 245C.14 if: (1) less than ten years have passed since the discharge of the sentence imposed, if any, for the offense; and (2) the individual has committed a gross misdemeanor-level violation of any of the following offenses: sections 256.98 (wrongfully obtaining assistance); 260B.425 (criminal jurisdiction for contributing to status as a juvenile petty offender or delinquency); 260C.425 (criminal jurisdiction for contributing to need for protection or services); 268.182 (fraud); 393.07, subdivision 10, paragraph (c) (federal SNAP fraud); 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.221 or 609.222 (assault in the first or second degree); 609.223 or 609.2231 (assault in the third or fourth degree); 609.224 (assault in the fifth degree); 609.224, subdivision 2, paragraph (c) (assault in the fifth degree by a caregiver against a vulnerable adult); 609.2242 and 609.2243 (domestic assault); 609.23 (mistreatment of persons confined); 609.231 (mistreatment of residents or patients); 609.2325 (criminal abuse of a vulnerable adult); 609.233 (criminal neglect of a vulnerable adult); 609.2335 (financial exploitation of a vulnerable adult); 609.234 (failure to report maltreatment of a vulnerable adult); 609.265 (abduction); 609.275 (attempt to coerce); 609.324, subdivision 1a (other prohibited acts; minor engaged in prostitution); 609.33 (disorderly house); 609.377 (malicious punishment of a child); 609.378 (neglect or endangerment of a child); 609.466 (medical assistance fraud); 609.52 (theft); 609.522 (organized retail theft); 609.525 (bringing stolen goods into Minnesota); 609.527 (identity theft); 609.53 (receiving stolen property); 609.535 (issuance of dishonored checks); 609.582 (burglary); 609.59 (possession of burglary tools); 609.611 (insurance fraud); 609.631 (check forgery; offering a forged check); 609.66 (dangerous weapons); 609.71 (riot); 609.72, subdivision 3 (disorderly conduct against a vulnerable adult); 609.749, subdivision 2 (harassment); 609.82 (fraud in obtaining credit); 609.821 (financial transaction card fraud); 617.23 (indecent exposure), not involving a minor; 617.241 (obscene materials and performances); 617.243 (indecent literature, distribution); 617.293 (harmful materials; dissemination and display to minors prohibited); or Minnesota Statutes 2012, section 609.21; or violation of an order for protection under section 518B.01, subdivision 14.\n(b) An individual is disqualified under section 245C.14 if less than ten years has passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraph (a), as each of these offenses is defined in Minnesota Statutes.\n(c) An individual is disqualified under section 245C.14 if less than ten years has passed since the discharge of the sentence imposed for an offense in any other state or country, the elements of which are substantially similar to the elements of any of the offenses listed in paragraph (a).\n(d) If the individual studied commits one of the offenses listed in paragraph (a), but the sentence or level of offense is a misdemeanor disposition, the individual is disqualified but the disqualification lookback period for the offense is the period applicable to misdemeanors.\n(e) When a disqualification is based on a judicial determination other than a conviction, the disqualification period begins from the date of the court order. When a disqualification is based on an admission, the disqualification period begins from the date of an admission in court. When a disqualification is based on an Alford Plea, the disqualification period begins from the date the Alford Plea is entered in court. When a disqualification is based on a preponderance of evidence of a disqualifying act, the disqualification date begins from the date of the dismissal, the date of discharge of the sentence imposed for a conviction for a disqualifying crime of similar elements, or the date of the incident, whichever occurs last.\n(a) An individual is disqualified under section 245C.14 if: (1) less than seven years has passed since the discharge of the sentence imposed, if any, for the offense; and (2) the individual has committed a misdemeanor-level violation of any of the following offenses: sections 256.98 (wrongfully obtaining assistance); 260B.425 (criminal jurisdiction for contributing to status as a juvenile petty offender or delinquency); 260C.425 (criminal jurisdiction for contributing to need for protection or services); 268.182 (fraud); 393.07, subdivision 10, paragraph (c) (federal SNAP fraud); 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.221 (assault in the first degree); 609.222 (assault in the second degree); 609.223 (assault in the third degree); 609.2231 (assault in the fourth degree); 609.224 (assault in the fifth degree); 609.2242 (domestic assault); 609.2335 (financial exploitation of a vulnerable adult); 609.234 (failure to report maltreatment of a vulnerable adult); 609.2672 (assault of an unborn child in the third degree); 609.27 (coercion); violation of an order for protection under 609.3232 (protective order authorized; procedures; penalties); 609.466 (medical assistance fraud); 609.52 (theft); 609.522 (organized retail theft); 609.525 (bringing stolen goods into Minnesota); 609.527 (identity theft); 609.53 (receiving stolen property); 609.535 (issuance of dishonored checks); 609.611 (insurance fraud); 609.66 (dangerous weapons); 609.665 (spring guns); 609.746 (interference with privacy); 609.79 (obscene or harassing telephone calls); 609.795 (letter, telegram, or package; opening; harassment); 609.82 (fraud in obtaining credit); 609.821 (financial transaction card fraud); 617.23 (indecent exposure), not involving a minor; 617.293 (harmful materials; dissemination and display to minors prohibited); or Minnesota Statutes 2012, section 609.21; or violation of an order for protection under section 518B.01 (Domestic Abuse Act).\n(b) An individual is disqualified under section 245C.14 if less than seven years has passed since a determination or disposition of the individual's:\n(1) failure to make required reports under section 260E.06 or 626.557, subdivision 3, for incidents in which: (i) the final disposition under section 626.557 or chapter 260E was substantiated maltreatment, and (ii) the maltreatment was recurring or serious; or\n(2) substantiated serious or recurring maltreatment of a minor under chapter 260E, a vulnerable adult under section 626.557, or serious or recurring maltreatment in any other state, the elements of which are substantially similar to the elements of maltreatment under section 626.557 or chapter 260E for which: (i) there is a preponderance of evidence that the maltreatment occurred, and (ii) the subject was responsible for the maltreatment.\n(c) An individual is disqualified under section 245C.14 if less than seven years has passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraphs (a) and (b), as each of these offenses is defined in Minnesota Statutes.\n(d) An individual is disqualified under section 245C.14 if less than seven years has passed since the discharge of the sentence imposed for an offense in any other state or country, the elements of which are substantially similar to the elements of any of the offenses listed in paragraphs (a) and (b).\n(e) When a disqualification is based on a judicial determination other than a conviction, the disqualification period begins from the date of the court order. When a disqualification is based on an admission, the disqualification period begins from the date of an admission in court. When a disqualification is based on an Alford Plea, the disqualification period begins from the date the Alford Plea is entered in court. When a disqualification is based on a preponderance of evidence of a disqualifying act, the disqualification date begins from the date of the dismissal, the date of discharge of the sentence imposed for a conviction for a disqualifying crime of similar elements, or the date of the incident, whichever occurs last.\n(f) An individual is disqualified under section 245C.14 if less than seven years has passed since the individual was disqualified under section 256.98, subdivision 8.\n(a) Notwithstanding subdivisions 1 to 4, for a background study affiliated with a licensed family foster setting, regardless of how much time has passed, an individual is disqualified under section 245C.14 if the individual committed an act that resulted in a felony-level conviction for sections: 609.185 (murder in the first degree); 609.19 (murder in the second degree); 609.195 (murder in the third degree); 609.20 (manslaughter in the first degree); 609.205 (manslaughter in the second degree); 609.2112 (criminal vehicular homicide); 609.221 (assault in the first degree); 609.223, subdivision 2 (assault in the third degree, past pattern of child abuse); 609.223, subdivision 3 (assault in the third degree, victim under four); a felony offense under sections 609.2242 and 609.2243 (domestic assault, spousal abuse, child abuse or neglect, or a crime against children); 609.2247 (domestic assault by strangulation); 609.2325 (criminal abuse of a vulnerable adult resulting in the death of a vulnerable adult); 609.245 (aggravated robbery); 609.247, subdivision 2 or 3 (carjacking in the first or second degree); 609.25 (kidnapping); 609.255 (false imprisonment); 609.2661 (murder of an unborn child in the first degree); 609.2662 (murder of an unborn child in the second degree); 609.2663 (murder of an unborn child in the third degree); 609.2664 (manslaughter of an unborn child in the first degree); 609.2665 (manslaughter of an unborn child in the second degree); 609.267 (assault of an unborn child in the first degree); 609.2671 (assault of an unborn child in the second degree); 609.268 (injury or death of an unborn child in the commission of a crime); 609.322, subdivision 1 (solicitation, inducement, and promotion of prostitution; sex trafficking in the first degree); 609.324, subdivision 1 (other prohibited acts; engaging in, hiring, or agreeing to hire minor to engage in prostitution); 609.342 (criminal sexual conduct in the first degree); 609.343 (criminal sexual conduct in the second degree); 609.344 (criminal sexual conduct in the third degree); 609.345 (criminal sexual conduct in the fourth degree); 609.3451 (criminal sexual conduct in the fifth degree); 609.3453 (criminal sexual predatory conduct); 609.3458 (sexual extortion); 609.352 (solicitation of children to engage in sexual conduct); 609.377 (malicious punishment of a child); 609.378 (neglect or endangerment of a child); 609.561 (arson in the first degree); 609.582, subdivision 1 (burglary in the first degree); 609.746 (interference with privacy); 617.23 (indecent exposure); 617.246 (use of minors in sexual performance prohibited); or 617.247 (possession of pictorial representations of minors).\n(b) Notwithstanding subdivisions 1 to 4, for the purposes of a background study affiliated with a licensed family foster setting, an individual is disqualified under section 245C.14, regardless of how much time has passed, if the individual:\n(1) committed an action under paragraph (e) that resulted in death or involved sexual abuse, as defined in section 260E.03, subdivision 20;\n(2) committed an act that resulted in a gross misdemeanor-level conviction for section 609.3451 (criminal sexual conduct in the fifth degree);\n(3) committed an act against or involving a minor that resulted in a felony-level conviction for: section 609.222 (assault in the second degree); 609.223, subdivision 1 (assault in the third degree); 609.2231 (assault in the fourth degree); or 609.224 (assault in the fifth degree); or\n(4) committed an act that resulted in a misdemeanor or gross misdemeanor-level conviction for section 617.293 (dissemination and display of harmful materials to minors).\n(c) Notwithstanding subdivisions 1 to 4, for a background study affiliated with a licensed family foster setting, an individual is disqualified under section 245C.14 if fewer than 20 years have passed since the termination of the individual's parental rights under section 260C.301, subdivision 1, paragraph (b), or if the individual consented to a termination of parental rights under section 260C.301, subdivision 1, paragraph (a), to settle a petition to involuntarily terminate parental rights. An individual is disqualified under section 245C.14 if fewer than 20 years have passed since the termination of the individual's parental rights in any other state or country, where the conditions for the individual's termination of parental rights are substantially similar to the conditions in section 260C.301, subdivision 1, paragraph (b).\n(d) Notwithstanding subdivisions 1 to 4, for a background study affiliated with a licensed family foster setting, an individual is disqualified under section 245C.14 if fewer than five years have passed since a felony-level violation for sections: 152.021 (controlled substance crime in the first degree); 152.022 (controlled substance crime in the second degree); 152.023 (controlled substance crime in the third degree); 152.024 (controlled substance crime in the fourth degree); 152.025 (controlled substance crime in the fifth degree); 152.0261 (importing controlled substances across state borders); 152.0262, subdivision 1, paragraph (b) (possession of substance with intent to manufacture methamphetamine); 152.027, subdivision 6, paragraph (c) (sale or possession of synthetic cannabinoids); 152.096 (conspiracies prohibited); 152.097 (simulated controlled substances); 152.136 (anhydrous ammonia; prohibited conduct; criminal penalties; civil liabilities); 152.137 (methamphetamine-related crimes involving children or vulnerable adults); 169A.24 (felony first-degree driving while impaired); 243.166 (violation of predatory offender registration requirements); 609.2113 (criminal vehicular operation; bodily harm); 609.2114 (criminal vehicular operation; unborn child); 609.228 (great bodily harm caused by distribution of drugs); 609.2325 (criminal abuse of a vulnerable adult not resulting in the death of a vulnerable adult); 609.233 (criminal neglect); 609.235 (use of drugs to injure or facilitate a crime); 609.24 (simple robbery); 609.247, subdivision 4 (carjacking in the third degree); 609.322, subdivision 1a (solicitation, inducement, and promotion of prostitution; sex trafficking in the second degree); 609.498, subdivision 1 (tampering with a witness in the first degree); 609.498, subdivision 1b (aggravated first-degree witness tampering); 609.562 (arson in the second degree); 609.563 (arson in the third degree); 609.582, subdivision 2 (burglary in the second degree); 609.66 (felony dangerous weapons); 609.687 (adulteration); 609.713 (terroristic threats); 609.749, subdivision 3, 4, or 5 (felony-level harassment or stalking); 609.855, subdivision 5 (shooting at or in a public transit vehicle or facility); or 624.713 (certain people not to possess firearms).\n(e) Notwithstanding subdivisions 1 to 4, except as provided in paragraph (a), for a background study affiliated with a licensed family child foster care license, an individual is disqualified under section 245C.14 if fewer than five years have passed since:\n(1) a felony-level violation for an act not against or involving a minor that constitutes: section 609.222 (assault in the second degree); 609.223, subdivision 1 (assault in the third degree); 609.2231 (assault in the fourth degree); or 609.224, subdivision 4 (assault in the fifth degree);\n(2) a violation of an order for protection under section 518B.01, subdivision 14;\n(3) a determination or disposition of the individual's failure to make required reports under section 260E.06 or 626.557, subdivision 3, for incidents in which the final disposition under chapter 260E or section 626.557 was substantiated maltreatment and the maltreatment was recurring or serious;\n(4) a determination or disposition of the individual's substantiated serious or recurring maltreatment of a minor under chapter 260E, a vulnerable adult under section 626.557, or serious or recurring maltreatment in any other state, the elements of which are substantially similar to the elements of maltreatment under chapter 260E or section 626.557 and meet the definition of serious maltreatment or recurring maltreatment;\n(5) a gross misdemeanor-level violation for sections: 609.224, subdivision 2 (assault in the fifth degree); 609.2242 and 609.2243 (domestic assault); 609.233 (criminal neglect); 609.377 (malicious punishment of a child); 609.378 (neglect or endangerment of a child); 609.746 (interference with privacy); 609.749 (stalking); or 617.23 (indecent exposure); or\n(6) committing an act against or involving a minor that resulted in a misdemeanor-level violation of section 609.224, subdivision 1 (assault in the fifth degree).\n(f) For purposes of this subdivision, the disqualification begins from:\n(1) the date of the alleged violation, if the individual was not convicted;\n(2) the date of conviction, if the individual was convicted of the violation but not committed to the custody of the commissioner of corrections; or\n(3) the date of release from prison, if the individual was convicted of the violation and committed to the custody of the commissioner of corrections.\nNotwithstanding clause (3), if the individual is subsequently reincarcerated for a violation of the individual's supervised release, the disqualification begins from the date of release from the subsequent incarceration.\n(g) An individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraphs (a) and (b), as each of these offenses is defined in Minnesota Statutes, permanently disqualifies the individual under section 245C.14. An individual is disqualified under section 245C.14 if fewer than five years have passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraphs (d) and (e).\n(h) An individual's offense in any other state or country, where the elements of the offense are substantially similar to any of the offenses listed in paragraphs (a) and (b), permanently disqualifies the individual under section 245C.14. An individual is disqualified under section 245C.14 if fewer than five years have passed since an offense in any other state or country, the elements of which are substantially similar to the elements of any offense listed in paragraphs (d) and (e).\n(a) An individual is disqualified under section 245C.14 if: (1) less than five years have passed since the discharge of the sentence imposed, if any, for the offense; and (2) the individual has committed a felony, gross misdemeanor, or misdemeanor-level violation of any of the following offenses: section 152.021, subdivision 2 or 2a (controlled substance possession crime in the first degree; methamphetamine manufacture crime); 152.022, subdivision 2 (controlled substance possession crime in the second degree); 152.023, subdivision 2 (controlled substance possession crime in the third degree); 152.024, subdivision 2 (controlled substance possession crime in the fourth degree); 152.025 (controlled substance crime in the fifth degree); 152.0261 (importing controlled substances across state borders); 152.0262 (possession of substances with intent to manufacture methamphetamine); 152.027, subdivision 6, paragraph (c) (sale of synthetic cannabinoids); 152.096 (conspiracy to commit controlled substance crime); or 152.097 (simulated controlled substances).\n(b) An individual is disqualified under section 245C.14 if less than five years have passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraph (a), as each of these offenses is defined in Minnesota Statutes.\n(c) An individual is disqualified under section 245C.14 if less than five years have passed since the discharge of the sentence imposed for an offense in any other state or country, the elements of which are substantially similar to the elements of any of the offenses listed in paragraph (a).\n(d) When a disqualification is based on a judicial determination other than a conviction, the disqualification period begins from the date of the court order. When a disqualification is based on an admission, the disqualification period begins from the date of an admission in court. When a disqualification is based on an Alford plea, the disqualification period begins from the date the Alford plea is entered in court. When a disqualification is based on a preponderance of evidence of a disqualifying act, the disqualification date begins from the date of the dismissal, the date of discharge of the sentence imposed for a conviction for a disqualifying crime of similar elements, or the date of the incident, whichever occurs last.\nThe commissioner may not disqualify an individual subject to a background study under this chapter because that individual has, or has had, a mental illness as defined in section 245.462, subdivision 20.\nThe commissioner may not disqualify an individual subject to a background study under this chapter for accessing or providing reproductive health care services, as defined in section 147.091, subdivision 1c.",
	"repealed": false
}