{
	"id": "21.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.72",
	"title": "21.72 DEFINITIONS.",
	"text": "As used in sections 21.73 to 21.78, the terms defined in this section have the meanings given them.\n[Repealed, 1996 c 310 s 1]\n\"Vendor\" means any person who sells any weed-seed infested agricultural seeds and grains, or screenings.\n\"Sell\" when applying to weed-seed infested agricultural seeds and grains, or screenings, and samples thereof, shall be construed as including:\n(1) the act of selling, transferring ownership;\n(2) the offering and exposing for sale, exchange, distribution, giving away, and transportation in, and into, this state;\n(3) the having in possession with intent to sell, exchange, distribute, give away, or transport in, and into, this state;\n(4) the storing, carrying, and handling in aid of traffic therein, whether done in person or through an agent, employee, or others; and\n(5) receiving, accepting, and holding on consignment for sale.\n\"Advertisement\" means all representation disseminated in any manner or by any means relating to weed-seed infested agricultural seeds and grains, or screenings, within the scope of sections 21.71 to 21.78.\n\"Consumer\" refers to any person that uses for the purpose of feeding any weed-seed infested agricultural seeds and grains, or screenings.\n\"Record\" includes all information relating to the shipment, or shipments, involved in a lot of weed-seed infested agricultural seeds and grains, or screenings.\n\"Lot\" means a definite quantity of weed-seed infested agricultural seeds and grains, or screenings, which can be definitely identified.\n\"Seizure\" means a legal process carried out by court order against a definite amount of weed-seed infested agricultural seeds and grains, or screenings.\n\"Stop-sale\" means an administrative order provided by law restraining the sale, use, disposition, and movement of a definite amount of weed-seed infested agricultural seeds and grains, or screenings.\n\"Screenings\" means chaff, florets, immature or broken seed, weed seeds, inert matter, and other foreign material removed in any way from any seeds or grains in any kind of cleaning and processing, or obtained from any other source.\n\"Agricultural seeds and grains\" includes the seeds of grass, forage, cereal, and fiber crops and any other kinds of seeds commonly recognized within this state as agricultural or field seeds, lawn seeds, and mixtures of such seeds.\n\"Weed seeds\" includes the seeds of all plants generally recognized as weeds within this state, including noxious weed seeds.\n\"Noxious weed seeds\" includes restricted and prohibited noxious weed seeds as defined in subdivisions 15 and 16.\n\"Restricted weed seeds\" are those weed seeds placed on the list provided under section 21.85, subdivision 15.\n\"Prohibited noxious weed seeds\" are those weed seeds placed on the list provided under section 21.85, subdivision 15.",
	"repealed": false
}