{
	"id": "29.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/29.21",
	"title": "29.21 DEFINITIONS.",
	"text": "The word \"person\" when used in sections 29.21 to 29.27 means any individual, firm, partnership, corporation, company, association, joint stock association, and shall include any officer, employee, agent, trustee, receiver, assignee, or other similar representative thereof, provided that neither a producer of eggs when selling shell eggs produced on a farm occupied and cultivated by the producer, nor a hatchery which produces or purchases shell eggs solely for hatching shall be deemed a \"person.\"\n[Repealed, 1996 c 310 s 1]\nThe word \"department\" means the Department of Agriculture unless otherwise indicated.\n\"Checks\" means eggs that have cracks or breaks in the shell but have intact shell membranes that do not leak.\n\"Dirties\" means eggs with adhering dirt, foreign material, prominent stains, or moderate stains covering more than 1/32 of the shell surface, if localized, or 1/16 of the shell surface, if scattered.\n\"Egg handler\" means a person who buys, sells, transports, stores, processes, or in any other way receives or has shell eggs. This includes farmers who sell candled and graded eggs off their premises.\n\"Grading\" means assigning an identifying classification to a group of eggs that demonstrates that those eggs have the same degree of quality.\n\"Incubator rejects\" means eggs that have been subjected to incubation and have been removed during the hatching operation as infertile or otherwise unhatchable.\n\"Leakers\" means eggs that have a crack or break in the shell and shell membrane to the extent that the contents pass or are free to pass through the shell.\n\"Loss\" means eggs that are unfit for human consumption because they are smashed, broken, leaking, overheated, frozen, contaminated, or incubator rejects, or because they contain bloody whites, large meat spots, a large quantity of blood, or other foreign material.\n\"Restricted eggs\" means eggs that contain dirties, checks, leakers, inedibles, loss, and incubator rejects.",
	"repealed": false
}