{
	"id": "35.0662",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.0662",
	"title": "35.0662 TEMPORARY EMERGENCY RESTRICTIONS HEARING.",
	"text": "If the board determines that a person is not reasonably likely to abide by the disease control measures established by the board, the board may request a court hearing to determine if the emergency temporary restrictions should continue. The court shall schedule the hearing as expeditiously as possible. When the board requests a court hearing under this section, restrictions under section 35.0661, subdivision 3, continue to apply to the person until the court has held the temporary emergency restrictions hearing and issues an order.\nIf the board requests a court hearing pursuant to this section, notice of the hearing must be served upon the person or persons to be restricted at least 24 hours before the hearing.\nThe notice must contain the following information:\n(1) the time, date, and place of the hearing;\n(2) the grounds and underlying facts upon which continued restrictions are sought;\n(3) the person's right to appear by electronic means at the hearing and the right to have a representative appear in person at the hearing;\n(4) the person's right to present and cross-examine witnesses; and\n(5) the person's right to counsel, including the right, if the person is indigent, to representation by counsel designated by the court or county of venue.\nThe court may order the continued restriction on the movement of the person if it finds, by a preponderance of the evidence, that travel outside of the quarantine zone by the person would pose an imminent threat of transporting a dangerous, infectious, or communicable disease outside of the boundaries of the quarantine zone. If the person agrees to sign and comply with the acknowledgment form referred to in section 35.0661, subdivision 3, the temporary restrictions must not continue longer than 30 days. If the person refuses to sign and comply with the acknowledgment form, the temporary restrictions may continue for a longer time specified by the court. Refusal by the person to sign and comply with the acknowledgment form constitutes a knowing violation of section 35.0661 and subjects the person to the penalties specified in section 35.96.",
	"repealed": false
}