{
	"id": "219.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.40",
	"title": "219.40 DANGEROUS CROSSING DETERMINATION PROCEDURES AND REMEDIES.",
	"text": "(a) If a complaint is made under section 219.39, the commissioner of transportation shall determine, after investigation by the commissioner or after hearing, whether the crossing is hazardous and may require the railroad company to (1) provide flaggers at the crossing, (2) adopt safety devices as the commissioner deems necessary to protect the crossing properly, (3) remove any structure, embankment, or other obstruction to the view, (4) close the crossing complained of or other crossing in the vicinity, or (5) construct an overhead or maintain an underground crossing and divide the cost between the railroad company, the town, county, municipal corporation, or state Transportation Department interested, on terms and conditions as may seem just and equitable.\n(b) The commissioner may require the complaining city, town, or county to remove an embankment, structure, or other obstruction to the view as may be reasonable and necessary to properly protect the crossing.\nIf the complainant road authority or the railroad files exceptions to an order of the commissioner made under this section without a hearing, the commissioner shall convene a hearing on the original complaint.\nIf the commissioner or its designee after notice and hearing orders (1) the installation of a safety device, (2) the construction, reconstruction, modernization, or replacement of major parts, as defined by rule of the commissioner, of the safety devices, gates, or other types of special protection, (3) the removal of a structure, embankment, or other obstruction to the view, or (4) the construction, reconstruction, or maintenance of an underground or overhead crossing on a public road, street, or highway, it may in the same order direct that the costs be divided between the railroad company and the public authority involved as the parties may agree, or, if they fail to agree, then as determined by the commissioner on the basis of benefit to the users of each. However, the commissioner may defer determination of the division of costs to a subsequent order to be made on the basis of evidence previously taken.\n(a) If a state trunk highway is involved, the state's share of the costs must be paid from funds available to the Department of Transportation.\n(b) In all other cases the public's share of the costs must be paid from available funds or from the trunk highway fund, if ordered by the commissioner, or from any combination of these funds or other available funds; provided that a highway, street, or road fund must only be expended for the costs on a highway, street, or road within the political subdivision charged with its maintenance and care and only upon the highways, streets, or roads for which the fund was allocated or created.",
	"repealed": false
}