{
	"id": "174.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.56",
	"title": "174.56 REPORT ON MAJOR HIGHWAY PROJECTS, TRUNK HIGHWAY FUND EXPENDITURES, AND EFFICIENCIES.",
	"text": "(a) The commissioner of transportation shall submit a report by December 15 of each year on (1) the status of major highway projects completed during the previous two years or under construction or planned during the year of the report and for the ensuing 15 years, (2) trunk highway fund expenditures, and (3) efficiencies achieved during the previous two fiscal years.\n(b) For purposes of this section, a \"major highway project\" is a highway project that has a total cost for all segments that the commissioner estimates at the time of the report to be at least (1) $15,000,000 in the metropolitan highway construction district, or (2) $5,000,000 in any nonmetropolitan highway construction district.\nFor each major highway project the report must include:\n(1) a description of the project sufficient to specify its scope and location;\n(2) a history of the project, including, but not limited to, previous official actions by the department or the appropriate area transportation partnership, or both, the date on which the project was first included in the state transportation improvement plan, the cost of the project at that time, the planning estimate for the project, the engineer's estimate, the award price, the final cost as of six months after substantial completion, including any supplemental agreements and cost overruns or cost savings, the dates of environmental approval, the dates of municipal approval, the date of final geometric layout, and the date of establishment of any construction limits;\n(3) the project's priority listing or rank within its construction district, if any, as well as the reasons for that listing or rank, the criteria used in prioritization or rank, any changes in that prioritization or rank since the project was first included in a department work plan, and the reasons for those changes;\n(4) past and potential future reasons for delay in letting or completing the project, details of all project cost changes that exceed $500,000, and specific modifications to the overall program that are made as a result of delays and project cost changes;\n(5) two representative trunk highway construction projects, one each from the department's metropolitan district and from greater Minnesota, and for each project report the cost of environmental mitigation and compliance; and\n(6) the annual budget for products and services for each Department of Transportation district and office, with comparison to actual spending and including measures of productivity for the previous fiscal year.\nThe commissioner shall include in the report information on the total expenditures from the trunk highway fund during the previous fiscal year, for each Department of Transportation district, in the following categories: road construction; planning; design and engineering; labor; compliance with environmental regulations; administration; acquisition of right-of-way, including costs for attorney fees and other compensation for property owners; litigation costs, including payment of claims, settlements, and judgments; maintenance; and road operations.\nThe commissioner shall prepare and submit the report with existing department staff and resources.\nThe commissioner must maintain an Internet website that displays information for each major highway project. At a minimum, the information must include the report contents identified in subdivision 2.",
	"repealed": false
}