{
	"id": "115A.9302",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.9302",
	"title": "115A.9302 WASTE DEPOSIT; DISCLOSURE.",
	"text": "(a) By January 1, 1994, and at least annually thereafter between January 1 and March 31, a person that collects construction debris, industrial waste, or mixed municipal solid waste for transportation to a waste facility shall disclose to each waste generator from whom waste is collected the name, location, and type of, and the number of the permit issued by the agency, or its counterpart in another state, if applicable, for the processing or disposal facility or facilities, excluding a transfer station, at which the waste will be deposited. The collector shall note the approximate percentage of waste deposited at each of the two primary facilities used for the type of waste collected from the generator in the county in which the generator generates the waste and any alternative facilities regularly used by the collector for the type of waste collected from the generator in the county in which the generator generates the waste.\n(b) All written disclosures must include the following statement:\n\"You may be responsible for any liability that results from contamination at a facility where your waste has been deposited. Minnesota believes that its waste management system provides substantially more financial and environmental protection than depositing waste in landfills in other states. Managing your waste in Minnesota may minimize your potential liability.\"\nAll oral disclosures must include the following statement:\n\"You may be responsible for any liability that results from contamination at a facility where your waste has been deposited. Minnesota believes that its waste management system offers more protection from liability than the waste management systems of other states.\"\n(c) If any of the primary or alternative disposal facilities identified by the collector in paragraph (a) are not located in Minnesota, the disclosure must state \"The landfill to which your waste may be sent during the current calendar year is not a Minnesota landfill.\"\n(a) A collector shall make the disclosure to the waste generator in writing at least once per year between January 1 and March 31 and on any written contract for collection services for that year. The written disclosure must include all of the information described in subdivision 1. The oral disclosure required in this section need only include the statement required in subdivision 1, paragraph (b), and the statement required in subdivision 1, paragraph (c), if that paragraph applies. If the license issued by the county to the collector for collection within the county does not require the collector to submit a copy of the disclosure to the county, the collector shall submit a copy to the commissioner by March 31 of each year.\n(b) An oral disclosure is only required with regard to the collection of mixed municipal solid waste. A collector must provide the required disclosure orally to a waste generator at the time the generator agrees to purchase regular collection service and must provide written disclosure to the generator within 45 days from the date of request. This oral disclosure is not required if the city or county within which the waste is generated selects the collector that may provide collection services to the generator.\n(c) If a collector provides onetime or occasional service to a waste generator, the collector must orally provide the generator with the required disclosure at the time the generator agrees to purchase the service. The collector shall then provide written disclosure to the generator within 45 days from the date of request.\n(d) If an additional facility becomes either a primary facility or an alternative facility during the year, the collector shall make the disclosure set forth in subdivision 1 within 30 days. A local government unit that collects solid waste without direct charges to waste generators shall make the disclosure on any statement that includes an amount for waste management, provided that, at a minimum, disclosure to waste generators must be made at least twice annually in a form likely to be available to all generators.\n(e) The agency may develop standard disclosure forms containing the information that is required in this section. Collectors may use the form developed by the agency.\nIf the collector deposits waste at a transfer station, the collector need not disclose the name and location of the transfer station but must disclose the destination of the waste when it leaves the transfer station.",
	"repealed": false
}