{
	"id": "297H.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.05",
	"title": "297H.05 SELF-HAULERS.",
	"text": "(a) A self-hauler of mixed municipal solid waste shall pay the tax to the operator of the waste management facility to which the waste is delivered at the rate imposed under section 297H.03, based on the sales price of the waste management services.\n(b) A self-hauler of nonmixed municipal solid waste shall pay the tax to the operator of the waste management facility to which the waste is delivered at the rate imposed under section 297H.04.\n(c) The tax imposed on the self-hauler of nonmixed municipal solid waste may be based either on the capacity of the container, the actual volume, or the weight-to-volume conversion schedule in paragraph (d). However, the tax must be calculated by the operator using the same method for calculating the tipping fee so that both are calculated according to container capacity, actual volume, or weight.\n(d) The tax for:\n(1) construction debris as defined in section 115A.03, subdivision 7, is equal to 60 cents per cubic yard. The commissioner of revenue, after consultation with the commissioner of the Pollution Control Agency, shall determine and publish by notice a weight-to-volume conversion schedule for construction debris;\n(2) industrial waste as defined in section 115A.03, subdivision 13a, is equal to 60 cents per cubic yard. The commissioner of revenue, after consultation with the commissioner of the Pollution Control Agency, shall determine and publish by notice a weight-to-volume conversion schedule for various industrial wastes; and\n(3) infectious waste as defined in section 116.76, subdivision 12, and pathological waste as defined in section 116.76, subdivision 14, is 150 pounds equals one cubic yard, or 60 cents per 150 pounds.\n(e) For mixed municipal solid waste the tax is imposed upon the difference between the market price and the tip fee at a processing or disposal facility if the tip fee is less than the market price and the political subdivision subsidizes the cost of service at the facility. The political subdivision is liable for the tax.",
	"repealed": false
}