{
	"id": "120B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.36",
	"title": "120B.36 SCHOOL ACCOUNTABILITY.",
	"text": "(a) The commissioner shall report:\n(1) student academic performance data under section 120B.35, subdivisions 2 and 3;\n(2) academic progress consistent with federal expectations;\n(3) school safety and student engagement and connection under section 120B.35, subdivision 3, paragraph (d);\n(4) rigorous coursework under section 120B.35, subdivision 3, paragraph (c);\n(5) the percentage of students under section 120B.35, subdivision 3, paragraph (b), clause (2), whose progress and performance levels are meeting career and college readiness benchmarks under sections 120B.307 and 120B.35, subdivision 3, paragraph (e);\n(6) longitudinal data on the progress of eligible districts in reducing disparities in students' academic achievement and realizing racial and economic integration under section 124D.861;\n(7) the acquisition of English, and where practicable, native language academic literacy, including oral academic language, and the academic progress of all English learners enrolled in a Minnesota public school course or program who are currently or were previously counted as English learners under section 124D.59;\n(8) two separate student-to-teacher ratios that clearly indicate the definition of teacher consistent with sections 122A.06 and 122A.15 for purposes of determining these ratios;\n(9) staff characteristics excluding salaries;\n(10) student enrollment demographics;\n(11) foster care status, including all students enrolled in a Minnesota public school course or program who are currently or were previously in foster care, student homelessness, and district mobility; and\n(12) extracurricular activities.\n(b) The school performance report for a school site and a school district must include school performance reporting information and calculate proficiency rates as required by the most recently reauthorized Elementary and Secondary Education Act.\n(c) The commissioner shall develop, annually update, and post on the department website school performance reports consistent with paragraph (a) and section 120B.11.\n(d) The commissioner must make available performance reports by the beginning of each school year.\n(e) A school or district may appeal its results in a form and manner determined by the commissioner and consistent with federal law. The commissioner's decision to uphold or deny an appeal is final.\n(f) School performance data are nonpublic data under section 13.02, subdivision 9, until the commissioner publicly releases the data. The commissioner shall annually post school performance reports to the department's public website no later than September 1, except in years when the reports reflect new performance standards. The commissioner shall post the school performance reports no later than October 1 in years with new performance standards for academic standards-based assessments, and no later than November 1 in years with new performance standards adopted under Minnesota Rules, part 3501.1200, for English language proficiency assessments.\n(a) All data the department receives, collects, or creates under section 120B.11, governing comprehensive achievement and civic readiness, or uses to determine federal expectations under the most recently reauthorized Elementary and Secondary Education Act and determine student growth, learning, and outcomes under section 120B.35 are nonpublic data under section 13.02, subdivision 9, until the commissioner publicly releases the data.\n(b) Districts must provide parents sufficiently detailed summary data to permit parents to appeal under the most recently reauthorized federal Elementary and Secondary Education Act. The commissioner shall annually post federal expectations and state student growth, learning, and outcome data to the department's public website no later than September 1, except that in years when data or federal expectations reflect new performance standards, the commissioner shall post data on federal expectations and state student growth data no later than October 1.",
	"repealed": false
}