{
	"id": "97A.255",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.255",
	"title": "97A.255 PROSECUTIONS.",
	"text": "A prosecution under the game and fish laws may not be brought more than three years after commission of the offense.\n(a) In a prosecution that alleges animals have been taken, bought, sold, transported, or possessed in violation of the game and fish laws, the burden of establishing that the animals were domesticated, reared in a private preserve, raised in a private fish hatchery or aquatic farm, taken for scientific purposes, lawfully taken, or received as a gift, is on the defendant.\n(b) The commissioner may by rule prescribe the documentation or other evidence sufficient to demonstrate lawful possession of:\n(1) a wild animal received as a gift; and\n(2) a wild animal taken on an Indian reservation or in another state, province, or country.\n[Repealed, 1987 c 149 art 1 s 54]\n(a) Except as allowed in paragraph (b), each wild animal unlawfully taken, bought, sold, transported, or possessed is a separate offense. If acquitted, a person may not be prosecuted for a similar offense involving another animal in the same incident.\n(b) In any prosecution that involves two or more offenses committed by the same person within six months in two or more counties, the accused may be prosecuted in any county in which one of the offenses was committed for all of the offenses in aggregate.\nWhen two or more people intentionally aid, advise, counsel, conspire with, or act in concert with each other to unlawfully take, transport, or possess wild animals when the restitution value of the wild animals exceeds $500, each person is jointly and severally liable for the wild animals for purposes of:\n(1) license seizure, invalidation, and revocation under sections 97A.420 and 97A.421;\n(2) equipment and property seizure under section 97A.221;\n(3) boat, motor, and trailer seizure under section 97A.225; and\n(4) restitution under section 97A.341.\n[See Note.]",
	"repealed": false
}