{
	"id": "125A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.18",
	"title": "125A.18 SPECIAL INSTRUCTION; NONPUBLIC SCHOOLS.",
	"text": "No resident of a district who is eligible for special instruction and services under this section may be denied instruction and service on a shared time basis consistent with section 126C.19, subdivision 4, because of attending a nonpublic school defined in section 123B.41, subdivision 9. If a resident pupil with a disability attends a nonpublic school located within the district of residence, the district must provide necessary transportation for that pupil within the district between the nonpublic school and the educational facility where special instruction and services are provided on a shared time basis. If a resident pupil with a disability attends a nonpublic school located in another district and if no agreement exists under section 126C.19, subdivision 1 or 2, for providing special instruction and services on a shared time basis to that pupil by the district of attendance and where the special instruction and services are provided within the district of residence, the district of residence must provide necessary transportation for that pupil between the boundary of the district of residence and the educational facility. The district of residence may provide necessary transportation for that pupil between its boundary and the nonpublic school attended, but the nonpublic school must pay the cost of transportation provided outside the district boundary.\nParties serving students on a shared time basis have access to the due process hearing system described under United States Code, title 20, and the complaint system under Code of Federal Regulations, title 34, section 300.660-662. In the event it is determined under these systems that the nonpublic school or staff impeded the public school district's provision of a free appropriate education, the commissioner may withhold public funds available to the nonpublic school proportionally applicable to that student under section 123B.42.",
	"repealed": false
}