{
	"id": "239.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.051",
	"title": "239.051 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n\"Advanced biofuel\" has the meaning given in Public Law 110-140, title 2, subtitle A, section 201.\n\"Airport\" has the meaning given it in section 360.013, subdivision 39.\n\"ASTM\" means the American Society for Testing and Materials, a private organization that utilizes committees of industry representatives and regulators to develop product quality standards and test methods to be used by industries, regulatory agencies, and purchasing agents.\n\"ASTM specification\" means a standard quality specification developed and published by the American Society for Testing and Materials. Each specification includes references to standard test methods, also developed and published by ASTM.\nFor the purpose of enforcing the gasoline octane requirements in section 239.792, \"automotive fuel\" has the meaning given it in Code of Federal Regulations, title 16, section 306.0.\n\"Biofuel\" means a renewable fuel with an approved pathway under authority of the federal Energy Policy Act of 2005, Public Law 109-58, as amended by the federal Energy Independence and Security Act of 2007, Public Law 110-140, and approved for sale by the United States Environmental Protection Agency. The term \"biofuel\" includes both advanced and conventional biofuels.\n\"Collector vehicle\" means a motor vehicle for which the commissioner of public safety has issued a pioneer license, classic car license, collector license, or street rod license under section 168.10, or a motor vehicle registered as a collector vehicle in another state.\n\"Commissioner\" means the commissioner of the Department of Commerce.\n\"Conventional biofuel\" means ethanol derived from cornstarch, as defined in Public Law 110-140, title 2, subtitle A, section 201.\n\"Correct,\" when used in connection with weights and measures, means conformance with the applicable requirements of this chapter, and rules adopted under the authority granted by this chapter.\n\"Department\" means the Department of Commerce.\n\"Director\" means the director of the Division of Weights and Measures of the Department of Commerce.\n\"Dispenser\" means a device designed to measure and deliver liquid petroleum products used as fuel.\n\"Distributor\" means a person who is licensed by the Department of Revenue, under the requirements of section 296A.03, to manufacture, refine, receive, distribute, sell, or use petroleum products in Minnesota.\n\"Division\" means the Division of Weights and Measures of the Department of Commerce.\n\"EPA\" means the United States Environmental Protection Agency.\n\"Ethanol blender\" means a person who blends and distributes, transports, sells, or offers to sell gasoline containing ethanol.\n\"Gasoline\" has the meaning given it in section 296A.01, subdivision 23.\n\"Marina\" has the meaning given it in section 86A.20, subdivision 5.\n\"Metrology\" means the science and practice of precise measurement, including measurement of mass, length, volume, and temperature.\n\"Mooring facility\" has the meaning given it in section 86A.20, subdivision 3.\n\"Motorcycle\" has the meaning given it in section 168.002, subdivision 19.\n\"Net weight\" means the weight of a commodity excluding materials, substances, or items not considered to be part of the commodity. Materials, substances, or items not considered to be part of the commodity include, but are not limited to, containers, conveyances, bags, wrappers, packaging materials, labels, individual piece coverings, decorative accompaniments, and coupons.\n\"Oxygenate\" means agriculturally derived, denatured ethanol, ETBE, MTBE, or other alcohol or ether, approved as an oxygenate by the United States Environmental Protection Agency.\n\"Oxygenated gasoline\" means gasoline that has been blended with agriculturally derived denatured ethanol or with another oxygenate approved by the United States Environmental Protection Agency.\n\"Package\" means a commodity put up or packaged in advance of sale in units suitable for either wholesale or retail sale.\n\"Person,\" means person or persons, corporation, partnership, stock company, society, association, or the agent or employee thereof.\n\"Person responsible for the product\" means a person or persons, corporation, partnership, stock company, society, association, or its agent or employee who processes, blends, holds, stores, imports, transfers, distributes, offers for sale or use, or sells petroleum products in Minnesota and who possesses petroleum products at the time they are sampled or inspected by the director.\n\"Petroleum product\" and \"product\" mean all of the products defined in section 296A.01, subdivisions 2, 7, 8, 10, 14, 16, 19, 20, 22 to 26, 28, 32, and 35.\n\"Primary standards\" means the physical standards of the state that serve as the legal reference from which all other standards and weights and measures are derived.\n\"Refinery\" or \"terminal\" means a petroleum refinery, pipeline terminal, river terminal, storage facility, or other point of origin where liquefied petroleum gas or petroleum products are manufactured, or imported by rail, truck, barge, or pipe; and held, stored, transferred, offered for distribution, distributed, offered for sale, or sold. For the purpose of restricting petroleum product blending, this definition includes all refineries and terminals within and outside of Minnesota, but does not include a licensed distributor's bulk storage facility that is used to store petroleum products for which the petroleum inspection fee charged under this chapter is either not due or has been paid.\n\"Resort\" has the meaning given it in section 157.15, subdivision 11.\n\"Sale from bulk\" means the sale of commodities when the quantity is determined at the time of the sale.\n\"Sample\" means a sample of a petroleum product taken from a dispenser or storage tank by the division or a sample of a petroleum product provided to the division by a licensed distributor.\n\"Secondary standards\" means the physical standards that are used in enforcing weights and measures laws. These standards must be traceable to the primary standards.\n\"Snowmobile\" has the meaning given it in section 84.81, subdivision 3.\n\"Traceability\" and \"traceable\" mean:\n(1) the ability to relate individual measurement results, through an unbroken chain of calibrations, to the United States national standards maintained by the United States Department of Commerce, National Institute of Standards and Technology; and\n(2) the ability to produce evidence on a continuing basis to demonstrate that the measurement processes used by the division are producing results within the limits of uncertainty designated by the National Institute of Standards and Technology.\n\"Weight\" means net weight when it is used in connection with a commodity sold by weight.\n\"Weights and measures\" mean weights and measures of every kind, instruments and devices for weighing and measuring, and appliances and accessories associated with these instruments and devices.",
	"repealed": false
}