{
	"id": "144A.4795",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.4795",
	"title": "144A.4795 HOME CARE PROVIDER RESPONSIBILITIES; STAFF.",
	"text": "All staff providing home care services must: (1) be trained and competent in the provision of home care services consistent with current practice standards appropriate to the client's needs; and (2) be informed of the home care bill of rights under section 144A.44.\n(a) Licensed health professionals and nurses providing home care services as an employee of a licensed home care provider must possess a current Minnesota license or registration to practice.\n(b) Licensed health professionals and registered nurses must be competent in assessing client needs, planning appropriate home care services to meet client needs, implementing services, and supervising staff if assigned.\n(c) Nothing in this section limits or expands the rights of nurses or licensed health professionals to provide services within the scope of their licenses or registrations, as provided by law.\n(a) Unlicensed personnel providing basic home care services must have:\n(1) successfully completed a training and competency evaluation appropriate to the services provided by the home care provider and the topics listed in subdivision 7, paragraph (b); or\n(2) demonstrated competency by satisfactorily completing a written or oral test on the tasks the unlicensed personnel will perform and in the topics listed in subdivision 7, paragraph (b); and successfully demonstrated competency of topics in subdivision 7, paragraph (b), clauses (5), (7), and (8), by a practical skills test.\nUnlicensed personnel providing home care services for a basic home care provider may not perform delegated nursing or therapy tasks.\n(b) Unlicensed personnel performing delegated nursing tasks for a comprehensive home care provider must:\n(1) have successfully completed training and demonstrated competency by successfully completing a written or oral test of the topics in subdivision 7, paragraphs (b) and (c), and a practical skills test on tasks listed in subdivision 7, paragraphs (b), clauses (5) and (7), and (c), clauses (3), (5), (6), and (7), and all the delegated tasks they will perform;\n(2) satisfy the current requirements of Medicare for training or competency of home health aides or nursing assistants, as provided by Code of Federal Regulations, title 42, section 483 or 484.36; or\n(3) have, before April 19, 1993, completed a training course for nursing assistants that was approved by the commissioner.\n(c) Unlicensed personnel performing therapy or treatment tasks delegated or assigned by a licensed health professional must meet the requirements for delegated tasks in subdivision 4 and any other training or competency requirements within the licensed health professional scope of practice relating to delegation or assignment of tasks to unlicensed personnel.\nA registered nurse or licensed health professional may delegate tasks only to staff who are competent and possess the knowledge and skills consistent with the complexity of the tasks and according to the appropriate Minnesota practice act. The comprehensive home care provider must establish and implement a system to communicate up-to-date information to the registered nurse or licensed health professional regarding the current available staff and their competency so the registered nurse or licensed health professional has sufficient information to determine the appropriateness of delegating tasks to meet individual client needs and preferences.\nWhen a home care provider contracts with an individual contractor excluded from licensure under section 144A.471 to provide home care services, the contractor must meet the same requirements required by this section for personnel employed by the home care provider.\nWhen a home care provider contracts with a temporary staffing agency excluded from licensure under section 144A.471, those individuals must meet the same requirements required by this section for personnel employed by the home care provider and shall be treated as if they are staff of the home care provider.\n(a) Instructors and competency evaluators must meet the following requirements:\n(1) training and competency evaluations of unlicensed personnel providing basic home care services must be conducted by individuals with work experience and training in providing home care services listed in section 144A.471, subdivisions 6 and 7; and\n(2) training and competency evaluations of unlicensed personnel providing comprehensive home care services must be conducted by a registered nurse, or another instructor may provide training in conjunction with the registered nurse. If the home care provider is providing services by licensed health professionals only, then that specific training and competency evaluation may be conducted by the licensed health professionals as appropriate.\n(b) Training and competency evaluations for all unlicensed personnel must include the following:\n(1) documentation requirements for all services provided;\n(2) reports of changes in the client's condition to the supervisor designated by the home care provider;\n(3) basic infection control, including blood-borne pathogens;\n(4) maintenance of a clean and safe environment;\n(5) appropriate and safe techniques in personal hygiene and grooming, including:\n(i) hair care and bathing;\n(ii) care of teeth, gums, and oral prosthetic devices;\n(iii) care and use of hearing aids; and\n(iv) dressing and assisting with toileting;\n(6) training on the prevention of falls for providers working with the elderly or individuals at risk of falls;\n(7) standby assistance techniques and how to perform them;\n(8) medication, exercise, and treatment reminders;\n(9) basic nutrition, meal preparation, food safety, and assistance with eating;\n(10) preparation of modified diets as ordered by a licensed health professional;\n(11) communication skills that include preserving the dignity of the client and showing respect for the client and the client's preferences, cultural background, and family;\n(12) awareness of confidentiality and privacy;\n(13) understanding appropriate boundaries between staff and clients and the client's family;\n(14) procedures to utilize in handling various emergency situations; and\n(15) awareness of commonly used health technology equipment and assistive devices.\n(c) In addition to paragraph (b), training and competency evaluation for unlicensed personnel providing comprehensive home care services must include:\n(1) observation, reporting, and documenting of client status;\n(2) basic knowledge of body functioning and changes in body functioning, injuries, or other observed changes that must be reported to appropriate personnel;\n(3) reading and recording temperature, pulse, and respirations of the client;\n(4) recognizing physical, emotional, cognitive, and developmental needs of the client;\n(5) safe transfer techniques and ambulation;\n(6) range of motioning and positioning; and\n(7) administering medications or treatments as required.\n(d) When the registered nurse or licensed health professional delegates tasks, they must ensure that prior to the delegation the unlicensed personnel is trained in the proper methods to perform the tasks or procedures for each client and are able to demonstrate the ability to competently follow the procedures and perform the tasks. If an unlicensed personnel has not regularly performed the delegated home care task for a period of 24 consecutive months, the unlicensed personnel must demonstrate competency in the task to the registered nurse or appropriate licensed health professional. The registered nurse or licensed health professional must document instructions for the delegated tasks in the client's record.",
	"repealed": false
}