{
	"id": "211A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/211A.02",
	"title": "211A.02 FINANCIAL REPORT.",
	"text": "(a) A committee or a candidate who receives contributions or makes disbursements of more than $750 in a calendar year shall submit an initial report to the filing officer within 14 days after the candidate or committee receives or makes disbursements of more than $750 and must continue to make the reports required by this subdivision until a final report is filed.\n(b) In a year in which a candidate receives contributions or makes disbursements of more than $750 or the candidate's name appears on the ballot, the candidate must file a report:\n(1) ten days before the primary or special primary if a primary is held in the jurisdiction, regardless of whether the candidate is on the primary ballot. If a primary is not conducted, the report is due ten days before the primary date specified in section 205.065;\n(2) ten days before the general election or special election; and\n(3) 30 days after a general or special election.\nThe reporting obligations in this paragraph begin with the first report due after the reporting period in which the candidate reaches the spending threshold specified in paragraph (a). A candidate who did not file for office is not required to file reports required by this paragraph that are due after the end of the filing period. A candidate whose name will not be on the general election ballot is not required to file the reports required by clauses (2) and (3).\n(c) Until a final report is filed, a candidate must file a report by January 31 of each year. Notwithstanding subdivision 2, clause (4), the report required by this subdivision must only include the information from the previous calendar year.\nThe report to be filed by a candidate or committee must include:\n(1) the name of the candidate and office sought;\n(2) the printed name, address, telephone number, signature, and email address, if available, of the person responsible for filing the report;\n(3) the total cash on hand designated to be used for political purposes;\n(4) the total amount of contributions received and the total amount of disbursements for the period from the last previous report to five days before the current report is due;\n(5) if disbursements made to the same vendor exceed $100 in the aggregate during the period covered by the report, the name and address for the vendor and the amount, date, and purpose for each disbursement; and\n(6) the name, address, and employer, or occupation if self-employed, of any individual or entity that during the period covered by the report has made one or more contributions that in the aggregate exceed $100, and the amount and date of each contribution. The filing officer must restrict public access to the address of any individual who has made a contribution that exceeds $100 and who has filed with the filing officer a written statement signed by the individual that withholding the individual's address from the financial report is required for the safety of the individual or the individual's family.\nThe provisions of this section requiring the filing of reports are in addition to the provisions of any municipal charter requiring the filing of reports in connection with a municipal primary, general election, special primary, or special election, but they do not replace special laws providing filing requirements for a municipality.\nMS 2022 [Repealed, 2024 c 112 art 4 s 28]\n[See Note.]\nThe reports required by this section may be filed electronically, subject to the approval of the filing officer.\n(a) The filing officer of a local government shall make all reports required to be filed with the local government under this section available on the local government's website, if the local government maintains a website. The filing officer must post the reports on the local government's website as soon as possible, but no later than 30 days after receipt of the report. The local government must make the reports available on the local government's website for four years from the date the report was posted to the website.\n(b) The filing officer shall provide the Campaign Finance and Public Disclosure Board with the link to the section of the website where reports are made available pursuant to paragraph (a). The Campaign Finance and Public Disclosure Board shall publish on its website each link that a filing officer provides pursuant to this paragraph.\n(c) This subdivision does not apply to a statutory or home rule charter city or town if the statutory or home rule charter city or town has fewer than 400 registered voters as of January 1 of the year in which the election is to be held.",
	"repealed": false
}