{
	"id": "256S.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.20",
	"title": "256S.20 CUSTOMIZED LIVING SERVICES; POLICY.",
	"text": "(a) To deliver customized living services or 24-hour customized living services, a provider must:\n(1) be licensed as an assisted living facility under chapter 144G; or\n(2) be licensed as a comprehensive home care provider under chapter 144A, be delivering services in a setting exempted from assisted living facility licensure under section 144G.08, subdivision 7, clauses (10) to (13), and meet standards in the federally approved home and community-based waiver plans under this chapter or section 256B.49. A licensed home care provider is subject to section 256B.0651, subdivision 14.\n(b) Settings exempted from assisted living facility licensure under section 144G.08, subdivision 7, clauses (10) to (13), must comply with section 325F.722.\nMS 2020 [Repealed, 1Sp2021 c 7 art 13 s 79]\nThe lead agency, with input from the provider of customized living services and within the parameters established by the commissioner, shall ensure that there is a documented need for all authorized customized living or 24-hour customized living component services.\n(a) The lead agency shall not authorize 24-hour customized living services unless the participant receiving customized living services requires assistance, including 24-hour supervision, due to needs related to one or more of the following:\n(1) intermittent assistance with toileting, positioning, or transferring;\n(2) cognitive or behavioral issues;\n(3) a medical condition that requires clinical monitoring; or\n(4) the need for medication management, at least 50 hours of services per month, and a dependency in at least three of the following activities of daily living as determined by assessment under section 256B.0911: bathing, dressing, grooming, walking, or eating when the dependency score in eating is three or greater.\n(b) The lead agency must document the need for 24-hour supervision.\n(c) The lead agency shall ensure that the frequency and mode of supervision of the participant and the qualifications of staff providing supervision are described and meet the needs of the participant.\nA provider of customized living services or 24-hour customized living services must not bill or otherwise charge a participant or the participant's family for: (1) additional units of any allowable component service beyond those available under the service rate limits described in section 256S.202, or (2) additional units of any allowable component service beyond those component services in the customized living service plan approved by the lead agency.",
	"repealed": false
}