{
	"id": "176.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.471",
	"title": "176.471 REVIEW BY SUPREME COURT ON CERTIORARI.",
	"text": "Where the Workers' Compensation Court of Appeals has made an award or disallowance of compensation or other order, a party in interest who acts within 30 days from the date the party was served with notice of the order may have the order reviewed by the supreme court on certiorari upon one of the following grounds:\n(1) the order does not conform with this chapter;\n(2) the Workers' Compensation Court of Appeals committed any other error of law; or\n(3) the findings of fact and order were unsupported by substantial evidence in view of the entire record as submitted.\nWhere cause is shown within the 30-day period referred to in subdivision 1, the supreme court may extend the time for seeking review on certiorari. The supreme court may also extend the time for filing any other paper which this chapter requires to be filed with that court.\nTo effect a review upon certiorari, the party shall serve a writ of certiorari upon the administrator of the Workers' Compensation Court of Appeals within the 30-day period referred to in subdivision 1. The party shall also at this time pay to the clerk of the appellate courts the fee prescribed by rule 116.03 of the Rules of Civil Appellate Procedure.\nThe writ of certiorari required by subdivision 3 shall show that a review is to be had in the supreme court of the proceedings of the Workers' Compensation Court of Appeals upon which the order is based.\nThe Workers' Compensation Court of Appeals may, upon motion of any respondent and a showing that extraordinary circumstances warrant the requirement of a cost bond, order that a bond be provided as prescribed by rule 107.02 of the Rules of Civil Appellate Procedure.\nWhen the writ of certiorari has been served upon the administrator of the Workers' Compensation Court of Appeals, the bond has been filed, and the filing fee has been paid, the administrator shall immediately transmit to the clerk of the appellate courts that filing fee and the return to the writ of certiorari and bond.\nFiling such return and payment of the filing fee referred to in subdivision 6 vests the supreme court with jurisdiction of the case.\nWithin 30 days after the writ of certiorari, bond, and filing fee have been filed with the administrator of the Workers' Compensation Court of Appeals, the administrator shall transmit to the clerk of the appellate courts a true and complete return of the proceedings of the Workers' Compensation Court of Appeals under review, or the part of those proceedings necessary to allow the supreme court to review properly the questions presented.\nThe Workers' Compensation Court of Appeals shall certify the return of the proceedings under its seal. The petitioner or relator shall pay to the administrator of the Workers' Compensation Court of Appeals the reasonable expense of preparing the return.\nWhen the return of the proceedings before the Workers' Compensation Court of Appeals has been filed with the clerk of the appellate courts, the supreme court shall hear and dispose of the matter as in other civil cases.\nThe supreme court may adopt rules which are consistent with this chapter and necessary or convenient to the impartial and speedy disposition of these cases.",
	"repealed": false
}