{
	"id": "342.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.185",
	"title": "342.185 TRUE PARTY OF INTEREST.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Control\" means the power to independently order or direct the management, managers, or policies of a cannabis business.\n(c) \"Financial institution\" means any bank, mutual savings bank, consumer loan company, credit union, savings and loan association, trust company, or other lending institution under the jurisdiction of the Minnesota Department of Commerce, the United States Department of Commerce, or both.\n(d) \"Financier\" means any person that:\n(1) is not a financial institution or government entity;\n(2) provides money as a gift, grant, or loan to an applicant for a cannabis business license, a cannabis business, or both; and\n(3) expects to be repaid for the money provided, with or without reasonable interest.\n(e) \"Gross profit\" means sales minus the cost of goods sold.\n(f) \"Revenue\" means the income generated from the sale of goods and services associated with the main operations of a business before any costs or expenses have been deducted.\n(g) \"True party of interest\" means an individual who as an individual or as part of another business:\n(1) is a sole proprietor of a sole proprietorship;\n(2) is a partner in a general partnership;\n(3) is a general partner or limited partner in a limited partnership, a limited liability partnership, or a limited liability limited partnership;\n(4) is a member of a limited liability company or a manager in a limited liability company;\n(5) is a corporate officer or director or holds an equivalent title in a privately held corporation;\n(6) is a stockholder in a privately held corporation;\n(7) is part of a multilevel ownership structure;\n(8) has membership rights to a nonprofit corporation in accordance with the provisions of the articles of incorporation or bylaws for the nonprofit corporation;\n(9) has the right to receive some or all of the revenue, gross profit, or net profit from a cannabis business during any full or partial calendar or fiscal year; or\n(10) has the right to exercise control over a cannabis business.\nTrue party of interest does not include:\n(1) an individual receiving payment for rent on a fixed basis under a lease or rental agreement;\n(2) an employee of a cannabis business who receives a salary or hourly rate compensation if the employee does not otherwise hold an ownership interest in the cannabis business or have the right to exercise control over the cannabis business;\n(3) an individual who receives a bonus or commission based on the individual's sales, if the bonus or commission does not exceed ten percent of the individual's sales in any given bonus or commission period and the terms of the bonus or commission-based compensation agreement is in writing;\n(4) an individual with an ownership interest held or acquired solely for the purpose of passive investment as described in Code of Federal Regulations, title 31, section 800.243;\n(5) an individual contracting with a cannabis business to receive a commission for the sale of a business or real property;\n(6) a consultant receiving a flat or hourly rate compensation under a written contractual agreement;\n(7) any person with a contract or an agreement for services with a cannabis business, such as a branding or staffing company, as long as that person does not obtain any ownership or control of the cannabis business; or\n(8) a financial institution.\nAn individual may not be a true party of interest for more than one application for (1) any single type of license, or (2) multiple types of licenses if the individual would be prohibited from holding the licenses under section 342.18, subdivision 2. The limitation does not apply to an individual who holds no more than ten percent ownership of the business entity.\nAn individual may not be a true party of interest for more than one license unless explicitly allowed by this chapter. The limitation does not apply to an individual who holds ten percent or less controlling ownership of the business entity.\nExcept as otherwise provided in this subdivision, a cannabis business has a continuing duty to disclose the source of all money that will be invested in the cannabis business, including but not limited to all money obtained from financiers, before investing the money in the cannabis business. The notice requirement under this section does not apply to:\n(1) revenues of a licensed cannabis business that are reinvested in the business; and\n(2) proceeds of a revolving loan unless the source of the money has changed or the approved loan amount has increased.\nA cannabis business must not enter into an intellectual property agreement with another cannabis business if a single entity could not hold licenses for both types of cannabis business.\nA financier may not receive an ownership interest, control of a business, a share of revenue, gross profits or net profits, a profit sharing interest, or a percentage of the profits in exchange for a loan or gift of money, unless the financier, if directly involved in the loaning of money, has been disclosed to the office as a true party of interest.\nAn applicant for a cannabis business license and cannabis business license holders must disclose all true parties of interest. Applicants and license holders have a continuing duty to notify the office of any change in true parties of interest in the form and manner specified by the office.",
	"repealed": false
}