{
	"id": "363A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.28",
	"title": "363A.28 GRIEVANCES.",
	"text": "Any person aggrieved by a violation of this chapter may bring a civil action as provided in section 363A.33, subdivision 1, or may file a verified charge with the commissioner or the commissioner's designated agent. A charge filed with the commissioner must be in writing by hand, or electronically with an unsworn declaration under penalty of perjury, on a form provided by the commissioner and signed by the charging party. The charge must state the name of the person alleged to have committed an unfair discriminatory practice and set out a summary of the details of the practice complained of. The commissioner may require a charging party to provide the address of the person alleged to have committed the unfair discriminatory practice, names of witnesses, documents, and any other information necessary to process the charge. The commissioner may dismiss a charge when the charging party fails to provide required information. The commissioner within ten days of the filing shall serve a copy of the charge and a form for use in responding to the charge upon the respondent personally, electronically with the receiving party's consent, or by mail. The respondent shall file with the department a written response setting out a summary of the details of the respondent's position relative to the charge within 30 days of receipt of the charge. If the respondent fails to respond with a written summary of the details of the respondent's position within 30 days after service of the charge, and service was consistent with rule 4 of the Rules of Civil Procedure, the commissioner, on behalf of the complaining party, may bring an action for default in district court pursuant to rule 55.01 of the Rules of Civil Procedure.\n[See Note.]\nWhenever the commissioner has reason to believe that a person is engaging in an unfair discriminatory practice, the commissioner may issue a charge stating in statutory language an alleged violation of subdivision 10 and sections 363A.08 to 363A.19.\n(a) A claim of an unfair discriminatory practice must be brought as a civil action pursuant to section 363A.33, subdivision 1, filed in a charge with a local commission pursuant to section 363A.07, subdivision 3, or filed in a charge with the commissioner within one year after the occurrence of the practice.\n(b) The running of the one-year limitation period is suspended during the time a potential charging party and respondent are voluntarily engaged in a dispute resolution process involving a claim of unlawful discrimination under this chapter, including arbitration, conciliation, mediation or grievance procedures pursuant to a collective bargaining agreement or statutory, charter, ordinance provisions for a civil service or other employment system or a school board sexual harassment or sexual violence policy. A potential respondent who participates in such a process with a potential charging party before a charge is filed or a civil action is brought shall notify the department and the charging party in writing of the participation in the process and the date the process commenced and shall also notify the department and the charging party of the ending date of the process. A respondent who fails to provide this notification is barred from raising the defense that the statute of limitations has run unless one year plus a period of time equal to the suspension period has passed.\n(c) The running of the one-year limitation period is suspended during the applicable time period under section 363A.331, subdivision 2, during which a civil action may not be brought.\nFor purposes of subdivision 3, the first application of an unfair discriminatory practice, employment policy, or seniority system to a new person establishes a basis for the filing of a claim by that person.\nCharging parties and respondents shall be offered and may request an opportunity to resolve a charge through mediation or another alternative dispute resolution process. Neutrals providing mediation and alternative dispute resolution processes for parties are bound by the Code of Ethics for Court-Annexed ADR Neutrals. The running of the 12-month period during which the commissioner must make a determination of probable cause to credit allegations is suspended during a period of time specified by the commissioner during which the parties are involved in mediation or other alternative dispute resolution process that has been sanctioned by the commissioner.\n(a) Consistent with paragraph (h), the commissioner shall promptly inquire into the truth of the allegations of the charge. The commissioner shall make an immediate inquiry when a charge alleges actual or threatened physical violence. The commissioner shall also make an inquiry when it appears that a charge is frivolous or without merit and shall dismiss those charges.\n(b) The commissioner shall give priority to investigating and processing those charges, in the order below, which the commissioner determines have the following characteristics:\n(1) there is evidence of irreparable harm if immediate action is not taken;\n(2) there is evidence that the respondent has intentionally engaged in a reprisal;\n(3) a significant number of recent charges have been filed against the respondent;\n(4) the respondent is a government entity;\n(5) there is potential for broadly promoting the policies of this chapter; or\n(6) the charge is supported by substantial and credible documentation, witnesses, or other evidence.\nThe commissioner shall inform charging parties of these priorities and shall tell each party if their charge is a priority case or not.\nOn other charges the commissioner shall make a determination within 12 months after the charge was filed as to whether or not there is probable cause to credit the allegation of unfair discriminatory practices.\n(c) If the commissioner determines after investigation that no probable cause exists to credit the allegations of the unfair discriminatory practice, the commissioner shall, within ten days of the determination, serve upon the charging party and respondent written notice of the determination. Within 30 days after receipt of notice, the charging party may request in writing, on forms prepared by the department, that the commissioner reconsider the determination. The request shall contain a brief statement of the reasons for and new evidence in support of the request for reconsideration. At the time of submission of the request to the commissioner, the charging party shall deliver or mail to the respondent a copy of the request for reconsideration. The commissioner shall reaffirm, reverse, or vacate and remand for further consideration the determination of no probable cause within 20 days after receipt of the request for reconsideration, and shall within ten days notify in writing the charging party and respondent of the decision to reaffirm, reverse, or vacate and remand for further consideration.\nA decision by the commissioner that no probable cause exists to credit the allegations of an unfair discriminatory practice shall not be appealed to the court of appeals pursuant to section 363A.34 or sections 14.63 to 14.68.\n(d) If the commissioner determines after investigation that probable cause exists to credit the allegations of unfair discriminatory practices, the commissioner shall serve on the respondent and the respondent's attorney if the respondent is represented by counsel, by first class mail, or electronically with the receiving party's consent, a notice setting forth a short plain written statement of the alleged facts which support the finding of probable cause and an enumeration of the provisions of law allegedly violated. Within 30 days after receipt of notice, the respondent may request in writing, on forms prepared by the department, that the commissioner reconsider the determination. If the commissioner determines that attempts to eliminate the alleged unfair practices through conciliation pursuant to subdivision 8 have been or would be unsuccessful or unproductive, the commissioner may issue a complaint and serve on the respondent, by registered or certified mail, or electronically with the receiving party's consent, a written notice of hearing together with a copy of the complaint, requiring the respondent to answer the allegations of the complaint at a hearing before an administrative law judge at a time and place specified in the notice, not less than ten days after service of said complaint. A copy of the notice shall be furnished to the charging party and the attorney general.\n(e) If, at any time after the filing of a charge, the commissioner has reason to believe that a respondent has engaged in any unfair discriminatory practice, the commissioner may file a petition in the district court in a county in which the subject of the complaint occurs, or in a county in which a respondent resides or transacts business, seeking appropriate temporary relief against the respondent, pending final determination of proceedings under this chapter, including an order or decree restraining the respondent from doing or procuring an act tending to render ineffectual an order the commissioner may enter with respect to the complaint. The court shall have power to grant temporary relief or a restraining order as it deems just and proper, but no relief or order extending beyond ten days shall be granted except by consent of the respondent or after hearing upon notice to the respondent and a finding by the court that there is reasonable cause to believe that the respondent has engaged in a discriminatory practice. Except as modified by subdivisions 1 to 9 and section 363A.06, subdivision 4, the Minnesota Rules of Civil Procedure shall apply to an application, and the district court shall have authority to grant or deny the relief sought on conditions as it deems just and equitable. All hearings under subdivisions 1 to 9 and section 363A.06, subdivision 4, shall be given precedence as nearly as practicable over all other pending civil actions.\n(f) If a lessor, after engaging in a discriminatory practice defined in section 363A.09, subdivision 1, clause (1), leases or rents a dwelling unit to a person who has no knowledge of the practice or of the existence of a charge with respect to the practice, the lessor shall be liable for actual damages sustained by a person by reason of a final order as provided in subdivisions 1 to 9 and section 363A.06, subdivision 4, requiring the person to be evicted from the dwelling unit.\n(g) In any complaint issued under subdivisions 1 to 9 and section 363A.06, subdivision 4, the commissioner may seek relief for a class of individuals affected by an unfair discriminatory practice occurring on or after a date one year prior to the filing of the charge from which the complaint originates.\n(h) The commissioner may adopt policies to determine which charges are processed and the order in which charges are processed based on their particular social or legal significance, administrative convenience, difficulty of resolution, or other standard consistent with the provisions of this chapter.\n(i) The chief administrative law judge shall adopt policies to provide sanctions for intentional and frivolous delay caused by any charging party or respondent in an investigation, hearing, or any other aspect of proceedings before the department under this chapter.\nRules adopted pursuant to this subdivision apply to cases pending before the commissioner on the date of adoption.\nThe commissioner, in complying with subdivision 6, shall endeavor to eliminate the unfair discriminatory practice through education, conference, conciliation and persuasion at the place where the practice occurred, or the respondent resides or has a principal place of business.\nThe commissioner shall provide the respondent with a copy of the charge. The charging party or the party's representative may review the answer of the respondent to the charge submitted pursuant to subdivision 1. The department shall make these documents available to the charging party.\nIf the complaining party has met its burden of showing that an employment practice is responsible for a statistically significant adverse impact on a particular class of persons protected by section 363A.08, subdivision 2, an employer must justify that practice by demonstrating that the practice is manifestly related to the job or significantly furthers an important business purpose. Upon establishment of this justification, the charging party may prevail upon demonstration of the existence of a comparably effective practice that the court finds would cause a significantly lesser adverse impact on the identified protected class.",
	"repealed": false
}