{
	"id": "354.543",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.543",
	"title": "354.543 PRIOR OR UNCREDITED MILITARY SERVICE CREDIT PURCHASE.",
	"text": "(a) If paragraph (b) does not apply, a teacher who has at least three years of allowable service credit with the Teachers Retirement Association and who performed service in the United States armed forces before becoming a teacher as defined in section 354.05, subdivision 2, or who failed to obtain service credit for a military leave of absence under the provisions of section 354.53, is entitled to purchase allowable and formula service credit for the initial period of enlistment, induction, or call to active duty without any voluntary extension by making payment under section 356.551.\n(b) A service credit purchase is prohibited if:\n(1) the teacher separated from service with the United States armed forces with a dishonorable or bad conduct discharge or under other than honorable conditions; or\n(2) the teacher has purchased or otherwise received service credit from any Minnesota defined benefit public employee pension plan, other than a volunteer fire plan, for the same period of service.\nA teacher who desires to purchase service credit under subdivision 1 must apply with the executive director to make the purchase. The application must include all necessary documentation of the teacher's qualifications to make the purchase, signed written permission to allow the executive director to request and receive necessary verification of applicable facts and eligibility requirements, and any other relevant information that the executive director may require.\nAllowable and formula service credit for the purchase period must be granted by the Teachers Retirement Association to the purchasing teacher upon receipt of the purchase payment amount. Payment must be made before the teacher's termination of teaching service. Purchasing allowable and formula service credit under this section does not change the date the teacher first became a member of the association for the purpose of computing an annuity under section 354.44, subdivision 6.",
	"repealed": false
}