{
	"id": "205A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/205A.12",
	"title": "205A.12 SCHOOL BOARD ELECTION DISTRICTS.",
	"text": "Any independent school district may alter its organization into separate election districts for the purpose of election of board members by following the procedures in this section.\nExcept in a school district located wholly or partly within a city of the first class, upon resolution of the board, made on its own motion or on presentation of a petition substantially in the form required in section 205A.13, signed by at least 50 electors of the district or ten percent of the number of votes cast in the most recent regular school board election, whichever is larger, the board shall adopt a proposal to divide the district into separate election districts. The proposal must designate one of the following options for election of members: single-member districts, from which one board member each must be elected; multimember districts, from which two or three members each must be elected; a combination of single-member and multimember districts; or a combination of single-member or multimember districts, or both, and election of one or more members at large. The proposal must be submitted to an election under this chapter. If the election is initiated by petition, the resolution calling the election must be adopted within six months after the date of receipt of the petition. Only one election within any two-year period may be held under this section.\nThe question presented at the special election shall be: \"Shall the school district be reorganized into election districts with boundaries as established in Resolution No. .... of the school board, dated ..........?\nEach proposed election district must be as equal in population as practicable and must be composed of compact, contiguous territory. The district may utilize the most recent federal decennial census figures available or may conduct a special census for this purpose. The board shall designate each election district by number.\nIf the proposal for the establishment of election districts is approved by the voters, the board shall specify the election districts from which vacancies shall be filled as they occur until such time as each board member represents an election district. A candidate for school board in a subsequent election must file an affidavit of candidacy to be elected as a school board member for the election district in which the candidate maintains residence. If there are as many election districts as there are members of the board, one and only one member of the board shall be elected from each election district. In school districts where one or more board members are elected by election districts, candidates must indicate on the affidavit of candidacy the number of the district from which they seek election or, if appropriate, that they seek election from one of the offices elected at large. If the election districts have two or three members each, the terms of the members must be staggered. Each board member must be a resident of the election district for which elected but the creation of an election district or a change in election district boundaries shall not disqualify a board member from serving for the remainder of a term.\nThe school board of a school district may provide for the use by the district of an electronic voting system in one or more polling places or combined polling places in the school district for an election not held in conjunction with a statewide election. No system may be adopted or used unless it has been approved by the secretary of state pursuant to section 206.57. The school district shall notify the secretary of state of its decision in compliance with section 206.58, subdivision 4.\nThe school board may by resolution redefine district boundaries after a school district general election. The board shall hold a public hearing on the proposed resolution before its adoption. One week's published notice of the hearing must be given. After the official certification of the federal decennial or special census, the school board shall either confirm the existing election district boundaries as conforming to the standards of subdivision 4 or redefine election district boundaries to conform to those standards as provided in section 204B.135, subdivision 2. If the school board fails to take either action within the time required, no further compensation may be paid to the school board members until the districts are either reconfirmed or redefined as required by this section. A resolution establishing election district boundaries pursuant to section 204B.135, subdivision 2, becomes effective on the date of the state primary election in the year ending in two. Election district boundaries established at other times become effective 90 days after the adoption of the resolution.\nThe governing body of a school district that enters into a consolidation or cooperation and combination agreement may, by resolution, dissolve election districts previously established as provided in this section as part of the consolidation or cooperation and combination plan. The resolution must include a plan for the orderly transition to at-large elections of school board members.",
	"repealed": false
}