{
	"id": "216B.098",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.098",
	"title": "216B.098 RESIDENTIAL CUSTOMER PROTECTIONS.",
	"text": "The provisions of this section apply to residential customers of public utilities, municipal utilities, and cooperative electric associations. Each municipal utility and cooperative electric association may establish terms and conditions for the plans and agreements required under subdivisions 2 and 3.\nA utility shall offer a customer a budget billing plan for payment of charges for service, including adequate notice to customers prior to changing budget payment amounts. Municipal utilities having 3,000 or fewer customers are exempt from this requirement. Municipal utilities having more than 3,000 customers shall implement this requirement before July 1, 2003.\nA utility shall offer a payment agreement for the payment of arrears. Payment agreements must consider a customer's financial circumstances and any extenuating circumstances of the household. No additional service deposit may be charged as a consideration to continue service to a customer who has entered and is reasonably on time under an accepted payment agreement.\n(a) A utility shall offer a payment agreement to customers who have been undercharged if no culpable conduct by the customer or resident of the customer's household caused the undercharge. The agreement must cover a period equal to the time over which the undercharge occurred or a different time period that is mutually agreeable to the customer and the utility, except that the duration of a payment agreement offered by a utility to a customer whose household income is at or below 50 percent of state median household income must consider the financial circumstances of the customer's household.\n(b) No interest or delinquency fee may be charged as part of an undercharge agreement under this subdivision.\n(c) If a customer inquiry or complaint results in the utility's discovery of the undercharge, the utility may bill for undercharges incurred after the date of the inquiry or complaint only if the utility began investigating the inquiry or complaint within a reasonable time after when it was made.\n(a) A utility shall reconnect or continue service to a customer's residence where a medical emergency exists or where medical equipment requiring electricity necessary to sustain life is in use, provided that the utility receives written certification, or initial certification by telephone and written certification within five business days, that failure to reconnect or continue service will impair or threaten the health or safety of a resident of the customer's household.\n(b) Certification of the necessity for service is required. Certification may be provided by:\n(1) a licensed medical doctor;\n(2) a licensed physician assistant;\n(3) an advanced practice registered nurse, as defined in section 148.171; or\n(4) a registered nurse, but only to the extent of verifying the current diagnosis or prescriptions made by a licensed medical doctor for the customer or member of the customer's household.\n(c) Except as provided in paragraph (d), a certification may not extend beyond six months from the date of written certification.\n(d) If a utility determines that a longer certification is appropriate given a particular customer's circumstances, the utility may, at its sole discretion, extend the duration of a certification for up to 12 months.\n(e) A certification may be renewed, provided that the renewal complies with this subdivision. A certification may be renewed by the same or another medical professional who meets the qualifications of paragraph (b).\n(f) A customer whose account is in arrears must contact and enter into a payment agreement with the utility. The payment agreement must consider a customer's financial circumstances and any extenuating circumstances of the household. The payment agreement may, at the discretion of the utility, contain a provision by which the utility forgives all or a portion of the amount in which the account is in arrears, which, if implemented, extinguishes individual liability for the amount forgiven.\n(a) In addition to any other authority, the commission has the authority to resolve customer complaints against a public utility or a landlord of a shared-metered residential building, whether or not the complaint involves a violation of this chapter. The commission may delegate this authority to commission staff as it deems appropriate.\n(b) The commission has the authority to levy a penalty of not less than $100 and not more than $1,000 for each violation of section 216B.022, 216B.023, or 216B.024 with respect to complaints filed by tenants. Nothing in this chapter limits the right of a tenant to seek or obtain judicial remedies.\n(c) For the purposes of this subdivision:\n(1) \"landlord\" has the meaning given in section 216B.022, subdivision 1, paragraph (b);\n(2) \"public utility\" has the meaning given in section 216B.02, subdivision 4; and\n(3) \"shared-metered residential building\" has the meaning given in section 216B.022, subdivision 1, paragraph (e).\nIf a utility requires a new customer to provide a Social Security number on an application for utility service, the utility must accept an individual taxpayer identification number in lieu of a Social Security number. The utility application must indicate that the utility accepts an individual taxpayer identification number.",
	"repealed": false
}