{
	"id": "325F.733",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.733",
	"title": "325F.733 LICENSE; APPLICATION; TERMS AND CONDITIONS.",
	"text": "Any precious metal dealer desiring to engage in or transact business as such in any county of this state shall file an application for a license for that purpose with the auditor of the county in which the dealer desires to do business. The application shall include the applicant's name, date of birth, resident address, and locations of the proposed principal place of business and branch offices within the county, and other locations within the county where the applicant intends to hold secondhand precious metals. If the person in charge of the business or a branch office is someone other than the applicant, the name, date of birth, and resident address of the person in charge shall be stated with the location or branches indicated. If the applicant is a corporation or partnership the name, date of birth and resident address of each officer and general partner shall be stated. Each application shall be kept by the auditor for a period of no less than three years and shall be available for inspection only by employees of the county auditor, the county attorney, the attorney general, or by a peace officer.\nEach applicant shall pay to the treasurer of the county a license fee in an amount determined by the board of county commissioners of the county to be necessary to cover the expenses of administering this licensing function.\nA precious metal dealer license shall authorize the precious metal dealer to transact business only at the location or locations designated in the license.\nA precious metal dealer license shall be valid for a period of one year from the date of its issuance.\nEach branch office shall be operated under the same name as the principal office.\nEvery precious metal dealer shall prominently post the dealer's license in a conspicuous location at the dealer's principal place of business and a copy of the license in a conspicuous location at each branch office.\nEvery precious metal dealer shall prominently post in a conspicuous place and in letters exceeding one inch in height the minimum prices per ounce or pennyweight that are currently being paid by the dealer for precious metals and a warning notice that unless otherwise informed, the prices offered are based on the meltdown value of the precious metal, rather than the value of the item in its existing form. Precious metal items shall be weighed in plain sight of the prospective seller on scales approved by the Division of Weights and Measures of the Department of Commerce in accordance with sections 239.011 and 239.09.\nThe county auditor shall keep a record of the licenses in a book provided for that purpose. The book shall contain the same information as required on the application for the license; provided, that the applicant's resident address and date of birth shall not be recorded. The book shall be open for public inspection.",
	"repealed": false
}