{
	"id": "120B.024",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.024",
	"title": "120B.024 CREDITS.",
	"text": "(a) Students must successfully complete the following high school level credits for graduation:\n(1) four credits of language arts sufficient to satisfy all of the academic standards in English language arts;\n(2) three credits of mathematics sufficient to satisfy all of the academic standards in mathematics;\n(3) three credits of science, including one credit to satisfy all the earth and space science standards for grades 9 through 12, one credit to satisfy all the life science standards for grades 9 through 12, and one credit to satisfy all the chemistry or physics standards for grades 9 through 12;\n(4) three and one-half credits of social studies, including credit for a course in government and citizenship in either grade 11 or 12 for students beginning grade 9 in the 2025-2026 school year and later or an advanced placement, international baccalaureate, or other rigorous course on government and citizenship under section 120B.021, subdivision 1a, and a combination of other credits encompassing at least United States history, geography, government and citizenship, world history, and economics sufficient to satisfy all of the academic standards in social studies;\n(5) one credit of the arts sufficient to satisfy all of the academic standards in the arts;\n(6) credit sufficient to satisfy the state standards in physical education;\n(7) credits sufficient to satisfy the state standards in health upon adoption of statewide rules for implementing health standards under section 120B.021; and\n(8) a minimum of seven elective credits.\n(b) Students who begin grade 9 in the 2024-2025 school year and later must successfully complete a course for credit in personal finance in grade 10, 11, or 12. A teacher of a personal finance course that satisfies the graduation requirement must have a field license or out-of-field permission in agricultural education, business, family and consumer science, social studies, or math.\n(a) A one-half credit of economics taught in a school's agricultural, food, and natural resources education or business education program or department may fulfill a one-half credit in social studies under subdivision 1, clause (5), if the credit is sufficient to satisfy all of the academic standards in economics.\n(b) An agriculture science or career and technical education credit may fulfill the elective science credit required under subdivision 1, clause (4), if the credit meets the state physical science, life science, earth and space science, chemistry, or physics academic standards or a combination of these academic standards as approved by the district. An agriculture or career and technical education credit may fulfill the credit in chemistry or physics required under subdivision 1, clause (4), if the credit meets the state chemistry or physics academic standards as approved by the district. A student must satisfy either all of the chemistry academic standards or all of the physics academic standards prior to graduation. An agriculture science or career and technical education credit may not fulfill the required biology credit under subdivision 1, clause (4).\n(c) A career and technical education credit may fulfill a mathematics or arts credit requirement under subdivision 1, clause (2) or (6).\n(d) An agricultural, food, and natural resources education teacher is not required to meet the requirements of Minnesota Rules, part 3505.1150, subpart 2, item B, to meet the credit equivalency requirements of paragraph (b) above.\n(e) A computer science credit may fulfill a mathematics credit requirement under subdivision 1, clause (2), if the credit meets state academic standards in mathematics.\n(f) A Project Lead the Way credit may fulfill a science or mathematics credit requirement under subdivision 1, clause (2) or (4), if the credit meets the state academic standards in science or mathematics.\n(g) An ethnic studies course may fulfill a social studies, language arts, arts, math, or science credit if the course meets the applicable state academic standards. An ethnic studies course may fulfill an elective credit if the course meets applicable local standards or other requirements.",
	"repealed": false
}