{
	"id": "116R.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.13",
	"title": "116R.13 DEBT SERVICE RESERVE ACCOUNT.",
	"text": "The commissioner or a trustee appointed by the commissioner may create, maintain, and establish a special account or accounts for the security of one or more or all series of the bonds, which accounts are known as debt service reserve accounts. The commissioner may pay into each debt service reserve account:\n(1) any money appropriated by the state only for the purposes of that account;\n(2) any proceeds of sale of bonds to the extent provided in the order or indenture authorizing their issuance;\n(3) any money directed to be transferred by the commissioner to that debt service reserve account; and\n(4) any other money made available to the commissioner for the purpose of that account from any other source.\nThe money held in or credited to each debt service reserve account, except as provided in this section, must be used solely for the payment of the principal of bonds of the commissioner as the bonds mature or otherwise become due, the purchase of the bonds, the payment of interest on the bonds, the payment of any premium required when the bonds are redeemed before maturity, the payment of trustee or paying agency or registrar fees and expenses, the reimbursement of any advance made from another fund or account, or the payment of any rebate amounts owing to the United States government in accordance with any applicable covenant to comply with federal tax laws; provided, that money in a debt service reserve account may not be withdrawn at any time in an amount which would reduce the amount of the account to less than any amount which the commissioner determines to be reasonably necessary for the purposes of the account, except for the purpose of paying principal, premium, or interest due on bonds secured by the account, for the payment of which other money is not available.\n(a) If the amount in any debt service reserve account falls below the minimum required in an order of the commissioner or indenture for the applicable series of bonds and the order or indenture so provides and subject to the limitations in section 116R.02, subdivision 4, paragraph (a), clause (1), the commissioner shall issue as promptly as practicable, but in no event later than six months after the occurrence of the deficiency, general obligation bonds in accordance with the Minnesota Constitution, article XI, section 7, and sections 16A.641, subdivisions 1 to 4 and 6 to 13; 16A.66; 16A.672; 16A.675; and 116R.02, subdivision 4, except as otherwise provided in this section and unless provision is made for restoring the deficiency from other sources. Section 16A.641, subdivision 5, does not apply to the issuance of bonds authorized under this subdivision. Amounts sufficient to pay the costs of issuance of the deficiency bonds are appropriated to the commissioner from the general fund to the extent other available money is insufficient. Proceeds of the deficiency bonds may be used to pay costs related to the issuance of the deficiency bonds and interest due on the deficiency bonds and to establish a debt service reserve for the deficiency bonds. Any remaining proceeds must be deposited in the debt service reserve account, except that accrued interest must be deposited as provided in section 16A.641, subdivision 7, paragraph (b). The proceeds of the deficiency bonds and any investment income are appropriated for these purposes. In any event, the proceeds of the deficiency bonds deposited in the debt service reserve account must be an amount not less than the commissioner determines is required to pay principal and interest on the state guaranteed bonds secured by the debt service reserve account.\n(b) The underwriting discount, spread, or commission paid or allowed to the underwriters or placement agents of deficiency bonds and bonds described in section 116R.02, subdivision 4, paragraph (a), must be an amount not in excess of the amount determined by the commissioner to be reasonable in light of the risk assumed and the expense of issuance, if any, required to be paid by the underwriters, placement agents, or prevailing market conditions and practices.\nIf the commissioner creates a debt service reserve account for the security of any series of bonds, the commissioner may not issue any additional bonds which are similarly secured if the amount of any of the debt service reserve accounts at the time of issuance does not equal or exceed the minimum amount, if any, required by the resolution creating that account, unless the commissioner deposits in each account at the time of issuance, from the proceeds of the bonds or otherwise, an amount which, together with the amount then in the account, will not be less than the minimum amount required.\nTo the extent consistent with the orders and indentures securing outstanding bonds, the commissioner may, at the close of any fiscal year, transfer to any other account from any debt service reserve account, any excess in that account over the amount considered by the commissioner to be reasonably necessary for the purpose of the account.\nNothing in this section may be construed to limit the right of the commissioner to create and establish by order or indenture other accounts or security in addition to debt service reserve accounts which are necessary or desirable in connection with any bonds.",
	"repealed": false
}