{
	"id": "62A.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.451",
	"title": "62A.451 DEFINITIONS.",
	"text": "For purposes of sections 62A.451 to 62A.4528, the terms defined in this section have the meanings given.\n\"Commissioner\" means the commissioner of commerce.\n\"Enrollee\" means an individual who is entitled to limited health services under a contract with an entity authorized to provide or arrange for such services under sections 62A.451 to 62A.4528.\n\"Evidence of coverage\" means the certificate, agreement, or contract issued under section 62A.4516 setting forth the coverage to which an enrollee is entitled.\n\"Limited health service\" means pharmaceutical services covered under Medicare Part D. Limited health service does not include hospital, medical, surgical, or emergency services.\n\"Prepaid limited health service organization\" means any corporation, partnership, or other entity that, in return for a prepayment, undertakes to provide or arrange for the provision of limited health services to enrollees. Prepaid limited health service organization does not include:\n(1) an entity otherwise authorized under the laws of this state either to provide any limited health service on a prepayment or other basis or to indemnify for any limited health service;\n(2) an entity that meets the requirements of section 62A.4514; or\n(3) a provider or entity when providing or arranging for the provision of limited health services under a contract with a prepaid limited health service organization or with an entity described in clause (1) or (2).\n\"Provider\" means a physician, pharmacist, health facility, or other person or institution that is licensed or otherwise authorized to deliver or furnish limited health services under sections 62A.451 to 62A.4528.\n\"Subscriber\" means the person whose employment or other status, except for family dependency, is the basis for entitlement to limited health services under a contract with an entity authorized to provide or arrange for such services under sections 62A.451 to 62A.4528.",
	"repealed": false
}