{
	"id": "65B.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.44",
	"title": "65B.44 BASIC ECONOMIC LOSS BENEFITS.",
	"text": "(a) Basic economic loss benefits shall provide reimbursement for all loss suffered through injury arising out of the maintenance or use of a motor vehicle, subject to any applicable deductibles, exclusions, disqualifications, and other conditions, and shall provide a minimum of $40,000 for loss arising out of the injury of any one person, consisting of:\n(1) $20,000 for medical expense loss arising out of injury to any one person; and\n(2) a total of $20,000 for income loss, replacement services loss, funeral expense loss, survivor's economic loss, and survivor's replacement services loss arising out of the injury to any one person.\n(b) Notwithstanding any other law to the contrary, a person entitled to basic economic loss benefits under this chapter is entitled to the full medical expense benefits set forth in subdivision 2, and may not receive medical expense benefits that are in any way less than those provided for in subdivision 2, or that involve any preestablished limitations on the benefits. Medical expenses must be reasonable and must be for necessary medical care as provided in subdivision 2. This paragraph shall not be deemed to alter the obligations of an insured or the rights of a reparation obligor as set forth in section 65B.56.\n(c) No reparation obligor or health plan company as defined in section 62Q.01, subdivision 4, may enter into or renew any contract that provides, or has the effect of providing, managed care services to no-fault claimants. For the purposes of this section, \"managed care services\" is defined as any program of medical services that uses health care providers managed, owned, employed by, or under contract with a health plan company.\n(a) Medical expense benefits shall reimburse all reasonable expenses for necessary:\n(1) medical, surgical, x-ray, optical, dental, chiropractic, and rehabilitative services, including prosthetic devices;\n(2) prescription drugs, provided that:\n(i) prescription drugs filled and dispensed outside of a licensed pharmacy shall be billed at the average wholesale price (AWP), or its equivalent, for that drug on that date as published in Medispan, Redbook, or Gold Standard Drug Database, as identified by its National Drug Code, plus a dispensing fee of $4.18;\n(ii) if a prescription drug has been repackaged, the average wholesale price used to determine the maximum reimbursement shall be the average wholesale price for the underlying drug product, as identified by its National Drug Code from the original labeler; and\n(iii) compound drugs shall be billed by listing each drug and its National Drug Code number included in the compound and calculating the charge for each drug separately. Reimbursement shall be based on the sum of the fee for each ingredient for which there is an assigned National Drug Code number plus a single dispensing fee of $4.18. Compound drugs shall not be dispensed without first obtaining preauthorization from the reparation obligor;\n(3) ambulance and all other transportation expenses incurred in traveling to receive other covered medical expense benefits;\n(4) sign interpreting and language translation services, other than such services provided by a family member of the patient, related to the receipt of medical, surgical, x-ray, optical, dental, chiropractic, hospital, extended care, nursing, and rehabilitative services; and\n(5) hospital, extended care, and nursing services.\n(b) Hospital room and board benefits may be limited, except for intensive care facilities, to the regular daily semiprivate room rates customarily charged by the institution in which the recipient of benefits is confined.\n(c) Such benefits shall also include necessary remedial treatment and services recognized and permitted under the laws of this state for an injured person who relies upon spiritual means through prayer alone for healing in accordance with that person's religious beliefs.\n(d) Medical expense loss includes medical expenses accrued prior to the death of a person notwithstanding the fact that benefits are paid or payable to the decedent's survivors.\n(e) Medical expense benefits for rehabilitative services shall be subject to the provisions of section 65B.45.\n(a) A person convicted of insurance fraud under section 609.611 in a case related to this chapter or of employment of runners under section 609.612 may not enforce a contract for payment of services eligible for reimbursement under subdivision 2 against an insured or reparation obligor.\n(b) After a period of five years from the date of conviction, a person described in paragraph (a) may apply to district court to extinguish the collateral sanction set forth in paragraph (a), which the court may grant in its reasonable discretion.\n(a) Disability and income loss benefits shall provide compensation for 85 percent of the injured person's loss of present and future gross income from inability to work proximately caused by the nonfatal injury subject to a maximum of $500 per week. Loss of income includes the costs incurred by a self-employed person to hire substitute employees to perform tasks which are necessary to maintain the income of the injured person, which are normally performed by the injured person, and which cannot be performed because of the injury.\n(b) If the injured person is unemployed at the time of injury and is receiving or is eligible to receive unemployment benefits under chapter 268, but the injured person loses eligibility for those benefits because of inability to work caused by the injury, disability and income loss benefits shall provide compensation for the lost benefits in an amount equal to the unemployment benefits which otherwise would have been payable, subject to a maximum of $500 per week.\n(c) Compensation under this subdivision shall be reduced by any income from substitute work actually performed by the injured person or by income the injured person would have earned in available appropriate substitute work which the injured person was capable of performing but unreasonably failed to undertake.\n(d) For the purposes of this section \"inability to work\" means disability which prevents the injured person from engaging in any substantial gainful occupation or employment on a regular basis, for wage or profit, for which the injured person is or may by training become reasonably qualified. If the injured person returns to employment and is unable by reason of the injury to work continuously, compensation for lost income shall be reduced by the income received while the injured person is actually able to work. The weekly maximums may not be prorated to arrive at a daily maximum, even if the injured person does not incur loss of income for a full week.\n(e) For the purposes of this section, an injured person who is \"unable by reason of the injury to work continuously\" includes, but is not limited to, a person who misses time from work, including reasonable travel time, and loses income, vacation, or sick leave benefits, to obtain medical treatment for an injury arising out of the maintenance or use of a motor vehicle.\nA plan of reparation security issued to or renewed with a person who has attained the age of 65 or who has attained the age of 60 years and is retired and receiving a pension, must provide disability and income loss benefits under section 65B.44, subdivision 3, unless the insured elects not to have this coverage. An election by the insured not to have this coverage remains in effect until revoked by the insured. The reparation obligor shall notify a person of the person's rights under this section at the time of the sale or the first renewal of the policy after the insured has attained the age of 60 years and at least annually after that. The rate for any plan for which coverage has been excluded or reduced pursuant to this section must be reduced accordingly. This section does apply to self-insurance.\nFuneral and burial benefits shall be reasonable expenses not in excess of $5,000, including expenses for cremation or delivery under the Darlene Luther Revised Uniform Anatomical Gift Act, chapter 525A.\nReplacement service loss benefits shall reimburse all expenses reasonably incurred by or on behalf of the nonfatally injured person in obtaining usual and necessary substitute services in lieu of those that, had the injured person not been injured, the injured person would have performed not for income but for direct personal benefit or for the benefit of the injured person's household; if the nonfatally injured person normally, as a full time responsibility, provides care and maintenance of a home with or without children, the benefit to be provided under this subdivision shall be the reasonable value of such care and maintenance or the reasonable expenses incurred in obtaining usual and necessary substitute care and maintenance of the home, whichever is greater. These benefits shall be subject to a maximum of $200 per week. All replacement services loss sustained on the date of injury and the first seven days thereafter is excluded in calculating replacement services loss.\nSurvivors economic loss benefits, in the event of death occurring within one year of the date of the accident, caused by and arising out of injuries received in the accident, are subject to a maximum of $500 per week and shall cover loss accruing after decedent's death of contributions of money or tangible things of economic value, not including services, that surviving dependents would have received from the decedent for their support during their dependency had the decedent not suffered the injury causing death.\nFor the purposes of definition under sections 65B.41 to 65B.71, the following described persons shall be presumed to be dependents of a deceased person: (a) a wife is dependent on a husband with whom she lives at the time of his death; (b) a husband is dependent on a wife with whom he lives at the time of her death; (c) any child while under the age of 18 years, or while over that age but physically or mentally incapacitated from earning, is dependent on the parent with whom the child is living or from whom the child is receiving support regularly at the time of the death of such parent; or (d) an actual dependent who lives with the decedent at the time of the decedent's death. Questions of the existence and the extent of dependency shall be questions of fact, considering the support regularly received from the deceased.\nPayments shall be made to the dependent, except that benefits to a dependent who is a child or an incapacitated person may be paid to the dependent's surviving parent or guardian. Payments shall be terminated whenever the recipient ceases to maintain a status which if the decedent were alive would be that of dependency.\nSurvivors replacement services loss benefits shall reimburse expenses reasonably incurred by surviving dependents after the date of the decedent's death in obtaining ordinary and necessary services in lieu of those the deceased would have performed for their benefit had the decedent not suffered the injury causing death, minus expenses of the survivors avoided by reason of the decedent's death. These benefits shall be subject to a maximum of $200 per week.\n\"Basic economic loss benefits\" do not include benefits for physical damage done to property including motor vehicles and their contents.",
	"repealed": false
}