{
	"id": "609.185",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.185",
	"title": "609.185 MURDER IN THE FIRST DEGREE.",
	"text": "(a) Whoever does any of the following is guilty of murder in the first degree and shall be sentenced to imprisonment for life:\n(1) causes the death of a human being with premeditation and with intent to effect the death of the person or of another;\n(2) causes the death of a human being while committing or attempting to commit criminal sexual conduct in the first or second degree with force or violence, either upon or affecting the person or another;\n(3) causes the death of a human being with intent to effect the death of the person or another, while committing or attempting to commit burglary, aggravated robbery, carjacking in the first or second degree, kidnapping, arson in the first or second degree, a drive-by shooting, tampering with a witness in the first degree, escape from custody, or any felony violation of chapter 152 involving the unlawful sale of a controlled substance;\n(4) causes the death of a peace officer, prosecuting attorney, judge, or a guard employed at a Minnesota state or local correctional facility, with intent to effect the death of that person or another, while the person is engaged in the performance of official duties;\n(5) causes the death of a minor while committing child abuse, when the perpetrator has engaged in a past pattern of child abuse upon a child and the death occurs under circumstances manifesting an extreme indifference to human life;\n(6) causes the death of a human being while committing domestic abuse, when the perpetrator has engaged in a past pattern of domestic abuse upon the victim or upon another family or household member and the death occurs under circumstances manifesting an extreme indifference to human life; or\n(7) causes the death of a human being while committing, conspiring to commit, or attempting to commit a felony crime to further terrorism and the death occurs under circumstances manifesting an extreme indifference to human life.\n(b) For the purposes of paragraph (a), clause (4), \"prosecuting attorney\" has the meaning given in section 609.221, subdivision 6, clause (4).\n(c) For the purposes of paragraph (a), clause (4), \"judge\" has the meaning given in section 609.221, subdivision 6, clause (5).\n(d) For purposes of paragraph (a), clause (5), \"child abuse\" means an act committed against a minor victim that constitutes a violation of the following laws of this state or any similar laws of the United States or any other state: section 609.221; 609.222; 609.223; 609.224; 609.2242; 609.342; 609.343; 609.344; 609.345; 609.377; 609.378; or 609.713.\n(e) For purposes of paragraph (a), clause (6), \"domestic abuse\" means an act that:\n(1) constitutes a violation of section 609.221, 609.222, 609.223, 609.224, 609.2242, 609.342, 609.343, 609.344, 609.345, 609.713, or any similar laws of the United States or any other state; and\n(2) is committed against the victim who is a family or household member as defined in section 518B.01, subdivision 2, paragraph (b).\n(f) For purposes of paragraph (a), clause (7), \"further terrorism\" has the meaning given in section 609.714, subdivision 1.",
	"repealed": false
}