{
	"id": "115D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/115D.08",
	"title": "115D.08 PROGRESS REPORTS.",
	"text": "(a) All persons required to prepare a toxic pollution prevention plan under section 115D.07 shall submit an annual progress report to the commissioner of public safety that may be drafted in a manner that does not disclose proprietary information. Progress reports are due on July 1 of each year. The first progress reports are due in 1992.\n(b) At a minimum, each progress report must include:\n(1) a summary of each objective established in the plan, including the base year for any objective stated in numeric terms, and the schedule for meeting each objective;\n(2) a summary of progress made during the past year, if any, toward meeting each objective established in the plan including the quantity of each toxic pollutant eliminated or reduced;\n(3) a statement of the methods through which elimination or reduction has been achieved;\n(4) if necessary, an explanation of the reasons objectives were not achieved during the previous year, including identification of any technological, economic, or other impediments the facility faced in its efforts to achieve its objectives; and\n(5) a certification, signed and dated by the facility manager and an officer of the company under penalty of section 609.63, attesting that a plan meeting the requirements of section 115D.07 has been prepared and also attesting to the accuracy of the information in the progress report.\n(a) The commissioner of public safety shall review all progress reports to determine if they meet the requirements of subdivision 1. If the commissioner of public safety determines that a progress report does not meet the requirements, the commissioner of public safety shall notify the facility in writing and shall identify specific deficiencies and specify a reasonable time period of not less than 90 days for the facility to modify the progress report.\n(b) The commissioner of public safety shall be given access to a facility plan required under section 115D.07 if the commissioner of public safety determines that the progress report for that facility does not meet the requirements of subdivision 1. Twenty-five or more persons living within ten miles of the facility may submit a petition to the commissioner of public safety that identifies specific deficiencies in the progress report and requests the commissioner of public safety to review the facility plan. Within 30 days after receipt of the petition, the commissioner of public safety shall respond in writing. If the commissioner of public safety agrees that the progress report does not meet requirements of subdivision 1, the commissioner of public safety shall be given access to the facility plan.\n(c) After reviewing the plan and the progress report with any modifications submitted, the commissioner of public safety shall state in writing whether the progress report meets the requirements of subdivision 1. If the commissioner of public safety determines that a modified progress report still does not meet the requirements of subdivision 1, the commissioner of public safety shall schedule a public meeting. The meeting shall be held in the county where the facility is located. The meeting is not subject to the requirements of chapter 14.\n(d) The facility shall be given the opportunity to amend the progress report within a period of not less than 30 days after the public meeting.\n(e) If the commissioner of public safety determines that a modified progress report still does not meet the requirements of subdivision 1, action may be taken under section 115.071 to obtain compliance with sections 115D.01 to 115D.12.",
	"repealed": false
}