{
	"id": "136F.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.31",
	"title": "136F.31 CENTERS OF EXCELLENCE.",
	"text": "The board must designate at least three and up to eight different program centers of excellence. The board must determine the form and required information contained in applications from member institutions.\nThe board must select programs based on institutional proposals demonstrating:\n(1) the capacity to build multistate regional or national recognition of the program within five years;\n(2) a commitment to expanding the influence of the center to improve results in related programs in participating institutions;\n(3) the capacity to improve employment placement and income expectations of graduates from the program;\n(4) a strong partnership between a four-year and at least one two-year institution that maximizes the leverage of academic and training capacities in each institution;\n(5) a comprehensive academic plan that includes a seamless continuum of academic offerings in the program area that supports career development at multiple levels in related employment fields;\n(6) a specific development plan that includes a description of how the institution will pursue continuous improvement and accountability;\n(7) identified commitments from employers that include measurable financial and programmatic commitment to the center of excellence on the part of employers who will benefit from the development of the center. A center for teacher education must demonstrate support from local school districts;\n(8) a commitment from the institution that the new designated funding will not supplant current budgets from related programs;\n(9) a strong existing program upon which the proposed center will build; and\n(10) a separate fund for donations dedicated for the program within current institutional foundations.\nThe board may adopt additional criteria that promote general goals of the centers. The board shall give priority to programs that integrate the academic and training outcomes of the center with business clusters that have a significant multiplier effect on the state's economy based on projections of job, income, or general economic growth. The board shall consult with the Department of Employment and Economic Development to identify these clusters and the potential economic impact of developing a center for excellence.\nA center of excellence must create an advisory committee representing local, statewide, and national leaders in the field. By January 15 of each odd-numbered year, each designated center must provide a report to the governor and the chairs of committees of the legislature with jurisdiction over higher education finance, that includes annual and integrated data on program enrollment, student demographics, student admission data, endowment growth, graduation rates, graduation outcomes, employer involvement, indicators of student or graduate employment success, and other outcomes as determined by the board. After a center has been in existence for three years, the report must include measures of the program's impact on the local economy.",
	"repealed": false
}