{
	"id": "544.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/544.41",
	"title": "544.41 PRODUCT LIABILITY; LIMIT ON LIABILITY OF NONMANUFACTURERS.",
	"text": "In any product liability action based in whole or in part on strict liability in tort commenced or maintained against a defendant other than the manufacturer, that party shall upon answering or otherwise pleading file an affidavit certifying the correct identity of the manufacturer of the product allegedly causing injury, death or damage. The commencement of a product liability action based in whole or part on strict liability in tort against a certifying defendant shall toll the applicable statute of limitation relative to the defendant for purposes of asserting a strict liability in tort cause of action.\nOnce the plaintiff has filed a complaint against a manufacturer and the manufacturer has or is required to have answered or otherwise pleaded, the court shall order the dismissal of a strict liability in tort claim against the certifying defendant, provided the certifying defendant is not within the categories set forth in subdivision 3. Due diligence shall be exercised by the certifying defendant in providing the plaintiff with the correct identity of the manufacturer and due diligence shall be exercised by the plaintiff in filing a law suit and obtaining jurisdiction over the manufacturer.\nThe plaintiff may at any time subsequent to dismissal move to vacate the order of dismissal and reinstate the certifying defendant, provided plaintiff can show one of the following:\n(1) that the applicable statute of limitation bars the assertion of a strict liability in tort cause of action against the manufacturer of the product allegedly causing the injury, death or damage;\n(2) that the identity of the manufacturer given to the plaintiff by the certifying defendant was incorrect. Once the correct identity of the manufacturer has been given by the certifying defendant the court shall again dismiss the certifying defendant;\n(3) that the manufacturer no longer exists, cannot be subject to the jurisdiction of the courts of this state, or, despite due diligence, the manufacturer is not amenable to service of process;\n(4) that the manufacturer is unable to satisfy any judgment as determined by the court; or\n(5) that the court determines that the manufacturer would be unable to satisfy a reasonable settlement or other agreement with plaintiff.\nA court shall not enter a dismissal order relative to any certifying defendant even though full compliance with subdivision 1 has been made where the plaintiff can show one of the following:\n(1) that the defendant has exercised some significant control over the design or manufacture of the product, or has provided instructions or warnings to the manufacturer relative to the alleged defect in the product which caused the injury, death or damage;\n(2) that the defendant had actual knowledge of the defect in the product which caused the injury, death or damage; or\n(3) that the defendant created the defect in the product which caused the injury, death or damage.\nNothing contained in subdivisions 1 to 3 shall be construed to create a cause of action in strict liability in tort or based on other legal theory, or to affect the right of any person to seek and obtain indemnity or contribution.",
	"repealed": false
}