{
	"id": "356.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.42",
	"title": "356.42 POSTRETIREMENT ADJUSTMENT; LUMP-SUM PAYMENTS.",
	"text": "A person who is receiving a retirement annuity, a disability benefit, or a surviving spouse's annuity or benefit from a retirement fund specified in subdivision 3, clauses (1) to (8), is entitled to receive a postretirement adjustment from the applicable retirement fund in the amount specified in subdivision 2, if the annuity or benefit was computed under:\n(1) the laws in effect before June 1, 1973, if the person is receiving an annuity or benefit from the retirement fund specified in subdivision 3, clause (4);\n(2) the laws in effect before July 1, 1973, if the person is receiving an annuity or benefit from a retirement fund specified in subdivision 3, clause (1), (2), (3), or (5);\n(3) the Metropolitan Transit Commission transit operating division employees retirement fund plan document in effect on or before December 31, 1977, if the person is receiving a retirement annuity, a disability benefit, or a surviving spouse's annuity or benefit from the retirement fund specified in subdivision 3, clause (5);\n(4) the laws in effect before May 1, 1974, and before any adjustment under Laws 1987, chapter 372, article 3, if the person is receiving an annuity or benefit from the retirement fund specified in subdivision 3, clause (6);\n(5) the laws in effect before January 1, 1970, if the person is receiving an annuity or benefit from the retirement fund specified in subdivision 3, clause (7); or\n(6) the laws in effect before June 30, 1971, if the person is receiving an annuity or benefit from the retirement fund specified in subdivision 3, clause (8).\n(a) For any person receiving an annuity or benefit on November 30, 1989, and entitled to receive a postretirement adjustment under subdivision 1, the postretirement adjustment is a lump-sum payment calculated under paragraph (b) or (c).\n(b) For coordinated plan annuity or benefit recipients, the postretirement adjustment in 1989 is $25 for each full year of allowable service credited to the person by the respective retirement fund. In 1990 and each following year, the postretirement adjustment is the amount payable in the preceding year increased by the same percentage applied to regular annuities paid from the postretirement fund or, for the retirement funds specified in subdivision 3, clauses (6), (7), and (8), by the same percentage applied under the articles of incorporation and bylaws of these funds.\n(c) For basic plan annuity or benefit recipients, the postretirement adjustment in 1989 is the greater of:\n(1) $25 for each full year of allowable service credited to the person by the respective retirement fund; or\n(2) the difference between:\n(i) the product of $400 times the number of full years of allowable service credited to the person by the respective retirement fund; and\n(ii) the sum of the benefits payable to the person from any Minnesota public employee pension plan, and cash benefits payable to the person from the Social Security Administration.\nIn 1990 and each following year, each eligible basic plan annuity or benefit recipient shall receive the amount received in the preceding year increased by the same percentage applied to regular annuities paid from the postretirement fund or, for the retirement funds specified in subdivision 3, clauses (6), (7), and (8), by the same percentage applied under the articles of incorporation and bylaws of these funds.\n(d) The postretirement adjustment provided for in this section must be paid on December 1 to those persons receiving an annuity or benefit on the preceding November 30. This section does not authorize the payment of a postretirement adjustment to an estate if the annuity or benefit recipient dies before the November 30 eligibility date. The postretirement adjustment provided for in this section must be paid automatically unless the intended recipient files a written notice with the retirement fund requesting that the postretirement adjustment not be paid or returns the amount of adjustment to the retirement fund. Written notice of the waiver of the postretirement adjustment is irrevocable for the year during which it was made.\nThe postretirement adjustment provided in this section applies to the following retirement funds:\n(1) the general employees retirement plans of the Public Employees Retirement Association;\n(2) the public employees police and fire plan of the Public Employees Retirement Association;\n(3) the teachers retirement association;\n(4) the State Patrol retirement plan;\n(5) the state employees retirement plan of the Minnesota State Retirement System; and\n(6) the St. Paul Teachers Retirement Fund Association established under chapter 354A.",
	"repealed": false
}