{
	"id": "480.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.40",
	"title": "480.40 PERSONAL INFORMATION; DISSEMINATION.",
	"text": "(a) For purposes of this section and section 480.45, the following terms have the meanings given.\n(b) \"Judicial official\" means:\n(1) every Minnesota district court judge, senior judge, retired judge, and every judge of the Minnesota Court of Appeals and every active, senior, recalled, or retired federal judge who resides in Minnesota;\n(2) a justice of the Minnesota Supreme Court;\n(3) employees of the Minnesota judicial branch;\n(4) judicial referees and magistrate judges; and\n(5) current and retired judges and current employees of the Office of Administrative Hearings, Workers' Compensation Court of Appeals, and Tax Court.\n(c) \"Personal information\" does not include publicly available information. Personal information means:\n(1) a residential address of a judicial official;\n(2) a residential address of the spouse, domestic partner, or children of a judicial official;\n(3) a nonjudicial branch issued telephone number or email address of a judicial official;\n(4) the name of any child of a judicial official; and\n(5) the name of any child care facility or school that is attended by a child of a judicial official if combined with an assertion that the named facility or school is attended by the child of a judicial official.\n(d) \"Publicly available information\" means information that is lawfully made available through federal, state, or local government records or information that a business has a reasonable basis to believe is lawfully made available to the general public through widely distributed media, by a judicial official, or by a person to whom the judicial official has disclosed the information, unless the judicial official has restricted the information to a specific audience.\n(e) \"Law enforcement support organizations\" do not include charitable organizations.\nSubject to the exceptions in subdivision 3 and the requirements of section 480.45, no person, business, association, or government entity shall knowingly publicly post, display, publish, sell, or otherwise make available on the Internet the personal information of any judicial official. Personal information shall be kept in a secure manner to prevent unauthorized access. Personal information may be disseminated pursuant to a specific authorization in law, rule, or with the written consent of the judicial official.\nSubdivision 2 does not apply to:\n(1) the dissemination of personal information if the information is relevant to and displayed as part of a news story, commentary, editorial, or other speech on a matter of public concern;\n(2) personal information that the judicial official voluntarily disseminates publicly after August 1, 2024;\n(3) the dissemination of personal information made at the request of the judicial official or which is necessary to effectuate the request of a judicial official;\n(4) a commercial entity using personal information internally, providing access to businesses under common ownership or affiliated by corporate control, or selling or providing data for a transaction or service requested by or concerning the individual whose personal information is being transferred;\n(5) a commercial entity providing publicly available information through real-time or near real-time alert services for health or safety purposes;\n(6) a commercial entity engaged in the collection, maintenance, disclosure, sale, communication, or use of any personal information bearing on a consumer's credit worthiness, credit standing, credit capacity, character, general reputation, personal characteristics, or mode of living by a consumer reporting agency, furnisher, or user that provides information for use in a consumer report, and by a user of a consumer report, but only to the extent that such activity is regulated by and authorized under the federal Fair Credit Reporting Act, United States Code, title 15, section 1681, et seq.;\n(7) a consumer reporting agency subject to the federal Fair Credit Reporting Act, United States Code, title 15, section 1681, et seq.;\n(8) a commercial entity using personal information collected, processed, sold, or disclosed in compliance with the federal Driver's Privacy Protection Act of 1994, United States Code, title 18, section 2721, et seq.;\n(9) a commercial entity using personal information to do any of the following: prevent, detect, protect against, or respond to security incidents, identity theft, fraud, harassment, malicious or deceptive activities, or any illegal activity; preserve the integrity or security of systems; or investigate, report, or prosecute any person responsible for any such action;\n(10) a financial institution, affiliate of a financial institution, or data subject to title V of the federal Gramm-Leach-Bliley Act, United States Code, title 15, section 6801, et seq.;\n(11) a covered entity or business associate for purposes of the federal privacy regulations promulgated under the federal Health Insurance Portability and Accountability Act of 1996, specifically United States Code, title 42, section 1320d-2 note;\n(12) insurance and insurance support organizations;\n(13) law enforcement agencies or law enforcement support organizations and vendors that provide data support services to law enforcement agencies;\n(14) the collection and sale or licensing of covered information incidental to conducting the activities described in clauses (4) to (13); and\n(15) personal information contained in:\n(i) real property records as defined in section 13.045, subdivision 1, clause (5);\n(ii) uniform commercial code filings and tax liens maintained by the secretary of state; and\n(iii) any other records maintained by a government entity evidencing title to, or any lien, judgment, or other encumbrance on, real or personal property.",
	"repealed": false
}