{
	"id": "475.522",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.522",
	"title": "475.522 GRANT ANTICIPATION FINANCING OF TRANSPORTATION OR TRANSIT PROJECTS.",
	"text": "For purposes of this section, the term \"political subdivision\" means a county or a statutory or home rule charter city, and the term \"issuing political subdivision\" means a political subdivision that issues obligations under subdivision 2.\nAn issuing political subdivision may enter into agreements with any other political subdivision of the state, within or without its jurisdiction, and any state agency, with respect to federal grants for transportation or transit projects to be received directly or indirectly by or on behalf of the political subdivision or agency, under an executed grant agreement with the relevant federal agency. The agreements may provide that the political subdivision or agency will pledge to the issuing political subdivision all or a specified portion of the federal grants received by or on behalf of the political subdivision or agency for a specified period of years, or until all obligations issued by the issuing political subdivision under subdivision 3 with respect to those federal grants have been paid or legally defeased. If the issuing political subdivision issues obligations under subdivision 3, the agreements must provide the method by which the proceeds of the obligations will be used to pay or reimburse the costs of the transportation or transit projects relating to the federal grants described in the executed federal grant agreement.\nIn anticipation of any federal grants for transportation or transit projects to be received directly or indirectly by any political subdivision or agency as specified in subdivision 1, or by an issuing political subdivision with respect to any transportation or transit projects within its jurisdiction, an issuing political subdivision may issue its obligations payable from the collections of those federal grants. The obligations may be issued in the principal amount the issuing political subdivision determines provided that the estimated collections of the federal grants under the relevant executed federal grant agreement in each year in which the obligations will be outstanding must be at least equal to:\n(1) if the obligations are to be issued as revenue obligations, 150 percent of the maximum annual debt service on the obligations; or\n(2) if the obligations are to be issued as general obligations, 110 percent of the maximum annual debt service on the obligations.\nExcept as otherwise provided in this section, the issuing political subdivision shall provide for the issuance, sale, and security of the obligations as provided in chapter 475, and has the same powers and duties as a municipality issuing bonds under that law, except that no election is required and the net debt limitations in chapter 475 do not apply to the obligations. The issuing political subdivision may determine to issue the obligations as revenue obligations, payable solely from the collections of the federal grants anticipated, or may pledge its full faith and credit to the payment of the obligations.\nThe proceeds of the obligations must be used:\n(1) to pay or reimburse the costs of the transportation or transit projects relating to the federal grants being anticipated;\n(2) to pay the costs of issuance of the obligations, including credit enhancement;\n(3) to pay interest on the obligations for a period not exceeding three years from their date of issue; and\n(4) if the full faith and credit of the issuing political subdivision is not pledged to the payment of the obligations, to fund a debt service reserve fund for the obligations.",
	"repealed": false
}