{
	"id": "326B.083",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.083",
	"title": "326B.083 AMOUNT OF PENALTY; CONTENTS OF ADMINISTRATIVE AND LICENSING ORDERS.",
	"text": "In determining the amount of a penalty assessed under section 326B.082, subdivision 7 or 12, the commissioner shall consider the factors described in section 14.045, subdivision 3.\n(a) An administrative order and a licensing order must include:\n(1) a summary of the facts that constitute the violation or violations;\n(2) a reference to the applicable law that has been violated; and\n(3) a statement of the person's right to request a hearing.\n(b) An administrative order may include a requirement that the violation be corrected. If the order includes a requirement that the violation be corrected, then the order must include, in addition to any statements required under paragraphs (a) and (c), the deadline by which the violation must be corrected.\n(c) An administrative order or a licensing order may assess monetary penalties. If the order assesses monetary penalties, then the order must include, in addition to any statements required under paragraphs (a) and (b):\n(1) a statement of the amount of the monetary penalty imposed;\n(2) a statement that, when the order becomes final, the commissioner may file and enforce the unpaid portion of a penalty as a judgment in district court without further notice or additional proceedings; and\n(3) if the order is an administrative order, a statement of the amount of the penalty, if any, that will be forgiven if the person who is subject to the order demonstrates to the commissioner by the 31st day after the order is served that the person has corrected the violation or has developed a correction plan acceptable to the commissioner.\n(a) If an administrative order includes a penalty assessment, then the penalty is due and payable on the date the administrative order becomes final unless some or all of the penalty is forgivable. If a licensing order includes a penalty assessment, then the penalty is due and payable on the date the licensing order becomes final.\n(b) This paragraph applies if an administrative order includes a penalty assessment and all or a portion of the penalty is forgivable.\n(1) If any portion of the penalty is not forgivable, that portion of the penalty is due and payable ten days after the date the administrative order becomes final.\n(2) The commissioner shall forgive the forgivable portion of the penalty if the commissioner determines that the violation has been corrected within the time set by the order or the person to whom the order was issued has developed a correction plan acceptable to the commissioner within the time set by the order.\n(3) If the commissioner determines that the person to whom the order was issued has failed to correct the violation within the time set by the order or has failed to develop a correction plan acceptable to the commissioner within the time set by the order, then the forgivable portion of the penalty is due and payable 20 days after the commissioner serves notice of the determination on the person or on the date the administrative order becomes final, whichever is later.\n(c) This paragraph applies if an administrative order or a licensing order includes a penalty assessment and if the person subject to the order has requested a hearing. The administrative law judge may not recommend a change in the amount of the penalty if the penalty was assessed in accordance with a plan prepared under section 326B.082, subdivision 14. If the commissioner has not prepared a plan under section 326B.082, subdivision 14, then the administrative law judge may not recommend a change in the amount of the penalty unless the administrative law judge determines that, based on the factors in section 14.045, subdivision 3, the amount of the penalty is unreasonable.\n(d) The assessment of a penalty does not preclude the use of other enforcement provisions, under which penalties are not assessed, in connection with the violation for which the penalty was assessed.",
	"repealed": false
}