{
	"id": "477B.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.041",
	"title": "477B.041 ALLOCATION OF FIRE STATE AID FOR THE STATEWIDE VOLUNTEER FIREFIGHTER PLAN.",
	"text": "For the purposes of this section, unless the language or context clearly indicates that a different meaning is intended, the following terms have the meanings given to them:\n(1) \"Active volunteer firefighter\" means a member of the statewide volunteer firefighter plan as defined in section 353G.01, subdivision 8.\n(2) \"Chief petitioning firefighter\" means an active volunteer firefighter who, on behalf of petitioning firefighters, submits a petition to stop an aid allocation plan under subdivision 6 to the executive director.\n(3) \"Combination department\" means a municipality or independent nonprofit firefighting corporation which, during the previous calendar year and on January 1, 2021:\n(i) employed one or more firefighters covered by the statewide volunteer firefighter plan; and\n(ii) contributed on behalf of one or more firefighters to the public employees police and fire retirement plan under chapter 353.\n(4) \"Covered period\" means the period covered by the aid allocation plan beginning with the calendar year immediately following the calendar year in which the plan is approved and continuing for not more than three years.\n(5) \"Executive director\" means the executive director of the Public Employees Retirement Association.\n(6) \"Reimbursement amount\" means the amount calculated under subdivision 4, which reimburses a combination department for employer contributions made to the public employees police and fire retirement plan on behalf of covered firefighters.\n(7) \"Total state aid\" means the combined total of fire state aid and police and firefighter supplemental state aid payable to the Public Employees Retirement Association on behalf of a combination department on October 1 under sections 477B.04, subdivision 1, and 423A.022, subdivision 4, respectively.\nBeginning on March 1 of each year, a combination department may submit to the executive director an aid allocation plan that conforms with the requirements in this paragraph. The aid allocation plan must:\n(1) be approved by the governing body of the combination department;\n(2) be in writing and specify:\n(i) the percentage of the fire state aid, dollar amount, or formula for determining the amount of fire state aid that will be transmitted to the combination department as the reimbursement amount; and\n(ii) the covered period;\n(3) be signed by the municipal clerk or secretary; and\n(4) include the date that notice was provided to firefighters under subdivision 7.\nThe executive director shall approve an aid allocation plan submitted by a combination department if:\n(1) the aid allocation plan is submitted on or after March 1;\n(2) the aid allocation plan meets the requirements in subdivision 2; and\n(3) within 45 days after receipt of the aid allocation plan, the executive director has not received a petition to stop aid allocation described in subdivision 6.\n(a) Fire state aid covered by an approved aid allocation plan must be deposited in accordance with this subdivision. Within 30 days after receipt of the fire state aid, the executive director must transmit the reimbursement amount to the combination department. The reimbursement amount must not exceed the smallest of the following amounts:\n(1) the percentage, dollar amount, or formula specified by the combination department under subdivision 2;\n(2) the combination department's total employer contribution to the public employees police and fire retirement plan on behalf of firefighters during the preceding calendar year;\n(3) the amount of fire state aid payable to the Public Employees Retirement Association on behalf of the combination department on October 1 of the current calendar year under section 477B.04, subdivision 1;\n(4) the amount determined by subtracting from the combination department's total state aid the combination department's annual funding requirement under section 353G.08 as calculated on or before August 1 for the current year; or\n(5) the amount determined by subtracting from the combination department's total state aid the amount required to increase the funding ratio of the combination department's account to not less than 100 percent as of the date of the valuation used to determine the funding requirement under clause (4).\n(b) After transmitting the reimbursement amount, the executive director must immediately credit any remaining fire state aid against the combination department's annual funding requirement under section 353G.08. The executive director must notify the combination department of the disposition of fire state aid within 30 days of transmission of the reimbursement amount.\n(c) Fire state aids payable before or after the covered period must be credited as if no aid allocation plan has been approved under section 477B.04, subdivision 3, paragraph (a).\n(a) The governing body of a combination department may terminate an aid allocation plan at any time by submitting a notice of termination to the executive director.\n(b) A combination department may modify an aid allocation plan at any time during the covered period by submitting a modified aid allocation plan to the executive director. The modified aid allocation plan must meet the requirements of an aid allocation plan under subdivision 3.\n(c) The termination or modification of an aid allocation plan applies only to subsequent fire state aid payments and does not affect any reimbursement amount already transmitted to the combination department.\n(d) The combination department must provide notice of any modification or termination as required under subdivision 7.\n(a) Within 45 days after a combination department submits an aid allocation plan or modified aid allocation plan to the executive director, an active volunteer firefighter employed by the combination department may submit to the executive director a petition to stop the aid allocation plan. The petition must be in a form prescribed by the executive director. The executive director must reject an aid allocation plan or modified aid allocation plan as a result of the petition if:\n(1) the executive director receives the petition to stop the aid allocation plan within 45 days after receiving an aid allocation plan or modified aid allocation plan for the same combination department; and\n(2) the petition to stop aid allocation is in writing and includes the names and signatures of a majority of the active volunteer firefighters employed by the combination department and the name and contact information for the chief petitioning firefighter.\n(b) When determining whether a petition includes the names and signatures of a majority of the active volunteer firefighters affiliated with the combination department, the executive director must verify that the names provided match the active volunteer firefighter records maintained by the Public Employees Retirement Association.\n(c) Upon receipt of a petition to stop aid allocation, the executive director must immediately notify the combination department that a petition was received. Within 15 days after receipt of the petition to stop aid allocation, the executive director must report to the combination department and the chief petitioning firefighter whether the aid allocation plan was rejected as a result of the petition.\n(d) If an aid allocation plan is rejected as a result of a petition, the combination department may revise the aid allocation plan and submit the revised plan, subject to the requirements in this section, including the notice under subdivision 7 and the firefighters' right to petition to stop aid allocation under the revised plan under subdivision 6.\nWithin 30 days before submitting to the executive director an aid allocation plan or modification or termination of an aid allocation plan, the combination department must notify all active volunteer firefighters employed by the combination department in writing. The notice must include a copy of the aid allocation plan, modified aid allocation plan, or notice of termination approved by the governing body of the combination department.\nThe executive director must prescribe a form of petition that satisfies the requirements of subdivision 6 and may prescribe other forms as required for the administration of this section.",
	"repealed": false
}