{
	"id": "148F.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.035",
	"title": "148F.035 TEMPORARY PERMIT.",
	"text": "(a) The board may issue a temporary permit to practice alcohol and drug counseling to an individual prior to being licensed under this chapter if the person:\n(1) received an associate degree, or an equivalent number of credit hours, completed 880 clock hours of supervised alcohol and drug counseling practicum, and 18 semester credits or 270 clock hours of academic course work in alcohol and drug counseling from an accredited school or education program; and\n(2) completed academic course work in the following areas:\n(i) overview of the transdisciplinary foundations of alcohol and drug counseling, including theories of chemical dependency, the continuum of care, and the process of change;\n(ii) pharmacology of substance abuse disorders and the dynamics of addiction, including substance use disorder treatment with medications for opioid use disorder;\n(iii) professional and ethical responsibilities;\n(iv) multicultural aspects of chemical dependency;\n(v) co-occurring disorders; and\n(vi) core functions defined in section 148F.01, subdivision 10.\n(b) An individual seeking a temporary permit shall fully complete and submit a notarized written application on forms provided by the board together with the nonrefundable temporary permit fee specified in section 148F.115, subdivision 3, clause (1).\n(c) An individual practicing under this section:\n(1) must be supervised by a licensed alcohol and drug counselor or other licensed professional practicing alcohol and drug counseling under section 148F.11, subdivision 1;\n(2) is subject to all statutes and rules to the same extent as an individual who is licensed under this chapter, except the individual is not subject to the continuing education requirements of section 148F.075; and\n(3) must use the title \"Alcohol and Drug Counselor-Trainee\" or the letters \"ADC-T\" in professional activities.\n(d)(1) An individual practicing with a temporary permit must submit a renewal application annually on forms provided by the board with the renewal fee required in section 148F.115, subdivision 3.\n(2) A temporary permit is automatically terminated if not renewed, upon a change in supervision, or upon the granting or denial by the board of the applicant's application for licensure as an alcohol and drug counselor.\n(3) A temporary permit may be renewed no more than five times.",
	"repealed": false
}