{
	"id": "103G.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.511",
	"title": "103G.511 PUBLICLY OWNED DAM REPAIR.",
	"text": "The commissioner may:\n(1) repair or reconstruct state-owned dams;\n(2) make engineering evaluations related to the repair or reconstruction of dams owned by political subdivisions; and\n(3) grant aid to political subdivisions to repair or reconstruct dams owned by political subdivisions.\nThe engineering evaluations may include studies of the feasibility, practicality, and environmental effects of using dams for hydroelectric power generation.\n(a) Except as provided in this section, a grant to a political subdivision may not exceed the amount contributed to the project by the political subdivision from local funds.\n(b) Federal general revenue sharing money may be counted as local funds, but other federal grants or loans must be used to reduce equally the state share and the local share of project costs.\n(c) A grant to study the feasibility, practicality, and environmental effects of using a dam for hydroelectric power generation may be for an amount up to 90 percent of the costs of the study.\nThe commissioner may repair or reconstruct a state-owned dam or make a grant to a political subdivision only after making an investigation of the dam.\nA political subdivision desiring a grant for the repair or reconstruction of a dam may apply for the grant on forms supplied by the commissioner.\nThe commissioner shall consider all relevant factors in determining whether to repair or reconstruct a state-owned dam or to make a grant to a political subdivision including:\n(1) the age and type of construction of the dam;\n(2) the use of the dam for water supply, flood control, navigation, hydroelectric power generation, recreation, wildlife management, scenic value, or other purposes related to public health, safety, and welfare;\n(3) the consequences of abandonment, removal, or alteration of the dam;\n(4) prospective future uses of the dam; and\n(5) the relative importance of the dam to the statewide water resource program.\nThe commissioner may hold a public hearing under section 103G.311 on the proposed repair or reconstruction after giving notice. If the hearing is held at the request of a political subdivision, the costs of publishing notice and of taking and preparing the stenographic record must be paid by the political subdivision.\nTo receive a grant, the political subdivision must enter into an agreement with the commissioner giving assurance that the government unit will operate and maintain the dam in a safe condition for the benefit of the public and must agree to other conditions the commissioner considers reasonable.\n(a) If the cost of repair or reconstruction of a state-owned dam or a grant to a political subdivision is less than $250,000, the commissioner may direct that the state-owned dam be repaired or reconstructed or that a grant be made to repair or reconstruct a dam owned by a political subdivision.\n(b) If the cost of repair or reconstruction of a state-owned claim or grant to a political subdivision is $250,000 or more, the commissioner may recommend the project to the legislature for its consideration and action, except in an emergency under paragraph (c).\n(c) The commissioner, with the approval of the commissioner of management and budget after consulting with the legislative advisory commission, may direct that a state-owned dam be repaired or reconstructed or a grant be made to a political subdivision if the commissioner determines that an emergency exists and:\n(1) there is danger that life will be lost; or\n(2) that substantial property losses will be suffered if action is not promptly taken.\n(a) If the commissioner decides to recommend a dam repair or reconstruction grant for a political subdivision to the legislature, the commissioner must notify the political subdivision and the commissioner of management and budget of the decision. After being notified by the commissioner of natural resources, the political subdivision may apply to the commissioner of management and budget on forms supplied by the commissioner of management and budget for a loan up to 90 percent of the local share of the project costs.\n(b) The loan is repayable over a period not longer than 20 years, with interest at a rate sufficient to cover the cost to the state of borrowing the money.\n(c) A political subdivision receiving a dam safety loan must levy for the loan payment in the year the loan proceeds were received and each later year, until the loan is paid. The levy must be for:\n(1) the amount of the annual loan payment; or\n(2) the amount of the loan payment less the amount the political subdivision certifies is available from other sources for the loan payment.\n(d) Upon approval of the project grant by the legislature, the commissioner of management and budget shall make the loan in an amount and on terms that are appropriate. Loans made under this subdivision do not require approval by the electors of the political subdivision as provided in section 475.58.\n(e) Principal and interest payments received by the commissioner of management and budget in repayment of these loans are appropriated to the state bond fund.\n(a) If a political subdivision fails to comply with a commissioner's order to repair or remove a dam under section 103G.515, the commissioner may repair or remove the dam as provided in this subdivision.\n(b) The commissioner must hold a hearing under section 103G.311 on the failure of the political subdivision to repair or remove the dam. After the hearing, the commissioner must make findings specifying the failure of the political subdivision to act and shall, by order, assume the powers of the legislative authority of the political subdivision in regard to the repair or removal of dams.\n(c) After issuing the order, the commissioner has the same powers, insofar as applicable to the repair or removal of dams, as the commissioners of administration and the Pollution Control Agency have in the construction, installation, maintenance, or operation of a municipal disposal system, or part of a system, or issuing bonds and levying taxes under section 115.48.\nAfter reviewing examinations of dams owned by the state and political subdivisions, the commissioner shall prioritize the state and political subdivision dams in need of repair, reconstruction, or removal and report by June 1 of each odd-numbered year to the legislature. The commissioner must prioritize projects considering danger to life, damage to property, and the factors listed in subdivision 6.",
	"repealed": false
}