{
	"id": "463.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/463.251",
	"title": "463.251 SECURING VACANT BUILDINGS.",
	"text": "The following terms have the meanings given them for the purposes of this section.\n(a) \"City\" means a statutory or home rule charter city.\n(b) \"Neighborhood association\" means an organization recognized by the city as representing a neighborhood within the city.\n(c) \"Secure\" may include, but is not limited to, installing locks, repairing windows and doors, boarding windows and doors, posting \"no-trespassing\" signs, installing exterior lighting or motion-detecting lights, fencing the property, and installing a monitored alarm or other security system.\n(a) If in any city a building becomes vacant or unoccupied and is deemed hazardous due to the fact that the building is open to trespass and has not been secured and the building could be made safe by securing the building, the governing body may order the building secured and shall cause notice of the order to be served upon the owner of record of the premises or the owner's agent, the taxpayer identified in the property tax records for that parcel, the holder of the mortgage or sheriff's certificate, and any neighborhood association for the neighborhood in which the building is located that has requested notice, by delivering or mailing a copy to the owner or agent, the identified taxpayer, the holder of the mortgage or sheriff's certificate, and the neighborhood association, at the last known address. Service by mail is complete upon mailing.\n(b) The notice under this subdivision must include a statement that:\n(1) informs the owner and the holder of any mortgage or sheriff's certificate of the requirements of subdivision 3 and that costs may be assessed against the property if the person does not secure the building;\n(2) informs the owner and the holder of any mortgage or sheriff's certificate that the person may request a hearing before the governing body challenging the governing body's determination that the property is vacant or unoccupied and hazardous; and\n(3) notifies the holder of any sheriff's certificate of the holder's duty under section 582.031, subdivision 1, paragraph (b), to enter the premises to protect the premises from waste and trespass if the order is not challenged or set aside and there is prima facie evidence of abandonment of the property as described in section 582.032, subdivision 7.\nIf the owner of the building or a holder of the sheriff's certificate of sale fails to either comply or provide to the governing body a reasonable plan and schedule to comply with an order issued under subdivision 2 or to request a hearing on the order within six days after the order is served, the governing body shall cause the building to be properly secured and the cost of securing the building may be charged against the real estate as provided in section 463.21. In the metropolitan area, as defined in section 473.121, subdivision 2, the governing body may work with neighborhood associations to develop and implement plans to secure vacant buildings in a timely and cost-effective fashion. The city may use rehabilitation and revitalization funds in implementing this section.\nA city may provide by ordinance for emergency securing of a building that presents an immediate danger to the health and safety of persons in the community.",
	"repealed": false
}