{
	"id": "179.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.14",
	"title": "179.14 INJUNCTIONS; TEMPORARY RESTRAINING ORDERS.",
	"text": "When any unfair labor practice is threatened or committed, a suit to enjoin such practice may be maintained in the district court of any county wherein such practice has occurred or is threatened. In any suit to enjoin any of the unfair labor practices set forth in sections 179.11 and 179.12, the provisions of sections 185.02 to 185.19 shall not apply. No court of the state shall have jurisdiction to issue a temporary or permanent injunction in any case involving or growing out of the violation of sections 179.11 and 179.12, as herein defined, except after hearing the testimony of witnesses in open court, with opportunity for cross-examination, in support of the allegations made under oath, and testimony in opposition thereto, if offered, and except after findings of fact by the court to the effect that the acts set forth in sections 179.11 and 179.12 have been threatened and will be committed unless restrained, or have been committed and will be continued unless restrained. No temporary restraining order may be issued under the provisions of sections 179.01 to 179.17 except upon the testimony of witnesses produced by the applicant in open court and upon a record being kept of such testimony nor unless the temporary restraining order is returnable within seven days from the time it is granted which shall be noted on the order of the court. It shall be the duty of the court to give the trial or hearing of any suits or proceedings arising under this section precedence over all other civil suits which are ready for trial. Failure of the trial court to decide a motion for a temporary injunction within seven days from the date the hearing thereon is concluded shall dissolve any restraining order issued therein without further order of the court. Failure of the trial court to decide any suit brought under this section within 45 days from the date the trial was ended shall dissolve any restraining order or temporary injunction issued therein without further order of the court.",
	"repealed": false
}