{
	"id": "501B.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.45",
	"title": "501B.45 SALE OF BANKS OWNED BY CHARITABLE TRUSTS.",
	"text": "For the purpose of this section, \"charitable trust\" means a charitable trust subject to supervision by the attorney general under the Supervision of Charitable Trusts and Trustees Act, sections 501B.33 to 501B.45, that is required to divest excess business holdings by section 4943 of the Internal Revenue Code of 1986 and that owned 100 percent of a bank holding company on May 26, 1969, the date of enactment of section 4943 of the Internal Revenue Code of 1954.\nThe stock or assets of one or more banks or a bank holding company owned directly or indirectly by a charitable trust may be sold, assigned, merged, or transferred by the charitable trust under the procedures in section 48.93 to a bank holding company, bank, or other qualified entity as permitted by applicable banking laws without regard to whether the entity acquiring the stock or assets is located in a reciprocating state.\nIt is the express intention of the Minnesota legislature to act pursuant to United States Code, title 12, section 1842(d), to permit certain charitable trusts to sell, assign, or transfer certain financial institutions' assets without regard to whether the entity acquiring the assets of the charitable trust is located outside of this state.\nA bank holding company, other than a reciprocating state bank holding company as defined in section 48.92, subdivision 8, that directly or indirectly acquires control of a bank located in this state under the provisions of this section may acquire additional bank assets through the expenditure of an annual amount not to exceed five percent of the Minnesota assets of the acquired bank holding company as of December 31 of the preceding year. The restrictions within this subdivision apply only until the bank holding company making an acquisition under this section becomes a reciprocating state bank holding company. This section does not prohibit the bank holding company from being granted a charter for a de novo bank or from establishing de novo detached facilities pursuant to Minnesota law.",
	"repealed": false
}