{
	"id": "246C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.07",
	"title": "246C.07 POWERS AND DUTIES OF EXECUTIVE BOARD.",
	"text": "(a) The executive board must operate the agency according to this chapter and applicable state and federal law. The overall management and control of the agency is vested in the executive board in accordance with this chapter.\n(b) The executive board must appoint a chief executive officer according to section 246C.08. The chief executive officer is responsible for the administrative and operational duties of Direct Care and Treatment in accordance with this chapter.\n(c) The executive board may delegate duties imposed by this chapter and under applicable state and federal law as deemed appropriate by the board and in accordance with this chapter. Any delegation of a specified statutory duty or power to an employee of Direct Care and Treatment other than the chief executive officer must be made by written order and filed with the secretary of state. Only the chief executive officer shall have the powers and duties of the executive board as specified in section 246C.08.\nThe executive board, in undertaking its duties and responsibilities and within Direct Care and Treatment resources, shall act according to the following principles:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the agency as efficiently as possible;\n(3) coordinate Direct Care and Treatment activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government; and\n(5) utilize constructive and cooperative labor management practices to the extent otherwise required by chapter 43A or 179A.\n(a) The executive board has the power and duty to:\n(1) set the overall strategic direction for Direct Care and Treatment, ensuring that Direct Care and Treatment delivers exceptional care and supports the well-being of all individuals served by Direct Care and Treatment;\n(2) establish policies and procedures to govern the operation of the facilities, programs, and services under the direct authority of Direct Care and Treatment;\n(3) employ personnel and delegate duties and responsibilities to personnel as deemed appropriate by the executive board, subject to chapters 43A and 179A and in accordance with this chapter;\n(4) review and approve the operating budget proposal for Direct Care and Treatment;\n(5) accept and use gifts, grants, or contributions from any nonstate source or refuse to accept any gift, grant, or contribution if acceptance would not be in the best interest of the state;\n(6) deposit all money received as gifts, grants, or contributions pursuant to section 246C.091, subdivision 1;\n(7) expend or use any gift, grant, or contribution as nearly in accordance with the conditions of the gift, grant, or contribution identified by the donor for a certain institution or purpose, compatible with the best interests of the individuals under the jurisdiction of the executive board and of the state;\n(8) comply with all conditions and requirements necessary to receive federal aid or block grants with respect to the establishment, construction, maintenance, equipment, or operation of adequate facilities and services consistent with the mission of Direct Care and Treatment;\n(9) enter into information-sharing agreements with federal and state agencies and other entities, provided the agreements include adequate protections with respect to the confidentiality and integrity of the information to be shared and comply with all applicable state and federal laws, regulations, and rules;\n(10) enter into interagency or service level agreements with a state department listed in section 15.01; a multimember state agency described in section 15.012, paragraph (a); or the Department of Information Technology Services;\n(11) enter into contractual agreements with federally recognized Indian Tribes with a reservation in Minnesota;\n(12) enter into contracts with public and private agencies, private and nonprofit organizations, and individuals using appropriated money;\n(13) establish and maintain any administrative units reasonably necessary for the performance of administrative functions common to all programs or divisions of Direct Care and Treatment;\n(14) authorize the method of payment to or from Direct Care and Treatment as part of programs administered by Direct Care and Treatment, including authorization of the receipt or disbursement of money held by Direct Care and Treatment in a fiduciary capacity as part of the programs administered by Direct Care and Treatment;\n(15) inform Tribal Nations and county agencies, on a timely basis, of changes in statute, rule, federal law, regulation, and policy necessary to Tribal or county agency administration of Direct Care and Treatment programs and services;\n(16) report to the legislature on the performance of Direct Care and Treatment operations and the accomplishment of Direct Care and Treatment goals in its biennial budget in accordance with section 16A.10, subdivision 1;\n(17) recommend to the legislature appropriate changes in law necessary to carry out the principles and improve the performance of Direct Care and Treatment; and\n(18) exercise all powers reasonably necessary to implement and administer the requirements of this chapter and applicable state and federal law.\n(b) The specific enumeration of powers and duties as set forth in this section shall not be construed as a limitation upon the general transfer of Direct Care and Treatment facilities, programs, and services from the Department of Human Services to Direct Care and Treatment under this chapter.\nThe board may establish bylaws governing its operations and the operations of Direct Care and Treatment in accordance with this chapter.\nThe governor may request that the executive board review the performance of the chief executive officer at any time. Within 14 days of receipt of the request, the board must meet and conduct a performance review as specifically requested by the governor. During the performance review, a representative of the governor must be included as a voting member of the board for the purpose of the board's discussions and decisions regarding the governor's request. The board must establish a performance improvement plan as necessary or take disciplinary or other corrective action, including dismissal. The executive board must report to the governor on action taken by the board, including an explanation if no action is deemed necessary.\nThe executive board is authorized with the approval of the governor to enter into reciprocal agreements with duly authorized authorities of another state or states regarding the mutual exchange, return, and transportation of persons with a mental illness or developmental disability who are within the confines of one state but have legal residence or legal settlement for the purposes of relief in another state. Any agreement entered into under this subdivision must not contain any provision that conflicts with any state law.\nFor the purpose of carrying out a duty, the executive board may accept uncompensated and voluntary services and may enter into contracts or agreements with private or public agencies, organizations, or persons for uncompensated and voluntary services as the executive board deems practicable. Uncompensated and voluntary services do not include services mandated by licensure and certification requirements for health care facilities. The volunteer agencies, organizations, or persons who provide services to residents of state facilities operated under the authority of the executive board are not subject to the procurement requirements of chapters 16A and 16C.\nThe executive board shall prepare, for the use of the legislature, biennial estimates of appropriations necessary or expedient to be made for the support of the institutions and for extraordinary and special expenditures for buildings and other improvements. The executive board shall make suggestions relative to legislation for the benefit of the institutions. The executive board shall report the estimates and suggestions to the legislature on or before November 15 in each even-numbered year. A designee of the executive board on request shall appear before any legislative committee and furnish any required information in regard to the condition of any such institution.",
	"repealed": false
}