{
	"id": "65B.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.56",
	"title": "65B.56 COOPERATION OF PERSON CLAIMING BENEFITS.",
	"text": "Any person with respect to whose injury benefits are claimed under a plan of reparation security shall, upon request of the reparation obligor from whom recovery is sought, submit to a physical examination by a physician or physicians selected by the obligor as may reasonably be required.\nThe costs of any examinations requested by the obligor shall be borne entirely by the requesting obligor. Such examinations shall be conducted within the city, town, or statutory city of residence of the injured person. If there is no qualified physician to conduct the examination within the city, town, or statutory city of residence of the injured person, then such examination shall be conducted at another place of the closest proximity to the injured person's residence. Obligors are authorized to include reasonable provisions in policies for mental and physical examination of those injured persons.\nIf requested by the person examined, a party causing an examination to be made shall deliver to the examinee a copy of every written report concerning the examination rendered by an examining physician to that person, at least one of which reports must set out in detail the findings and conclusions of such examining physician.\nAn injured person shall also do all things reasonably necessary to enable the obligor to obtain medical reports and other needed information to assist in determining the nature and extent of the injured person's injuries and loss, and the medical treatment received. If the claimant refuses to cooperate in responding to requests for examination and information as authorized by this section, evidence of such noncooperation shall be admissible in any suit or arbitration filed for damages for such personal injuries or for the benefits provided by sections 65B.41 to 65B.71.\nThe provisions of this section apply before and after the commencement of suit.\nAny person receiving benefits under sections 65B.41 to 65B.71 shall participate and cooperate, as reasonably required under the coverage, in any and all arbitration proceedings as provided in section 65B.53 by or on behalf of the obligor paying the benefits, and the obligor may require in the furnishing of proof of loss the claimant's statement that the claimant shall so participate and cooperate as consideration for the payment of such benefits. However, no claimant may be required by any obligor which has paid or is obligated to pay benefits as herein provided to personally attend an arbitration proceeding which shall take place more than 50 miles from the usual residence of the claimant; and provided that in no event shall the claimant have to attend such an arbitration proceeding if, at the time scheduled for that meeting, travel thereto by the claimant is not recommended by a physician treating the claimant for injuries. Any claimant required to personally attend an arbitration proceeding shall be compensated by the reparation obligor requiring attendance for actual income loss and expenses reasonably incurred.",
	"repealed": false
}