{
	"id": "136A.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.62",
	"title": "136A.62 DEFINITIONS.",
	"text": "The following words, terms, and phrases shall have the meanings ascribed to them in this section for the purposes of sections 136A.61 to 136A.71.\n[Repealed, 2014 c 149 s 75]\n\"School\" means:\n(1) a Tribal college that has a physical presence in Minnesota;\n(2) any partnership, company, firm, society, trust, association, corporation, or any combination thereof, with a physical presence in Minnesota, which: (i) is, owns, or operates a private, nonprofit postsecondary education institution; (ii) is, owns, or operates a private, for-profit postsecondary education institution; or (iii) provides a postsecondary instructional program or course leading to a degree whether or not for profit; or\n(3) any public or private postsecondary educational institution located in another state or country with a physical presence in Minnesota.\n\"Tribal college\" means an institution of higher education located in this state that is formally controlled by or has been formally sanctioned or chartered by the governing body of a federally recognized Indian Tribe, or a combination of federally recognized Indian Tribes. Tribal college does not include any institution or campus subject to the jurisdiction of the Board of Trustees of the Minnesota State Colleges and Universities or the Board of Regents of the University of Minnesota.\n\"Degree\" means any award given by a school for completion of a program or course which is designated by the term degree, associate, bachelor, baccalaureate, masters, or doctorate, or any other award which the office shall include by rule.\n\"Records\" means those school documents and files containing student data relating to academic credits, grades, degrees awarded, periods of attendance, and such other matters as the office shall determine by rule.\nAn online platform service is a nondegree granting entity that provides online access to schools as defined in subdivision 3, to enable the schools to offer online training, courses, or programs.\n\"Entity\" means a specific school or campus location.\n\"Postsecondary education\" means the range of formal learning opportunities beyond high school, including those aimed at learning an occupation or earning an academic credential.\n\"Physical presence\" means a presence within the state of Minnesota for the purpose of conducting activity related to any program at the degree level or courses that may be applied to a degree program. Physical presence includes:\n(1) operating a location within the state;\n(2) offering instruction within or originating from Minnesota designed to impart knowledge with response utilizing teachers, trainers, counselors or computer resources, computer linking, or any form of electronic means; and\n(3) granting an educational credential from a location within the state or to a student within the state.\nPhysical presence does not include field trips, sanctioned sports recruiting activities, or college fairs or other assemblies of schools in Minnesota. No school may enroll an individual, allow an individual to sign any agreement obligating the person to the school, accept any moneys from the individual, or follow up with an individual by means of an in-person meeting in Minnesota at a college fair or assembly.",
	"repealed": false
}