{
	"id": "626.8435",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8435",
	"title": "626.8435 PUBLIC SAFETY ADVISORY COUNCIL.",
	"text": "The Public Safety Advisory Council is established under the Peace Officer Standards and Training Board. The council consists of the following 15 members:\n(1) the superintendent of the Bureau of Criminal Apprehension, or a designee;\n(2) the executive director of the Peace Officer Standards and Training Board, or a designee;\n(3) the executive director of the Minnesota Police and Peace Officers Association, or a designee;\n(4) the executive director of the Minnesota Sheriffs' Association, or a designee;\n(5) the executive director of the Minnesota Chiefs of Police Association, or a designee;\n(6) six community members, of which:\n(i) four members shall represent the community-specific boards established under sections 15.0145 and 3.922, reflecting one appointment made by each board;\n(ii) one member shall be a mental health advocate and shall be appointed by the Minnesota chapter of the National Alliance on Mental Illness; and\n(iii) one member shall be an advocate for victims and shall be appointed by Violence Free Minnesota; and\n(7) four members appointed by the legislature, of which one shall be appointed by the speaker of the house, one by the house minority leader, one by the senate majority leader, and one by the senate minority leader.\nThe appointing authorities shall make their appointments by September 15, 2020, and shall ensure geographical balance when making appointments.\n(a) The purpose of the council is to assist the board in maintaining policies and regulating peace officers in a manner that ensures the protection of civil and human rights. The council shall provide for citizen involvement in policing policies, regulations, and supervision. The council shall advance policies and reforms that promote positive interactions between peace officers and the community.\n(b) The board chair must place the council's recommendations to the board on the board's agenda within four months of receiving a recommendation from the council.\nThe council shall be organized and administered under section 15.059, except that the council does not expire. Council members serve at the pleasure of the appointing authority. The council shall select a chairperson from among the members by majority vote at its first meeting. The executive director of the board shall serve as the council's executive secretary.\nThe council must meet at least quarterly. Meetings of the council are governed by chapter 13D. The executive director of the Peace Officer Standards and Training Board shall convene the council's first meeting, which must occur by October 15, 2020.\nThe executive director of the Peace Officer Standards and Training Board shall provide the council with the necessary office space, supplies, equipment, and clerical support to effectively perform the duties imposed.\nThe council shall submit a report by February 15 of each year to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and the board. At a minimum, the report shall include:\n(1) all recommendations presented to the board and how the board acted on those recommendations;\n(2) recommendations for statutory reform or legislative initiatives intended to promote police-community relations; and\n(3) updates on the council's review and determinations.",
	"repealed": false
}