{
	"id": "518A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.35",
	"title": "518A.35 GUIDELINE USED IN CHILD SUPPORT DETERMINATIONS.",
	"text": "(a) The guideline in this section is a rebuttable presumption and shall be used in any judicial or administrative proceeding to establish or modify a support obligation under this chapter.\n(b) The basic child support obligation shall be determined by referencing the guideline for the appropriate number of joint children and the combined parental income for determining child support of the parents.\n(c) If a child is not in the custody of either parent and a support order is sought against one or both parents, the basic child support obligation shall be determined by referencing the guideline for the appropriate number of joint children, and the parent's individual parental income for determining child support, not the combined parental incomes for determining child support of the parents. Unless a parent has court-ordered parenting time, the parenting expense adjustment formula under section 518A.34 must not be applied.\n(d) If a child is not residing with the parent that has court-ordered or statutory custody and a support order is sought under section 518A.82 against one or both parents, the basic support obligation must be determined by referencing the guideline for the appropriate number of joint children and the parent's individual income without application of the parenting expense adjustment formula under section 518A.34.\n(e) For combined parental incomes for determining child support exceeding $20,000 per month, the presumed basic child support obligations shall be as for parents with combined parental income for determining child support of $20,000 per month. A basic child support obligation in excess of this level may be demonstrated for those reasons set forth in section 518A.43.\nUnless otherwise agreed to by the parents and approved by the court, when establishing basic support, the court must order that basic support be divided between the parents based on their proportionate share of the parents' combined monthly parental income for determining child support (PICS). Basic support must be computed using the following guideline:\n(a) The basic support obligation for parents with a combined parental income for determining child support in excess of the income limit under subdivision 2 must be the same dollar amount as provided for the parties with a combined parental income for determining child support equal to the income limit under subdivision 2.\n(b) A court may order a basic support obligation in a child support order in an amount that exceeds the income limit in subdivision 2 if it finds that a child has a disability or other substantial, demonstrated need for the additional support for those reasons set forth in section 518A.43 and that the additional support will directly benefit the child.\nIf a child support proceeding involves more than six children, the court may derive a support order without specifically following the guidelines. However, the court must consider the basic principles encompassed by the guidelines and must consider both parents' needs, resources, and circumstances.",
	"repealed": false
}