{
	"id": "260.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.68",
	"title": "260.68 RESPONSIBLE SOCIAL SERVICES AGENCY CONDUCT AND CASE REVIEW.",
	"text": "(a) A responsible social services agency employee who has duties related to child protection shall not knowingly:\n(1) make untrue statements about any case involving a child alleged to be in need of protection or services;\n(2) intentionally withhold any information that may be material to a case involving a child alleged to be in need of protection or services; or\n(3) fabricate or falsify any documentation or evidence relating to a case involving a child alleged to be in need of protection or services.\n(b) Any of the actions listed in paragraph (a) shall constitute grounds for adverse employment action.\n(a) Each responsible social services agency shall conduct a review of all child welfare cases for African American and other disproportionately represented children handled by the agency. Each responsible social services agency shall create a summary report of trends identified under paragraphs (b) and (c), a remediation plan as provided in paragraph (d), and an update on implementation of any previous remediation plans. The first report shall be provided to the African American Child Well-Being Advisory Council, the commissioner, and the chairs and ranking minority members of the legislative committees with jurisdiction over child welfare by October 1, 2029, and annually thereafter. For purposes of determining outcomes in this subdivision, responsible social services agencies shall use guidance from the commissioner. The commissioner shall provide guidance starting on November 1, 2028, and annually thereafter.\n(b) The case review must include:\n(1) the number of African American and disproportionately represented children represented in the county child welfare system;\n(2) the number and sources of maltreatment reports received and reports screened in for investigation or referred for family assessment and the race of the children and parents or custodians involved in each report;\n(3) the number and race of children and parents or custodians who receive in-home preventive case management services;\n(4) the number and race of children whose parents or custodians are referred to community-based, culturally appropriate, strength-based, or trauma-informed services;\n(5) the number and race of children removed from their homes;\n(6) the number and race of children reunified with their parents or custodians;\n(7) the number and race of children whose parents or custodians are offered family group decision-making services;\n(8) the number and race of children whose parents or custodians are offered the parent support outreach program;\n(9) the number and race of children in foster care or out-of-home placement at the time that the data is gathered;\n(10) the number and race of children who achieve permanency through a transfer of permanent legal and physical custody to a relative or an adoption; and\n(11) the number and race of children who are under the guardianship of the commissioner or awaiting a permanency disposition.\n(c) The required case review must also:\n(1) identify barriers to reunifying children with their families;\n(2) identify the family conditions that led to the out-of-home placement;\n(3) identify any barriers to accessing culturally informed mental health or substance use disorder treatment services for the parents or children;\n(4) document efforts to identify fathers and maternal and paternal relatives and to provide services to custodial and noncustodial fathers, if appropriate; and\n(5) document and summarize court reviews of active efforts.\n(d) Any responsible social services agency that has a case review showing disproportionality and disparities in child welfare outcomes for African American and other disproportionately represented children and the children's families, compared to the agency's overall outcomes, must include in their case review summary report a remediation plan with measurable outcomes to identify, address, and reduce the factors that led to the disproportionality and disparities in the agency's child welfare outcomes. The remediation plan shall also include information about how the responsible social services agency will achieve and document trauma-informed, positive child well-being outcomes through remediation efforts.",
	"repealed": false
}