{
	"id": "16C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.04",
	"title": "16C.04 ETHICAL PRACTICES AND CONFLICT OF INTEREST.",
	"text": "An employee of the executive branch involved directly or indirectly in the acquisition or grants process, at any level, is subject to the code of ethics in section 43A.38.\n(a) The commissioner must develop policies regarding code of ethics and conflict of interest designed to prevent conflicts of interest for employees involved in the acquisition of goods, services, construction, and utilities or the award and administration of grant contracts. The policies must apply to employees who are directly or indirectly involved in the acquisition of goods, services, and utilities, developing requests for proposals, evaluating bids or proposals, awarding the contract, selecting the final vendor, drafting and entering into contracts, evaluating performance under these contracts, and authorizing payments under the contract.\n(b) The policies must contain a process for making employees aware of policy and laws relating to conflict of interest, and for training employees on how to avoid and deal with potential conflicts.\n(c) The policies must contain a process under which an employee who has a conflict of interest or a potential conflict of interest must disclose the matter, and a process under which work on the contract may be assigned to another employee if possible.\n(a) The commissioner shall make reasonable efforts to avoid, mitigate, or neutralize organizational conflicts of interest. To avoid an organizational conflict of interest, the commissioner may utilize methods including disqualifying a vendor from eligibility for a contract award or canceling the contract if the conflict is discovered after a contract has been issued. To mitigate or neutralize a conflict, the commissioner may use methods such as revising the scope of work to be conducted, allowing vendors to propose the exclusion of task areas that create a conflict, or providing information to all vendors to assure that all facts are known to all vendors.\n(b) In instances where a conflict or potential conflict has been identified and the commissioner determines that vital operations of the state will be jeopardized if a contract with the vendor is not established, the commissioner may waive the requirements in paragraph (a).",
	"repealed": false
}