{
	"id": "242.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/242.32",
	"title": "242.32 CONSTRUCTIVE PROGRAMS; COOPERATION SECURE PLACEMENT.",
	"text": "The commissioner of corrections shall be charged with the duty of developing constructive programs for the prevention and decrease of delinquency and crime among youth. To that end, the commissioner shall cooperate with counties and existing agencies to encourage the establishment of new programming, both local and statewide, to provide a continuum of services for serious and repeat juvenile offenders who do not require secure placement. The commissioner shall work jointly with the commissioner of human services and counties and municipalities to develop and provide community-based services for residential placement of juvenile offenders and community-based services for nonresidential programming for juvenile offenders and their families.\nNotwithstanding any law to the contrary, the commissioner of corrections is authorized to contract with counties placing juveniles in the serious/chronic program at the Minnesota Correctional Facility-Red Wing to provide necessary extended community transition programming. Funds resulting from the contracts shall be deposited in the state treasury and are appropriated to the commissioner for juvenile correctional purposes.\nThe commissioner of corrections may establish and operate alternative residential programs for juveniles. Programming is available to court and social service agencies for placement of juveniles to act as early intervention in juvenile crime. The commissioner shall require participating state or federal agencies and local units of government sending participants to the program to pay the cost of the program. Funds received by the commissioner for the cost of the program from state and federal agencies and local units of government under this subdivision must be deposited in the state treasury and credited to a special account. Money in the account is appropriated to the commissioner to fund the program.\nThe commissioner shall license several small regional facilities providing secure capacity programming for juveniles who have been adjudicated delinquent or convicted as extended jurisdiction juveniles and require secure placement. The programming shall be tailored to the types of juveniles being served, including their offense history, age, gender, cultural and ethnic heritage, mental health and substance use disorder problems, and other characteristics. Services offered shall include but not be limited to:\n(1) intensive general educational programs, with an individual educational plan for each juvenile;\n(2) specific educational components in the management of anger and nonviolent conflict resolution;\n(3) treatment for substance use disorder;\n(4) mental health screening, assessment, and treatment; and\n(5) programming to educate offenders about sexuality and address issues specific to victims and perpetrators of sexual abuse.\nThe facilities shall collaborate with facilities providing nonsecure residential programming and with community-based aftercare programs.\nThe commissioner shall adopt rules establishing licensing criteria for secure placement programming for juvenile offenders. The criteria must ensure that the programming is distributed throughout the state. The commissioner is authorized to license long-term residential secure programming up to a maximum of 100 beds statewide in addition to those licensed as of January 1, 1995.\nThe 100-bed limitation in subdivision 3 does not apply to:\n(1) up to 32 beds constructed and operated for long-term residential secure programming by a privately operated facility licensed by the commissioner in Rock County, Minnesota; and\n(2) the campus at the state juvenile correctional facility at Red Wing, Minnesota.",
	"repealed": false
}