{
	"id": "260C.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.101",
	"title": "260C.101 JURISDICTION.",
	"text": "The juvenile court has original and exclusive jurisdiction in proceedings concerning any child who is alleged to be in need of protection or services, or neglected and in foster care.\nThe juvenile court has original and exclusive jurisdiction in proceedings concerning:\n(1) the termination of parental rights to a child in accordance with the provisions of sections 260C.301 to 260C.328;\n(2) permanency matters under sections 260C.503 to 260C.521;\n(3) the appointment and removal of a juvenile court guardian for a child, where parental rights have been terminated under the provisions of sections 260C.301 to 260C.328;\n(4) judicial consent to the marriage of a child when required by law;\n(5) all adoption matters and review of the efforts to finalize the adoption of the child under section 260C.317;\n(6) the review of the placement of a child who is in foster care pursuant to a voluntary placement agreement between the child's parent or parents and the responsible social services agency under section 260C.227; or between the child, when the child is over age 18, and the agency under section 260C.229;\n(7) the review of voluntary foster care placement of a child for treatment under chapter 260D according to the review requirements of that chapter;\n(8) the reestablishment of a legal parent and child relationship under section 260C.329; and\n(9) juvenile court guardianship petitions for at-risk juveniles filed under chapter 257D.\nThe juvenile court has jurisdiction in proceedings concerning any alleged acts of domestic child abuse. In a jurisdiction which utilizes referees in child in need of protection or services matters, the court or judge may refer actions under this subdivision to a referee to take and report the evidence in the action. If the respondent does not appear after service is duly made and proved, the court may hear and determine the proceeding as a default matter. Proceedings under this subdivision shall be given docket priority by the court.\nA parent, guardian, or custodian of a child who is subject to the jurisdiction of the court is also subject to the jurisdiction of the court in any matter in which that parent, guardian, or custodian has a right to notice under section 260C.151 or 260C.152, or the right to participate under section 260C.163. In any proceeding concerning a child alleged to be in need of protection or services, the court has jurisdiction over a parent, guardian, or custodian for the purposes of a disposition order issued under section 260C.201, subdivision 6.\nIn a child in need of protection or services proceeding, when an Indian child is a ward of a tribal court with federally recognized child welfare jurisdiction, the Indian tribe retains exclusive jurisdiction notwithstanding the residence or domicile of an Indian child, as provided in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1911.",
	"repealed": false
}