{
	"id": "62S.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.251",
	"title": "62S.251 RESERVE STANDARDS.",
	"text": "When long-term care benefits are provided through the acceleration of benefits under group or individual life policies or riders to these policies, policy reserves for the benefits must be determined in accordance with section 61A.25. Claim reserves must also be established in the case when the policy or rider is in claim status.\nReserves for policies and riders subject to this section must be based on the multiple decrement model utilizing all relevant decrements except for voluntary termination rates. Single decrement approximations are acceptable if the calculation produces essentially similar reserves, if the reserve is clearly more conservative, or if the reserve is immaterial. The calculations may take into account the reduction in life insurance benefits due to the payment of long-term care benefits. However, in no event must the reserves for the long-term care benefit and the life insurance benefit be less than the reserves for the life insurance benefit assuming no long-term care benefit.\nIn the development and calculation of reserves for policies and riders subject to this subdivision, due regard must be given to the applicable policy provisions, marketing methods, administrative procedures, and all other considerations which have an impact on projected claim costs, including, but not limited to, the following:\n(1) definition of insured events;\n(2) covered long-term care facilities;\n(3) existence of home convalescence care coverage;\n(4) definition of facilities;\n(5) existence or absence of barriers to eligibility;\n(6) premium waiver provision;\n(7) renewability;\n(8) ability to raise premiums;\n(9) marketing method;\n(10) underwriting procedures;\n(11) claims adjustment procedures;\n(12) waiting period;\n(13) maximum benefit;\n(14) availability of eligible facilities;\n(15) margins in claim costs;\n(16) optional nature of benefit;\n(17) delay in eligibility for benefit;\n(18) inflation protection provisions; and\n(19) guaranteed insurability option.\nAny applicable valuation morbidity table shall be certified as appropriate as a statutory valuation table by a member of the American Academy of Actuaries.\nWhen long-term care benefits are provided other than as in subdivision 1, reserves must be determined in accordance with sections 60A.76 to 60A.768.",
	"repealed": false
}