{
	"id": "349.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.162",
	"title": "349.162 EQUIPMENT REGISTERED.",
	"text": "A distributor may not sell, transfer, furnish, or otherwise provide to a person, and no person may purchase, borrow, accept, or acquire from a distributor gambling equipment for use within the state unless the equipment has been registered with the board or the Department of Revenue in a manner prescribed by the board or the Department of Revenue. Gambling equipment kept in violation of this subdivision is contraband under section 349.2125.\nA distributor must maintain a record of all gambling equipment which it sells to organizations as required by section 297E.05, subdivision 2, and provide copies of the record to the board upon demand. Employees of the board and the Division of Alcohol and Gambling Enforcement may inspect the business premises, books, records, and other documents of a distributor at any reasonable time without notice and without a search warrant.\nThe board may require that a distributor submit the monthly report and invoices required in this subdivision via magnetic media or electronic data transfer.\nMS 2004 [Repealed, 2005 c 166 art 1 s 38]\n(a) No person other than a licensed distributor may possess unaffixed registration stamps issued by the board for the purpose of registering gambling equipment.\n(b) Unless otherwise provided in this chapter, no person may possess gambling equipment that has not been registered.\n(c) No distributor may:\n(1) sell a bingo hard card or paper sheet that does not bear an individual number; or\n(2) sell a package of bingo paper sheets that does not contain bingo paper sheets in numerical order.\n(a) All gambling equipment purchased or possessed by a licensed distributor for resale or lease to any person for use in Minnesota must, prior to the equipment's resale or lease, be unloaded into a storage facility located in Minnesota which the distributor owns or leases; and which has been registered, in advance and in writing, with the Division of Alcohol and Gambling Enforcement as a storage facility of the distributor. All unregistered gambling equipment and all unaffixed registration stamps owned by, or in the possession of, a licensed distributor in the state of Minnesota shall be stored at a storage facility which has been registered with the Division of Alcohol and Gambling Enforcement. No gambling equipment may be moved from the facility unless the gambling equipment has been first registered with the board or the Department of Revenue. A distributor must notify the board of the method that it will use to sell and transfer electronic pull-tab games to licensed organizations, and must receive approval of the board before implementing or making changes to the approved method.\n(b) Notwithstanding section 349.163, subdivisions 5, 6, and 8, a licensed manufacturer may ship into Minnesota approved or unapproved gambling equipment if the licensed manufacturer ships the gambling equipment to a Minnesota storage facility that is: (1) owned or leased by the licensed manufacturer; and (2) registered, in advance and in writing, with the Division of Alcohol and Gambling Enforcement as a manufacturer's storage facility. No gambling equipment may be shipped into Minnesota to the manufacturer's registered storage facility unless the shipment of the gambling equipment is reported to the Department of Revenue in a manner prescribed by the department. No gambling equipment may be moved from the storage facility unless the gambling equipment is sold to a licensed distributor and is otherwise in conformity with this chapter, is shipped to an out-of-state site and the shipment is reported to the Department of Revenue in a manner prescribed by the department, or is otherwise sold and shipped as permitted by board rule. A manufacturer must notify the board of the method that it will use to sell and transfer electronic pull-tab games to licensed distributors, and must receive approval of the board before implementing or making changes to the approved method.\n(c) All storage facilities owned, leased, used, or operated by a licensed distributor or manufacturer may be entered upon and inspected by the employees of the Division of Alcohol and Gambling Enforcement, the Division of Alcohol and Gambling Enforcement director's authorized representatives, employees of the Gambling Control Board or its authorized representatives, employees of the Department of Revenue, or authorized representatives of the director of the Division of Special Taxes of the Department of Revenue during reasonable and regular business hours. Obstruction of, or failure to permit, entry and inspection is cause for revocation or suspension of a manufacturer's or distributor's licenses and permits issued under this chapter.\n(d) Unregistered gambling equipment found at any location in Minnesota other than the manufacturing plant of a licensed manufacturer or a registered storage facility are contraband under section 349.2125. This paragraph does not apply:\n(1) to unregistered gambling equipment being transported in interstate commerce between locations outside this state, if the interstate shipment is verified by a bill of lading or other valid shipping document; and\n(2) to gambling equipment registered with the Department of Revenue for distribution to the tribal casinos.\nAuthorized employees of the board, the Division of Alcohol and Gambling Enforcement of the Department of Public Safety, and the commissioner of revenue may remove gambling equipment from the inventories of distributors and organizations and test that equipment to determine its compliance with all applicable laws and rules. A distributor or organization may return to the manufacturer thereof any gambling equipment which is determined to be in violation of law or rule. The cost to an organization of gambling equipment removed from inventory under this paragraph and found to be in compliance with all applicable law and rules is an allowable expense under section 349.12, subdivision 3a.",
	"repealed": false
}