{
	"id": "62M.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.10",
	"title": "62M.10 ACCESSIBILITY AND ON-SITE REVIEW PROCEDURES.",
	"text": "A utilization review organization must provide access to its review staff by a toll-free or collect call telephone line during normal business hours. A utilization review organization must also have an established procedure to receive timely callbacks from providers and must establish written procedures for receiving after-hour calls, either in person or by recording.\nA utilization review organization must conduct its telephone reviews, on-site reviews, and hospital communications during reasonable and normal business hours, unless otherwise mutually agreed.\nEach utilization review organization's staff must identify themselves by name and by the name of their organization and, for on-site reviews, must carry picture identification and the utilization review organization's company identification card. On-site reviews should, whenever possible, be scheduled at least one business day in advance with the appropriate hospital contact. If requested by a hospital or inpatient facility, utilization review organizations must ensure that their on-site review staff register with the appropriate contact person, if available, prior to requesting any clinical information or assistance from hospital staff. The on-site review staff must wear appropriate hospital supplied identification tags while on the premises.\nUtilization review organizations must agree, if requested, that the medical records remain available in designated areas during the on-site review and that reasonable hospital administrative procedures must be followed by on-site review staff so as to not disrupt hospital operations or patient care. Such procedures, however, must not limit the ability of the utilization review organizations to efficiently conduct the necessary review on behalf of the patient's health benefit plan.\nUtilization review organizations shall orally inform, upon request, designated hospital personnel or the attending health care professional of the utilization review requirements of the specific health benefit plan and the general type of criteria used by the review agent. Utilization review organizations should also orally inform, upon request, a provider of the operational procedures in order to facilitate the review process.\nNothing in this section limits the ability of a utilization review organization and a provider to mutually agree in writing on how review should be conducted.\n(a) For utilization review determinations other than prior authorization, a utilization review organization shall, upon request, provide to an enrollee, a provider, and the commissioner of commerce the criteria used to determine the medical necessity, appropriateness, and efficacy of a procedure or service and identify the database, professional treatment guideline, or other basis for the criteria.\n(b) For prior authorization determinations, a utilization review organization must submit the organization's current prior authorization requirements and restrictions, including written, evidence-based, clinical criteria used to make an authorization or adverse determination, to all health plan companies for which the organization performs utilization review. A health plan company must post on its public website the prior authorization requirements and restrictions of any utilization review organization that performs utilization review for the health plan company. These prior authorization requirements and restrictions must be detailed and written in language that is easily understandable to providers. This paragraph does not apply to the commissioner of human services when delivering services through fee-for-service under chapters 256B and 256L.\n(c) Effective January 1, 2026, the commissioner of human services must post on the department's public website the prior authorization requirements and restrictions, including written, evidence-based, clinical criteria used to make an authorization or adverse determination, that apply to prior authorization determinations for fee-for-service under chapters 256B and 256L. These prior authorization requirements and restrictions must be detailed and written in language that is easily understandable to providers.\n(a) Before a utilization review organization may implement a new prior authorization requirement or restriction or amend an existing prior authorization requirement or restriction, the utilization review organization must submit the new or amended requirement or restriction to all health plan companies for which the organization performs utilization review. A health plan company must post on its website the new or amended requirement or restriction. This paragraph does not apply to the commissioner of human services when delivering services through fee-for-service under chapters 256B and 256L.\n(b) At least 45 days before a new prior authorization requirement or restriction or an amended existing prior authorization requirement or restriction is implemented, the utilization review organization, health plan company, or claims administrator must provide written or electronic notice of the new or amended requirement or restriction to all Minnesota-based, in-network attending health care professionals who are subject to the prior authorization requirements and restrictions. This paragraph does not apply to the commissioner of human services when delivering services through fee-for-service under chapters 256B and 256L.\n(c) Effective January 1, 2026, before the commissioner of human services may implement a new prior authorization requirement or restriction or amend an existing prior authorization requirement or restriction, the commissioner, at least 45 days before the new or amended requirement or restriction takes effect, must provide written or electronic notice of the new or amended requirement or restriction, to all health care professionals participating as fee-for-service providers under chapters 256B and 256L who are subject to the prior authorization requirements and restrictions.",
	"repealed": false
}