{
	"id": "136A.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.64",
	"title": "136A.64 INFORMATION REQUIRED FOR REGISTRATION.",
	"text": "As a basis for registration, schools shall provide the office with such information as the office needs to determine the nature and activities of the school, including but not limited to the following which shall be accompanied by an affidavit attesting to its accuracy and truthfulness:\n(1) articles of incorporation, constitution, bylaws, or other operating documents;\n(2) a duly adopted statement of the school's mission and goals;\n(3) evidence of current school or program licenses granted by departments or agencies of any state;\n(4) compliance audits and audited financial statements that meet the requirements of Code of Federal Regulations, title 34, section 668.23; United States Code, title 20, chapter 28, section 1094; Code of Federal Regulations, title 2, subpart A, part 200, subpart F, under 200.501 and 200.503; and United States Code, title 31, chapter 75;\n(5) all current promotional and recruitment materials and advertisements; and\n(6) the current school catalog and, if not contained in the catalog:\n(i) the members of the board of trustees or directors, if any;\n(ii) the current institutional officers;\n(iii) current full-time and part-time faculty with degrees held or applicable experience;\n(iv) a description of all school facilities;\n(v) a description of all current course offerings;\n(vi) all requirements for satisfactory completion of courses, programs, and degrees;\n(vii) the school's policy about freedom or limitation of expression and inquiry;\n(viii) a current schedule of fees, charges for tuition, required supplies, student activities, housing, and all other standard charges;\n(ix) the school's policy about refunds and adjustments;\n(x) the school's policy about granting credit for prior education, training, and experience;\n(xi) the school's policies about student admission, evaluation, suspension, and dismissal; and\n(xii) the school's disclosure to students on the student complaint process under section 136A.672.\nThe office shall not disclose financial records or accreditation reports provided to it by a school pursuant to this section except for the purpose of defending, at hearings pursuant to chapter 14, or other appeal proceedings, its decision to approve or not to approve the granting of degrees or the use of a name by the school. Section 15.17, subdivision 4, shall not apply to such records.\nIf the office is unable to determine the nature and activities of a school on the basis of the information in subdivision 1, the office shall notify the school of additional information needed.\nThe office may verify the accuracy of submitted information by inspection, visitation, or any other means it considers necessary.\nAll information submitted to the office is public information except financial records, student complaint data, and accreditation records and reports. Except for accreditation reports, the office may disclose any records or information submitted to the office:\n(1) to law enforcement officials; or\n(2) in connection with a legal or administrative proceeding to:\n(i) defend its decision to approve or disapprove granting of degrees or the use of a name;\n(ii) defend its decision to revoke the institution's approval; or\n(iii) enforce a requirement of law.\nApplications for renewal for any registration received after the deadline date specified in the renewal materials provided by the office are subject to a late fee equal to 20 percent of the annual registration renewal fee.\nA school shall reimburse the office for actual costs associated with a site evaluation visit outside Minnesota if the visit is necessary under subdivision 1 or 3.\nSchools must disclose on their website, student handbook, and student catalog the student complaint process under section 136A.672 to students.",
	"repealed": false
}