{
	"id": "216A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/216A.07",
	"title": "216A.07 COMMISSIONER POWERS AND DUTIES.",
	"text": "The commissioner of commerce has all the rights and powers and shall perform all the duties set forth in this chapter. The commissioner may:\n(1) prepare all forms or blanks for the purpose of obtaining information which the commissioner may deem necessary or useful in the proper exercise of the authority and duties of the commissioner in connection with regulated businesses;\n(2) prescribe the time and manner within which forms or blanks shall be filed with the department;\n(3) inspect at all reasonable times, and copy the books, records, memoranda, and correspondence or other documents and records of any person relating to any regulated business; and\n(4) cause the deposition to be taken of any person concerning the business and affairs of any business regulated by the department. Information sought through said deposition shall be for a lawfully authorized purpose and shall be relevant and material to the investigation or hearing before the commission. Information obtained from said deposition shall be used by the department only for a lawfully authorized purpose and pursuant to powers and responsibilities conferred upon the department. Said deposition is to be taken in the manner prescribed by law for taking depositions in civil actions in the district court.\nThe commissioner is responsible for the enforcement of chapters 216A, 216B and 237 and the orders of the commission issued pursuant to those chapters.\n(a) The commissioner may intervene as a party in all proceedings before the commission. When intervening in gas or electric hearings, the commissioner shall prepare and defend testimony designed to:\n(1) encourage energy conservation improvements as defined in section 216B.241;\n(2) ensure that the greenhouse gas reduction goals are attained on a schedule that keeps pace with the reduction timetable in section 216H.02, subdivision 1;\n(3) ensure that the renewable energy standards, solar energy goal, and carbon-free standards are achieved according to the schedules under section 216B.1691, subdivisions 2a, 2f, and 2g, respectively; and\n(4) ensure compliance with state environmental policy, as stated in section 116D.02.\n(b) The attorney general shall act as counsel in the proceedings.\nThe Department of Commerce has the duty and power to represent the interests of Minnesota residents, businesses, and governments before bodies and agencies outside the state that make, interpret, or implement regional, national, and international energy policy and that regulate and implement regional or national energy planning or infrastructure development. This subdivision does not limit regional, national, or international activities of the Public Utilities Commission.\nThe commissioner may, on the commissioner's own initiative, investigate any matter subject to the jurisdiction of the department or commission.\nThe commissioner shall make substantive and procedural rules to implement the provisions of this chapter and chapters 216B and 237. Rules adopted under this authority shall be promulgated pursuant to the Administrative Procedure Act and shall have the force and effect of law.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.",
	"repealed": false
}