{
	"id": "116L.364",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.364",
	"title": "116L.364 PROGRAM PURPOSE AND DESIGN.",
	"text": "The grants awarded under section 116L.362 are for a youth employment and training program directed at targeted youth who are likely to be at risk of not completing their high school education. Each program must include education, work experience, job skills, and leadership training and peer support components. Each participant must be offered counseling and other services to identify and overcome problems that might interfere with successfully completing the program.\nA program must contain an education component that requires program participants to complete their secondary education in a traditional public or private secondary school, a suitable alternative school setting, or a commissioner of education-selected high school equivalency program. Program participants must be working toward the completion of their secondary education or literacy advancement.\nA work experience component must be included in each program. The work experience component must provide vocational skills training in an industry where there is a viable expectation of job opportunities. A training subsidy, living allowance, or stipend, not to exceed an amount equal to 100 percent of the poverty line for a family of two as defined in the final rules and regulations of the Workforce Innovation and Opportunity Act, may be provided to program participants. The wage or stipend must be provided to participants who are recipients of public assistance in a manner or amount which will not reduce public assistance benefits. The work experience component must be designed so that work projects result in (1) the expansion or improvement of residential units for homeless persons and low income families; (2) improvements to the energy efficiency and environmental health of residential units; (3) facilities to support community garden projects; or (4) rehabilitation, improvement, or construction of eligible education, social service, or health facilities that principally serve homeless or low income individuals and families. Any work project must include direct supervision by individuals skilled in each specific vocation. Program participants may earn credits toward the completion of their secondary education from their participation in the work experience component.\nA job readiness skills component must comprise at least 20 percent of each program. The component must provide program participants with job search skills, placement assistance, and other job readiness skills to ensure that participants will have an understanding of the building trades, unions, self-employment, and other employment opportunities and be able to compete in the employment market.\nEach program must provide participants with meaningful opportunities to develop leadership skills such as decision making, problem solving, and negotiating. The program must encourage participants to develop strong peer group ties that support their mutual pursuit of skills and values.",
	"repealed": false
}