{
	"id": "462C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.05",
	"title": "462C.05 MULTIFAMILY HOUSING, HEALTH CARE FACILITY.",
	"text": "A city may also include in the housing plan, a program or programs to administer, and make or purchase a loan or loans to finance one or more multifamily housing developments within its boundaries, of the kind described in subdivision 2, 3, 4 or 7, and upon the conditions set forth in this section. A loan may be made or purchased for:\n(a) the acquisition and preparation of a site and the construction of a new development;\n(b) the rehabilitation of an existing building and site and the discharge of any lien or other interest in the building and site;\n(c) for the acquisition of an existing building and site and the rehabilitation thereof;\n(d) for the acquisition of an existing building and site for purposes of conversion to limited equity cooperative ownership by low or moderate income families;\n(e) for the acquisition, or acquisition and improvement, of an existing building and site by a nonprofit corporation which will operate the building as a multifamily housing development for rental primarily to elderly or disabled persons; or\n(f) the taking out of accumulated equity in connection with a program of federal insurance for the preservation of low-income housing.\nWith respect to loans made or purchased pursuant to clause (b) or (c), the cost of rehabilitation of an existing building must be estimated to equal at least $1,000 per dwelling unit or 20 percent of the appraised value of the original building and site whichever is less, except that with respect to rehabilitation which consists primarily of improvement of the property with facilities or improvements to conserve energy or convert or retrofit for use of alternative energy sources, rehabilitation loans may be made without regard to cost; and at least a substantial portion of such rehabilitation cost must be estimated to be incurred for compliance with building codes or conservation of energy.\nEach development upon completion shall comply with all applicable code requirements. A loan or loans may be made or purchased for either the construction or the long-term financing of a development, or both, including the financing of the acquisition of dwelling units and interests in common facilities provided therein, by persons to whom such units and facilities may be sold as contemplated in chapter 515, 515A, or 515B, or any supplemental or amendatory law thereof or as contemplated for a development consisting of cooperative housing.\nSubstantially all of the proceeds of each loan shall be used to pay the cost of a multifamily housing development, including property functionally related and subordinate to it; but nothing herein prevents the construction or acquisition of the development over, under, or adjacent to, and in conjunction with facilities to be used for purposes other than housing.\nA development shall be designed to be affordable by persons and families with adjusted gross income not in excess of the limits set forth in section 462C.03, subdivision 2, and by other persons and families to the extent determined to be necessary in furtherance of the policy of economic integration stated in section 462A.02, subdivision 6, with at least 20 percent of the dwelling units are held for occupancy by families or individuals with adjusted gross income not in excess of 80 percent of the median family income as estimated by the United States Department of Housing and Urban Development for the nonmetropolitan county or standard metropolitan statistical area, as the case may be.\nA development may be located within a targeted area without regard to the limitations and conditions set forth in subdivision 2, and without regard to those set forth in section 462C.03 except section 462C.03, subdivision 10, except that in no case shall the maximum purchase price or appraised value for a dwelling unit in the multifamily housing development exceed four times the income limit established by section 462C.03, subdivision 2, unless the development is in a building officially built before 1900, designated as an historical structure under state, local, or national procedures.\nA development may be designed for rental primarily to elderly or disabled persons without regard to the limitations and conditions set forth in section 462C.03 and in subdivision 2.\nEach program for a multifamily housing development or developments described in subdivision 1 shall be adopted after public hearing on the program which includes such development or developments and shall be approved by the Minnesota Housing Finance Agency as provided in section 462C.01, and on the basis of the considerations stated in section 462C.04, subdivision 2. The multifamily housing development program may include limitations or prohibitions on the assumption of the loans or other terms which are inconsistent with section 47.20, subdivision 6 or 6a, for bonds or other obligations issued by the city pursuant to section 462C.07.\nThe program shall demonstrate need for the development or developments, describe the method of financing proposed, state whether the development is to be constructed pursuant to subdivision 2, 3, or 4, and state the applicable limitations on gross income, if any, of the occupants.\nMultifamily housing developments described in subdivision 1 for which an application is submitted for low-income housing tax credits provided under section 42 of the Internal Revenue Code of 1986, as amended, must also satisfy the qualified allocation plan applicable to the area in which the project is located.\nA development may consist of a combination of a multifamily housing development and a new or existing health care facility, as defined by section 469.153, if the following conditions are satisfied:\n(a) the multifamily housing development is designed and intended to be used for rental occupancy;\n(b) the multifamily housing development is designed and intended to be used primarily by elderly or physically disabled persons; and\n(c) nursing, medical, personal care, and other health-related assisted living services are available on a 24-hour basis in the development to the residents.\nAny revenue agreement or financing lease which includes a provision for a conveyance of real estate to the lessee or contracting party may be terminated in accordance with the revenue agreement or financing lease, notwithstanding that the revenue agreement or financing lease may constitute an equitable mortgage. No financing lease of any development is subject to section 504B.291, unless expressly so provided in the financing lease. Leases of specific dwelling units in the development to tenants are not affected by this subdivision.",
	"repealed": false
}