{
	"id": "216B.172",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.172",
	"title": "216B.172 CONSUMER DISPUTES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Appeal\" means a request a complainant files with the commission to review and make a final decision regarding the resolution of the complainant's complaint by the consumer affairs office.\n(c) \"Complainant\" means an individual residential customer or a tenant who files with the consumer affairs office a complaint against a public utility or a landlord of a shared-metered residential building.\n(d) \"Complaint\" means an allegation submitted to the consumer affairs office by a complainant that a public utility's or a landlord's action or practice regarding billing or terms and conditions of service:\n(1) violates a statute, rule, tariff, service contract, or other provision of law;\n(2) is unreasonable; or\n(3) has harmed or, if not addressed, harms a complainant.\nComplaint does not include an objection to or a request to modify any natural gas or electricity rate contained in a tariff that has been approved by the commission. A complaint under this section is an informal complaint under Minnesota Rules, chapter 7829.\n(e) \"Consumer affairs office\" means the staff unit of the commission that is organized to receive and respond to complaints.\n(f) \"Informal proceeding\" has the meaning given in Minnesota Rules, part 7829.0100, subpart 8.\n(g) \"Landlord\" means an owner of a shared-metered residential building, a contract for deed vendee, receiver, executor, trustee, lessee, agent, or other person directly or indirectly in control of the shared-metered residential building that bills separately for natural gas or electricity, or both.\n(h) \"Public assistance\" has the meaning given in section 550.37, subdivision 14.\n(i) \"Public utility\" has the meaning given in section 216B.02, subdivision 4.\n(j) \"Shared-metered residential building\" has the meaning given in section 216B.022, subdivision 1, paragraph (e).\n(k) \"Tenant\" has the meaning given in section 216B.022, subdivision 1, paragraph (g).\n(l) \"Third-party billing agent\" has the meaning given in section 216B.022, subdivision 1, paragraph (h).\nA complainant must first attempt to resolve a dispute with a public utility or a landlord. If a complainant is dissatisfied with the proposed resolution by the public utility or the landlord, the complainant may seek assistance of the commission to resolve the dispute by filing a complaint with the consumer affairs office. The consumer affairs office must: (1) notify the complainant of the resolution of the complaint; and (2) provide written notice of (i) the complainant's right to appeal the resolution to the commission, and (ii) the steps the complainant may take to appeal the resolution. Upon request, the consumer affairs office must provide to the complainant a written notice containing the substance of and basis for the resolution. Nothing in this section affects any other rights existing under this chapter or other law.\n(a) If a complainant is not satisfied with the resolution of a complaint by the consumer affairs office, the complainant may file an appeal with the commission requesting that the commission make a final decision on the complaint. The commission's response to an appeal filed under this subdivision must comply with the notice requirements under section 216B.17, subdivisions 2 to 5.\n(b) Upon the commission's receipt of an appeal filed under paragraph (a), the chair of the commission or a subcommittee delegated under section 216A.03, subdivision 8, to review the resolution of the complaint must decide whether the complaint be:\n(1) dismissed because there is no reasonable basis on which to proceed;\n(2) resolved through an informal commission proceeding; or\n(3) referred to the Office of Administrative Hearings for a contested case proceeding under chapter 14.\nA decision made under this paragraph must be provided in writing to the complainant and the public utility.\n(c) If the commission decides that the complaint be resolved through an informal proceeding before the commission or referred to the Office of Administrative Hearings for a contested case proceeding, the executive secretary must issue any procedural schedules, notices, or orders required to initiate an informal proceeding or a contested case.\n(d) The commission's dismissal of an appeal request or a decision rendered after conducting an informal proceeding is a final decision constituting an order or determination of the commission.\nNotwithstanding section 216B.27, a complainant may seek judicial review in district court of an adverse final decision under subdivision 3, paragraph (b), clause (1) or (2). Judicial review of the commission's decision in a contested case referred under subdivision 3, paragraph (b), clause (3), is governed by chapter 14.\nA public utility must continue or promptly restore service to a complainant during the pendency of an administrative or judicial procedure pursued by a complainant under this section, provided that the complainant:\n(1) agrees to enter into a payment agreement under section 216B.098, subdivision 3;\n(2) posts the full disputed payment in escrow;\n(3) demonstrates receipt of public assistance or eligibility for legal aid services; or\n(4) demonstrates the complainant's household income is at or below 50 percent of the median income in Minnesota.\nThe commission may adopt rules to carry out the purposes of this section.",
	"repealed": false
}