{
	"id": "148B.5905",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.5905",
	"title": "148B.5905 MENTAL, PHYSICAL, OR SUBSTANCE USE DISORDER EXAMINATION OR EVALUATION; ACCESS TO MEDICAL DATA.",
	"text": "(a) If the board has probable cause to believe section 148B.59, paragraph (a), clause (9), applies to a licensee or applicant, the board may direct the person to submit to a mental, physical, or substance use disorder examination or evaluation. For the purpose of this section, every licensee and applicant is deemed to have consented to submit to a mental, physical, or substance use disorder examination or evaluation when directed in writing by the board and to have waived all objections to the admissibility of the examining professionals' testimony or examination reports on the grounds that the testimony or examination reports constitute a privileged communication. Failure of a licensee or applicant to submit to an examination when directed by the board constitutes an admission of the allegations against the person, unless the failure was due to circumstances beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A licensee or applicant affected under this paragraph shall at reasonable intervals be given an opportunity to demonstrate that the person can resume the competent practice of licensed professional counseling with reasonable skill and safety to the public. In any proceeding under this paragraph, neither the record of proceedings nor the orders entered by the board shall be used against a licensee or applicant in any other proceeding.\n(b) In addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384, 144.651, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the licensee's or applicant's consent if the board has probable cause to believe that section 148B.59, paragraph (a), clause (9), applies to the licensee or applicant. The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i); an insurance company; or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision is classified as private under sections 13.01 to 13.87.",
	"repealed": false
}