{
	"id": "144.6505",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6505",
	"title": "144.6505 SUBACUTE CARE WAIVERS.",
	"text": "The commissioners of health and human services shall work with providers to examine state and federal rules and regulations governing the provision of care in nursing facilities and apply for federal waivers and pursue state law changes to any impediments to the provision of subacute care in skilled nursing facilities.\n(a) For the purpose of this section, \"subacute care\" means comprehensive inpatient care, as further defined in this subdivision, designed for persons who:\n(1) have or have had an acute illness or accident, or an acute exacerbation of a chronic illness, and who require a moderate level of service intensity;\n(2) do not require, or no longer require, technologically intensive diagnosis or management;\n(3) have concurrent medical, nursing, and discharge and/or nondischarge oriented rehabilitation objectives that are expected to be achieved within a specified time; and\n(4) require interdisciplinary management.\n(b) Subacute care includes goal-oriented treatment rendered immediately after, or as an appropriate alternative to, acute hospitalization with the goal of transitioning patients towards increased independence or lower acuity level in a cost-effective environment, to treat one or more specific active complex medical conditions or to administer one or more technically complex treatments, in the context of a patient's underlying long-term conditions and overall situation.\n(c) Subacute care does not generally depend heavily on high technology monitoring or complex diagnostic procedures.\n(d) Subacute care requires the coordinated services of an interdisciplinary team including physicians, nurses, and other relevant professional disciplines, who are trained and knowledgeable to assess and manage these specific conditions and perform the necessary procedures.\n(e) Subacute care is provided as part of a specifically defined program.\n(f) Subacute care includes more intensive care than traditional nursing facility care and less intensive care than acute care and may be provided at a variety of sites, including hospitals and skilled nursing facilities.\n(g) Subacute care requires recurrent patient assessment on a daily to weekly basis and review of the clinical course and treatment plan for a limited time period ranging from several days to several months, until the condition is stabilized or a predetermined treatment course is completed.",
	"repealed": false
}