{
	"id": "256D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256D.02",
	"title": "256D.02 DEFINITIONS.",
	"text": "For purposes of sections 256D.01 to 256D.21, the terms defined in this section have the meanings given them unless otherwise provided or indicated by the context.\n[Renumbered subd 1d]\n[Renumbered subd 2a]\n\"Agency\" has the meaning given in section 256P.01, subdivision 2.\n\"Assistance unit\" means an individual who is, or an eligible married couple who live together who are, applying for or receiving benefits under this chapter.\n[Renumbered subd 2d]\n\"Cash assistance benefit\" means any payment received as a disability benefit, including veterans or workers' compensation; old age, survivors, and disability insurance; railroad retirement benefits; unemployment benefits; and benefits under any federally aided categorical assistance program, Supplemental Security Income, or other assistance program.\n\"Child\" means an adult child, a person who qualifies for assistance under section 256D.05, subdivision 1, paragraph (a), clause (9), or until March 31, 1998, the minor child of an individual.\n\"Childless couple\" means two individuals who are married to each other, live in a place of residence maintained by them as their own home, and are either childless or living apart from their children.\n\"Commissioner\" means the commissioner of human services or a designee.\n[Renumbered subd 3b]\n\"Date of application\" has the meaning given in section 256P.01, subdivision 2c.\n\"Department\" means the Department of Human Services.\n\"Full-time student\" means a student at a postsecondary institution who attends training for a minimum of 25 hours per week if the training does not involve shop practice and for a minimum of 30 hours per week if the training involves shop practice, or who registers for and attends a minimum of 12 semester hours per semester or 12 quarter hours per quarter.\n\"General assistance\" means cash payments to persons unable to provide themselves with a reasonable subsistence compatible with decency and health and who are not otherwise provided for under the laws of this state or the United States.\n\"Group health plan\" means any plan of, or contributed to by, an employer, including a self-insured plan, which provides health care directly or otherwise to the employer's employees, former employees, or the families of the employees or former employees, and includes continuation coverage pursuant to title XXII of the Public Health Service Act, section 4980B of the Internal Revenue Code of 1986, or title VI of the Employee Retirement Income Security Act of 1974.\n[Repealed, 1997 c 85 art 3 s 56]\n[Renumbered subd 2b]\n[Renumbered subd 2c]\n\"Income\" means earned income as defined under section 256P.01, subdivision 3, and unearned income as defined under section 256P.01, subdivision 8.\n[Repealed, 1983 c 312 art 8 s 18; 1Sp1985 c 14 art 9 s 78 subd 1]\n[Repealed, 1981 c 360 art 2 s 52]\n[Repealed, 1981 c 360 art 2 s 52]\n[Renumbered subd 17a]\n\"Professional certification\" means a statement about a person's illness, injury, or incapacity that is signed by a \"qualified professional\" as defined in section 256P.01, subdivision 6a.\n[Renumbered subd 1c]\n(a) For purposes of eligibility for general assistance, a person must be a resident of this state.\n(b) A \"resident\" is a person living in the state for at least 30 days with the intention of making the person's home here and not for any temporary purpose. Time spent in a shelter for battered women shall count toward satisfying the 30-day residency requirement. All applicants for these programs are required to demonstrate the requisite intent and can do so in any of the following ways:\n(1) by showing that the applicant maintains a residence at a verified address, other than a place of public accommodation. An applicant may verify a residence address by presenting a valid state driver's license, a state identification card, a voter registration card, a rent receipt, a statement by the landlord, apartment manager, or homeowner verifying that the individual is residing at the address, or other form of verification approved by the commissioner; or\n(2) by verifying residence according to Minnesota Rules, part 9500.1219, subpart 3, item C.\n(c) For general assistance, a county shall waive the 30-day residency requirement where unusual hardship would result from denial of general assistance. For purposes of this subdivision, \"unusual hardship\" means the applicant is without shelter or is without available resources for food.\nThe county agency must report to the commissioner within 30 days on any waiver granted under this section. The county shall not deny an application solely because the applicant does not meet at least one of the criteria in this subdivision, but shall continue to process the application and leave the application pending until the residency requirement is met or until eligibility or ineligibility is established.\n(d) For purposes of paragraph (c), the following definitions apply (1) \"metropolitan statistical area\" is as defined by the United States Census Bureau; (2) \"shelter\" includes any shelter that is located within the metropolitan statistical area containing the county and for which the applicant is eligible, provided the applicant does not have to travel more than 20 miles to reach the shelter and has access to transportation to the shelter. Clause (2) does not apply to counties in the Minneapolis-St. Paul metropolitan statistical area.\n(e) Migrant workers as defined in section 142G.02 are exempt from the residency requirements of this section, provided the migrant worker provides verification that the migrant family worked in this state within the last 12 months and earned at least $1,000 in gross wages during the time the migrant worker worked in this state.\n(f) For purposes of eligibility for emergency general assistance, the 30-day residency requirement under this section shall not be waived.\n(g) If any provision of this subdivision is enjoined from implementation or found unconstitutional by any court of competent jurisdiction, the remaining provisions shall remain valid and shall be given full effect.\n[Renumbered subd 18a]\n[Repealed, 1983 c 312 art 8 s 17]\n[Renumbered subd 3c]\n\"Single adult\" means an individual 18 years or older who is childless and unmarried or living apart from the individual's children and spouse.\n[Renumbered subd 11a]\n\"State aid\" means state aid to county agencies for general assistance expenditures as provided for in section 256D.03, subdivision 2.\n[Renumbered subd 4a]\n\"Suitable employment\" means an appropriate income producing job including, but not limited to, all publicly subsidized jobs procured through the services administered by or coordinated with the commissioner of employment and economic development.\n[Repealed, 2014 c 262 art 1 s 12]",
	"repealed": false
}