{
	"id": "62Q.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.22",
	"title": "62Q.22 HEALTH CARE SERVICES PREPAID OPTION.",
	"text": "A community health clinic that is designated as an essential community provider under section 62Q.19 and is associated with a hospital, a governmental unit, or the University of Minnesota may offer to individuals and families the option of purchasing basic health care services on a fixed prepaid basis without satisfying the requirements of chapter 60A, 62A, 62C, or 62D, or any other law or rule that applies to entities licensed under those chapters.\nA community health clinic that offers a prepaid option under this section must register on an annual basis with the commissioner of health.\nThe premiums for a prepaid option offered under this section must be based on a sliding fee schedule based on current poverty income guidelines.\n(a) A prepaid option offered under this section must provide basic health care services including:\n(1) services for the diagnosis and treatment of injuries, illnesses, or conditions;\n(2) child health supervision services up to age 18, as defined under section 62A.047; and\n(3) preventive health services, including:\n(i) health education;\n(ii) health supervision, evaluation, and follow-up;\n(iii) immunization; and\n(iv) early disease detection.\n(b) Inpatient hospital services shall not be offered as a part of a community health clinic's prepaid option. A clinic may associate with a hospital to provide hospital services to an individual or family who is enrolled in the prepaid option so long as these services are not offered as part of the prepaid option.\n(c) All health care services included by the community health clinic in a prepaid option must be services that are offered within the scope of practice of the clinic by the clinic's professional staff.\nA community health clinic shall not refuse to renew a prepaid option, except for nonpayment of premiums, fraud, or misrepresentation, or as permitted under subdivisions 8 and 9, paragraph (b).\n(a) A community health clinic must provide an individual or family who purchases a prepaid option a clear and concise written statement that includes the following information:\n(1) the health care services that the prepaid option covers;\n(2) any exclusions or limitations on the health care services offered, including any preexisting condition limitations, cost-sharing arrangements, or prior authorization requirements;\n(3) where the health care services may be obtained;\n(4) a description of the clinic's method for resolving patient complaints, including a description of how a patient can file a complaint with the Department of Health; and\n(5) a description of the conditions under which the prepaid option may be canceled or terminated.\n(b) The commissioner of health must approve a copy of the written statement before the community health clinic may offer the prepaid option described in this section.\n(a) A community health clinic that offers a prepaid option under this section must establish a complaint resolution process. As an alternative to establishing its own process, a community health clinic may use the complaint process of another organization.\n(b) A community health clinic must make reasonable efforts to resolve complaints and to inform complainants in writing of the clinic's decision within 60 days of receiving the complaint.\n(c) A community health clinic that offers a prepaid option under this section must report all complaints that are not resolved within 60 days to the commissioner of health.\nA community health clinic may require an individual or family enrolled in the clinic's prepaid option to apply for medical assistance or the MinnesotaCare program. The clinic must assist the individual or family in filing the application for the appropriate public program. If, upon the request of the clinic, an individual or family refuses to apply for these programs, the clinic may disenroll the individual or family from the prepaid option at any time.\n(a) A community health clinic may limit enrollment in its prepaid option. If enrollment is limited, a waiting list must be established.\n(b) A community health clinic may deny enrollment in its prepaid option to an individual or family whose gross family income is greater than 275 percent of the federal poverty guidelines.\n(c) No community health clinic may restrict or deny enrollment in its prepaid option because of an individual's or a family's financial limitations, except as permitted under this subdivision.",
	"repealed": false
}