{
	"id": "144G.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.30",
	"title": "144G.30 SURVEYS AND INVESTIGATIONS.",
	"text": "(a) The Department of Health is the exclusive state agency charged with the responsibility and duty of surveying and investigating all assisted living facilities required to be licensed under this chapter. The commissioner of health shall enforce all sections of this chapter and the rules adopted under this chapter.\n(b) The commissioner, upon request to the facility, must be given access to relevant information, records, incident reports, and other documents in the possession of the facility if the commissioner considers them necessary for the discharge of responsibilities. For purposes of surveys and investigations and securing information to determine compliance with licensure laws and rules, the commissioner need not present a release, waiver, or consent to the individual. The identities of residents must be kept private as defined in section 13.02, subdivision 12.\nThe commissioner shall conduct a survey of each assisted living facility on a frequency of at least once every two years. The commissioner may conduct surveys more frequently than every two years based on the license category, the facility's compliance history, the number of residents served, or other factors as determined by the commissioner deemed necessary to ensure the health, safety, and welfare of residents and compliance with the law.\nSurveys and investigations shall be conducted without advance notice to the facilities. Surveyors may contact the facility on the day of a survey to arrange for someone to be available at the survey site. The contact does not constitute advance notice. The surveyor must provide presurvey notification to the Office of Ombudsman for Long-Term Care.\n(a) The assisted living facility shall provide accurate and truthful information to the department during a survey, investigation, or other licensing activities.\n(b) Upon request of a surveyor, assisted living facilities shall within a reasonable period of time provide a list of current and past residents and their legal representatives and designated representatives that includes addresses and telephone numbers and any other information requested about the services to residents.\n(a) A correction order may be issued whenever the commissioner finds upon survey or during a complaint investigation that a facility, a managerial official, an agent of the facility, or staff of the facility is not in compliance with this chapter. The correction order shall cite the specific statute and document areas of noncompliance and the time allowed for correction.\n(b) The commissioner shall mail or email copies of any correction order to the facility within 30 calendar days after the survey exit date. A copy of each correction order and copies of any documentation supplied to the commissioner shall be kept on file by the facility and public documents shall be made available for viewing by any person upon request. Copies may be kept electronically.\n(c) By the correction order date, the facility must:\n(1) document in the facility's records any action taken to comply with the correction order. The commissioner may request a copy of this documentation and the facility's action to respond to the correction order in future surveys, upon a complaint investigation, and as otherwise needed; and\n(2) make available, in a manner readily accessible to residents and others, including provision of a paper copy upon request, the most recent plan of correction documenting the actions taken by the facility to comply with the correction order.\n(d) After the plan of correction is made available under paragraph (c), clause (2), the facility must provide a copy of the facility's most recent plan of correction to any individual who requests it. A copy of the most recent plan of correction must be provided within 30 days after the request and in a format determined by the facility, except the facility must make reasonable accommodations in providing the plan of correction in another format, including a paper copy, upon request.\nThe commissioner may conduct follow-up surveys to determine if the facility has corrected deficient issues and systems identified during a survey or complaint investigation. Follow-up surveys may be conducted via phone, email, fax, mail, or on-site reviews. Follow-up surveys, other than complaint investigations, shall be concluded with an exit conference and written information provided on the process for requesting a reconsideration of the survey results.\nFor assisted living facilities that have Level 3 or Level 4 violations under section 144G.31, the commissioner shall conduct a follow-up survey within 90 calendar days of the survey. When conducting a follow-up survey, the surveyor shall focus on whether the previous violations have been corrected and may also address any new violations that are observed while evaluating the corrections that have been made.\nIf the commissioner finds that the applicant or a facility has not corrected violations by the date specified in the correction order or conditional license resulting from a survey or complaint investigation, the commissioner shall provide a notice of noncompliance with a correction order by emailing the notice of noncompliance to the facility. The noncompliance notice must list the violations not corrected.",
	"repealed": false
}