{
	"id": "145.9285",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9285",
	"title": "145.9285 COMMUNITY SOLUTIONS FOR HEALTHY CHILD DEVELOPMENT GRANT PROGRAM.",
	"text": "The commissioner of health shall establish the community solutions for healthy child development grant program. The purpose of the program is to:\n(1) improve child development outcomes as related to the well-being of children of color and American Indian children from prenatal to grade 3 and their families, including but not limited to the goals outlined by the Department of Human Services' early childhood systems reform effort for: early learning; health and well-being; economic security; and safe, stable, nurturing relationships and environments by funding community-based solutions for challenges that are identified by the affected community;\n(2) reduce racial disparities in children's health and development from prenatal to grade 3; and\n(3) promote racial and geographic equity.\nThe commissioner shall:\n(1) develop a request for proposals for the healthy child development grant program in consultation with the Community Solutions Advisory Council;\n(2) provide outreach, technical assistance, and program development support to increase capacity for new and existing service providers in order to better meet statewide needs, particularly in greater Minnesota and areas where services to reduce health disparities have not been established;\n(3) review responses to requests for proposals, in consultation with the Community Solutions Advisory Council, and award grants under this section;\n(4) ensure communication with the ethnic councils, Minnesota Indian Affairs Council, and the state advisory council on early childhood education and care on the request for proposal process;\n(5) establish a transparent and objective accountability process, in consultation with the Community Solutions Advisory Council, that is focused on outcomes that grantees agree to achieve;\n(6) provide grantees with access to data to assist grantees in establishing and implementing effective community-led solutions;\n(7) maintain data on outcomes reported by grantees; and\n(8) contract with an independent third-party entity to evaluate the success of the grant program and to build the evidence base for effective community solutions in reducing health disparities of children of color and American Indian children from prenatal to grade 3.\n(a) The commissioner, in consultation with the three ethnic councils under section 15.0145 and the Indian Affairs Council under section 3.922, shall appoint a 13-member Community Solutions Advisory Council, as follows:\n(1) three members representing Black Minnesotans of African heritage, one of whom is a parent with a child under the age of eight years at the time of the appointment;\n(2) three members representing Latino and Latina Minnesotans with an ethnic heritage from Mexico, a country in Central or South America, Cuba, the Dominican Republic, or Puerto Rico, one of whom is a parent with a child under the age of eight years at the time of the appointment;\n(3) three members representing Asian-Pacific Minnesotans with Asian-Pacific heritage, one of whom is a parent with a child under the age of eight years at the time of the appointment;\n(4) three members representing the American Indian community, one of whom is a parent of a child under the age of eight years at the time of the appointment; and\n(5) one member with research or academic expertise in racial equity and healthy child development.\n(b) The commissioner must include representation from organizations with expertise in advocacy on behalf of communities of color and Indigenous communities in areas related to the grant program.\n(c) At least three of the 13 members appointed under paragraph (a), clauses (1) to (4), of the advisory council must come from outside the seven-county metropolitan area.\n(d) The Community Solutions Advisory Council shall:\n(1) advise the commissioner on the development of the request for proposals for community solutions healthy child development grants. In advising the commissioner, the council must consider how to build on the capacity of communities to promote child and family well-being and address social determinants of healthy child development;\n(2) review responses to requests for proposals and advise the commissioner on the selection of grantees and grant awards;\n(3) advise the commissioner on the establishment of a transparent and objective accountability process focused on outcomes the grantees agree to achieve;\n(4) advise the commissioner on ongoing oversight and necessary support in the implementation of the program; and\n(5) support the commissioner on other racial equity and early childhood grant efforts.\n(e) Member terms, compensation, and removal shall be as provided in section 15.059, subdivisions 2 to 4.\n(f) The commissioner must convene meetings of the advisory council at least four times per year.\n(g) The advisory council shall expire upon expiration or repeal of the healthy childhood development program.\n(h) The commissioner of health must provide meeting space and administrative support for the advisory council.\nOrganizations eligible to receive grant funding under this section include:\n(1) organizations or entities that work with communities of color and American Indian communities;\n(2) Tribal Nations and Tribal organizations as defined in section 658P of the Child Care and Development Block Grant Act of 1990; and\n(3) organizations or entities focused on supporting healthy child development.\n(a) The commissioner, in consultation with the Community Solutions Advisory Council, shall develop a request for proposals for healthy child development grants. In developing the proposals and awarding the grants, the commissioner shall consider building on the capacity of communities to promote child and family well-being and address social determinants of healthy child development. Proposals must focus on increasing racial equity and healthy child development and reducing health disparities experienced by children of color and American Indian children from prenatal to grade 3 and their families.\n(b) In awarding the grants, the commissioner shall provide strategic consideration and give priority to proposals from:\n(1) organizations or entities led by people of color and serving communities of color;\n(2) organizations or entities led by American Indians and serving American Indians, including Tribal Nations and Tribal organizations;\n(3) organizations or entities with proposals focused on healthy development from prenatal to grade 3;\n(4) organizations or entities with proposals focusing on multigenerational solutions;\n(5) organizations or entities located in or with proposals to serve communities located in counties that are moderate to high risk according to the Wilder Research Risk and Reach Report; and\n(6) community-based organizations that have historically served communities of color and American Indians and have not traditionally had access to state grant funding.\nThe advisory council may recommend additional strategic considerations and priorities to the commissioner.\n(c) The first round of grants must be awarded no later than April 15, 2024. Grants must be awarded annually thereafter. Grants are awarded for a period of three years.\nThe commissioner and the advisory council shall ensure that grant money is prioritized and awarded to organizations and entities that are within counties that have a higher proportion of people of color and American Indians than the state average, to the extent possible.\nGrantees must report grant program outcomes to the commissioner on the forms and according to the timelines established by the commissioner.",
	"repealed": false
}