{
	"id": "403.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.275",
	"title": "403.275 STATE 911 REVENUE BONDS.",
	"text": "(a) The commissioner of management and budget, if requested by a vote of at least two-thirds of all the members of the Statewide Radio Board, shall sell and issue state revenue bonds for the following purposes:\n(1) to pay the costs of the statewide public safety radio communication system backbone identified in the plan under section 403.36 and those elements that the Statewide Radio Board determines are of regional or statewide benefit and support mutual aid and emergency medical services communication, including, but not limited to, costs of master controllers of the backbone;\n(2) to pay the costs of issuance, debt service, and bond insurance or other credit enhancements, and to fund reserves; and\n(3) to refund bonds issued under this section.\n(b) The amount of bonds that may be issued for the purposes of paragraph (a), clause (1), will be set from time to time by law; the amount of bonds that may be issued for the purposes of paragraph (a), clauses (2) and (3), is not limited.\n(c) The bond proceeds may be used to pay up to 50 percent of the cost to a local government unit of building a subsystem. The bond proceeds may be used to make improvements to an existing 800 MHz radio system that will interoperate with the regionwide public safety radio communication system, provided that the improvements conform to the Statewide Radio Board's plan and technical standards. The bond proceeds may not be used to pay for portable or subscriber radio sets.\n(a) The commissioner may sell and issue the bonds on the terms and conditions the commissioner determines to be in the best interests of the state. The bonds may be sold at public or private sale. The commissioner may enter any agreements or pledges the commissioner determines necessary or useful to sell the bonds that are not inconsistent with sections 403.21 to 403.40. Sections 16A.672 to 16A.675 apply to the bonds. The commissioner may issue all or part of the bonds as tax credit bonds or as interest subsidy bonds under section 16A.647 or a combination of the two. Except for amounts appropriated to pay the costs of investment banking and banking services under section 16A.647, the proceeds of the bonds issued under this section must be credited to a special 911 revenue bond proceeds account in the state treasury.\n(b) Before the proceeds are received in the 911 revenue bond proceeds account, the commissioner of management and budget may transfer to the account from the 911 emergency telecommunications service account amounts not exceeding the expected proceeds from the next bond sale. The commissioner of management and budget shall return these amounts to the 911 emergency telecommunications service account by transferring proceeds when received. The amounts of these transfers are appropriated from the 911 emergency telecommunications service account and from the 911 revenue bond proceeds account.\nThe debt service on the bonds is payable only from the following sources:\n(1) revenue credited to the 911 emergency telecommunications service account from the fee imposed and collected under section 237.491 or 403.11, subdivision 1, or from any other source; and\n(2) other revenues pledged to the payment of the bonds.\nThe commissioner may issue bonds to refund outstanding bonds issued under subdivision 1, including the payment of any redemption premiums on the bonds and any interest accrued or to accrue to the first redemption date after delivery of the refunding bonds. The proceeds of the refunding bonds may, in the discretion of the commissioner, be applied to the purchases or payment at maturity of the bonds to be refunded, or the redemption of the outstanding bonds on the first redemption date after delivery of the refunding bonds and may, until so used, be placed in escrow to be applied to the purchase, retirement, or redemption. Refunding bonds issued under this subdivision must be issued and secured in the manner provided by the commissioner.\nBonds issued under this section are not public debt, and the full faith, credit, and taxing powers of the state are not pledged for their payment. The bonds may not be paid, directly in whole or in part from a tax of statewide application on any class of property, income, transaction, or privilege. Payment of the bonds is limited to the revenues explicitly authorized to be pledged under this section. The state neither makes nor has a moral obligation to pay the bonds if the pledged revenues and other legal security for them is insufficient.\nThe commissioner may contract with and appoint a trustee for bond holders. The trustee has the powers and authority vested in it by the commissioner under the bond and trust indentures.\nAny pledge made by the commissioner is valid and binding from the time the pledge is made. The money or property pledged and later received by the commissioner is immediately subject to the lien of the pledge without any physical delivery of the property or money or further act, and the lien of any pledge is valid and binding as against all parties having claims of any kind in tort, contract, or otherwise against the commissioner, whether or not those parties have notice of the lien or pledge. Neither the order nor any other instrument by which a pledge is created need be recorded.\nThe commissioner, subject to agreements with bondholders that may then exist, may, out of any money available for the purpose, purchase bonds of the commissioner at a price not exceeding (1) if the bonds are then redeemable, the redemption price then applicable plus accrued interest to the next interest payment date thereon, or (2) if the bonds are not redeemable, the redemption price applicable on the first date after the purchase upon which the bonds become subject to redemption plus accrued interest to that date.\nThe state pledges and agrees with the holders of any bonds that the state will not limit or alter the rights vested in the commissioner to fulfill the terms of any agreements made with the bondholders, or in any way impair the rights and remedies of the holders until the bonds, together with interest on them, with interest on any unpaid installments of interest, and all costs and expenses in connection with any action or proceeding by or on behalf of the bondholders, are fully met and discharged. The commissioner may include this pledge and agreement of the state in any agreement with the holders of bonds issued under this section.",
	"repealed": false
}