{
	"id": "97B.1055",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.1055",
	"title": "97B.1055 HUNTING BY PERSONS WITH A PERMANENT PHYSICAL OR DEVELOPMENTAL DISABILITY.",
	"text": "For purposes of this section and section 97B.015, subdivision 6:\n(1) \"developmental disability\" means a diagnosis of having substantial limitations in present functioning, manifested as significantly subaverage intellectual functioning, existing concurrently with demonstrated deficits in adaptive behavior, when these conditions manifest before the person's 22nd birthday; and\n(2) \"permanent physical disability\" means a physical disability that prevents a person from being able to navigate natural terrain or hold a firearm for a required field component for the firearms safety training program under section 97B.020.\n(a) Notwithstanding section 97B.020, a person with a permanent physical disability or developmental disability may obtain a firearms hunting license with a provisional firearms safety certificate issued under section 97B.015, subdivision 6.\n(b) Any person accompanying or assisting a person with a permanent physical disability or developmental disability under this section must possess a valid firearms safety certificate issued by the commissioner.\nA person who obtains a firearms hunting license under subdivision 2 must be accompanied and assisted by a parent, guardian, or other adult person designated by a parent or guardian when hunting. A person who is not hunting but is solely accompanying and assisting a person with a permanent physical disability or developmental disability need not obtain a hunting license.\n(a) This section does not entitle a person to possess a firearm if the person is otherwise prohibited from possessing a firearm under state or federal law or a court order.\n(b) No person shall knowingly authorize or permit a person who by reason of a permanent physical disability or developmental disability is incapable of safely possessing a firearm to possess a firearm to hunt in the state or on any boundary water of the state.",
	"repealed": false
}