{
	"id": "245I.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.06",
	"title": "245I.06 TREATMENT SUPERVISION.",
	"text": "(a) A license holder must ensure that a mental health professional or certified rehabilitation specialist provides treatment supervision to each staff person who provides services to a client and who is not a mental health professional or certified rehabilitation specialist. When providing treatment supervision, a treatment supervisor must follow a staff person's written treatment supervision plan.\n(b) Treatment supervision must focus on each client's treatment needs and the ability of the staff person under treatment supervision to provide services to each client, including the following topics related to the staff person's current caseload:\n(1) a review and evaluation of the interventions that the staff person delivers to each client;\n(2) instruction on alternative strategies if a client is not achieving treatment goals;\n(3) a review and evaluation of each client's assessments, treatment plans, and progress notes for accuracy and appropriateness;\n(4) instruction on the cultural norms or values of the clients and communities that the license holder serves and the impact that a client's culture has on providing treatment;\n(5) evaluation of and feedback regarding a direct service staff person's areas of competency; and\n(6) coaching, teaching, and practicing skills with a staff person.\n(c) A treatment supervisor must provide treatment supervision to a staff person using methods that allow for immediate feedback, including in-person, telephone, and interactive video supervision.\n(d) A treatment supervisor's responsibility for a staff person receiving treatment supervision is limited to the services provided by the associated license holder. If a staff person receiving treatment supervision is employed by multiple license holders, each license holder is responsible for providing treatment supervision related to the treatment of the license holder's clients.\n(a) A treatment supervisor and the staff person supervised by the treatment supervisor must develop a written treatment supervision plan. The license holder must ensure that a new staff person's treatment supervision plan is completed and implemented by a treatment supervisor and the new staff person within 30 days of the new staff person's first day of employment. The license holder must review and update each staff person's treatment supervision plan annually.\n(b) Each staff person's treatment supervision plan must include:\n(1) the name and qualifications of the staff person receiving treatment supervision;\n(2) the names and licensures of the treatment supervisors who are supervising the staff person;\n(3) how frequently the treatment supervisors must provide treatment supervision to the staff person; and\n(4) the staff person's authorized scope of practice, including a description of the client population that the staff person serves, and a description of the treatment methods and modalities that the staff person may use to provide services to clients.\n(a) A mental health behavioral aide or a mental health rehabilitation worker must receive direct observation from a mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner while the mental health behavioral aide or mental health rehabilitation worker provides treatment services to clients, no less than twice per month for the first six months of employment and once per month thereafter. The staff person performing the direct observation must approve of the progress note for the observed treatment service.\n(b) For a mental health rehabilitation worker qualified under section 245I.04, subdivision 14, paragraph (a), clause (2), item (i), treatment supervision in the first 2,000 hours of work must at a minimum consist of:\n(1) monthly individual supervision; and\n(2) direct observation twice per month.",
	"repealed": false
}