{
	"id": "245.735",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.735",
	"title": "245.735 CERTIFIED COMMUNITY BEHAVIORAL HEALTH CLINIC SERVICES.",
	"text": "MS 2020 [Repealed, 2021 c 30 art 11 s 8]\n(a) For the purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Alcohol and drug counselor\" has the meaning given in section 245G.11, subdivision 5.\n(c) \"Care coordination\" means the activities required to coordinate care across settings and providers for a person served to ensure seamless transitions across the full spectrum of health services. Care coordination includes outreach and engagement; documenting a plan of care for medical, behavioral health, and social services and supports in the integrated treatment plan; assisting with obtaining appointments; confirming appointments are kept; developing a crisis plan; tracking medication; and implementing care coordination agreements with external providers. Care coordination may include psychiatric consultation with primary care practitioners and with mental health clinical care practitioners.\n(d) \"Community needs assessment\" means an assessment to identify community needs and determine the community behavioral health clinic's capacity to address the needs of the population being served.\n(e) \"Comprehensive evaluation\" means a person-centered, family-centered, and trauma-informed evaluation meeting the requirements of subdivision 4b completed for the purposes of diagnosis and treatment planning.\n(f) \"Designated collaborating organization\" means an entity meeting the requirements of subdivision 3a with a formal agreement with a CCBHC to furnish CCBHC services.\n(g) \"Functional assessment\" means an assessment of a client's current level of functioning relative to functioning that is appropriate for someone the client's age and that meets the requirements of subdivision 4a.\n(h) \"Initial evaluation\" means an evaluation completed by a mental health professional that gathers and documents information necessary to formulate a preliminary diagnosis and begin client services.\n(i) \"Integrated treatment plan\" means a documented plan of care that is person- and family-centered and formulated to respond to a client's needs and goals.\n(j) \"Mental health professional\" has the meaning given in section 245I.04, subdivision 2.\n(k) \"Mobile crisis services\" has the meaning given in section 256B.0624, subdivision 2.\n(l) \"Preliminary screening and risk assessment\" means a mandatory screening and risk assessment that is completed at the first contact with the prospective CCBHC service recipient and determines the acuity of client need.\nMS 2020 [Repealed, 2021 c 30 art 11 s 8]\nThe certified community behavioral health clinic model is an integrated payment and service delivery model that uses evidence-based behavioral health practices to achieve better outcomes for individuals experiencing behavioral health concerns while achieving sustainable rates for providers and economic efficiencies for payors.\n(a) The commissioner shall establish state certification and recertification processes for certified community behavioral health clinics (CCBHCs) that satisfy all federal requirements necessary for CCBHCs certified under this section to be eligible for reimbursement under medical assistance, without service area limits based on geographic area or region. The commissioner shall consult with CCBHC stakeholders before establishing and implementing changes in the certification or recertification process and requirements. Any changes to the certification or recertification process or requirements must be consistent with the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration. The commissioner must allow a transition period for CCBHCs to meet the revised criteria on or before January 1, 2025. The commissioner is authorized to amend the state's Medicaid state plan or the terms of the demonstration to comply with federal requirements.\n(b) As part of the state CCBHC certification and recertification processes, the commissioner shall provide to entities applying for certification or requesting recertification the standard requirements of the community needs assessment and the staffing plan that are consistent with the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration.\n(c) The commissioner shall schedule a certification review that includes a site visit within 90 calendar days of receipt of an application for certification or recertification.\n(d) Entities that choose to be CCBHCs must:\n(1) complete a community needs assessment and complete a staffing plan that is responsive to the needs identified in the community needs assessment and update both the community needs assessment and the staffing plan no less frequently than every 36 months;\n(2) comply with state licensing requirements and other requirements issued by the commissioner;\n(3) employ or contract with a medical director. A medical director must be a physician licensed under chapter 147 and either certified by the American Board of Psychiatry and Neurology, certified by the American Osteopathic Board of Neurology and Psychiatry, or eligible for board certification in psychiatry. A registered nurse who is licensed under sections 148.171 to 148.285 and is certified as a nurse practitioner in adult or family psychiatric and mental health nursing by a national nurse certification organization may serve as the medical director when a CCBHC is unable to employ or contract a qualified physician;\n(4) employ or contract for clinic staff who have backgrounds in diverse disciplines, including licensed mental health professionals and licensed alcohol and drug counselors, and staff who are culturally and linguistically trained to meet the needs of the population the clinic serves;\n(5) ensure that clinic services are available and accessible to individuals and families of all ages and genders with access on evenings and weekends and that crisis management services are available 24 hours per day;\n(6) establish fees for clinic services for individuals who are not enrolled in medical assistance using a sliding fee scale that ensures that services to patients are not denied or limited due to an individual's inability to pay for services;\n(7) comply with quality assurance reporting requirements and other reporting requirements included in the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration;\n(8) provide crisis mental health and substance use services, withdrawal management services, emergency crisis intervention services, and stabilization services through existing mobile crisis services; screening, assessment, and diagnosis services, including risk assessments and level of care determinations; person- and family-centered treatment planning; outpatient mental health and substance use services; targeted case management; psychiatric rehabilitation services; peer support and counselor services and family support services; and intensive community-based mental health services, including mental health services for members of the armed forces and veterans. CCBHCs must directly provide the majority of these services to enrollees, but may coordinate some services with another entity through a collaboration or agreement, pursuant to subdivision 3a;\n(9) provide coordination of care across settings and providers to ensure seamless transitions for individuals being served across the full spectrum of health services, including acute, chronic, and behavioral needs;\n(10) be certified as a mental health clinic under section 245I.20;\n(11) comply with standards established by the commissioner relating to CCBHC screenings, assessments, and evaluations that are consistent with this section;\n(12) be licensed to provide substance use disorder treatment under chapter 245G;\n(13) be certified to provide children's therapeutic services and supports under section 256B.0943;\n(14) be certified to provide adult rehabilitative mental health services under section 256B.0623;\n(15) be enrolled to provide mental health crisis response services under section 256B.0624;\n(16) be enrolled to provide mental health targeted case management under section 256B.0625, subdivision 20;\n(17) provide services that comply with the evidence-based practices described in subdivision 3d;\n(18) provide peer services as defined in sections 256B.0615, 256B.0616, and 245G.07, subdivision 2, clause (8), as applicable when peer services are provided; and\n(19) inform all clients upon initiation of care of the full array of services available under the CCBHC model.\n[See Note.]\nIf a certified CCBHC is unable to provide one or more of the services listed in subdivision 3, paragraph (d), clauses (8) to (19), the CCBHC may contract with another entity that has the required authority to provide that service and that meets the requirements of the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration.\nNotwithstanding any other law that requires a county contract or other form of county approval for a service listed in subdivision 3, paragraph (d), clause (8), a CCBHC that meets the requirements of this section may receive the prospective payment under section 256B.0625, subdivision 5m, for that service without a county contract or county approval.\nWhen the standards listed in this section or other applicable standards conflict or address similar issues in duplicative or incompatible ways, the commissioner may grant variances to state requirements if the variances do not conflict with federal requirements for services reimbursed under medical assistance. If standards overlap, the commissioner may substitute all or a part of a licensure or certification that is substantially the same as another licensure or certification. The commissioner shall consult with stakeholders before granting variances under this provision. For a CCBHC that is certified but not approved for prospective payment under section 256B.0625, subdivision 5m, the commissioner may grant a variance under this paragraph if the variance does not increase the state share of costs.\nThe commissioner shall issue a list of required evidence-based practices to be delivered by CCBHCs and may also provide a list of recommended evidence-based practices. The commissioner may update the list to reflect advances in outcomes research and medical services for persons living with mental illnesses or substance use disorders. The commissioner shall take into consideration the adequacy of evidence to support the efficacy of the practice across cultures and ages, the workforce available, and the current availability of the practice in the state. At least 30 days before issuing the initial list or issuing any revisions, the commissioner shall provide stakeholders with an opportunity to comment.\nA CCBHC must apply for recertification every 36 months.\n(a) The commissioner shall provide a formal written notice to an applicant for CCBHC certification outlining the determination of the application and process for applicable and necessary corrective action required of the applicant signed by the commissioner or appropriate division director to applicant entities within 45 calendar days of the site visit.\n(b) The commissioner may reject an application if the applicant entity does not take all corrective actions specified in the notice and notify the commissioner that the applicant entity has done so within 60 calendar days.\n(c) The commissioner must send the applicant entity a final decision on the corrected application within 45 calendar days of the applicant entity's notice to the commissioner that the applicant has taken the required corrective actions.\nThe commissioner must establish a process for decertification. The commissioner must require corrective action, medical assistance repayment, or decertification of a CCBHC that no longer meets the requirements in this section or that fails to meet the standards provided by the commissioner in the application, certification, or recertification process.\nA CCBHC must meet minimum staffing requirements required by the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration.\nMS 2020 [Repealed, 2021 c 30 art 11 s 8]\n(a) For adults, a functional assessment may be completed using a Daily Living Activities-20 tool.\n(b) Notwithstanding any law to the contrary, a functional assessment performed by a CCBHC that meets the requirements of this subdivision satisfies the requirements in:\n(1) section 256B.0623, subdivision 9;\n(2) section 245.4711, subdivision 3; and\n(3) Minnesota Rules, part 9520.0914, subpart 2.\n(a) A comprehensive evaluation must be completed for all new clients within 60 calendar days following the preliminary screening and risk assessment.\n(b) Only a mental health professional may complete a comprehensive evaluation. The mental health professional must consult with an alcohol and drug counselor when substance use disorder services are deemed clinically appropriate.\n(c) The comprehensive evaluation must consist of the synthesis of existing information including but not limited to an external diagnostic assessment, crisis assessment, preliminary screening and risk assessment, initial evaluation, and primary care screenings.\n(d) A comprehensive evaluation must be completed in the cultural context of the client and updated to reflect changes in the client's conditions and at the client's request or when the client's condition no longer meets the existing diagnosis.\n(e) The psychiatric evaluation and management service fulfills requirements for the comprehensive evaluation when a client of a CCBHC is receiving exclusively psychiatric evaluation and management services. The CCBHC shall complete the comprehensive evaluation within 60 calendar days of a client's referral for additional CCBHC services.\n(f) For clients engaging exclusively in substance use disorder services at the CCBHC, a substance use disorder comprehensive assessment as defined in section 245G.05, subdivision 2, that is completed within 60 calendar days of service initiation shall fulfill requirements of the comprehensive evaluation.\n(g) Notwithstanding any law to the contrary, a comprehensive evaluation performed by a CCBHC that meets the requirements of this subdivision satisfies the requirements in:\n(1) section 245.462, subdivision 20, paragraph (c);\n(2) section 245.4711, subdivision 2, paragraph (b);\n(3) section 245.4871, subdivision 6;\n(4) section 245.4881, subdivision 2, paragraph (c);\n(5) section 245G.04, subdivision 1;\n(6) section 245G.05, subdivision 1;\n(7) section 245I.10, subdivisions 4 to 6;\n(8) section 256B.0623, subdivisions 3, clause (4), 8, and 10;\n(9) section 256B.0943, subdivisions 3 and 6, paragraph (b), clause (1);\n(10) Minnesota Rules, part 9520.0909, subpart 1;\n(11) Minnesota Rules, part 9520.0910, subparts 1 and 2; and\n(12) Minnesota Rules, part 9520.0914, subpart 2.\n(a) A CCBHC must complete either an initial evaluation or a comprehensive evaluation as required by the most recently issued Certified Community Behavioral Health Clinic Certification Criteria published by the Substance Abuse and Mental Health Services Administration.\n(b) Notwithstanding any law to the contrary, an initial evaluation performed by a CCBHC that meets the requirements of this subdivision satisfies the requirements in:\n(1) section 245.4711, subdivision 4;\n(2) section 245.4881, subdivisions 3 and 4;\n(3) section 245I.10, subdivision 5;\n(4) section 256B.0623, subdivisions 3, clause (4), 8, and 10;\n(5) section 256B.0943, subdivisions 3 and 6, paragraph (b), clauses (1) and (2);\n(6) Minnesota Rules, part 9520.0909, subpart 1;\n(7) Minnesota Rules, part 9520.0910, subpart 1;\n(8) Minnesota Rules, part 9520.0914, subpart 2;\n(9) Minnesota Rules, part 9520.0918, subparts 1 and 2; and\n(10) Minnesota Rules, part 9520.0919, subpart 2.\n(a) An integrated treatment plan must be completed within 60 calendar days following the preliminary screening and risk assessment and updated no less frequently than every six months or when the client's circumstances change.\n(b) Only a mental health professional may complete an integrated treatment plan. The mental health professional must consult with an alcohol and drug counselor when substance use disorder services are deemed clinically appropriate. An alcohol and drug counselor may approve the integrated treatment plan. The integrated treatment plan must be developed through a shared decision-making process with the client, the client's support system if the client chooses, or, for children, with the family or caregivers.\n(c) The integrated treatment plan must:\n(1) use the ASAM 6 dimensional framework; and\n(2) incorporate prevention, medical and behavioral health needs, and service delivery.\n(d) The psychiatric evaluation and management service fulfills requirements for the integrated treatment plan when a client of a CCBHC is receiving exclusively psychiatric evaluation and management services. The CCBHC must complete an integrated treatment plan within 60 calendar days of a client's referral for additional CCBHC services.\n(e) Notwithstanding any law to the contrary, an integrated treatment plan developed by a CCBHC that meets the requirements of this subdivision satisfies the requirements in:\n(1) section 245G.06, subdivision 1;\n(2) section 245G.09, subdivision 3, clause (6);\n(3) section 245I.10, subdivisions 7 and 8;\n(4) section 256B.0623, subdivision 10; and\n(5) section 256B.0943, subdivision 6, paragraph (b), clause (2).\n(a) This subdivision applies to programs and clinics that are a part of a CCBHC.\n(b) The requirements for initial evaluations under subdivision 4c, comprehensive evaluations under subdivision 4b, and integrated treatment plans under subdivision 4d are incorporated into the licensing requirements for substance use disorder treatment programs under chapter 245G.\n(c) The requirements for initial evaluations under subdivision 4c, comprehensive evaluations under subdivision 4b, and integrated treatment plans under subdivision 4d are incorporated into the certification requirements for mental health clinics under section 245I.20.\n(d) The Department of Human Services licensing division will review, inspect, and investigate for compliance with the requirements in subdivisions 4b to 4d for programs or clinics subject to this subdivision.\nThe commissioner and the state chief information officer shall provide information systems support to the projects as necessary to comply with state and federal requirements, including data reporting requirements.\n(a) The commissioner must request federal approval to participate in the demonstration program established by section 223 of the Protecting Access to Medicare Act and, if approved, to continue to participate in the demonstration program as long as federal funding for the demonstration program remains available from the United States Department of Health and Human Services. To the extent practicable, the commissioner shall align the requirements of the demonstration program with the requirements under this section for CCBHCs receiving medical assistance reimbursement under the authority of the state's Medicaid state plan. A CCBHC may not apply to participate as a billing provider in both the CCBHC federal demonstration and the benefit for CCBHCs under the medical assistance program.\n(b) The commissioner must follow federal payment guidance, including payment of the CCBHC daily bundled rate for services rendered by CCBHCs to individuals who are dually eligible for Medicare and medical assistance when Medicare is the primary payer for the service. Services provided by a CCBHC operating under the authority of the state's Medicaid state plan will not receive the prospective payment system rate for services rendered by CCBHCs to individuals who are dually eligible for Medicare and medical assistance when Medicare is the primary payer for the service.\n(c) Payment for services rendered by CCBHCs to individuals who have commercial insurance as the primary payer and medical assistance as secondary payer is subject to the requirements under section 256B.37. Services provided by a CCBHC operating under the authority of the 223 demonstration or the state's Medicaid state plan will not receive the prospective payment system rate for services rendered by CCBHCs to individuals who have commercial insurance as the primary payer and medical assistance as the secondary payer.\n(a) If the commissioner's request under subdivision 6 to reenter the demonstration program established by section 223 of the Protecting Access to Medicare Act is approved, upon reentry the commissioner must follow all federal guidance on the addition of CCBHCs to section 223 state demonstration programs.\n(b) Prior to participating in the demonstration, a CCBHC must meet the demonstration certification criteria and prospective payment system guidance in effect at that time and be certified as a CCBHC by the state. The Substance Abuse and Mental Health Services Administration attestation process for CCBHC expansion grants is not sufficient to constitute state certification. CCBHCs newly added to the demonstration must participate in all aspects of the state demonstration program, including but not limited to quality measurement and reporting, evaluation activities, and state CCBHC demonstration program requirements, such as use of state-specified evidence-based practices. A newly added CCBHC must report on quality measures before its first full demonstration year if it joined the demonstration program in calendar year 2023 out of alignment with the state's demonstration year cycle. A CCBHC may provide services in multiple locations and in community-based settings subject to federal rules of the 223 demonstration authority or Medicaid state plan authority.\n(c) If a CCBHC meets the definition of a satellite facility, as defined by the Substance Abuse and Mental Health Services Administration, and was established after April 1, 2014, the CCBHC cannot receive payment as a part of the demonstration program.\nCCBHCs and designated collaborating organizations must allow all service recipients access to grievance procedures, which must satisfy the minimum requirements of medical assistance and other grievance requirements such as those that may be mandated by relevant accrediting entities.",
	"repealed": false
}