{
	"id": "144.4198",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4198",
	"title": "144.4198 MASS DISPENSING UNDER AUTHORITY OF COMMISSIONER OF HEALTH.",
	"text": "\"Closed point of dispensing (POD)\" means a dispensing or vaccinating location, including but not limited to a business, nonprofit, governmental, correctional, educational, health care, religious, or other entity that dispenses to a limited group such as employees and their household members, residents, business guests, students, or inmates. A closed POD is not open to the public.\n(a) When the commissioner of health has determined that a pandemic influenza, other life-threatening disease, or terrorist, accidental, or natural event requires urgent treatment or prophylactic measures, the commissioner may designate persons and entities to expedite legend drug dispensing, by means of any of the methods in paragraphs (b), (c), and (d), or any method the commissioner deems warranted.\n(b) Legend drugs may be distributed and dispensed to a household representative by the commissioner, or by a local public health or tribal public health agency authorized by the commissioner. The household representative shall convey medical information and distribute legend drugs to individuals who have entrusted the household representative with drug collection responsibilities. Each individual must meet medical protocol criteria established by the commissioner. The household representative may be a mature minor who appears able to understand and carry out the responsibility of legend drug distribution.\n(c) Legend drugs from the United States Department of Health and Human Services, from state or regional pharmaceutical caches, or from other sources available to the commissioner may be distributed by United States Postal Service postal carriers to residences designated by the commissioner.\n(d) Legend drugs may be dispensed or administered via the closed POD according to a plan approved by the commissioner or by local or tribal public health agencies and the medical protocol criteria established by the commissioner.\n(e) The methods in this subdivision shall be carried out under the commissioner's powers in section 151.37, subdivisions 2 and 10.\nA person, corporation, charitable organization, government entity, religious entity, nonprofit entity, or other legal entity, or an employee or agent of the person, corporation, charitable organization, or entity, who, during the preparation for and setup, operation, and demobilization of a closed POD, acts in good faith and under the direction of a closed POD plan that has been approved by the commissioner of health, local public health agency, or tribal public health authority, shall not be liable for civil damages or administrative sanctions for causing the death or injury of a person, or for damage to property. This section does not apply in case of malfeasance or willful or wanton actions.\nThis section does not affect the right of any person to receive benefits to which the person otherwise would be entitled under the workers' compensation law or under any pension law, nor does it affect entitlement to any other benefits or compensation authorized by state law. This section does not affect the right of any person to receive benefits to which the person would otherwise be entitled under federal law, including, but not limited to, the injury compensation fund under the Public Readiness and Preparedness Act, United States Code, title 42, section 247d-6e.",
	"repealed": false
}