{
	"id": "182.677",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.677",
	"title": "182.677 ERGONOMICS.",
	"text": "(a) For purposes of this section, the definitions in this subdivision apply unless otherwise specified.\n(b) \"Health care facility\" means a hospital with a North American Industrial Classification system code of 622110, 622210, or 622310; an outpatient surgical center with a North American Industrial Classification system code of 621493; and a nursing home with a North American Industrial Classification system code of 623110.\n(c) \"Warehouse distribution center\" means a site in Minnesota with 100 or more employees and a North American Industrial Classification system code of 493110, 423110 to 423990, 424110 to 424990, 454110, or 492110.\n(d) \"Meatpacking site\" means a site in Minnesota with 100 or more employees and a North American Industrial Classification system code of 311611 to 311615, except 311613.\n(e) \"Musculoskeletal disorder\" or \"MSD\" means a disorder of the muscles, nerves, tendons, ligaments, joints, cartilage, blood vessels, or spinal discs.\n(a) Every employer with employees at a licensed health care facility, warehouse distribution center, or meatpacking site in the state shall create and implement an effective written ergonomics program establishing the employer's plan to minimize the risk of its employees developing or aggravating musculoskeletal disorders. The ergonomics program shall focus on eliminating the risk. To the extent risk exists, the ergonomics program must include feasible administrative or engineering controls to reduce the risk.\n(b) The program shall include:\n(1) an assessment to identify and reduce musculoskeletal disorder risk factors in the facility;\n(2) an initial and ongoing training of employees on ergonomics and its benefits, including the importance of reporting early symptoms of musculoskeletal disorders;\n(3) a procedure to ensure early reporting of musculoskeletal disorders to prevent or reduce the progression of symptoms, the development of serious injuries, and lost-time claims;\n(4) a process for employees to provide possible solutions that may be implemented to reduce, control, or eliminate workplace musculoskeletal disorders;\n(5) procedures to ensure that physical plant modifications and major construction projects are consistent with program goals; and\n(6) annual evaluations of the ergonomics program and whenever a change to the work process occurs.\nThere must be an established procedure to annually assess the effectiveness of the ergonomics program, including evaluation of the process to mitigate work-related risk factors in response to reporting of symptoms of musculoskeletal disorders by employees. The annual assessment shall determine the success of the implemented ergonomic solutions and whether goals set by the ergonomics program have been met.\n(a) An employer subject to this section must train all employees on the following:\n(1) the name of each individual on the employer's safety committee;\n(2) the facility's ergonomic program;\n(3) the early signs and symptoms of musculoskeletal injuries and the procedures for reporting them;\n(4) the procedures for reporting injuries and other hazards;\n(5) any administrative or engineering controls related to ergonomic hazards that are in place or will be implemented for their positions; and\n(6) the requirements of subdivision 9.\n(b) New employees must be trained according to paragraph (a) prior to starting work. Current employees must receive initial training and ongoing annual training in accordance with the employer's ergonomics program. The employer must provide the training during working hours and compensate the employee for attending the training at the employee's standard rate of pay. All training must be in a language and with vocabulary that the employee can understand.\n(c) Updates to the information conveyed in the training shall be communicated to employees as soon as practicable.\nEmployers subject to this section must solicit feedback for its ergonomics program through its safety committee required by section 182.676, in addition to any other opportunities for employee participation the employer may provide. The safety committee must be directly involved in ergonomics worksite assessments and participate in the annual evaluation required by subdivision 3.\nAn employer subject to this section must reference its ergonomics program in a written Workplace Accident and Injury Reduction (AWAIR) program required by section 182.653, subdivision 8.\nAn employer subject to this section must maintain:\n(1) a written certification dated and signed by each person who provides training and containing the name and job title of each employee who receives training pursuant to this section. The certifications must include the date training was conducted. The certification completed by the training providers must state that the employer has provided training consistent with the requirements of this section and include a brief summary or outline of the information that was included in the training session;\n(2) a record of all worker visits to on-site medical or first aid personnel for the last five years, regardless of severity or type of illness or injury; and\n(3) a record of all musculoskeletal disorders suffered by employees for the last five years.\n(a) The employer must ensure that the certification records required by subdivision 7, clause (1), are up to date and available to the commissioner, employees, and authorized employee representatives, if any, upon request.\n(b) Upon the request of the commissioner, an employee who is a member of the facility's safety committee, or an authorized employee representative, the employer must provide the requestor a redacted version of the medical or first aid records and records of all musculoskeletal disorders. The name, contact information, and occupation of an employee, and any other information that would reveal the identity of an employee, must be removed in the redacted version. The redacted version must only include, to the extent it would not reveal the identity of an employee, the location where the employee worked, the date of the injury or visit, a description of the medical treatment or first aid provided, and a description of the injury suffered.\n(c) The employer must also make available to the commissioner and the employee who is the subject of the records the unredacted medical or first aid records and unredacted records of musculoskeletal disorders required by subdivision 7, clause (2), upon request.\nAny employer subject to this section must not institute or maintain any program, policy, or practice that discourages employees from reporting injuries, hazards, or safety and health standard violations, including ergonomic-related hazards and symptoms of musculoskeletal disorders.\nThe commissioner shall make training materials on implementation of this section available to all employers, upon request, at no cost as part of the duties of the commissioner under section 182.673.\nThis section shall be enforced by the commissioner under sections 182.66 and 182.661. A violation of this section is subject to the penalties provided under section 182.666.\n(a) The commissioner shall establish an ergonomics grant program to provide matching funding for employers who are subject to this section to make ergonomic improvements recommended by an on-site safety survey. Minnesota Rules, chapter 5203, applies to the administration of the grant program.\n(b) To be eligible for a grant under this section, an employer must:\n(1) be a licensed health care facility, warehouse distribution center, or meatpacking site as defined by subdivision 1;\n(2) have current workers' compensation insurance provided through the assigned risk plan, provided by an insurer subject to penalties under chapter 176, or as an approved self-insured employer; and\n(3) have an on-site safety survey with results that recommend specific equipment or practices that will reduce the risk of injury or illness to employees and prevent musculoskeletal disorders. This survey must have been conducted by a Minnesota occupational safety and health compliance investigator or workplace safety consultant, an in-house safety and health committee, a workers' compensation insurance underwriter, a private consultant, or a person under contract with the assigned risk plan.\n(c) Grant funds may be used for all or part of the cost of the following:\n(1) purchasing and installing recommended equipment intended to prevent musculoskeletal disorders;\n(2) operating or maintaining recommended equipment intended to prevent musculoskeletal disorders;\n(3) property, if the property is necessary to meet the recommendations of the on-site safety survey that are related to prevention of musculoskeletal disorders;\n(4) training required to operate recommended safety equipment to prevent musculoskeletal disorders; and\n(5) tuition reimbursement for educational costs related to identifying ergonomic-related issues that are related to the recommendations of the on-site safety survey.\n(d) The commissioner shall evaluate applications, submitted on forms developed by the commissioner, based on whether the proposed project:\n(1) is technically and economically feasible;\n(2) is consistent with the recommendations of the on-site safety survey and the objective of reducing risk of injury or illness to employees and preventing musculoskeletal disorders;\n(3) was submitted by an applicant with sufficient experience, knowledge, and commitment for the project to be implemented in a timely manner;\n(4) has the necessary financial commitments to cover all project costs;\n(5) has the support of all public entities necessary for its completion; and\n(6) complies with federal, state, and local regulations.\n(e) Grants under this section shall provide a match of up to $10,000 for private funds committed by the employer to implement the recommended ergonomics-related equipment or practices.\n(f) Grants will be awarded to all applicants that meet the eligibility and evaluation criteria under paragraphs (b), (c), and (d) until funding is depleted. If there are more eligible requests than funding, awards will be prorated.\n(g) Grant recipients are not eligible to apply for another grant under chapter 176 until two years after the date of the award.\nThe commissioner may propose an ergonomics standard using the authority provided in section 182.655.",
	"repealed": false
}