{
	"id": "181.939",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.939",
	"title": "181.939 NURSING MOTHERS, LACTATING EMPLOYEES, AND PREGNANCY ACCOMMODATIONS.",
	"text": "(a) An employer must provide reasonable break times each day to an employee who needs to express milk. The break times may run concurrently with any break times already provided to the employee. An employer shall not reduce an employee's compensation for time used for the purpose of expressing milk.\n(b) The employer must make reasonable efforts to provide a clean, private, and secure room or other location, in close proximity to the work area, other than a bathroom or a toilet stall, that is shielded from view and free from intrusion from coworkers and the public and that includes access to an electrical outlet, where the employee can express milk in privacy. The employer would be held harmless if reasonable effort has been made.\n(c) For the purposes of this subdivision, \"employer\" means a person or entity that employs one or more employees and includes the state and its political subdivisions.\n(d) An employer shall not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for asserting rights or remedies under this subdivision.\n(a) An employer must provide reasonable accommodations to an employee for health conditions related to pregnancy or childbirth upon request, with the advice of a licensed health care provider or certified doula, unless the employer demonstrates that the accommodation would impose an undue hardship on the operation of the employer's business. A pregnant employee shall not be required to obtain the advice of a licensed health care provider or certified doula, nor may an employer claim undue hardship for the following accommodations: (1) more frequent or longer restroom, food, and water breaks; (2) seating; and (3) limits on lifting over 20 pounds. The employee and employer shall engage in an interactive process with respect to an employee's request for a reasonable accommodation. Reasonable accommodation may include but is not limited to temporary transfer to a less strenuous or hazardous position, temporary leave of absence, modification in work schedule or job assignments, seating, more frequent or longer break periods, and limits to heavy lifting. Notwithstanding any other provision of this subdivision, an employer shall not be required to create a new or additional position in order to accommodate an employee pursuant to this subdivision and shall not be required to discharge an employee, transfer another employee with greater seniority, or promote an employee.\n(b) Nothing in this subdivision shall be construed to affect any other provision of law relating to sex discrimination or pregnancy or in any way diminish the coverage of pregnancy, childbirth, or health conditions related to pregnancy or childbirth under any other provisions of any other law.\n(c) An employer shall not require an employee to take a leave or accept an accommodation.\n(d) An employer shall not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for asserting rights or remedies under this subdivision.\n(e) For the purposes of this subdivision, \"employer\" means a person or entity that employs one or more employees and includes the state and its political subdivisions.\n(f) During any leave for which an employee is entitled to benefits or leave under this subdivision, the employer must maintain coverage under any group insurance policy, group subscriber contract, or health care plan for the employee and any dependents as if the employee was not on leave, provided, however, that the employee must continue to pay any employee share of the cost of the benefits.\nAn employer shall inform employees of their rights under this section at the time of hire and when an employee makes an inquiry about or requests parental leave. Information must be provided in English and the primary language of the employee as identified by the employee. An employer that provides an employee handbook to its employees must include in the handbook notice of employee rights and remedies under this section. The commissioner shall make available to employers the text to be included in the notice required by this section in English and the five most common languages spoken in Minnesota.",
	"repealed": false
}