{
	"id": "214.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.40",
	"title": "214.40 VOLUNTEER HEALTH CARE PROVIDER PROGRAM.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Administrative services unit\" means the administrative services unit for the health-related licensing boards.\n(c) \"Charitable organization\" means a charitable organization within the meaning of section 501(c)(3) of the Internal Revenue Code that has as a purpose the sponsorship or support of programs designed to improve the quality, awareness, and availability of health care services and that serves as a funding mechanism for providing those services.\n(d) \"Health care facility or organization\" means a health care facility licensed under chapter 144 or 144A, or a charitable organization.\n(e) \"Health care provider\" means a physician licensed under chapter 147, physician assistant licensed and practicing under chapter 147A, nurse licensed and registered to practice under chapter 148, dentist, dental hygienist, or dental therapist licensed under chapter 150A, or an advanced dental therapist licensed and certified under chapter 150A.\n(f) \"Health care services\" means health promotion, health monitoring, health education, diagnosis, treatment, minor surgical procedures, the administration of local anesthesia for the stitching of wounds, and primary dental services, including preventive, diagnostic, restorative, and emergency treatment. Health care services do not include the administration of general anesthesia or surgical procedures other than minor surgical procedures.\n(g) \"Medical professional liability insurance\" means insurance against loss, damage, or expense incident to a claim arising out of the death or injury of any person as the result of negligence or malpractice in rendering licensed health care provider professional services as defined by section 62I.03, subdivision 8.\nThe administrative services unit shall establish a volunteer health care provider program to facilitate the provision of health care services provided by volunteer health care providers through eligible health care facilities and organizations.\nTo participate in the program established in subdivision 2, a health care facility or organization must register with the administrative services unit on forms provided by the administrative services unit and must meet the following requirements:\n(1) be licensed to the extent required by law or regulation;\n(2) provide evidence that the primary purpose of the facility or organization is either: (i) the provision of health care services to the uninsured and underinsured; or (ii) the provision of free health care monitoring or screening services to the public to detect an undiagnosed disease or health condition; and (iii) the provision of information about recommended follow-up services;\n(3) certify that it maintains adequate general liability and professional liability insurance for program staff other than the volunteer health care provider or is properly and adequately self-insured;\n(4) agree to report annually to the administrative services unit the number of volunteers, number of volunteer hours provided, number of patients seen by volunteer providers, and types of services provided; and\n(5) agree to pay to the administrative services unit an annual participation fee of $50. All fees collected are deposited into the state government special revenue fund and are appropriated to the administrative services unit for purposes of administering the program.\n(a) To participate in the program established in subdivision 2, a health care provider shall register with the administrative services unit. Registration may be approved if the provider has submitted a certified statement on forms provided by the administrative services unit attesting that the health care provider agrees to:\n(1) receive no direct monetary compensation of any kind for services provided in the program;\n(2) submit a sworn statement attesting that the license to practice is free of restrictions. The statement must describe:\n(i) any disciplinary action taken against the health care provider by a professional licensing authority or health care facility, including any voluntary surrender of license or other agreement involving the health care provider's license to practice or any restrictions on practice, suspension of privileges, or other sanctions; and\n(ii) any malpractice suits filed against the health care provider and the outcome of any suits filed;\n(3) submit any additional materials requested by the administrative services unit;\n(4) identify the eligible program through which the health care services will be provided and the health care facilities at which the services will be provided; and\n(5) if coverage is purchased for the provider under subdivision 7, comply with any risk management and loss prevention policies imposed by the insurer.\n(b) Registration expires two years from the date the registration was approved. A health care provider may apply for renewal by filing with the administrative services unit a renewal application at least 60 days prior to the expiration of the registration.\nThe administrative services unit may suspend, revoke, or condition the eligibility of a health care provider for cause, including, but not limited to, the failure to comply with the agreement with the administrative services unit and the imposition of disciplinary action by the licensing board that regulates the health care provider.\nThe applicable health-related licensing board shall immediately notify the administrative services unit of the initiation of a contested case against a registered health care provider or the imposition of disciplinary action, including copies of any contested case decision or settlement agreement with the health care provider.\n(a) Within the limit of funds appropriated for this program, the administrative services unit must purchase medical professional liability insurance, if available, for a health care provider who is registered in accordance with subdivision 4 and who is not otherwise covered by a medical professional liability insurance policy or self-insured plan either personally or through another facility or employer. The administrative services unit is authorized to prorate payments or otherwise limit the number of participants in the program if the costs of the insurance for eligible providers exceed the funds appropriated for the program.\n(b) Coverage purchased under this subdivision must be limited to the provision of health care services performed by the provider for which the provider does not receive direct monetary compensation.\nThe administrative services unit shall apportion between the Board of Medical Practice, the Board of Dentistry, and the Board of Nursing an amount to be raised through fees by the respective board. The amount apportioned to each board shall be the total amount expended on medical professional liability insurance coverage purchased for the providers regulated by the respective board. The respective board may adjust the fees which the board is required to collect to compensate for the amount apportioned to the board by the administrative services unit.",
	"repealed": false
}