{
	"id": "144.608",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.608",
	"title": "144.608 TRAUMA ADVISORY COUNCIL.",
	"text": "(a) A Trauma Advisory Council is established to advise, consult with, and make recommendations to the commissioner on the development, maintenance, and improvement of a statewide trauma system.\n(b) The council shall consist of the following members:\n(1) a trauma surgeon certified by the American Board of Surgery or the American Osteopathic Board of Surgery who practices in a level I or II trauma hospital;\n(2) a general surgeon certified by the American Board of Surgery or the American Osteopathic Board of Surgery whose practice includes trauma and who practices in a designated rural area as defined under section 144.1501, subdivision 1;\n(3) a neurosurgeon certified by the American Board of Neurological Surgery who practices in a level I or II trauma hospital;\n(4) a trauma program nurse manager or coordinator practicing in a level I or II trauma hospital;\n(5) an emergency physician certified by the American Board of Emergency Medicine or the American Osteopathic Board of Emergency Medicine whose practice includes emergency room care in a level I, II, III, or IV trauma hospital;\n(6) a trauma program manager or coordinator who practices in a level III or IV trauma hospital;\n(7) a physician certified by the American Board of Family Medicine or the American Osteopathic Board of Family Practice whose practice includes emergency department care in a level III or IV trauma hospital located in a designated rural area as defined under section 144.1501, subdivision 1;\n(8) a nurse practitioner, as defined under section 144.1501, subdivision 1, or a physician assistant, as defined under section 144.1501, subdivision 1, whose practice includes emergency room care in a level IV trauma hospital located in a designated rural area as defined under section 144.1501, subdivision 1;\n(9) a physician certified in pediatric emergency medicine by the American Board of Pediatrics or certified in pediatric emergency medicine by the American Board of Emergency Medicine or certified by the American Osteopathic Board of Pediatrics whose practice primarily includes emergency department medical care in a level I, II, III, or IV trauma hospital, or a surgeon certified in pediatric surgery by the American Board of Surgery whose practice involves the care of pediatric trauma patients in a trauma hospital;\n(10) an orthopedic surgeon certified by the American Board of Orthopaedic Surgery or the American Osteopathic Board of Orthopedic Surgery whose practice includes trauma and who practices in a level I, II, or III trauma hospital;\n(11) the state emergency medical services medical director appointed by the director of the Office of Emergency Medical Services;\n(12) a hospital administrator of a level III or IV trauma hospital located in a designated rural area as defined under section 144.1501, subdivision 1;\n(13) a rehabilitation specialist whose practice includes rehabilitation of patients with major trauma injuries or traumatic brain injuries and spinal cord injuries as defined under section 144.661;\n(14) an attendant or ambulance director who is an EMT, AEMT, or paramedic within the meaning of section 144E.001 and who actively practices with a licensed ambulance service in a primary service area located in a designated rural area as defined under section 144.1501, subdivision 1; and\n(15) the commissioner of public safety or the commissioner's designee.\n(a) The council must meet at least twice a year but may meet more frequently at the call of the chair, a majority of the council members, or the commissioner.\n(b) The terms, compensation, and removal of members of the council are governed by section 15.059. The council expires June 30, 2025.\n(c) The council may appoint subcommittees and work groups. Subcommittees shall consist of council members. Work groups may include noncouncil members. Noncouncil members shall be compensated for work group activities under section 15.059, subdivision 3, but shall receive expenses only.\n(a) Up to eight regional trauma advisory councils may be formed as needed.\n(b) Regional trauma advisory councils shall advise, consult with, and make recommendation to the state Trauma Advisory Council on suggested regional modifications to the statewide trauma criteria that will improve patient care and accommodate specific regional needs. The commissioner, in consultation with the director of the Office of Emergency Medical Services and the emergency medical services and trauma hospitals in each region, shall provide quarterly data updates on major trauma scene ground ambulance transports to each regional trauma advisory council.\n(c) Each regional advisory council must have no more than 15 members. The commissioner, in consultation with the director of the Office of Emergency Medical Services, shall name the council members.\n(d) Regional council members may receive expenses in the same manner and amount as authorized by the plan adopted under section 43A.18, subdivision 2.",
	"repealed": false
}