{
	"id": "62A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.15",
	"title": "62A.15 COVERAGE OF CERTAIN LICENSED HEALTH PROFESSIONAL SERVICES.",
	"text": "The provisions of this section apply to all group policies or subscriber contracts providing payment for care in this state, which are issued by accident and health insurance companies regulated under this chapter and nonprofit health service plan corporations regulated under chapter 62C.\nAll benefits provided by any policy or contract referred to in subdivision 1, relating to expenses incurred for medical treatment or services of a physician must also include chiropractic treatment and services of a chiropractor to the extent that the chiropractic services and treatment are within the scope of chiropractic licensure.\nThis subdivision is intended to provide equal access to benefits for insureds and subscribers who choose to obtain treatment for illness or injury from a doctor of chiropractic, as long as the treatment falls within the chiropractor's scope of practice. This subdivision is not intended to change or add to the benefits provided for in these policies or contracts.\nAll benefits provided by any policy or contract referred to in subdivision 1, relating to expenses incurred for medical treatment or services of a physician must also include optometric treatment and services of an optometrist to the extent that the optometric services and treatment are within the scope of optometric licensure.\nThis subdivision is intended to provide equal payment of benefits for optometric treatment and services and is not intended to change or add to the benefits provided for in those policies or contracts.\nAll benefits provided by a policy or contract referred to in subdivision 1, relating to expenses incurred for medical treatment or services of a duly licensed physician must include services provided by a registered nurse who is licensed pursuant to section 148.171 and who is certified as an advanced practice registered nurse. \"Advanced practice registered nurse\" has the meaning given in section 148.171, subdivision 3. The advanced practice registered nurse must meet the requirements of sections 148.171 to 148.285.\nThis subdivision is intended to provide payment of benefits for treatment and services by an advanced practice registered nurse as defined in this subdivision and is not intended to add to the benefits provided for in these policies or contracts.\n(a) This subdivision, subdivision 4, and section 62D.107 may be cited as the \"Equal Access to Acupuncture Act\" and as a memorial to Edith R. Davis, Minnesota's pioneer acupuncturist.\n(b) All benefits provided by a policy or contract referred to in subdivision 1 relating to expenses for acupuncture services that are provided by a physician must also include acupuncture treatment and services of a licensed acupuncture practitioner to the extent that the acupuncture services and treatment are within the scope of acupuncture practitioner licensure.\nThis subdivision is intended to provide equal access to benefits for insureds and subscribers who choose to directly obtain treatment for illness or injury from a licensed acupuncture practitioner, as long as the treatment falls within the scope of practice of the licensed acupuncture practitioner.\nThis subdivision is not intended to change or add to the benefits provided for in these policies or contracts.\nAll benefits provided by a policy or contract referred to in subdivision 1, relating to expenses incurred for medical treatment or services of a licensed physician, must include services provided by a physician assistant licensed under chapter 147A. This subdivision is intended to provide payment of benefits for treatment and services by a physician assistant and is not intended to add to the benefits provided for in these policies or contracts.\nAll benefits provided by a policy or contract referred to in subdivision 1 relating to expenses incurred for medical treatment or services provided by a licensed physician must include services provided by a licensed pharmacist, according to the requirements of section 151.01, to the extent a licensed pharmacist's services are within the pharmacist's scope of practice.\n(a) No carrier referred to in subdivision 1 may, in the payment of claims to employees in this state, deny benefits payable for services covered by the policy or contract if the services are lawfully performed by a licensed chiropractor, a licensed optometrist, a registered nurse meeting the requirements of subdivision 3a, a licensed physician assistant, a licensed acupuncture practitioner, or a licensed pharmacist.\n(b) When carriers referred to in subdivision 1 make claim determinations concerning the appropriateness, quality, or utilization of chiropractic health care for Minnesotans, any of these determinations that are made by health care professionals must be made by, or under the direction of, or subject to the review of licensed doctors of chiropractic.\n(c) When a carrier referred to in subdivision 1 makes a denial of payment claim determination concerning the appropriateness, quality, or utilization of acupuncture services for individuals in this state performed by a licensed acupuncture practitioner, a denial of payment claim determination that is made by a health professional must be made by, under the direction of, or subject to the review of a licensed acupuncture practitioner.",
	"repealed": false
}