{
	"id": "145.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.64",
	"title": "145.64 CONFIDENTIALITY OF RECORDS OF REVIEW ORGANIZATION.",
	"text": "(a) Except as provided in subdivision 4, data and information acquired by a review organization, in the exercise of its duties and functions, or by an individual or other entity acting at the direction of a review organization, shall be held in confidence, shall not be disclosed to anyone except to the extent necessary to carry out one or more of the purposes of the review organization, and shall not be subject to subpoena or discovery. No person described in section 145.63 shall disclose what transpired at a meeting of a review organization except to the extent necessary to carry out one or more of the purposes of a review organization. The proceedings and records of a review organization shall not be subject to discovery or introduction into evidence in any civil action against a professional arising out of the matter or matters which are the subject of consideration by the review organization. Information, documents or records otherwise available from original sources shall not be immune from discovery or use in any civil action merely because they were presented during proceedings of a review organization, nor shall any person who testified before a review organization or who is a member of it be prevented from testifying as to matters within the person's knowledge, but a witness cannot be asked about the witness' testimony before a review organization or opinions formed by the witness as a result of its hearings. For purposes of this subdivision, records of a review organization include Internet-based data derived from data shared for the purposes of the standardized incident reporting system described in section 145.61, subdivision 5, clause (q), and reports submitted electronically in compliance with sections 144.706 to 144.7069.\n(b) Notwithstanding paragraph (a), a review organization may release non-patient-identified aggregate trend data on medical error and iatrogenic injury and a facility may file the reports, analyses, and plans required by sections 144.706 to 144.7069 without violating this section or being subjected to a penalty under section 145.66 and without compromising the protections provided under sections 145.61 to 145.67 to the reporter of such information; to the review organization, its sponsoring organizations, and members; and to the underlying data and reports.\n(c) The confidentiality protection and protection from discovery or introduction into evidence provided in this subdivision shall also apply to the governing body of the review organization and shall not be waived as a result of referral of a matter from the review organization to the governing body or consideration by the governing body of decisions, recommendations, or documentation of the review organization.\n(d) The governing body of a hospital, health maintenance organization, or community integrated service network, that is owned or operated by a governmental entity, may close a meeting to discuss decisions, recommendations, deliberations, or documentation of the review organization. A meeting may not be closed except by a majority vote of the governing body in a public meeting. The closed meeting must be tape recorded and the tape must be retained by the governing body for five years.\nThe restrictions in subdivision 1 shall not apply to professionals requesting or seeking through discovery, data, information, or records relating to their medical staff privileges, membership, or participation status. However, any data so disclosed in such proceedings shall not be admissible in any other judicial proceeding than those brought by the professional to challenge an action relating to the professional's medical staff privileges or participation status.\nData collected, created, or maintained by the quality committee of the Hennepin County Emergency Medical Services Advisory Council when conducting a health care review activity of the emergency medical services function or services are private data on individuals or nonpublic data not on individuals, as defined in section 13.02.\nA review organization that is participating in a standardized incident reporting system described in section 145.61, subdivision 5, clause (q), may release data for purposes of the reporting system, provided that the data do not identify an individual and are not released in a manner in which an individual can be identified.\nNothing in this section shall be construed to prohibit or restrict the right of the commissioner of health to access the original information, documents, or records acquired by a review organization as permitted by law.",
	"repealed": false
}