{
	"id": "142E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.02",
	"title": "142E.02 DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall develop standards for county and human services boards to provide child care services to enable eligible families to participate in employment, training, or education programs. Within the limits of available appropriations, the commissioner shall distribute money to counties to reduce the costs of child care for eligible families. The commissioner shall adopt rules to govern the program in accordance with this section. The rules must establish a sliding schedule of fees for parents receiving child care services. The rules shall provide that funds received as a lump-sum payment of child support arrearages shall not be counted as income to a family in the month received but shall be prorated over the 12 months following receipt and added to the family income during those months. The commissioner shall maximize the use of federal money under title I and title IV of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, and other programs that provide federal or state reimbursement for child care services for low-income families who are in education, training, job search, or other activities allowed under those programs. Money appropriated under this section must be coordinated with the programs that provide federal reimbursement for child care services to accomplish this purpose. Federal reimbursement obtained must be allocated to the county that spent money for child care that is federally reimbursable under programs that provide federal reimbursement for child care services. The counties shall use the federal money to expand child care services. The commissioner may adopt rules under chapter 14 to implement and coordinate federal program requirements.\nThe commissioner may enter into contractual agreements with a federally recognized Indian tribe with a reservation in Minnesota to carry out the responsibilities of county human service agencies to the extent necessary for the tribe to operate child care assistance programs under sections 142E.04 and 142E.08. An agreement may allow the state to make payments for child care assistance services provided under section 142E.08. The commissioner shall consult with the affected county or counties in the contractual agreement negotiations, if the county or counties wish to be included, in order to avoid the duplication of county and tribal child care services. Funding to support services under section 142E.04 may be transferred to the federally recognized Indian tribe with a reservation in Minnesota from allocations available to counties in which reservation boundaries lie. When funding is transferred under section 142E.04, the amount shall be commensurate to estimates of the proportion of reservation residents with characteristics identified in section 142E.04, subdivision 6, to the total population of county residents with those same characteristics.\nThe commissioner shall supervise child care programs administered by the counties through standard-setting, technical assistance to the counties, approval of county child care fund plans, and distribution of public money for services. The commissioner shall provide training and other support services to assist counties in planning for and implementing child care assistance programs. The commissioner shall adopt rules under chapter 14 that establish minimum administrative standards for the provision of child care services by county boards of commissioners.\nThe commissioner must develop and make available to all counties a universal application form for child care assistance under this chapter. The commissioner may develop and make available to all counties a child care addendum form to be used to supplement the combined application form for MFIP or Supplemental Nutrition Assistance Program (SNAP) benefits or to supplement other statewide application forms for public assistance programs for families applying for one of these programs in addition to child care assistance. The application must provide notice of eligibility requirements for assistance and penalties for wrongfully obtaining assistance.\n[See Note.]\nFor child care assistance programs under this chapter, the commissioner shall enforce the requirements for program integrity and fraud prevention investigations under sections 256.046, 256.98, and 256.983.\n(a) Data collected, maintained, used, or disseminated by the welfare system pertaining to persons selected as legal nonlicensed child care providers by families receiving child care assistance shall be treated as licensing data as provided in section 13.46, subdivision 4.\n(b) For purposes of this paragraph, \"child care assistance program payment data\" means data for a specified time period showing (1) that a child care assistance program payment under this chapter was made, and (2) the amount of child care assistance payments made to a child care center. Child care assistance program payment data may include the number of families and children on whose behalf payments were made for the specified time period. Any child care assistance program payment data that may identify a specific child care assistance recipient or benefit paid on behalf of a specific child care assistance recipient, as determined by the commissioner, is private data on individuals as defined in section 13.02, subdivision 12. Data related to a child care assistance payment is public if the data relates to a child care assistance payment made to a licensed child care center or a child care center exempt from licensure and:\n(1) the child care center receives payment of more than $100,000 from the child care assistance program under this chapter in a period of one year or less; or\n(2) when the commissioner or county agency either:\n(i) disqualified the center from receipt of a payment from the child care assistance program under this chapter for wrongfully obtaining child care assistance under section 256.98, subdivision 8, paragraph (c);\n(ii) refused a child care authorization, revoked a child care authorization, stopped payment, or denied payment for a bill for the center under section 142E.17, subdivision 9, paragraph (d); or\n(iii) made a finding of financial misconduct under section 142E.51.\nThe commissioner shall conduct the next survey of prices charged by child care providers in Minnesota in state fiscal year 2021 and every three years thereafter to determine the 75th percentile for like-care arrangements in county price clusters.\nThe commissioner shall:\n(1) administer the child care fund, including the basic sliding fee program authorized under sections 142E.01 to 142E.18;\n(2) monitor the child care resource and referral programs established under section 142E.31; and\n(3) encourage child care providers to participate in a nationally recognized accreditation system for early childhood and school-age care programs. Subject to approval by the commissioner, family child care providers and early childhood and school-age care programs shall be reimbursed for one-half of the direct cost of accreditation fees, upon successful completion of accreditation.\nThe commissioner shall use up to 1/21 of the state and federal funds available for the basic sliding fee program and 1/21 of the state and federal funds available for the MFIP child care program for payments to counties for administrative expenses. The commissioner shall make monthly payments to each county based on direct service expenditures. Payments may be withheld if monthly reports are incomplete or untimely.",
	"repealed": false
}