{
	"id": "190.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.16",
	"title": "190.16 ADDITIONAL POWERS OF ADJUTANT GENERAL.",
	"text": "The adjutant general may cooperate with the government of the United States or any agency or department thereof in the construction, improvement, or maintenance of buildings, air bases, roads, utilities and any or all other structures or facilities required in the training, housing, and maintenance of the military forces of the state and to comply with the provisions of the laws of the United States and any rules and regulations made thereunder for the expenditure of federal moneys for the military forces of the state.\nThe adjutant general may accept money, either public or private, for and in behalf of the state of Minnesota, for the support of the state's military forces, and for the construction, improvement, or maintenance of buildings, air bases, roads, utilities and any or all other structures or facilities required in the training, housing, and maintenance of the military forces of the state upon such terms and conditions as are or may be prescribed by the laws of the United States and any rules or regulations made thereunder.\nNotwithstanding any state law to the contrary, the adjutant general shall be the contracting authority and officer for any construction, improvement or maintenance program or project, or any other program or project financed either in whole or in part by moneys made available by the federal government and may execute agreements and contracts for and in behalf of the state therefor, including a dedication of the primary use and purpose of such buildings, air bases, roads, utilities or other structures or facilities required in the training, housing, and maintenance of the military forces of the state for periods up to and including 25 years.\nAll moneys accepted for disbursement by the adjutant general pursuant to the terms of this section shall, if not required by federal law or rules or regulations made thereunder to be disbursed by a United States property and fiscal officer, be deposited in the state treasury and, unless otherwise prescribed by the authority from which the money is received, kept in separate funds, designated according to the purposes for which the moneys were made available and held by the state in trust for such purposes. All such moneys are hereby appropriated for the purposes for which the same were made available to be expended in accordance with the laws of the United States and rules and regulations made thereunder. The adjutant general, when acting for the state of Minnesota, or when requested by the United States government or any agency or department thereof, shall disburse such moneys for the designated purposes but this shall not preclude any other authorized method of disbursement.\nNothing in this section shall be construed as creating any personal liability upon the adjutant general when acting pursuant to this section.\nNotwithstanding the provisions of any law to the contrary, the adjutant general, with the approval of the governor, may lease any lands now owned or hereafter acquired by the state for the training, housing, and maintenance of its military forces or any part thereof to the United States of America for military and national defense purposes upon such terms as they deem proper providing, however, that no such lease shall in any way interfere with the training, housing and maintenance of the military forces of this state.\nThe adjutant general or the adjutant general's designee may rent buildings or other facilities of the Minnesota National Guard to persons under terms and conditions specified by the adjutant general or designee. Subject to any prohibitions or restrictions in any agreement between the United States and the state of Minnesota, proceeds of rentals under this subdivision must be applied as follows:\n(1) payment of increased utilities, maintenance, or other costs directly attributable to the rental;\n(2) other operating and maintenance or repair costs for the building or facility being rented; and\n(3) maintenance and improvement of buildings or other facilities at Camp Ripley.\nRentals under this subdivision must be made under terms and conditions that do not conflict with the use of the facilities for military purposes.\nThe adjutant general may delegate to subordinate employees the exercise of contract execution and administration authority which the adjutant general holds under a delegation by the commissioner of administration pursuant to section 16B.05, subdivision 1. A delegation by the adjutant general must be made by written order, filed with the secretary of state.",
	"repealed": false
}