{
	"id": "297F.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.01",
	"title": "297F.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms for the purposes of this chapter, have the following meanings.\n\"Business\" means any trade, occupation, activity, or enterprise engaged in selling or distributing cigarettes or tobacco products in this state.\n\"Cigarette\" means any roll for smoking made wholly or in part of tobacco that weighs 4.5 pounds or less per thousand:\n(1) the wrapper or cover of which is made of paper or another substance or material except tobacco; or\n(2) wrapped in any substance containing tobacco, however labeled or named, which, because of its appearance, size, the type of tobacco used in the filler, or its packaging, pricing, marketing, or labeling, is likely to be offered to or purchased by consumers as a cigarette, as defined in clause (1), unless it is wrapped in whole tobacco leaf and does not have a cellulose acetate or other cigarette-like filter.\n\"Cigarette distributor\" means any of the following:\n(1) a person engaged in the business of selling cigarettes in this state and who manufactures or who brings, or causes to be brought, into this state from outside the state any packages of cigarettes for sale to subjobbers or retailers;\n(2) a person engaged in the business outside this state who ships or transports cigarettes to retailers in this state, to be sold by those retailers;\n(3) a person who is on direct purchase from a cigarette manufacturer and applies cigarette stamps on at least 50 percent of cigarettes sold by that person.\n\"Cigarette subjobber\" means any person who acquires stamped cigarettes or other state's stamped cigarettes for the primary purpose of resale to retailers, and any licensed distributor who delivers, sells, or distributes stamped cigarettes from a place of business other than that licensed in the distributor's license.\n\"Cigarette subjobber\" also means a person who is a vending machine operator. A vending machine operator is a person whose principal business is operating, or owning and leasing to operators, machines for the vending of merchandise or service.\n\"Commissioner\" means the state commissioner of revenue.\n\"Consumer\" means an individual who has title to or possession of cigarettes or tobacco products for personal consumption rather than for sale.\n\"Delivery sale\" has the meaning given in section 325F.781, subdivision 1.\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.\n\"Licensing period\" means a two-year period during which licenses are issued. A licensing period begins on January 1 of each even-numbered year and ends on December 31 of the following odd-numbered year.\n\"Invoice\" means a detailed list of cigarettes and tobacco products purchased or sold in this state that contains the following information:\n(1) name of seller;\n(2) name of purchaser;\n(3) date of sale;\n(4) invoice number;\n(5) itemized list of goods sold including brands of cigarettes and number of cartons of each brand, unit price, and identification of tobacco products by name, quantity, and unit price; and\n(6) any rebates, discounts, or other reductions.\n\"Manufacturer\" means a person who produces and sells cigarettes or tobacco products.\n\"Out-of-state retailer\" means a person engaged outside of this state in the business of selling, or offering to sell, cigarettes or tobacco products to consumers located in this state.\n\"Moist snuff\" means any finely cut, ground, or powdered smokeless tobacco, or similar product containing nicotine, that is intended to be placed or dipped in the mouth.\n\"Package\" means the individual packet, box, or other container used to contain and convey cigarettes to the consumer.\n\"Person\" means an individual or any entity engaged in the sale of cigarettes or tobacco products.\n\"Place of business\" means a place where cigarettes or tobacco products are sold or where cigarettes or tobacco products are manufactured, stored, or kept for the purpose of sale or consumption, including any vessel, vehicle, airplane, train, or vending machine.\n\"Premium cigar\" means any cigar that is hand-constructed, has a wrapper that is made entirely from whole tobacco leaf, has a filler and binder that is made entirely of tobacco, except for adhesives or other materials used to maintain size, texture, or flavor, and has a wholesale price of no less than $2.\n\"Retailer\" means a person required to be licensed under chapter 461 engaged in this state in the business of selling, or offering to sell, cigarettes or tobacco products to consumers.\n\"Retail outlet\" means each place of business from which cigarettes or tobacco products are sold to consumers.\n\"Sale\" means a transfer, exchange, or barter, in any manner or by any means, for consideration, and includes all sales made by any person. It also includes gifts or samples provided for advertising or promotional purposes, made by a person engaged in the selling of cigarettes or tobacco products.\n\"Stamp\" means the adhesive stamp supplied by the commissioner of revenue for use on cigarette packages or any other indicia adopted by the commissioner to indicate that the tax has been paid.\n\"Storage\" means any keeping or retention of cigarettes or tobacco products for use or consumption in this state.\n(a) \"Tobacco products\" means any product containing, made, or derived from tobacco that is intended for human consumption, whether chewed, smoked, absorbed, dissolved, inhaled, snorted, sniffed, or ingested by any other means, or any component, part, or accessory of a tobacco product, including, but not limited to, cigars; cheroots; stogies; periques; granulated, plug cut, crimp cut, ready rubbed, and other smoking tobacco; snuff; snuff flour; cavendish; plug and twist tobacco; fine-cut and other chewing tobacco; shorts; refuse scraps, clippings, cuttings and sweepings of tobacco, and other kinds and forms of tobacco; but does not include cigarettes as defined in this section. Tobacco products includes nicotine solution products and moist snuff. Tobacco products excludes any tobacco product that has been approved by the United States Food and Drug Administration for sale as a tobacco cessation product, as a tobacco dependence product, or for other medical purposes, and is being marketed and sold solely for such an approved purpose.\n(b) Except for the imposition of tax under section 297F.05, subdivisions 3 and 4, tobacco products includes a premium cigar, as defined in subdivision 13a.\n\"Tobacco products distributor\" means any of the following:\n(1) a person engaged in the business of selling tobacco products in this state who brings, or causes to be brought, into this state from outside the state any tobacco products for sale;\n(2) a person who makes, manufactures, or fabricates tobacco products in this state for sale in this state;\n(3) a person engaged in the business of selling tobacco products outside this state who ships or transports tobacco products to retailers in this state, to be sold by those retailers.\n\"Tobacco products subjobber\" means a person, other than a manufacturer or distributor, who buys from a distributor tobacco products upon which the tax imposed by this chapter has been paid and sells them to persons other than the ultimate consumers, and any licensed distributor who delivers, sells, or distributes tobacco products upon which the tax imposed by this chapter has been paid from a place of business other than that licensed in the distributor's license.\n\"Unlicensed seller\" means anyone who is not licensed under section 297F.03 to sell the particular product to the purchaser or possessor of the product.\n\"Use\" means the exercise of a right or power incidental to the ownership of cigarettes or tobacco products.\n\"Weighted average retail price\" means (1) the average retail price per pack of 20 cigarettes, with the average price weighted by the number of packs sold at each price, (2) reduced by the sales tax included in the retail price, and (3) adjusted for the expected inflation as provided in section 297F.25, subdivision 1.\n(a) Beginning January 1, 2020, \"nicotine solution products\" means any cartridge, bottle, or other package that contains nicotine, including nicotine made or derived from tobacco or sources other than tobacco, that is in a solution that is consumed, or meant to be consumed, through the use of a heating element, power source, electronic circuit, or other electronic, chemical, or mechanical means that produces vapor or aerosol.\n(b) Nicotine solution products includes any electronic cigarette, electronic cigar, electronic cigarillo, electronic pipe, electronic nicotine delivery system, electronic vaping device, electronic vape pen, electronic oral device, electronic delivery device, or similar product or device, and any batteries, heating elements, or other components, parts, or accessories sold with and meant to be used in the consumption of a solution containing nicotine.\n(a) \"Wholesale sales price\" means the price at which a distributor purchases a tobacco product.\n(b) When a distributor sells a cartridge, bottle, or other package of a solution containing nicotine that is part of a kit that also includes a product, device, component, part, or accessory described in subdivision 22b:\n(1) the wholesale sales price is the price at which the distributor purchases the kit; except that\n(2) if the distributor also separately sells the same package of solution containing nicotine that is sold with the kit and can isolate the cost of the package of solution containing nicotine, then the wholesale sales price includes only the price at which the distributor separately purchases the package of the solution containing nicotine and any taxes, charges, and costs listed in paragraph (c).\n(c) Wholesale sales price includes the applicable federal excise tax, freight charges, or packaging costs, regardless of whether they were included in the purchase price.",
	"repealed": false
}