{
	"id": "116O.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/116O.15",
	"title": "116O.15 ANNUAL REPORT.",
	"text": "The board shall submit a report to the chairs of the senate Economic Development and Housing and the house of representatives Economic Development Committees of the legislature and the governor on the activities of the corporation by February 1 of each year. A copy of the report shall also be provided to the president of the University of Minnesota. The report must include at least the following:\n(1) a description of each of the programs that the corporation has provided or undertaken at some time during the previous year. The description of each program must describe (i) the statement of purpose for the program, (ii) the administration of the program including the activities the corporation was responsible for and the responsibilities that other organizations had in administering the program, (iii) the results of the program including how the results were measured, (iv) the expenses of the program paid by the corporation, and (v) the source of corporate and noncorporate funding for the program;\n(2) an identification of the sources of funding in the previous year for the corporation and its programs including federal, state and local government, foundations, gifts, donations, fees, and all other sources;\n(3) a description of the distribution of all money spent by the corporation in the previous year including an identification of the total expenditures, other than corporate administrative expenditures, by sector of the economy;\n(4) a description of the administrative expenses of the corporation during the previous year;\n(5) a listing of the assets and liabilities of the corporation at the end of the previous fiscal year;\n(6) a list and description of each grant awarded by the corporation during the previous year;\n(7) a description of any changes made to the operational plan during the previous year; and\n(8) a description of any newly adopted or significant changes to bylaws, programmatic or administrative guidelines, policies, rules, or eligibility criteria for programs created or administered by the corporation during the previous year.\nReports must be made to the legislature as required by section 3.195.",
	"repealed": false
}