{
	"id": "116J.982",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.982",
	"title": "116J.982 COMMUNITY DEVELOPMENT CORPORATIONS.",
	"text": "For the purposes of this section, the terms in this subdivision have the meanings given them:\n(a) \"Commissioner\" means the commissioner of employment and economic development.\n(b) \"Economic development region\" means an area so designated in the governor's executive order number 83-15, dated March 15, 1983.\n(c) \"Federal poverty level\" means the income level published annually by the United States Department of Health and Human Services under authority of the Omnibus Budget Reconciliation Act of 1981, Public Law 97-35, title VI, section 673(2).\n(d) \"Low income\" means an annual income below the federal poverty level.\n(e) A \"low-income area\" means an area in which (1) ten percent of the population have low incomes, or (2) there is one or more recognized subareas such as a census tract, city, township, or county in which 15 percent of the population have low incomes.\nThe commissioner shall administer this section except for subdivision 6, which shall be administered by the commissioner of housing finance. The commissioners of employment and economic development and housing finance may, separately or jointly, adopt rules necessary to implement this section.\n(a) The commissioner shall certify a community development corporation under this section if the corporation is a nonprofit corporation incorporated under chapter 317A and meets the other criteria in this subdivision.\n(b) The corporation, in its articles of incorporation or bylaws, must designate a low-income area as the specific geographic community within which it will operate. Within cities of the first class, a designated community must be an identifiable neighborhood or a combination of neighborhoods but may not be the entire city. Outside cities of the first class, a designated community may be an identifiable neighborhood or neighborhoods, or home rule charter or statutory cities, townships, unincorporated areas, or combinations of those entities, but may not be an entire economic development region nor cross existing economic development region boundaries except as provided in this section.\n(c) The corporation's major purpose, in its articles of incorporation or bylaws, must be economic development, redevelopment, or housing in its designated community.\n(d) The corporation must be tax exempt under section 501, paragraph (c), clause (3), of the Internal Revenue Code of 1986, as amended.\n(e) The membership and board of directors of the corporation must be representative of the designated community. At least 20 percent of the directors shall have low incomes or shall reside in low-income areas described in subdivision 1, paragraph (e), clause (1), or the low-income subarea described in subdivision 1, paragraph (e), clause (2). At least 60 percent of the directors must be residents of, or be employed in, the designated community. Other directors shall be business, financial, or civic leaders or representatives-at-large of the designated community. At least 40 percent of the directors must reside in the designated community. Notwithstanding the requirements of this paragraph, a corporation which meets board structure requirements for a Community Housing Development Corporation under Code of Federal Regulations, title 24, part 92.2, is deemed to meet the board membership requirements of this subdivision.\n(f) The corporation shall not discriminate against any persons on the basis of a status protected under chapter 363A.\n(g) The corporation shall demonstrate that it has or can obtain the technical skills to analyze projects, that it is familiar with available public and private funding sources and economic development, redevelopment, and housing programs, and that it is capable of packaging economic development, redevelopment, and housing projects.\n(h) The corporation must have completed two or more economic development, redevelopment, or housing projects within its designated community during the last three years.\n(a) The commissioner shall certify as a community development corporation any organization which meets the criteria in subdivision 3. The certification is for two years from the date of certification and is renewable. The commissioner shall certify as a community development corporation for a nonrenewable period of three years from the date of certification an organization which meets all the criteria in subdivision 3, except for paragraphs (d) and (h), but which plans to meet those requirements by the end of the three years.\n(b) As part of the certification process, the commissioner shall resolve disputes concerning boundaries of the designated community of a community development corporation.\nThe commissioner may make a grant to a community development corporation and enter into contracts with certified community development corporations for:\n(1) specific economic development projects within the designated community, such as development of a proposal for a venture grant, or for establishment of a business venture, including assistance to an existing business venture, purchase of partial or full ownership of a business venture, real estate development, strategic development planning, infrastructure development, or development of resources or facilities necessary for the establishment of a business venture;\n(2) dissemination of information about, or taking applications for, programs operated by the commissioner; and\n(3) developing the internal organizational capacity to engage in economic development activities such as the partnership activities listed in clause (1).\nThe commissioner of the housing finance agency may enter into contracts with certified community development corporations for purposes of housing activities associated with economic development activity under subdivision 5.\n[Repealed, 1993 c 163 art 1 s 35]\nA certified community development corporation is eligible to participate in a program available to nonprofit organizations which is operated by the commissioners of employment and economic development or housing finance if the certified development corporation meets the requirements of the program.\nA certified community development corporation is exempt from the licensure requirements of section 82.87.\n[Repealed, 1993 c 163 art 1 s 35]\n[Repealed, 1993 c 163 art 1 s 35]",
	"repealed": false
}