{
	"id": "47.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.54",
	"title": "47.54 NOTICES AND APPROVAL PROCEDURES.",
	"text": "Any bank desiring to establish a detached facility shall execute and acknowledge a written application in the form prescribed by the commissioner and shall file the application in the commissioner's office with a fee of $500. The applicant shall within 30 days of the receipt of the form prescribed by the commissioner publish a notice of the filing of the application in a qualified newspaper published in the municipality in which the proposed detached facility is to be located, and if there is no such newspaper, then in a qualified newspaper likely to give notice in the municipality in which the proposed detached facility is to be located.\n(a) If no objection is received by the commissioner within 15 days after the publication of the notice, the commissioner must provide written consent approving the application without a hearing if the commissioner finds that: (1) the applicant bank meets current industry standards of capital adequacy, management quality, and asset condition; (2) the establishment of the proposed detached facility improves the quality or increases the availability of banking services in the community to be served; and (3) the establishment of the proposed detached facility does not have an undue adverse effect upon the solvency of existing financial institutions in the community to be served.\n(b) The commissioner must deny an application that does not meet the criteria under paragraph (a), clauses (1) to (3).\n(c) Any proceedings for judicial review of written consent provided by the commissioner under this subdivision without a contested case hearing shall be conducted pursuant to the provisions of the Administrative Procedure Act relating to judicial review of agency decisions, sections 14.63 to 14.69, and the scope of judicial review in such proceedings shall be as provided therein. Nothing herein shall be construed as requiring the commissioner to conduct a contested case hearing if no written objection is timely received by the commissioner from a bank within three miles of the proposed location of the detached facility.\nIf any bank within three miles of the proposed location of the detached facility objects in writing within 15 days, the commissioner shall consider the objection. If the objection also requests a hearing, the objector must include the nature of the issues or facts to be presented and the reasons why written submissions would be insufficient to make an adequate presentation to the commissioner. Comments challenging the legality of an application should be submitted separately in writing.\nWritten requests for hearing must be evaluated by the commissioner who may grant or deny the request. A hearing must generally be granted only if it is determined that written submissions would be inadequate or that a hearing would otherwise be beneficial to the decision-making process. A hearing may be limited to issues considered material by the commissioner.\nIf a request for a hearing has been denied, the commissioner shall notify the applicant and all interested persons stating the reasons for denial. Interested parties may submit to the commissioner with simultaneous copies to the applicant additional written comments on the application within 14 days after the date of the notice of denial. The applicant shall be provided an additional seven days after the 14-day deadline has expired within which to respond to any comments submitted within the 14-day period. A copy of any response submitted by the applicant shall also be mailed simultaneously by the applicant to the interested parties. The commissioner may waive the additional seven-day comment period if so requested by the applicant.\nIn any case in which the commissioner grants a request for a hearing, or makes the independent determination that a hearing is warranted on the basis of the conditions in subdivision 3, the commissioner shall fix a time for a hearing conducted pursuant to chapter 14 to decide whether or not the application will be granted. A notice of the hearing must be published by the applicant in the form prescribed by the commissioner in a qualified newspaper published in the municipality in which the proposed detached facility is to be located, and if there is no such newspaper, then in a qualified newspaper likely to give notice in the municipality in which the proposed detached facility is to be located. The notice must be published once, at the expense of the applicants, not less than 30 days prior to the date of the hearing. At the hearing the commissioner shall consider the application and hear the applicants and witnesses that appear in favor of or against the granting of the application of the proposed detached facility. If an application is contested and a hearing is granted, 50 percent of an additional fee equal to the actual costs incurred by the Department of Commerce in approving or disapproving the application, payable to the commissioner of commerce to be deposited in the general fund, must be paid by the applicant and 50 percent equally by the intervening parties.\nIf upon the hearing, it appears to the commissioner that the requirements for approval contained in subdivision 2 have been met, the commissioner shall, not later than 90 days after the hearing, issue an order approving the application. If the commissioner shall decide that the application should not be granted, the commissioner shall issue an order to that effect and forthwith give notice by certified mail to the applicant.\nIf a facility is not activated within 18 months from the date approval is granted under subdivision 2, the approval automatically expires. Upon a request made by the applicant before the date the approval expires, the commissioner may grant reasonable extensions of time to the applicant to activate the facility as the commissioner deems necessary. The extensions of time shall not exceed a total of an additional 12 months. If the commissioner's approval is the subject of an appeal in accordance with chapter 14, the time period referred to in this section to activate the facility and any extensions begins when all appeals or rights of appeal from the commissioner's approval have concluded or expired.",
	"repealed": false
}