{
	"id": "182.662",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.662",
	"title": "182.662 PROCEDURES TO COUNTERACT SERIOUS AND IMMINENT DANGERS.",
	"text": "If an inspector finds any condition or practice in any place of employment which presents a substantial probability that the condition or practice could result in death or serious physical harm, the inspector shall issue an order, after consultation either by phone or in person with the commissioner and upon the commissioner's recommendation, which prohibits the employment or continuing operational process until such steps as may be necessary are taken to correct or remove the situation. This order shall not be effective for a period longer than three days.\nThe district courts shall have jurisdiction, upon petition of the commissioner, to restrain any conditions or practices in any place of employment which are such that a danger exists which could reasonably be expected to cause death or serious physical harm immediately or before the imminence of such danger can be eliminated through the enforcement procedures otherwise provided by this chapter. Any order issued under this section may require such steps to be taken as may be necessary to avoid, correct, or remove such imminent danger and prohibit the employment or presence of any individual in locations or under conditions where such imminent danger exists, except individuals whose presence is necessary to avoid, correct, or remove such imminent danger or to maintain the capacity of a continuous process operation to resume normal operations without a complete cessation of operations, or where a cessation of operations is necessary, to permit such to be accomplished in a safe and orderly manner.\nUpon the filing of any such petition the district court shall have jurisdiction to grant such injunctive relief or temporary restraining order pending the outcome of an enforcement proceeding pursuant to this chapter. The proceeding shall be as provided by the Rules of Civil Procedure of the district courts, except that no temporary restraining order issued without notice shall be effective for a period longer than five days.\nThe venue for actions brought under this section shall be any county in which the commissioner has an office, or in which the place of employment, where such a danger exists, is located.\nWhenever and as soon as an inspector concludes that conditions or practices described in subdivision 1 exist in any place of employment, the inspector shall inform the affected employees and employers of the danger and that the inspector is recommending to the commissioner that relief be sought.\nIf the commissioner arbitrarily or capriciously fails to seek relief under this section, any employee who may be injured by reason of such failure, or the representative of such employees, may bring an action against the commissioner in district court for a writ of mandamus to compel the commissioner to seek such an order and for such further relief as may be appropriate.",
	"repealed": false
}