{
	"id": "383C.027",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.027",
	"title": "383C.027 ADMINISTRATION OF BUDGET.",
	"text": "A record of every appropriation shall be kept by the county auditor, or by an officer, agent, or employee designated by rule, which will at all times show the amount of any appropriation which has been expended, contracted, or obligated, and the remaining unencumbered amount which is available for expenditure, to the extent necessary to enable every officer, agent, or employee who has authority to incur an obligation to know whether incurring an additional obligation will exceed the appropriation. The auditor shall make and may amend rules governing in detail the manner in which boards, commissions, administrative officers, and employees of the county incur, record, and report obligations as reasonably necessary to regulate the keeping of the records required by this section and to enable the auditor to determine and certify whether an obligation is within and pursuant to an appropriation made as required by sections 383C.021 to 383C.026. The rules, upon adoption by the county board, shall bind all boards, commissions, officers, agents, and employees. No contract or obligation shall be valid for any purpose unless it is incurred, recorded, reported, and certified in accordance with the rules. No claim or payroll shall be presented to the county board or other board, commission, or agency for allowance, or allowed unless it has been audited by the auditor and certified by the auditor to have been incurred within and pursuant to an appropriation as required by sections 383C.021 to 383C.026. The auditor shall not certify a claim or payroll without ascertaining that it has been so incurred. No claim or payroll shall be allowed or paid until certified by the auditor. Before certifying any claim or payroll, the auditor shall ascertain that the goods or services have actually been received by the county as shown by a receiving report or time record signed by an officer, agent, or employee who has personal knowledge that the goods or services were received or furnished to the county. A person who falsely or fraudulently signs a receiving report or time record is personally liable to the county for any loss sustained.\nNo payment shall be made or obligation incurred against an allotment or appropriation except in accordance with an appropriation duly made in the adopted budget. An authorization of payment or incurring of obligation in violation of this section is void and a payment so made is illegal.\nThe county shall use generally accepted accounting principles in the management of its accounting records.",
	"repealed": false
}