{
	"id": "206.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.61",
	"title": "206.61 BALLOTS.",
	"text": "(a) The official charged with providing paper ballots when they are used shall provide all ballot cards, sample ballots, precinct summary statements, and other necessary supplies needed for electronic voting systems, except as otherwise provided by this section.\n(b) At general elections and primaries the county auditor of each county in which an electronic voting system is used shall provide all ballot cards and other necessary printed forms and supplies needed for the electronic voting system, including all forms needed for voting on candidates and questions, the ballots for which are required by the election laws to be provided by the state when paper ballots are used.\n(c) In precincts using a ballot format as provided by section 206.80, paragraph (b), clause (2), item (ii), voters must be provided the option of voting with a regularly printed optical scan ballot or paper ballot in precincts that hand count ballots.\n[Repealed, 1997 c 147 s 79]\nCandidates' names may be set in as large type as the length of the majority of names on the ballot permits. The remaining candidates' names may be set in smaller sizes of type as the length of each name requires, in order to fit the available space on the ballot card.\nOn the \"State Partisan Primary Ballot\" prepared for primary elections, and on the state general election ballot prepared for the general election, the order of the names of nominees or names of candidates for election shall be the same as required for paper ballots. More than one column or row may be used for the same office or party. Electronic ballot display and audio ballot readers must conform to the candidate order on the optical scan ballot used in the precinct.\nThe provisions of the election laws requiring the alternation of names of candidates must be observed as far as practicable by changing the order of the names on an electronic voting system in the various precincts so that each name appears on the machines or marking devices used in a municipality substantially an equal number of times in the first, last, and in each intermediate place in the list or group in which they belong. However, the arrangement of candidates' names must be the same on all voting systems used in the same precinct. If the number of names to be alternated exceeds the number of precincts, the election official responsible for providing the ballots, in accordance with subdivision 1, shall determine by lot the alternation of names.\nIf an electronic ballot marker is used with a paper ballot that is not an optical scan ballot card, the manner of alternation of candidate names on the paper ballot must be as prescribed for optical scan ballots in this subdivision.\nThe rules adopted by the secretary of state for the rotation of candidate names must use the number of registered voters in each precinct as of 8:00 a.m. on May 1 of the year when the rotation will be made as the basis for determining the rotation of names.\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]\n[Repealed, 1997 c 147 s 79]",
	"repealed": false
}