{
	"id": "14.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.127",
	"title": "14.127 LEGISLATIVE APPROVAL REQUIRED.",
	"text": "An agency must determine if the cost of complying with a proposed rule in the first year after the rule takes effect will exceed $25,000 for: (1) any one business that has less than 50 full-time employees; or (2) any one statutory or home rule charter city that has less than ten full-time employees. For purposes of this section, \"business\" means a business entity organized for profit or as a nonprofit, and includes an individual, partnership, corporation, joint venture, association, or cooperative.\nAn agency must make the determination required by subdivision 1 before the close of the hearing record, or before the agency submits the record to the administrative law judge if there is no hearing. The administrative law judge must review and approve or disapprove the agency determination under this section.\nIf the agency determines that the cost exceeds the threshold in subdivision 1, or if the administrative law judge disapproves the agency's determination that the cost does not exceed the threshold in subdivision 1, any business that has less than 50 full-time employees or any statutory or home rule charter city that has less than ten full-time employees may file a written statement with the agency claiming a temporary exemption from the rules. Upon filing of such a statement with the agency, the rules do not apply to that business or that city until the rules are approved by a law enacted after the agency determination or administrative law judge disapproval.\n(a) Subdivision 3 does not apply if the administrative law judge approves an agency's determination that the legislature has appropriated money to sufficiently fund the expected cost of the rule upon the business or city proposed to be regulated by the rule.\n(b) Subdivision 3 does not apply if the administrative law judge approves an agency's determination that the rule has been proposed pursuant to a specific federal statutory or regulatory mandate.\n(c) This section does not apply if the rule is adopted under section 14.388 or under another law specifying that the rulemaking procedures of this chapter do not apply.\n(d) This section does not apply to a rule adopted by the Public Utilities Commission.\n(e) Subdivision 3 does not apply if the governor waives application of subdivision 3. The governor may issue a waiver at any time, either before or after the rule would take effect, but for the requirement of legislative approval. As soon as possible after issuing a waiver under this paragraph, the governor must send notice of the waiver to the speaker of the house and the president of the senate and must publish notice of this determination in the State Register.\nIf an administrative law judge determines that part of a proposed rule exceeds the threshold specified in subdivision 1, but that a severable portion of a proposed rule does not exceed the threshold in subdivision 1, the administrative law judge may provide that the severable portion of the rule that does not exceed the threshold may take effect without legislative approval.",
	"repealed": false
}