{
	"id": "169.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.87",
	"title": "169.87 SEASONAL LOAD RESTRICTION; ROUTE DESIGNATION.",
	"text": "(a) Local authorities, with respect to highways under their jurisdiction, may prohibit the operation of vehicles upon any such highway or impose restrictions as to the weight of vehicles to be operated upon any such highway, whenever any such highway, by reason of deterioration, rain, snow, or other climatic conditions, will be seriously damaged or destroyed unless the use of vehicles thereon is prohibited or the permissible weights thereof reduced.\n(b) The local authority enacting any such prohibition or restriction shall erect or cause to be erected and maintained signs plainly indicating the prohibition or restriction at each end of that portion of any highway affected thereby, and the prohibition or restriction shall not be effective unless and until such signs are erected and maintained.\n(c) Municipalities, with respect to highways under their jurisdiction, may also, by ordinance, prohibit the operation of trucks or other commercial vehicles, or may impose limitations as to the weight thereof, on designated highways, which prohibitions and limitations shall be designated by appropriate signs placed on such highways.\n(d) The commissioner shall likewise have authority, as hereinabove granted to local authorities, to determine and to impose prohibitions or restrictions as to the weight of vehicles operated upon any highway under the jurisdiction of the commissioner, and such restrictions shall be effective when signs giving notice thereof are erected upon the highway or portion of any highway affected by such action.\n(e) When a local authority petitions the commissioner to establish a truck route for travel into, through, or out of the territory under its jurisdiction, the commissioner shall investigate the matter. If the commissioner determines from investigation that the operation of trucks into, through, or out of the territory involves unusual hazards because of any or all of the following factors; load carried, type of truck used, or topographic or weather conditions, the commissioner may, by order, designate certain highways under the commissioner's jurisdiction as truck routes into, through, or out of such territory. When these highways have been marked as truck routes pursuant to the order, trucks traveling into, through, or out of the territory shall comply with the order.\n(a) Unless restricted as provided in subdivision 1, between the dates set by the commissioner of transportation each year, the weight on any single axle shall not exceed:\n(1) five tons on an unpaved street or highway; or\n(2) ten tons on a paved street or highway.\n(b) The gross weight on consecutive axles on an unpaved street or highway shall not exceed the gross weight allowed in sections 169.823 to 169.829 multiplied by a factor of five divided by nine. This reduction shall not apply to the gross vehicle weight.\nWeight restrictions imposed pursuant to subdivisions 1 and 2 do not apply to a school bus or Head Start bus transporting students, Head Start children, or Head Start parents when the gross weight on a single axle of the school bus or Head Start bus does not exceed 14,000 pounds; provided that, road authorities may restrict any highway under their jurisdiction to a lesser axle weight by written order to school boards and Head Start grantees 24 hours in advance of required compliance with such reduced axle weight.\nA weight restriction imposed under subdivision 1 by the commissioner of transportation or a local road authority, or imposed by subdivision 2, does not apply to a vehicle transporting milk from the point of production to the point of first processing if, at the time the weight restriction is exceeded, the vehicle is carrying milk loaded at only one point of production. This subdivision does not authorize a vehicle described in this subdivision to exceed a weight restriction of five tons per axle by more than two tons per axle.\n(a) Weight restrictions imposed by the commissioner under subdivisions 1 and 2 do not apply to a two-axle or three-axle utility vehicle that does not exceed a weight of 20,000 pounds per single axle and 36,000 pounds gross vehicle weight for a two-axle vehicle or 48,000 pounds gross vehicle weight for a three-axle vehicle, if the vehicle is owned by:\n(1) a public utility as defined in section 216B.02;\n(2) a municipality or municipal utility that operates the vehicle for its municipal electric, gas, or water system; or\n(3) a cooperative electric association organized under chapter 308A.\n(b) The exemption in this subdivision applies only when the vehicle is performing service restoration or other work necessary to prevent an imminent loss of service.\n(a) While a vehicle is engaged in the type of collection the vehicle was designed to perform, weight restrictions imposed under subdivisions 1 and 2 do not apply to:\n(1) a vehicle that does not exceed 20,000 pounds per single axle and is designed and used exclusively for recycling, while operating in a political subdivision that mandates curbside recycling pickup;\n(2) a vehicle that does not exceed 14,000 pounds per single axle and is used exclusively for recycling;\n(3) a vehicle that does not exceed 14,000 pounds per single axle and is designed and used exclusively for collecting mixed municipal solid waste, as defined in section 115A.03, subdivision 21;\n(4) a portable toilet service vehicle that does not exceed 14,000 pounds per single axle or 26,000 pounds gross vehicle weight, and is designed and used exclusively for collecting liquid waste from portable toilets; or\n(5) a sewage septic tank truck while performing emergency pumping services as defined in section 169.829, subdivision 5, that does not exceed 20,000 pounds per single axle and is designed and used exclusively to haul sewage from septic or holding tanks.\n(b) Notwithstanding section 169.80, subdivision 1, the owner or operator of a vehicle that violates the weight restrictions imposed under subdivisions 1 and 2 is not subject to criminal penalties but is subject to a civil penalty for excess weight under section 169.871 if the vehicle meets the requirements under paragraph (a) and is engaged in the type of collection the vehicle was designed to perform.\n(a) Weight restrictions imposed by the commissioner under subdivisions 1 and 2 do not apply to cargo tank vehicles with two or three permanent axles when delivering propane for heating or dyed fuel oil on seasonally weight-restricted roads if the vehicle is loaded at no more than 50 percent capacity of the cargo tank.\n(b) To be exempt from weight restrictions under paragraph (a), a cargo tank vehicle used for propane must have an operating gauge on the cargo tank that shows the amount of propane as a percent of capacity of the cargo tank. Documentation of the capacity of the cargo tank must be available on the cargo tank or in the cab of the vehicle. For purposes of this subdivision, propane weighs 4.2 pounds per gallon.\n(c) To be exempt from weight restrictions under paragraph (a), a cargo tank vehicle used for dyed fuel oil must utilize the forward two tank compartments and must carry documentation of the empty weight of the cargo tank vehicle from a certified scale in the cab of the vehicle. For purposes of this subdivision, dyed fuel oil weighs seven pounds per gallon.\n(d) To the extent practicable, cargo tank vehicles that are exempt from weight restrictions under paragraph (a) shall complete deliveries on seasonally weight-restricted roads by 12:00 p.m. and before the last week of April.",
	"repealed": false
}