{
	"id": "290.0677",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0677",
	"title": "290.0677 MILITARY SERVICE CREDITS.",
	"text": "(a) An individual is allowed a credit against the tax due under this chapter equal to $120 for each month or portion thereof that the individual was in active military service in a designated area after December 31, 2008, while a Minnesota domiciliary.\n(b) An individual may claim the credit for the calendar year in which the active service was performed.\n(a) A qualified individual is allowed a credit against the tax imposed under this chapter for past military service. The credit equals $750. The credit allowed under this subdivision is reduced by ten percent of adjusted gross income in excess of $30,000, but in no case is the credit less than zero.\n(b) For a nonresident or a part-year resident, the credit under this subdivision must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Designated area\" means a:\n(1) combat zone designated by Executive Order from the President of the United States;\n(2) qualified hazardous duty area, designated in Public Law; or\n(3) location certified by the U. S. Department of Defense as eligible for combat zone tax benefits due to the location's direct support of military operations.\n(c) \"Active military service\" means active duty service in any of the United States armed forces, the National Guard, or reserves.\n(d) \"Qualified individual\" means an individual who has:\n(1) met one of the following criteria:\n(i) has served at least 20 years in the military;\n(ii) has a service-connected disability rating of 100 percent for a total and permanent disability; or\n(iii) has been determined by the military to be eligible for compensation from a pension or other retirement pay from the federal government for service in the military, as computed under United States Code, title 10, sections 1401 to 1414, 1447 to 1455, or 12733; and\n(2) separated from military service before the end of the taxable year.\n(e) \"Adjusted gross income\" has the meaning given in section 62 of the Internal Revenue Code.\nIf the amount of credit which the individual is eligible to receive under subdivision 1 exceeds the individual's tax liability under this chapter, the commissioner shall refund the excess to the individual.\nAn amount sufficient to pay the refunds required by this section is appropriated to the commissioner from the general fund.",
	"repealed": false
}