{
	"id": "142D.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.10",
	"title": "142D.10 EARLY CHILDHOOD FAMILY EDUCATION (ECFE) PROGRAMS.",
	"text": "A district that provides a community education program under sections 124D.18 and 124D.19 may establish an early childhood family education program. Two or more districts, each of which provides a community education program, may cooperate to jointly provide an early childhood family education program. The purpose of the early childhood family education program is to provide parenting education to support children's learning and development.\n(a) Early childhood family education programs are programs for children in the period of life from birth to kindergarten, for the parents and other relatives of these children, and for expectant parents. To the extent that funds are insufficient to provide programs for all children, early childhood family education programs should emphasize programming for a child from birth to age three and encourage parents and other relatives to involve four- and five-year-old children in school readiness programs, and other public and nonpublic early learning programs. A district may not limit participation to school district residents. Early childhood family education programs must provide:\n(1) programs to educate parents and other relatives about the physical, cognitive, social, and emotional development of children and to enhance the skills of parents and other relatives in providing for their children's learning and development;\n(2) structured learning activities requiring interaction between children and their parents or relatives;\n(3) structured learning activities for children that promote children's development and positive interaction with peers, which are held while parents or relatives attend parent education classes;\n(4) information on related community resources;\n(5) information, materials, and activities that support the safety of children, including prevention of child abuse and neglect;\n(6) a community needs assessment that identifies new and underserved populations, identifies child and family risk factors, particularly those that impact children's learning and development, and assesses family and parenting education needs in the community;\n(7) programming and services that are tailored to the needs of families and parents prioritized in the community needs assessment; and\n(8) information about and, if needed, assist in making arrangements for an early childhood health and developmental screening under sections 142D.09 and 142D.091, when the child nears the third birthday.\n(b) Early childhood family education programs should prioritize programming and services for families and parents identified in the community needs assessment, particularly those families and parents with children with the most risk factors birth to age three.\n(c) Early childhood family education programs are encouraged to provide parents of English learners with translated oral and written information to monitor the program's impact on their children's English language development, to know whether their children are progressing in developing their English and native language proficiency, and to actively engage with and support their children in developing their English and native language proficiency.\n(d) Early childhood family education programs must include learning experiences for children, parents, and other relatives that promote children's early literacy and, where practicable, their native language skills and activities for children that require substantial involvement of the children's parents or other relatives. Programs may provide parenting education programming or services to anyone identified in the community needs assessment. Providers must review the program periodically to assure the instruction and materials are not racially, culturally, or sexually biased. The programs must encourage parents to be aware of practices that may affect equitable development of children.\n(e) For the purposes of this section, \"relative\" or \"relatives\" means noncustodial grandparents or other persons related to a child by blood, marriage, adoption, or foster placement, excluding parents.\nThe requirement of substantial parental or other relative involvement in subdivision 2 means that:\n(1) parents or other relatives must be physically present much of the time in classes with their children or be in concurrent classes;\n(2) parenting education or family education must be an integral part of every early childhood family education program;\n(3) early childhood family education appropriations must not be used for traditional day care or nursery school, or similar programs; and\n(4) the form of parent involvement common to kindergarten, elementary school, or early childhood special education programs such as parent conferences, newsletters, and notes to parents do not qualify a program under subdivision 2.\n(a) A district that levies for home visiting under section 142D.11, subdivision 6, shall use this revenue to include as part of the early childhood family education programs a parent education component that is designed to reach isolated or at-risk families.\n(b) The home visiting program must:\n(1) incorporate evidence-informed parenting education practices designed to support the healthy growth and development of children, with a priority focus on those children who have high needs;\n(2) establish clear objectives and protocols for home visits;\n(3) encourage families to make a transition from home visits to site-based parenting programs;\n(4) provide program services that are community-based, accessible, and culturally relevant;\n(5) foster collaboration among existing agencies and community-based organizations that serve young children and their families, such as public health evidence-based models of home visiting and Head Start home visiting; and\n(6) provide information about and assist in making arrangements for an early childhood health and developmental screening when the child nears his or her third birthday.\n(c) The home visiting program should be provided by licensed parenting educators, certified family life educators, or professionals with an equivalent license that reflect the demographic composition of the community to the extent possible.\nThe district must maintain a separate account within the community education fund for money for early childhood family education programs.\nA district must establish a reasonable sliding fee scale but it shall waive the fee for a participant unable to pay.\nA district may receive funds from any governmental agency or private source.\n(a) A district must describe strategies to coordinate and maximize public and private community resources and reduce duplication of services.\n(b) A district is encouraged to coordinate adult basic education programs provided to parents and early childhood family education programs provided to children to accomplish the goals of section 124D.895.\nThe board must appoint an advisory council from the area in which the program is provided. A majority of the council must be parents participating in the program, who represent the demographics of the community. The district must ensure, to the extent possible, that the council includes representation of families who are racially, culturally, linguistically, and economically diverse. The council must assist the board in developing, planning, and monitoring the early childhood family education program. The council must report to the board and the community education advisory council.\nA board may direct the community education council, required according to section 124D.19, subdivision 2, to perform the functions of the Advisory Council for Early Childhood Family Education.\nA school board must employ necessary licensed teachers for its early childhood family education programs.\nThe department must provide assistance to districts with programs described in this section. The department must establish guidelines that list barriers to learning and development affecting children served by early childhood family education programs.\n(a) The department must employ two full-time equivalent staff to serve as resources for programs described in this section. The staff persons must provide operational support and guidance to programs, including but not limited to providing professional development and education support, assisting with marketing and outreach, and facilitating collaborations with public and private organizations serving families.\n(b) Each staff person described in this subdivision must hold a valid license as a teacher of parent and family education.\nDistricts receiving early childhood family education revenue under section 142D.11 must submit annual program data, including data that demonstrates the program response to the community needs assessment, to the department by July 15 in the form and manner prescribed by the commissioner.\nA program provided by a board must be supervised by a licensed early childhood teacher or a licensed parent educator.\nTo the extent that funds are sufficient, early childhood family education may provide parenting education transition programming for parents of children birth to grade three in districts in which there is a prekindergarten-grade three initiative in order to facilitate continued parent engagement in children's learning and development. Early childhood family education programs are encouraged to develop partnerships to provide a parenting education liaison to providers of other public and nonpublic early learning programs, such as Head Start, school readiness, child care, early childhood special education, local public health programs, and health care providers.",
	"repealed": false
}