{
	"id": "160.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.085",
	"title": "160.085 RECORDING PROPOSED ACQUISITION FOR ROAD.",
	"text": "(a) In order to facilitate the acquisition of right-of-way required for highways, state and county road authorities may file for record in the office of the county recorder or registrar of titles in the county in which right-of-way is to be acquired, such orders or resolutions, as required by law, in the form of maps or plats showing right-of-way by course distance, bearing and arc length, and other rights or interests in land to be acquired as the road authority determines necessary. Said map or plat shall show by outline all tracts or parcels of land affected by the proposed acquisition.\n(b) The map or plat, as to trunk highways, shall be certified by the commissioner of transportation or the commissioner's designated assistant and by a licensed land surveyor.\n(c) The map or plat shall be certified as to county state-aid highways and county highways by the chair of the county board or the county engineer or the engineer's designated assistant, and by a licensed land surveyor in the employ of the county.\n(d) The map or plat so certified is entitled to record without compliance with the provisions of chapter 505. Neither a witness nor an acknowledgment is required for a map or plat certified under this subdivision. Any amendments, alterations, corrections, rescissions or vacations of such orders, resolutions, maps or plats so filed shall be entitled to record in like manner. The recorder or registrar may make suitable notations on the appropriate map or plat affected by an amendment, alteration, correction, rescission or vacation to direct the attention of anyone examining the record to the proper map or plat.\nIf an error on a map or plat incorrectly defines the intended acquisition, but does not affect any rights of interest to be acquired, a certificate may be prepared stating what the defect is, what the correct information is, and which map or plat the certificate affects. The certificate shall be signed by a licensed land surveyor. The certificate shall be filed for record in the office of the county recorder or registrar of titles in the county where the map or plat is filed. When so filed the certificate shall amend the map or plat. The recorder or registrar may make suitable notations on the map or plat to which the certificate refers to direct the attention of anyone examining the map or plat to the record of the certificate.\nMaps or plats filed for record under this section shall not operate of themselves to transfer of title to the property described and designated by appropriate parcel number but such map or plats shall be for delineation purposes.\n(a) Land acquisition by the road authority for highway purposes by instrument of conveyance or by eminent domain proceedings, may refer to the map or plat and parcel number, together with delineation of the parcel, as the only manner of description necessary for the acquisition.\n(b) In addition, land disposition by the road authority by instrument of conveyance may refer to the map or plat and parcel number, together with delineation of the parcel, as the only manner of description necessary for the disposition.",
	"repealed": false
}