{
	"id": "327C.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.015",
	"title": "327C.015 DEFINITIONS.",
	"text": "When used in sections 327C.015 to 327C.15 and 363A.38, the terms defined in this section have the meanings given them.\n\"Class I \" means a manufactured home park that complies with the provisions of section 327C.16.\n\"Closure statement\" means a statement prepared by the park owner clearly stating that the park is closing, addressing the availability, location, and potential costs of adequate replacement housing within a 25 mile radius of the park that is closing and the probable relocation costs of the manufactured homes located in the park.\n\"Commodity rate\" means the per unit price for utility service that varies directly with the volume of a resident's consumption of utility service and that is established or approved by the Minnesota Public Utilities Commission or a municipal public utilities commission, an electric cooperative association, or a municipality and charged to a user of the service.\n\"Displaced resident\" means a resident of an owner-occupied manufactured home who rents a lot in a manufactured home park, including the members of the resident's household, as of the date the park owner submits a closure statement to the local planning agency.\n\"In park sale\" means the sale of a manufactured home owned by a park resident and located in a manufactured home park, after which sale the home remains in the park.\n\"Lot\" means an area within a manufactured home park, designed or used for the accommodation of a manufactured home.\n\"Manufactured home\" and \"home\" have the meaning specified in section 327B.01, subdivision 13.\n\"Manufactured home park\" and \"park\" have the meaning specified in section 327.14, subdivision 3, but do not include facilities which are open only during three or fewer seasons of the year.\n\"Park owner\" means the owner of a manufactured home park and any person acting on behalf of the owner in the operation or management of a park.\n\"Person\" means any individual, corporation, firm, partnership, incorporated and unincorporated association, or any other legal or commercial entity.\n\"Planning agency\" means the planning commission or the planning department of a municipality as defined in section 462.352, the planning and zoning commission of a town as defined in Minnesota Statutes 2020, section 366.17, or the planning commission of a county, as defined in section 394.30, or if the municipality does not have a planning agency, the governing body of the municipality.\n\"Public utility\" has the meaning given in section 216B.02, subdivision 4.\n\"Reasonable rule\" means a park rule:\n(1) which is designed to promote the convenience, safety, or welfare of the residents, promote the good appearance and facilitate the efficient operation of the park, protect and preserve the park premises, or make a fair distribution of services and facilities;\n(2) which is reasonably related to the purpose for which it is adopted;\n(3) which is not retaliatory or unjustifiably discriminatory in nature; and\n(4) which is sufficiently explicit in prohibition, direction, or limitation of conduct to fairly inform the resident of what to do or not to do to comply.\n\"Representative acting on behalf of residents\" means a representative who is authorized to represent residents in the purchase of property for the purposes of this chapter, and has gained that authorization by obtaining the signature of support from at least one resident who is a homeowner-signatory to the home's lot lease agreement as defined by subdivision 14, from at least 51 percent of the occupied homes in a manufactured home park. The signature of a resident who is a signatory to the home's lot lease agreement asserting that they are a resident of that manufactured home park shall be presumptive evidence of the claim that the representative is authorized to act on behalf of the resident and shall be exclusive to only one representative acting on behalf of residents.\n\"Resident\" means an owner of a manufactured home who rents a lot in a manufactured home park and includes the members of the resident's household.\n\"Resident association\" means an organization that has the written permission of the owners of at least 51 percent of the manufactured homes in the park to represent them, and which is organized for the purpose of resolving matters relating to living conditions in the manufactured home park.\n\"Rule\" means any rental agreement provision, regulation, rule or policy through which a park owner controls, affects or seeks to control or affect the behavior of residents.\n\"Substantial modification\" means any change in a rule which: (a) significantly diminishes or eliminates any material obligation of the park owner; (b) significantly diminishes or eliminates any material right, privilege or freedom of action of a resident; or (c) involves a significant new expense for a resident. The installation of water and sewer meters and the subsequent metering of and billing for water and sewer service is not a substantial modification of the lease, provided the park owner complies with section 327C.04, subdivision 6.\n\"Utility provider\" means a public utility, an electric cooperative association, or a municipal utility.\n\"Utility service\" means any electric, fuel oil, natural or propane gas, sewer, waste disposal and water service by whatever means furnished.",
	"repealed": false
}