{
	"id": "471.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.345",
	"title": "471.345 UNIFORM MUNICIPAL CONTRACTING LAW.",
	"text": "For purposes of this section, \"municipality\" means a county, town, city, school district or other municipal corporation or political subdivision of the state authorized by law to enter into contracts.\nA \"contract\" means an agreement entered into by a municipality for the sale or purchase of supplies, materials, equipment or the rental thereof, or the construction, alteration, repair or maintenance of real or personal property.\nIf the amount of the contract is estimated to exceed $175,000, sealed bids shall be solicited by public notice in the manner and subject to the requirements of the law governing contracts by the particular municipality or class thereof. With regard to repairs and maintenance of ditches, the provisions of section 103E.705, subdivisions 5, 6, and 7, apply.\nAs an alternative to the procurement method described in subdivision 3, municipalities may award a contract for construction, alteration, repair, or maintenance work to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nAs an alternative to the procurement methods described in subdivisions 3 and 3a, municipalities may award a contract for construction, alteration, repair, or maintenance work to a construction manager at risk as provided in section 471.463.\nIf the amount of the contract is estimated to exceed $25,000 but not to exceed $175,000, the contract may be made either upon sealed bids or by direct negotiation, by obtaining two or more quotations for the purchase or sale when possible, and without advertising for bids or otherwise complying with the requirements of competitive bidding. All quotations obtained shall be kept on file for a period of at least one year after receipt thereof.\nAs an alternative to the procurement method described in subdivision 4, municipalities may award a contract for construction, alteration, repair, or maintenance work to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nIf the amount of the contract is estimated to be $25,000 or less, the contract may be made either upon quotation or in the open market, in the discretion of the governing body. If the contract is made upon quotation it shall be based, so far as practicable, on at least two quotations which shall be kept on file for a period of at least one year after their receipt. Alternatively, municipalities may award a contract for construction, alteration, repair, or maintenance work to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nIf the amount of a county or town contract for the rental of equipment is estimated to be $60,000 or less, the contract may, in the discretion of the county or town board, be made by direct negotiation by obtaining two or more quotations for the rental when possible and without advertising for bids or otherwise complying with the requirements of competitive bidding. All quotations shall be kept on file for a period of at least one year after their receipt.\n(a) A municipality may, by direct negotiation or through the solicitation of requests for proposals, enter into a multiyear professional service contract for the engineering, repair, and maintenance of a water storage tank and appurtenant facilities owned, controlled, or operated by the municipality, if the contract contains:\n(1) a provision that the municipality is not required to make total payments in a single year that exceed the water utility charges received by the municipality for that year;\n(2) a provision requiring that the work performed be done under the review of a professional engineer licensed in the state of Minnesota attesting that the work will be performed in compliance with all applicable codes and engineering standards; and\n(3) a provision that if, at the commencement of the contract, the water tank or appurtenant facilities require engineering, repair, or service in order to bring the water tank or facilities into compliance with federal, state, or local requirements, the party contracting with the municipality is responsible for providing the engineering, repair, or service. The costs to bring the water tank or facilities into compliance must be itemized separately and charged to the municipality in payments spread over a period of not less than three years from the commencement of the contract.\n(b) If the cost of a contract for the sale or purchase of supplies, materials, equipment or the rental thereof, or the construction, alteration, repair, or maintenance of real or personal property entered into under this subdivision is estimated to meet the costs specified under subdivisions 3 and 3a, paragraph (a) applies but the municipality must use the procurement methods specified in subdivision 3 or 3a to contract for that portion of the work.\nThe purpose of this section is to establish for all municipalities, uniform dollar limitations upon contracts which shall or may be entered into on the basis of competitive bids, quotations or purchase or sale in the open market. To the extent inconsistent with this purpose, all laws governing contracts by a particular municipality or class thereof are superseded. In all other respects such laws shall continue applicable.\nNothing in this section shall be construed to prohibit any municipality from adopting rules, regulations, or ordinances which establish the prevailing wage rate as defined in section 177.42, as a minimum standard for wages and which establish the hours and working conditions prevailing for the largest number of workers engaged in the same class of labor within the area as a minimum standard for a contractor's employees which must be agreed to by any contractor before the contractor may be awarded any contract for the furnishing of any labor, material, supplies, or service.\nFor purposes of this subdivision, the following terms shall have the meanings herein ascribed to them:\n(a) \"Small targeted group business\" means businesses designated under section 16C.16.\n(b) \"Business entity\" means an entity organized for profit, including an individual, partnership, corporation, joint venture, association, or cooperative.\nNothing in this section shall be construed to prohibit any municipality from adopting a resolution, rule, regulation, or ordinance which on an annual basis designates and sets aside for awarding to small targeted group businesses a percentage of the value of its anticipated total procurement of goods and services, including construction, and which uses either a negotiated price or bid contract procedure in the awarding of a procurement contract under a set-aside program as allowed in this subdivision, provided that any award based on a negotiated price shall not exceed by more than five percent the municipality's estimated price for the goods and services if they were purchased on the open market and not under the set-aside program.\nMS 1988 [Repealed, 1990 c 549 s 3]\nSupplies, materials, or equipment to be used in the operation of a hospital licensed under sections 144.50 to 144.56 or an ambulance service licensed under chapter 144E that are purchased or leased under a shared service purchasing arrangement whereby more than one hospital or ambulance service purchases supplies, materials, or equipment with one or more other hospitals or ambulance services either through one of the hospitals or ambulance services or through another entity, may be purchased without regard to the competitive bidding requirements of this section, if the following conditions are met:\n(1) the hospital's or ambulance service's governing authority authorizes the arrangement;\n(2) the shared services purchasing program purchases items available from more than one source on the basis of competitive bids or competitive quotations of prices; and\n(3) the arrangement authorizes the hospital's or ambulance service's governing authority or its representatives to review the purchasing procedures to determine compliance with these requirements.\nThe shared services purchasing program may award contracts to more than one bidder if doing so does not decrease the service level or diminish the effects of competition.\nNotwithstanding the amount of the contract, any contract entered into by a municipality for the purchase of fuel required for the generation of power from municipal power plants shall be governed by subdivision 4.\nNothing in this section prohibits a municipality from adopting a resolution, rule, regulation, or ordinance that on an annual basis designates and sets aside for awarding to rehabilitation facilities as described in section 268A.06 a percentage of the value of its anticipated total procurement of goods and services, including construction, and which uses either a negotiated price or bid contract procedure in the awarding of a procurement contract under a set-aside program as allowed in this subdivision, provided that any award based on a negotiated price shall not exceed by more than five percent the municipality's estimated price for the goods and services if they were purchased on the open market and not under the set-aside program.\nThe following definitions apply to this subdivision.\n(a) \"Energy conservation measure\" means a training program or facility alteration designed to reduce energy consumption or operating costs and includes:\n(1) insulation of the building structure and systems within the building;\n(2) storm windows and doors, caulking or weatherstripping, multiglazed windows and doors, heat absorbing or heat reflective glazed and coated window and door systems, additional glazing, reductions in glass area, and other window and door system modifications that reduce energy consumption;\n(3) automatic energy control systems;\n(4) heating, ventilating, or air conditioning system modifications or replacements;\n(5) replacement or modifications of lighting fixtures to increase the energy efficiency of the lighting system without increasing the overall illumination of a facility, unless an increase in illumination is necessary to conform to the applicable state or local building code for the lighting system after the proposed modifications are made;\n(6) energy recovery systems;\n(7) cogeneration systems that produce steam or forms of energy such as heat, as well as electricity, for use primarily within a building or complex of buildings;\n(8) energy conservation measures that provide long-term operating cost reductions; and\n(9) water metering devices that increase efficiency or accuracy of water measurement and reduce energy use.\n(b) \"Guaranteed energy-savings contract\" means a contract for the evaluation and recommendations of energy conservation measures, and for one or more energy conservation measures. The contract must provide that all payments, except obligations on termination of the contract before its expiration, are to be made over time, but not to exceed 20 years from the date of final installation, and the savings are guaranteed to the extent necessary to make payments for the systems.\n(c) \"Qualified provider\" means a person or business experienced in the design, implementation, and installation of energy conservation measures. A qualified provider to whom the contract is awarded shall give a sufficient bond to the municipality for its faithful performance.\nNotwithstanding any law to the contrary, a municipality may enter into a guaranteed energy-savings contract with a qualified provider to significantly reduce energy or operating costs.\nBefore entering into a contract under this subdivision, the municipality shall provide published notice of the meeting in which it proposes to award the contract, the names of the parties to the proposed contract, and the contract's purpose.\nBefore installation of equipment, modification, or remodeling, the qualified provider shall first issue a report, summarizing estimates of all costs of installations, modifications, or remodeling, including costs of design, engineering, installation, maintenance, repairs, or debt service, and estimates of the amounts by which energy or operating costs will be reduced.\nA guaranteed energy-savings contract that includes a written guarantee that savings will meet or exceed the cost of energy conservation measures is not subject to competitive bidding requirements of section 471.345 or other law or city charter. The contract is not subject to section 123B.52.\nA municipality may enter into a guaranteed energy-savings contract with a qualified provider if, after review of the report, it finds that the amount it would spend on the energy conservation measures recommended in the report is not likely to exceed the amount to be saved in energy and operation costs over 20 years from the date of final installation if the recommendations in the report were followed, and the qualified provider provides a written guarantee that the energy or operating cost savings will meet or exceed the costs of the system. The guaranteed energy-savings contract may provide for payments over a period of time, not to exceed 20 years.\nA municipality may enter into an installment payment contract for the purchase and installation of energy conservation measures. The contract must provide for payments of not less than 1/20 of the price to be paid within two years from the date of the first operation, and the remaining costs to be paid monthly, not to exceed a 20-year term from the date of final acceptance.\nA municipality entering into a guaranteed energy-savings contract shall provide a copy of the contract and the report from the qualified provider to the commissioner of commerce within 30 days of the effective date of the contract.\nGuaranteed energy-savings contracts may extend beyond the fiscal year in which they become effective. The municipality shall include in its annual appropriations measure for each later fiscal year any amounts payable under guaranteed energy-savings contracts during the year. Failure of a municipality to make such an appropriation does not affect the validity of the guaranteed energy-savings contract or the municipality's obligations under the contracts.\n(a) In any action brought challenging the validity of a municipal contract under this section, the court shall not award, as any part of its judgment, damages or attorney fees, but may award an unsuccessful bidder the costs of preparing an unsuccessful bid.\n(b) Paragraph (a) applies to any action arising under or based upon the alleged violation by a municipality of any law, regulation, ordinance, or equitable doctrine governing or regarding public procurement requirements, public procurement procedures, or the award of any public contract by a municipality, regardless of whether the agreement constitutes a contract under subdivision 2.\n(a) Municipalities may contract for the purchase of supplies, materials, or equipment by utilizing contracts that are available through the state's cooperative purchasing venture authorized by section 16C.11. For a contract estimated to exceed $25,000, a municipality must consider the availability, price and quality of supplies, materials, or equipment available through the state's cooperative purchasing venture before purchasing through another source.\n(b) If a municipality does not utilize the state's cooperative purchasing venture, a municipality may contract for the purchase of supplies, materials, or equipment without regard to the competitive bidding requirements of this section if the purchase is through a national municipal association's purchasing alliance or cooperative created by a joint powers agreement that purchases items from more than one source on the basis of competitive bids or competitive quotations.\nNotwithstanding any other procedural requirements of this section, a municipality may contract to purchase supplies, materials, and equipment using an electronic purchasing process in which vendors compete to provide the supplies, materials, or equipment at the lowest selling price in an open and interactive environment. A municipality may not use this process to contract for services, as defined by section 16C.02, subdivision 17, or a service contract, as defined by section 16C.02, subdivision 7a. Nothing in this subdivision must be construed to prohibit a municipality from adopting a resolution, rule, regulation, or ordinance relating to minimum labor standards under subdivision 7, or procurement from economically disadvantaged persons under subdivision 8.\nNotwithstanding any other procedural requirements of this section, a municipality may contract to sell supplies, materials, and equipment which is surplus, obsolete, or unused using an electronic selling process in which purchasers compete to purchase the surplus supplies, materials, or equipment at the highest purchase price in an open and interactive environment.\nNotwithstanding any other procedural requirements of this section, vendors may submit bids, quotations, and proposals electronically in a form and manner required by the municipality. A municipality may allow bid, performance, or payment bonds, or other security, to be furnished electronically.\nNotwithstanding any other procedural requirements of this section, a town may contract for the construction or maintenance of a town road by agreeing to the terms of an existing contract between a vendor and a county for road construction or maintenance on an adjoining road if the existing county contract was made in conformance with all applicable procedural requirements.\nA contract, as defined in subdivision 2, estimated not to exceed $250,000 may be made pursuant to the provisions of subdivision 4 provided that a business that is directly solicited is: (1) certified as a small business enterprise by a county designated small business certification program; or (2) certified by the commissioner of administration as a small business that is majority-owned and operated by a veteran or a service-disabled veteran. This subdivision applies only to county boards.\n(a) Original jurisdiction is granted to the district court over any action seeking legal, equitable, or declaratory relief arising under or based upon the alleged violation of any law or ordinance governing public procurement requirements, public procurement procedures, or the award of any public contract.\n(b) The grant of original jurisdiction under paragraph (a) applies regardless of whether a public entity involved or implicated in the action is alleged to have acted, or may be held to have acted, in a judicial or quasi-judicial capacity.\n(c) The grant of original jurisdiction under paragraph (a) does not: (1) alter the standard of review to be applied by a district court; (2) alter the standard of review applied by an appellate court; (3) affect subdivision 14; (4) affect the available remedies, including, but not limited to, the availability or nonavailability of attorney fees awards and bid preparation costs; or (5) affect the procedural or administrative steps, if any, set out by statute, rule, or procurement procedure, that a party must comply with prior to initiating any such action.\n(d) A procurement process participant must file an action prior to the date when the procurement contract at issue is fully executed unless:\n(1) the party demonstrates that it acted diligently in seeking access to information the party reasonably deemed necessary to review prior to bringing an action; and\n(2) the procurement process participant has not been afforded (i) reasonable access to information necessary to prepare the action for filing, or (ii) a reasonable opportunity to bring the action and seek appropriate relief from the court before the public procurement contract is fully executed. Reasonable access to necessary information and a reasonable opportunity to seek relief includes receipt of data described under section 13.591, subdivision 3 or 4, at least 15 days prior to full execution of the procurement contract.\n(e) Paragraph (d) does not apply to matters alleging: (1) fraud or misrepresentation, or (2) acts following contract execution that would have been improper or illegal prior to contract execution.",
	"repealed": false
}