{
	"id": "171.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.321",
	"title": "171.321 QUALIFICATIONS OF SCHOOL BUS AND TYPE III VEHICLE DRIVERS.",
	"text": "No person shall drive a school bus when transporting school children to or from school or upon a school-related trip or activity without having a valid class A, class B, or class C driver's license with a school bus endorsement except that a person possessing a valid driver's license but not a school bus endorsement may drive a type III vehicle or a school bus, subject to the requirements of section 171.02, subdivisions 2, 2a, and 2b.\n(a) The commissioner of public safety shall prescribe rules governing (1) the physical qualifications of school bus drivers and tests required to obtain a school bus endorsement, and (2) the physical qualifications of type III vehicle drivers.\n(b) The rules under paragraph (a) must provide that an applicant for a school bus endorsement or renewal is exempt from the physical qualifications and medical examination required to operate a school bus upon providing evidence of being medically examined and certified within the preceding 24 months as physically qualified to operate a commercial motor vehicle, pursuant to Code of Federal Regulations, title 49, part 391, subpart E, or rules of the commissioner of transportation incorporating those federal regulations. The commissioner shall accept physical examinations for school bus drivers conducted by medical examiners authorized as provided by Code of Federal Regulations, title 49, chapter 3, part 391, subpart E.\n(c) The commissioner of public safety, in conjunction with the commissioner of education, shall adopt rules prescribing a training program for Head Start bus drivers. The program must provide for initial classroom and behind-the-wheel training, and annual in-service training. The program must provide training in defensive driving, human relations, emergency and accident procedures, vehicle maintenance, traffic laws, and use of safety equipment. The program must provide that the training will be conducted by the contract operator for a Head Start agency, the Head Start grantee, a licensed driver training school, or by another person or entity approved by both commissioners.\n(d) The commissioner may exempt a type III vehicle driver from the physical qualifications required to operate a type III vehicle upon receiving evidence of the driver having been medically examined and certified within the preceding 24 months as physically qualified to operate a commercial motor vehicle as provided for applicants for a school bus endorsement under paragraph (b).\n(e) The actions of the commissioner of public safety in establishing physical qualifications for type III vehicle drivers are not rulemaking for purposes of chapter 14, are not subject to the Administrative Procedure Act contained in chapter 14, and are not subject to section 14.386.\n(a) Before issuing or renewing a school bus endorsement, the commissioner shall conduct a criminal history and driver's license records check of the applicant. The commissioner may also conduct the check at any time while a person is so licensed. The check must consist of a criminal history check of the state criminal records repository and a check of the driver's license records system. If the applicant has resided in Minnesota for less than five years, the check must also include a national criminal history check. The commissioner shall accept the national criminal history check request and the fingerprints of the applicant and is authorized to exchange fingerprints with the Federal Bureau of Investigation and request the Federal Bureau of Investigation to conduct a criminal history check. The applicant's failure to cooperate with the commissioner in conducting the records check is reasonable cause to deny an application or cancel a school bus endorsement. The commissioner may not release the results of the records check to any person except the applicant or the applicant's designee in writing.\n(b) The commissioner may issue to an otherwise qualified applicant a temporary school bus endorsement, effective for no more than 180 days, upon presentation of (1) an affidavit by the applicant that the applicant has not been convicted of a disqualifying offense and (2) a criminal history check from each state of residence for the previous five years. The criminal history check may be conducted and prepared by any public or private source acceptable to the commissioner. The commissioner may reissue the temporary endorsement if the national criminal records repository check is timely submitted but not completed within the 180-day period.\n(a) No person shall drive a class A, B, C, or D school bus when transporting school children to or from school or upon a school-related trip or activity without having demonstrated sufficient skills and knowledge to transport students in a safe and legal manner.\n(b) A bus driver must have training or experience that allows the driver to meet at least the following competencies:\n(1) safely operate the type of school bus the driver will be driving;\n(2) understand student behavior, including issues relating to students with disabilities;\n(3) encourage orderly conduct of students on the bus and handle incidents of misconduct appropriately;\n(4) know and understand relevant laws, rules of the road, and local school bus safety policies;\n(5) handle emergency situations; and\n(6) safely load and unload students.\n(c) The commissioner of public safety shall develop a comprehensive model school bus driver training program and model assessments for school bus driver training competencies, which are not subject to chapter 14. A school district, nonpublic school, or private contractor may use alternative assessments for bus driver training competencies with the approval of the commissioner of public safety. A driver may receive at least eight hours of school bus in-service training any year, as an alternative to being assessed for bus driver competencies after the initial year of being assessed for bus driver competencies. The employer shall keep the assessment or a record of the in-service training for the current period available for inspection by representatives of the commissioner.\n(d) A school district, nonpublic school, or private contractor shall provide in-service training annually to each school bus driver.\n(a) For purposes of this section, \"annually\" means at least once every 380 days from the initial or previous evaluation and at least once every 380 days from the initial or previous license verification.\n(b) A school district, nonpublic school, or private contractor shall annually verify with the National Driver Register or with the Department of Public Safety the validity of the driver's license of each employee who regularly transports students for the district in:\n(1) a type A school bus, a type B school bus, a type C school bus, or type D school bus;\n(2) a multifunction school activity bus; or\n(3) a type III vehicle.",
	"repealed": false
}