{
	"id": "31.495",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.495",
	"title": "31.495 REGULATION OF FOOD SALVAGE OPERATIONS.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Distressed food\" means any food, the label of which has been lost, defaced, or obliterated, or food which has been subjected to possible damage due to accident, fire, flood, adverse weather, or to any other similar cause; or food which is suspected of having been rendered unsafe or unsuitable for food use.\n(c) \"Reconditionable or salvageable food\" is distressed food which it is possible to reclaim for food, feed, or seed use as determined by examination by the commissioner or the commissioner's representatives.\n(d) \"Reconditioned or salvaged food\" is reconditionable or salvageable food which has been reconditioned or salvaged under supervision of the commissioner so as to comply with the standards established under this section.\n(e) \"Reconditioning\" or \"salvaging\" is the act of cleaning, culling, sorting, scouring, labeling, relabeling, or in any way treating \"distressed food\" so that it may be deemed to be \"reconditioned\" or \"salvaged food\" and therefore is acceptable for sale or use as human food, animal feed, or seed as provided therefor by the commissioner.\n(f) \"Salvage food processor\" is a person who holds a license under section 28A.04 to operate as a salvage food processor and who receives supervision of the salvaging operations from the commissioner.\n(g) \"Labeling\" means any legend or descriptive matter or design appearing upon an article of food or its container, and includes circulars, pamphlets and the like, which are packed and go with the article to the purchaser, and placards which may be allowed to be used to describe the food.\n(h) \"Salvage food distributor\" means a person who engages in the business of selling, distributing, or otherwise trafficking at wholesale in any distressed or salvaged food.\n(a) It is unlawful for any person either to claim to be a salvage food processor, or to engage in the activities of reconditioning or salvaging distressed food, or both, without a license issued under section 28A.04 authorizing that person to operate as a salvage food processor, which license may not be issued absent compliance with all the provisions of this section and all rules promulgated under this section.\n(b) Before issuing a license, the commissioner shall determine that the applicant's salvage establishment meets at least the minimum requirements adopted by rule for such an establishment which shall include but not be limited to adequacy of buildings, location, water supply, waste disposal, equipment, hand washing and toilet facilities, and sanitation practices, as the same relate to the protection of the public health and welfare.\n(c) It is unlawful for any person either to claim to be a salvaged food distributor or to engage in the activities of selling, distributing, or otherwise trafficking in any distressed or salvaged food, or both, at wholesale, without a license issued under section 28A.04 authorizing that person to operate as a salvage food distributor, which license may not be issued absent compliance with all the provisions of this section and all rules adopted under this section.\n[Repealed, 1974 c 2 s 8]\n(a) No salvage food processor shall sell distressed food for human food, animal feed, or seed without first notifying the commissioner who shall inspect and examine the distressed food and determine if it needs to be salvaged. If the commissioner determines that the distressed food is reconditionable or salvageable, the commissioner shall issue a stop sale order which shall require the distressed food to be held inviolate pending supervision of the reconditioning or salvaging of the distressed food by the commissioner. If distressed food is found to be in need of salvage and is salvageable, the commissioner shall direct it to be salvaged by any salvage food processor who holds a valid license and is duly authorized by the owner of the food or the owner's agent to salvage it, after which the salvaged food shall be released by the commissioner for sale. If it is found not to be salvageable for human food, it may be salvaged for animal feed or seed, unless it is not suitable for animal feed or seed, in which case the commissioner shall render such distressed food unsalable for use as human food, animal feed, or seed and order it disposed of under the commissioner's supervision.\n(b) No person shall offer for sale as human food any distressed food which has been diverted to animal feed or seed use or has been rendered unsalable as human food by the commissioner or the commissioner's assistants.\n(a) Any container of food with the label or mandatory information missing that cannot be identified and relabeled correctly must not be sold. When original labels are missing or illegible, relabeling or overlabeling is required.\n(b) All salvaged food, except as described in paragraph (e), shall be identified to indicate that the food has been salvaged by clearly marking the term \"salvaged food\" on all invoices, bills of lading, shipping invoices, receipts, and inventory records.\n(c) All persons selling salvaged food, at retail, except as described in paragraph (e), shall notify the consumer that the food is salvaged either by (1) labeling each retail package or container \"salvaged\" or \"reconditioned\" or (2) posting a conspicuous placard at the retail display location stating \"salvaged food\" or \"reconditioned food.\" Placards must be readable, using letters of not less than 1-1/2 inch type. Placards shall also state \"This item has been reconditioned and has been determined wholesome for human consumption under applicable state requirements by (name of food seller).\"\n(d) All salvaged food in containers must be provided with labels that comply with the requirements contained in this chapter and chapters 29, 30, 31A, 32, 33, and 34. If original labels are removed from containers that are to be resold or redistributed, the replacement labels must show as the distributor the name and address of the salvage food processor and the date of reconditioning for sale or distribution.\n(e) Paragraphs (b) and (c) do not apply to food products damaged in the normal course of handling and transportation, where the food is intact in its original container and has not been subject to fire, chemical spills, temperature abuse in perishable food products, immersion in water, or other similar risk of contamination.\n(f) The commissioner, in consultation with the commissioner of health, may adopt rules providing for the identification and labeling of food products pursuant to this subdivision.\nA written record or receipt of distressed, salvageable, and salvaged food must be kept by the salvage food processor and distributor for inspection by the commissioner during business hours. The records must include the name of the product, the source of the distressed food, the date received, the type of damage, the salvage process conducted, and the purchaser of the salvaged food. These records must be kept on the premises of the salvage food processor and distributor for a period of one year following the completion of transactions involving the food.\nThe provisions of this section do not apply to:\n(1) any food manufacturer, distributor, retailer, or processor who in the normal course of the business of manufacturing, processing, retailing, or distributing of food engages in the activities of reconditioning and salvaging distressed food manufactured, distributed or processed by or for that person and not purchased by that person solely for the purpose of reconditioning, salvaging, and sale;\n(2) any person who reassembles or disposes of undamaged food which is from lots in which food or packaging materials or containers are damaged in the normal course of commerce or while in that person's possession and which is not purchased by that person solely for the purpose of reconditioning, salvaging, and sale, or any common carrier or agent of the common carrier who disposes of or otherwise transfers undamaged or distressed food to a person exempt under this section or to a salvage food processor who holds a valid license under this section; or\n(3) any person who stores, handles or processes grain or oil seeds in the normal course of business except when such person purchases for the purpose of reconditioning, salvaging, and sale as human food grain or oil seeds contaminated by bird, rodent or animal excreta or by chemicals poisonous, injurious or detrimental to human life or health.",
	"repealed": false
}