{
	"id": "394.232",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.232",
	"title": "394.232 COMMUNITY-BASED PLANNING.",
	"text": "Each county is encouraged to prepare and implement a community-based comprehensive plan. A community-based comprehensive plan is a comprehensive plan that is consistent with the goals of community-based planning.\nNotice must be given at the beginning of the community-based comprehensive planning process to the Department of Natural Resources, the Department of Agriculture, the Department of Employment and Economic Development, the Board of Water and Soil Resources, the Pollution Control Agency, the Department of Transportation, local government units, and local citizens to actively participate in the development of the plan.\nA county that prepares a community-based comprehensive plan shall coordinate its plan with the plans of its neighbors and its constituent municipalities and towns in order both to prevent its plan from having an adverse impact on other jurisdictions and to complement plans of other jurisdictions. The county's community-based comprehensive plan must incorporate the community-based comprehensive plan of any municipality or town in the county prepared in accordance with section 462.3535. A county may incorporate a municipal or town community-based comprehensive plan by reference.\nUnder the joint exercise of powers provisions in section 471.59, a county may establish a joint planning district with other counties, municipalities, and towns, that are geographically contiguous, to adopt a single community-based comprehensive plan for the district. The county may delegate its authority to adopt official controls under this chapter to the board of the joint planning district.\nMS 2010 [Repealed by amendment, 2011 c 76 art 4 s 1]\nThe county board, or the board of the joint planning district, shall review and update the community-based comprehensive plan periodically, but at least every ten years. When updating the plan, the county board or the board of the joint planning district must consider natural heritage data resulting from the county biological survey. In a county that is not a greater than 80 percent area, as defined in section 103G.005, subdivision 10b, the board must consider adopting goals and objectives that will protect open space and the environment.\nMS 2010 [Repealed by amendment, 2011 c 76 art 4 s 1]\nNothing in this section shall be construed to prohibit or limit a county's authority to prepare and adopt a comprehensive plan and official controls under this chapter.",
	"repealed": false
}