{
	"id": "471.571",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.571",
	"title": "471.571 PERMANENT IMPROVEMENT FUND, CERTAIN CITIES.",
	"text": "This section applies to each city in which the net tax capacity of real and personal property consists in part of iron ore or lands containing taconite or semitaconite and in which the total estimated market value of real and personal property exceeds $2,500,000.\nThe governing body of the city may create a permanent improvement and replacement fund to be maintained by an annual tax levy. The governing body may levy a tax in excess of any charter limitation for the support of the permanent improvement and replacement fund, but not exceeding the following:\n(a) in cities having a population of not more than 500 inhabitants, the lesser of $20 per capita or 0.08059 percent of estimated market value;\n(b) in cities having a population of more than 500 and less than 2,500, the greater of $12.50 per capita or $10,000 but not exceeding 0.08059 percent of estimated market value;\n(c) in cities having a population of 2,500 or more inhabitants, the greater of $10 per capita or $31,500 but not exceeding 0.08059 percent of estimated market value.\nNo expenditure for any one project in excess of 60 percent of one year's levy or $25,000, whichever is greater, may be made from such permanent improvement or replacement fund in any year without first obtaining the approval of a majority of the voters voting at a general or special municipal election at which the question of making such expenditure has been submitted. In submitting any proposal to the voters for approval, the amount proposed to be spent and the purpose thereof shall be stated in the proposal submitted. The proceeds of such levies may be pledged for the payment of any bonds issued pursuant to law for any purposes authorized hereby and annual payments upon such bonds or interest may be made without additional authorization.\nWhen any such city shall be created by charter provision or otherwise any permanent improvement or replacement fund, the funds from the collection of taxes provided for in subdivision 2 shall be in addition to and in excess of any amount or limitations on the tax levies provided in any of its charter provisions.\nAny such city may use such fund for any permanent improvement authorized by law and for the betterment, including reconstruction, extension, major improvement or rehabilitation, or remodeling, of any public building or municipal facility, but not including ordinary current repairs thereto. Nothing herein shall restrict any powers which any city may have under existing law. In the event the moneys in said fund exceed the amounts necessary for any of the purposes for which such fund may be used, and the council shall adopt a resolution to that effect, the excess may be used for other authorized municipal purposes.",
	"repealed": false
}