{
	"id": "122A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.14",
	"title": "122A.14 DUTIES OF BOARD OF SCHOOL ADMINISTRATORS.",
	"text": "The board shall license school administrators. The board shall adopt rules to license school administrators under chapter 14. Other than the rules transferred to the board under section 122A.187, subdivision 1, the board may not adopt or amend rules under this section until the rules are approved by law. The rules shall include the licensing of persons who have successfully completed alternative preparation programs under section 122A.27 or other alternative competency-based preparation programs. The board may enter into agreements with the Professional Educator Licensing and Standards Board regarding multiple license matters.\nThe board shall review and approve or disapprove preparation programs for school administrators and alternative preparation programs for administrators under section 122A.27, and must consider other alternative competency-based preparation programs leading to licensure. Among other requirements, preparation programs must include instruction on meeting the varied needs of English learners, from young children to adults, in English and, where practicable, in students' native language.\nThe board shall adopt rules establishing continuing education requirements that promote continuous improvement and acquisition of new and relevant skills by school administrators. Continuing education programs, among other things, must provide school administrators with information and training about building coherent and effective English learner strategies that include relevant professional development, accountability for student progress, students' access to the general curriculum, and sufficient staff capacity to effect these strategies.\nThe board shall adopt by rule a code of ethics covering standards of professional practice, including ethical conduct, professional performance, and methods of enforcement, and advise school administrators in interpreting the code of ethics.\n[Repealed, 1Sp2017 c 5 art 3 s 36]\nThe executive director of the board shall keep a record of board proceedings and a register of all persons licensed under this chapter. The register must show the name, address, license number, and the renewal of the license. The board must on July 1 of each year, or as soon thereafter as is practicable, compile a list of licensed school administrators and transmit a copy of the list to the board. A copy of the register must be available during business hours at the office of the board to any interested person.\nThe commissioner shall provide all necessary materials and assistance for transacting board business and all money received by the board shall be paid into the state treasury as provided by law. The expenses of administering the Board of School Administrators shall be paid for from appropriations made to the Board of School Administrators.\nThe board must develop accountability measures for programs preparing students for licensure and report the progress of the programs to the legislature by January 15 of every other year beginning with the 2003 legislature.\nEach person licensed by the Board of School Administrators shall pay the board a fee of $100, collected each fiscal year. When transmitting notice of the license fee, the board also must notify the licensee of the penalty for failing to pay the fee within the time specified by the board. The board may provide a lower fee for persons on retired or inactive status. After receiving notice from the board, any licensed school administrator who does not pay the fee in the given fiscal year shall have all administrative licenses held by the person automatically suspended, without the right to a hearing, until the fee has been paid to the board. If the board suspends a licensed school administrator for failing to pay the fee, it must immediately notify the district currently employing the school administrator of the school administrator's suspension. The executive secretary shall deposit the fees in the general fund.\nBy December 31, 2018, and annually thereafter, the Board of School Administrators shall report and publish on its website the cumulative summary results of three years of data reported to the board under section 122A.091, subdivision 1, for each principal preparation program.",
	"repealed": false
}