{
	"id": "332B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.07",
	"title": "332B.07 RIGHT TO CANCEL.",
	"text": "(a) A debtor has the right to cancel a debt settlement services agreement without cause at any time upon ten days' written notice to the debt settlement services provider.\n(b) In the event of cancellation, the debt settlement services provider must, within ten days of the cancellation, notify the debtor's creditors with whom the debt settlement services provider is or has been, under the terms of the debt settlement agreement, in communication, of the cancellation and immediately refund all fees paid by the debtor to the debt settlement services provider that exceed the fees allowed under section 332B.09.\n(c) Upon cancellation, the debt settlement services provider must cease collection of any monthly fees beginning in the month following cancellation.\n(d) Notwithstanding paragraph (c), a debt settlement services provider is entitled to the full amount of the fees provided for in the debt settlement services agreement if the provider can show that:\n(1) the provider obtained a settlement offer from the creditor or creditors in accordance with the debt settlement services agreement;\n(2) the debtor rejected the settlement offer; or\n(3) within the period contemplated in the debt settlement services agreement, the debtor entered into a settlement agreement with the same creditor or creditors for an amount equal to or lower than the settlement offer obtained by the provider.\nA debt settlement services agreement must contain, on its face, in an easily readable type immediately adjacent to the space for signature by the debtor, the following notice: \"Right to Cancel: You have the right to cancel this contract at any time on ten days' written notice.\"\nUpon the payment of all listed or settled debts and fees, the debt settlement services agreement must automatically terminate, and all funds held by the debt settlement services provider that exceed the fees allowed under section 332B.09 must be immediately returned to the debtor.\n(a) A debt settlement services provider may cancel a debt settlement services agreement with good cause upon 30 days' written notice to the debtor.\n(b) Within ten days after the cancellation, the debt settlement services provider must notify the debtor's creditors with whom the debt settlement services provider is or has been, under the terms of the debt settlement services agreement, in communication, of the cancellation.\n(c) Upon cancellation, the debt settlement services provider must cease collection of any monthly fees beginning in the month following cancellation.",
	"repealed": false
}