{
	"id": "152.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.025",
	"title": "152.025 CONTROLLED SUBSTANCE CRIME IN THE FIFTH DEGREE.",
	"text": "A person is guilty of a controlled substance crime in the fifth degree and upon conviction may be sentenced as provided in subdivision 4 if the person unlawfully sells one or more mixtures containing a controlled substance classified in Schedule IV.\nA person is guilty of controlled substance crime in the fifth degree and upon conviction may be sentenced as provided in subdivision 4 if:\n(1) the person unlawfully possesses one or more mixtures containing a controlled substance classified in Schedule I, II, III, or IV, except cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products or a residual amount of one or more mixtures of controlled substances contained in drug paraphernalia; or\n(2) the person procures, attempts to procure, possesses, or has control over a controlled substance by any of the following means:\n(i) fraud, deceit, misrepresentation, or subterfuge;\n(ii) using a false name or giving false credit; or\n(iii) falsely assuming the title of, or falsely representing any person to be, a manufacturer, wholesaler, pharmacist, physician, doctor of osteopathic medicine licensed to practice medicine, dentist, podiatrist, veterinarian, or other authorized person for the purpose of obtaining a controlled substance.\n[Repealed, 2009 c 83 art 3 s 24]\n(a) A person convicted under the provisions of subdivision 2, clause (1), who has not been previously convicted of a violation of this chapter or a similar offense in another jurisdiction, is guilty of a gross misdemeanor if: (1) the amount of the controlled substance possessed, other than heroin, is less than 0.25 grams or one dosage unit or less if the controlled substance was possessed in dosage units; or (2) the controlled substance possessed is heroin and the amount possessed is less than 0.05 grams.\n(b) A person convicted under the provisions of subdivision 1; subdivision 2, clause (1), unless the conduct is described in paragraph (a); or subdivision 2, clause (2), may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(c) If a peace officer encounters a person who is suspected of violating this section, the peace officer may refer the person to a local service provider that can offer substance use assistance to the person. Upon request at the time of initial contact, a peace officer must, if practicable and available, provide a person suspected of violating this section with a referral to local service providers. For purposes of this paragraph, \"local service provider\" includes but is not limited to substance use disorder treatment and recovery providers, peer support groups and systems, homeless shelters, detoxification centers, hospital systems, mental health crisis centers, naloxone providers, syringe service providers, and harm reduction programs.",
	"repealed": false
}