{
	"id": "629.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.72",
	"title": "629.72 BAIL; DOMESTIC ABUSE; HARASSMENT; VIOLATION OF ORDER FOR PROTECTION; OR NO CONTACT ORDER.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Domestic abuse\" has the meaning given in section 518B.01, subdivision 2.\n(c) \"Harass\" and \"stalking\" have the meanings given in section 609.749.\n(d) \"Violation of a domestic abuse no contact order\" has the meaning given in section 629.75.\n(e) \"Violation of an order for protection\" has the meaning given in section 518B.01, subdivision 14.\n(f) \"Victim\" has the meaning in section 611A.01, paragraph (b).\n(a) Notwithstanding any other law or rule, an arresting officer may not issue a citation in lieu of arrest and detention to an individual charged with harassing or stalking, domestic abuse, violation of an order for protection, or violation of a domestic abuse no contact order.\n(b) Notwithstanding any other law or rule, an individual who is arrested on a charge of harassing or stalking any person, domestic abuse, violation of an order for protection, or violation of a domestic abuse no contact order, must be brought to the police station or county jail. The officer in charge of the police station or the county sheriff in charge of the jail shall issue a citation in lieu of continued detention unless it reasonably appears to the officer or sheriff that release of the person (1) poses a threat to the alleged victim or another family or household member, (2) poses a threat to public safety, or (3) involves a substantial likelihood the arrested person will fail to appear at subsequent proceedings.\n(c) If the arrested person is not issued a citation by the officer in charge of the police station or the county sheriff, the arrested person must be brought before the nearest available judge of the district court in the county in which the alleged harassing or stalking, domestic abuse, violation of an order for protection, or violation of a domestic abuse no contact order took place without unnecessary delay as provided by court rule.\n(a) The judge before whom the arrested person is brought shall review the facts surrounding the arrest and detention of a person arrested for domestic abuse, harassing or stalking, violation of an order for protection, or violation of a domestic abuse no contact order. The prosecutor or prosecutor's designee shall present relevant information involving the victim's or the victim's family's account of the alleged crime to the judge to be considered in determining the arrested person's release. In making a decision concerning pretrial release conditions of a person arrested for domestic abuse, harassing or stalking, violation of an order for protection, or violation of a domestic abuse no contact order, the judge shall review the facts of the arrest and detention of the person and determine whether: (1) release of the person poses a threat to the alleged victim, another family or household member, or public safety; or (2) there is a substantial likelihood the person will fail to appear at subsequent proceedings. Before releasing a person arrested for or charged with a crime of domestic abuse, harassing or stalking, violation of an order for protection, or violation of a domestic abuse no contact order, the judge shall make findings on the record, to the extent possible, concerning the determination made in accordance with the factors specified in clauses (1) and (2).\n(b) The judge may impose conditions of release or bail, or both, on the person to protect the alleged victim or other family or household members and to ensure the appearance of the person at subsequent proceedings. These conditions may include an order:\n(1) enjoining the person from threatening to commit or committing acts of domestic abuse or harassing or stalking against the alleged victim or other family or household members or from violating an order for protection or a domestic abuse no contact order;\n(2) prohibiting the person from harassing, annoying, telephoning, contacting, or otherwise communicating with the alleged victim, either directly or indirectly;\n(3) directing the person to vacate or stay away from the home of the alleged victim and to stay away from any other location where the alleged victim is likely to be;\n(4) prohibiting the person from possessing a firearm or other weapon specified by the court;\n(5) prohibiting the person from possessing or consuming alcohol or controlled substances; and\n(6) specifying any other matter required to protect the safety of the alleged victim and to ensure the appearance of the person at subsequent proceedings.\n(c) If conditions of release are imposed, the judge shall issue a written order for conditional release. The court administrator shall immediately distribute a copy of the order for conditional release to the agency having custody of the arrested person and shall provide the agency having custody of the arrested person with any available information on the location of the victim in a manner that protects the victim's safety. Either the court or its designee or the agency having custody of the arrested person shall serve upon the defendant a copy of the order. Failure to serve the arrested person with a copy of the order for conditional release does not invalidate the conditions of release.\n(d) If the judge imposes as a condition of release a requirement that the person have no contact with the alleged victim, the judge may also, on its own motion or that of the prosecutor or on request of the victim, issue an ex parte temporary restraining order under section 609.748, subdivision 4, or an ex parte temporary order for protection under section 518B.01, subdivision 7. Notwithstanding section 518B.01, subdivision 7, paragraph (b), or 609.748, subdivision 4, paragraph (c), the temporary order is effective until the defendant is convicted or acquitted, or the charge is dismissed, provided that upon request the defendant is entitled to a full hearing on the restraining order under section 609.748, subdivision 5, or on the order for protection under section 518B.01. The hearing must be held within seven days of the defendant's request.\n(a) Until the commissioner of corrections has adopted standards governing electronic monitoring devices used to protect victims of domestic abuse, the court, as a condition of release, may not order a person arrested for a crime described in section 609.135, subdivision 5a, paragraph (b), to use an electronic monitoring device to protect a victim's safety.\n(b) Notwithstanding paragraph (a), the chief judge of a judicial district may appoint and convene an advisory group comprised of representatives from law enforcement, prosecutors, defense attorneys, corrections, court administrators, judges, and battered women's organizations to develop standards for the use of electronic monitoring and global positioning system devices to protect victims of domestic abuse and for evaluating the effectiveness of electronic monitoring. After the advisory group does this, the chief judge, in consultation with the advisory group, may conduct a pilot project for implementation of the electronic monitoring standards. A judicial district that conducts a pilot project shall report on the standards and the pilot project to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over criminal justice policy and the state court administrator's office.\n[See Note.]\nIf the arrested person is not issued a citation by the officer in charge of the police station or the county sheriff pursuant to subdivision 1, and is not brought before a judge within the time limits prescribed by court rule, the arrested person shall be released by the arresting authorities, and a citation must be issued in lieu of continued detention.\nIf a restraining order is issued under section 609.748 or an order for protection is issued under section 518B.01 while the arrested person is still in detention, the order must be served upon the arrested person during detention if possible.\nThe judge who released the arrested person shall issue a warrant directing that the person be arrested and taken immediately before the judge, if the judge:\n(1) receives an application alleging that the arrested person has violated the conditions of release; and\n(2) finds that probable cause exists to believe that the conditions of release have been violated.\n(a) Immediately after issuance of a citation in lieu of continued detention under subdivision 1, or the entry of an order for release under subdivision 2, but before the arrested person is released, the agency having custody of the arrested person or its designee must make a reasonable and good faith effort to inform orally the alleged victim, local law enforcement agencies known to be involved in the case, if different from the agency having custody, and, at the victim's request any local battered women's and domestic abuse programs established under section 611A.32 or sexual assault programs of:\n(1) the conditions of release, if any;\n(2) the time of release;\n(3) the time, date, and place of the next scheduled court appearance of the arrested person and the victim's right to be present at the court appearance; and\n(4) if the arrested person is charged with domestic abuse, the location and telephone number of the area program that provides services to victims of domestic abuse as designated by the Office of Justice Programs in the Department of Public Safety.\n(b) As soon as practicable after an order for conditional release is entered, the agency having custody of the arrested person or its designee must personally deliver or mail to the alleged victim a copy of the written order and written notice of the information in paragraph (a), clauses (2) and (3).\n(c) Data on the victim and the notice provided by the custodial authority are private data on individuals as defined in section 13.02, subdivision 12, and are accessible only to the victim.\n(a) When a person arrested for or a juvenile detained for domestic assault or harassing or stalking is scheduled to be reviewed under subdivision 2 for release from pretrial detention, the court shall make a reasonable good faith effort to notify the victim of the alleged crime.\n(b) The notification must include:\n(1) the date and approximate time of the review;\n(2) the location where the review will occur;\n(3) the name and telephone number of a person that can be contacted for additional information; and\n(4) a statement that the victim may attend the review.",
	"repealed": false
}