{
	"id": "13.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.06",
	"title": "13.06 TEMPORARY CLASSIFICATION.",
	"text": "(a) Notwithstanding the provisions of section 13.03, the responsible authority of a government entity may apply to the commissioner for permission to classify data or types of data on individuals as private or confidential, or data not on individuals as nonpublic or protected nonpublic, for its own use and for the use of other similar government entities on a temporary basis until a proposed statute can be acted upon by the legislature. The application for temporary classification is public.\n(b) Upon receipt by the commissioner of an application for temporary classification, the data which is the subject of the application shall be deemed to be classified as set forth in the application for a period of 45 days, or until the application is disapproved, rejected, or granted by the commissioner, whichever is earlier.\n(c) If the commissioner determines that an application has been submitted for purposes not consistent with this section, the commissioner may immediately reject the application, give notice of that rejection to the applicant, and return the application. When the applicant receives the notice of rejection from the commissioner, the data which was the subject of the application shall have the classification it had before the application was submitted to the commissioner.\n[Repealed, 2010 c 365 art 1 s 12]\nAn application for temporary classification of government data shall include and the applicant shall have the burden of clearly establishing that no statute currently exists which either allows or forbids classification as not public; and one or more of the following:\n(1) that data similar to that for which the temporary classification is sought have been classified as not public by other government entities; or\n(2) public access to the data would render unworkable a program authorized by law.\nThe applicant must also clearly establish that a compelling need exists for immediate temporary classification, which if not granted could adversely affect the health, safety, or welfare of the public, or the data subject's well-being or reputation.\nIf the commissioner determines that an application for temporary classification involves data which would reasonably be classified in the same manner by all government entities similar to the one which made the application, the commissioner may approve or disapprove the classification for data of the kind which is the subject of the application for the use of all government entities similar to the applicant. If requested in the application, the commissioner may also determine that the data classification affects similar government entities. On deeming this approach advisable, the commissioner shall provide notice of the proposed action by publication in the State Register within 15 days of receiving the application. Within 30 days after publication in the State Register an affected government entity or the public may submit comments on the application. The commissioner shall consider any comments received when granting or denying a classification for data of the kind which is the subject of the application, for the use of all government entities similar to the applicant. Within 45 days after the close of the period for submitting comment, the commissioner shall grant or disapprove the application. Applications processed under this subdivision shall be either approved or disapproved by the commissioner within 90 days of the receipt of the application. For purposes of subdivision 1, the data which is the subject of the classification shall be deemed to be classified as set forth in the application for a period of 90 days, or until the application is disapproved or granted by the commissioner, whichever is earlier. Proceedings after the grant or disapproval shall be governed by the provisions of subdivision 5.\nExcept when an application is processed under subdivision 4, an application may be withdrawn by the responsible authority prior to the commissioner granting or disapproving the temporary classification. The responsible authority shall notify the commissioner in writing of the entity's intent to withdraw the application. The written withdrawal must state the reason the temporary classification is no longer necessary and must be signed by the responsible authority.\n(a) The commissioner shall either grant or disapprove the application for temporary classification within 45 days after it is received by the commissioner. On disapproving an application, the commissioner shall set forth in detail reasons for the disapproval, and shall include a statement of belief as to what classification is appropriate for the data which is the subject of the application. Twenty days after the date the responsible authority receives the commissioner's disapproval of an application, the data which is the subject of the application shall become public data, unless the responsible authority submits an amended application for temporary classification which requests the classification deemed appropriate by the commissioner in the statement of disapproval or which sets forth additional information relating to the original proposed classification. Upon the filing of an amended application, the data which is the subject of the amended application shall be deemed to be classified as set forth in the amended application for a period of 20 days or until the amended application is granted or disapproved by the commissioner, whichever is earlier. The commissioner shall either grant or disapprove the amended application within 20 days after it is filed. Five working days after the date the responsible authority receives the commissioner's disapproval of the amended application, the data which is the subject of the application shall become public data. No more than one amended application may be submitted for any single file or system.\n(b) If the commissioner grants an application for temporary classification under this section, it shall become effective immediately, and the complete record relating to the application shall be submitted to the attorney general, who shall review the classification as to form and legality. Within 25 days after receipt of the record, the attorney general shall approve the classification, disapprove a classification as confidential or protected nonpublic but approve a classification as private or nonpublic, or disapprove the classification. If the attorney general disapproves a classification, the data which is the subject of the classification shall become public data five working days after the date of the attorney general's disapproval.\n[Repealed, 1995 c 259 art 1 s 62]\nDuring the period of the temporary classification, a responsible authority may request approval from the commissioner for a new or different use or dissemination of the data as provided in section 13.05, subdivision 4, for any data temporarily classified under this section.\nOn or before January 15 of each year, the commissioner shall submit all temporary classifications in effect on January 1 in bill form to the legislature. The temporary classification expires August 1 of the year following its submission to the legislature.",
	"repealed": false
}