{
	"id": "518A.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.74",
	"title": "518A.74 PUBLICATION OF NAMES OF DELINQUENT CHILD SUPPORT OBLIGORS.",
	"text": "At least once each year, the commissioner of children, youth, and families, in consultation with the attorney general, may publish a list of the names and other identifying information of no more than 25 persons who (1) are child support obligors, (2) are at least $10,000 in arrears, (3) are not in compliance with a written payment agreement regarding both current support and arrearages approved by the court, a child support magistrate, or the public authority, (4) cannot currently be located by the public authority for the purposes of enforcing a support order, and (5) have not made a support payment except tax intercept payments, in the preceding 12 months.\nIdentifying information may include the obligor's name, last known address, amount owed, date of birth, photograph, the number of children for whom support is owed, and any additional information about the obligor that would assist in identifying or locating the obligor. The commissioner and attorney general may use posters, media presentations, electronic technology, and other means that the commissioner and attorney general determine are appropriate for dissemination of the information, including publication on the Internet. The commissioner and attorney general may make any or all of the identifying information regarding these persons public. Information regarding an obligor who meets the criteria in this subdivision will only be made public subsequent to that person's selection by the commissioner and attorney general.\nBefore making public the name of the obligor, the Department of Children, Youth, and Families shall send a notice to the obligor's last known address which states the department's intention to make public information on the obligor. The notice must also provide an opportunity to have the obligor's name removed from the list by paying the arrearage or by entering into an agreement to pay the arrearage, or by providing information to the public authority that there is good cause not to make the information public. The notice must include the final date when the payment or agreement can be accepted.\nThe Department of Children, Youth, and Families shall obtain the written consent of the obligee to make the name of the obligor public.\nIf the commissioner makes public a name under subdivision 1 which is in error, the commissioner must also offer to publish a printed retraction and a public apology acknowledging that the name was made public in error. If the person whose name was made public in error elects the public retraction and apology, the retraction and apology must appear in the same medium and the same format as the original notice with the name listed in error. In addition to the right of a public retraction and apology, a person whose name was made public in error has a civil action for damages caused by the error.",
	"repealed": false
}