{
	"id": "403.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.113",
	"title": "403.113 ENHANCED 911 SERVICE COSTS; FEE.",
	"text": "A portion of the fee collected under section 403.11 must be used to fund implementation, operation, maintenance, enhancement, and expansion of enhanced 911 service, including acquisition of necessary equipment and the costs of the commissioner to administer the program.\n(a) After payment of the costs of the commissioner to administer the program, the commissioner shall distribute the money collected under this section as follows:\n(1) one-half of the amount equally to all qualified counties, and after October 1, 1997, to all qualified counties, existing ten public safety answering points operated by the Minnesota State Patrol, and each governmental entity operating the individual public safety answering points serving the Metropolitan Airports Commission, the Red Lake Indian Reservation, and the University of Minnesota Police Department; and\n(2) the remaining one-half to qualified counties and cities with existing 911 systems based on each county's or city's percentage of the total population of qualified counties and cities. The population of a qualified city with an existing system must be deducted from its county's population when calculating the county's share under this clause if the city seeks direct distribution of its share.\n(b) A county's share under subdivision 1 must be shared pro rata between the county and existing city systems in the county. A county or city or other governmental entity as described in paragraph (a), clause (1), shall deposit money received under this subdivision in an interest-bearing fund or account separate from the governmental entity's general fund and may use money in the fund or account only for the purposes specified in subdivision 3.\n(c) A county or city or other governmental entity as described in paragraph (a), clause (1), is not qualified to share in the distribution of money for enhanced 911 service if it has not implemented enhanced 911 service before December 31, 1998.\n(d) For the purposes of this subdivision, \"existing city system\" means a city 911 system that provides at least basic 911 service and that was implemented on or before April 1, 1993.\n(a) Money distributed under subdivision 2 for enhanced 911 service may be spent on enhanced 911 system costs for the purposes stated in subdivision 1. In addition, money may be spent to lease, purchase, lease-purchase, or maintain enhanced 911 equipment, including telephone equipment; recording equipment; computer hardware; computer software for database provisioning, addressing, mapping, and any other software necessary for automatic location identification or local location identification; trunk lines; selective routing equipment; the master street address guide; dispatcher public safety answering point equipment proficiency and operational skills; pay for long-distance charges incurred due to transferring 911 calls to other jurisdictions; and the equipment necessary within the public safety answering point for community alert systems and to notify and communicate with the emergency services requested by the 911 caller.\n(b) Money distributed for enhanced 911 service may not be spent on:\n(1) purchasing or leasing of real estate or cosmetic additions to or remodeling of communications centers;\n(2) mobile communications vehicles, fire engines, ambulances, law enforcement vehicles, or other emergency vehicles;\n(3) signs, posts, or other markers related to addressing or any costs associated with the installation or maintenance of signs, posts, or markers.\nEach county and city or other governmental entity as described in subdivision 2, paragraph (a), clause (1), shall conduct an annual audit on the use of funds distributed to it for enhanced 911 service. A copy of each audit report must be submitted to the commissioner.\nMS 2000 [Repealed, 2002 c 372 s 21]",
	"repealed": false
}