{
	"id": "62S.268",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.268",
	"title": "62S.268 ADDITIONAL STANDARDS FOR BENEFIT TRIGGERS FOR QUALIFIED LONG-TERM CARE INSURANCE CONTRACTS.",
	"text": "For purposes of this section, the following terms have the meanings given them:\n(a) \"Qualified long-term care services\" means services that meet the requirements of section 7702(c)(1) of the Internal Revenue Code of 1986, as amended, as follows: necessary diagnostic, preventive, therapeutic, curative, treatment, mitigation, and rehabilitative services, and maintenance or personal care services which are required by a chronically ill individual, and are provided pursuant to a plan of care prescribed by a licensed health care practitioner.\n(b) \"Chronically ill individual\" has the meaning prescribed for this term by section 7702B(c)(2) of the Internal Revenue Code of 1986, as amended. Under this provision, a chronically ill individual means any individual who has been certified by a licensed health care practitioner as being unable to perform, without substantial assistance from another individual, at least two activities of daily living for a period of at least 90 days due to a loss of functional capacity, or requiring substantial supervision to protect the individual from threats to health and safety due to severe cognitive impairment.\nThe term \"chronically ill individual\" does not include an individual otherwise meeting these requirements unless within the preceding 12-month period a licensed health care practitioner has certified that the individual meets these requirements.\n(c) \"Licensed health care practitioner\" means a physician, as defined in section 1861(r)(1) of the Social Security Act, an advanced practice registered nurse, a physician assistant, a registered professional nurse, a licensed social worker, or other individual who meets requirements prescribed by the Secretary of the Treasury.\n(d) \"Maintenance or personal care services\" means any care the primary purpose of which is the provision of needed assistance with any of the disabilities as a result of which the individual is a chronically ill individual, including the protection from threats to health and safety due to severe cognitive impairment.\nA qualified long-term care insurance contract shall pay only for qualified long-term care services received by a chronically ill individual provided pursuant to a plan of care prescribed by a licensed health care practitioner.\nA qualified long-term care insurance contract shall condition the payment of benefits on a determination of the insured's inability to perform activities of daily living for an expected period of at least 90 days due to a loss of functional capacity or to severe cognitive impairment.\n(a) Certifications regarding activities of daily living and cognitive impairment required pursuant to subdivision 3 shall be performed by the following licensed or certified professionals: physicians, registered professional nurses, licensed social workers, or other individuals who meet requirements prescribed by the Secretary of the Treasury.\n(b) Certifications required pursuant to subdivision 3 may be performed by a licensed health care professional at the direction of the carrier as is reasonably necessary with respect to a specific claim, except that when a licensed health care practitioner has certified that an insured is unable to perform activities of daily living for an expected period of at least 90 days due to a loss of functional capacity and the insured is in claim status, the certification may not be rescinded and additional certifications may not be performed until after the expiration of the 90-day period.\nQualified long-term care insurance contracts must include a clear description of the process for appealing and resolving disputes with respect to benefit determinations.",
	"repealed": false
}