{
	"id": "325F.078",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.078",
	"title": "325F.078 SALES OF AEROSOL DUSTERS CONTAINING 1,1- DIFLUOROETHANE (DFE).",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Aerosol duster\" means a product used to clean electronics and other items by means of an aerosol sprayed from a pressurized container.\n(c) \"Behind-the-counter\" means placement by a retailer of a product to ensure that customers do not have direct access to the product before a sale is made, requiring the seller to deliver the product directly to the buyer.\n(d) \"DFE\" or \"1,1-difluoroethane\" means a chemical with a Chemicals Abstract Service Registry Number of 75-37-6.\nA retailer must only sell an aerosol duster that contains DFE:\n(1) from behind the counter;\n(2) to a purchaser who presents valid evidence that the purchaser is at least 21 years of age; and\n(3) in a quantity that complies with the purchasing limit established in subdivision 3.\n(a) A retailer is prohibited from selling more than three cans of an aerosol duster containing DFE to a customer in a single transaction.\n(b) A retailer is prohibited from selling aerosol dusters containing DFE through same-day pickup services or same-day delivery services.\n(a) Subdivisions 2 and 3 do not apply to a business purchasing aerosol dusters online.\n(b) Office wholesalers can sell more than three cans of aerosol dusters containing DFE to a business they have a contract with.\n(a) An aerosol duster manufactured after May 31, 2025, must not be sold in this state unless the aerosol duster clearly warns against the dangers of intentionally misusing duster aerosol products.\n(b) The font size of this warning shall be the same or larger than other warning language. The font color and background of the label must be in contrasting colors.\n(c) The label on each can of aerosol duster containing DFE must contain the following:\n(1) the words \"DANGER: DEATH! Breathing this product to get high can kill you!\"; and\n(2) the poison control phone number, 1-800-222-1222.\n(d) In order to comply with paragraph (a), a label may include, but is not limited to the words:\n(1) \"Deliberate misuse by concentrating and inhaling the contents can be harmful or fatal!\"; and\n(2) \"Intentional misuse by deliberately concentrating and inhaling the vapors can be harmful or fatal!\".\n(e) The safety symbols and color standards of the label described in this section must conform with the ANSI Z535 safety signage standards guidelines established by the American National Standards Institute.\n(a) A person who violates subdivision 2 or 3 is guilty of a misdemeanor.\n(b) It is an affirmative defense to a charge under subdivision 2, clause (2), if the defendant proves by a preponderance of the evidence that the defendant reasonably and in good faith relied on proof of age as described in section 340A.503, subdivision 6.",
	"repealed": false
}