{
	"id": "515B.2-124",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-124",
	"title": "515B.2-124 SEVERANCE OF COMMON INTEREST COMMUNITY.",
	"text": "(a) Unless the declaration provides otherwise, a part of a common interest community containing one or more units, with or without common elements, may be severed from the common interest community, subject to the requirements of this section. Subject to any additional requirements contained in the declaration, the severance shall be approved in a written severance agreement complying with this section, executed by:\n(1) unit owners entitled to cast at least 67 percent of the votes in the association, which approval shall include the approval of unit owners entitled to cast a majority of the votes allocated to units in the remaining common interest community and the approval of unit owners entitled to cast a majority of the votes allocated to units in the part of the common interest community being severed;\n(2) declarant until the earlier of five years after the recording of the declaration or the time at which declarant no longer owns an unsold unit; and\n(3) in the case of a cooperative, all holders of mortgages or contracts for deed on the entire real estate constituting the cooperative.\n(b) The declaration may specify a smaller percentage for unit owner approval only if all of the units are restricted to nonresidential use.\n(c) The severance agreement shall specify a severance date by which the severance of the common interest community shall be accomplished, after which the severance agreement is void. The severance agreement shall be deemed to grant to the association a power of attorney coupled with an interest to effect the severance of the common interest community on behalf of the unit owners and the holders of all other interests in the units, including without limitations the power to execute the amendment to the declaration, any instruments of conveyance, and all related instruments.\n(d) The severance agreement shall:\n(1) Approve an amendment to the declaration complying with this chapter, in substantially the same form to be recorded, and an amendment to the CIC plat if required. The declaration amendment shall, at a minimum, (i) legally describe the real estate constituting the remaining common interest community and the real estate being severed, (ii) restate the number of units in the remaining common interest community, (iii) reallocate the interests of the unit owners in the remaining common interest community among the remaining units in accordance with the allocation formula set forth in the declaration, and (iv) recite any easements to which the severed portion of the common interest community remains subject.\n(2) Approve an amendment to the articles of incorporation and bylaws of the remaining common interest community, if necessary.\n(3) Authorize the association to execute and record the amended declaration, articles of incorporation or bylaws on behalf of the unit owners and all other persons holding an interest in the remaining common interest community, and to take other actions necessary to accomplish the severance of the common interest community.\n(4) Allocate the assets and liabilities of the association between the association and (i) a new association formed pursuant to subsection (g), or (ii) the owners of the units being severed, subject to a lien against their interest in the severed real estate or their share in the assets of the association in favor of any person that held a security interest in their unit.\n(5) If the units that are being severed from the common interest community will not be included in a new common interest community that is (i) formed simultaneously with the severance of the common interest community, and (ii) includes all of the units and substantially all of the common elements being severed, then the agreement shall contain the written consent of holders of first mortgages on all units that are being severed, and shall describe in detail the proposed disposition of all real estate to be severed and all assets of the association allocated to the severed units, and the distribution of the proceeds of the disposition, if any, consistent with subsection (i).\n(e) The severance agreement or a memorandum of it shall be recorded in every county in which a part of the common interest community is located. The recording of the severance agreement or memorandum of it shall, from the date of recording, constitute notice to all persons subsequently acquiring an interest in the common interest community that the common interest community is being severed, and that those persons acquire their interests subject to the terms and conditions contained in the severance agreement and the amendment to the declaration.\n(f) The amendment to the declaration of the remaining common interest community shall be recorded on or before the severance date or the severance agreement and the amendment to the declaration are void as of the day after the severance date. The recording of the amendment to the declaration shall complete the severance of the common interest community and release the severed part of the common interest community from the declaration without further action by any person.\n(g) If the units that are being severed from the common interest community will be included in a new common interest community, then unit owners entitled to cast at least 80 percent of the votes allocated by the existing declaration to these units shall approve a new declaration, articles of incorporation and bylaws to govern the new common interest community no later than the date of the severance agreement. However, the new declaration shall not create, increase, or extend special declarant rights, increase the number of units, change unit boundaries, change the formula for allocations of interests, change the use of a unit from residential to nonresidential or conversely, or change the form of common interest community, unless agreed to in writing by all owners whose units are being severed. The new declaration shall be recorded simultaneously with the amendment to the existing declaration. The articles of incorporation creating the association intended to govern the new common interest community shall be filed with the secretary of state and the unit owners whose units are being severed shall elect a board of directors to act on behalf of the new association before the recording of the new declaration. The new association shall have a power of attorney coupled with an interest to execute and record the new declaration, any instruments of conveyance, and all related instruments on behalf of the unit owners whose units are being severed from the common interest community, but shall not thereby acquire any rights or obligations of a declarant. The board of directors of the new association shall cooperate with the board of directors of the existing association to complete the severance. The existing association shall retain all authority to act on behalf of the common interest community until the amendment to the existing declaration and the new declaration are recorded.\n(h) The legal descriptions of the real estate constituting (i) the remaining common interest community, and (ii) the severed portion of the common interest community shall, at the time of recording of the amendment to the declaration referred to in subsection (e), be as follows:\n(1) In a planned community using a CIC plat that complies with section 515B.2-110, subsection (d), the lot and block descriptions contained in the CIC plat, and any amendments to it, with respect to (i) the remaining common interest community, and (ii) the severed portion of the common interest community.\n(2) In a condominium, or cooperative or planned community using a CIC plat that complies with section 515B.2-110, subsection (c), (i) the CIC plat description relating to the remaining common interest community, and (ii) the part of the underlying legal description of the real estate in the declaration creating the common interest community, and any amendments to it, relating to the severed part of the common interest community.\n(3) The recording officer for each county in which the common interest community is located shall index the property located in that county in its records under the legal descriptions required by this subsection as of the date of recording of the amendment to the declaration. In the case of registered property, the registrar of titles shall cancel the existing certificates of title for the severed part of the common interest community and issue certificates of title for the property using the legal descriptions required by this subsection.\n(i) In a condominium or planned community, if the severed part of the common interest community is not to be reconstituted as a new common interest community following severance, title to all the real estate in the severed part of the common interest community vests in the unit owners of the units being severed, upon severance, as provided in the severance agreement.\n(j) No common interest community shall be severed in such a manner as to materially impair access, utility services, communication services, or other essential services with respect to either the remaining common interest community or the severed part of the common interest community.",
	"repealed": false
}