{
	"id": "273.1315",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1315",
	"title": "273.1315 CERTIFICATION OF CLASS 1B PROPERTY.",
	"text": "Any property owner seeking classification and assessment of the owner's homestead as class 1b property pursuant to section 273.13, subdivision 22, paragraph (b), on or before October 1, 2008, shall file with the commissioner of revenue a 1b homestead declaration, on a form prescribed by the commissioner. The declaration shall contain the following information:\n(1) the information necessary to verify that on or before June 30 of the filing year, the property owner or the owner's spouse satisfies the requirements of section 273.13, subdivision 22, paragraph (b), for 1b classification; and\n(2) any additional information prescribed by the commissioner.\nThe declaration must be filed on or before October 1 to be effective for property taxes payable during the succeeding calendar year. The declaration and any supplementary information received from the property owner pursuant to this subdivision shall be subject to chapter 270B. If approved by the commissioner, the declaration remains in effect until the property no longer qualifies under section 273.13, subdivision 22, paragraph (b). Failure to notify the commissioner within 30 days that the property no longer qualifies under that paragraph because of a sale, change in occupancy, or change in the status or condition of an occupant shall result in the penalty provided in section 273.124, subdivision 13b, computed on the basis of the class 1b benefits for the property, and the property shall lose its current class 1b classification.\nThe commissioner shall provide to the assessor on or before November 1 a listing of the parcels of property qualifying for 1b classification.\n(a) Any property owner seeking classification and assessment of the owner's homestead as class 1b property pursuant to section 273.13, subdivision 22, paragraph (b), after October 1, 2008, shall file with the county assessor a class 1b homestead declaration, on a form prescribed by the commissioner of revenue. The declaration must contain the following information:\n(1) the information necessary to verify that, on or before June 30 of the filing year, the property owner or the owner's spouse satisfies the requirements of section 273.13, subdivision 22, paragraph (b), for class 1b classification; and\n(2) any additional information prescribed by the commissioner.\n(b) The declaration must be filed on or before October 1 to be effective for property taxes payable during the succeeding calendar year. The Social Security numbers, individual taxpayer identification numbers, and income and medical information received from the property owner pursuant to this subdivision are private data on individuals as defined in section 13.02. If approved by the assessor, the declaration remains in effect until the property no longer qualifies under section 273.13, subdivision 22, paragraph (b). Failure to notify the assessor within 30 days that the property no longer qualifies under that paragraph because of a sale, change in occupancy, or change in the status or condition of an occupant shall result in the penalty provided in section 273.124, subdivision 13b, computed on the basis of the class 1b benefits for the property, and the property shall lose its current class 1b classification.",
	"repealed": false
}