{
	"id": "500.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.19",
	"title": "500.19 DIVISION.",
	"text": "Estates, in respect to the number and connection of their owners, are divided into estates in severalty, in joint tenancy, and in common; the nature and properties of which, respectively, shall continue to be such as are now established by law, except so far as the same may be modified by the provisions of this chapter.\nAll grants and devises of lands, made to two or more persons, shall be construed to create estates in common, and not in joint tenancy, unless expressly declared to be in joint tenancy. This subdivision shall not apply to mortgages, nor to devises or grants made in trust, or to executors.\nThe common law requirement for unity of time, title, interest, and possession in the creation of a joint tenancy is abolished.\n(a) Subject to section 507.02 specifying when both spouses must join in a conveyance of their homestead, one or more owners of an interest in real estate may convey all or part of the interest directly to one or more other persons or to one or more of themselves, or to any combination of one or more of themselves and other persons.\n(b) Subject to section 507.02 specifying when both spouses must join in a conveyance of their homestead, conveyances between spouses are allowed under paragraph (a) to the same extent as those between unmarried persons.\nA severance of a joint tenancy interest in real estate by a joint tenant shall be legally effective only if (1) the instrument of severance is recorded in the office of the county recorder or the registrar of titles in the county where the real estate is situated; or (2) the instrument of severance is executed by all of the joint tenants; or (3) the severance is ordered by a court of competent jurisdiction; or (4) a severance is effected pursuant to bankruptcy of a joint tenant.\nA decree of dissolution of a marriage severs all joint tenancy interests in real estate between the parties to the marriage, except to the extent the decree declares that the parties continue to hold an interest in real estate as joint tenants.",
	"repealed": false
}