{
	"id": "204D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.08",
	"title": "204D.08 STATE PRIMARY BALLOTS.",
	"text": "Except as provided in this section, state primary ballots shall be printed in the same manner as state general election ballots as far as practicable. A sufficient number shall be printed for each precinct and ward in the state.\nThe secretary of state shall adopt rules for the format and preparation of the state primary ballot.\nAt a primary election, no blank lines shall be provided for writing in the names of individuals whose names do not appear on the primary ballot.\nOn state primary ballots the name of each candidate for nomination to a partisan or nonpartisan office shall be rotated with the names of the other candidates for nomination to that office so that the name of each candidate appears substantially an equal number of times at the top, at the bottom, and at each intermediate place in that group of candidates. If the number of candidates for an office is equal to or less than the number to be elected, no rotation of candidate names is required and the official preparing the ballot shall determine the position of the candidates by lot.\nThe state partisan primary ballot shall be headed by the words \"State Partisan Primary Ballot.\" The ballot shall be printed on white paper. There must be at least three vertical columns on the ballot and each major political party shall have a separate column headed by the words \".......... Party,\" giving the party name. Above the party names, the following statement shall be printed.\n\"Minnesota Election Law permits you to vote for the candidates of only one political party in a state partisan primary election.\"\nIf there are only two major political parties to be listed on the ballot, one party must occupy the left-hand column, the other party must occupy the right-hand column, and the center column must contain the following statement:\n\"Do not vote for candidates of more than one party.\"\nThe names of the candidates seeking the nomination of each major political party shall be listed in that party's column. If only one individual files an affidavit of candidacy seeking the nomination of a major political party for an office, the name of that individual shall be placed on the state partisan primary ballot at the appropriate location in that party's column.\nIn each column, the candidates for senator in Congress shall be listed first, candidates for representative in Congress second, candidates for state senator third, candidates for state representative fourth and then candidates for state office in the order specified by the secretary of state. Vacant offices being filled by special election must be listed with other offices of that type, but after any office of that type for which a candidate will be elected for a full term.\nThe party columns shall be substantially the same in width, type, and appearance. The columns shall be separated by a 12-point solid line.\nThe names of candidates for nomination of the major political party that received the smallest average vote at the last state general election must be placed in the first column on the left side of the ballot. The names of candidates for nomination of the major political party that received the next smallest average vote at the last state general election must be placed in the second column, and so on. The average vote shall be computed in the manner provided in section 204D.13, subdivision 2.\nThe state and county nonpartisan primary ballot shall be headed \"State and County Nonpartisan Primary Ballot.\" It shall be printed in the manner provided in the rules of the secretary of state. The names of candidates for nomination to the supreme court, court of appeals, district court, all county offices, all city offices, and all school district offices shall be placed on this ballot.\nNo candidate whose name is placed on the state and county nonpartisan primary ballot shall be designated or identified as the candidate of any political party or in any other manner except as expressly provided by law.",
	"repealed": false
}