{
	"id": "60E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/60E.04",
	"title": "60E.04 RISK RETENTION GROUPS NOT CHARTERED IN THIS STATE.",
	"text": "Risk retention groups chartered and licensed in states other than this state and seeking to do business as a risk retention group in this state must observe and abide by the laws of this state as set forth in subdivisions 2 to 12.\n(a) Before offering insurance in this state, a risk retention group shall submit to the commissioner on a form prescribed by the NAIC:\n(1) a statement identifying the state or states in which the risk retention group is chartered and licensed as a liability insurance company, date of chartering, its principal place of business, and other information including information on its membership, the commissioner may require to verify that the risk retention group is qualified under section 60E.02, subdivision 12;\n(2) a copy of its plan of operations or a feasibility study and revisions of the plan or study submitted to the state in which the risk retention group is chartered and licensed; provided, however, that the provision relating to the submission of a plan of operation or a feasibility study shall not apply with respect to a line or classification of liability insurance that was defined in the Product Liability Risk Retention Act of 1981 before October 27, 1986, and was offered before that date by a risk retention group that had been chartered and operating for not less than three years before that date.\n(b) The risk retention group shall submit a copy of any revision to its plan of operation or feasibility study required by section 60E.03 at the same time that the revision is submitted to the commissioner of its chartering state.\n(c) The risk retention group shall submit a statement of registration, for which a filing fee shall be determined by the commissioner, that designates the commissioner as its agent for the purpose of receiving service of legal documents or process.\nA risk retention group doing business in this state shall submit to the commissioner:\n(1) a copy of the group's financial statement submitted to the state in which the risk retention group is chartered and licensed, which shall be certified by an independent public accountant and contain a statement of opinion on loss and loss adjustment expense reserves made by a member of the American Academy of Actuaries or a qualified loss reserve specialist, under criteria established by the National Association of Insurance Commissioners;\n(2) a copy of each examination of the risk retention group as certified by the commissioner or public official conducting the examination;\n(3) upon request by the commissioner, a copy of any information or document pertaining to any outside audit performed with respect to the risk retention group; and\n(4) the information required to verify its continuing qualification as a risk retention group under section 60E.02, subdivision 12.\n(a) Each risk retention group must file with the commissioner of revenue all returns and pay to the commissioner of revenue all amounts required under chapter 297I.\n(b) To the extent licensed agents or brokers are utilized in accordance with section 60E.12, they shall report to the commissioner of revenue the premiums for direct business for risks resident or located within this state which the licensees have placed with or on behalf of a risk retention group not chartered in this state.\n(c) To the extent that insurance agents or brokers are utilized in accordance with section 60E.12, each agent or broker shall keep a complete and separate record of all policies procured from each risk retention group, which must be open to examination by the commissioner, as provided in section 60A.031 and by the commissioner of revenue. These records must, for each policy and each kind of insurance provided, include the following:\n(1) the limit of liability;\n(2) the time period covered;\n(3) the effective date;\n(4) the name of the risk retention group which issued the policy;\n(5) the gross premium charged; and\n(6) the amount of return premiums, if any.\nA risk retention group, its agents and representatives, shall comply with sections 72A.20, subdivision 12, and 72A.201.\nA risk retention group shall comply with sections 72A.17 to 72A.32 regarding deceptive, false, or fraudulent acts or practices. However, if the commissioner seeks an injunction regarding this conduct, the injunction must be obtained from a court of competent jurisdiction.\nA risk retention group must submit to an examination by the commissioner to determine its financial condition if the commissioner of the jurisdiction in which the group is chartered and licensed has not initiated an examination or does not initiate an examination within 60 days after a request by the commissioner of commerce. The examination must be coordinated to avoid unjustified repetition and conducted in an expeditious manner and in accordance with the National Association of Insurance Commissioner's Examiner Handbook.\nAn application form for insurance from a risk retention group and the front and declaration pages of a policy issued by a risk retention group must contain in 10-point type, the following notice:\nNOTICE\nThis policy is issued by your risk retention group. Your risk retention group may not be subject to all of the insurance laws and rules of your state. State insurance insolvency guaranty funds are not available for your risk retention group.\nThe following acts by a risk retention group are prohibited:\n(1) the solicitation or sale of insurance by a risk retention group to a person who is not eligible for membership in the group; and\n(2) the solicitation or sale of insurance by, or operation of, a risk retention group that is in a hazardous financial condition or is financially impaired.\nNo risk retention group shall be allowed to do business in this state if an insurance company is directly or indirectly a member or owner of the risk retention group, other than in the case of a risk retention group all of whose members are insurance companies.\nThe terms of an insurance policy issued by a risk retention group shall not provide, or be construed to provide, coverage prohibited by state statute or declared unlawful by the highest court of the state whose law applies to the policy.\nA risk retention group not chartered in this state and doing business in this state must comply with a lawful order issued in a voluntary dissolution proceeding or in a delinquency proceeding commenced by a state insurance commissioner if there has been a finding of financial impairment after an examination under section 60E.04, subdivision 7.\nA risk retention group that violates any provision of this chapter is subject to fines and penalties including revocation of its right to do business in this state, applicable to licensed insurers generally.",
	"repealed": false
}