{
	"id": "115A.1416",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1416",
	"title": "115A.1416 BOAT WRAP PRODUCT STEWARDSHIP PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Boat\" has the meaning given to watercraft under section 86B.005, subdivision 18.\n(c) \"Boat wrap\" means plastic that is used, intended for use, designed, or marketed for the purposes of wrapping a boat to protect it against moisture and damage from other potentially harmful elements during storage.\n(d) \"Brand\" means a name, symbol, word, or mark that identifies boat wrap and attributes it to the boat wrap producer.\n(e) \"Independent auditor\" means an independent and actively licensed certified public accountant that is:\n(1) retained by a stewardship organization;\n(2) not otherwise employed by or affiliated with the stewardship organization; and\n(3) qualified to conduct the audit required under subdivision 16.\n(f) \"Producer\" means, with respect to boat wrap that is sold, offered for sale, imported, or distributed in the state by any means, a person that:\n(1) manufactured the boat wrap under a brand that the person owns or controls;\n(2) owns or controls or is licensed to use a brand for boat wrap;\n(3) imported or imports the boat wrap into the United States; or\n(4) distributed or distributes boat wrap in or into the state.\n(g) \"Recycle\" or \"recycling\" means the process of transforming boat wrap through mechanical processes into a finished product for use or into a new material capable of being processed into a finished product. Recycle or recycling does not include:\n(1) altering the chemical structure of boat wrap;\n(2) using boat wrap as or processing boat wrap into a feedstock to produce transportation fuels; or\n(3) destroying boat wrap by incineration or other processes.\n(h) \"Retailer\" means a person that sells or offers boat wrap for sale in or into this state by any means.\n(i) \"Stewardship organization\" means an organization designated by one or more producers to act on their behalf as an agent to design, submit, and implement a product stewardship plan under this section.\nA producer selling or offering boat wrap for sale in or into this state must, through membership in a stewardship organization, implement and finance a statewide product stewardship program according to a stewardship plan approved by the commissioner to reduce the volume of boat wrap disposed of in landfills by promoting and providing for the negotiation and execution of agreements to collect, transport, reuse, and recycle boat wrap.\n(a) On and after September 1, 2025, no person may use boat wrap, sell boat wrap, or offer boat wrap for sale in or into this state unless the producer participates in an approved stewardship plan through a stewardship organization.\n(b) Each producer must enter into an agreement with a stewardship organization to operate, on the producer's behalf, a product stewardship program approved by the commissioner.\n(c) All producers offering boat wrap for sale in or into this state must become a member of a single stewardship organization implementing a single stewardship plan.\nOn or before March 1, 2025, a stewardship organization, on behalf of member producers, must submit a stewardship plan to the commissioner for review and approval or rejection. A stewardship plan must include all elements required under subdivision 5.\nA stewardship plan must contain:\n(1) contact information for the individual and the entity submitting the plan, a list of all producers participating in the product stewardship program, and the brands of boat wrap included in the product stewardship program;\n(2) certification that the product stewardship program will accept all discarded boat wrap regardless of who produced it;\n(3) a description of methods by which boat wrap will be collected in all areas of the state in compliance with subdivision 14, including:\n(i) an explanation of how the collection system will be convenient and adequate to serve the needs of boat owners, marinas, and boat storage establishments in both urban and rural areas on an ongoing basis; and\n(ii) a discussion of how existing marinas, boat storage establishments, and sites designated as recycling centers under section 115A.555 will be considered when selecting collection sites;\n(4) a description of how the performance of the collection and recycling program will be measured, monitored, and maintained;\n(5) the names and locations of collectors, transporters, reuse facilities, and recyclers that will manage discarded boat wrap;\n(6) a description of how discarded boat wrap will be safely and securely transported, tracked, and handled from collection through final recycling and disposal of residuals;\n(7) a description of the methods that will be used to separate and manage nonrecyclable materials attached to boat wrap and to recycle discarded boat wrap;\n(8) a description of the promotion and outreach activities that will be undertaken to encourage participation in the boat wrap collection and recycling programs and how their effectiveness will be evaluated;\n(9) the annual performance goals established by the commissioner under subdivision 12;\n(10) evidence of adequate insurance and financial assurance that may be required for collection, transport, reuse, recycling, and disposal operations; and\n(11) a discussion of the status of end markets for collected boat wrap and what, if any, additional end markets are needed to improve the functioning of the program.\nIn developing a stewardship plan, a stewardship organization must consult with stakeholders, including boat owners, owners of marinas and boat storage establishments, contractors, collectors, recyclers, Tribes, and local government units.\n(a) Within 120 days after receiving a proposed stewardship plan, the commissioner must determine whether the plan complies with subdivision 5. If the commissioner approves a plan, the commissioner must notify the applicant of the plan approval in writing. If the commissioner rejects a plan, the commissioner must notify the applicant in writing of the reasons for rejection. An applicant whose plan is rejected by the commissioner must submit a revised plan to the commissioner within 60 days after receiving notice of rejection. If a revised plan is rejected by the commissioner, the commissioner may elect to write a plan that the applicant must implement.\n(b) Commissioner approval of a written plan amendment is required before a stewardship organization may make any change to an approved plan or its implementation. A proposed plan amendment must be submitted to the commissioner for review and approval or rejection according to paragraph (a) and subdivision 8.\n(c) A stewardship organization may operate under an approved stewardship plan for five years after the date the plan is approved by the commissioner, at which time the plan expires.\n(d) Six months before an approved stewardship plan expires, a stewardship organization must submit a new proposed stewardship plan to the commissioner that meets the requirements of this section. The commissioner must review and approve or reject the new proposed stewardship plan according to this subdivision and subdivision 8.\nThe commissioner must make a proposed stewardship plan or proposed plan amendment available on the agency website for public review and comment at least 45 days before the commissioner's decision regarding plan approval or rejection. The commissioner must make an approved stewardship plan available on the agency website.\nA stewardship organization that organizes collection, transport, reuse, and recycling of boat wrap under this section is immune from liability for conduct under state laws relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce only to the extent that the conduct is necessary to plan and implement the producer's or organization's chosen collection, transportation, reuse, or recycling program.\nA stewardship organization must provide boat wrap purchasers with educational materials regarding the product stewardship program. The materials must include, but are not limited to, information regarding available collection, transportation, reuse, and recycling options for boat wrap offered through the product stewardship program.\n(a) A retailer and a wholesaler are responsible for reviewing the list of compliant producers on the agency website, maintained under subdivision 12, to determine whether a producer is compliant with this section.\n(b) A retailer or wholesaler of boat wrap is not in violation of this subdivision if, on the date the boat wrap was ordered from a producer or wholesaler, the producer was listed as compliant on the agency website.\n(c) A retailer may elect to participate as a designated point where boat wrap is collected as part of a product stewardship program approved under this section and in accordance with applicable law.\n(a) The commissioner must maintain on the agency website a list of all compliant producers and brands participating in a stewardship plan that the commissioner has approved and a list of all producers and brands the commissioner has identified as noncompliant with this section.\n(b) The commissioner must, in consultation with the stewardship organization, establish annual performance goals regarding the percentage and weight of boat wrap collected and recycled that the stewardship organization must incorporate into its stewardship plan and meet annually. The performance goals must increase each year and be based on:\n(1) the most recent collection data available for the state;\n(2) the estimated weight of boat wrap sold and discarded annually;\n(3) actual collection data from boat wrap recycling or stewardship programs operating in other states; and\n(4) continuous progress necessary to meet the requirements in paragraph (c).\n(c) By June 1, 2030, no less than 50 percent of the total weight of boat wrap sold in this state must be collected and recycled. By June 1, 2035, no less than 80 percent of the total weight of boat wrap sold in this state must be collected and recycled.\n(d) After June 1, 2035, the commissioner may establish additional requirements for the percentage of boat wrap sold in the state that must be collected and recycled. The requirements must not be less than those listed in this subdivision and must be based on the factors in paragraph (b), clauses (1) to (3).\n(a) A stewardship organization must pay an annual administrative fee to the commissioner. Before June 1, 2025, and before each June 1 thereafter, the commissioner must identify the costs the agency incurs to administer and enforce this section. The commissioner must set the fee at an amount that, when paid by the stewardship organization, is sufficient to reimburse the agency's full costs of administering and enforcing this section but does not exceed those costs.\n(b) A stewardship organization must pay the administrative fee required under this subdivision on or before July 1, 2025, and annually thereafter, on a schedule and in a manner prescribed by the commissioner.\n(c) The commissioner must deposit all fees received under this subdivision in the account established in subdivision 15.\nThe stewardship program must be fully paid for by producers, without any fee, charge, surcharge, or any other cost to members of the public, businesses other than a producer, persons managing boat wrap, the state or any political subdivision, or any other person who is not a producer.\n(a) A boat wrap stewardship account is established in the special revenue fund in the state treasury. The account consists of money received from the administrative fee established in subdivision 13. The commissioner must manage the account.\n(b) Money in the account is appropriated annually to the commissioner for administering and enforcing this section.\nBeginning March 1, 2026, and each March 1 thereafter, a stewardship organization operating under this section must submit an annual report to the commissioner describing the program operations of the stewardship plan during the previous calendar year. At a minimum, the report must contain:\n(1) a description of the methods used to collect, transport, reuse, and recycle discarded boat wrap in all regions of the state;\n(2) the weight of all boat wrap collected and recycled in each separate region of the state;\n(3) the weight of all boat wrap sold in the state;\n(4) the weight of discarded boat wrap collected in the state by method of disposition, including recycling, reuse, disposal of residuals, and other methods of processing;\n(5) a comparison of the amount of boat wrap collected and recycled with the performance goals established according to subdivision 12 and, if the goals have not been met, a discussion of why the performance goals were not met and proposed modifications to the collection program the stewardship organization will implement to ensure that future performance goals will be met;\n(6) samples of educational materials provided to boat wrap consumers, marinas, and boat storage establishments and an evaluation of the effectiveness of the materials and the methods used to disseminate the materials; and\n(7) an independent financial audit of stewardship organization activities performed by an independent auditor. The independent auditor must be selected by the stewardship organization and approved or rejected by the commissioner. If the commissioner rejects an independent auditor, the operator must select a different independent auditor for approval or rejection by the commissioner. The independent audit must meet the requirements of Accounting Standards Update 2018-08, Not-for-Profit Entities (Topic 958), Financial Accounting Standards Board, as amended.\nTrade secret and sales information, as defined under section 13.37, submitted to the commissioner under this section are private or nonpublic data under section 13.37.\nUpon request of the commissioner for purposes of determining compliance with this section, a person must furnish to the commissioner any information that the person has or may reasonably obtain.",
	"repealed": false
}