{
	"id": "31A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/31A.15",
	"title": "31A.15 EXEMPTIONS.",
	"text": "The provisions of sections 31A.01 to 31A.16 requiring inspection of the slaughter of animals and the preparation of the carcasses, parts of carcasses, meat, poultry, poultry food products, and meat food products at establishments conducting slaughter and preparation do not apply:\n(1) to the processing by a person of the person's own animals and the owner's preparation and transportation in intrastate commerce of the carcasses, parts of carcasses, meat, poultry, poultry food products, and meat food products of those animals exclusively for use by the owner and members of the owner's household, nonpaying guests, and employees; or\n(2) to the custom processing by a person of animals, wild game, or fowl delivered by the owner for processing, and the preparation or transportation in intrastate commerce of the carcasses, parts of carcasses, meat, poultry, poultry food products, and meat food products of animals, exclusively for use in the household of the owner by the owner and members of the owner's household, nonpaying guests, and employees. Meat from custom processing must be identified and handled as required by the commissioner, during all phases of processing, chilling, cooling, freezing, preparation, storage, and transportation. The custom processor may not engage in the business of buying or selling carcasses, parts of carcasses, meat, poultry, poultry food products, or meat food products of animals usable as human food unless the carcasses, parts of carcasses, meat, poultry, poultry food products, or meat food products have been inspected and passed and are identified as inspected and passed by the Minnesota Department of Agriculture or the United States Department of Agriculture.\nThe processing of animals and preparation of articles referred to in subdivision 1, clause (2), must be conducted in accordance with sanitary conditions that the commissioner may by rule prescribe.\nThe adulteration and misbranding provisions of sections 31A.01 to 31A.16, other than the requirement of the inspection legend, apply to articles which are not required to be inspected under this section.",
	"repealed": false
}