{
	"id": "148E.270",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.270",
	"title": "148E.270 VOLUNTARY ACTIONS.",
	"text": "(a) The board or a designated board member may enter into an agreement for corrective action with an applicant or licensee when the board or a designated board member determines that a complaint alleging a violation of a statute or rule enforced by the board or an order issued by the board may best be resolved through an agreement for corrective action when disciplinary action is not required to protect the public.\n(b) An agreement for corrective action must:\n(1) be in writing;\n(2) specify the facts upon which the agreement is based;\n(3) clearly indicate the corrective action agreed upon; and\n(4) provide that the complaint that resulted in the agreement must be dismissed by the board or the designated board member upon successful completion of the corrective action.\n(c) The board or designated board member may determine successful completion when the applicant or licensee submits a request for dismissal that documents the applicant's or licensee's successful completion of the corrective action. The burden of proof is on the applicant or licensee to prove successful completion.\n(d) An agreement for corrective action is not disciplinary action but must be treated as public data under chapter 13.\n(e) The board may impose a fee to reimburse the board for all or part of the costs of the proceedings resulting in a corrective action, including, but not limited to, the amount paid by the board for services received from or expenses incurred by the Office of the Attorney General, board members, board staff, or the amount paid by the board for reproducing records.\n(f) The board or designated board member must not enter into an agreement for corrective action when the complaint alleged sexual conduct with a client unless there is insufficient evidence to justify disciplinary action but there is a basis for corrective action.\n(a) The board or a designated board member may enter into a stipulation to cease practicing social work with a licensee if the board or designated board member determines that the licensee is unable to practice social work competently or safely or that the social worker's continued practice creates an unacceptable risk of safety to clients, potential clients, or the public.\n(b) A stipulation to cease practicing social work must:\n(1) be in writing;\n(2) specify the facts upon which the stipulation is based;\n(3) clearly indicate that the licensee must not practice social work and must not hold out to the public that the social worker is licensed; and\n(4) specify the term of the stipulation or when and under what circumstances the licensee may petition the board for termination of the stipulation.\n(c) A stipulation to cease practicing social work is not disciplinary action but must be treated as public data under chapter 13.\n(d) Nothing in this subdivision prevents the board or designated board member from taking any other disciplinary or adversarial action authorized by sections 148E.255 to 148E.265 in lieu of or in addition to entering into a stipulation to cease practicing social work.",
	"repealed": false
}