{
	"id": "611.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.17",
	"title": "611.17 FINANCIAL INQUIRY; STATEMENTS; CO-PAYMENT; STANDARDS FOR DISTRICT PUBLIC DEFENSE ELIGIBILITY.",
	"text": "(a) Each judicial district must screen requests for representation by the district public defender. A defendant is financially unable to obtain counsel if:\n(1) the defendant, or any dependent of the defendant who resides in the same household as the defendant, receives means-tested governmental benefits; or\n(2) the court determines that the defendant, through any combination of liquid assets and current income, would be unable to pay the reasonable costs charged by private counsel in that judicial district for a defense of the same matter.\n(b) Upon a request for the appointment of counsel, the court shall make an appropriate determination of financial eligibility under paragraph (a) of the applicant, who shall submit a financial statement under oath or affirmation setting forth the applicant's assets and liabilities, including the value of any real property owned by the applicant, whether homestead or otherwise, less the amount of any encumbrances on the real property, the source or sources of income, and any other information required by the court. The applicant shall be under a continuing duty while represented by a public defender to disclose any changes in the applicant's financial circumstances. The state public defender shall furnish appropriate forms for the financial statements, which must be used by the district courts throughout the state. The forms must contain conspicuous notice of the applicant's continuing duty to disclose to the court changes in the applicant's financial circumstances. The forms must also contain conspicuous notice of the applicant's obligation to make a co-payment for the services of the district public defender, as specified under paragraph (c). The information contained in the statement shall be confidential and for the exclusive use of the court and the public defender except for any prosecution under section 609.48. A refusal to execute the financial statement or produce financial records constitutes a waiver of the right to the appointment of a public defender. The court shall not appoint a public defender to a defendant who is financially able to retain private counsel but refuses to do so, refuses to execute the financial statement or refuses to provide information necessary to determine financial eligibility under this section, or waives the appointment of a public defender under section 611.19.\nAn inquiry to determine financial eligibility of a defendant for the appointment of the district public defender shall be made whenever possible prior to the court appearance and by such persons as the court may direct. This inquiry may be combined with the prerelease investigation provided for in Minnesota Rule of Criminal Procedure 6.02, subdivision 3. In no case shall the district public defender be required to perform this inquiry or investigate the defendant's assets or eligibility. The court has the sole duty to conduct a financial inquiry. The inquiry must include the following:\n(1) the liquidity of real estate assets, including the defendant's homestead;\n(2) any assets that can be readily converted to cash or used to secure a debt;\n(3) the determination of whether the transfer of an asset is voidable as a fraudulent conveyance; and\n(4) the value of all property transfers occurring on or after the date of the alleged offense or notice of the action. The burden is on the accused to show that the accused is financially unable to afford counsel. Defendants who fail to provide information necessary to determine eligibility shall be deemed ineligible. The court must not appoint the district public defender as advisory counsel or standby counsel. If the court appoints advisory or standby counsel, the cost of counsel shall be paid for by the Office of the State Court Administrator or, if the prosecutor requests the appointment, by the governmental unit conducting the prosecution. In no event may the court order the Board of Public Defense to pay the cost of advisory or standby counsel.\n(c) Upon disposition of the case, an individual who has received public defender services shall pay to the court a $75 co-payment for representation provided by a public defender, unless the co-payment is, or has been, reduced in part or waived by the court.\nThe co-payment must be credited to the general fund. If a term of probation is imposed as a part of an offender's sentence, the co-payment required by this section must not be made a condition of probation. The co-payment required by this section is a civil obligation and must not be made a condition of a criminal sentence.",
	"repealed": false
}