{
	"id": "325N.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/325N.03",
	"title": "325N.03 CONTRACT.",
	"text": "(a) Every contract must be in writing and must fully disclose the exact nature of the solicitor's services and the total amount and terms of compensation.\n(b) The following notice, printed in at least 14-point boldface type and completed with the name of the solicitor, must be printed immediately above the statement required by paragraph (c):\n(c) The contract must be written in the same language as principally used by the solicitor to describe his or her services or to negotiate the contract, must be dated and signed by the owner, and must contain in immediate proximity to the space reserved for the owner's signature a conspicuous statement in a size equal to at least 10-point boldface type, as follows:\n\"You, the owner, may cancel this transaction at any time prior to midnight of the third business day after the date of this transaction. See the attached notice of cancellation form for an explanation of this right.\"\n(d) The notice of cancellation must contain, and the contract must contain on the first page, in a type size no smaller than that generally used in the body of the document, each of the following:\n(1) the name and physical address of the solicitor to which the notice of cancellation is to be mailed or otherwise delivered. A post office box does not constitute a physical address. A post office box may be designated for delivery by mail only if it is accompanied by a physical address at which the notice could be delivered by a method other than mail. An email address may be included, in addition to the physical address; and\n(2) the date the owner signed the contract.\n(e) Cancellation occurs when the owner delivers, by any means, written notice of cancellation to the address specified in the contract. If cancellation is mailed, delivery is effective upon mailing. If emailed, cancellation is effective upon transmission. The contract must be accompanied by a completed form in duplicate, captioned \"notice of cancellation,\" which must be attached to the contract, must be easily detachable, and must contain in at least 10-point type the following statement written in the same language as used in the contract:\n(f) The solicitor shall provide the owner with a copy of the contract and the attached notice of cancellation immediately upon execution of the contract.\n(g) The three business days during which the owner may cancel the contract shall not begin to run until the solicitor has complied with this section.",
	"repealed": false
}