{
	"id": "583.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/583.22",
	"title": "583.22 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 583.22 to 583.32.\n\"Agricultural property\" means real property that is principally used for farming as defined in section 500.24, subdivision 2, paragraph (a), and raising poultry, and personal property that is used as security to finance a farm operation or used as part of a farm operation including equipment, crops, livestock, proceeds of the security, and removable agricultural structures under lease with option to purchase. \"Agricultural property\" does not include: personal property that is subject to a possessory lien under sections 514.18 to 514.22; property that is leased to the debtor other than removable agricultural structures under lease with option to purchase; or farm machinery that is primarily used for custom field work.\n[Repealed, 1Sp1986 c 2 art 2 s 14]\n\"Creditor\" means the holder of a mortgage on agricultural property, a vendor of a contract for deed of agricultural property, a person with a lien or security interest in agricultural property, or a judgment creditor with a judgment against a debtor with agricultural property.\n\"Director\" means the director of the Minnesota Extension Service or the director's designee.\n\"File\" means to deliver by the required date by certified mail or another method acknowledging receipt.\n\"Financial analyst\" means a person: (1) knowledgeable in agricultural and financial matters that can provide financial analysis; (2) who is able to aid the debtor in preparing the financial information required under section 583.26, subdivision 3; and (3) who is approved by the director. A financial analyst may include county extension agents, adult farm management instructors, technical college instructors, and other persons able to carry out the duties of a financial analyst.\n\"Mediator\" means a farm mediator appointed by the director.\nAs used in section 583.27, \"necessary farm operating expenses\" means a sum or sums adequate to continue, during the mediation period, farm operations begun prior to the notice of default. \"Necessary farm operating expenses\" does not include expenses for increasing the scale of an ongoing farming operation or planting additional crops.\n[Repealed, 2017 c 88 art 2 s 93]\n\"Serve\" means (1) personal service as in a district court civil action; (2) service by certified mail using return receipt signed by addressee only; (3) actual delivery of required documents with signed receipt; or (4) if an unsuccessful attempt is made to serve under clause (1) or (2), service may be made by mail with a certificate of mailing to the last known address of the debtor. For purposes of serving under clause (4), the addressee is considered to have been served the documents five days after the date on the certificate of mailing.",
	"repealed": false
}