{
	"id": "458A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.03",
	"title": "458A.03 COMMISSION; ORGANIZATION AND OPERATION.",
	"text": "Within 90 days after July 1, 1969, or as soon as practicable after the selection and qualification of a majority of the first members of the commission, they shall meet to organize the commission at the call of a majority of the members, upon seven days' notice by certified mail to all those who have qualified, at a time and place within the area designated in the notice. A majority of the commissioners appointed shall constitute a quorum at that meeting and all other meetings of the commission. At that meeting the commission shall elect a chair from its membership, a vice-chair, a secretary, and a treasurer, which latter two officers shall serve at the pleasure of the commission, to serve until the regular monthly meeting of the commission to be held in the month of July next following or until their successors are elected and have qualified. At that regular monthly meeting and at the regular meeting held in the month of July in alternate years thereafter the commission shall elect successors to those officers to serve for two years or until their successors are elected and have qualified. The commission shall hold a regular meeting at least once in each month at a time and place within the area designated by the commission. Special meetings may be held as directed by the commission or at the call of the chair or any two commissioners upon at least seven days' notice by mail to all commissioners. All meetings of the commission shall be open to the public. Any authorized action may be taken by the commission upon the vote of a majority of those members present at any meeting lawfully convened. The commission may adopt a seal, which shall be officially and judicially noticed, to authenticate instruments executed by its authority, but omission of the seal shall not affect the validity of any instrument. The chair, vice-chair, treasurer, and secretary shall have the powers and duties usually incident to their respective offices and such others as may be prescribed for or delegated to them by the commission or as may be otherwise provided by law.\nThe commission may prescribe and promulgate rules as it deems necessary or expedient in furtherance of the purposes of sections 458A.01 to 458A.15 upon like procedure and with like force and effect as provided for state agencies by chapter 14.\nThe commissioner of management and budget shall receive, hold, disburse, invest, and otherwise dispose of all moneys of the commission as provided by law. Except as otherwise expressly provided, the commissioner of management and budget shall disburse moneys of the commission only as directed by the commission or by any of its officers thereto authorized by the commission. The fiscal year of the commission ending June 30, 1976 shall be extended to September 30, 1976. Thereafter the fiscal year of the commission shall be from October 1 to September 30.\nA commissioner shall receive no per diem for services except as hereinafter provided, but shall be reimbursed for actual and necessary expenses incurred in the performance of duties. Each commissioner shall be paid such sum as the commission by resolution may determine, by public hearing for each day or part thereof spent in attending meetings of the commission; provided, that no commissioner shall receive more than $2,500 for such attendance during the first 12 months beginning with and following the organization meeting, nor more than $1,600 in any one calendar year thereafter. The secretary and the treasurer shall receive such per diem as the commission may determine, which may be in addition to their per diem as a commissioner if they are such.\nThe commission may appoint an executive director. The executive director shall not be under civil service, and the commission shall prescribe the terms of employment as to compensation, tenure, retirement, and other appropriate conditions, including, without limitation, any conditions applicable by law to public employees in the unclassified service so far as the commission shall so determine. The executive director shall be subject to removal by the commission at any time. The executive director, if appointed, shall be the chief administrative officer of the commission and shall have the powers and duties incident thereto and such others as the commission may prescribe in furtherance of the provisions of sections 458A.01 to 458A.15, including such powers of the commission as it may see fit to delegate except those expressly required by law to be exercised by the commission. The commission may appoint or employ such other regular officers and employees as it deems necessary in furtherance of the purposes of sections 458A.01 to 458A.15 and prescribe their terms of employment, powers, and duties, subject to applicable civil service laws and other laws relating to public employees except as otherwise expressly provided. In addition thereto the commission may engage by contract, upon such terms as it may see fit, attorneys, engineers, consultants, agents, and other professionally qualified persons for such special purposes as the commission deems necessary in furtherance of the purposes of sections 458A.01 to 458A.15, subject to removal at the pleasure of the commission.\nThe commission is a governmental subdivision as that term is used in section 353.01, subdivision 6, but this subdivision shall not reduce the obligations of the commission as set forth elsewhere in sections 458A.01 to 458A.15.\nThe commission may require bonds of any of its officers or employees conditioned as required by law for the bonds of public officers and with such further provisions as the commission may determine, with corporate surety for which the premiums shall be paid out of the funds of the commission.\nThe transit area, with the commission as its governing body, shall be a public corporation and a political subdivision of the state. All the powers vested and obligations or duties imposed upon the commission and acts of the commission by sections 458A.01 to 458A.15 shall be deemed to be those of the transit area wherever necessary or appropriate, and shall be exercised, performed, and discharged in behalf of the area by the commission in its name as a public corporation and with like force and effect as if done in the name of the area, and for all such purposes, the commission shall have the same status and powers as the area. The chair and secretary of the commission shall have such powers as are delegated to them by the commission. The commission may sue and be sued and may enter into contracts which may be necessary or proper.\nThe commission may operate paratransit services, as defined in section 174.22, subdivision 6, and may exercise such other powers conferred upon it by sections 458A.01 to 458A.15, including the power to acquire property, as may be necessary and proper to operation of such services or the application for and receipt of such assistance.\nExcept as otherwise provided, the commission may, within the transit area, acquire by purchase, lease, gift, or condemnation proceedings any real or personal property, franchises, easements, or other rights which may be necessary or proper and may acquire real property in such manner for use as terminal facilities, maintenance and garage facilities, ramps, parking areas and other facilities useful for or related to any public transit system. The commission shall have power to acquire by purchase, lease, or gift all or any part of the plant, equipment, shares of stock, property, real, personal, or mixed, rights in property, reserve funds, special funds, franchises, licenses, patents, permits and papers, documents and records belonging to any operator of a public transit system within the area, and to lease property and to transfer or convey by sale or otherwise any property or rights to others, or to exchange the same for other property or rights which are useful for its purposes, and may in connection therewith assume any or all liabilities of any operator of a public transit system. The commission, without limitation, may acquire or construct and equip terminal facilities, maintenance and garage facilities, ramps, transit lanes or rights-of-way, parking areas and other facilities useful for or related to any public transit system and may hold, use, improve, operate, maintain, lease, sell, or otherwise dispose of any of its property to others and may contract with any operator or other person for the use by any such operator or person of any such property or facilities under its control. The commission shall not acquire any existing public transit system or any part thereof by condemnation. In the determination of the fair value of the existing public transit system, there shall not be included any value attributable to expenditures for improvements by the transit commission.\nThe commission may accept gifts, grants, or loans of money or other property from the United States, the state, or any person or entity for such purposes, may enter into any agreement required in connection therewith, may comply with any federal or state laws or regulations applicable thereto, and may hold, use, and dispose of such money or property in accordance with the terms of the gift, grant, loan, or agreement relating thereto. The commission may establish an executive committee, a finance committee, and such other committees of its members as it deems necessary or proper in furtherance of the provisions of sections 458A.01 to 458A.15, and may authorize them to exercise in the intervals between commission meetings any powers of the commission except those expressly required by law to be exercised by the commission.\nThe commission may provide public transit service outside the transit area by contractual arrangement with individuals, corporations or units of government.\nNotwithstanding any of the other provisions of sections 458A.01 to 458A.15, the commission shall have powers, in lieu of directly operating any public transit system, or any part thereof, to enter into management contracts with any persons, firms, or corporations for the management of said system for such period or periods of time, and under such compensation and other terms and conditions as shall be deemed advisable and proper by the commission and such persons, firms, or corporations.\nSuch persons, firms, or corporations entering into management contracts with the commission may employ necessary personnel for the operation and maintenance of said system as well as perform consulting and supervisory services for the commission. An incentive fee may be included in any management contract that is negotiated. The employees of any public transit system operated pursuant to the provisions of this subdivision shall, in case of any dispute arising under any existing or new collective bargaining agreement relating to the terms or conditions of their employment, have the right, for the purpose of resolving such dispute, either to engage in a concerted refusal to work or to invoke the processes of final and binding arbitration as provided by chapter 572, subject to any applicable provisions of the agreement not inconsistent with law.",
	"repealed": false
}