{
	"id": "114D.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.26",
	"title": "114D.26 WATERSHED RESTORATION AND PROTECTION STRATEGIES.",
	"text": "(a) The commissioner of the Pollution Control Agency shall develop watershed restoration and protection strategies for the purposes of:\n(1) summarizing the physical, chemical, and biological assessment of the water quality of the watershed;\n(2) quantifying impairments and risks to water quality;\n(3) describing the causes of impairments and pollution sources;\n(4) consolidating TMDLs in a major watershed; and\n(5) informing comprehensive local water management plans and comprehensive watershed management plans.\n(b) Each WRAPS must:\n(1) identify impaired waters and waters in need of protection;\n(2) identify biotic stressors causing impairments or threats to water quality;\n(3) summarize TMDLs, watershed modeling outputs, and resulting pollution load allocations and identify areas with high pollutant-loading rates;\n(4) in consultation with local governments and other state agencies, identify water quality monitoring needed to fill data gaps, determine changing conditions, or gauge implementation effectiveness; and\n(5) contain strategies that are capable of cumulatively achieving needed pollution load reductions for point and nonpoint sources, including identifying:\n(i) water quality parameters of concern;\n(ii) current water quality conditions;\n(iii) water quality goals, strategies, and targets by parameter of concern; and\n(iv) strategies and an example of the scale of adoptions with a timeline to meet the water quality restoration or protection goals of this chapter.\nTo ensure effectiveness, efficiency, and accountability in meeting the goals of this chapter, the commissioner of the Pollution Control Agency, in consultation with the Board of Water and Soil Resources and local government units, must coordinate the schedule, budget, scope, and use of a WRAPS and related documents and processes.\nBeginning July 1, 2016, and every other year thereafter, the commissioner of the Pollution Control Agency must report on the agency's website the progress toward implementation milestones and water quality goals.\n(a) The commissioner of the Pollution Control Agency must complete watershed restoration and protection strategies for the state's major watersheds by June 30, 2023, unless the commissioner determines that a comprehensive watershed management plan or comprehensive local water management plan, in whole or in part, meets the definition in section 114D.15, subdivision 11 or 13. As needed, the commissioner must update the strategies, in whole or in part, after consulting with the Board of Water and Soil Resources and local government units.\n(b) Watershed restoration and protection strategies are governed by the procedures for approval and notice in section 114D.25, subdivisions 2 and 4, except that the strategies need not be submitted to the United States Environmental Protection Agency.",
	"repealed": false
}