{
	"id": "245.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.095",
	"title": "245.095 LIMITS ON RECEIVING PUBLIC FUNDS.",
	"text": "(a) If a provider, vendor, or individual enrolled, licensed, receiving funds under a grant contract, or registered in any program administered by the commissioner, including under the commissioner's powers and authorities in section 256.01, is excluded from that program, the commissioner shall:\n(1) prohibit the excluded provider, vendor, or individual from enrolling, becoming licensed, receiving grant funds, or registering in any other program administered by the commissioner; and\n(2) disenroll, revoke or suspend a license, disqualify, or debar the excluded provider, vendor, or individual in any other program administered by the commissioner.\n(b) If a provider, vendor, or individual enrolled, licensed, receiving funds under a grant contract, or registered in any program administered by the commissioner, including under the commissioner's powers and authorities in section 256.01, is excluded from that program, the commissioner may:\n(1) prohibit any associated entities or associated individuals from enrolling, becoming licensed, receiving grant funds, or registering in any other program administered by the commissioner; and\n(2) disenroll, revoke or suspend a license of, disqualify, or debar any associated entities or associated individuals in any other program administered by the commissioner.\n(c) If a provider, vendor, or individual enrolled, licensed, or otherwise receiving funds under any contract or registered in any program administered by a Minnesota state or federal agency is excluded from that program, the commissioner of human services may:\n(1) prohibit the excluded provider, vendor, individual, or any associated entities or associated individuals from enrolling, becoming licensed, receiving grant funds, or registering in any program administered by the commissioner; and\n(2) disenroll, revoke or suspend a license of, disqualify, or debar the excluded provider, vendor, individual, or any associated entities or associated individuals in any program administered by the commissioner.\n(d) The duration of a prohibition, disenrollment, revocation, suspension, disqualification, or debarment under paragraph (a) must last for the longest applicable sanction or disqualifying period in effect for the provider, vendor, or individual permitted by state or federal law. The duration of a prohibition, disenrollment, revocation, suspension, disqualification, or debarment under paragraphs (b) and (c) may last until up to the longest applicable sanction or disqualifying period in effect for the provider, vendor, individual, associated entity, or associated individual as permitted by state or federal law.\n(a) For purposes of this section, the following definitions have the meanings given.\n(b) \"Associated entity\" means a provider or vendor owned or controlled by an excluded individual.\n(c) \"Associated individual\" means an individual or entity that has a relationship with the business or its owners or controlling individuals, such that the individual or entity would have knowledge of the financial practices of the program in question.\n(d) \"Excluded\" means removed under other authorities from a program administered by a Minnesota state or federal agency, including a final determination to stop payments.\n(e) \"Individual\" means a natural person providing products or services as a provider or vendor.\n(f) \"Provider\" means any entity, individual, owner, controlling individual, license holder, director, or managerial official of an entity receiving payment from a program administered by a Minnesota state or federal agency.\nWithin five days of taking an action under subdivision (1), paragraph (a), (b), or (c), against a provider, vendor, individual, associated individual, or associated entity, the commissioner must send notice of the action to the provider, vendor, individual, associated individual, or associated entity. The notice must state:\n(1) the basis for the action;\n(2) the effective date of the action;\n(3) the right to appeal the action; and\n(4) the requirements and procedures for reinstatement.\nUpon receipt of a notice under subdivision 3, a provider, vendor, individual, associated individual, or associated entity may request a contested case hearing, as defined in section 14.02, subdivision 3, by filing with the commissioner a written request of appeal. The scope of any contested case hearing is solely limited to action taken under this section. The commissioner must receive the appeal request no later than 30 days after the date the notice was mailed to the provider, vendor, individual, associated individual, or associated entity. The appeal request must specify:\n(1) each disputed item and the reason for the dispute;\n(2) the authority in statute or rule upon which the provider, vendor, individual, associated individual, or associated entity relies for each disputed item;\n(3) the name and address of the person or entity with whom contacts may be made regarding the appeal; and\n(4) any other information required by the commissioner.\n(a) Except as otherwise provided by state or federal law, the commissioner may withhold payments to a provider, vendor, individual, associated individual, or associated entity in any program administered by the commissioner if the commissioner determines there is a credible allegation of fraud for which an investigation is pending for a program administered by a Minnesota state or federal agency.\n(b) For purposes of this subdivision, \"credible allegation of fraud\" means an allegation that has been verified by the commissioner from any source, including but not limited to:\n(1) fraud hotline complaints;\n(2) claims data mining;\n(3) patterns identified through provider audits, civil false claims cases, and law enforcement investigations; and\n(4) court filings and other legal documents, including but not limited to police reports, complaints, indictments, informations, affidavits, declarations, and search warrants.\n(c) The commissioner must send notice of the withholding of payments within five days of taking such action. The notice must:\n(1) state that payments are being withheld according to this subdivision;\n(2) set forth the general allegations related to the withholding action, except the notice need not disclose specific information concerning an ongoing investigation;\n(3) state that the withholding is for a temporary period and cite the circumstances under which the withholding will be terminated; and\n(4) inform the provider, vendor, individual, associated individual, or associated entity of the right to submit written evidence to contest the withholding action for consideration by the commissioner.\n(d) If the commissioner withholds payments under this subdivision, the provider, vendor, individual, associated individual, or associated entity has a right to request administrative reconsideration. A request for administrative reconsideration must be made in writing, state with specificity the reasons the payment withholding decision is in error, and include documents to support the request. Within 60 days from receipt of the request, the commissioner shall judiciously review allegations, facts, evidence available to the commissioner, and information submitted by the provider, vendor, individual, associated individual, or associated entity to determine whether the payment withholding should remain in place.\n(e) The commissioner shall stop withholding payments if the commissioner determines there is insufficient evidence of fraud by the provider, vendor, individual, associated individual, or associated entity or when legal proceedings relating to the alleged fraud are completed, unless the commissioner has sent notice under subdivision 3 to the provider, vendor, individual, associated individual, or associated entity.\n(f) The withholding of payments is a temporary action and is not subject to appeal under section 256.045 or chapter 14.",
	"repealed": false
}