{
	"id": "11A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.23",
	"title": "11A.23 INVESTMENT OF RETIREMENT FUNDS AND PLANS.",
	"text": "Each executive director administering a retirement fund or plan enumerated in subdivision 4 shall, from time to time, certify to the state board for investment those portions of the assets of the retirement fund or plan which in the judgment of the executive director are not required for immediate use.\nRetirement fund assets certified to the state board under subdivision 1 must be invested by the state board subject to the provisions of section 11A.24. Retirement fund assets transferred to the combined investment fund or the supplemental investment fund must be invested by the state board as part of those funds.\nWhen an executive director administering a retirement fund or plan enumerated in subdivision 4, certifies to the state board that invested assets of the fund or plan are required for immediate use, the state board shall sell securities to equal the amount of assets certified as required and shall order the transfer of the assets to the appropriate executive director.\nThe provisions of this section apply to the following retirement funds and plans:\n(1) Board of Trustees of the Minnesota State Colleges and Universities supplemental retirement plan established under chapter 354C;\n(2) state employees retirement fund established pursuant to chapter 352;\n(3) correctional employees retirement plan established pursuant to chapter 352;\n(4) State Patrol retirement fund established pursuant to chapter 352B;\n(5) unclassified employees retirement plan established pursuant to chapter 352D;\n(6) general employees retirement fund established pursuant to chapter 353;\n(7) public employees police and fire fund established pursuant to chapter 353;\n(8) teachers' retirement fund established pursuant to chapter 354;\n(9) judges' retirement fund established pursuant to chapter 490; and\n(10) any other funds required by law to be invested by the board.",
	"repealed": false
}