{
	"id": "469.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.44",
	"title": "469.44 CITY POWERS, DUTIES; AUTHORITY TO ISSUE BONDS.",
	"text": "The city may exercise the powers of a port authority under sections 469.048 to 469.068 for the purposes of implementing the destination medical center development plan.\nThe city must provide financial and administrative support, and office and other space, to the corporation. The city may appropriate city funds to the corporation for its work.\nThe city may issue general obligation bonds, revenue bonds, or other obligations, as it determines appropriate, to finance public infrastructure projects, as provided by chapter 475. Notwithstanding section 475.53, obligations issued under this section are not subject to the limits on net debt, regardless of their source of security or payment. Notwithstanding section 475.58 or any other law or charter provision to the contrary, issuance of obligations under the provisions of this section are not subject to approval of the electors. The city may pledge any of its revenues, including property taxes, the taxes authorized by sections 469.45 and 469.46, and state aid under section 469.47, as security for and to pay the obligations. The city must not issue obligations that are only payable from or secured by state aid under section 469.47.\nNothing in sections 469.40 to 469.47 reduces the tax base or affects the taxes due and payable to the city, the county, or any school district within the boundaries of the city, including without limitation, the city's general local sales tax.\nThe city may exercise the powers under subdivision 3 with respect to any public infrastructure project commenced within the area that will be in the destination medical center development district after June 22, 2013, but before the development plan is adopted subject to approval by the corporation. Actions taken under this authority must be approved by the corporation to be credited against the local contribution required under section 469.47, subdivision 4, or to qualify for reimbursement of the city out of state aid paid under section 469.47, subdivision 3 or 5.\nThe city must require that a public infrastructure project use American steel products to the extent practicable. In determining whether it is practicable, the city may consider the exceptions to the requirement in Public Law 111-5, section 1605.\nFor all public infrastructure projects, the city must make every effort to hire and cause the construction manager and any subcontractors to employ women and members of minority communities. Goals for construction contracts must be established in the manner required under the city's minority and women-owned business enterprises utilization plan.\n(a) Upon the request of the corporation or the nonprofit agency, the city or its economic development authority shall issue revenue bonds or other similar obligations for a qualifying project. \"Revenue bonds or other obligations\" as used in this subdivision means bonds or other obligations issued under sections 469.152 to 469.165 or under chapter 462C, the interest on which is tax exempt. The city or its development authority shall use its best efforts to issue the bonds or other obligations as promptly and efficiently as possible following the request and the provision of the information and completion of the actions by the corporation or the nonprofit agency that are necessary for the issuance. Upon request of the corporation or nonprofit agency, the city or its economic development authority shall adopt methods and procedures that preserve the confidentiality of private donors or other private participants in the qualifying project, including structures and methods that do not require disclosing information on the donors or participants to the city or its economic development authority, and shall segregate in separate accounts all funds related to a qualifying project from other city and authority funds.\n(b) For purposes of this section, a \"qualifying project\" means a project, as that term is defined in section 469.153, or a project that would qualify for financing under chapter 462C, that:\n(1) the corporation finds is consistent with and will further the goals of the development plan;\n(2) is located in a medical development district; and\n(3) has a commitment of private funding sources such as donations of money or in-kind contributions, other than revenues generated by the project, equal to at least ten percent of the total capital cost of the project.\n(a) Notwithstanding section 469.068 or any other law to the contrary, the city need not require competitive bidding with respect to a parking facility or other public improvements constructed in conjunction with, and directly above or below, or adjacent and integrally related to, a private development financed or developed under the development plan.\n(b) For purposes of this section, \"city\" includes the development authority established by the city.",
	"repealed": false
}