{
	"id": "176.872",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.872",
	"title": "176.872 FINDINGS, PAYMENT OF MEDICAL CARE AND COMPENSATION.",
	"text": "If upon the evidence mentioned in section 176.871, the workers' compensation division finds that an employee is suffering from tuberculosis contracted in the institution or department by contact with inmates or patients therein or by contact with tuberculosis contaminated material therein, it shall order the employee to seek the services of a physician, advanced practice registered nurse, physician assistant, or medical care facility.\nThe physician, advanced practice registered nurse, physician assistant, or facility where the employee may be received must be paid the same fee for the maintenance and care of the person as is received by the institution for the maintenance and care of a nonresident patient. If the employee worked in a state hospital or nursing home, the Direct Care and Treatment executive board must pay for the care. If employed in any other institution or department the payment must be made from funds allocated or appropriated for the operation of the institution or department.\nIf the employee dies from the effects of the disease of tuberculosis and if the tuberculosis was the primary infection and the authentic cause of death, the workers' compensation division shall order payment to dependents as provided for under the general provisions of the workers' compensation law.\nWhenever it appears that any employee subject to the provisions of sections 176.87 to 176.873 has come into contact with persons who are afflicted with tuberculosis or with tuberculosis contaminated material in connection with the employment and has subsequently contracted tuberculosis it shall be presumed that such employee contracted tuberculosis by such contact and while working within the scope of employment.\nWhen an employee has contracted tuberculosis within the meaning of subdivision 1, the periods of time specified in section 176.141 shall be computed from the date that a confirmed diagnosis of tuberculosis is first communicated to the employee.\n(a) Any student nurse, medical student, or physician in training, who contracts tuberculosis as a result of direct contact with tuberculosis patients during the course of training, or internship in a public tax-supported hospital in this state, may be given care and treatment in a public tax-supported hospital operated and controlled by the county in which the public tax-supported hospital is located, and at the expense of the county in which the public hospital is located.\n(b) Application for such care and treatment shall be made by such student nurse, medical student, or medical intern at any time during the course of training or internship, and after the termination thereof, application shall be made within 12 months after the termination of said training or internship.",
	"repealed": false
}