{
	"id": "136F.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.45",
	"title": "136F.45 ANNUITIES.",
	"text": "(a) At the request of an employee, the board may negotiate and purchase an individual custodial account under section 403(b)(7) of the Internal Revenue Code, for an employee for retirement or other purposes from a company licensed to do business in Minnesota, and may allocate a portion of the compensation otherwise payable to the employee as salary for the purpose of paying the entire contribution due or to become due under the account. The allocation shall be made in a manner that will qualify the custodial account contributions, or portions thereof, for the benefit afforded under section 403(b)(7) of the current federal Internal Revenue Code or any equivalent provision of subsequent federal income tax law. The employee shall own the account and the employee's rights thereunder shall be nonforfeitable except for failure to pay contributions.\n(b) At its discretion, and in the same manner provided in paragraph (a), the board may negotiate and purchase individual custodial accounts under section 403(b)(7) of the Internal Revenue Code, for employees of the Minnesota Office of Higher Education as defined in section 136A.03. Participation under this paragraph must be in accordance with any applicable federal law.\n(a) The board may limit the number of vendors under subdivision 1.\n(b) In addition to any other tax-sheltered annuity program investment options, the board may offer as an investment option the Minnesota supplemental investment fund administered by the State Board of Investment under section 11A.17.\n(c) The board shall actively solicit participation of and shall include as vendors lower expense and \"no-load\" mutual funds or equivalent investment products as those terms are defined by the federal Securities and Exchange Commission. To the extent that offering a lower expense \"no-load\" product increases the total necessary and reasonable expenses of the program and if the board is unable to negotiate a rebate of fees from the mutual fund or equivalent investment product providers, the board may charge the participants utilizing the lower expense \"no-load\" mutual fund products a fee to cover those expenses. The participant fee may not exceed one percent of the participant's annual contributions or $20 per participant per year, whichever is greater. Any excess fee revenue generated under this subdivision must be reimbursed to participant accounts in the manner provided in subdivision 3a.\nAll amounts so allocated shall be deposited in an account established by the board. Payment of custodial account contributions shall be made when due or in accordance with the salary agreement entered into between the employee and the board. The money in the account is not subject to the budget, allotment, and incumbrance system provided for in chapter 16A.\n[Repealed, 1998 c 390 art 2 s 21]\n(a) For purposes of this subdivision, a gross fee amount is defined as the fees, commissions, and other charges which an annuity investment provider or vendor would charge a typical consumer of those services for identical or similar products. A net fee amount is an amount below the gross fee amount reflecting a negotiated reduction below gross fees.\n(b) To offset the board's necessary and reasonable expenses incurred under subdivisions 1 and 2, the Minnesota State Colleges and Universities system is authorized to negotiate with an annuity investment provider or vendor to establish a net fee amount.\n(c) Under the negotiated arrangements, the Minnesota State Colleges and Universities system is authorized to either make arrangements to recapture the difference between gross and net fee amounts through a rebate from the annuity investment provider or vendor, or deduct those amounts prior to transmitting the contributions or premiums.\n(d) The revenues collected or retained under these negotiated arrangements must be used to offset the board's necessary and reasonable expenses incurred under this section. Any excess above the necessary and reasonable expenses must be allocated annually to the accounts of the participants.\nIf the board so chooses, it may solicit bids or proposals for options under subdivision 1. The board may retain consulting services to assist it in soliciting and evaluating bids or proposals and in the periodic review of companies offering options under subdivision 1. The board may annually establish a budget for its costs in the soliciting, evaluating, and periodic review processes. The board may charge a proportional share of all costs related to the periodic review to each company currently under contract and may charge a proportional share of all costs related to soliciting and evaluating bids or proposals to each company selected by the board. Contracts must provide that all options in subdivision 1 must: (1) be presented in an unbiased manner, (2) be reported on a periodic basis to all employees participating in the tax-sheltered annuity program, and (3) not be the subject of unreasonable solicitation of state employees to participate in the program. The contract may not permit any person to jeopardize the tax-deferred status of money invested by state employees under this section. All costs or fees in relation to the bid solicitation and evaluation process for the options provided under subdivision 1 must be paid by the underwriting companies ultimately selected by the board.",
	"repealed": false
}