{
	"id": "204C.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.33",
	"title": "204C.33 CANVASS OF STATE GENERAL ELECTIONS.",
	"text": "The county canvassing board shall meet at the county auditor's office between the third and eighth days following the state general election. After taking the oath of office, the board shall promptly and publicly canvass the general election returns delivered to the county auditor. Upon completion of the canvass, the board shall promptly prepare and file with the county auditor a report which states:\n(a) the number of individuals voting at the election in the county and in each precinct;\n(b) the number of individuals registering to vote on election day and the number of individuals registered before election day in each precinct;\n(c) the names of the candidates for each office and the number of votes received by each candidate in the county and in each precinct;\n(d) the number of votes counted for and against a proposed change of county lines or county seat; and\n(e) the number of votes counted for and against a constitutional amendment or other question in the county and in each precinct.\nThe result of write-in votes cast on the general election ballots must be compiled by the county auditor before the county canvass, except that write-in votes for a candidate for federal, state, or county office must not be counted unless the candidate has timely filed a request under section 204B.09, subdivision 3. The county auditor shall arrange for each municipality to provide an adequate number of election judges to perform this duty or the county auditor may appoint additional election judges for this purpose. The county auditor may open the envelopes or containers in which the voted ballots have been sealed in order to count and record the write-in votes and must reseal the voted ballots at the conclusion of this process. The county auditor must prepare a separate report of votes received by precinct for write-in candidates for federal, state, and county offices who have requested under section 204B.09 that votes for those candidates be tallied.\nUpon completion of the canvass, the county canvassing board shall declare the candidate duly elected who received the highest number of votes for each county and state office voted for only within the county. The county auditor shall transmit a certified copy of the county canvassing board report for state and federal offices to the secretary of state by messenger, express mail, or similar service immediately upon conclusion of the county canvass.\nThe county auditor of each county shall provide a certified copy of the county canvassing board report to anyone who requests it upon payment to the auditor of costs of reproduction actually incurred by the auditor's office. The auditor shall not take into account the general office expenses or other expenses.\nThe State Canvassing Board shall meet at a public meeting space located in the Capitol complex area on the 16th day following the state general election to canvass the certified copies of the county canvassing board reports received from the county auditors and shall prepare a report that states:\n(1) the number of individuals voting in the state and in each county;\n(2) the number of votes received by each of the candidates, specifying the counties in which they were cast; and\n(3) the number of votes counted for and against each constitutional amendment, specifying the counties in which they were cast.\nIf the 16th day falls on a state holiday, the canvassing board shall meet on the next business day.\nAll members of the State Canvassing Board shall sign the report and certify its correctness. Within three days after completing the canvass, the State Canvassing Board shall declare the result and declare the candidates duly elected who received the highest number of votes for each federal office and for each state office voted on in more than one county.",
	"repealed": false
}