{
	"id": "120B.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.13",
	"title": "120B.13 ADVANCED PLACEMENT AND INTERNATIONAL BACCALAUREATE PROGRAMS.",
	"text": "Critical to schools' educational success is ongoing advanced placement and international baccalaureate-approved teacher training. A secondary teacher assigned by a district to teach an advanced placement or international baccalaureate course or other interested educator may participate in a training program offered by The College Board or International Baccalaureate North America, Inc. The state may pay a portion of the tuition, room, board, and out-of-state travel costs a teacher or other interested educator incurs in participating in a training program. The commissioner shall determine application procedures and deadlines, select teachers and other interested educators to participate in the training program, and determine the payment process and amount of the subsidy. The procedures determined by the commissioner shall, to the extent possible, ensure that advanced placement and international baccalaureate courses become available in all parts of the state and that a variety of course offerings are available in school districts. This subdivision does not prevent teacher or other interested educator participation in training programs offered by The College Board or International Baccalaureate North America, Inc., when tuition is paid by a source other than the state.\nThe commissioner shall provide support programs during the school year for teachers who attended the training programs and teachers experienced in teaching advanced placement or international baccalaureate courses. The support programs shall provide teachers with opportunities to share instructional ideas with other teachers. The state may pay the costs of participating in the support programs, including substitute teachers, if necessary, and program affiliation costs.\nThe state may pay all or part of the fee for advanced placement or international baccalaureate examinations. The commissioner shall pay all examination fees for all public and nonpublic students of low-income families, as defined by the commissioner, and to the limit of the available appropriation, shall also pay a portion or all of the examination fees for other public and nonpublic students sitting for an advanced placement examination, international baccalaureate examination, or both. The commissioner shall determine procedures for state payments of fees.\nThe colleges and universities of the Minnesota State Colleges and Universities system must award, and the University of Minnesota and private postsecondary institutions are encouraged to award, college credit to high school students who receive a score of three or higher on an advanced placement or four or higher on the international baccalaureate program examination.\n(a) The commissioner shall submit the following information on rigorous course taking, disaggregated by student subgroup, school district, and postsecondary institution, to the education committees of the legislature by July 1, 2025, and each subsequent year by July 1:\n(1) the number of pupils enrolled in postsecondary enrollment options under section 124D.09, including concurrent enrollment, career and technical education courses offered as a concurrent enrollment course, advanced placement, and international baccalaureate courses in each school district;\n(2) the number of teachers in each district attending training programs offered by the college board, International Baccalaureate North America, Inc., or Minnesota concurrent enrollment programs;\n(3) the number of teachers in each district participating in support programs;\n(4) recent trends in the field of postsecondary enrollment options under section 124D.09, including concurrent enrollment, advanced placement, and international baccalaureate programs;\n(5) expenditures for each category in this section and under sections 124D.09 and 124D.091, including career and technical education courses offered as a concurrent enrollment course; and\n(6) other recommendations for the state program or the postsecondary enrollment options under section 124D.09, including concurrent enrollment.\n(b) The commissioner must include data from the 2022-2023 and 2023-2024 school years in the report due on July 1, 2025.",
	"repealed": false
}