{
	"id": "12.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.35",
	"title": "12.35 ACTIVATING EMERGENCY RESPONSE PERSONNEL.",
	"text": "MS 1994 [Repealed by amendment, 1996 c 344 s 24]\nEmergency response personnel, while activated by the state, are considered state employees and have the powers, duties, rights, privileges, and immunities provided by law for the employees of this state.\nThe state shall reimburse a political subdivision for the compensation paid and actual and necessary travel, subsistence, and maintenance expenses of employees of the political subdivision while they are activated by the state director as emergency response personnel. Reimbursement must also be provided for all payments for death, disability, or injury in the course of duty, and for all losses of or damage to supplies and equipment of the political subdivision resulting from the operations of the emergency response personnel.\nThe state shall also reimburse a political subdivision for the compensation paid and actual and necessary travel, subsistence, and maintenance expenses of employees of the political subdivision while they are activated by the state director in order to participate in specifically authorized training and exercises.\nWhen emergency management personnel of another state render aid in Minnesota pursuant to the orders of the governor of its home state, and upon the request of the governor of Minnesota, this state shall reimburse the other state for (1) the compensation paid and actual and necessary travel, subsistence, and maintenance expenses of the personnel of the other state while rendering aid as emergency management personnel, (2) all payments for death, disability, or injury of those personnel incurred in the course of rendering that aid, and (3) all losses of or damage to supplies and equipment of the other state, or a governmental subdivision of the other state, resulting from the rendering of aid; provided, that the laws of the other state contain provisions substantially similar to this section.\nMS 1994 [Repealed by amendment, 1996 c 344 s 24]",
	"repealed": false
}