{
	"id": "257B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/257B.01",
	"title": "257B.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Alternate\" means a person with all the rights, responsibilities, and qualifications of a standby custodian who shall become a standby custodian if the currently designated standby custodian is unable or unwilling to fulfill the obligations of custodian.\n\"Attending physician, advanced practice registered nurse, or physician assistant\" means a physician, advanced practice registered nurse, or physician assistant who has primary responsibility for the treatment and care of the designator. If physicians, advanced practice registered nurses, or physician assistants share responsibility; another physician, advanced practice registered nurse, or physician assistant is acting on the attending physician's, advanced practice registered nurse's, or physician assistant's behalf; or no physician, advanced practice registered nurse, or physician assistant has primary responsibility, any physician, advanced practice registered nurse, or physician assistant who is familiar with the designator's medical condition may act as an attending physician, advanced practice registered nurse, or physician assistant under this chapter.\n\"Co-custodian\" means a standby custodian who is acting as custodian along with the parents and shares physical or legal custody of the children, or both, due to the occurrence of a triggering event.\n\"Consent\" means a written authorization signed by the designator in the presence of two witnesses who also sign the writing. The witnesses must be 18 years of age or older and not named in the designation.\n\"Debilitation\" means a person's chronic and substantial inability, as a result of a physically incapacitating disease or injury, to care for the children.\n\"Designation\" means a written document naming a standby or temporary custodian. A parent may designate an alternate standby custodian in the same writing. A parent may not designate an alternate temporary custodian.\n\"Designator\" means a parent or legal custodian who appoints a standby or temporary custodian.\n\"Determination of debilitation\" means a written finding made by an attending physician, advanced practice registered nurse, or physician assistant which states that the designator suffers from a physically incapacitating disease or injury. No identification of the illness in question is required.\n\"Determination of incapacity\" means a written finding made by an attending physician, advanced practice registered nurse, or physician assistant which states the nature, extent, and probable duration of the designator's mental or organic incapacity.\n\"Incapacity\" means a chronic and substantial inability, resulting from a mental or organic impairment, to understand the nature and consequences of decisions concerning the care of the designator's dependent children and a consequent inability to care for the children.\n\"Standby custodian\" means a person named by a designator to assume the duties of co-custodian or custodian of a child and whose authority becomes effective upon the incapacity, debilitation and consent, or death of the child's parent.\n\"Temporary custodian\" means a person named by a designator to assume the duties of legal and physical custodian of a child for a specific time up to 24 months.\n\"Triggering event\" means a specified occurrence stated in the designation that empowers a standby or temporary custodian to assume the powers, duties, and responsibilities of custodian or co-custodian.",
	"repealed": false
}