{
	"id": "190.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.30",
	"title": "190.30 REQUISITION FOR TAX-FORFEITED LAND.",
	"text": "The adjutant general may requisition for military training purposes any tax-forfeited land in the state or any state land in the custody or under the control of the commissioner of natural resources or any agency of the Department of Natural Resources, subject to the conditions hereinafter prescribed. The requisition shall be made by filing a certificate thereof executed by the adjutant general as follows:\n(a) with the county auditor of the county in which the land is situated in the case of tax-forfeited land held subject to any control or authority of the county board;\n(b) with the officer having custody of the state land records in the Department of Natural Resources in the case of any tax-forfeited land or other state land not subject to any control or authority of a county board.\nNo such requisition shall be made in the case of any state land which has been designated or set apart for any specific public use without the approval of the commissioner of natural resources.\nNo such requisition shall be made in the case of any tax-forfeited land within the limits of any city without the approval of the governing body thereof.\nLand so requisitioned may be leased to the United States for military or naval training purposes as hereinbefore provided.\nLand requisitioned, so long as used by the state or by the United States for military training purposes, shall be relieved from any trust in favor of any taxing district and from any control or authority of any other public agency for any other purposes. In case the use of land for military training purposes should cease, it shall revert to its status immediately prior to being requisitioned for those purposes, and shall be subject to all the conditions and incidents attached to its prior status.\nExpenses incident to the requisitioning of land for military training purposes hereunder, to the leasing of such land to the United States, and to proceedings to perfect the title to the land, if necessary, shall be payable from the appropriations made for acquisition of land.",
	"repealed": false
}