{
	"id": "124D.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.093",
	"title": "124D.093 P-TECH SCHOOLS.",
	"text": "(a) P-TECH schools are established as a public-private partnership that will prepare students for high-skill jobs of the future in identified growth industries.\n(b) The P-TECH school model must deliver five core benefits to students:\n(1) a rigorous, relevant, and cost-free education in grades 9 to 14, inclusive, focused on knowledge and skills that students need for science, technology, engineering, and mathematics (STEM) careers;\n(2) workplace learning that includes mentoring by industry professionals, worksite visits, speakers, and internships;\n(3) intensive, individualized academic support by both secondary and postsecondary faculty within an academic year or school day that enables students to progress through the program at their own pace;\n(4) an opportunity to earn an associate's degree; and\n(5) a commitment to students who complete the program to be first in line for a job with participating business partners following completion of the program.\n(a) P-TECH schools must accomplish the following:\n(1) develop programs of study in high-wage, high-skill, and high-demand career areas;\n(2) align school, college, and community systems in the programs of study developed under this section;\n(3) support strong academic performance by program participants;\n(4) promote informed and appropriate career choices and preparation; and\n(5) ensure that employers in key technical fields have access to a talented and skilled workforce.\n(b) Through the programs of study developed under this section, participating students must be able to earn college course credit toward an associate's degree. Career pathways will begin in grade 9 and must include workplace learning, high school, and postsecondary coursework. These pathways will provide a seamless sequence of study, extending through two years of postsecondary career and technical education, and culminating in an associate's degree.\nThe commissioner must determine the form and manner of application for a school to be designated a P-TECH school. The application must contain at least the following information:\n(1) the written agreement between a public school, a higher education institution under section 124D.09, subdivision 3, paragraph (a), and a business partner to jointly develop and support a P-TECH school;\n(2) a proposed school design consistent with subdivisions 1 and 2;\n(3) a description of how the P-TECH school supports the needs of the economic development region in which the P-TECH school is to be located;\n(4) a description of the facilities to be used by the P-TECH school;\n(5) a description of proposed budgets, curriculum, transportation plans, and other operating procedures for the P-TECH school;\n(6) the process by which students will be enrolled in the P-TECH school;\n(7) the qualifications required for individuals employed in the P-TECH school; and\n(8) any additional information that the commissioner requires.\n(a) The commissioner of education must appoint an advisory committee to review the applications and to recommend approval for those applications that meet the requirements of this section. The commissioner of education has final authority over application approvals.\n(b) To the extent practicable, the commissioner must ensure an equitable geographic distribution of approved P-TECH schools.\n(a) When an appropriation is available, each P-TECH school is eligible for a grant to support start-up and ongoing program costs, which may include, but are not limited to, recruitment, student support, program materials, and P-TECH school liaisons. A P-TECH school may form a partnership with a school in another school district.\n(b) For fiscal year 2026 and later, the maximum P-TECH support grant must not exceed $500,000 per year.\n(c) An approved P-TECH school is eligible to receive a grant to support start-up costs the year before first enrolling P-TECH students. A start-up grant may be awarded to a new applicant in an amount not to exceed $50,000.\n(d) A grant recipient operating a P-TECH program may provide mentoring and technical assistance to a school eligible for a start-up grant. A mentoring and technical assistance grant may not exceed $50,000.\n(e) For each year that an appropriation is made for the purposes of this section, the department may retain five percent of the appropriation for grant administration and program oversight.",
	"repealed": false
}