{
	"id": "297A.668",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.668",
	"title": "297A.668 SOURCING OF SALE; SITUS IN THIS STATE.",
	"text": "The provisions of this section apply regardless of the characterization of a product as tangible personal property, a digital good, or a service; but do not apply to telecommunications services or the sales of motor vehicles. These provisions only apply to determine a seller's obligation to pay or collect and remit a sales or use tax with respect to the seller's sale of a product. These provisions do not affect the obligation of a seller as purchaser to remit tax on the use of the product.\n(a) The retail sale, excluding lease or rental, of a product shall be sourced as required in paragraphs (b) through (f).\n(b) When the product is received by the purchaser at a business location of the seller, the sale is sourced to that business location.\n(c) When the product is not received by the purchaser at a business location of the seller, the sale is sourced to the location where receipt by the purchaser or the donee designated by the purchaser occurs, including the location indicated by instructions for delivery to the purchasers or the purchaser's donee, known to the seller.\n(d) When paragraphs (b) and (c) do not apply, the sale is sourced to the location indicated by an address for the purchaser that is available from the business records of the seller that are maintained in the ordinary course of the seller's business, when use of this address does not constitute bad faith.\n(e) When paragraphs (b), (c), and (d) do not apply, the sale is sourced to the location indicated by an address for the purchaser obtained during the consummation of the sale, including the address of a purchaser's payment instrument if no other address is available, when use of this address does not constitute bad faith.\n(f) When paragraphs (b), (c), (d), and (e) do not apply, including the circumstance where the seller is without sufficient information to apply the previous paragraphs, then the location is determined by the address from which tangible personal property was shipped, from which the digital good or the computer software delivered electronically was first available for transmission by the seller, or from which the service was provided. For purposes of this paragraph, the seller must disregard any location that merely provided the digital transfer of the product sold.\n(g) For purposes of this subdivision, the terms \"receive\" and \"receipt\" mean taking possession of tangible personal property, making first use of services, or taking possession or making first use of digital goods or the computer software delivered electronically, whichever occurs first. The terms receive and receipt do not include possession by a carrier for hire on behalf of the purchaser.\nThe lease or rental of tangible personal property, other than property identified in subdivision 4 or 5, shall be sourced as required in paragraphs (a) to (c).\n(a) For a lease or rental that requires recurring periodic payments, the first periodic payment is sourced the same as a retail sale in accordance with the provisions of subdivision 2. Periodic payments made subsequent to the first payment are sourced to the primary property location for each period covered by the payment. The primary property location must be as indicated by an address for the property provided by the lessee that is available to the lessor from its records maintained in the ordinary course of business, when use of this address does not constitute bad faith. The property location must not be altered by intermittent use at different locations, such as use of business property that accompanies employees on business trips and service calls.\n(b) For a lease or rental that does not require recurring periodic payments, the payment is sourced the same as a retail sale in accordance with the provisions of subdivision 2.\n(c) This subdivision does not affect the imposition or computation of sales or use tax on leases or rentals based on a lump sum or accelerated basis, or on the acquisition of property for lease.\nThe lease or rental of motor vehicles, trailers, semitrailers, or aircraft that do not qualify as transportation equipment, as defined in subdivision 5, shall be sourced as required in paragraphs (a) to (c).\n(a) For a lease or rental that requires recurring periodic payments, each periodic payment is sourced to the primary property location. The primary property location must be as indicated by an address for the property provided by the lessee that is available to the lessor from its records maintained in the ordinary course of business, when use of this address does not constitute bad faith. This location must not be altered by intermittent use at different locations.\n(b) For a lease or rental that does not require recurring periodic payments, the payment is sourced the same as a retail sale in accordance with the provisions of subdivision 2.\n(c) This subdivision does not affect the imposition or computation of sales or use tax on leases or rentals based on a lump sum or accelerated basis, or on the acquisition of property for lease.\n(a) The retail sale, including lease or rental, of transportation equipment shall be sourced the same as a retail sale in accordance with the provisions of subdivision 2, notwithstanding the exclusion of lease or rental in subdivision 2.\n(b) \"Transportation equipment\" means any of the following:\n(1) locomotives and railcars that are utilized for the carriage of persons or property in interstate commerce;\n(2) trucks and truck-tractors with a gross vehicle weight rating (GVWR) of 10,001 pounds or greater, trailers, semitrailers, or passenger buses that are:\n(i) registered through the international registration plan; and\n(ii) operated under authority of a carrier authorized and certified by the United States Department of Transportation or another federal authority to engage in the carriage of persons or property in interstate commerce;\n(3) aircraft that are operated by air carriers authorized and certificated by the United States Department of Transportation or another federal or a foreign authority to engage in the carriage of persons or property in interstate commerce; or\n(4) containers designed for use on and component parts attached or secured on the transportation equipment described in clauses (1) through (3).\n[Repealed, 2008 c 154 art 12 s 41]\n(a) Notwithstanding the provisions of subdivisions 2 and 3, a business purchaser that has not received authorization to pay the tax directly to the commissioner may use an exemption certificate indicating multiple points of use if:\n(1) the purchaser knows at the time of its purchase of a digital good, computer software delivered electronically, or a service that the good or service will be concurrently available for use in more than one taxing jurisdiction; and\n(2) the purchaser delivers to the seller the exemption certificate indicating multiple points of use at the time of purchase.\n(b) Upon receipt of the fully completed exemption certificate indicating multiple points of use, the seller is relieved of the obligation to collect, pay, or remit the applicable tax and the purchaser is obligated to collect, pay, or remit the applicable tax on a direct pay basis. The provisions of section 297A.665 apply to this paragraph.\n(c) The purchaser delivering the exemption certificate indicating multiple points of use may use any reasonable but consistent and uniform method of apportionment that is supported by the purchaser's business records as they exist at the time of the consummation of the sale.\n(d) The purchaser shall provide the exemption certificate indicating multiple points of use to the seller at the time of purchase.\n(e) A purchaser that has received authorization to pay the tax directly to the commissioner is not required to deliver to the seller an exemption certificate indicating multiple points of use. A purchaser that has received authorization to pay the tax directly to the commissioner shall follow the provisions of paragraph (c) in apportioning the tax due on a digital good, computer software delivered electronically, or a service that will be concurrently available for use in more than one taxing jurisdiction.\n(a) Notwithstanding other subdivisions of this section, the provisions in paragraphs (b) to (e) apply to the sale of advertising and promotional direct mail. \"Advertising and promotional direct mail\" means printed material that is direct mail as defined in section 297A.61, subdivision 35, the primary purpose of which is to attract public attention to a product, person, business, or organization, or to attempt to sell, popularize, or secure financial support for a person, business, organization, or product. \"Product\" includes tangible personal property, a digital product transferred electronically, or a service.\n(b) A purchaser of advertising and promotional direct mail may provide the seller with one of the following:\n(1) a fully completed exemption certificate as described in section 297A.72 indicating that the purchaser is authorized to pay any sales or use tax due on purchases made by the purchaser directly to the commissioner under section 297A.89;\n(2) a fully completed exemption certificate claiming an exemption for direct mail; or\n(3) information showing the jurisdictions to which the advertising and promotional direct mail is to be delivered to recipients.\n(c) In the absence of bad faith, if the purchaser provides one of the exemption certificates indicated in paragraph (b), clauses (1) and (2), the seller is relieved of all obligations to collect, pay, or remit the applicable tax and the purchaser is obligated to pay or remit the tax on any transaction involving advertising and promotional direct mail to which the certificate applies. The purchaser shall source the sale to the jurisdictions to which the advertising and promotional direct mail is to be delivered to the recipients of the mail, and shall report and pay any applicable tax due.\n(d) If the purchaser provides the seller information showing the jurisdictions to which the advertising and promotional direct mail is to be delivered to recipients, the seller shall source the sale to the jurisdictions to which the advertising and promotional direct mail is to be delivered and shall collect and remit the applicable tax. In the absence of bad faith, the seller is relieved of any further obligation to collect any additional tax on the sale of advertising and promotional direct mail where the seller has sourced the sale according to the delivery information provided by the purchaser.\n(e) If the purchaser does not provide the seller with any of the items listed in paragraph (b), the sale shall be sourced under subdivision 2, paragraph (f). Nothing in this paragraph limits a purchaser's obligation for sales or use tax to any state to which the direct mail is delivered.\n(f) This subdivision does not apply to printed materials that result from developing billing information or providing any data processing service that is more than incidental to producing the printed materials, regardless of whether advertising and promotional direct mail is included in the same mailing.\n(g) If a transaction is a bundled transaction that includes advertising and promotional direct mail, this subdivision applies only if the primary purpose of the transaction is the sale of products or services that meet the definition of advertising and promotional direct mail.\n(a) Notwithstanding other subdivisions of this section, the provisions in paragraphs (b) and (c) apply to the sale of other direct mail. \"Other direct mail\" means printed material that is direct mail as defined in section 297A.61, subdivision 35, but is not advertising and promotional direct mail as described in subdivision 7, regardless of whether advertising and promotional direct mail is included in the same mailing. Other direct mail includes, but is not limited to:\n(1) direct mail pertaining to a transaction between the purchaser and addressee, where the mail contains personal information specific to the addressee including, but not limited to, invoices, bills, statements of account, and payroll advices;\n(2) any legally required mailings including, but not limited to, privacy notices, tax reports, and stockholder reports; and\n(3) other nonpromotional direct mail delivered to existing or former shareholders, customers, employees, or agents including, but not limited to, newsletters and informational pieces.\nOther direct mail does not include printed materials that result from developing billing information or providing any data processing service that is more than incidental to producing the other direct mail.\n(b) A purchaser of other direct mail may provide the seller with either a fully completed exemption certificate as described in section 297A.72 indicating that the purchaser is authorized to pay any sales or use tax due on purchases made by the purchaser directly to the commissioner under section 297A.89, or a fully completed exemption certificate claiming an exemption for direct mail. If the purchaser provides one of the exemption certificates listed, then the seller, in the absence of bad faith, is relieved of all obligations to collect, pay, or remit the tax on any transaction involving other direct mail to which the certificate applies. The purchaser shall source the sale to the jurisdictions to which the other direct mail is to be delivered to the recipients of the mail, and shall report and pay any applicable tax due.\n(c) If the purchaser does not provide the seller with a fully completed exemption certificate claiming either exemption listed in paragraph (b), the sale shall be sourced according to subdivision 2, paragraph (d).\n(a) Notwithstanding other subdivisions of this section, a sale of a manufactured or modular home shall be sourced to the site where the housing is first set up or installed.\n(b) For purposes of this section, \"manufactured home\" has the meaning given in section 327.31, subdivision 6. For purposes of this section, \"modular home\" means a building or structural unit that has been substantially manufactured or constructed, in whole or in part, at an off-site location, with the final assembly occurring on site alone or with other units and attached to a permanent foundation site and occupied as a single-family dwelling. Modular home construction must comply with applicable standards adopted in Minnesota Rules authorized under chapter 16B. A modular home does not include a structure subject to the requirements of the National Manufactured Home Construction and Safety Standards Act of 1974 or a manufactured home.\n(a) Notwithstanding other subdivisions of this section, the retail sale of \"florist sales\" is sourced as follows:\n(1) When a Minnesota retailer takes a florist sales order directly from a customer, whether or not the customer is physically present in Minnesota when placing the order, and delivers the items to the customer or a third person, either within this state or outside this state, and regardless of the delivery method, the florist sale is sourced according to subdivision 2.\n(2) When one retailer transmits a florist sales order to another retailer of florist sales through a floral network service or floral delivery association, whether by telephone, telegraph, Internet, or other means of communication, the florist sale is sourced to the location of the retailer which originally takes the order from the customer and accepts payment.\n(b) For purposes of this subdivision, florist sales means sales at retail of flowers, wreaths, floral bouquets, potted plants, hospital baskets, funeral designs, seeds, nursery seedling stock, trees, shrubs, plants, sod, soil, bulbs, sand, rock, and all other floral or nursery products.",
	"repealed": false
}