{
	"id": "326B.921",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.921",
	"title": "326B.921 LICENSING AND REGISTRATION.",
	"text": "No individual shall engage in or work at the business of a master high pressure pipefitter unless issued a master high pressure pipefitter license to do so by the department under rules adopted by the board. No license shall be required for repairs on existing installations. No individual shall engage in or work at the business of journeyworker high pressure pipefitter unless issued a journeyworker high pressure pipefitter competency license to do so by the department under rules adopted by the board. An individual possessing a master high pressure pipefitter competency license may also work as a journeyworker high pressure pipefitter.\nNo person shall construct or install high pressure piping, nor install high pressure piping in connection with the dealing in and selling of high pressure pipe material and supplies, unless, at all times, an individual possessing a master high pressure pipefitter competency license or a journeyworker high pressure pipefitter competency license is responsible for ensuring that the high pressure pipefitting work is in conformity with Minnesota Statutes and Minnesota Rules.\nThe board shall prescribe rules, not inconsistent herewith, for the examination and competency licensing of master high pressure pipefitters and journeyworker high pressure pipefitters.\nAn employee performing the duties of inspector for the department in regulating pipefitting shall not receive time credit for the inspection duties when making an application for a license required by this section.\nBefore obtaining a permit for high pressure piping work, a person must obtain or utilize a contractor with a high pressure piping contractor license.\nA person must have at all times as a full-time employee at least one individual holding a master high pressure pipefitter competency license. Only full-time employees who hold master high pressure pipefitter licenses are authorized to obtain high pressure piping permits in the name of the contractor. The master high pressure pipefitter competency license holder can be the employee of only one high pressure piping contractor at a time. An application for a high pressure piping contractor license shall include a verified statement that the applicant or licensee has complied with this subdivision.\nTo retain its contractor license without reapplication, a person holding a high pressure piping contractor license that ceases to employ an individual holding a master high pressure pipefitter competency license shall have 60 days from the last day of employment of its previous master high pressure pipefitter competency license holder to employ another license holder. The department must be notified no later than five days after the last day of employment of the previous license holder.\nNo high pressure pipefitting work may be performed during any period when the high pressure pipefitting contractor does not have a master high pressure pipefitter competency license holder on staff. If a license holder is not employed within 60 days after the last day of employment of the previous license holder, the pipefitting contractor license shall lapse.\nThe board shall prescribe by rule procedures for application for and issuance of contractor licenses.\nAll unlicensed individuals, other than pipefitter apprentices, must be registered under subdivision 4. No licensed high pressure piping contractor shall employ an unlicensed individual to assist in the practical construction and installation of high pressure piping and appurtenances unless the unlicensed individual is registered with the department. A pipefitter apprentice or registered unlicensed individual employed by a high pressure piping contractor may assist in the practical construction and installation of high pressure piping and appurtenances only while under direct supervision of a licensed master high pressure pipefitter or licensed journeyworker high pressure pipefitter employed by the same high pressure piping contractor. The licensed master high pressure pipefitter or licensed journeyworker high pressure pipefitter shall supervise no more than two pipefitter apprentices or registered unlicensed individuals. The licensed master high pressure pipefitter or journeyworker high pressure pipefitter is responsible for ensuring that all high pressure piping work performed by the pipefitter apprentice or registered unlicensed individual complies with Minnesota Statutes and Minnesota Rules.\nAn unlicensed individual may register to assist in the practical construction and installation of high pressure piping and appurtenances while in the employ of a licensed high pressure piping contractor by completing and submitting to the commissioner a registration form provided by the commissioner, with all fees required by section 326B.092. The board may prescribe rules, not inconsistent with this section, for the registration of unlicensed individuals.\nApplications for initial registration may be submitted at any time. Registration must be renewed annually and shall be valid for one calendar year beginning January 1.\nAs a condition of licensing, each applicant for a high pressure piping contractor license shall give and maintain a bond to the state in the total sum of $15,000 conditioned upon the faithful and lawful performance of all work contracted for or performed within the state. The bond shall run to and be for the benefit of persons injured or suffering financial loss by reason of failure of payment or performance. Claims and actions on the bond may be brought according to sections 574.26 to 574.38.\nThe term of the bond must be concurrent with the term of the high pressure pipefitting contractor license and run without interruption from the date of the issuance of the license to the end of the calendar year. All high pressure pipefitting contractor licenses must be annually renewed on a calendar year basis.\nThe bond must be filed with the department and shall be in lieu of any other contractor license bonds required by any political subdivision for high pressure pipefitting. The bond must be written by a corporate surety licensed to do business in the state.\nIn addition to the bond described in subdivision 5, each applicant for a high pressure pipefitting contractor license or renewal shall have in force public liability insurance, including products liability insurance, with limits of at least $100,000 per person and $300,000 per occurrence and property damage insurance with limits of at least $50,000.\nThe insurance must be kept in force for the entire term of the high pressure pipefitting contractor license, and the license shall be suspended by the department if at any time the insurance is not in force.\nThe insurance must be written by an insurer licensed to do business in the state and shall be in lieu of any other insurance required by any subdivision of government for high pressure pipefitting. Each person holding a high pressure pipefitting contractor license shall maintain on file with the department a certificate evidencing the insurance. In the event of a policy cancellation, the insurer shall send written notice to the commissioner at the same time that a cancellation request is received from or a notice is sent to the insured.\nFor purposes of calculating license, registration, and renewal fees required under section 326B.092:\n(1) the registration of an unlicensed individual under subdivision 4 is an entry level license;\n(2) a journeyworker high pressure pipefitter license is a journeyworker license;\n(3) a master high pressure pipefitter license is a master license; and\n(4) a high pressure piping contractor license is a business license.\n(a) The commissioner may enter into reciprocity agreements for personal licenses with another state if approved by the board. Once approved by the board, the commissioner may issue a personal license without requiring the applicant to pass an examination provided the applicant:\n(1) submits an application under this section;\n(2) pays the application and examination fee and license fee required under section 326B.092; and\n(3) holds a valid comparable license in the state participating in the agreement.\n(b) Reciprocity agreements are subject to the following:\n(1) the parties to the agreement must administer a statewide licensing program that includes examination and qualifying experience or training comparable to Minnesota's licensing program;\n(2) the experience and training requirements under which an individual applicant qualified for examination in the qualifying state must be deemed equal to or greater than required for an applicant making application in Minnesota at the time the applicant acquired the license in the qualifying state;\n(3) the applicant must have acquired the license in the qualifying state through an examination deemed equivalent to the same class of license examination in Minnesota;\n(4) at the time of application, the applicant must hold a valid license in the qualifying state and have held the license continuously for at least one year before making application in Minnesota;\n(5) an applicant is not eligible for a license under this subdivision if the applicant has failed the same or greater class of license examination in Minnesota, or if the applicant's license of the same or greater class has been revoked or suspended; and\n(6) an applicant who has failed to renew a personal license for two years or more after its expiration is not eligible for a license under this subdivision.",
	"repealed": false
}