{
	"id": "18D.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/18D.305",
	"title": "18D.305 ADMINISTRATIVE ACTION.",
	"text": "The commissioner may seek to remedy violations by a written warning, administrative meeting, cease and desist, stop-use, stop-sale, removal, correction order, or other special order, seizure, stipulation, agreement, or administrative penalty, if the commissioner determines that the remedy is in the public interest.\n(a) The commissioner may, after written notice and hearing, revoke, suspend, or refuse to grant or renew a registration, permit, license, or certification if a person violates a provision of this chapter or has a history within the last three years of violations of this chapter.\n(b) The commissioner may refuse to accept an application for a registration, permit, license, or certification, and may revoke or suspend a previously issued registration, permit, license, or certification of a person from another state if that person has:\n(1) had a registration, permit, license, or certification denied, revoked, or suspended by another state for an offense reasonably related to the requirements, qualifications, or duties of a registration, permit, license, or certification issued under chapter 18B or 18C; or\n(2) been convicted of a violation, had a history of violations, or been subject to a final order imposing civil penalties authorized under the Federal Insecticide, Fungicide and Rodenticide Act (FIFRA), as amended.\n(a) The commissioner may cancel the registration of a specialty fertilizer, soil amendment, or plant amendment or refuse to register a brand of specialty fertilizer, soil amendment, or plant amendment after receiving satisfactory evidence that the registrant has used fraudulent or deceptive practices in the evasion or attempted evasion of the provisions of this chapter.\n(b) Registration may not be revoked until the registrant has been given opportunity for a hearing by the commissioner.\n(a) The commissioner may cancel a license issued under this chapter after receiving satisfactory evidence that the licensee has used fraudulent and deceptive practices in the evasion or attempted evasion of the provisions of this chapter.\n(b) A license may not be revoked until the licensee has been given opportunity for a hearing by the commissioner.\n(a) The commissioner may cancel the approval of a facility or equipment if:\n(1) hazards to people's lives, adjoining property, or the environment exist; or\n(2) there is satisfactory evidence that the person to whom the approval was issued has used fraudulent or deceptive practices to evade or attempt to evade the provisions of this chapter.\n(b) An approval may not be canceled until the person has been given an opportunity for a hearing by the commissioner.\n(a) If a person is not available for service of an order, the commissioner may attach the order to the agricultural chemical container, rinsate, equipment, or device or facility and notify the owner, custodian, other responsible party, or registrant.\n(b) The agricultural chemical container, rinsate, equipment, or device may not be sold, used, or removed until the agricultural chemical container, rinsate, equipment, or device has been released under conditions specified by the commissioner, by an administrative law judge, or by a court.",
	"repealed": false
}