{
	"id": "144A.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.62",
	"title": "144A.62 RESIDENT ATTENDANTS.",
	"text": "(a) Upon federal approval, a nursing home may employ resident attendants to assist with the activities authorized under subdivision 2. The resident attendant will not be counted in the minimum staffing requirements under section 144A.04, subdivision 7.\n(b) The commissioner shall submit by May 15, 2000, a request for a federal waiver necessary to implement this section.\n\"Resident attendant\" means an individual who assists residents in a nursing home with the activities of eating and drinking. A resident attendant does not include an individual who:\n(1) is a licensed health professional or a registered dietitian;\n(2) volunteers without monetary compensation; or\n(3) is a registered nursing assistant.\n(a) A nursing home may not use on a full-time or other paid basis any individual as a resident attendant in the nursing home unless the individual:\n(1) has completed a training and competency evaluation program encompassing the tasks the individual provides;\n(2) is competent to provide feeding and hydration services; and\n(3) is under the supervision of the director of nursing.\n(b) A nursing home may not use a current employee as a resident attendant unless the employee satisfies the requirements of paragraph (a) and volunteers to be used in that capacity.\nThe training and competency evaluation program may be facility based. It must include, at a minimum, the training and competency standards for eating and drinking assistance contained in the nursing assistant training curriculum.\nA person seeking employment as a resident attendant is subject to the criminal background check requirements.\nEmployees shall not be subject to disciplinary action if they choose not to volunteer under this section.\nResident attendants are subject to requirements for volunteer feeding assistants in Minnesota Rules, part 4658.0530.\nA resident attendant may not be assigned to feed any resident who:\n(1) is at risk of choking while eating or drinking;\n(2) presents significant behavior management challenges while eating or drinking; or\n(3) presents other risk factors that may require emergency intervention.",
	"repealed": false
}