{
	"id": "205.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.065",
	"title": "205.065 PRIMARIES.",
	"text": "A municipal primary for the purpose of nominating elective officers may be held in any city on the second Tuesday in August of any year in which a municipal general election is to be held for the purpose of electing officers. The date of a municipal primary held in an odd-numbered year may be postponed for inclement weather as provided in section 205.105.\nThe governing body of a city may, by ordinance or resolution adopted by April 15 in the year when a municipal general election is held, elect to choose nominees for municipal offices by a primary as provided in this section. The resolution or ordinance, when adopted, is effective for all ensuing municipal elections until it is revoked. The municipal clerk shall notify the secretary of state and the county auditor within 30 days after the adoption of the resolution or ordinance.\n[Repealed, 1994 c 646 s 28]\nThe clerk shall place upon the primary ballot without partisan designation the names of individuals whose candidacies have been filed and for whom the proper filing fee has been paid. When not more than twice the number of individuals to be elected to a municipal office file for nomination for the office, their names shall not be placed upon the primary ballot and shall be placed on the municipal general election ballot as the nominees for that office. When more than one council member is to be elected for full terms at the same election, the candidates' names shall be placed under one office on the ballot with the number to be elected to the office specified directly underneath the title and identification of the office.\nThe municipal primary shall be conducted and the returns made in the manner provided for the state primary so far as practicable. The canvass may be conducted on either the second or third day after the primary.\nThe governing body of the municipality shall canvass the returns, and the two candidates for each office who receive the highest number of votes, or a number of candidates equal to twice the number of individuals to be elected to the office, who receive the highest number of votes, shall be the nominees for the office named. Their names shall be certified to the municipal clerk who shall place them on the municipal general election ballot without partisan designation and without payment of an additional fee.\nA losing candidate at the municipal primary may request a recount of the votes for that nomination subject to the requirements of section 204C.36.\n[Repealed, 2011 c 65 s 9]",
	"repealed": false
}