{
	"id": "88.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.17",
	"title": "88.17 PERMISSION TO START FIRES; PROSECUTION FOR UNLAWFULLY STARTING FIRES.",
	"text": "(a) Permission to start a fire to burn vegetative materials and other materials allowed by Minnesota Statutes or official state rules and regulations may be given by the commissioner or the commissioner's agent. This permission shall be in the form of:\n(1) a written permit issued by a forest officer, fire warden, or other person authorized by the commissioner;\n(2) an electronic permit issued by the commissioner, an agent authorized by the commissioner, or an Internet site authorized by the commissioner; or\n(3) a general permit adopted by the county board of commissioners according to paragraph (c).\n(b) Written and electronic burning permits shall set the time and conditions by which the fire may be started and burned. The permit shall also specifically list the materials that may be burned. The permittee must have the permit on their person and shall produce the permit for inspection when requested to do so by a forest officer, conservation officer, or other peace officer. The permittee shall remain with the fire at all times and before leaving the site shall completely extinguish the fire. A person shall not start or cause a fire to be started on any land that is not owned or under their legal control without the written permission of the owner, lessee, or an agent of the owner or lessee of the land. Violating or exceeding the permit conditions shall constitute a misdemeanor and shall be cause for the permit to be revoked.\n(c) A general burning permit may be adopted by the county board of commissioners in counties that are determined by the commissioner either to not be wildfire areas as defined in section 88.01, subdivision 6, or to otherwise have low potential for damage to life and property from wildfire. The commissioner shall consider the history of and potential for wildfire; the distribution of trees, brush, grasslands, and other vegetative material; and the distribution of property subject to damage from escaped fires. Upon a determination by the commissioner and adoption by a vote of the county board, permission for open burning is extended to all residents in the county without the need for individual written or electronic permits under this subdivision, provided burning conforms to all other provisions of this chapter, including those related to responsibility to control and extinguish fires, no burning of prohibited materials, and liability for damages caused by violations of this chapter.\n(d) Upon adoption of a general burning permit, a county must establish specific regulations by ordinance, to include at a minimum the time when and conditions under which fires may be started and burned. No ordinance may be less restrictive than state law.\n(e) At any time when the commissioner or the county board determines that a general burning permit is no longer in the public interest, the general permit may be canceled by the commissioner or the county board.\n[Repealed, 1993 c 328 s 32]\nThe following special permits are required at all times, including when the ground is snow-covered:\n(a) Fire training. A permit to start a fire for the instruction and training of firefighters, including liquid fuels training, may be given by the commissioner or agent of the commissioner. Except for owners or operators conducting fire training in specialized industrial settings pursuant to applicable federal, state, or local standards, owners or operators conducting open burning for the purpose of instruction and training of firefighters with regard to structures must use only fuel materials as outlined in the current edition of National Fire Protection Association 1403, Standard on Live Fire Training Evolutions, and obtain the applicable live burn documents in accordance with the current edition of the Board of Firefighter Training and Education's live burn plan established according to section 299N.02, subdivision 3, paragraph (a), clause (2).\n(b) Permanent tree and brush open burning sites. A permit for the operation of a permanent tree and brush burning site may be given by the commissioner or agent of the commissioner. Applicants for a permanent open burning site permit shall submit a complete application on a form provided by the commissioner. Existing permanent tree and brush open burning sites must submit for a permit within 90 days of the passage of this statute for a burning permit. New site applications must be submitted at least 90 days before the date of the proposed operation of the permanent open burning site. The application must be submitted to the commissioner and must contain:\n(1) the name, address, and telephone number of all owners of the site proposed for use as the permanent open burning site;\n(2) if the operator for the proposed permanent open burning site is different from the owner, the name, address, and telephone number of the operator;\n(3) a general description of the materials to be burned, including the source and estimated quantity, dimensions of the site and burn pile areas, hours and dates of operation, and provisions for smoke management; and\n(4) a topographic or similarly detailed map of the site and surrounding area within a one-mile circumference showing all structures that might be affected by the operation of the site.\n(c) Only trees, tree trimmings, or brush that cannot be disposed of by an alternative method such as chipping, composting, or other method shall be permitted to be burned at a permanent open burning site. A permanent tree and brush open burning site must be located and operated so as not to create a nuisance or endanger water quality. The commissioner shall revoke the permit or order actions to mitigate threats to public health, safety, and the environment in the event that permit conditions are violated.\nThere is created in the state treasury a burning permit account within the natural resources fund where all fees collected under this section shall be deposited.\n(a) The annual fees for an electronic burning permit are:\n(1) $5 for a noncommercial burning permit; and\n(2) for commercial enterprises that obtain multiple permits, $5 per permit for each burning site, up to a maximum of $50 per individual business enterprise per year.\n(b) Except for the issuing fee under paragraph (c), money received from permits issued under this section shall be deposited in the state treasury and credited to the burning permit account and, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, is annually appropriated to the commissioner of natural resources for the costs of operating the burning permit system.\n(c) Of the fee amount collected under paragraph (a), $1 shall be retained by the permit agent as a commission for issuing electronic permits.\n(d) Fire wardens who issue written permits may charge a fee of up to $1 for each permit issued, to be retained by the fire warden as a commission for issuing the permit. This paragraph does not limit a local government unit from charging an administrative fee for issuing open burning permits within its jurisdiction.",
	"repealed": false
}