{
	"id": "270C.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.22",
	"title": "270C.22 COST OF LIVING ADJUSTMENT.",
	"text": "(a) The commissioner shall annually make a cost of living adjustment to the dollar amounts noted in sections that reference this section. The commissioner shall adjust the amounts based on the index as provided in this section. For purposes of this section, \"index\" means the Chained Consumer Price Index for All Urban Consumers published by the Bureau of Labor Statistics. The values of the index used to determine the adjustments under this section are the latest published values when the Bureau of Labor Statistics publishes the initial value of the index for August of the year preceding the year to which the adjustment applies.\n(b) For the purposes of this section, \"statutory year\" means the year preceding the first year for which dollar amounts are to be adjusted for inflation under sections that reference this section. For adjustments under chapter 290A, the statutory year refers to the year in which a taxpayer's household income used to calculate refunds under chapter 290A was earned and not the year in which refunds are payable. For all other adjustments, the statutory year refers to the taxable year unless otherwise specified.\n(c) To determine the dollar amounts for taxable year 2020, the commissioner shall determine the percentage change in the index for the 12-month period ending on August 31, 2019, and increase each of the unrounded dollar amounts in the sections referencing this section by that percentage change. For each subsequent taxable year, the commissioner shall increase the dollar amounts by the percentage change in the index from August 31 of the year preceding the statutory year to August 31 of the year preceding the taxable year.\n(d) To determine the dollar amounts for refunds payable in 2020 under chapter 290A, the commissioner shall determine the percentage change in the index for the 12-month period ending on August 31, 2019, and increase each of the unrounded dollar amounts in the sections referencing this section by that percentage change. For each subsequent year, the commissioner shall increase the dollar amounts by the percentage change in the index from August 31 of the statutory year to August 31 of the year preceding the year in which refunds are payable.\n(e) Unless otherwise provided, the commissioner shall round the amounts as adjusted to the nearest $10 amount. If an amount ends in $5, the amount is rounded up to the nearest $10 amount.\nThe commissioner shall announce and publish the adjusted dollar amounts required by subdivision 1 on the Department of Revenue's website on or before December 15 of each year.\nThe determination of the commissioner under this subdivision is not a rule and is not subject to the Administrative Procedure Act under chapter 14, including section 14.386.",
	"repealed": false
}