{
	"id": "356.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.415",
	"title": "356.415 POSTRETIREMENT ADJUSTMENTS; STATEWIDE RETIREMENT PLANS.",
	"text": "(a) Recipients of a retirement annuity, disability benefit, or survivor benefit from the general state employees retirement plan, the legislators retirement plan, or the unclassified state employees retirement program are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) effective January 1, 2019, through December 31, 2023, a postretirement increase of one percent must be applied each year to the amount of the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment;\n(2) effective January 1, 2019, through December 31, 2023, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, a postretirement increase of 1/12 of one percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of the annuitant or benefit recipient;\n(3) effective January 1, 2024, and thereafter, a postretirement increase of 1.5 percent must be applied each year to the amount of the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment; and\n(4) effective January 1, 2024, and thereafter, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of 1.5 percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of the annuitant or benefit recipient.\n(b) An increase in annuity or benefit payments under this subdivision must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the covered retirement plan requesting that the increase not be made.\n(a) Retirement annuity, disability benefit, or survivor benefit recipients of the correctional state employees retirement plan are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) a postretirement increase of 1.5 percent must be applied each year to the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment; and\n(2) for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of 1.5 percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of each annuitant or benefit recipient.\n(b) An increase in annuity or benefit payments under this subdivision must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the applicable covered retirement plan requesting that the increase not be made.\n(a) Annuities, disability benefits, and survivor benefits being paid from the general employees retirement plan of the Public Employees Retirement Association shall be increased effective each January 1 by the percentage of increase determined under this subdivision. The increase to the annuity or benefit shall be determined by multiplying the monthly amount of the annuity or benefit by the percentage of increase specified in paragraph (b), after taking into account any reduction to the percentage of increase required under paragraph (c).\n(b) The percentage of increase shall be one percent unless the federal Social Security Administration has announced a cost-of-living adjustment pursuant to United States Code, title 42, section 415(i), in the last quarter of the preceding calendar year that is greater than two percent. If the cost-of-living adjustment announced by the federal Social Security Administration is greater than two percent, the percentage of increase shall be 50 percent of the cost-of-living adjustment announced by the federal Social Security Administration, but in no event may the percentage of increase exceed 1.5 percent.\n(c)(1) If the recipient of an annuity, disability benefit, or survivor's benefit has been receiving the annuity or benefit for at least 12 full months as of the June 30 of the calendar year immediately before the effective date of the increase, there is no reduction in the percentage of increase.\n(2) If the recipient of an annuity, disability benefit, or survivor's benefit has been receiving the annuity or benefit for at least one month, but less than 12 full months, as of the June 30 of the calendar year immediately preceding the effective date of the increase, the percentage of increase is multiplied by a fraction, the numerator of which is the number of months the annuity or benefit was received as of June 30 of the preceding calendar year and the denominator of which is 12.\n(d) An increase in annuity or benefit payments under this section must be made automatically unless written notice is filed by the recipient with the executive director of the Public Employees Retirement Association requesting that the increase not be made.\n(a) Retirement annuity, disability benefit, or survivor benefit recipients of the public employees police and fire retirement plan are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) for each annuitant or benefit recipient who will have been receiving an annuity or benefit for at least 36 full months as of the immediate preceding June 30, a postretirement increase of one percent must be applied each year to the amount of the monthly annuity or benefit of the annuitant or benefit recipient; or\n(2) for each annuitant or benefit recipient who has been receiving the annuity or benefit for at least 25 full months, but less than 36 months as of the immediate preceding June 30, a postretirement increase of 1/12 of one percent for each full month that the person has been receiving an annuity or benefit during the fiscal year in which the annuity or benefit was effective must be applied each year to the amount of the monthly annuity or benefit of the annuitant or benefit recipient.\n(b) An increase in annuity or benefit payments under this section must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the Public Employees Retirement Association requesting that the increase not be made.\n(a) Except as set forth in paragraph (d), recipients of a retirement annuity, disability benefit, or survivor benefit from the Teachers Retirement Association are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) effective January 1, 2019, through December 31, 2023, a postretirement increase of one percent must be applied each year to the amount of the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment;\n(2) effective January 1, 2019, through December 31, 2023, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, a postretirement increase of 1/12 of one percent for each month the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of the annuitant or benefit recipient;\n(3) effective January 1, 2024, and thereafter, a postretirement increase must be applied each year to the amount of the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment, at the following rates:\n(4) effective January 1, 2024, and thereafter, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months, as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of the applicable percentage for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of the annuitant or benefit recipient. The applicable percentages are the following:\n(b) An increase in annuity or benefit payments under this section must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the Teachers Retirement Association requesting that the increase not be made.\n(c) The retirement annuity payable to a person who retires before becoming eligible for Social Security benefits and who has elected the optional payment as provided in section 354.35 must be treated as the sum of a period-certain retirement annuity and a life retirement annuity for the purposes of any postretirement adjustment. The period-certain retirement annuity plus the life retirement annuity must be the annuity amount payable until age 62, 65, or normal retirement age, as selected by the member at retirement, for an annuity amount payable under section 354.35. A postretirement adjustment granted on the period-certain retirement annuity must terminate when the period-certain retirement annuity terminates.\n(d) Members who retire on or after July 1, 2024, are entitled to an annual postretirement adjustment of the member's retirement annuity, effective as of each January 1, beginning with the year following the year in which the member attains normal retirement age, as follows:\n(1) if a member has been receiving an annuity for at least 12 full months as of the June 30 of the calendar year immediately before the date of the adjustment, a postretirement increase equal to the percentage specified in paragraph (a), clause (3), must be applied, effective on January 1, to the amount of the member's monthly annuity;\n(2) if a member has been receiving an annuity for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the date of adjustment, a postretirement increase of 1/12 of the applicable percentage specified in paragraph (a), clause (4), for each month that the member has been receiving an annuity must be applied, effective on January 1, to the amount of the member's monthly annuity; or\n(3) if a member has been receiving an annuity for fewer than seven months as of the January 1 of the year following the year in which the member attains normal retirement age, a postretirement adjustment shall be applied effective as of the next January 1. The amount of the adjustment shall be determined under clause (2).\n(e) Paragraph (d) does not apply to members who retire under section 354.44, subdivision 6, paragraph (c), clause (3), or who retire when the member is at least age 62 and has at least 30 years of service under section 354.44, subdivision 6, paragraph (c), (d), (e), or (f), as applicable.\n(a) Retirement annuity, disability benefit, or survivor benefit recipients of the State Patrol retirement plan are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) a postretirement increase of one percent must be applied each year to the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment; and\n(2) for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of one percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit of each annuitant or benefit recipient.\n(b) An increase in annuity or benefit payments under this subdivision must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the applicable covered retirement plan requesting that the increase not be made.\n(a) Recipients of a retirement annuity, disability benefit, or survivor benefit from the judges retirement plan are entitled to an annual postretirement adjustment, effective as of each January 1, as follows:\n(1) through December 31, 2021, a postretirement increase of 1.75 percent must be applied each year to the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment;\n(2) through December 31, 2021, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of 1.75 percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit;\n(3) effective January 1, 2022, and thereafter, a postretirement increase of 1.5 percent must be applied each year to the monthly annuity or benefit of each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least 12 full months as of the June 30 of the calendar year immediately before the adjustment; and\n(4) effective January 1, 2022, and thereafter, for each annuitant or benefit recipient who has been receiving an annuity or a benefit for at least one full month, but less than 12 full months as of the June 30 of the calendar year immediately before the adjustment, an annual postretirement increase of 1/12 of 1.5 percent for each month that the person has been receiving an annuity or benefit must be applied to the amount of the monthly annuity or benefit.\n(b) An increase in annuity or benefit payments under this subdivision must be made automatically unless written notice is filed by the annuitant or benefit recipient with the executive director of the applicable covered retirement plan requesting that the increase not be made.\n(a) Annuities, disability benefits, and survivor benefits being paid from the local government correctional retirement plan of the Public Employees Retirement Association shall be increased effective each January 1 by the percentage of increase determined under this subdivision. The increase to the annuity or benefit shall be determined by multiplying the monthly amount of the annuity or benefit by the percentage of increase specified in paragraph (b), after taking into account any reduction to the percentage of increase required under paragraph (d).\n(b) As of each January 1, the percentage of increase must be one percent unless the federal Social Security Administration has announced a cost-of-living adjustment pursuant to United States Code, title 42, section 415(i), in the last quarter of the preceding calendar year that is greater than one percent. If the cost-of-living adjustment announced by the federal Social Security Administration is greater than one percent, the percentage of increase must be the same as the cost-of-living adjustment announced by the federal Social Security Administration, but in no event may the percentage of increase exceed the applicable maximum percentage in effect on January 1 under paragraph (c).\n(c) The applicable maximum percentage in effect on January 1 is 2.5 percent, unless either of the following is true, in which case the applicable maximum percentage is 1.5 percent:\n(1) the market value of assets equals or is less than 85 percent of the actuarial accrued liabilities as reported by the plan's actuary in the most recent two consecutive annual actuarial valuations; or\n(2) the market value of assets equals or is less than 80 percent of the actuarial accrued liabilities as reported by the plan's actuary in the most recent annual actuarial valuation. If, on January 1 after a year during which the applicable maximum percentage was 1.5 percent, neither clause (1) or (2) is true, then the applicable maximum percentage is 2.5 percent.\n(d) (1) If the recipient of an annuity, disability benefit, or survivor's benefit has been receiving the annuity or benefit for at least 12 full months as of the June 30 of the calendar year immediately before the effective date of the increase, there is no reduction in the percentage of increase.\n(2) If the recipient of an annuity, disability benefit, or survivor's benefit has been receiving the annuity or benefit for at least one month, but less than 12 full months, as of the June 30 of the calendar year immediately preceding the effective date of the increase, the percentage of increase is multiplied by a fraction, the numerator of which is the number of months the annuity or benefit was received as of June 30 of the preceding calendar year and the denominator of which is 12.\n(e) An increase in annuity or benefit payments under this section must be made automatically unless written notice is filed by the recipient with the executive director of the Public Employees Retirement Association requesting that the increase not be made.\nThe provisions of this section apply to the following retirement plans:\n(1) the legislators retirement plan established under chapter 3A, including constitutional officers as specified in that chapter;\n(2) the correctional state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(3) the general state employees retirement plan of the Minnesota State Retirement System established under chapter 352;\n(4) the State Patrol retirement plan established under chapter 352B;\n(5) the general employees retirement plan of the Public Employees Retirement Association established under chapter 353;\n(6) the public employees police and fire retirement plan of the Public Employees Retirement Association established under chapter 353;\n(7) the local government correctional employees retirement plan of the Public Employees Retirement Association established under chapter 353E;\n(8) the teachers retirement plan established under chapter 354; and\n(9) the judges retirement plan established under chapter 490.\n[Repealed, 2014 c 296 art 10 s 3]",
	"repealed": false
}