{
	"id": "103E.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.245",
	"title": "103E.245 PRELIMINARY SURVEY AND PRELIMINARY SURVEY REPORT.",
	"text": "The engineer shall proceed promptly to:\n(1) examine the petition and order;\n(2) make a preliminary survey of the area likely to be affected by the proposed drainage project to enable the engineer to determine whether the proposed drainage project is necessary and feasible with reference to the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1;\n(3) examine and gather information related to determining whether the proposed drainage project substantially affects areas that are public waters; and\n(4) if the proposed drainage project requires construction of an open channel, examine the nature and capacity of the outlet and any necessary extension.\nThe engineer shall restrict the preliminary survey to the drainage area described in the petition, except that to secure an outlet the engineer may run levels necessary to determine the distance for the proper fall of the water. The preliminary survey must consider the impact of the proposed drainage project on the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1. The drainage authority may have other areas surveyed after:\n(1) giving notice by mail of a hearing to survey additional areas, to be held at least ten days after the notice is mailed, to the petitioners and persons liable on the petitioners' bond;\n(2) holding the hearing;\n(3) obtaining consent of the persons liable on the petitioners' bond; and\n(4) ordering the additional area surveyed by the engineer.\nThe engineer may approve and include as a part of the report, a project of the United States relating to drainage or flood control that is within the proposed drainage project area, and may accept data, plats, plans, or information relating to the project furnished by United States engineers. The engineer does not need to make the preliminary survey if the material furnished by the United States is sufficient for the engineer to make the preliminary survey report.\nThe engineer shall report the proposed drainage project plan or recommend a different practical plan. The report must give sufficient information, in detail, to inform the drainage authority on issues related to feasibility, and show changes necessary to make the proposed plan practicable and feasible including extensions, laterals, and other work. If the engineer finds the proposed drainage project in the petition is feasible and complies with the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1, the engineer shall include in the preliminary survey report a preliminary plan of the drainage project showing the proposed ditches, tile, laterals, and other improvements, the outlet of the project, the watershed of the drainage project or system, and the property likely to be affected and its known owners. The plan must show:\n(1) the elevation of the outlet and the controlling elevations of the property likely to be affected referenced to standard sea level datum, if practical;\n(2) the probable size and character of the ditches and laterals necessary to make the plan practicable and feasible;\n(3) the character of the outlet and whether it is sufficient;\n(4) the probable cost of the drains and improvements shown on the plan;\n(5) all other information and data necessary to disclose the practicability, necessity, and feasibility of the proposed drainage project;\n(6) consideration of the drainage project under the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1; and\n(7) other information as ordered by the drainage authority.",
	"repealed": false
}