{
	"id": "360.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.55",
	"title": "360.55 EXEMPTIONS.",
	"text": "Subject to the exceptions set forth in section 360.532, any aircraft owned by a nonresident of this state and transiently or temporarily using the air space overlying this state or the airports thereof shall be exempt from taxation under the provisions of sections 360.511 to 360.67 unless it uses the air space overlying this state or the airports thereof for more than 60 days in any fiscal year. The operation of an aircraft in the air space overlying this state or the use of airports within this state for any purpose at any time during one day shall be considered as use for one complete day. Aircraft owned by nonresidents, on the ground at an airport in this state for major repairs, shall not be considered as using the airports of this state while being repaired and while awaiting return to the nonresident owner; provided however, such waiting period shall not exceed 60 days from completion of the repairs.\nAircraft owned and used solely in the transaction of official business by representatives of foreign powers, by the federal government, or by the state or any municipality thereof are exempt from the provisions of sections 360.54 to 360.67 requiring the payment of a tax, but all such aircraft, except those owned by representatives of foreign powers or by the federal government, must be registered as required by sections 360.54 to 360.67. The exemption herein provided does not apply to any aircraft except those owned by representatives of foreign powers or by the federal government and except those aircraft as may be used in general police work, unless the name of the state department or the municipality owning the aircraft is plainly printed on both sides thereof in letters of a size and character to be prescribed by the commissioner.\nAny aircraft owned and used solely in the transaction of official business by any unit of the Civil Air Patrol under United States Code, title 36, chapter 403, whether or not the title to the aircraft is retained by the federal government or vested in such unit unconditionally, is exempt from the provisions of sections 360.54 to 360.57 requiring the payment of tax, but all such aircraft must be registered as required by sections 360.54 to 360.57.\n(a) For purposes of this subdivision:\n(1) \"antique aircraft\" means an aircraft constructed by the original manufacturer, or its licensee, on or before December 31, 1945, with the exception of certain pre-World War II aircraft models that had only a small postwar production, such as Beechcraft Staggerwing, Fairchild 24, and Monocoupe; and\n(2) \"classic aircraft\" means an aircraft constructed by the original manufacturer, or its licensee, on or after January 1, 1946, and has a first year of life that precedes the date of registration by at least 50 years.\n(b) If an antique or classic aircraft is owned and operated solely as a collector's item, its owner may list it for taxation and registration as follows: A sworn affidavit must be executed stating (1) the name and address of the owner, (2) the name and address of the person from whom purchased, (3) the aircraft's make, year, model number, federal aircraft registration number, and manufacturer's identification number, and (4) that the aircraft is owned and operated solely as a collector's item and not for general transportation or commercial operations purposes. The affidavit must be filed with the commissioner along with a fee of $25.\n(c) Upon satisfaction that the affidavit is true and correct, the commissioner shall issue to the applicant a registration certificate. The registration certificate is valid without renewal as long as the owner operates the aircraft solely as a collector's item.\n(d) Should an antique or classic aircraft be operated other than as a collector's item, the registration certificate becomes void and the owner shall list the aircraft for taxation and registration in accordance with the other provisions of sections 360.511 to 360.67.\n(e) Upon the sale of an antique or classic aircraft, the new owner must list the aircraft for taxation and registration in accordance with this subdivision, including the payment of a $5 fee to transfer the registration to the new owner, or the other provisions of sections 360.511 to 360.67, whichever is applicable.\n(a) An aircraft that has a base price for tax purposes under section 360.531 of $10,000 or less, and that is owned and operated solely for recreational purposes, may be listed for taxation and registration by executing a sworn affidavit stating (1) the name and address of the owner, (2) the name and address of the person from whom purchased, (3) the aircraft's make, year, model number, federal aircraft registration number, and manufacturer's identification number, and (4) that the aircraft is owned and operated solely as a recreational aircraft and not for commercial operational purposes. The affidavit must be filed with the commissioner along with an annual $25 fee.\n(b) On being satisfied that the affidavit is true and correct, the commissioner shall issue to the applicant a registration certificate.\n(c) Should the aircraft be operated other than as a recreational aircraft, the owner shall list the aircraft for taxation and registration and pay the appropriate registration fee under sections 360.511 to 360.67.\n(d) If the aircraft is sold, the new owner shall list the aircraft for taxation and registration under this subdivision, including the payment of the annual $25 fee, or under sections 360.511 to 360.67, whichever is applicable.\nIf an aircraft registered with the state of Minnesota is temporarily removed from service for a period not to exceed 30 days for maintenance and repair, and a like or similar aircraft is substituted for it, the substituted aircraft is exempt from the Minnesota aircraft registration tax during the period of substitution. The exemption is only permitted if the principal aircraft is removed from the state for maintenance and repair. The exemption is not permitted if the principal aircraft is removed from service in the state for scheduling or other purposes.\nThe owner of the principal aircraft shall notify the commissioner of transportation of the identity of the principal aircraft being removed from the state, the date of removal, and the date that the principal aircraft being removed is returned to service in the state of Minnesota. Similar information shall be reported to the commissioner regarding the substituted aircraft. The information shall be delivered to the commissioner within five days after removal of the principal aircraft and within five days after the substitution of the substitute aircraft, as the case may be. No refunds of aircraft registration taxes shall be made for principal aircraft removed from the state in accordance with this subdivision.\nAny hot air balloon shall be registered for an annual registration fee of $25. The registration fee is in lieu of the taxes provided for in sections 360.511 to 360.67. For the purpose of this subdivision, hot air balloon means any lighter-than-air aircraft that is not engine driven.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\nAircraft registered with the Federal Aviation Administration as restricted category aircraft used for agricultural purposes must be listed for taxation and registration upon filing by the owner a sworn affidavit with the commissioner. The affidavit must state:\n(1) the name and address of the owner;\n(2) the name and address of the person from whom purchased;\n(3) the aircraft's make, year, model number, federal registration number, and manufacturer's identification number; and\n(4) that the aircraft is owned and operated solely for agricultural operations and purposes.\nThe owner shall file the affidavit and pay an annual fee established under sections 360.511 to 360.67, which must not exceed $500. Should the aircraft be operated other than for agricultural purposes, the owner shall list the aircraft for taxation and registration under sections 360.511 to 360.67. If the aircraft is sold, the new owner shall list the aircraft for taxation and registration under this subdivision or under sections 360.511 to 360.67, as applicable.\n(a) Any small unmanned aircraft system in which the unmanned aircraft weighs less than 55 pounds at takeoff, including payload and anything affixed to the aircraft, either:\n(1) must be registered in the state for an annual fee of $25; or\n(2) is not subject to registration or an annual fee if the unmanned aircraft system is owned and operated solely for recreational purposes.\n(b) An unmanned aircraft system that meets the requirements under paragraph (a) is exempt from aircraft registration tax under sections 360.511 to 360.67.",
	"repealed": false
}