{
	"id": "458D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.03",
	"title": "458D.03 SANITARY BOARD.",
	"text": "A sanitary board with jurisdiction in the Western Lake Superior Sanitary District is established as a public corporation and political subdivision of the state with perpetual succession and all the rights, powers, privileges, immunities, and duties which may be validly granted to or imposed upon a municipal corporation, as provided in sections 458D.01 to 458D.24.\nThe board shall be composed of nine members selected as follows:\n(a) The mayor of the city of Duluth shall select four members and shall designate the term of each such member in accordance with subdivision 5, subject to the approval of the Duluth City Council.\n(b) The Cloquet City Council by majority vote shall select three members and shall designate the term of each member in accordance with subdivision 5.\n(c) The elected chief executives of all other municipalities in the district in the county of Carlton shall elect one member. The auditor of the county of Carlton shall, upon at least ten days' notice by mail, call a meeting of such chief executives, to be held at a suitable place in the district designated in the notice by the auditor. At the meeting, said chief executives shall elect the board member. A majority of the elected chief executives present in person or by their duly designated representatives shall constitute a quorum, but less than a majority may adjourn the meeting from time to time and compel the attendance of absent chief executives or their duly designated representatives. Each chief executive shall have one vote and an additional vote for each full 1,000 population in the municipality according to the latest census. The majority of the votes cast by the chief executives present and voting shall be required for election of the board member. Any chief executive may designate some other elected official of the same governing body of the municipality to attend the meeting in the chief executive's place and exercise the same voting power to which the chief executive would be entitled if present.\n(d) The elected chief executives of all other municipalities in the district in the county of St. Louis shall elect one member. The auditor of the county of St. Louis shall, upon at least ten days' notice by mail, call a meeting of such chief executives, to be held at a suitable place in the district designated in the notice by the auditor. At the meeting, such chief executives shall elect the board member. A majority of the elected chief executives present in person or by their duly designated representatives shall constitute a quorum, but less than a majority may adjourn the meeting from time to time and compel the attendance of absent chief executives or their duly designated representatives. Each chief executive shall have one vote and an additional vote for each full 1,000 population in the municipality according to the latest census. The majority of the votes cast by the chief executives present and voting shall be required for election of the board member. Any chief executive may designate some other elected official of the same governing body of the municipality to attend the meeting in the chief executive's place and exercise the same voting power to which the chief executive would be entitled if present.\nThe nine board members to be selected under subdivision 2, paragraphs (a), (b), (c) and (d), shall be selected as hereinbefore provided within 60 days after July 8, 1971. The successor to each board member shall be selected at any time within 60 days before the expiration of the term in the same manner as the predecessor was selected. Any vacancy on the board shall be filled within 60 days after it occurs. If any selection is not made as hereinbefore provided within the time prescribed therefor, the chief judge of the Sixth Judicial District of the Minnesota District Court on application by any interested person shall forthwith appoint an eligible person to the board with like effect as if the selection were made as hereinabove or otherwise provided.\nIf the office of any board member becomes vacant, the vacancy shall be filled for the unexpired term in like manner as provided for selection of the member who vacated the office. The office shall be deemed vacant under the conditions specified in section 351.02, or if the member fails to attend two consecutive regular meetings of the board without the consent of the board given no later than 30 days after the second such meeting.\nThe terms of the first board members shall expire on July 1 in the following calendar years: Two of the board members selected under subdivision 2, paragraph (a), and one of the board members selected under subdivision 2, paragraph (b), in the year 1972; another board member selected under subdivision 2, paragraph (a), and another board member selected under subdivision 2, paragraph (b), in the year 1973; another board member selected under subdivision 2, paragraph (a), another board member selected under subdivision 2, paragraph (b), and the board member elected under subdivision 2, paragraph (d), in the year 1974. Succeeding terms of all board members shall be three years, except that each member shall serve until a successor has been duly selected and qualified.\nA board member may be removed by the governor for malfeasance or nonfeasance in the performance of official duties as provided by sections 351.14 to 351.23.\nEach board member shall be a resident of the district and may but need not be an elected public official.\nA certificate of selection of every board member selected under subdivision 2, paragraphs (a) and (b), stating the term for which the member was selected, shall be made by the respective city clerks, and a certificate of selection of the board member elected pursuant to subdivision 2, paragraphs (c) and (d), shall be made by the respective county auditors. Such certificates, with the approval appended by other authority, if required, shall be filed with the secretary of state. Counterparts thereof shall be furnished to the board member and the secretary of the board. Each member shall qualify by taking and subscribing the oath of office prescribed by the Minnesota Constitution, article 5, section 6. Such oath, duly certified by the official administering the same, shall be filed with the secretary of state and the secretary of the board.\nEach board member shall be paid a per diem compensation of $50 for meetings and for such other services as are specifically authorized by the board, and shall be reimbursed for all reasonable expenses incurred in the performance of the member's duties as determined by the board.",
	"repealed": false
}