{
	"id": "16A.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.013",
	"title": "16A.013 GIFTS; ACCEPTANCE.",
	"text": "The commissioner of management and budget is authorized to receive and accept, on behalf of the state, any gift, bequest, devise, or endowment which may be made by any person, by will, deed, gift, or otherwise, to or for the benefit of the state, or any of its departments or agencies, or to or in aid, or for the benefit, support, or maintenance of any educational, charitable, or other institution maintained in whole or in part by the state, or for the benefit of students, employees, or inmates thereof, or for any proper state purpose or function, and the money, property, or funds constituting such gift, bequest, devise, or endowment. No such gift, bequest, devise, or endowment shall be so accepted unless the commissioner of management and budget determines that it is for the interest of the state to accept it, and approve of and direct the acceptance. If a gift, bequest, devise, or endowment is money or other negotiable instruments, then the deposit of it does not constitute acceptance. In the event that the money or other negotiable instruments are deposited but not approved, the amount deposited must be refunded. When, in order to effect the purpose for which any gift, bequest, devise, or endowment has been accepted, it is necessary to sell property so received, the commissioner of management and budget, upon request of the authority in charge of the agency, department, or institution concerned, may sell it at a price which shall be fixed by the State Board of Investment.\nWhen a charitable trust is created by will or otherwise for the benefit of the state or any of its departments or agencies or to or in aid, or for the benefit, support or maintenance of any educational, charitable, or other institution maintained in whole or in part by the state, or for the benefit of students, employees, or inmates thereof and any officer or employee of the state or any of its departments or agencies is named in the trust instrument as trustee, it shall be presumed that such trust is a gift to be administered under this section and the courts shall construe the instrument creating the trust accordingly.\nWhenever the gift, bequest, devise, or endowment referred to in subdivisions 1 and 2 consists of real property, or an interest therein, which is subject to a contract for the conveyance thereof made by the donor or a predecessor in interest with another, or of the vendor's interest, or some portion thereof, in such a contract for conveyance, the commissioner of management and budget is authorized, on behalf of and in the name of the state of Minnesota, upon receipt from the vendee under such contract for conveyance, or the vendee's personal representatives or assigns, of such amounts as are due the state or the department, agency, or institution involved, to execute a deed conveying to such vendee, or the vendee's personal representatives or assigns, all the right, title, and interest of the state of Minnesota in and to the real property involved.\nIn case of default by the purchaser, or the purchaser's personal representatives or assigns, in the conditions of any such contract for the conveyance of real estate, the commissioner of management and budget is authorized, in the name of the state of Minnesota, to terminate such contract under and pursuant to the provisions of Minnesota Statutes 1941, section 559.21.\nThe provisions of subdivisions 3 and 4 apply to gifts, bequests, devises, or endowments heretofore made.",
	"repealed": false
}