{
	"id": "103F.227",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.227",
	"title": "103F.227 SHORELAND DEVELOPMENT; EXISTING RESORTS.",
	"text": "This section applies statewide and preempts local ordinances that are inconsistent with its terms. A county or municipality may by ordinance impose upon resorts reasonable regulations to prevent and abate nuisances and to protect the public health, welfare, safety, and environment.\nFor purposes of this section, \"resort\" means a shoreland commercial establishment, existing on or before August 1, 2007, that includes buildings, lodges, structures, dwelling units, camping or recreational vehicle sites, or enclosures, or any part thereof kept, used, maintained, or advertised as or held out to the public to be a place where sleeping accommodations are furnished to the public, primarily to persons seeking recreation, for periods of one day or longer, and having for rent three or more cabins, rooms, campsites, or enclosures. A shoreland commercial establishment must be primarily service oriented for transient lodging of guests. All cabins, rooms, dwelling units, camping or recreational vehicle sites, or enclosures must be included in the resort rental business. Resorts must not allow residential use of a dwelling unit or site, except dwellings used as residences for the service providers. To qualify as a resort under this section, a resort must be fully licensed and permitted under appropriate state and local regulations. The entire parcel of land must be controlled and managed by the licensee.\n(a) So long as the establishment continues to operate as a resort, a county or municipality must allow a resort owner to:\n(1) maintain structures, including the replacement of aging or outdated components or systems of the structure, while not increasing the structure's footprint on the land; and\n(2) replace structures damaged or lost to fire or natural disaster.\n(b) Paragraph (a), clause (2), applies only when an application for a building permit is made within 180 days of the damage or loss.\nA county or municipality must allow a resort owner to increase a structure footprint to minimally meet federal, state, or local dwelling standards or codes. To \"minimally meet\" the standards or codes means that the replacement structure does not add new architectural elements, such as more bedrooms, that did not exist in the original structure. Structural expansion under this subdivision must not result in a structure that is any larger than required to meet standards or codes or a structure or any portion that is any closer to the shoreline than prior to the expansion.\nA change in ownership of a resort shall not be construed as a conversion to a different use so long as the new owner continues to use the property as a resort.",
	"repealed": false
}