{
	"id": "142G.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.11",
	"title": "142G.11 ELIGIBILITY; CITIZENSHIP.",
	"text": "(a) To be eligible for MFIP, a member of the assistance unit must be a citizen of the United States, a qualified noncitizen as defined in section 142G.02, or a noncitizen who is otherwise residing lawfully in the United States.\n(b) A qualified noncitizen who entered the United States on or after August 22, 1996, is eligible for MFIP. However, TANF dollars cannot be used to fund the MFIP benefits for an individual under this paragraph for a period of five years after the date of entry unless the qualified noncitizen meets one of the following criteria:\n(1) was admitted to the United States as a refugee under United States Code, title 8, section 1157;\n(2) was granted asylum under United States Code, title 8, section 1158;\n(3) was granted withholding of deportation under the United States Code, title 8, section 1253(h);\n(4) is a veteran of the United States armed forces with an honorable discharge for a reason other than noncitizen status, or is a spouse or unmarried minor dependent child of the same; or\n(5) is an individual on active duty in the United States armed forces, other than for training, or is a spouse or unmarried minor dependent child of the same.\n(c) A person who is not a qualified noncitizen but who is otherwise residing lawfully in the United States is eligible for MFIP. However, TANF dollars cannot be used to fund the MFIP benefits for an individual under this paragraph.\n(d) For purposes of this subdivision, a nonimmigrant in one or more of the classes listed in United States Code, title 8, section 1101(a)(15) (A)-(S) and (V), or an undocumented immigrant who resides in the United States without the approval or acquiescence of the United States Citizenship and Immigration Services, is not eligible for MFIP.\nState dollars shall fund the food portion of a noncitizen's MFIP benefits when federal Supplemental Nutrition Assistance Program (SNAP) dollars cannot be used to fund those benefits. The assistance provided under this subdivision, which is designated as a supplement to replace lost benefits under the federal SNAP, must be disregarded as income in all programs that do not count SNAP benefits as income where the commissioner has the authority to make the income disregard determination for the program.\nLegal adult noncitizens who have resided in the country for four years or more as a lawful permanent resident, whose benefits are funded entirely with state money, and who are under 70 years of age, must, as a condition of eligibility:\n(1) be enrolled in a literacy class, English as a second language class, or a citizen class;\n(2) be applying for admission to a literacy class, English as a second language class, and is on a waiting list;\n(3) be in the process of applying for a waiver from the United States Citizenship and Immigration Services of the English language or civics requirements of the citizenship test;\n(4) have submitted an application for citizenship to the United States Citizenship and Immigration Services and is waiting for a testing date or a subsequent swearing in ceremony; or\n(5) have been denied citizenship due to a failure to pass the test after two attempts or because of an inability to understand the rights and responsibilities of becoming a United States citizen, as documented by the United States Citizenship and Immigration Services or the county.\nIf the county social service agency determines that a legal noncitizen subject to the requirements of this subdivision will require more than one year of English language training, then the requirements of clause (1) or (2) shall be imposed after the legal noncitizen has resided in the country for three years. Individuals who reside in a facility licensed under chapter 142B, 144A, 144G, or 256I are exempt from the requirements of this subdivision.",
	"repealed": false
}