{
	"id": "152.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.32",
	"title": "152.32 PROTECTIONS FOR REGISTRY PROGRAM OR TRIBAL MEDICAL CANNABIS PROGRAM PARTICIPATION.",
	"text": "(a) There is a presumption that a patient enrolled in the registry program under sections 152.22 to 152.37 or a Tribal medical cannabis program patient is engaged in the authorized use of medical cannabis.\n(b) The presumption may be rebutted by evidence that:\n(1) a patient's conduct related to use of medical cannabis was not for the purpose of treating or alleviating the patient's qualifying medical condition or symptoms associated with the patient's qualifying medical condition; or\n(2) a Tribal medical cannabis program patient's use of medical cannabis was not for a purpose authorized by the Tribal medical cannabis program.\n(a) Subject to section 152.23, the following are not violations under this chapter:\n(1) use or possession of medical cannabis or medical cannabis products by a patient enrolled in the registry program; possession by a registered designated caregiver or the parent, legal guardian, or spouse of a patient if the parent, legal guardian, or spouse is listed on the registry verification; or use or possession of medical cannabis or medical cannabis products by a Tribal medical cannabis program patient;\n(2) possession, dosage determination, or sale of medical cannabis or medical cannabis products by a medical cannabis manufacturer, employees of a manufacturer, a Tribal medical cannabis program manufacturer, employees of a Tribal medical cannabis program manufacturer, a laboratory conducting testing on medical cannabis, or employees of the laboratory; and\n(3) possession of medical cannabis or medical cannabis products by any person while carrying out the duties required under sections 152.22 to 152.37.\n(b) Medical cannabis obtained and distributed pursuant to sections 152.22 to 152.37 and associated property is not subject to forfeiture under sections 609.531 to 609.5316.\n(c) The commissioner, members of a Tribal medical cannabis board, the commissioner's or Tribal medical cannabis board's staff, the commissioner's or Tribal medical cannabis board's agents or contractors, and any health care practitioner are not subject to any civil or disciplinary penalties by the Board of Medical Practice, the Board of Nursing, or by any business, occupational, or professional licensing board or entity, solely for participation in the registry program under sections 152.22 to 152.37 or in a Tribal medical cannabis program. A pharmacist licensed under chapter 151 is not subject to any civil or disciplinary penalties by the Board of Pharmacy when acting in accordance with the provisions of sections 152.22 to 152.37. Nothing in this section affects a professional licensing board from taking action in response to violations of any other section of law.\n(d) Notwithstanding any law to the contrary, the commissioner, the governor of Minnesota, or an employee of any state agency may not be held civilly or criminally liable for any injury, loss of property, personal injury, or death caused by any act or omission while acting within the scope of office or employment under sections 152.22 to 152.37.\n(e) Federal, state, and local law enforcement authorities are prohibited from accessing the patient registry under sections 152.22 to 152.37 except when acting pursuant to a valid search warrant.\n(f) Notwithstanding any law to the contrary, neither the commissioner nor a public employee may release data or information about an individual contained in any report, document, or registry created under sections 152.22 to 152.37 or any information obtained about a patient participating in the program, except as provided in sections 152.22 to 152.37.\n(g) No information contained in a report, document, or registry or obtained from a patient under sections 152.22 to 152.37 or from a Tribal medical cannabis program patient may be admitted as evidence in a criminal proceeding unless independently obtained or in connection with a proceeding involving a violation of sections 152.22 to 152.37.\n(h) Notwithstanding section 13.09, any person who violates paragraph (e) or (f) is guilty of a gross misdemeanor.\n(i) An attorney may not be subject to disciplinary action by the Minnesota Supreme Court, a Tribal court, or the professional responsibility board for providing legal assistance to prospective or registered manufacturers or others related to activity that is no longer subject to criminal penalties under state law pursuant to sections 152.22 to 152.37, or for providing legal assistance to a Tribal medical cannabis program or a Tribal medical cannabis program manufacturer.\n(j) The following do not constitute probable cause or reasonable suspicion, and shall not be used to support a search of the person or property of the person possessing or applying for the registry verification or equivalent, or otherwise subject the person or property of the person to inspection by any governmental agency:\n(1) possession of a registry verification or application for enrollment in the registry program by a person entitled to possess a registry verification or apply for enrollment in the registry program; or\n(2) possession of a verification or equivalent issued by a Tribal medical cannabis program or application for enrollment in a Tribal medical cannabis program by a person entitled to possess such a verification or application.\n(a) No school or landlord may refuse to enroll or lease to and may not otherwise penalize a person solely for the person's status as a patient enrolled in the registry program under sections 152.22 to 152.37 or for the person's status as a Tribal medical cannabis program patient, unless failing to do so would violate federal law or regulations or cause the school or landlord to lose a monetary or licensing-related benefit under federal law or regulations.\n(b) For the purposes of medical care, including organ transplants, a registry program enrollee's use of medical cannabis under sections 152.22 to 152.37, or a Tribal medical cannabis program patient's use of medical cannabis as authorized by the Tribal medical cannabis program, is considered the equivalent of the authorized use of any other medication used at the discretion of a physician, advanced practice registered nurse, or physician assistant and does not constitute the use of an illicit substance or otherwise disqualify a patient from needed medical care.\n(c) Unless a failure to do so would violate federal law or regulations or cause an employer to lose a monetary or licensing-related benefit under federal law or regulations, an employer may not discriminate against a person in hiring, termination, or any term or condition of employment, or otherwise penalize a person, if the discrimination is based upon any of the following:\n(1) the person's status as a patient enrolled in the registry program under sections 152.22 to 152.37;\n(2) the person's status as a Tribal medical cannabis program patient; or\n(3) a patient's positive drug test for cannabis components or metabolites, unless the patient used, possessed, or was impaired by medical cannabis on the premises of the place of employment or during the hours of employment.\n(d) An employee who is required to undergo employer drug testing pursuant to section 181.953 may present verification of enrollment in the patient registry or of enrollment in a Tribal medical cannabis program as part of the employee's explanation under section 181.953, subdivision 6.\n(e) A person shall not be denied custody of a minor child or visitation rights or parenting time with a minor child solely based on the person's status as a patient enrolled in the registry program under sections 152.22 to 152.37, or on the person's status as a Tribal medical cannabis program patient. There shall be no presumption of neglect or child endangerment for conduct allowed under sections 152.22 to 152.37 or under a Tribal medical cannabis program, unless the person's behavior is such that it creates an unreasonable danger to the safety of the minor as established by clear and convincing evidence.",
	"repealed": false
}