{
	"id": "17.114",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.114",
	"title": "17.114 SUSTAINABLE AGRICULTURE.",
	"text": "To assure the viability of agriculture in this state, the commissioner shall investigate, demonstrate, report on, and make recommendations on the current and future sustainability of agriculture in this state. The Department of Agriculture is the lead state agency on sustainable agriculture and integrated pest management.\nFor purposes of this section, the following definitions apply:\n(a) \"Sustainable agriculture\" represents the best aspects of traditional and modern agriculture by using a fundamental understanding of nature as well as the latest scientific advances to create integrated, self-reliant, resource conserving practices that enhance the enrichment of the environment and provide short- and long-term productive and economical agriculture.\n(b) \"Integrated pest management\" means use of a combination of approaches, incorporating the judicious application of ecological principles, management techniques, cultural and biological controls, and chemical methods, to keep pests below levels where they do economic damage.\nThe commissioner shall:\n(1) establish a clearinghouse and provide information, appropriate educational opportunities and other assistance to individuals, producers, and groups about sustainable agricultural techniques, practices, and opportunities;\n(2) survey producers and support services and organizations to determine information and research needs in the area of sustainable agricultural practices;\n(3) demonstrate the on-farm applicability of sustainable agriculture practices to conditions in this state;\n(4) coordinate the efforts of state agencies regarding activities relating to sustainable agriculture;\n(5) direct the programs of the department so as to work toward the sustainability of agriculture in this state;\n(6) inform agencies of how state or federal programs could utilize and support sustainable agriculture practices;\n(7) work closely with farmers, the University of Minnesota, and other appropriate organizations to identify opportunities and needs as well as assure coordination and avoid duplication of state agency efforts regarding research, teaching, and extension work relating to sustainable agriculture; and\n(8) work cooperatively with local governments and others to strengthen the connection between farmers who practice sustainable farming methods and urban, rural, and suburban consumers, including, but not limited to, promoting local farmers' markets and community-supported agriculture.\n[Repealed, 1994 c 557 s 6]\n(a) The state shall promote and facilitate the use of integrated pest management through education, technical or financial assistance, information and research.\n(b) The commissioner shall coordinate the development of a state approach to the promotion and use of integrated pest management, which shall include delineation of the responsibilities of the state, public postsecondary institutions, Minnesota Extension Service, local units of government, and the private sector; establishment of information exchange and integration; procedures for identifying research needs and reviewing and preparing informational materials; procedures for factoring integrated pest management into state laws, rules, and uses of pesticides; and identification of barriers to adoption.",
	"repealed": false
}