{
	"id": "103D.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.635",
	"title": "103D.635 REPAIRS AND IMPROVEMENTS EXCEEDING NORMAL MAINTENANCE.",
	"text": "The managers shall order the engineer to prepare and submit to the managers technical and cost specifications on the work necessary to restore or improve the project to the desired level of operating efficiency before ordering repairs other than normal and routine maintenance if the engineer certifies to the managers, in the annual report or otherwise, that:\n(1) a project of the watershed district is in such a state of disrepair that the project cannot be restored by normal and routine maintenance to the same condition as when it was originally constructed or subsequently improved;\n(2) a ditch or channel must be widened or deepened; or\n(3) a project of the watershed district must be altered or improved to attain the level of operating efficiency contemplated at the time of the original construction or implementation.\nThe managers shall set a date for a hearing on the report and give notice of the hearing in the same manner as in the original proceeding on the construction of the improvement after receiving the engineer's report.\n(a) The managers may order the repair or improvement and assess the cost against the benefited properties if, after a hearing, the managers find that the repair or improvement is in compliance with the plan, is necessary to accomplish the purposes of this chapter, and that the cost of the repair or improvement will not exceed its benefits. The cost of the repair or improvement shall be apportioned and assessed pro rata upon all property that was assessed for the construction or implementation of the project.\n(b) A single levy for the repair or improvement may not exceed the amount of benefits originally determined. The managers shall file a copy of the order for levy with the auditor of each affected county. The auditor shall extend the levy against affected properties as in proceedings for the levy, assessment, and collection of assessments in drainage proceedings conducted under sections 103E.601 to 103E.631.",
	"repealed": false
}