{
	"id": "48.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.152",
	"title": "48.152 STATE BANK ACQUISITION AND LEASING OF PERSONAL PROPERTY.",
	"text": "A state bank may acquire and lease or participate in the acquisition and leasing of personal property to customers, and may incur such additional obligations as may be incidental to becoming an owner and lessor of such property, subject to the rules of the commissioner and the conditions specified in this section.\nThe property must be acquired upon the specific request of and for the use of a customer.\nThe lease may not be an operating lease, but must be a \"net\" lease wherein the bank retains no obligation for maintenance or operation of the property.\nThe lease must be a full-payout, noncancelable obligation of the lessee serving the same purpose as other forms of bank financing. For the purposes of this subdivision a full-payout lease is one in which the lessor will realize from the transaction a return of its full investment in the leased property plus the estimated cost to it of financing the property over the term of the lease in rentals, estimated tax benefits, and the estimated residual value of the property at the expiration of the initial term of the lease. In all instances where the bank estimates and uses the residual value of leased property to satisfy the requirements of a full-payout lease, the estimated value must be reasonable so that the bank's primary risk in the overall transaction depends on the credit worthiness of the lessee and not market value of the leased item; provided, that in no event shall the estimated residual value exceed 25 percent of the original cost of the property to the lessor. As an alternative to this test, residual values may be set at any level where the bank receives a guarantee of the residual value from the manufacturer, the lessee, or any third party which is not an affiliate of the bank, and where it has determined that the guarantor has the resources to meet the guarantee. Selection of residual values at unreasonable levels shall be considered an unsafe and unsound banking practice if it cannot be shown that, at the time of such selection, the bank made a good faith effort to be accurate and reasonable.\nFor purposes of leasing to government entities \"full-payout\" calculations may be based on reasonably anticipated future renewals.\nIf, in good faith, the bank believes that there has been a significant unanticipated change in conditions which threatens its financial position by increasing its exposure to loss, and, if its interest in the property is sufficient to justify action, the limitation contained in subdivision 3 shall not prevent the bank from taking any reasonable and appropriate action to salvage or protect the value of the property to prevent loss.\nThe terms of the lease shall require periodic rental payments to be made at least annually.\nThe terms of the lease shall establish a rental payment schedule by which no individual rental payment shall exceed the average rental payment by more than 50 percent, the average rental payment to be computed by dividing the total dollar amount of rental payments to be made over the term of the lease by the number of payments to be made.\nExcept upon the written approval of the commissioner, the term of the lease shall not exceed 12 years, 32 days.\nThe total amount of unpaid rental obligations of a customer to a bank on personal property, shall constitute a liability of the customer within the meaning of section 48.24, subdivisions 1 and 4.\n[Repealed, 1983 c 80 s 2]\nThe acquisition of personal property for leasing to customers under this section not in conformity with subdivision 4 is authorized if the total investment in this personal property does not exceed 200 percent of the sum of the bank's capital actually paid in cash and its actual surplus fund.",
	"repealed": false
}