{
	"id": "80B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/80B.11",
	"title": "80B.11 CIVIL LIABILITIES.",
	"text": "Any offeror who purchases a security in connection with a takeover offer in violation of sections 80B.01 to 80B.13 shall be liable to the person selling the security to the offeror who may sue either at law or in equity. In an action for rescission the seller shall be entitled to recover the security, plus any income received by the purchaser thereon, upon tender of the consideration received. Tender requires only notice of willingness to pay the amount specified in exchange for the security. Any notice may be given by service as in civil actions or by certified mail to the last known address of the person liable. Damages are the excess of either the value of the security on the date of purchase or its present value, whichever is greater, over the present value of the consideration received for the security.\nEvery person who directly or indirectly controls a person liable under subdivision 1, every partner, principal executive officer or director of such person, every person occupying a similar status or performing similar functions, every employee of such person who materially aids in the act or transaction constituting the violation, and every broker-dealer or agent who materially aids in the act or transaction constituting the violation, is also liable jointly or severally with and to the same extent as such person. Persons who would otherwise be so liable but who prove that they did not know, and in the exercise of reasonable care could not have known, of the existence of the facts by reason of which the liability is alleged to exist are not liable. There is contribution as in cases of contract among the several persons so liable.\nNo action may be maintained under this section unless commenced before the expiration of three years after the act or transaction constituting the violation or the expiration of one year after the discovery of the facts constituting the violation, whichever first expires.\nThe rights and remedies under sections 80B.01 to 80B.13 are in addition to any other rights or remedies that may exist at law or in equity.",
	"repealed": false
}