{
	"id": "245D.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.24",
	"title": "245D.24 COMMUNITY RESIDENTIAL SETTINGS; PHYSICAL PLANT AND ENVIRONMENT.",
	"text": "The residence must meet the definition of a dwelling unit in a residential occupancy.\nThe living area must be provided with an adequate number of furnishings for the usual functions of daily living and social activities. The dining area must be furnished to accommodate meals shared by all persons living in the residence. These furnishings must be in good repair and functional to meet the daily needs of the persons living in the residence.\n(a) Each person receiving services must have a choice of roommate and must mutually consent, in writing, to sharing a bedroom with one another. No more than two people receiving services may share one bedroom.\n(b) A single occupancy bedroom must have at least 80 square feet of floor space with a 7-1/2 foot ceiling. A double occupancy room must have at least 120 square feet of floor space with a 7-1/2 foot ceiling. Bedrooms must be separated from halls, corridors, and other habitable rooms by floor-to-ceiling walls containing no openings except doorways and must not serve as a corridor to another room used in daily living.\n(c) A person's personal possessions and items for the person's own use are the only items permitted to be stored in a person's bedroom.\n(d) Unless otherwise documented through assessment as a safety concern for the person, each person must be provided with the following furnishings:\n(1) a separate bed of proper size and height for the convenience and comfort of the person, with a clean mattress in good repair;\n(2) clean bedding appropriate for the season for each person;\n(3) an individual cabinet, or dresser, shelves, and a closet, for storage of personal possessions and clothing; and\n(4) a mirror for grooming.\n(e) When possible, a person must be allowed to have items of furniture that the person personally owns in the bedroom, unless doing so would interfere with safety precautions, violate a building or fire code, or interfere with another person's use of the bedroom. A person may choose not to have a cabinet, dresser, shelves, or a mirror in the bedroom, as otherwise required under paragraph (d), clause (3) or (4). A person may choose to use a mattress other than an innerspring mattress and may choose not to have the mattress on a mattress frame or support. If a person chooses not to have a piece of required furniture, the license holder must document this choice and is not required to provide the item. If a person chooses to use a mattress other than an innerspring mattress or chooses not to have a mattress frame or support, the license holder must document this choice and allow the alternative desired by the person.\n(f) A person must be allowed to bring personal possessions into the bedroom and other designated storage space, if such space is available, in the residence. The person must be allowed to accumulate possessions to the extent the residence is able to accommodate them, unless doing so is contraindicated for the person's physical or mental health, would interfere with safety precautions or another person's use of the bedroom, or would violate a building or fire code. The license holder must allow for locked storage of personal items. Any restriction on the possession or locked storage of personal items, including requiring a person to use a lock provided by the license holder, must comply with section 245D.04, subdivision 3, paragraph (c), and allow the person to be present if and when the license holder opens the lock.\n(g) A person must be allowed to lock the person's bedroom door. The license holder must document and assess the physical plant and the environment, and the population served, and identify the risk factors that require using locked doors, and the specific action taken to minimize the safety risk to a person receiving services at the site.",
	"repealed": false
}