{
	"id": "481.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/481.15",
	"title": "481.15 REMOVAL OR SUSPENSION.",
	"text": "An attorney at law may be removed or suspended by the supreme court for any one of the following causes arising after admission to practice:\n(1) Upon being convicted of a felony, or of a misdemeanor involving moral turpitude, (in either of which cases the record of conviction shall be conclusive evidence). This clause shall not be construed to apply to a conviction for contempt of court;\n(2) Upon a showing that the attorney has knowingly signed a frivolous pleading, or been guilty of any deceit or willful professional misconduct;\n(3) For willful disobedience of an order of court requiring the attorney to do or forbear an act connected with or in the course of the attorney's profession;\n(4) For a willful violation of the attorney's oath, or of any duty imposed upon an attorney by law.\nProceedings in the cases may be taken by the supreme court on its own motion, for matter within its knowledge, or upon accusation. Accusations may be made to the clerk of the appellate courts and shall be investigated, prosecuted, heard and determined in accordance with rules made by the supreme court. The supreme court may refer any accusation to any person, and the person shall have all the powers of a referee under the Rules of Civil Procedure. Objections to the referee may be filed within ten days of the appointment and shall be heard and determined by the supreme court. The referee shall report the evidence and, if directed by the supreme court, shall make findings on it. Persons designated by the supreme court under the authority of this section shall be paid their necessary expenses and compensation fixed by the supreme court. Officers and witnesses necessarily employed or called by the prosecution shall receive the fees and mileage allowed by law. The supreme court shall fix a reasonable compensation for the reporter. All expenses, fees and compensation authorized shall be paid upon itemized vouchers approved by one of the justices of the supreme court.\n[Repealed, 1981 c 356 s 377]",
	"repealed": false
}