{
	"id": "116R.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.06",
	"title": "116R.06 BONDS; OPTIONAL ORDER AND CONTRACT PROVISIONS.",
	"text": "Any order authorizing any bonds or any issue of bonds or any indenture may contain provisions, which may be a part of the contract with the holders of the bonds, as to the matters referred to in this section.\n(a) It may pledge or create a lien on money or property and any money held in trust or otherwise by others to secure the payment of the bonds or of any series or issue of bonds and interest thereon and of any sums due to the trustee under the indenture, and may grant different priorities in the lien for different series of bonds, subject to any agreements with bondholders which exist.\n(b) It may provide for the custody, collection, securing, investment, and payment of money.\n(c) It may set aside reserves or sinking funds and provide for their regulation and disposition and may create other special funds into which money may be deposited.\n(d) It may limit the loans and securities to which the proceeds of sale of bonds may be applied and may pledge repayments thereon to secure the payment of the bonds or of any series or issue of bonds.\n(e) It may limit the issuance of additional bonds, the terms upon which additional bonds may be issued and secured, and the refunding of outstanding or other bonds.\n(f) It may prescribe the procedure, if any, by which the terms of any contract with bondholders may be amended or abrogated, the amount of bonds the holders of which must consent to the amendment or abrogation, and the manner in which that consent may be given.\n(g) It may vest in a trustee or trustees property, rights, powers, and duties in trust determined by the commissioner, which may include any or all of the rights, powers, and duties of the bondholders, or may limit the rights, powers, and duties of the trustee. It may make contracts with a trustee or trustees authorizing the trustee or trustees to invest in investments that may be invested in by the state Board of Investment under section 11A.24, and apply, or dispose of and use money in any account.\n(h) It may define the acts or omissions to act which constitute a default in the obligations and duties of the commissioner and may provide for the rights and remedies of the holders of bonds in the event of a default, and provide any other matters of like or different character, consistent with the general laws of the state and other provisions of sections 116R.01 to 116R.15, which in any way affect the security or protection of the bonds and the rights of the bondholders.\n(i) It may incur obligations under the indenture or under any paying agency, bond registrar agreement or escrow agreement to pay the compensation and expenses of the trustee, paying agent, bond registrar or escrow agent for the bonds and to pay any sums required to be rebated to the United States to comply with applicable tax laws; and a sum sufficient to satisfy these obligations is annually appropriated to the commissioner from the general fund to the extent other revenues available for that purpose are insufficient.",
	"repealed": false
}