{
	"id": "142E.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.51",
	"title": "142E.51 INVESTIGATIONS OF FINANCIAL MISCONDUCT.",
	"text": "The department shall investigate alleged or suspected financial misconduct by providers and errors related to payments issued by the child care assistance program under this chapter. Recipients, employees, and staff may be investigated when the evidence shows that their conduct is related to the financial misconduct of a provider, license holder, or controlling individual. When the alleged or suspected financial misconduct relates to acting as a recruiter offering conditional employment on behalf of a provider that has received funds from the child care assistance program, the department may investigate the provider, center owner, director, manager, license holder, or other controlling individual or agent, who is alleged to have acted as a recruiter offering conditional employment.\nFor the purposes of this section, \"provider\" includes:\n(1) individuals or entities meeting the definition of provider in section 142E.50, subdivision 12; and\n(2) owners and controlling individuals of entities identified in clause (1).\n(a) The department may contact any person, agency, organization, or other entity that is necessary to an investigation.\n(b) The department may examine or interview any individual, document, or piece of evidence that may lead to information that is relevant to child care assistance program benefits, payments, and child care provider authorizations. This includes, but is not limited to:\n(1) child care assistance program payments;\n(2) services provided by the program or related to child care assistance program recipients;\n(3) services provided to a provider;\n(4) provider financial records of any type;\n(5) daily attendance records of the children receiving services from the provider;\n(6) billings; and\n(7) verification of the credentials of a license holder, controlling individual, employee, staff person, contractor, subcontractor, and entities under contract with the provider to provide services or maintain service and the provider's financial records related to those services.\nAfter completing its investigation, the department shall issue one of the following determinations:\n(1) no violation of child care assistance requirements occurred;\n(2) there is insufficient evidence to show that a violation of child care assistance requirements occurred;\n(3) a preponderance of evidence shows a violation of child care assistance program law, rule, or policy; or\n(4) there exists a credible allegation of fraud.\n(a) The department shall pursue an administrative disqualification, if the child care provider is accused of committing an intentional program violation, in lieu of a criminal action when it has not been pursued. Intentional program violations include intentionally making false or misleading statements; intentionally misrepresenting, concealing, or withholding facts; and repeatedly and intentionally violating program regulations under this chapter. Intent may be proven by demonstrating a pattern of conduct that violates program rules under this chapter.\n(b) To initiate an administrative disqualification, the commissioner must send written notice using a signature-verified confirmed delivery method to the provider against whom the action is being taken. Unless otherwise specified under this chapter or Minnesota Rules, chapter 3400, the commissioner must send the written notice at least 15 calendar days before the adverse action's effective date. The notice shall state (1) the factual basis for the agency's determination, (2) the action the agency intends to take, (3) the dollar amount of the monetary recovery or recoupment, if known, and (4) the provider's right to appeal the agency's proposed action.\n(c) The provider may appeal an administrative disqualification by submitting a written request to the state agency. A provider's request must be received by the state agency no later than 30 days after the date the commissioner mails the notice.\n(d) The provider's appeal request must contain the following:\n(1) each disputed item, the reason for the dispute, and, if applicable, an estimate of the dollar amount involved for each disputed item;\n(2) the computation the provider believes to be correct, if applicable;\n(3) the statute or rule relied on for each disputed item; and\n(4) the name, address, and telephone number of the person at the provider's place of business with whom contact may be made regarding the appeal.\n(e) On appeal, the issuing agency bears the burden of proof to demonstrate by a preponderance of the evidence that the provider committed an intentional program violation.\n(f) The hearing is subject to the requirements of section 142A.20. The human services judge may combine a fair hearing and administrative disqualification hearing into a single hearing if the factual issues arise out of the same or related circumstances and the provider receives prior notice that the hearings will be combined.\n(g) A provider found to have committed an intentional program violation and is administratively disqualified must be disqualified, for a period of three years for the first offense and permanently for any subsequent offense, from receiving any payments from any child care program under this chapter.\n(h) Unless a timely and proper appeal made under this section is received by the department, the administrative determination of the department is final and binding.\n[See Note.]\nIt is prohibited to hire a child care center employee when, as a condition of employment, the employee is required to have one or more children who are eligible for or receive child care assistance, if:\n(1) the individual hiring the employee is, or is acting at the direction of or in cooperation with, a child care center provider, center owner, director, manager, license holder, or other controlling individual; and\n(2) the individual hiring the employee knows or has reason to know the purpose in hiring the employee is to obtain child care assistance program funds.\n(a) After completing the determination under subdivision 4, the department may take one or more of the actions or sanctions specified in this subdivision.\n(b) The department may take the following actions:\n(1) refer the investigation to law enforcement or a county attorney for possible criminal prosecution;\n(2) refer relevant information to the department's licensing division, the child care assistance program, the Department of Education, the federal Child and Adult Care Food Program, or appropriate child or adult protection agency;\n(3) enter into a settlement agreement with a provider, license holder, controlling individual, or recipient; or\n(4) refer the matter for review by a prosecutorial agency with appropriate jurisdiction for possible civil action under the Minnesota False Claims Act, chapter 15C.\n(c) In addition to section 256.98, the department may impose sanctions by:\n(1) pursuing administrative disqualification through hearings or waivers;\n(2) establishing and seeking monetary recovery or recoupment;\n(3) issuing an order of corrective action that states the practices that are violations of child care assistance program policies, laws, or regulations, and that they must be corrected; or\n(4) suspending, denying, or terminating payments to a provider.\n(d) Upon a finding by the commissioner that any child care provider, center owner, director, manager, license holder, or other controlling individual of a child care center has employed, used, or acted as a recruiter offering conditional employment for a child care center that has received child care assistance program funding, the commissioner shall:\n(1) immediately suspend all program payments to all child care centers in which the person employing, using, or acting as a recruiter offering conditional employment is an owner, director, manager, license holder, or other controlling individual. The commissioner shall suspend program payments under this clause even if services have already been provided; and\n(2) immediately and permanently revoke the licenses of all child care centers of which the person employing, using, or acting as a recruiter offering conditional employment is an owner, director, manager, license holder, or other controlling individual.",
	"repealed": false
}