{
	"id": "162.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.021",
	"title": "162.021 NATURAL PRESERVATION ROUTES.",
	"text": "(a) The commissioner shall establish a natural preservation routes category within the county state-aid highway system.\n(b) Natural preservation routes include those routes that possess particular scenic, environmental, or historical characteristics, such as routes along lakes or through forests, wetlands, or floodplains, that would be harmed by construction or reconstruction meeting the engineering standards under section 162.07 or the rules adopted under that section.\n(c) The commissioner shall adopt rules establishing minimum construction and reconstruction standards that address public safety and reflect the function, lower traffic volume, and slower speed on natural preservation routes. The rules may not establish standards for natural preservation routes that are higher than the standards for national forest highways within national forests and state park access roads within state parks. Design standards specifying the width of vehicle recovery areas on forest highways, forest and park roads, and on natural preservation routes must minimize harmful environmental impact.\nSigns must be posted at entry points to and at regular intervals along natural preservation routes. Signs posted must conform to the commissioner's Manual on Uniform Traffic Control Devices. Properly posted signs are prima facie evidence that adequate notice of a natural preservation route has been given to the motoring public.\nWhere a county state-aid highway has been designated a natural preservation route and signs have been posted under subdivision 2, the state and the county with jurisdiction over the road and their officers and employees are exempt from liability for any tort claim for injury to persons or property arising from travel on the highway and related to its design standards for construction or reconstruction, if the design standards comply with the standards established by the commissioner under subdivision 1. This subdivision does not preclude an action for damages arising from negligence in the construction, reconstruction, or maintenance of a natural preservation route.\nA county proposing a project on a county state-aid highway that is a natural preservation route that requires removal of the entire surface of the highway shall send to owners of property abutting the highway a written notice that describes the project. The county shall hold a public meeting to discuss design and construction alternatives.\nThe commissioner may designate a county state-aid highway as a natural preservation route only on petition of the county board of the county having jurisdiction over the road. Within 60 days after a county board receives a written request to designate a county state-aid highway as a natural preservation route, the county board shall act on the request.",
	"repealed": false
}