{
	"id": "3.855",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.855",
	"title": "3.855 EMPLOYEE RELATIONS.",
	"text": "[Repealed, 1995 c 248 art 2 s 8]\n\"Commission\" means the Legislative Coordinating Commission or a legislative commission established by the coordinating commission, as provided in section 3.305, subdivision 6, to exercise the powers and discharge the duties of the coordinating commission under this section or other law requiring action by the coordinating commission on matters of public employment or compensation.\n(a) The commissioner of management and budget shall submit to the chair of the commission any compensation plans or salaries prepared under section 43A.18, subdivisions 2, 3, 3b, and 4. The chancellor of the Minnesota State Colleges and Universities shall submit any compensation plan under section 43A.18, subdivision 3a.\n(b) The proposed salary or compensation plan must be implemented upon its submission to the commission.\nThe commission shall review and approve or reject the plan for compensation, terms, and conditions of employment of classified employees in the office of the legislative auditor under section 3.971, subdivision 2.\nThe commission shall:\n(1) continually monitor the state's civil service system provided for in chapter 43A, rules of the commissioner of management and budget, and the collective bargaining process provided for in chapter 179A, as applied to state employees;\n(2) research and analyze the need for improvements in those statutory sections;\n(3) adopt rules consistent with this section relating to the scheduling and conduct of commission business and other organizational and procedural matters; and\n(4) perform other related functions delegated to it by the legislature.\nMS 2023 Supp [Repealed, 2024 c 127 art 72 s 8]\nWithin 14 days after the implementation of a collective bargaining agreement, memorandum of understanding, compensation plan, or receipt of an interest arbitration award, the commissioner of management and budget must submit to the Legislative Coordinating Commission the following:\n(1) a copy of the collective bargaining agreement or compensation plan showing changes from previous agreements and a copy of the executed agreement;\n(2) a copy of any memorandum of understanding that has a fiscal impact or interest arbitration award;\n(3) a comparison of biennial compensation costs under the current agreement or plan to the projected biennial compensation costs under the new agreement, memorandum of understanding, or interest arbitration award; and\n(4) a comparison of biennial compensation costs under the current agreement or plan to the projected biennial compensation costs for the following biennium under the new agreement, memorandum of understanding, or interest arbitration award.",
	"repealed": false
}