{
	"id": "2.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/2.92",
	"title": "2.92 ACCESS TO MULTIUNIT FACILITIES BY UNITED STATES CENSUS EMPLOYEES.",
	"text": "It is unlawful for a person, either directly or indirectly, to deny access to an apartment house, dormitory, nursing home, manufactured home park, other multiple unit facility used as a residence, or area in which two or more single-family dwellings are located on private roadways, to an employee of the United States Census Bureau who displays a current, valid census credential and who is engaged in official census business. An employee granted access under this section must be permitted to knock on the doors of individual units to speak with residents and to leave census materials for residents at their doors, except that the manager of a nursing home may direct that the materials be left at a central location within the facility. The materials must be left in an orderly manner.\nThis section does not prohibit:\n(1) denial of admittance into a particular apartment, room, manufactured home, or personal residential unit;\n(2) in the case of a nursing home or an assisted living facility licensed under chapter 144G, denial of permission to visit certain persons for valid health reasons;\n(3) limiting visits to a reasonable number of census employees or reasonable hours;\n(4) requiring a prior appointment to gain access to the facility; or\n(5) denial of admittance to or expulsion of an individual employee from a multiple unit dwelling for good cause.\nA person in compliance with United States Code, title 13, section 223, and any guidance or rules adopted by the United States Department of Commerce, Bureau of the Census, governing access to a facility described in subdivision 1 is considered to be in compliance with the requirements of this section.\nThis section applies to all decennial census activities conducted under the authority of the United States Constitution, article 1, section 2.",
	"repealed": false
}