{
	"id": "103D.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.705",
	"title": "103D.705 PROJECTS INITIATED BY PETITION.",
	"text": "(a) A project within the watershed district that generally conforms with the watershed management plan may be initiated by a project petition. A project petition must contain:\n(1) a description of the proposed project and the purpose to be accomplished;\n(2) a description of the property where the proposed project passes over or is located;\n(3) a general description of the part of the watershed district that will be affected, if less than the entire watershed district;\n(4) the necessity for the proposed project;\n(5) a statement that the proposed project will be conducive to public health, convenience, and welfare; and\n(6) a statement that the petitioners will pay all costs and expenses that may be incurred if the proceedings are dismissed or a construction or implementation contract is not awarded for the proposed project.\n(b) A petition may request that the managers adopt a resolution according to section 103D.707, subdivision 1, to allow sources of funding other than assessment to be used in whole or in part for the project. Upon adopting a requested resolution, the managers must release the deposit or bond required under subdivision 3.\n(a) The project petition must be signed by:\n(1) at least 25 percent of the property owners or the owners of more than 25 percent of the property within the limits of the area proposed to be improved, unless the project consists of the establishment of a new drainage system as defined in section 103E.005, subdivision 12, or the improvement of an existing drainage system;\n(2) if the project consists of the establishment of a new drainage system as defined in section 103E.005, subdivision 12, a majority of the owners of the property that the proposed project passes over or is located on, or the owners of at least 60 percent of the area of the property that the proposed project passes over or is located on;\n(3) if the project consists of the improvement of an existing drainage system as defined in section 103E.215, subdivision 2, at least 26 percent of the owners of the property proposed to be improved by the project or that the proposed project passes over, or the owners of at least 26 percent of the area proposed to be improved by the project or that the proposed project passes over;\n(4) a county board of a county affected by the watershed district; or\n(5) the governing body of a city entirely or partly within the area proposed to be improved.\n(b) If a proposed project improves property entirely within a city, a petition must originate from the governing body of the city.\n(c) For a signature on a project petition, holders of easements for electric or telephone transmission or distribution lines are not considered owners.\n(a) When a project petition is filed and before the managers take action on the project petition, one or more of the petitioners must deposit at least $2,000 with the managers. The deposit must be conditioned to pay all costs and expenses incurred if the project petitioned for is not constructed.\n(b) Alternatively, with the approval of the managers, one or more of the petitioners may make and file a bond payable to the watershed district named in the petition. The bond must be for at least $2,000 with adequate sureties, subject to the approval of the managers of the watershed district where the bond is filed. The bond must be conditioned to pay all costs and expenses incurred if the proceedings are dismissed or a contract is not entered into to construct the project petitioned for.\n(c) If, before a project is established, the petitioner's deposit or bond is insufficient to protect the watershed district from loss from the costs or expenses incurred or to be incurred, the watershed district must require an additional deposit or bond. Further proceedings must be stopped until an adequate deposit or bond is furnished. If the additional deposit or bond is not furnished within a time set by the managers, the proceedings may be dismissed.\n(d) In proceedings to establish a project, the expenses incurred before the project is established may not exceed the deposit or the bond furnished by the petitioners. A claim in excess of the amount of the petitioners' deposit or bond may not be audited or paid by the watershed district unless the petitioners file an additional deposit or bond within a time and in an amount directed by the managers.\n(e) If a project petition is signed by a county board or governing body of a city, a bond is not required.\nThe petitioners may dismiss the petition upon payment of costs and expenses.\nIf the managers determine that a proper project petition has been filed and that the proposed project promotes the public interest and welfare, is practicable, and conforms with the watershed management plan of the watershed district, the managers must:\n(1) identify the project by name and number; and\n(2) designate an engineer to make surveys, maps, and a report on the proposed project.",
	"repealed": false
}