{
	"id": "389.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/389.011",
	"title": "389.011 QUALIFICATIONS; FORMALITIES; PERFORMANCE OF DUTIES.",
	"text": "A county surveyor elected or appointed after July 1, 1961, or a surveyor designated to perform the professional duties of a county surveyor after July 1, 1961, must be licensed in Minnesota as a land surveyor as provided in chapter 326. The professional duties of a county surveyor include any of the duties involved in the practice of land surveying as provided in chapter 326. A county surveyor or other surveyor designated to perform the duties of a county surveyor must be licensed in Minnesota as a land surveyor while holding such office or while such designation is in effect. Failure on the part of a land surveyor to keep the license current is grounds for the board of county commissioners to declare the office vacant and to appoint a qualified person to such office. As used in this section, the term land surveyor means a surveyor licensed in Minnesota as a land surveyor.\nA county surveyor or other licensed surveyor designated to perform the duties of a county surveyor after July 1, 1961, before entering upon duties, in addition to such bond and oath of office as is required to be filed, shall record certified evidence of license as a land surveyor with the county recorder and each license period thereafter while holding such office or designation shall record certified evidence of the license renewal for the then current period with the county recorder on or before the license expiration date.\nA county surveyor holding that office on July 1, 1961, who was elected or appointed for a term beginning prior to July 1, 1959, is eligible for reelection or appointment to the office of county surveyor in the county in which last elected or appointed if subsequently elected or appointed to that office while not a licensed land surveyor, in lieu of a license as a land surveyor, the county surveyor shall record with the county recorder a certified copy of the certificate of election or the resolution of appointment for the term beginning prior to July 1, 1959.\n(1) In a county in which the office of county surveyor has not been abolished by law the board of county commissioners may by resolution adopted at least six months before the end of the term of the office of county surveyor declare its intention to fill the office by appointment. Having adopted the resolution the board of county commissioners shall fill the office of county surveyor by appointment of a land surveyor to the office not less than 30 days before the end of the term of office of the incumbent. When so appointed the county surveyor serves for such term as determined by the board beginning with the expiration of the term of the incumbent but not exceeding four years.\n(2) In a county where the office of county surveyor has not been made appointive under the provisions of this section or abolished under other provisions of law, a county surveyor must be elected in the manner provided by law. The term of office of the county surveyor is four years and until a successor is elected and qualified, and begins on the first day of January next succeeding the election.\n(3) If the office of county surveyor is vacant by reason of no qualified person having been elected to the office or the board of county commissioners having failed to appoint a person to the office, or is otherwise vacant, and no land surveyor has been designated to perform the professional duties of the office and there are duties which prior to January 1, 1961, had been the responsibility of the county surveyor, the officer requiring these duties to be performed may retain a land surveyor to perform the duties at the compensation set by the county board.\nA county surveyor appointed or elected after July 1, 1961, before entering on duties shall give bond to the state, approved by the county board, in the sum of $2,000 conditioned on the faithful discharge of the duties. The bond, together with the surveyor's oath, and certified evidence of a license as a land surveyor or the certificate of election must be recorded with the county recorder.\nNotwithstanding any other provision of law a land surveyor appointed by a board of county commissioners as a county surveyor, or a land surveyor designated by the board to perform the duties of county surveyor, need not be a resident of the county in which appointed as county surveyor or designated to perform the duties of county surveyor.",
	"repealed": false
}