{
	"id": "354A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.35",
	"title": "354A.35 SURVIVOR BENEFITS.",
	"text": "If a coordinated member or former coordinated member dies before retirement or before the receipt of any retirement annuity or other benefit payment which is or may be payable and a surviving spouse optional annuity is not payable under subdivision 2, a refund must be paid to the person's surviving spouse, or if there is none, to the person's designated beneficiary, or if there is none, to the legal representative of the person's estate. For a coordinated member or former coordinated member of the St. Paul Teachers Retirement Fund Association, the refund must be in an amount equal to the person's accumulated employee contributions plus interest at the rate of six percent per annum compounded annually.\n(a) The surviving spouse of a vested coordinated member who dies prior to retirement may elect to receive, instead of a refund with interest under subdivision 1, an annuity equal to the 100 percent joint and survivor annuity the member could have qualified for had the member terminated service on the date of death. The surviving spouse eligible for a surviving spouse benefit under this paragraph may apply for the annuity at any time after the date on which the deceased employee would have attained the required age for retirement based on the employee's allowable service. A surviving spouse eligible for surviving spouse benefits under paragraph (b) or (c) may apply for an annuity at any time after the member's death. The member's surviving spouse shall be paid a joint and survivor annuity under section 354A.32 and computed under section 354A.31.\n(b) If the member was under age 55 and has credit for at least 30 years of allowable service on the date of death, the surviving spouse may elect to receive a 100 percent joint and survivor annuity based on the age of the member and surviving spouse on the date of death. The annuity is payable using the full early retirement reduction under section 354A.31, subdivision 6, paragraph (b), to age 55 and one-half of the early retirement reduction from age 55 to the age payment begins.\n(c) If a vested member of the St. Paul Teachers Retirement Fund Association was under age 55 on the date of death but did not yet qualify for retirement, the surviving spouse may elect to receive the 100 percent joint and survivor annuity based on the age of the member and the survivor at the time of death. The annuity is payable using the full early retirement reduction under section 354A.31, subdivision 6 or 7, to age 55 and one-half of the actuarial equivalent reduction from age 55 to the date payment begins. The actuarial equivalent reduction is calculated so that the reduced annuity is the actuarial equivalent of the annuity that would be payable to the member if the member deferred receipt of the annuity and the annuity amount were augmented at an annual rate of 2.5 percent compounded annually from the day the annuity begins to accrue until the normal retirement age.\n(d) Sections 354A.37, subdivision 2, and 356.311 apply to a deferred annuity or surviving spouse benefit payable under this section. The benefits are payable for the life of the surviving spouse, or upon expiration of the term certain benefit payment under subdivision 2b.\n[Repealed, 2015 c 68 art 13 s 65]\nIn lieu of the 100 percent optional annuity under subdivision 2, or a refund under subdivision 1, the surviving spouse of a deceased member may elect to receive survivor coverage in a term certain of five, ten, 15, or 20 years, but monthly payments must not exceed 75 percent of the average high-five monthly salary of the deceased member. The monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 2.\nIf a surviving spouse elects a term certain annuity and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the survivor's estate.\nIf there is no surviving spouse eligible for benefits under subdivision 2, a dependent child or children as defined in section 354A.011, subdivision 12a, is eligible for monthly payments. Payments to a dependent child must be paid from the date of the member's death to the date the dependent child attains age 20 if the child is under age 15. If the child is 15 years or older on the date of death, payment must be made for five years. The payment to a dependent child is an amount actuarially equivalent to the value of a 100 percent optional annuity under subdivision 2 using the age of the member and age of the dependent child at the date of death. If there is more than one dependent child, each dependent child shall receive a proportionate share of the actuarial value of the employee's account.\nIf a retiree from a coordinated program dies after retirement, the retiree or the retiree's designated beneficiary shall be entitled to the annuity payment due for the full month during which death occurs unless an optional annuity was elected by the retiree pursuant to subdivision 2 or section 354A.32. If a joint and survivor optional annuity covering the spouse of the retiree was elected by the retiree from a coordinated program, the retiree's surviving spouse shall be paid a joint and survivor annuity as provided in section 354A.32 and computed pursuant to section 354A.31. If an optional annuity other than a joint and survivor optional annuity covering the spouse of the retiree was elected by the retiree from a coordinated program, the optional annuity shall be paid according to its terms.\nIf a coordinated member or former coordinated member dies without having designated a beneficiary or if the designated beneficiary dies without there existing any other designated beneficiary and prior to making application for the refund credited to the deceased coordinated member or coordinated former member, and if the amount of the refund does not exceed $1,500, the board in its discretion may, in absence of probate proceedings, make payment 90 days after the date of death of the coordinated member or former coordinated member to the surviving spouse of the deceased coordinated member or former coordinated member, or if none, to the next of kin as determined under the laws of descent of the state. A payment under this subdivision shall be a bar to recovery by any other person or persons. Any retirement annuity in any amount which has accrued at the time of the death of a coordinated retiree may be paid by the board in its discretion using the procedure set forth in this subdivision.\nAny coordinated member and the spouse of the coordinated member may make a joint specification in writing on a form prescribed by the executive secretary that the benefits provided in subdivision 1 or 2, shall be paid only to a designated beneficiary. For purposes of this subdivision, a designated beneficiary may only be either a former spouse or a child, either natural or adopted, of the member.",
	"repealed": false
}