{
	"id": "62H.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62H.10",
	"title": "62H.10 DEFINITIONS.",
	"text": "For purposes of sections 62H.10 to 62H.17, the terms in this section have the meanings given them.\n\"Agent\" means an agent as defined under section 60A.02, subdivision 7.\n\"Arrangement\" means a fund, trust, plan, program, or other mechanism by which a person provides, or attempts to provide, health care benefits to individuals.\n\"Broker\" means an agent engaged in brokerage business pursuant to section 60K.49.\n\"Collectively bargained arrangement\" means an arrangement which provides or represents that it is providing health care benefits or coverage under or pursuant to one or more collective bargaining agreements.\n\"Commissioner\" means the commissioner of commerce.\n\"Employee leasing arrangement\" means a labor leasing, staff leasing, employee leasing, contract labor, extended employee staffing or supply, or other arrangement, under contract or otherwise, whereby one business or entity leases or obtains all or a significant number of its workers from another business or entity.\n\"Employee welfare benefit plan\" means a plan, fund, or program established or maintained by an employer or by an employee organization, or by both, to the extent that the plan, fund, or program was established or is maintained for the purpose of providing for its participants or their beneficiaries, through the purchase of insurance or otherwise, medical, surgical, or hospital care or benefits, or benefits in the event of sickness, accident, disability, death, or unemployment.\n\"Fully insured by a licensed insurer\" means that, for all of the health care benefits or coverage provided or offered by or through an arrangement:\n(1) a licensed insurer is directly obligated by contract to provide all of the coverage to or under the arrangement;\n(2) the licensed insurer assumes all of the risk for payment of all covered services or benefits; and\n(3) the liability of the licensed insurer for payment of the covered services or benefits is directly to the individual employee, member, or dependent receiving the health care services.\n\"Licensed insurer\" means an insurer having a certificate of authority to transact insurance in this state.\n\"Reportable MEWA\" means a person that provides health care benefits or coverage to the employees of two or more employers. Reportable MEWA does not include:\n(1) a licensed insurer;\n(2) an arrangement which is fully insured by a licensed insurer;\n(3) a collectively bargained arrangement;\n(4) an employee welfare benefit plan established or maintained by a rural electric cooperative or a rural telephone cooperative;\n(5) an employee leasing arrangement; or\n(6) a joint self-insurance employee health plan, which includes but is not limited to multiple employee welfare arrangements and multiple employer welfare arrangements (MEWAs), having a certificate of authority to transact insurance in this state pursuant to chapter 62H.\n\"Rural electric cooperative\" means:\n(1) an organization that is exempt from tax under United States Code, title 26, section 501(a), and which is engaged primarily in providing electric service on a mutual or cooperative basis; or\n(2) an organization described in United States Code, title 26, section 501(c), paragraph (4) or (6), which is exempt from tax under United States Code, title 26, section 501(a), and at least 80 percent of the members of which are organizations described in clause (1).\n\"Rural telephone cooperative\" means an organization described in United States Code, title 26, section 501(c), paragraph (4) or (6), which is exempt from tax under United States Code, title 26, section 501(a), and at least 80 percent of the members of which are organizations engaged primarily in providing telephone service to rural areas of the United States on a mutual, cooperative, or other basis.\n\"Third-party administrator\" means a vendor of risk management services or an entity administering a self-insurance or insurance plan under section 60A.23.",
	"repealed": false
}