{
	"id": "136F.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.305",
	"title": "136F.305 Z-DEGREES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Course\" means a single unit of teaching in one subject area led by one or more instructors with a definite start and end date and a fixed roster of students.\n(c) \"Course materials\" means a hard-copy or digital book, printed pages of instructional material, including consumable workbooks, lab manuals, subscriptions, online homework and quizzing platforms, and other required physical and digital content.\n(d) \"Course section\" means an instance of a course.\n(e) \"Incentive\" means anything provided to faculty to identify, review, adapt, author, or adopt open educational resources.\n(f) \"Open educational resources\" means teaching, learning, and research materials that are in the public domain or have been released under an intellectual property license that permits their free use and repurposing by others. Open educational resources include textbooks and curricula, syllabi, lecture notes, assignments, tests, projects, audio, video, and animation.\n(g) \"Open textbook\" means a type of open educational resource released under an intellectual property license that at a minimum allows a student to obtain, retain, reuse, and redistribute the material at no cost.\n(h) \"Library-curated materials\" means diverse resources purchases by the library at no additional cost to the student for the supplementation or replacement of course materials.\n(i) \"System office\" means the Minnesota State Colleges and Universities system office.\n(j) \"Z-Degree\" means a complete associate's or bachelor's degree program that exclusively uses course materials that are no cost to students such as open educational resources, open textbooks, and library-curated materials. Students may still incur costs for printing digital materials or for the following: art supplies, calculators, equipment, fees in statute or policy mandated to be charged by all colleges and universities, campus discretionary fees established by the board and adopted by the college, personal property, and service charges or course activities having value outside of the classroom.\n(a) Three additional colleges must offer the opportunity to earn a Z-Degree by academic year 2020-2021. Four additional colleges or universities must offer the opportunity to earn a Z-Degree by academic year 2023-2024. Course offerings in a Z-Degree program must include at least two distinct courses in each transfer curriculum goal area and at least enough credits in each transfer curriculum goal area to complete the transfer curriculum package.\n(b) The Minnesota State Colleges and Universities shall support a continuous process for colleges and universities to implement Z-Degrees, expand Z-Degree courses and sections, and sustain existing Z-Degrees.\n(a) The system office must provide opportunities for faculty to identify, review, adapt, create, share, and adopt open educational resources. The system office must develop incentives to academic departments to identify, review, adapt, author, or adopt open educational resources within their academic programs.\n(b) The programs and incentives developed under this subdivision must be implemented pursuant to faculty collective bargaining agreements.\nAnnually by January 15, the board must submit reports to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education. Each report must include (1) the number of courses and course sections transitioned into a new Z-Degree, (2) the total amount of student textbook savings resulting from the transitions, and (3) information on the types of incentives developed and offered to faculty and the corresponding funding for those incentives.",
	"repealed": false
}