{
	"id": "148F.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.135",
	"title": "148F.135 PRIVATE INFORMATION; ACCESS AND RELEASE.",
	"text": "A client has the right to access and release private information maintained by the provider, including client records as provided in sections 144.291 to 144.298, relating to the provider's counseling services to that client, except as otherwise provided by law or court order.\n(a) When a client makes a request for the provider to release the client's private information, the request must be in writing and signed by the client. Informed consent is not required. When the request involves client records, all pertinent information shall be released in compliance with sections 144.291 to 144.298.\n(b) If the provider initiates the request to release the client's private information, written authorization for the release of information must be obtained from the client and must include, at a minimum:\n(1) the name of the client;\n(2) the name of the individual or entity providing the information;\n(3) the name of the individual or entity to which the release is made;\n(4) the types of information to be released, such as progress notes, diagnoses, assessment data, or other specific information;\n(5) the purpose of the release, such as whether the release is to coordinate professional care with another provider, to obtain insurance payment for services, or for other specified purposes;\n(6) the time period covered by the consent;\n(7) a statement that the consent is valid for one year, except as otherwise allowed by statute, or for a lesser period that is specified in the consent;\n(8) a declaration that the individual signing the statement has been told of and understands the nature and purpose of the authorized release;\n(9) a statement that the consent may be rescinded, except to the extent that the consent has already been acted upon or that the right to rescind consent has been waived separately in writing;\n(10) the signature of the client or the client's legally authorized representative, whose relationship to the client must be stated; and\n(11) the date on which the consent is signed.\nWhenever counseling services are provided to group clients, each client has the right to access or release only that information in the records that the client has provided directly or has authorized other sources to provide, unless otherwise directed by law or court order. Upon a request by one client to access or release group client records, that information in the records that has not been provided directly or by authorization of the requesting client must be redacted unless written authorization to disclose this information has been obtained from the other clients.\nThe board shall be allowed access to any records of a client provided services by an applicant or licensee who is under investigation. If the client has not signed a consent permitting access to the client's records, the applicant or licensee must delete any data that identifies the client before providing them to the board. The board shall maintain any records as investigative data pursuant to chapter 13.",
	"repealed": false
}