{
	"id": "123B.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.77",
	"title": "123B.77 ACCOUNTING, BUDGETING, AND REPORTING REQUIREMENT.",
	"text": "Each Minnesota school district must adopt the uniform financial accounting and reporting standards for Minnesota school districts provided for in guidelines adopted by the department.\nThe commissioner, in consultation with the advisory committee on financial management, accounting, and reporting, shall develop and maintain a school district consolidated financial statement format that converts uniform financial accounting and reporting standards data under subdivision 1 into a more understandable format.\nEach district must submit to the commissioner by September 15 of each year unaudited financial data for the preceding fiscal year. These financial data must be submitted in the format prescribed by the commissioner.\n(a) By November 30 of the calendar year of the submission of the unaudited financial data, the district must provide to the commissioner audited financial data for the preceding fiscal year. The audit must be conducted in compliance with generally accepted governmental auditing standards, the federal Single Audit Act, and the Minnesota legal compliance guide issued by the Office of the State Auditor. An audited financial statement prepared in a form which will allow comparison with and correction of material differences in the unaudited financial data shall be submitted to the commissioner and the state auditor by December 31. The audited financial statement must also provide a statement of assurance pertaining to uniform financial accounting and reporting standards compliance and a copy of the management letter submitted to the district by the school district's auditor.\n(b) By February 1 of the calendar year following the submission of the unaudited financial data, the commissioner shall convert the audited financial data required by this subdivision into the consolidated financial statement format required under subdivision 1a and publish the information on the department's website.\nPrior to July 1 of each year, the board of each district must approve and adopt its revenue and expenditure budgets for the next school year. The budget document so adopted must be considered an expenditure-authorizing or appropriations document. No funds shall be expended by any board or district for any purpose in any school year prior to the adoption of the budget document which authorizes that expenditure, or prior to an amendment to the budget document by the board to authorize the expenditure. Expenditures of funds in violation of this subdivision shall be considered unlawful expenditures.\nAll governmental units formed by joint powers agreements entered into by districts pursuant to sections 123A.22, 125A.03 to 125A.24, 125A.26 to 125A.48, 125A.65, 471.59, or any other law and all service cooperatives and education districts are subject to the provisions of this section.\nA district providing early retirement incentive payments under section 122A.48, severance pay under section 465.72, or health insurance benefits to retired employees under section 471.61, must account for the payments according to uniform financial accounting and reporting standards.",
	"repealed": false
}