{
	"id": "148B.592",
	"url": "https://www.revisor.mn.gov/statutes/cite/148B.592",
	"title": "148B.592 EXCEPTIONS TO LICENSE REQUIREMENT.",
	"text": "Nothing in sections 148B.50 to 148B.593 prevents members of other professions or occupations from performing functions for which they are qualified or licensed. This exception includes, but is not limited to, licensed physicians, registered nurses, licensed practical nurses, licensed psychologists, probation officers, attorneys, social workers, marriage and family therapists, qualified rehabilitation consultants, natural family planning practitioners certified by the American Academy of Natural Family Planning, and registered occupational therapists or certified occupational therapist assistants. These persons must not, however, use a title incorporating the words \"licensed professional counselor\" or otherwise hold themselves out to the public by any title or description stating or implying that they are licensed to engage in the practice of professional counseling unless they are licensed under sections 148B.50 to 148B.593.\nNothing in sections 148B.50 to 148B.593 prevents a student, intern, or trainee enrolled in an accredited program of professional counseling from engaging in professional counseling as part of the supervised course of study if the person is identified as a \"counselor intern.\"\nNothing in sections 148B.50 to 148B.593 limits the activities and services of, or use of, an official title by a person employed as a counselor by a federal, state, county, or municipal agency, or public or private educational institution if the person is performing the activities within the scope of the person's employment.\n(a) MS 2003 Supp [Expired, 2003 c 118 s 14 subd 4 para (a)]\n(b) Nothing in this section limits the authority of unlicensed complementary and alternative health care practitioners to perform services under chapter 146A.\nA nonresident may engage in the practice of professional counseling within the state without a license for up to 30 days during any calendar year if the nonresident is authorized to provide the services under the law of the state or country of residence and the nonresident has provided proof of credentials to the board, been found qualified to render services in the state, and been granted permission by the board to practice.\nNothing in sections 148B.50 to 148B.593 limits the activities and services of a rabbi, priest, minister, or clergyperson of any religious denomination or sect, provided such activities and services are within the scope of the performance of regular or specialized ministerial duties.\nNothing in sections 148B.50 to 148B.593 limits the activities, services, and descriptions of persons offering volunteer or professional services for public or private nonprofit organizations or charities.",
	"repealed": false
}