{
	"id": "62D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.02",
	"title": "62D.02 DEFINITIONS.",
	"text": "For the purposes of sections 62D.01 to 62D.30, unless the context clearly indicates otherwise, the terms defined in this section shall have the meaning here given them.\n[Repealed, 1990 c 538 s 32]\n\"Commissioner of health\" or \"commissioner\" means the state commissioner of health or a designee.\n\"Health maintenance organization\" means a foreign or domestic corporation, or a local governmental unit as defined in subdivision 11, controlled and operated as provided in sections 62D.01 to 62D.30, which provides, either directly or through arrangements with providers or other persons, comprehensive health maintenance services, or arranges for the provision of these services, to enrollees on the basis of a fixed prepaid sum without regard to the frequency or extent of services furnished to any particular enrollee.\n\"Evidence of coverage\" means any certificate, agreement or contract, and amendments thereto, issued to an enrollee which sets out the coverage to which the enrollee is entitled under the health maintenance contract which covers the enrollee.\n\"Enrollee\" means any person who has entered into, or is covered by, a health maintenance contract.\n\"Comprehensive health maintenance services\" means a set of comprehensive health services which the enrollees might reasonably require to be maintained in good health including as a minimum, but not limited to, emergency care, emergency ground ambulance transportation services, inpatient hospital and physician care, outpatient health services and preventive health services.\n\"Health maintenance contract\" means any contract whereby a health maintenance organization agrees to provide to enrollees comprehensive health maintenance services and any other health care service set forth in the contract. The contract may contain enrollee cost-sharing provisions if the provisions meet the requirements of section 62D.095.\n\"Provider\" means any person who furnishes health services and is licensed or otherwise authorized to render such services in the state.\n\"Consumer\" means any person, including an enrollee, to whom a health maintenance organization directs marketing materials.\n\"Local governmental unit\" means any statutory or home rule charter city or county.\n\"Participating entity\" means any of the following persons, providers, companies, or other organizations with which the health maintenance organization has contracts or other agreements:\n(1) a health care facility licensed under sections 144.50 to 144.56, a nursing home licensed under sections 144A.02 to 144A.11, and any other health care facility otherwise licensed under the laws of this state or registered with the commissioner of health;\n(2) a health care professional licensed under health-related licensing boards, as defined in section 214.01, subdivision 2, and any other health care professional otherwise licensed under the laws of this state or registered with the commissioner of health;\n(3) a group, professional corporation, or other organization which provides the services of individuals or entities identified in clause (2), including but not limited to a medical clinic, a medical group, a home health care agency, an urgent care center, and an emergent care center;\n(4) any person or organization providing administrative, financial, or management services to the health maintenance organization if the total payment for all services exceeds three percent of the gross revenues of the health maintenance organization.\n\"Participating entity\" does not include (i) another health maintenance organization with which a health maintenance organization has made contractual arrangements or (ii) any entity with which a health maintenance organization has contracted primarily in order to purchase or lease equipment or space or (iii) employees of the health maintenance organization or (iv) employees of any participating entity identified in clause (3).\n\"Major participating entity\" shall include the following:\n(1) a participating entity that receives from the health maintenance organization as compensation for services a sum greater than 30 percent of the health maintenance organization's gross annual revenues;\n(2) a participating entity providing administrative, financial, or management services to the health maintenance organization, if the total payment for all services provided by the participating entity exceeds three percent of the gross revenue of the health maintenance organization;\n(3) a participating entity that nominates or appoints 30 percent or more of the board of directors of the health maintenance organization.\n\"Separate health services contracts\" means prepaid dental services contracts and other similar types of prepaid health services agreements in which services are provided by participating entities or employees of the health maintenance organization, but does not include contracts subject to chapter 62A or 62C.\n\"Net worth\" means admitted assets, as defined in section 62D.044, minus liabilities. Liabilities do not include those obligations that are subordinated in the same manner as preferred ownership claims under section 60B.44, subdivision 10. For purposes of this subdivision, preferred ownership claims under section 60B.44, subdivision 10, include promissory notes subordinated to all other liabilities of the health maintenance organization.\n\"Affiliate\" means a person or entity controlling, controlled by, or under common control with the person or entity.\n\"Preventive items and services\" has the meaning given in section 62Q.46, subdivision 1, paragraph (a).",
	"repealed": false
}