{
	"id": "309.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.50",
	"title": "309.50 SOLICITATION OF CHARITABLE FUNDS; DEFINITIONS.",
	"text": "As used in sections 309.50 to 309.61 the words, terms and phrases, defined in this section have the meanings given them.\n\"Person\" means any individual, organization, group, firm, copartnership, association, partnership, corporation, company, trust or joint stock association, church, religious sect, religious denomination, society, or league, and includes any trustee, receiver, assignee, agent or other similar representative thereof.\n\"Charitable purpose\" means any charitable, benevolent, philanthropic, patriotic, religious, social service, welfare, educational, eleemosynary, cultural, artistic, or public interest purpose, either actual or purported.\n\"Charitable organization\" means any person who engages in or purports to engage in solicitation for a charitable purpose and includes a chapter, branch, area office or similar affiliate or any person soliciting contributions within the state for a parent charitable organization, but does not include an organization whose primary purpose is supporting or opposing any candidate for elective office, or influencing the nomination for election or the election of any candidate for elective office.\n\"Contribution\" means the promise or grant of any money or property of any kind or value, including the promise to pay, or payment for merchandise or rights of any other description when representation is made by or on behalf of the seller or solicitor that the whole or any part of the price will be applied to a charitable purpose. \"Contributions\" shall not include any funds obtained by a charitable organization through grants from any governmental agency. \"Contributions\" shall include, in the case of a charitable organization offering goods and services to the public, the difference between the direct cost of the goods and services to the charitable organization and the price at which the charitable organization or any person acting on its behalf resells those goods or services to the public.\n\"Professional fundraiser\" means any person who for financial compensation or profit performs for a charitable organization any service in connection with which contributions are, or will be, solicited in this state by the compensated person or by any compensated person the person employs, procures, or engages to solicit; or any person who for compensation or profit plans, manages, advises, consults, or prepares material for, or with respect to, the solicitation in this state of contributions for a charitable organization. No investment adviser, investment adviser representative, broker-dealer, or agent licensed pursuant to chapter 80A, or lawyer, accountant, or banker who advises a person to make a charitable contribution or who provides legal, accounting, or financial advice in the ordinary course of a profession or business shall be deemed, as a result of the advice, to be a professional fundraiser. A bona fide salaried officer, employee, or volunteer of a charitable organization is not a professional fundraiser.\n\"Accounting year\" means the 12 month period on which a charitable organization keeps its financial records.\n[Repealed, 1969 c 112 s 17]\n[Repealed, 2006 c 212 art 1 s 26]\n\"Parent organization\" is that part of a charitable organization which coordinates, supervises or exercises control over policy, fundraising, and expenditures, or assists or advises one or more chapters, branches or affiliates in the state.\n\"Solicit\" and \"solicitation\" mean the request directly or indirectly for any contribution, regardless of which party initiates communication, on the plea or representation that such contribution will or may be used for any charitable purpose, and include any of the following methods of securing contributions:\n(1) oral or written request;\n(2) the distribution, circulation, mailing, posting, or publishing of any handbill, written advertisement, or publication;\n(3) the making of any announcement to the press, over the radio, by television, by telephone, or telegraph concerning an appeal, assemblage, athletic or sports event, bazaar, benefit, campaign, contest, dance, drive, entertainment, exhibition, exposition, party, performance, picnic, sale, or social gathering, which the public is requested to patronize or to which the public is requested to make a contribution;\n(4) the sale of, offer, or attempt to sell, any advertisement, advertising space, book, card, magazine, merchandise, subscription, ticket of admission, or any other thing, or the use of the name of any charitable person in any offer or sale as an inducement or reason for purchasing any such item, or the making of any statement in connection with any such sale, that the whole or any part of the proceeds from any such sale will be used for any charitable purpose. A \"solicitation\" shall be deemed completed when made, whether or not the person making the same receives any contribution or makes any such sale.\n\"Management and general costs\" means costs determined to be management and general by generally accepted accounting principles.\n\"Fundraising costs\" means costs determined to be fundraising by generally accepted accounting principles.\nExpenses incurred in planning or developing a fundraising campaign, regardless of whether the expenses are incurred before, during, or after that campaign, constitute fundraising costs.",
	"repealed": false
}