{
	"id": "447.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.34",
	"title": "447.34 PAYMENT OF EXPENSES; TAXATION.",
	"text": "Expenses of acquiring, improving, and running the hospital, nursing home facilities, and facilities described in section 447.45, subdivision 2, paragraph (b), operated by a hospital district, amounts payable with respect to facilities of the type described in section 447.45, subdivision 2, that are attached or related to a nursing home and are providing supportive services to elderly persons who are not yet in need of nursing home care, including congregate housing, adult day care, and respite care services, under an agreement between the hospital district and a city or county, expenses incurred under section 447.331, subdivision 1, and expenses of organization and administration of the district and of planning and financing the facilities, must be paid from the revenues derived from them, and to the extent necessary, from ad valorem taxes levied by the hospital board on all taxable property within the district, and, to the extent determined from time to time by the board of county commissioners of any county containing territory of the district, from appropriations made by the county board in accordance with section 376.08. Money appropriated by the board of county commissioners to acquire or improve facilities of the hospital district may be transferred in the discretion of the hospital board to a sinking fund for bonds issued for that purpose. The hospital board may agree to repay to the county any sums appropriated by the board of county commissioners for this purpose, out of the net revenues to be derived from operation of its facilities, and subject to the terms agreed on.\nOn or before September 15 of each year the hospital board shall decide the amount necessary to be raised from ad valorem tax levies to meet its expenses. No later than September 15 the secretary of the hospital board shall certify that amount to the county auditor of each county containing territory in the hospital district. Each county auditor shall assess and extend upon the tax rolls for the year that portion of the certified amount that bears the same ratio to the whole amount as the net tax capacity of taxable property in that part of the hospital district located in the auditor's county bears to the net tax capacity of all taxable property in the hospital district.\nEach county auditor shall add the amount of any levy so determined to the other tax levies on property located in the auditor's county and the hospital district, for collection by the county treasurer with other taxes. When collected, the county treasurer shall settle the taxes with the treasurer of the hospital district in the same way as other taxes are distributed to other political subdivisions. The levies authorized by this section are in addition to other county taxes authorized by law.",
	"repealed": false
}