{
	"id": "145.561",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.561",
	"title": "145.561 988 SUICIDE AND CRISIS LIFELINE.",
	"text": "(a) For the purposes of this section, the following have the meanings given.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Department\" means the Department of Health.\n(d) \"988\" means the universal telephone number designated as the universal telephone number within the United States for the purpose of the national suicide prevention and mental health crisis hotline system operating through the 988 Suicide and Crisis Lifeline, or its successor, maintained by the Assistant Secretary for Mental Health and Substance Use under section 520E-3 of the Public Health Service Act (United States Code, title 42, sections 290bb-36c).\n(e) \"988 administrator\" means the administrator of the national 988 Suicide and Crisis Lifeline maintained by the Assistant Secretary for Mental Health and Substance Use under section 520E-3 of the Public Health Service Act.\n(f) \"988 contact\" means a communication with the 988 Suicide and Crisis Lifeline system within the United States via modalities offered including call, chat, or text.\n(g) \"988 Lifeline Center\" means a state-identified center that is a member of the Suicide and Crisis Lifeline network that responds to statewide or regional 988 contacts.\n(h) \"988 Suicide and Crisis Lifeline\" or \"988 Lifeline\" means the national suicide prevention and mental health crisis hotline system maintained by the Assistant Secretary for Mental Health and Substance Use under section 520E-3 of the Public Health Service Act (United States Code, title 42, sections 290bb-36c).\n(i) \"Veterans Crisis Line\" means the Veterans Crisis Line maintained by the Secretary of Veterans Affairs under United States Code, title 38, section 170F(h).\n(a) The commissioner shall administer the designation of and oversight for a 988 Lifeline center or a network of 988 Lifeline centers to answer contacts from individuals accessing the Suicide and Crisis Lifeline from any jurisdiction within the state 24 hours per day, seven days per week.\n(b) The designated 988 Lifeline Center must:\n(1) have an active agreement with the 988 Suicide and Crisis Lifeline program for participation in the network and the department;\n(2) meet the 988 Lifeline program requirements and best practice guidelines for operational and clinical standards;\n(3) provide data and reports, and participate in evaluations and related quality improvement activities as required by the 988 Lifeline program and the department;\n(4) identify or adapt technology that is demonstrated to be interoperable across mobile crisis and public safety answering points used in the state for the purpose of crisis care coordination;\n(5) facilitate crisis and outgoing services, including mobile crisis teams in accordance with guidelines established by the 988 Lifeline program and the department;\n(6) actively collaborate and coordinate service linkages with mental health and substance use disorder treatment providers, local community mental health centers including certified community behavioral health clinics and community behavioral health centers, mobile crisis teams, and community based and hospital emergency departments;\n(7) offer follow-up services to individuals accessing the 988 Lifeline Center that are consistent with guidance established by the 988 Lifeline program and the department; and\n(8) meet the requirements set by the 988 Lifeline program and the department for serving at-risk and specialized populations.\n(c) The commissioner shall adopt rules to allow appropriate information sharing and communication between and across crisis and emergency response systems.\n(d) The commissioner, having primary oversight of suicide prevention, shall work with the 988 Lifeline program, veterans crisis line, and other SAMHSA-approved networks for the purpose of ensuring consistency of public messaging about 988 services.\n(e) The commissioner shall work with representatives from 988 Lifeline Centers and public safety answering points, other public safety agencies, and the commissioner of public safety to facilitate the development of protocols and procedures for interactions between 988 and 911 services across Minnesota. Protocols and procedures shall be developed following available national standards and guidelines.\n(f) The commissioner shall provide an annual public report on 988 Lifeline usage, including data on answer rates, abandoned calls, and referrals to 911 emergency response.\n(a) A 988 special revenue account is established as a dedicated account in the special revenue fund to create and maintain a statewide 988 suicide and crisis lifeline system according to the National Suicide Hotline Designation Act of 2020, the Federal Communications Commission's report and order FCC 20-100 adopted July 16, 2020, and national guidelines for crisis care.\n(b) The 988 special revenue account shall consist of:\n(1) a 988 telecommunications fee imposed under subdivision 4;\n(2) a prepaid wireless 988 fee imposed under section 403.161;\n(3) transfers of state money into the account;\n(4) grants and gifts intended for deposit in the account;\n(5) interest, premiums, gains, and other earnings of the account; and\n(6) money from any other source that is deposited in or transferred to the account.\n(c) The account shall be administered by the commissioner. Money in the account shall only be used to offset costs that are or may reasonably be attributed to:\n(1) implementing, maintaining, and improving the 988 suicide and crisis lifeline, including staff and technology infrastructure enhancements needed to achieve the operational standards and best practices set forth by the 988 administrator and the department;\n(2) data collection, reporting, participation in evaluations, public promotion, and related quality improvement activities as required by the 988 administrator and the department; and\n(3) administration, oversight, and evaluation of the account.\n(d) Money in the account:\n(1) does not cancel at the end of any state fiscal year and is carried forward in subsequent state fiscal years;\n(2) is not subject to transfer to any other account or fund or to transfer, assignment, or reassignment for any use or purpose other than the purposes specified in this subdivision; and\n(3) is appropriated to the commissioner for the purposes specified in this subdivision.\n(e) The commissioner shall submit an annual report to the legislature and to the Federal Communications Commission on deposits to and expenditures from the account. Notwithstanding section 144.05, subdivision 7, the reports required under this paragraph do not expire.\n(a) In compliance with the National Suicide Hotline Designation Act of 2020, each subscriber of a wireline, wireless, or IP-enabled voice service must pay a monthly fee to provide for the robust creation, operation, and maintenance of a statewide 988 suicide prevention and crisis system.\n(b) The amount of the 988 telecommunications fee is 12 cents per month for each consumer access line, including trunk equivalents as designated by the Public Utilities Commission pursuant to section 403.11, subdivision 1. The 988 telecommunications fee must be the same for all subscribers.\n(c) Each wireline, wireless, and IP-enabled voice telecommunication service provider shall collect the 988 telecommunications fee and transfer the amounts collected to the commissioner of public safety in the same manner as provided in section 403.11, subdivision 1, paragraph (d).\n(d) The commissioner of public safety shall deposit the money collected from the 988 telecommunications fee to the 988 special revenue account established in subdivision 3.\n(e) All 988 telecommunications fee revenue must be used to supplement, and not supplant, federal, state, and local funding for suicide prevention.\n(f) The 988 telecommunications fee amount shall be adjusted as needed to provide for continuous operation of the lifeline centers and 988 hotline, volume increases, and maintenance.\n(g) The commissioner shall annually report to the Federal Communications Commission on revenue generated by the 988 telecommunications fee.\n(a) The 988 telecommunications fee established in subdivision 4 does not apply to prepaid wireless telecommunications services. Prepaid wireless telecommunications services are subject to the prepaid wireless 988 fee established in section 403.161, subdivision 1, paragraph (c).\n(b) Collection, remittance, and deposit of prepaid wireless 988 fees are governed by sections 403.161 and 403.162.\nThe commissioner shall provide a biennial report for maintaining the 988 system to the legislature as part of the biennial departmental earnings report process under section 16A.1285, subdivision 3. The report must include data on direct and indirect expenditures to maintain the 988 system, 988 fees collected, the balance in the 988 account, and the most recent forecast of revenues to and expenditures from the 988 account.\nA wireless telecommunications service provider or wire-line telecommunications service provider may petition the commissioner for a waiver of all or portions of the requirements of this section. The commissioner may grant a waiver upon a demonstration by the petitioner that the requirement is economically infeasible.",
	"repealed": false
}