{
	"id": "169.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.19",
	"title": "169.19 TURNING, STARTING, AND SIGNALING.",
	"text": "The driver of a vehicle intending to turn at an intersection shall do so as follows:\n(a) Except as otherwise provided in this paragraph, both the approach for a right turn and a right turn shall be made as close as practicable to the right-hand curb or edge of the roadway. When necessary to accommodate vehicle configuration, a driver is permitted to make a right turn into the farthest lane of a roadway with two or more lanes in the same direction in order to make a U-turn at a reduced conflict intersection, if it is safe to do so.\n(b) Approach for a left turn on other than one-way roadways shall be made in that portion of the right half of the roadway nearest the centerline thereof, and after entering the intersection the left turn shall be made so as to leave the intersection to the right of the centerline of the roadway being entered. Whenever practicable the left turn shall be made in that portion of the intersection to the left of the center of the intersection.\n(c) Approach for a left turn from a two-way roadway into a one-way roadway shall be made in that portion of the right half of the roadway nearest the centerline thereof and by passing to the right of such centerline where it enters the intersection.\n(d) A left turn from a one-way roadway into a two-way roadway shall be made from the left-hand lane and by passing to the right of the centerline of the roadway being entered upon leaving the intersection.\n(e) Where both streets or roadways are one way, both the approach for a left turn and a left turn shall be made as close as practicable to the left-hand curb or edge of the roadway.\n(f) Local authorities in their respective jurisdictions may cause markers, buttons, or signs to be placed within or adjacent to intersections and thereby require and direct that a different course from that specified in this section be traveled by vehicles turning at an intersection, and when markers, buttons, or signs are so placed no driver of a vehicle shall turn a vehicle at an intersection other than as directed and required by such markers, buttons, or signs.\n(g) Whenever it is necessary for the driver of a motor vehicle to cross a bicycle lane adjacent to the driver's lane of travel to make a turn, the driver shall first signal the movement, then drive the motor vehicle into the bicycle lane prior to making the turn, but only after it is safe to do so. The driver shall then make the turn consistent with any traffic markers, buttons, or signs, yielding the right-of-way to any vehicles or bicycles approaching so close thereto as to constitute an immediate hazard.\nThe operator of a vehicle must not turn to proceed in the opposite direction upon any curve, or upon the approach to or near the crest of a grade, where the vehicle cannot be seen by the operator of any other vehicle approaching from either direction within 1,000 feet. The operator of a vehicle must not turn the vehicle to proceed in the opposite direction unless the movement can be made safely and without interfering with other traffic. The operator of a vehicle is permitted to make a right-hand turn into the farthest lane of a roadway with two or more lanes in the same direction in order to make a U-turn at a reduced-conflict intersection if it is safe to do so.\nNo person shall start a vehicle which is stopped, standing, or parked unless and until such movement can be made with reasonable safety.\nNo person shall turn a vehicle at an intersection unless the vehicle is in proper position upon the roadway as required in this section, or turn a vehicle to enter a private road or driveway or otherwise turn a vehicle from a direct course or move right or left upon a highway unless and until the movement can be made with reasonable safety after giving an appropriate signal in the manner hereinafter provided.\nA signal of intention to turn right or left shall be given continuously during not less than the last 100 feet traveled by the vehicle before turning. A person whose vehicle is exiting a roundabout is exempt from this subdivision.\nNo person shall stop or suddenly decrease the speed of a vehicle without first giving an appropriate signal in the manner provided herein to the driver of any vehicle immediately to the rear unless there is a good and sufficient reason for not being able to do so.\nThe signals herein required shall be given either by means of the hand and arm or by a signal lamp or signal device of a type approved by the commissioner of public safety, but when a vehicle is so constructed or loaded that a hand and arm signal would not be visible in normal sunlight, and at night both to the front and rear of such vehicle, then the signals must be given by such a lamp or device.\nWhen the signal is given by means of the hand and arm the driver shall indicate intention to start, stop, or turn by extending the hand and arm from and beyond the left side of the vehicle in the following manner and these signals shall indicate as follows:\n(1) left turn: hand and arm extended horizontally;\n(2) right turn: hand and arm extended upward, except that a bicyclist or motorcyclist may extend the right hand and arm horizontally to the right side of the bicycle or motorcycle;\n(3) stop or decrease speed: hand and arm extended downward.",
	"repealed": false
}