{
	"id": "32D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.02",
	"title": "32D.02 INSPECTION AND ENFORCEMENT; AUTHORITY AND DUTIES.",
	"text": "The commissioner is charged with the enforcement of this chapter.\nFor the purpose of enforcing this chapter, the commissioner and the commissioner's assistants, agents, and employees have the power and authority granted under chapter 34A and sections 31.02 to 31.171.\nAt times the commissioner determines proper, the commissioner shall inspect all places where dairy products are made, stored, or served as food for purchase, and all places where hoofed mammals are kept by persons engaged in the sale of milk, and shall require the correction of all unsanitary conditions and practices.\nA refusal or physical threat that prevents the completion of an inspection or neglect to obey a lawful direction of the commissioner or the commissioner's agent given while carrying out this section may result in the suspension of the offender's permit or certification or other enforcement as deemed appropriate by the commissioner. The offender is required to meet with a representative of the offender's plant or marketing organization and a representative of the commissioner within 48 hours of receiving notice, excluding holidays or weekends, or the suspension or enforcement action shall take effect. A producer may request a hearing before the commissioner or the commissioner's agent if a serious concern exists relative to the retention of the offender's permit or certification to sell milk.\nTo ensure compliance with the laws and rules governing the production, handling, processing, and sale of milk and dairy products, the commissioner is authorized, through a duly trained and qualified milk inspector, to inspect milk and milk products and the premises and plants where milk and milk products are produced, handled, and processed. Inspection services must acquaint the processor and producers with the requirements for a Grade A or manufacturing grade milk supply for preliminary inspection to determine if a processor has brought the processor's farms and plants to the state of compliance that qualifies the processor's products for the Grade A or manufacturing grade label, and for continuous inspection to ensure that a farm or plant and all products from a farm or plant are in compliance with this chapter.\nGrade A or manufacturing grade processors shall provide a continuous field service to assist producers who sell their milk to the processor's plant to attain and maintain compliance with this chapter. A person who performs field service must first obtain a permit from the commissioner. A person desiring to secure a permit must apply on a form provided by the commissioner, and before a permit is issued the commissioner shall determine that the applicant is competent and qualified to perform field service. The permit is not transferable to another person and may be revoked for due cause after the holder of the permit has been given the opportunity for a hearing. The permit holder must be given a notice in writing of the time and place of the hearing at least seven days before the date of the hearing.\nThe standards in this chapter and rules adopted under this chapter by the commissioner shall be the only standards for use in Minnesota. No municipality or other subdivision of state government shall provide, by ordinance, more stringent or comprehensive standards than are contained in this chapter and rules adopted by the commissioner under this chapter.\n(a) The commissioner shall by rule adopt identity, production, and processing standards for both Grade A and manufacturing grade milk and dairy products.\n(b) In the exercise of the authority to establish requirements for Grade A milk and milk products, the commissioner adopts definitions, standards of identity, and requirements for production and processing contained in the most current version of the Grade A Pasteurized Milk Ordinance, and its associated documents, of the United States Department of Health and Human Services in a manner provided for and not in conflict with law.\n(c) Producers of milk, other than Grade A, shall conform to the standards contained in subparts B, C, D, E, and F of the United States Department of Agriculture Agricultural Marketing Service Recommended Requirements for Milk for Manufacturing Purposes and its Production and Processing, except that the commissioner shall develop methods by which producers are able to comply with the standards without violation of religious beliefs.\nIndustry personnel may be certified to perform any inspection, to the extent allowed by federal law and provided that performance of the inspections is consistent with rules adopted in subdivision 8.\n(a) All fees and penalties collected under this chapter must be deposited in the dairy services account in the agricultural fund. Money in the account, including interest, is appropriated to the commissioner for purposes of administering this chapter.\n(b) Unless otherwise noted, all fees are payable by a processor or marketing organization and are invoiced on July 1 of each year for Grade A and January 1 of each year for manufacturing grade, and if not paid within 30 days of the due date, inspection service may be discontinued. If a farm discontinues the production of milk within six months of the billing date, a request for a refund based on inspection services not received may be made by the processor or by the marketing organization on behalf of its patrons. This request must be made in writing by June 30 for manufacturing grade or by December 31 for Grade A. Upon approval by the commissioner, refunds must be made to the processor or marketing organization.",
	"repealed": false
}