{
	"id": "617.242",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.242",
	"title": "617.242 ADULT ENTERTAINMENT ESTABLISHMENTS.",
	"text": "For purposes of this section:\n(1) \"adult entertainment establishment\" means a business that is open only to adults and that presents live performances that are distinguished or characterized by an emphasis on the depiction of sexual conduct or nudity;\n(2) \"sexual conduct\" has the meaning given in section 617.241; and\n(3) nudity has the meaning given in section 617.292, subdivision 3.\nA person must not operate an adult entertainment establishment at a location where this type of establishment was not previously located unless, at least 60 days before submitting a permit application for operation of the establishment or, if a permit is not required, at least 60 days before beginning operation of the establishment, the person gives written notice by certified mail to the chief clerical officer of the statutory or home rule charter city in which it will be located of the date on which the person intends to begin operation of the establishment. If the adult entertainment establishment is proposed to be located outside the boundaries of a statutory or home rule charter city the notice must be given to the clerk of the town board and the county auditor of the county in which the establishment is proposed to be located. Upon receipt of the notice, the officer must acknowledge receipt of the notice by certified mail, return receipt requested, addressed to the person, and notify the governing body or town board of the receipt of the notice. The governing body or town board may conduct hearings on the proposed operation of the adult entertainment establishment and must give written notice by ordinary mail to the operator of the establishment of any hearings.\nIf an adult entertainment establishment is located within 50 miles of a statutory or home rule charter city or town, the governing body of the city or the town board is not required to provide by zoning or otherwise for a location within the city or town limits in which an adult entertainment establishment may be located. If an adult entertainment establishment is located within 50 miles of the boundaries of a county, the county board is not required to provide by zoning or otherwise for a location within the county limits in which an adult entertainment establishment may be located.\nAn adult entertainment establishment may not operate in the same building as, or within 1,500 feet from, another adult entertainment establishment; within 500 feet of residential property, regardless of how the property is zoned; or within 2,800 feet of a public or private elementary or secondary school or a church, synagogue, mosque, or other place of worship. Distances are measured between the closest property lines.\nAn adult entertainment establishment located in a statutory or home rule city, town, or county that does not regulate hours of operation may not be open for business before 10:00 a.m. or after 10:00 p.m. on Monday through Saturday and may not be open for business on a Sunday or legal holiday.\nA person who has been convicted of one of the following offenses may not operate or manage an adult business establishment for three years after discharge of the sentence for the offense, or a similar offense in another state or jurisdiction:\n(1) prostitution or sex trafficking under section 609.321; 609.322; 609.324; or 609.3242;\n(2) criminal sexual conduct under sections 609.342 to 609.3451;\n(3) solicitation of children under section 609.352;\n(4) indecent exposure under section 617.23;\n(5) distribution or exhibition of obscene materials and performances under section 617.241;\n(6) use of a minor in a sexual performance under section 617.246; or\n(7) possession of pornographic work involving minors under section 617.247.\nIf a county, town, or statutory or home rule charter city does not enact an ordinance or regulation governing adult entertainment establishments, this section applies in the county, town, or city. A county, town, or city may adopt an ordinance or regulation that is consistent with this section, that supersedes or is in whole or in part more restrictive than this section, or that provides that this section does not apply in the county, town, or city, and the county, town, or city ordinance applies. If a county, town, or city adopts an ordinance that only regulates a portion or facet of the operation of an adult entertainment establishment, this section applies to the remainder of the operation that is not regulated by the county, town, or city ordinance, unless the ordinance provides otherwise.",
	"repealed": false
}