{
	"id": "462D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/462D.02",
	"title": "462D.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given.\n\"Account holder\" means an individual who establishes, individually or jointly with one or more other individuals, a first-time home buyer savings account.\n\"Allowable closing costs\" means a disbursement listed on a settlement statement for the purchase of a single-family residence in Minnesota by a qualified beneficiary.\n\"Commissioner\" means the commissioner of revenue.\n\"Eligible costs\" means the down payment and allowable closing costs for the purchase of a single-family residence in Minnesota by a qualified beneficiary. Eligible costs include paying for the cost of construction of or financing the construction of a single-family residence.\n\"Financial institution\" means a bank, bank and trust, trust company with banking powers, savings bank, savings association, or credit union, organized under the laws of this state, any other state, or the United States; an industrial loan and thrift under chapter 53 or the laws of another state and authorized to accept deposits; or a money market mutual fund registered under the federal Investment Company Act of 1940 and regulated under rule 2a-7, promulgated by the Securities and Exchange Commission under that act.\n\"First-time home buyer\" means an individual, and if married, the individual's spouse, who has no present ownership interest in a principal residence during the three-year period ending on the earlier of:\n(1) the date of the purchase of the single-family residence funded, in part, with proceeds from the first-time home buyer savings account; or\n(2) the close of the taxable year for which a subtraction is claimed under sections 290.0132, subdivision 25, and 462D.06.\n\"First-time home buyer savings account\" or \"account\" means an account with a financial institution that an account holder designates as a first-time home buyer savings account, as provided in section 462D.03, to pay or reimburse eligible costs for the purchase of a single-family residence by a qualified beneficiary.\n\"Internal Revenue Code\" has the meaning given in section 290.01.\n\"Principal residence\" has the meaning given in section 121 of the Internal Revenue Code.\n\"Qualified beneficiary\" means a first-time home buyer who is a Minnesota resident and is designated as the qualified beneficiary of a first-time home buyer savings account by the account holder.\n\"Single-family residence\" means a single-family residence located in this state and owned and occupied by or to be occupied by a qualified beneficiary as the qualified beneficiary's principal residence, which may include a manufactured home, trailer, mobile home, condominium unit, townhome, or cooperative.",
	"repealed": false
}