{
	"id": "290.0802",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0802",
	"title": "290.0802 SUBTRACTION FOR THE ELDERLY AND DISABLED.",
	"text": "For purposes of this section, the following terms have the meanings given.\n(a) \"Adjusted gross income\" means federal adjusted gross income as used in section 22(d) of the Internal Revenue Code for the taxable year, plus a lump-sum distribution as defined in section 402(e)(3) of the Internal Revenue Code, and less any pension, annuity, or disability benefits included in federal gross income but not subject to state taxation other than the subtraction allowed under section 290.0132, subdivision 5.\n(b) \"Disability income\" means disability income as defined in section 22(c)(2)(B)(iii) of the Internal Revenue Code.\n(c) \"Nontaxable retirement and disability benefits\" means the amount of pension, annuity, or disability benefits that would be included in the reduction under section 22(c)(3) of the Internal Revenue Code and pension, annuity, or disability benefits included in federal gross income but not subject to state taxation.\n(d) \"Qualified individual\" means a qualified individual as defined in section 22(b) of the Internal Revenue Code.\n(a) A qualified individual is allowed a subtraction from federal adjusted gross income of the individual's subtraction base amount. The excess of the subtraction base amount over the taxable net income computed without regard to the subtraction for the elderly or a person with a disability under section 290.0132, subdivision 5, may be used to reduce the amount of a lump sum distribution subject to tax under section 290.032.\n(b)(1) The initial subtraction base amount equals\n(i) $12,000 for a married taxpayer filing a joint return if a spouse is a qualified individual,\n(ii) $9,600 for a single taxpayer, and\n(iii) $6,000 for a married taxpayer filing a separate federal return.\n(2) The qualified individual's initial subtraction base amount, then, must be reduced by the sum of nontaxable retirement and disability benefits and one-half of the amount of adjusted gross income in excess of the following thresholds:\n(i) $18,000 for a married taxpayer filing a joint return if both spouses are qualified individuals,\n(ii) $14,500 for a single taxpayer or for a married couple filing a joint return if only one spouse is a qualified individual, and\n(iii) $9,000 for a married taxpayer filing a separate federal return.\n(3) In the case of a qualified individual who is under the age of 65, the maximum amount of the subtraction base may not exceed the taxpayer's disability income.\n(4) The resulting amount is the subtraction base amount.\nExcept in the case of spouses who live apart at all times during the taxable year, if the taxpayer is married at the close of the taxable year, the subtraction under subdivision 2 is allowable only if the taxpayers file joint federal and state income tax returns for the taxable year.",
	"repealed": false
}