{
	"id": "103F.373",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.373",
	"title": "103F.373 REVIEWING AND CERTIFYING LAND USE ACTIONS.",
	"text": "To ensure that the plan is not nullified by unjustified exceptions in particular cases and to promote uniformity in the treatment of applications for exceptions, a review and certification procedure is established for the following categories of land use actions taken by zoning authorities directly or indirectly affecting land use within the area covered by the plan:\n(1) the adoption or amendment of an ordinance regulating the use of land, including rezoning of particular tracts of land;\n(2) the granting of a variance from provisions of the land use ordinance; and\n(3) the approval of a plat which is inconsistent with the land use ordinance.\nNotwithstanding any provision of chapter 394 to the contrary, an action of a type specified in subdivision 1, clauses (1) to (3), is not effective until the board has reviewed the action and certified that it is consistent with the plan. In determining consistency of ordinances and ordinance amendments, the provisions of the plan shall be considered minimum standards. An aggrieved person may appeal a decision of the type specified in subdivision 1, clauses (1) to (3), that is reviewed by the board under this section in the same manner as provided for review of a decision of a board of adjustment in section 394.27, subdivision 9, but only after the procedures prescribed under this section have been completed.\nA copy of the notices of public hearings or, when a hearing is not required, a copy of the application to consider an action of a type specified in subdivision 1, clauses (1) to (3), must be forwarded to the board by the zoning authority at least 15 days before the hearing or meetings to consider the actions. The zoning authority shall notify the board of its final decision on the proposed action within ten days of the decision. By 30 days after the board receives the notice, the board shall notify the zoning authority and the applicant of the board's approval or disapproval of the proposed action.\n(a) If a notice of disapproval is issued by the board, the zoning authority or the applicant may, within 30 days of the notice, file with the board a demand for a hearing. If a demand is not filed within the 30-day period, the disapproval becomes final.\n(b) If a demand is filed within the 30-day period, a hearing must be held within 60 days of demand. The hearing must be preceded by two weeks' published notice. Within 30 days after the hearing, the board must:\n(1) affirm its disapproval of the proposed action; or\n(2) certify approval of the proposed action.",
	"repealed": false
}