{
	"id": "412.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.321",
	"title": "412.321 MUNICIPAL UTILITIES.",
	"text": "Any statutory city may own and operate any waterworks, district heating system, or gas, light, power, or heat plant for supplying its own needs for utility service or for supplying utility service to private consumers or both. It may construct and install all facilities reasonably needed for that purpose and may lease or purchase any existing utility properties so needed. It may, in lieu of providing for the local production of gas, electricity, water, hot water, steam, or heat, purchase the same wholesale and resell it to local consumers. After any such utility has been acquired, the council, except as its powers have been limited through establishment of a public utilities commission in the city, shall make all necessary rules and regulations for the protection, maintenance, operation, extension, and improvement thereof and for the sale of its utility products.\nNo gas, light, power, or heat utility shall be constructed, purchased, or leased until the proposal to do so has been submitted to the voters at a regular or special election and been approved by five-eighths of those voting on the proposition. Such proposal shall state whether the public utility is to be constructed, purchased, or leased and the estimated cost or the maximum amount to be expended for that purpose. This proposal and a proposal to issue bonds to raise money therefor may be submitted either separately or as a single question. The proposal for the acquisition of the public utility may include authority for distribution only or for generation or production and distribution of a particular utility service or group of services. Approval of the voters shall be obtained under this section before a city purchasing gas or electricity wholesale and distributing it to consumers acquires facilities for the manufacture of gas or generation of electricity unless the voters have, within the two previous years, approved a proposal for both generation or production and distribution.\nAny city may, except as otherwise restricted by this section, extend any such public utility outside its limits and furnish service to consumers in such area at such rates and upon such terms as the council or utility commission, if there is one, shall determine; but no such extension shall be made into any incorporated municipality without its consent. The sale of electricity, other than surplus, outside the limits of the city shall be subject to the restriction of section 455.29.\nAny such utility may be leased, sold, or its operation discontinued wholly or in part, by ordinance or resolution of the council, approved by two-thirds of the electors voting on the ordinance or resolution at a general or special election. If the utility is under the jurisdiction of a public utilities commission, the ordinance or resolution shall be concurred in by the public utilities commission. Such action may be taken with respect to any specific part of the utility, which part shall be named in the ordinance or resolution; but it shall not be necessary to submit the ordinance or resolution to the voters in such case if the action proposed will not result in depriving any customer inside the corporate limits of any type of municipal utility service available before the sale, lease or discontinuance of operation.",
	"repealed": false
}