{
	"id": "115.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.49",
	"title": "115.49 COOPERATION BETWEEN MUNICIPALITIES; CONTRACTS.",
	"text": "If the agency determines after a hearing on the subject matter that cooperation between two or more municipalities is necessary to provide for areawide waste management and treatment, in accordance with the Federal Water Pollution Control Act, as amended, or to prevent, control, or abate pollution, it may adopt a resolution so declaring and determining whether it will be feasible to secure such cooperation by contract between the municipalities concerned.\nIf the agency determines that procedure by contract will be feasible it may issue an order so declaring, setting forth the general purposes and terms of a proposed contract under any applicable law, determining, among other things, which of the municipalities concerned shall have charge of any facilities constructed, and directing the municipalities concerned to formulate and execute such contract within such time as the agency may specify in the order, but not less than 90 days from the date of mailing copies of the order to the clerks or other recording officers of such municipalities or service thereof upon them. If a contract approved by the agency as sufficient for the purposes set forth in the order is not made within the time therein specified, the agency may refer the case to the commissioner as provided in section 115.48. Thereupon and thereby all the appropriate contractual powers of each municipality concerned and its governing or managing body and officers shall be transferred to and vested in the commissioner. The commissioner may then formulate a contract in accordance with the agency's order, with necessary counterparts, and execute the same in the name of each municipality concerned, with like force and effect as if executed by their officers as provided by law or charter. An executed counterpart of the contract shall be delivered or sent by certified mail by the commissioner to the clerk or other recording officer of each municipality concerned, and the contract shall thereupon take effect and be binding on such municipalities.\nIf a determination or order is made by the Pollution Control Agency under this section that cooperation by contract is necessary and feasible between a municipality and an unincorporated area located outside the existing corporate limits of a municipality, the municipality being required to provide or extend through a contract a governmental service to an unincorporated area, during the statutory 90-day period provided in this section to formulate a contract, may in the alternative to formulating a service contract to provide or extend the service, declare the unincorporated area as described in the Pollution Control Agency's determination letter or order annexed to the municipality under section 414.0335.\nAny contract for disposal of sewage, industrial wastes, or other wastes or for the construction, maintenance, or operation of any facilities therefor heretofore or hereafter executed between two or more municipalities may be renegotiated, reviewed, and revised or modified with respect to rates or charges or any other provision by agreement of the parties to the contract, any provision of law, charter, or the contract to the contrary notwithstanding.\n(a) Any municipality which is a party to a contract for any of the purposes specified in subdivision 3, and which operates a plant for the disposal of sewage, industrial wastes, or other wastes, may, upon written notice to the other party or parties, fix new rates and charges for the service performed under the contract, notwithstanding any provision of law, charter, or the contract to the contrary. Any other party or parties to such a contract with a municipality which operates such a plant may, upon written notice to such municipality, demand that new rates and charges be fixed for service performed under the contract, notwithstanding any provision of law, charter, or the contract to the contrary. Whenever notice is given as provided herein, it shall be the duty of the municipality operating the plant for the disposal of sewage, industrial wastes, or other wastes to hold a hearing for the determination of proper rates and charges.\n(b) A valid notice given under this subdivision of a demand to fix new rates and charges as to any contract precludes another such notice by any party as to that contract for a period of five years from the time of the notice, or the time of dismissal of proceedings under a notice, or the time of determination of rates and charges by the affected agencies or by judgment, as the case may be, whichever of these events is last, but there may always be a contract change under subdivision 3; provided there can be no such demand as of right within the first five years of a contract.\n(c) A municipality which may be affected by determination of new rates and charges in such a proceeding may participate in the proceeding as an interested third party by filing a notice of its intention to so participate with the clerk of the municipality to which the original notice was directed. If any party to the contract involved in the proceeding initiated by notice of demand for new rates and charges is dissatisfied with the rates and charges as set in the proceeding it may within 30 days after such determination by written notice given to the other party or parties elect to submit the matters in dispute to a board of arbitration which shall be created as follows: The municipality making such written election shall in such written election appoint a referee; the other municipality shall within ten days after such election and appointment also appoint a referee; the two referees shall appoint a third referee, or if they fail for ten days to do so, unless the municipalities mutually extend the time for them to do so the district court of a judicial district which is mutually agreeable to the municipalities shall make the appointment of the third referee. A decision of the majority of the board shall be a decision of the board. Each municipality shall pay the compensation of the referee appointed by it, and one-half of the compensation of the third referee, such compensation to be at the rate usually charged by such person for services in the person's profession or occupation.\n(d) The hearing initiated by the notice of demand to fix new rates and charges and all proceedings in connection therewith shall be in conformity with sections 14.57 to 14.62 and the municipality conducting the hearing is an agency as such term is used in such sections. Any party to the contract aggrieved by the decision or order made in conformity with such provisions shall be entitled to judicial review in the district court in the county in which such decision or order was made and in the manner provided in subdivision 5.\n(e) The new rates and charges established by the agency upon the initial demand will continue until the proper rates and charges are finally determined, notwithstanding submission to arbitration or judicial review, but the order or judgment which finally determines legality will provide for adjustment of overpayment or underpayment, if any, during the period after the new rates and charges were initially fixed.\n(f) All records of any municipality relating to such rates and charges shall be available at all reasonable times for examination by any municipality.\n(a) Any party to the contract aggrieved by a decision or order shall be entitled to judicial review by serving a petition for review upon the municipality making the decision or order, and filing it with proof of service in the office of the court administrator within 30 days after the decision or order has been made and the parties notified of it. The petition shall state the nature of the petitioner's interest, and the ground or grounds upon which the petitioner contends the decision or order should be reversed or modified. The petition may be amended by leave of court, though the time for serving it has expired.\n(b) Within 20 days after service of the petition for review, the municipality shall serve upon the petitioner an answer stating its position with reference to the reversal or modification of the order or decision under review. The answer, with proof of service, shall be filed with the clerk of the district court within ten days after service. No further pleadings shall be necessary. The review shall be noticed for trial as in the case of a civil action and shall take precedence over other civil cases for trial.\n(c) The institution of the proceeding for review shall not stay enforcement of the order or decision, but the court may order a stay upon such terms as it deems proper.\n(d) Within 30 days after service of the petition for review upon the municipality, or within such further time as the court may allow, the municipality shall transmit to the court the original or a certified copy of the entire record of the proceedings in which the order or decision under review was made. By stipulation of the parties to the review proceeding, the record may be shortened by eliminating any portion of it. The record may be typewritten or printed and the exhibits may be typewritten, photostated or otherwise reproduced, or upon motion of any party, or by order of the court, the original exhibits shall accompany the record. The court may require or permit substantial corrections or additions to the record when deemed desirable.\n(e) If, before the date set for trial, an application is made to the court for leave to present additional evidence on the issues in the case, and it is shown to the satisfaction of the court that the additional evidence is material, the court may order that the additional evidence be taken upon terms the court deems proper.\n(f) The review shall be conducted by the court without a jury. The court may affirm, reverse or modify the order or decision if the substantial rights of the petitioner have been prejudiced as a result of the order or decision being:\n(1) contrary to constitutional rights or privileges;\n(2) in excess of the statutory authority or jurisdiction of the agency, or affected by other error of law;\n(3) made or promulgated upon unlawful procedure;\n(4) unsupported by substantial evidence in view of the entire record as submitted; or\n(5) arbitrary or capricious.\n(g) Any party may appeal from the final judgment of the district court as in other civil cases.\n(h) No party to the review in any court is entitled to recover costs, attorney's fees, witness fees, or any other disbursement.\nAll rates and charges shall be reasonable and shall be sufficient to compensate for all costs of devoting the sewage disposal plant, equipment, its collector system, and personnel to the accomplishment of the purpose of the service to be rendered but shall not include profit. When the sewer system of any municipality or any part thereof is devoted to the use of another municipality, all charges for such use shall be reasonable and shall be sufficient to compensate for all costs of such use, but shall not include profit.\nNothing in subdivision 4 shall preclude the fixing of rates and charges by agreement of the parties under subdivision 3.\nAny case referred to the commissioner under this section may be remanded to the agency as provided in section 115.48, subdivision 5.\nAny contract ordered by the agency pursuant to this section may be reformed or terminated upon: (1) mutual agreement among all parties to the contract as exhibited by a joint written application to the agency, and approval thereof by the agency; or (2) unilateral application to the agency by certified mail by any party to such a contract, with a copy thereof served by certified mail upon all other parties to the contract, and subsequent order of reformation or termination of the agreement by the agency. The applicant may in its application for reformation or termination seek other relief in addition to said order of reformation or termination, including, but not limited to, an order directing the refund by the municipality operating the disposal system of overpayments made by the municipality being served during the life of the contract, or the further payment by the municipality being served to the municipality operating the disposal system made necessary by the inadequacy of payments made by the municipality being served to the municipality operating the disposal system during the life of the contract. In the event of a unilateral application to the agency, the agency may, after 30 days written notice, hold a public hearing for the purpose of hearing evidence relating to the application. Pursuant to an application under this subdivision, the agency may enter its order reforming or terminating the contract, ordering a refundment of overpayment or payment of underpayment, as aforesaid, or granting any further relief that is reasonable under the circumstances. Any party aggrieved by the agency's decision may thereafter appeal to district court from the agency's order.",
	"repealed": false
}