{
	"id": "31.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.51",
	"title": "31.51 DEFINITIONS.",
	"text": "For the purpose of sections 31.51 to 31.56, the terms defined in this section have the meanings ascribed to them.\n\"Slaughter house\" means an establishment in which animals other than poultry are slaughtered, eviscerated, or dressed for human food.\n\"Retail meat market\" or \"wholesale meat processing establishment\" means an establishment with or without slaughtering facilities, where animal carcasses or edible products derived therefrom are cured, salted, processed, packaged, or otherwise prepared for sale as food intended for human consumption; provided, however, that retail meat market or wholesale meat processing establishment does not include: (1) a purveyor of meals, or (2) a frozen food processing plant in which no slaughtering operations are conducted.\n\"Sausage plant\" means an establishment in which meats are processed into sausages or other similar products and packed for shipment, storage, or for wholesale sales.\n[Repealed, 1969 c 87 s 7]\n\"Poultry dressing plant\" means an establishment in which poultry is killed and dressed for human food.\n[Repealed, 1969 c 87 s 7]\n\"Rabbit dressing plant\" means an establishment in which rabbits are killed and dressed for human food.\n\"Animal\" means cattle, swine, sheep, goats, farmed Cervidae, as defined in section 35.153, subdivision 3, horses, mules or other equines, llamas as defined in section 17.455, subdivision 2, and Ratitae, as defined in section 17.453, subdivision 3.\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1963 c 598 s 4]\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1969 c 87 s 7]\n\"Purveyor of meals\" means a person who cooks or otherwise prepares for sale directly to the consumer meat or poultry products from animals or poultry which have been slaughtered or processed in a state licensed establishment, or an establishment holding a state permit or in an establishment which is under the inspection program of the United States Department of Agriculture.",
	"repealed": false
}