{
	"id": "325E.028",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.028",
	"title": "325E.028 UTILITY PAYMENT ARRANGEMENTS FOR MILITARY SERVICE PERSONNEL.",
	"text": "(a) A municipal utility, cooperative electric association, or public utility must not disconnect the utility service of a residential customer if a member of the household has been issued orders into active duty, for deployment, or for a permanent change in duty station during the period of active duty, deployment, or change in duty station if such a residential customer:\n(1) has a household income below the state median household income or is receiving energy assistance and enters into an agreement with the municipal utility, cooperative electric association, or public utility under which the residential customer pays ten percent of the customer's gross monthly income toward the customer's bill and the residential customer remains reasonably current with those payments; or\n(2) has a household income above the state median household income and enters into an agreement with the municipal utility, cooperative electric association, or public utility establishing a reasonable payment schedule that considers the financial resources of the household and the residential customer remains reasonably current with payments under the payment schedule.\n(b) For purposes of this subdivision, \"household income\" means household income measured after the date of the orders specified in paragraph (a).\n(a) A municipal utility, cooperative electric association, or public utility must notify all residential customers annually of the provisions of this section.\n(b) A municipal utility, cooperative electric association, or public utility must provide a form to a residential customer to request the protections of this section upon the residential customer's request.\nFor the purposes of this section, \"disconnection\" includes a service or load limiter or any device that limits or interrupts electric service in any way.\nVerification of income may be conducted by the local energy assistance provider or the municipal utility, cooperative electric association, or public utility unless the customer is automatically eligible for protection against disconnection as a recipient of any form of public assistance, including energy assistance that uses income eligibility in an amount at or below the income eligibility in subdivision 1, paragraph (a), clause (1).\n(a) The municipal utility, cooperative electric association, or public utility shall provide the residential customer with a commission-approved written notice of the right to appeal to the commission or other appropriate governing body when the utility and residential customer are unable to agree on the establishment, reasonableness, or modification of a payment schedule, or on the reasonable timeliness of the payments under a payment schedule, provided for by this section. Any appeal must be made within seven working days after the residential customer's receipt of personally served notice, or within ten working days after the utility has deposited first class mail notice in the United States mail.\n(b) The utility shall not disconnect service while a payment schedule is pending appeal, or until any appeal involving payment schedules has been determined by the commission.\nThis section may be enforced pursuant to chapter 216B.",
	"repealed": false
}