{
	"id": "297G.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.01",
	"title": "297G.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given them unless the language or context clearly indicates that a different meaning is intended.\n\"Alcoholic beverage\" is any beverage containing more than one-half of one percent alcohol by volume.\n\"Brewer\" is a person who manufactures malt liquor for sale.\n\"Cider\" means a product that contains not less than one-half of one percent nor more than seven percent alcohol by volume and is made from the alcoholic fermentation of the juice of apples. Cider includes, but is not limited to, flavored, sparkling, and carbonated cider.\n\"Collector\" is a person who collects commemorative bottles for their use and enjoyment as collector's items and not for the consumption of the beverage contained in them. The term does not include licensed wholesalers or retailers of alcoholic beverages.\n\"Commemorative bottles\" are ceramic commemorative bottles or other specially designed decanters which have value as collector's items and which contain an alcoholic beverage.\n\"Commissioner\" is the commissioner of revenue.\n\"Distilled spirits\" means:\n(1) intoxicating liquors, including ethyl alcohol, hydrated oxide of ethyl, spirits of wine, whiskey, rum, brandy, gin, and other distilled spirits, including all dilutions and mixtures, for nonindustrial use;\n(2) any beverage that would be classified as a flavored malt beverage except that the alcohol contribution from flavors and other nonbeverage materials exceeds 49 percent of the alcohol content of the product; or\n(3) any beverage that would be classified as a flavored malt beverage except that the beverage contains more than six percent alcohol by volume, and more than 1.5 percent of the volume of the finished product consists of alcohol derived from flavors and other nonbeverage ingredients that contain alcohol.\n\"Fermented malt beverages\" is any beer, ale, or other beverage made from malt by fermentation and containing not less than one-half of one percent alcohol by volume.\n(a) \"Flavored malt beverage\" means a fermented malt beverage that:\n(1) contains six percent or less alcohol by volume and derives at least 51 percent of its alcohol content by volume from the fermentation of grain-derived carbohydrates, as long as not more than 49 percent of the beverage's overall alcohol content is obtained from flavors and other added nonbeverage ingredients containing alcohol; or\n(2) contains more than six percent alcohol by volume that derives not more than 1.5 percent of its overall alcohol content by volume from flavors and other added nonbeverage ingredients containing alcohol.\n(b) Flavored malt beverage does not include cider or an alcoholic beverage obtained primarily by fermentation of rice, such as sake.\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.\n\"Intoxicating liquor\" is ethyl alcohol, distilled spirits, fermented, spirituous, vinous, and fermented malt beverages containing more than 3.2 percent of alcohol by weight.\n\"Liqueur-filled candy\" is any confectionery containing more than one-half of one percent alcohol by volume in liquid form that is intended for or capable of beverage use.\nFor purposes of this chapter, the terms defined in section 340A.101, have the meanings given them in that section except as provided in this section.\n\"Manufacturer\" is a person who, by a process of manufacturing, fermenting, brewing, distilling, refining, rectifying, blending, or by the combination of different materials, prepares or produces intoxicating liquor for sale.\n\"Miniatures\" are containers of distilled spirits of two fluid ounces or less or 50 milliliters or less.\n\"Person\" means an individual or any entity engaged in the sale of distilled spirits, wine, or fermented malt beverages.\n\"Retailer\" means a person engaged in this state in the business of selling, or offering to sell, distilled spirits, wine, or fermented malt beverages.\n\"Table or sparkling wine\" is a beverage made without rectification or fortification and containing not more than 25 percent alcohol by volume and made by the fermentation of grapes, grape juice, other fruits, or honey.\n\"3.2 percent malt liquor\" is a fermented malt beverage containing not less than one-half of one percent alcohol by volume nor more than 3.2 percent alcohol by weight.\n\"Wholesaler\" is a person who sells alcoholic beverages to persons to whom sale is permitted under section 340A.310, from a stock maintained in a warehouse in the state.\n\"Wine\" is the product made from the normal alcoholic fermentation of grapes, including still wine, sparkling and carbonated wine, wine made from condensed grape must, wine made from other agricultural products than sound ripe grapes, imitation wine, compounds sold as wine, vermouth, cider, perry, and sake, in each instance containing not less than one-half of one percent nor more than 24 percent alcohol by volume for nonindustrial use. Wine does not include distilled spirits as defined in subdivision 7.\n\"Low-alcohol dairy cocktail\" means a premixed cocktail, or any other product except liqueur-filled candy, that:\n(1) consists primarily of milk products;\n(2) contains distilled spirits;\n(3) is drinkable as a beverage or is promoted as an alcoholic product; and\n(4) contains less than 3.2 percent alcohol by volume.",
	"repealed": false
}