{
	"id": "144.4199",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4199",
	"title": "144.4199 PUBLIC HEALTH RESPONSE CONTINGENCY ACCOUNT.",
	"text": "A public health response contingency account is created in the special revenue fund in the state treasury. Money in the public health response contingency account does not cancel and is appropriated to the commissioner of health for the purposes specified in subdivisions 4 and 4a when the determination criteria in subdivision 3 and the requirements in subdivisions 5, paragraph (a), and 7, are satisfied.\nFor purposes of this section, \"public health response\" means immediate public health activities required to protect the health and safety of the public due to pandemic influenza or an outbreak of a communicable or infectious disease.\nThe commissioner may make expenditures from the public health response contingency account only if:\n(1) the commissioner determines the pandemic influenza or outbreak of a communicable or infectious disease requires a public health response;\n(2) the commissioner determines that the public health response is reasonably expected to require supplies, equipment, personnel, and other resources in excess of the resources available for public health response and preparedness activities in the affected jurisdictions; and\n(3) the commissioner has notified the relevant federal agency that the pandemic influenza or communicable or infectious disease:\n(i) is reasonably expected to require the evacuation of the impacted population, relocation of seriously ill or injured persons to temporary care facilities, or the provision of replacement essential community services;\n(ii) poses a probability of a large number of deaths, serious injuries, or long-term disabilities in the affected population;\n(iii) involves widespread exposure to an infectious agent that poses a significant risk of substantial future harm to a large number of people in the affected area; or\n(iv) poses a significant risk of harm to a large number of people or a high rate of morbidity or mortality in the affected population.\n(a) When the determination criteria in subdivision 3 are satisfied and the commissioner has complied with subdivisions 5, paragraph (a), and 7, the commissioner may make expenditures from the public health response contingency account for the following purposes attributable to a public health response:\n(1) staffing;\n(2) information technology;\n(3) supplies, equipment, and services to protect people in the affected area or population, health care providers, and public safety workers;\n(4) training for and coordination with local public health departments and health care providers;\n(5) communication with and outreach to affected areas or populations;\n(6) to provide a state match for federal assistance obtained for the public health response;\n(7) laboratory testing, including enhancements to laboratory capacity necessary to conduct testing related to the event, and supplies, equipment, shipping, and security;\n(8) the purchase of vaccines, antibiotics, antivirals, and other medical resources to prevent the spread of the pandemic influenza or communicable or infectious disease or to treat related medical conditions;\n(9) reimbursement to community health boards or other local units of government for incurred costs for the goods and services listed in clauses (1) to (8) that are attributable to the public health response;\n(10) reimbursement to health care organizations and health care providers for incurred costs that are attributable to the public health response; and\n(11) funding to support other state agencies for costs incurred by those agencies that are attributable to the public health response.\n(b) Money in the account must not be used to increase the total number of full-time equivalent permanent employees at the Department of Health, unless expressly authorized by law. Money in the account shall be used only for public health response activities to protect the health and safety of the public.\nWhen the criteria in subdivision 3 are satisfied and the commissioner has complied with subdivisions 5, paragraph (a), and 7, the commissioner, in consultation with entities such as hospitals, ambulance services licensed under chapter 144E, emergency management, and public health agencies, may make payments from the public health response contingency account to ambulance services licensed under chapter 144E; health care clinics; pharmacies; health care facilities and long-term care facilities, including but not limited to hospitals, nursing facilities, and settings at which assisted living services or health care services are or may be provided; and health systems, for costs that are necessary on an emergency basis to plan for, prepare for, or respond to pandemic influenza or a communicable or infectious disease. Funds paid under this subdivision must be used for the following purposes:\n(1) the establishment and operation of temporary sites to provide testing services, to provide treatment beds, or to isolate or quarantine affected individuals;\n(2) temporary conversion of space for another purpose that will revert to its original use;\n(3) staff overtime and hiring additional staff;\n(4) staff training and orientation;\n(5) purchasing consumable protective or treatment supplies and equipment to protect or treat staff, visitors, and patients;\n(6) development and implementation of screening and testing procedures;\n(7) patient outreach activities;\n(8) additional emergency transportation of patients;\n(9) temporary information technology and systems costs to support patient triage, screening, and telehealth activities;\n(10) purchasing replacement parts or filters for medical equipment that are necessary for the equipment's operation;\n(11) specialty cleaning supplies for facilities and equipment;\n(12) expenses related to the isolation or quarantine of staff. These expenses must not include payment of wages for the staff being isolated or quarantined; or\n(13) other expenses that, in the judgment of the commissioner, cannot reasonably be expected to generate income for the recipient of the funds after the outbreak ends.\n(a) As a condition of making expenditures from the public health response contingency account, the commissioner must seek any appropriate assistance from other available sources, including the federal government, to assist with costs attributable to the public health response.\n(b) If the commissioner recovers eligible costs for the public health response from a nonstate source after making expenditures from the public health response contingency account, the commissioner shall reimburse the public health response contingency account for those costs, up to the amount recovered for eligible costs from the nonstate source.\nNothing in this section shall be construed to limit the emergency management authority of the governor or any local or county organization for emergency management under chapter 12 or other law.\n(a) For pandemic influenza or an outbreak of a communicable or infectious disease that begins on or after July 1, 2017, if the commissioner determines that a public health response to pandemic influenza or an outbreak of a communicable or infectious disease may require the diversion of Department of Health staff or resources, the commissioner shall provide written notice to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance with information on the event requiring the public health response, the public health response that may be required, and estimates of the staff hours and resources that the commissioner may need to divert to provide the public health response. For pandemic influenza or an outbreak of a communicable or infectious disease that begins prior to July 1, 2017, the commissioner must provide the notice required by this paragraph no later than July 10, 2017.\n(b) Prior to authorizing expenditures from the public health response contingency account, the commissioner shall seek review and recommendation from the Legislative Advisory Commission according to the procedures in section 3.3005, subdivision 5, that would otherwise apply if the funds were federal funds. The commissioner is prohibited from seeking review and recommendation for any expenditures for public health response activities that were made before the commissioner provided the notice required in paragraph (a).\nBy January 15 of each year, the commissioner shall submit a report to the chairs and ranking minority members of the house of representatives Ways and Means Committee, the senate Finance Committee, and the house of representatives and senate committees with jurisdiction over health and human services finance, detailing expenditures made in the previous calendar year from the public health response contingency account. This report is exempt from section 144.05, subdivision 7.",
	"repealed": false
}