{
	"id": "398.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.20",
	"title": "398.20 PARK DISTRICTS.",
	"text": "Boundaries of park districts as created by this chapter shall be determined and park districts activated as follows:\nApplication for the creation of a park district shall be made to the county board or boards of the county or counties within which the district is to be located. The application shall either be signed by one percent of the electors residing within each county or portion thereof to be included within the proposed district as determined by the number of electors voting at the last preceding general election within such territory, or, in lieu thereof, shall be authorized by resolutions adopted by a majority of the governing bodies of the cities within each county or portion thereof to be included in the proposed district. The application shall contain an accurate description of the territory to be included in the proposed district and when presented to the county board or boards shall be accompanied by an accurate map or plat thereof. Where multicounty districts are proposed applications for the various portions of the district shall be presented to the respective county boards in which the portions of the district lie.\nAn application may consist of more than one counterpart, each setting forth the description of the proposed territory of the district and containing the signatures of one or more electors and having endorsed thereon or attached thereto the affidavit of the person obtaining such signatures stating that to the best of the affiant's information or belief, they are genuine and are the signatures of duly qualified electors residing within the proposed park district.\nUpon the filing of the applications provided for in subdivision 1, each county board shall fix a time for the hearing of the application which shall be not less than 20 nor more than 40 days after the date of such filing. Notice of such filing and the date of hearing shall be published in a newspaper of general circulation within the proposed district. If there is no newspaper of general circulation within the proposed district, then the notice shall be posted in five of the most public places within the proposed district. The notice shall be published or posted for not less than 15 days prior to the date fixed for the hearing. The hearing may be adjourned from time to time. At a hearing on an application for the creation of a park district, each county board shall consider and determine the sufficiency of the application and shall hear all arguments for and against the creation of the district. Joint hearings may be held pursuant to notice thereof where the activation of a multicounty district is applied for. If the county board finds the application to be insufficient, additional signatures or resolutions may be obtained and the application may be resubmitted to the board at any time within six months of the original filing thereof. Signatures or resolutions may be withdrawn at any time prior to the final determination by the board as to sufficiency of the application.\nWhen the application has been determined to be sufficient the board of county commissioners in single county districts, and each board of county commissioners in multicounty districts, shall consider whether or not the designation and activation of the district will be conducive to the general welfare. If a majority of the board of county commissioners in single county districts or a majority of each board of county commissioners in multicounty districts shall determine that it will be conducive to the general welfare a resolution so stating shall be adopted designating and activating the district. Such resolution shall not be adopted sooner than 90 days after the first hearing is held. The boards may change but not expand the boundaries of proposed multicounty districts from those described in the application at the time of the hearing, and may exclude all territory within any county if the county board of that county disapproves the application. Park districts when finally activated must include all of one county excluding cities of the first class therein, or parts of more than one county, but the boundary lines of the district as finally ordered by the board or boards shall not divide any existing town or municipal corporation and shall not include any territory situated in any other park district activated pursuant to this chapter and shall not include any noncontiguous areas unless such areas are located in a county containing a city of the first class.\nThe county board on its own motion may, and if requested to do so by petition of one percent of the electors in the proposed district residing within the county, as determined in subdivision 1, shall submit to a referendum of the electors in the proposed district residing within the county at the next general or primary election the following question which shall be worded on the ballot in this way:\nShall a park district be activated encompassing the following territory: (here insert the designation of each county to be included in the district in its entirety, or in its entirety except for cities of the first class, and of each city or town to be included which is outside any such county, and a legal description of any unorganized territory to be included which is outside any such county)?\nIf a majority of the votes cast on this issue in single county districts are \"yes\" votes, the referendum shall be declared carried and the park district shall be activated. In multicounty districts a majority of the votes cast on this issue in each county where a referendum is held must be \"yes\" votes for the referendum to carry. In all cases where referenda carry the county boards shall have 60 days to appoint park district commissioners. If they fail to appoint such commissioners within 60 days after the referendum, the governor shall make such appointments. Referenda need be held in only those counties where a petition bearing the required number of elector's signatures is filed or where the board of county commissioners orders a referendum.\nOnce a park district is activated, referenda may be held on its enlargement as herein provided, but not on its activation.",
	"repealed": false
}