{
	"id": "414.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.09",
	"title": "414.09 UNIFORM PROCEDURES.",
	"text": "(a) Proceedings initiated by the submission of an initiating document or by the chief administrative law judge shall come on for hearing within 30 to 60 days from receipt of the document by the chief administrative law judge or from the date of the chief administrative law judge's action and the person conducting the hearing must submit an order no later than one year from the date of the day of the first hearing.\n(b) The place of the hearing shall be in the county where a majority of the affected territory is situated, and shall be established for the convenience of the parties.\n(c) The chief administrative law judge shall mail notice of the hearing to the following parties: the township or municipality presently governing the affected territory; any township or municipality abutting the affected territory; the county where the affected territory is situated; and each planning agency which has jurisdiction over the affected area.\n(d) The chief administrative law judge shall see that notice of the hearing is published for two successive weeks in a legal newspaper of general circulation in the affected area.\n(e) When the chief administrative law judge exercises authority to change the boundaries of the affected area so as to increase the quantity of the land, the hearing shall be recessed and reconvened upon two weeks' published notice in a legal newspaper of general circulation in the affected area.\nThe chief administrative law judge shall see that copies of the order are mailed to all parties entitled to mailed notice of hearing under subdivision 1, the secretary of state, the state demographer, individual property owners if initiated in that manner, affected county auditor, and any other party of record. The affected county auditor shall record the order against the affected property.\n(a) An order approving an incorporation or consolidation pursuant to this chapter, or an order requiring an election under section 414.031, subdivision 4a, shall set a date for an election of new municipal officers not less than 45 days nor more than 60 days after the issuance of such order.\n(b) The chief administrative law judge shall appoint an acting clerk for election purposes, at least three election judges who shall be residents of the new municipality, and shall designate polling places within the new municipality.\n(c) The acting clerk shall prepare the official election ballot.\n(d) Any person eligible to hold municipal office may file an affidavit of candidacy not more than four weeks nor less than two weeks before the date designated in the order for the election.\n(e) The election shall be conducted in conformity with the charter and the laws for conducting municipal elections insofar as applicable.\n(f) Any person eligible to vote at a township or municipal election within the area of the new municipality, is eligible to vote at such election.\n(g) Any excess in the expense of conducting the election over receipts from filing fees shall be a charge against the new municipality; any excess of receipts shall be deposited in the treasury of the new municipality.",
	"repealed": false
}