{
	"id": "204C.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.22",
	"title": "204C.22 DETERMINING VOTER'S INTENT.",
	"text": "A ballot shall not be rejected for a technical error that does not make it impossible to determine the voter's intent. In determining intent the principles contained in this section apply.\nIntent shall be ascertained only from the face of the ballot.\nIf a voter places a mark beside the names of more candidates for an office than are to be elected or nominated, the ballot is defective with respect only to that office. No vote shall be counted for any candidate for that office, but the rest of the ballot shall be counted if possible. At a primary, if a voter has not indicated a party preference and places a mark beside the names of candidates of more than one party on the partisan ballot, the ballot is totally defective and no votes on it shall be counted. If a voter has indicated a party preference at a primary, only votes cast for candidates of that party shall be counted.\nIf a voter votes both yes and no on a question, no vote may be counted for that question, but the rest of the ballot must be counted if possible.\nIf a voter has written the name of an individual in the proper place on a general or special election ballot a vote shall be counted for that individual whether or not the voter makes a mark in the oval or other target shape opposite the blank.\nA write-in vote cast for a candidate for governor without a write-in vote for a candidate for lieutenant governor must be counted as a vote for the candidate team including the lieutenant governor candidate selected by that candidate for governor.\nIf a voter has written the name of an individual on a primary or special primary ballot, a vote shall not be counted for that office.\nIf a mark (X) is made out of its proper place, but so near a name or space as to indicate clearly the voter's intent, the vote shall be counted.\nIf a number of individuals are to be elected to the same office, the election judges shall count all names written in and all printed names with marks in oval or other target shape opposite them, not exceeding the whole number to be elected. When fewer names than the number to be elected are marked or written in, only the marked or written in names shall be counted. When more names than the number to be elected are marked or written in, the ballot is defective with respect to that office and no vote shall be counted for that office.\nMisspelling or abbreviations of the names of write-in candidates shall be disregarded if the individual for whom the vote was intended can be clearly ascertained from the ballot.\nIf the voter's choice for only some of the offices or questions can be determined from a ballot, the ballot shall be counted for those offices or questions only.\nIf a voter uniformly uses a mark that clearly indicates an intent to mark a name or to mark yes or no on a question, and the voter does not use the more standard mark anywhere else on the ballot, a vote shall be counted for each candidate or response to a question marked. If a voter uses two or more distinct marks, such as (X) and some other mark, a vote shall be counted for each candidate or response to a question marked, unless the ballot is marked by distinguishing characteristics that make the entire ballot defective as provided in subdivision 13.\nIf the names of two candidates have been marked, and an attempt has been made to erase or obliterate one of the marks, a vote shall be counted for the remaining marked candidate. If an attempt has been made to obliterate a write-in name a vote shall be counted for the remaining write-in name or marked candidate.\nA ballot shall not be rejected merely because it is slightly soiled or defaced.\nIf a ballot is marked by distinguishing characteristics in a manner making it evident that the voter intended to identify the ballot, the entire ballot is defective.\nIf the number of candidates for an office is equal to the number of individuals to be elected to that office, and the voter has not marked any name, no vote shall be counted for any candidate for that office.\nIf no name or response to a question is marked and no name is written in, the ballot is blank with respect to that office or question. A ballot that is blank with respect to one or more offices or questions is not defective.",
	"repealed": false
}