{
	"id": "142G.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.16",
	"title": "142G.16 INCOME LIMITATIONS.",
	"text": "(a) The agency shall determine initial eligibility by considering all earned and unearned income as defined in section 256P.06. To be eligible for MFIP, the assistance unit's countable income minus the earned income disregards in paragraph (a) and section 256P.03 must be below the family wage level according to section 142G.17, subdivision 7, for that size assistance unit.\n(b) The initial eligibility determination must disregard the following items:\n(1) the earned income disregard as determined in section 256P.03;\n(2) dependent care costs must be deducted from gross earned income for the actual amount paid for dependent care up to a maximum of $200 per month for each child less than two years of age, and $175 per month for each child two years of age and older;\n(3) all payments made according to a court order for spousal support or the support of children not living in the assistance unit's household shall be disregarded from the income of the person with the legal obligation to pay support; and\n(4) an allocation for the unmet need of an ineligible spouse or an ineligible child under the age of 21 for whom the caregiver is financially responsible and who lives with the caregiver according to section 142G.33.\n(c) The income test is for a six-month period. The assistance payment calculation is based on prospective budgeting according to section 256P.09.\n[See Note.]\nTo be eligible for MFIP, the result of the computations in paragraphs (a) to (e) applied to prospective budgeting must be at least $1.\n(a) Apply an income disregard as defined in section 256P.03, to gross earnings and subtract this amount from the family wage level. If the difference is equal to or greater than the MFIP transitional standard, the assistance payment is equal to the MFIP transitional standard. If the difference is less than the MFIP transitional standard, the assistance payment is equal to the difference. The earned income disregard in this paragraph must be deducted every month there is earned income.\n(b) All payments made according to a court order for spousal support or the support of children not living in the assistance unit's household must be disregarded from the income of the person with the legal obligation to pay support.\n(c) An allocation for the unmet need of an ineligible spouse or an ineligible child under the age of 21 for whom the caregiver is financially responsible and who lives with the caregiver must be made according to section 142G.33.\n(d) Subtract unearned income dollar for dollar from the MFIP transitional standard to determine the assistance payment amount.\n(e) When income is both earned and unearned, the amount of the assistance payment must be determined by first treating gross earned income as specified in paragraph (a). After determining the amount of the assistance payment under paragraph (a), unearned income must be subtracted from that amount dollar for dollar to determine the assistance payment amount.\n[See Note.]\n(a) The income of all members of the assistance unit must be counted. Income may also be deemed from ineligible persons to the assistance unit. Income must be attributed to the person who earns it or to the assistance unit according to paragraphs (b) and (c).\n(b) Income from jointly owned property must be divided equally among property owners unless the terms of ownership provide for a different distribution.\n(c) Deductions are not allowed from the gross income of a financially responsible household member or by the members of an assistance unit to meet a current or prior debt.",
	"repealed": false
}