{
	"id": "52.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.19",
	"title": "52.19 EXPULSION OR WITHDRAWAL OF MEMBERS.",
	"text": "A member may be expelled by a two-thirds vote of the members present at a special meeting called to consider the matter, but only after a hearing. A member may also be expelled by the board of directors in accordance with a procedure and policy under subdivision 2. Any member may withdraw from the credit union at any time, but notice of withdrawal may be required. All amounts paid on shares or as deposits of an expelled or withdrawing member, with any dividends or interest accredited thereto, to the date thereof, shall, as funds become available and after deducting all amounts due from the member to the credit union and an amount as necessary to honor outstanding share drafts drawn against the accounts of the member, be paid to the member. The credit union may require 60 days' notice of intention to withdraw shares and 30 days' notice of intention to withdraw deposits, except that a credit union shall not at any time require notice of withdrawal of funds subject to withdrawal by share drafts. Withdrawing or expelled members shall have no further right in the credit union, but are not, by the expulsion or withdrawal, released from any remaining liability to the credit union.\n(a) The board of directors may adopt a procedure and policy for expulsion of members for cause and for nonparticipation in the affairs of the credit union. The nonparticipation policy must be based on failure to purchase and maintain at least one credit union share or to pay entrance or membership fees, if any.\n(b) For the purposes of this section, \"cause\" includes a loss to the credit union, a violation of the membership agreement, fraud, attempted fraud, other illegal behavior or inappropriate behavior as defined by credit union policy such as physical or verbal abuse of credit union members or staff.\n(c) If adopted, written notice of the procedure and policy and their effective date shall be delivered not less than 30 days before their effective date to each member of the credit union at the member's address on the credit union records. Each new member shall be provided written notice of the procedure and policy before or upon applying for membership.",
	"repealed": false
}