{
	"id": "169.864",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.864",
	"title": "169.864 SPECIAL PRODUCTS VEHICLE PERMITS.",
	"text": "The commissioner may issue a permit for a vehicle that transports paper products, finished forest products, or iron ore tailings and meets the following requirements:\n(1) is a combination of vehicles, including a truck-tractor and a semitrailer drawing one additional semitrailer, which may be equipped with an auxiliary dolly, and no semitrailer used in the three-vehicle combination has an overall length in excess of 28-1/2 feet;\n(2) has a maximum gross vehicle weight of 108,000 pounds;\n(3) complies with the axle weight limits in section 169.824;\n(4) complies with the tire weight limits in section 169.823 or the tire manufacturer's recommended load, whichever is less;\n(5) is operated only in this state on Trunk Highway marked 2 between Grand Rapids and the port of Duluth; on Trunk Highway marked 169 between Grand Rapids and its junction with Trunk Highway marked 53; on Trunk Highway marked 194 between Trunk Highway marked 2 and Trunk Highway marked 53; and on Trunk Highway marked 53; and\n(6) the seasonal weight increases authorized under section 169.826, subdivision 1, do not apply.\nThe commissioner may issue a permit for a vehicle that transports paper products, finished forest products, or iron ore tailings and meets the following requirements:\n(1) is a combination of vehicles consisting of a truck-tractor and a single semitrailer that may exceed 48 feet, but not 53 feet, if the distance from the kingpin to the centerline of the rear axle group of the semitrailer does not exceed 43 feet;\n(2) has a maximum gross vehicle weight of 90,000 pounds if the vehicle combination has a total of six or more axles or 97,000 pounds if the vehicle combination has a total of seven or more axles;\n(3) has a maximum gross vehicle weight of 99,000 pounds during the time when seasonal weight increases authorized under section 169.826, subdivision 1, are in effect;\n(4) complies with the axle weight limits in section 169.824;\n(5) complies with the tire weight limits in section 169.823 or the tire manufacturer's recommended load, whichever is less; and\n(6) is operated only on the highways specified in subdivision 1, clause (5).\n(a) The commissioner may issue a permit authorizing a vehicle used exclusively to haul earthmover tires, if the vehicle:\n(1) is a combination of vehicles with seven or more axles, consisting of a truck with loader and trailer, which may be equipped with an auxiliary dolly;\n(2) has a maximum gross vehicle weight of 108,000 pounds;\n(3) has a maximum width of 144 inches;\n(4) does not exceed the axle weight limits in sections 169.823, subdivision 1, clause (2), and 169.824, by more than 22 percent;\n(5) complies with the tire weight limits in section 169.823, or the tire manufacturer's recommended load, whichever is less; and\n(6) is operated only on the highways specified in subdivision 1, clause (5).\n(b) The seasonal weight increases authorized under section 169.826, subdivision 1, do not apply to permits issued under this subdivision.\nVehicles issued permits under subdivisions 1, 2, and 2a, must comply with the following restrictions:\n(1) the vehicle must be operated in compliance with seasonal load restrictions under section 169.87;\n(2) the vehicle may not be operated on the interstate highway system; and\n(3) the vehicle may be operated on streets or highways under the control of local authorities only upon the approval of the local authority; however, vehicles may have reasonable access to terminals and facilities for food, fuel, repairs, and rest and for continuity of route within one mile of the national network as provided by section 169.81, subdivision 3, and by Code of Federal Regulations, title 23, section 658.19.\nVehicle permits issued under subdivision 1, clause (1), must be annual permits. The fee is $850 for each vehicle combination and must be deposited in the trunk highway fund. The fee for annual permits issued under subdivision 2 is $300 for a 90,000-pound vehicle combination or $500 for a 97,000-pound vehicle combination. The fee for annual permits issued under subdivision 2a is $850. An amount sufficient to administer the permit program is appropriated from the trunk highway fund to the commissioner for the costs of administering the permit program.",
	"repealed": false
}