{
	"id": "515.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/515.06",
	"title": "515.06 COMMON AREAS AND FACILITIES.",
	"text": "(a) Each apartment owner shall be entitled to an undivided interest in the common areas and facilities in the percentage expressed in the declaration. Such percentage shall be computed by taking as a basis the value of the apartment in relation to the value of the property.\n(b) The percentage of the undivided interest of each apartment owner in the common areas and facilities as expressed in the declaration shall have a permanent character and shall not be altered without the consent of all of the apartment owners expressed in an amended declaration duly recorded. The percentage of the undivided interest in the common areas and facilities shall not be separated from the apartment to which it appertains and shall be deemed to be conveyed or encumbered with the apartment even though such interest is not expressly mentioned or described in the conveyance or other instrument.\n(c) The common areas and facilities shall remain undivided and no apartment owner or any other person shall bring any action for partition or division of any part thereof, unless the property has been removed from the provisions of sections 515.01 to 515.29 as provided in sections 515.16 and 515.26. Any covenant to the contrary shall be null and void.\n(d) Each apartment owner may use the common areas and facilities in accordance with the purpose for which they were intended without hindering or encroaching upon the lawful rights of the other apartment owners.\n(e) The necessary work of maintenance, repair, and replacement of the common areas and facilities and the making of any additions or improvements thereto shall be carried out only as provided herein and in the bylaws.\n(f) The association of apartment owners shall have the irrevocable right, to be exercised by the manager or board of directors, to have access to each apartment from time to time during reasonable hours as may be necessary for the maintenance, repair, or replacement of any of the common areas and facilities therein or accessible therefrom, or for making emergency repairs therein necessary to prevent damage to the common areas and facilities or to another apartment or apartments.",
	"repealed": false
}