{
	"id": "216B.1635",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1635",
	"title": "216B.1635 RECOVERY OF GAS UTILITY INFRASTRUCTURE COSTS.",
	"text": "(a) \"Gas utility\" means a public utility as defined in section 216B.02, subdivision 4, that furnishes natural gas service to retail customers.\n(b) \"Gas utility infrastructure costs\" or \"GUIC\" means costs incurred in gas utility projects that:\n(1) do not serve to increase revenues by directly connecting the infrastructure replacement to new customers;\n(2) are in service but were not included in the gas utility's rate base in its most recent general rate case, or are planned to be in service during the period covered by the report submitted under subdivision 2, but in no case longer than the one-year forecast period in the report; and\n(3) do not constitute a betterment, unless the betterment is based on requirements by a political subdivision or a federal or state agency, as evidenced by specific documentation, an order, or other similar requirement from the government entity requiring the replacement or modification of infrastructure.\n(c) \"Gas utility projects\" means:\n(1) replacement of natural gas facilities located in the public right-of-way required by the construction or improvement of a highway, road, street, public building, or other public work by or on behalf of the United States, the state of Minnesota, or a political subdivision; and\n(2) replacement or modification of existing natural gas facilities, including surveys, assessments, reassessment, and other work necessary to determine the need for replacement or modification of existing infrastructure that is required by a federal or state agency.\nA public utility submitting a petition to recover gas infrastructure costs under this section must submit to the commission, the department, and interested parties a gas infrastructure project plan report and a petition for rate recovery of only incremental costs associated with projects under subdivision 1, paragraph (c). The report and petition must be made at least 150 days in advance of implementation of the rate schedule, provided that the rate schedule will not be implemented until the petition is approved by the commission pursuant to subdivision 5. The report must be for a forecast period of one year.\nThe gas infrastructure project plan report required to be filed under subdivision 2 shall include all pertinent information and supporting data on each proposed project including, but not limited to, project description and scope, estimated project costs, and project in-service date.\nNotwithstanding any other provision of this chapter, the commission may approve a rate schedule for the automatic annual adjustment of charges for gas utility infrastructure costs net of revenues under this section, including a rate of return, income taxes on the rate of return, incremental property taxes, incremental depreciation expense, and any incremental operation and maintenance costs. A gas utility's petition for approval of a rate schedule to recover gas utility infrastructure costs outside of a general rate case under section 216B.16 is subject to the following:\n(1) a gas utility may submit a filing under this section no more than once per year; and\n(2) a gas utility must file sufficient information to satisfy the commission regarding the proposed GUIC. The information includes, but is not limited to:\n(i) the information required to be included in the gas infrastructure project plan report under subdivision 3;\n(ii) the government entity ordering or requiring the gas utility project and the purpose for which the project is undertaken;\n(iii) a description of the estimated costs and salvage value, if any, associated with the existing infrastructure replaced or modified as a result of the project;\n(iv) a comparison of the utility's estimated costs included in the gas infrastructure project plan and the actual costs incurred, including a description of the utility's efforts to ensure the costs of the facilities are reasonable and prudently incurred;\n(v) calculations to establish that the rate adjustment is consistent with the terms of the rate schedule, including the proposed rate design and an explanation of why the proposed rate design is in the public interest;\n(vi) the magnitude and timing of any known future gas utility projects that the utility may seek to recover under this section;\n(vii) the magnitude of GUIC in relation to the gas utility's base revenue as approved by the commission in the gas utility's most recent general rate case, exclusive of gas purchase costs and transportation charges;\n(viii) the magnitude of GUIC in relation to the gas utility's capital expenditures since its most recent general rate case; and\n(ix) the amount of time since the utility last filed a general rate case and the utility's reasons for seeking recovery outside of a general rate case.\nUpon receiving a gas utility report and petition for cost recovery under subdivision 2 and assessment and verification under subdivision 4, the commission may approve the annual GUIC rate adjustments provided that, after notice and comment, the costs included for recovery through the rate schedule are prudently incurred and achieve gas facility improvements at the lowest reasonable and prudent cost to ratepayers.\nThe return on investment for the rate adjustment shall be at the level approved by the commission in the public utility's last general rate case, unless the commission determines that a different rate of return is in the public interest.\nThe commission may issue orders and adopt rules necessary to implement and administer this section.",
	"repealed": false
}