{
	"id": "469.1813",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1813",
	"title": "469.1813 ABATEMENT AUTHORITY.",
	"text": "The governing body of a political subdivision may grant a current or prospective abatement, by contract or otherwise, of the taxes imposed by the political subdivision on a parcel of property, which may include personal property and machinery, or defer the payments of the taxes and abate the interest and penalty that otherwise would apply, if:\n(1) it expects the benefits to the political subdivision of the proposed abatement agreement to at least equal the costs to the political subdivision of the proposed agreement or intends the abatement to phase in a property tax increase, as provided in clause (2)(vii); and\n(2) it finds that doing so is in the public interest because it will:\n(i) increase or preserve tax base;\n(ii) provide employment opportunities in the political subdivision;\n(iii) provide or help acquire or construct public facilities;\n(iv) help redevelop or renew blighted areas;\n(v) help provide access to services for residents of the political subdivision;\n(vi) finance or provide public infrastructure;\n(vii) phase in a property tax increase on the parcel resulting from an increase of 50 percent or more in one year on the estimated market value of the parcel, other than increase attributable to improvement of the parcel; or\n(viii) stabilize the tax base through equalization of property tax revenues for a specified period of time with respect to a taxpayer whose real and personal property is subject to valuation under Minnesota Rules, chapter 8100.\nAs used in this section and sections 469.1814 and 469.1815, \"abatement\" includes a deferral of taxes with abatement of interest and penalties unless the context indicates otherwise.\n(a) The governing body of a political subdivision may grant an abatement only by adopting an abatement resolution, specifying the terms of the abatement. In the case of a town, the board of supervisors may approve the abatement resolution. The resolution must also include a specific statement as to the nature and extent of the public benefits which the governing body expects to result from the agreement. The resolution may provide that the political subdivision will retain or transfer to another political subdivision the abatement to pay for all or part of the cost of acquisition or improvement of public infrastructure, whether or not located on or adjacent to the parcel for which the tax is abated. The abatement may reduce all or part of the property tax amount for the political subdivision on the parcel. A political subdivision's maximum annual amount for a parcel equals its total local tax rate multiplied by the total net tax capacity of the parcel.\n(b) The political subdivision may limit the abatement:\n(1) to a specific dollar amount per year or in total;\n(2) to the increase in property taxes resulting from improvement of the property;\n(3) to the increases in property taxes resulting from increases in the market value or tax capacity of the property;\n(4) in any other manner the governing body of the subdivision determines is appropriate; or\n(5) to the interest and penalty that would otherwise be due on taxes that are deferred.\n(c) The political subdivision may not abate tax attributable to the areawide tax under chapter 276A or 473F, except as provided in this subdivision.\nAn abatement granted under this section is not an abatement for purposes of state aid or local levy under sections 127A.40 to 127A.51.\nThe governing body of a political subdivision may not enter into a property tax abatement agreement under sections 469.1812 to 469.1815 that provides for abatement of taxes on a parcel, if the abatement will occur while the parcel is located in a tax increment financing district.\n(a) The governing body of the political subdivision may approve an abatement under sections 469.1812 to 469.1815 only after holding a public hearing on the abatement.\n(b) Notice of the hearing must be published in a newspaper of general circulation in the political subdivision at least once more than ten days but less than 30 days before the hearing. The newspaper must be one of general interest and readership in the community, and not one of limited subject matter. The newspaper must be published at least once per week. The notice must indicate that the governing body will consider granting a property tax abatement, identify the property or properties for which an abatement is under consideration, and the total estimated amount of the abatement.\n(a) A political subdivision may grant an abatement for a period no longer than 15 years, except as provided under paragraph (b). The abatement period commences in the first year in which the abatement granted is either paid or retained in accordance with section 469.1815, subdivision 2. The subdivision may specify in the abatement resolution a shorter duration. If the resolution does not specify a period of time, the abatement is for eight years. If an abatement has been granted to a parcel of property and the period of the abatement has expired, the political subdivision that granted the abatement may not grant another abatement for eight years after the expiration of the first abatement. This prohibition does not apply to improvements added after and not subject to the first abatement. Economic abatement agreements for real and personal property subject to valuation under Minnesota Rules, chapter 8100, are not subject to this prohibition and may be granted successively.\n(b) A political subdivision proposing to abate taxes for a parcel may request, in writing, that the other political subdivisions in which the parcel is located grant an abatement for the property. If one of the other political subdivisions declines, in writing, to grant an abatement or if 90 days pass after receipt of the request to grant an abatement without a written response from one of the political subdivisions, the duration limit for an abatement for the parcel by the requesting political subdivision and any other participating political subdivision is increased to 20 years. If the political subdivision which declined to grant an abatement later grants an abatement for the parcel, the 20-year duration limit is reduced by one year for each year that the declining political subdivision grants an abatement for the parcel during the period of the abatement granted by the requesting political subdivision. The duration limit may not be reduced below the limit under paragraph (a).\nWhen the tax is deferred and the interest and penalty abated, the political subdivision must set a schedule for repayments. The deferred payment must be included with the current taxes due and payable in the years the deferred payments are due and payable and must be levied accordingly.\nNotwithstanding the provisions of subdivision 6, a political subdivision may grant an abatement for a period of up to 20 years, if the abatement is for a taxpayer whose real and personal property is subject to valuation under Minnesota Rules, chapter 8100.\nThe political subdivision may provide in the abatement resolution that the abatement may not be modified or changed during its term. If the abatement resolution does not provide that the abatement may not be modified or changed, the governing body of the political subdivision may review and modify the abatement every second year after it was approved.\nIn any year, the total amount of property taxes abated by a political subdivision under this section may not exceed (1) ten percent of the net tax capacity of the political subdivision for the taxes payable year to which the abatement applies, or (2) $200,000, whichever is greater. The limit under this subdivision does not apply to:\n(i) an uncollected abatement from a prior year that is added to the abatement levy; or\n(ii) a taxpayer whose real and personal property is subject to valuation under Minnesota Rules, chapter 8100.\nA political subdivision may abate the taxes on a parcel under sections 469.1812 to 469.1815 without obtaining the consent of the property owner. This subdivision does not apply to abatements granted to a taxpayer whose real and personal property is valued under Minnesota Rules, chapter 8100.\nWhen this statute is applied or utilized with respect to a taxpayer whose real and personal property is subject to valuation under Minnesota Rules, chapter 8100, the provisions of this section and sections 469.1814 and 469.1815 shall apply only to property specified or described in the abatement contract or agreement.",
	"repealed": false
}