{
	"id": "142A.414",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.414",
	"title": "142A.414 PROCEDURES AND CRITERIA FOR DISBURSEMENT.",
	"text": "The commissioner shall establish in the plan for prevention of child abuse the criteria for distribution of trust fund money. All money shall be distributed for programs and services involving primary or secondary prevention, and no money shall be distributed for programs and services involving tertiary prevention.\nTrust fund money shall only be distributed to applicants that demonstrate an ability to match at least 40 percent of the amount of trust fund money requested and whose proposals meet the other criteria. The matching requirement may be met through in-kind donations. In awarding grants, the commissioner shall consider the extent to which the applicant has demonstrated a willingness and ability to:\n(1) continue the prevention program or service if trust fund money is eliminated or reduced; and\n(2) provide prevention program models and consultation to other organizations and communities.\nPriority must be given to applicants whose matching funds do not consist, in whole or in part, of state or federal funds. Any trust fund money received must not be used to compensate for a decrease in previously existing funding levels unless that decrease is attributable to a decision made by state, federal, or other entities not controlled by the applicant and the applicant demonstrates that it has made reasonable efforts to retain all previously existing funding.\nThe commissioner may fund programs that intend to serve the entire state or a region larger than the area served by any local council even if the program has not been reviewed by any local council. The commissioner may, however, solicit comments or recommendations about the applicant or the program from a local council covering any area to be served by the applicant's proposed program.\nThe commissioner may disburse funds to a local council for community education purposes, or for administrative costs in carrying out sections 142A.41 to 142A.416 and 144.226, subdivision 3, if all criteria and standards are met.\nPrograms transferred to the Department of Education from the Department of Employment and Economic Development may not be included in the consolidated funding account and are ineligible for local consolidation. The commissioner may not apply for federal waivers to include these programs in funding consolidation initiatives. The programs include the following:\n(1) programs for the homeless under sections 116L.365 and 256K.48;\n(2) emergency energy assistance under section 216C.265;\n(3) weatherization programs under section 216C.264;\n(4) food shelf programs under section 142F.14 and the emergency food assistance program; and\n(5) lead abatement programs under section 142A.46.\nThe commissioner shall use state or local resources and staff if practicable but may enter into contracts with public or nonprofit private agencies to fulfill the requirements of sections 142A.41 to 142A.416 and 144.226, subdivision 3.\nThe commissioner may adopt rules to carry out sections 142A.41 to 142A.416 and 144.226, subdivision 3.",
	"repealed": false
}