{
	"id": "256Q.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256Q.06",
	"title": "256Q.06 PLAN ACCOUNTS.",
	"text": "Any person may make contributions to an ABLE account on behalf of a designated beneficiary. Contributions to an account made by persons other than the account owner become the property of the account owner. A person does not acquire an interest in an ABLE account by making contributions to an account. Contributions to an account must be made in cash, by check, or by other commercially acceptable means, as permitted by the Internal Revenue Service and approved by the plan administrator in cooperation with the commissioner and the board.\nContributions to an ABLE account are subject to the requirements of section 529A(b) of the Internal Revenue Code. The total account balance of an ABLE account may not exceed the maximum account balance limit imposed under section 136G.09, subdivision 8. The plan administrator must reject any portion of a contribution to an account that exceeds the annual contribution limit or that would cause the total account balance to exceed the maximum account balance limit imposed under section 136G.09, subdivision 8.\nAn account owner is the only person entitled to:\n(1) request distributions;\n(2) request rollover distributions; or\n(3) change the beneficiary of an ABLE account to a member of the family of the current beneficiary, but only if the beneficiary to whom the ABLE account is transferred is an eligible individual.\nAmendments to this chapter automatically amend the participation agreement. Any amendments to the operating procedures and policies of the plan automatically amend the participation agreement after adoption by the commissioner or the board.\nAll assets of the plan, including contributions to accounts, are held in trust for the exclusive benefit of account owners. Assets must be held in a separate account in the state treasury to be known as the Minnesota ABLE plan account or in accounts with the third-party provider selected pursuant to section 256Q.05, subdivision 4. Plan assets are not subject to claims by creditors of the state, are not part of the general fund, and are not subject to appropriation by the state. Payments from the Minnesota ABLE plan account shall be made under this chapter.\nIf an eligible individual is unable to establish the eligible individual's own ABLE account, an ABLE account may be established on behalf of the eligible individual by the eligible individual's agent under a power of attorney or, if none, by the eligible individual's conservator or legal guardian, spouse, parent, sibling, or grandparent or a representative payee appointed for the eligible individual by the Social Security Administration, in that order.",
	"repealed": false
}