{
	"id": "144.6502",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6502",
	"title": "144.6502 ELECTRONIC MONITORING IN CERTAIN FACILITIES.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Department\" means the Department of Health.\n(d) \"Electronic monitoring\" means the placement and use of an electronic monitoring device in the resident's room or private living unit in accordance with this section.\n(e) \"Electronic monitoring device\" means a camera or other device that captures, records, or broadcasts audio, video, or both, that is placed in a resident's room or private living unit and is used to monitor the resident or activities in the room or private living unit.\n(f) \"Facility\" means a facility that is:\n(1) licensed as a nursing home under chapter 144A;\n(2) licensed as a boarding care home under sections 144.50 to 144.56;\n(3) until August 1, 2021, a housing with services establishment registered under chapter 144D that is either subject to chapter 144G or has a disclosed special unit under section 325F.72; or\n(4) on or after August 1, 2021, an assisted living facility.\n(g) \"Resident\" means a person 18 years of age or older residing in a facility.\n(h) \"Resident representative\" means one of the following in the order of priority listed, to the extent the person may reasonably be identified and located:\n(1) a court-appointed guardian;\n(2) a health care agent as defined in section 145C.01, subdivision 2; or\n(3) a person who is not an agent of a facility or of a home care provider designated in writing by the resident and maintained in the resident's records on file with the facility.\n(a) A resident or a resident representative may conduct electronic monitoring of the resident's room or private living unit through the use of electronic monitoring devices placed in the resident's room or private living unit as provided in this section.\n(b) Nothing in this section precludes the use of electronic monitoring of health care allowed under other law.\n(c) Electronic monitoring authorized under this section is not a covered service under home and community-based waivers under chapter 256S and sections 256B.0913, 256B.092, and 256B.49.\n(d) This section does not apply to monitoring technology authorized as a home and community-based service under chapter 256S or section 256B.0913, 256B.092, or 256B.49.\n(a) Except as otherwise provided in this subdivision, a resident must consent to electronic monitoring in the resident's room or private living unit in writing on a notification and consent form. If the resident has not affirmatively objected to electronic monitoring and the resident's medical professional determines that the resident currently lacks the ability to understand and appreciate the nature and consequences of electronic monitoring, the resident representative may consent on behalf of the resident. For purposes of this subdivision, a resident affirmatively objects when the resident orally, visually, or through the use of auxiliary aids or services declines electronic monitoring. The resident's response must be documented on the notification and consent form.\n(b) Prior to a resident representative consenting on behalf of a resident, the resident must be asked if the resident wants electronic monitoring to be conducted. The resident representative must explain to the resident:\n(1) the type of electronic monitoring device to be used;\n(2) the standard conditions that may be placed on the electronic monitoring device's use, including those listed in subdivision 6;\n(3) with whom the recording may be shared under subdivision 10 or 11; and\n(4) the resident's ability to decline all recording.\n(c) A resident, or resident representative when consenting on behalf of the resident, may consent to electronic monitoring with any conditions of the resident's or resident representative's choosing, including the list of standard conditions provided in subdivision 6. A resident, or resident representative when consenting on behalf of the resident, may request that the electronic monitoring device be turned off or the visual or audio recording component of the electronic monitoring device be blocked at any time.\n(d) Prior to implementing electronic monitoring, a resident, or resident representative when acting on behalf of the resident, must obtain the written consent on the notification and consent form of any other resident residing in the shared room or shared private living unit. A roommate's or roommate's resident representative's written consent must comply with the requirements of paragraphs (a) to (c). Consent by a roommate or a roommate's resident representative under this paragraph authorizes the resident's use of any recording obtained under this section, as provided under subdivision 10 or 11.\n(e) Any resident conducting electronic monitoring must immediately remove or disable an electronic monitoring device prior to a new roommate moving into a shared room or shared private living unit, unless the resident obtains the roommate's or roommate's resident representative's written consent as provided under paragraph (d) prior to the roommate moving into the shared room or shared private living unit. Upon obtaining the new roommate's signed notification and consent form and submitting the form to the facility as required under subdivision 5, the resident may resume electronic monitoring.\n(f) The resident or roommate, or the resident representative or roommate's resident representative if the representative is consenting on behalf of the resident or roommate, may withdraw consent at any time and the withdrawal of consent must be documented on the original consent form as provided under subdivision 5, paragraph (d).\nIf a resident of a facility who is residing in a shared room or shared living unit, or the resident representative of such a resident when acting on behalf of the resident, wants to conduct electronic monitoring and another resident living in or moving into the same shared room or shared living unit refuses to consent to the use of an electronic monitoring device, the facility shall make a reasonable attempt to accommodate the resident who wants to conduct electronic monitoring. A facility has met the requirement to make a reasonable attempt to accommodate a resident or resident representative who wants to conduct electronic monitoring when, upon notification that a roommate has not consented to the use of an electronic monitoring device in the resident's room, the facility offers to move the resident to another shared room or shared living unit that is available at the time of the request. If a resident chooses to reside in a private room or private living unit in a facility in order to accommodate the use of an electronic monitoring device, the resident must pay either the private room rate in a nursing home setting, or the applicable rent in a housing with services establishment or assisted living facility. If a facility is unable to accommodate a resident due to lack of space, the facility must reevaluate the request every two weeks until the request is fulfilled. A facility is not required to provide a private room, a single-bed room, or a private living unit to a resident who is unable to pay.\n(a) Electronic monitoring may begin only after the resident or resident representative who intends to place an electronic monitoring device and any roommate or roommate's resident representative completes the notification and consent form and submits the form to the facility.\n(b) Notwithstanding paragraph (a), the resident or resident representative who intends to place an electronic monitoring device may do so without submitting a notification and consent form to the facility for up to 14 days:\n(1) if the resident or the resident representative reasonably fears retaliation against the resident by the facility, timely submits the completed notification and consent form to the Office of Ombudsman for Long-Term Care, and timely submits a Minnesota Adult Abuse Reporting Center report or police report, or both, upon evidence from the electronic monitoring device that suspected maltreatment has occurred;\n(2) if there has not been a timely written response from the facility to a written communication from the resident or resident representative expressing a concern prompting the desire for placement of an electronic monitoring device and if the resident or a resident representative timely submits a completed notification and consent form to the Office of Ombudsman for Long-Term Care; or\n(3) if the resident or resident representative has already submitted a Minnesota Adult Abuse Reporting Center report or police report regarding the resident's concerns prompting the desire for placement and if the resident or a resident representative timely submits a completed notification and consent form to the Office of Ombudsman for Long-Term Care.\n(c) Upon receipt of any completed notification and consent form, the facility must place the original form in the resident's file or file the original form with the resident's housing with services contract. The facility must provide a copy to the resident and the resident's roommate, if applicable.\n(d) If a resident is conducting electronic monitoring according to paragraph (b) and a new roommate moves into the room or living unit, the resident or resident representative must submit the signed notification and consent form to the facility. In the event that a resident or roommate, or the resident representative or roommate's resident representative if the representative is consenting on behalf of the resident or roommate, chooses to alter the conditions under which consent to electronic monitoring is given or chooses to withdraw consent to electronic monitoring, the facility must make available the original notification and consent form so that it may be updated. Upon receipt of the updated form, the facility must place the updated form in the resident's file or file the original form with the resident's signed housing with services contract. The facility must provide a copy of the updated form to the resident and the resident's roommate, if applicable.\n(e) If a new roommate, or the new roommate's resident representative when consenting on behalf of the new roommate, does not submit to the facility a completed notification and consent form and the resident conducting the electronic monitoring does not remove or disable the electronic monitoring device, the facility must remove the electronic monitoring device.\n(f) If a roommate, or the roommate's resident representative when withdrawing consent on behalf of the roommate, submits an updated notification and consent form withdrawing consent and the resident conducting electronic monitoring does not remove or disable the electronic monitoring device, the facility must remove the electronic monitoring device.\n(a) The notification and consent form completed by the resident must include, at a minimum, the following information:\n(1) the resident's signed consent to electronic monitoring or the signature of the resident representative, if applicable. If a person other than the resident signs the consent form, the form must document the following:\n(i) the date the resident was asked if the resident wants electronic monitoring to be conducted;\n(ii) who was present when the resident was asked;\n(iii) an acknowledgment that the resident did not affirmatively object; and\n(iv) the source of authority allowing the resident representative to sign the notification and consent form on the resident's behalf;\n(2) the resident's roommate's signed consent or the signature of the roommate's resident representative, if applicable. If a roommate's resident representative signs the consent form, the form must document the following:\n(i) the date the roommate was asked if the roommate wants electronic monitoring to be conducted;\n(ii) who was present when the roommate was asked;\n(iii) an acknowledgment that the roommate did not affirmatively object; and\n(iv) the source of authority allowing the resident representative to sign the notification and consent form on the roommate's behalf;\n(3) the type of electronic monitoring device to be used;\n(4) a list of standard conditions or restrictions that the resident or a roommate may elect to place on the use of the electronic monitoring device, including but not limited to:\n(i) prohibiting audio recording;\n(ii) prohibiting video recording;\n(iii) prohibiting broadcasting of audio or video;\n(iv) turning off the electronic monitoring device or blocking the visual recording component of the electronic monitoring device for the duration of an exam or procedure by a health care professional;\n(v) turning off the electronic monitoring device or blocking the visual recording component of the electronic monitoring device while dressing or bathing is performed; and\n(vi) turning off the electronic monitoring device for the duration of a visit with a spiritual adviser, ombudsman, attorney, financial planner, intimate partner, or other visitor;\n(5) any other condition or restriction elected by the resident or roommate on the use of an electronic monitoring device;\n(6) a statement of the circumstances under which a recording may be disseminated under subdivision 10;\n(7) a signature box for documenting that the resident or roommate has withdrawn consent; and\n(8) an acknowledgment that the resident consents to the Office of Ombudsman for Long-Term Care and its representatives disclosing information about the form. Disclosure under this clause shall be limited to:\n(i) the fact that the form was received from the resident or resident representative;\n(ii) if signed by a resident representative, the name of the resident representative and the source of authority allowing the resident representative to sign the notification and consent form on the resident's behalf; and\n(iii) the type of electronic monitoring device placed.\n(b) Facilities must make the notification and consent form available to the residents and inform residents of their option to conduct electronic monitoring of their rooms or private living unit.\n(c) Notification and consent forms received by the Office of Ombudsman for Long-Term Care are classified under section 256.9744.\n(d) A facility that contacts the Office of Ombudsman for Long-Term Care regarding an electronic monitoring device presumably placed in accordance with subdivision 5, paragraph (a) or (b), must provide the office with the type, make, and model number of the electronic monitoring device discovered by the facility.\n(a) A resident or resident representative choosing to conduct electronic monitoring must do so at the resident's own expense, including paying purchase, installation, maintenance, and removal costs.\n(b) If a resident chooses to place an electronic monitoring device that uses Internet technology for visual or audio monitoring, the resident may be responsible for contracting with an Internet service provider.\n(c) The facility shall make a reasonable attempt to accommodate the resident's installation needs, including allowing access to the facility's public-use Internet or Wi-Fi systems when available for other public uses. A facility has the burden of proving that a requested accommodation is not reasonable.\n(d) All electronic monitoring device installations and supporting services must be UL-listed.\n(a) A facility must post a sign at each facility entrance accessible to visitors that states: \"Electronic monitoring devices, including security cameras and audio devices, may be present to record persons and activities.\"\n(b) The facility is responsible for installing and maintaining the signage required in this subdivision.\n(a) A person must not knowingly hamper, obstruct, tamper with, or destroy an electronic monitoring device placed in a resident's room or private living unit without the permission of the resident or resident representative. Checking the electronic monitoring device by facility staff for the make and model number does not constitute tampering under this subdivision.\n(b) It is not a violation of paragraph (a) if a person turns off the electronic monitoring device or blocks the visual recording component of the electronic monitoring device at the direction of the resident or resident representative, or if consent has been withdrawn.\n(a) No person may access any video or audio recording created through authorized electronic monitoring without the written consent of the resident or resident representative.\n(b) Except as required under other law, a recording or copy of a recording made as provided in this section may only be disseminated for the purpose of addressing health, safety, or welfare concerns of one or more residents.\n(c) A person disseminating a recording or copy of a recording made as provided in this section in violation of paragraph (b) may be civilly or criminally liable.\nSubject to applicable rules of evidence and procedure, any video or audio recording created through electronic monitoring under this section may be admitted into evidence in a civil, criminal, or administrative proceeding.\n(a) For the purposes of state law, the mere presence of an electronic monitoring device in a resident's room or private living unit is not a violation of the resident's right to privacy under section 144.651 or 144A.44.\n(b) For the purposes of state law, a facility or home care provider is not civilly or criminally liable for the mere disclosure by a resident or a resident representative of a recording.\nThe Office of Ombudsman for Long-Term Care and representatives of the office are immune from liability for conduct described in section 256.9742, subdivision 2.\n(a) A facility must not:\n(1) refuse to admit a potential resident or remove a resident because the facility disagrees with the decision of the potential resident, the resident, or a resident representative acting on behalf of the resident regarding electronic monitoring;\n(2) retaliate or discriminate against any resident for consenting or refusing to consent to electronic monitoring, as provided in section 144.6512 or 144G.92; or\n(3) prevent the placement or use of an electronic monitoring device by a resident who has provided the facility or the Office of Ombudsman for Long-Term Care with notice and consent as required under this section.\n(b) Any contractual provision prohibiting, limiting, or otherwise modifying the rights and obligations in this section is contrary to public policy and is void and unenforceable.\n(a) An employee of the facility or an employee of a contractor providing services at the facility, including an arranged home care provider as defined in section 144D.01, subdivision 2a, who is the subject of proposed disciplinary action based upon evidence obtained by electronic monitoring must be given access to that evidence for purposes of defending against the proposed action.\n(b) An employee who obtains a recording or a copy of the recording must treat the recording or copy confidentially and must not further disseminate it to any other person except as required under law. Any copy of the recording must be returned to the facility or resident who provided the copy when it is no longer needed for purposes of defending against a proposed action.\n(a) The commissioner may issue a correction order as provided under section 144A.10, 144A.45, 144A.474, or 144G.30, upon a finding that the facility has failed to comply with:\n(1) subdivision 5, paragraphs (c) to (f);\n(2) subdivision 6, paragraph (b);\n(3) subdivision 7, paragraph (c); or\n(4) subdivision 8, 9, 10, or 14.\n(b) For each violation of this section, the commissioner may impose a fine of up to $500 upon a finding of noncompliance with a correction order issued under this subdivision.\n(c) The commissioner may exercise the commissioner's authority under section 144D.05 to compel a housing with services establishment to meet the requirements of this section.",
	"repealed": false
}