{
	"id": "115E.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.045",
	"title": "115E.045 RESPONSE PLANS FOR TRUCKS AND CERTAIN TANK FACILITIES.",
	"text": "(a) By June 1, 1994, a person who owns or operates trucks or cargo trailer rolling stock transporting an average monthly aggregate total of more than 10,000 gallons of oil or hazardous substances as bulk cargo in this state shall prepare and maintain a prevention and response plan in accordance with this subdivision. The plan must include:\n(1) the name and business and nonbusiness telephone numbers of the individual or individuals having full authority to implement response action;\n(2) the telephone number of the local emergency response organizations, as defined in section 299K.01, subdivision 3, if the organizations cannot be reached by calling 911;\n(3) a description of the type of rolling stock and the maximum potential discharge that could occur from the equipment;\n(4) the telephone number of the single answering point system established under section 115E.09;\n(5) the telephone number of an individual or company with adequate personnel and equipment available to respond to a discharge, along with evidence that the individual or company and the individual responsible for preparing the plan have made arrangements for such response;\n(6) a description of the training that the owner or operator's truck or cargo trailer operators have received in handling hazardous materials and the emergency response information available in the vehicle; and\n(7) a description of the action that will be taken by a truck or cargo trailer owner or operator in response to a discharge.\n(b) The response plan must be retained on file at the person's principal place of business.\n(a) By June 1, 1994, a person who owns or operates a facility that stores more than 10,000 gallons but less than 1,000,000 gallons of oil or hazardous substances in aboveground tanks shall prepare and maintain a prevention and response plan in accordance with this subdivision. The abbreviated plan must include:\n(1) the name and business and nonbusiness telephone numbers of the individual or individuals having full authority to implement response action;\n(2) the telephone number of the local emergency response organizations, as defined in section 299K.01, subdivision 3, if the organizations cannot be reached by calling 911;\n(3) a description of the facility, tank capacities, spill prevention and secondary containment measures at the facility, and the maximum potential discharge that could occur at the facility;\n(4) the telephone number of the single answering point system established under section 115E.09;\n(5) documentation that adequate personnel and equipment will be available to respond to a discharge, along with evidence that prearrangements for such response have been made;\n(6) a description of the training employees at the facility receive in handling hazardous materials and in emergency response information; and\n(7) a description of the action that will be taken by the facility owner or operator in response to a discharge.\n(b) The response plan must be retained on file at the person's principal place of business.\nA person required to prepare a response plan under this section shall notify the commissioner of public safety when the plan has been completed. Upon request, the person shall provide a copy of the plan to the commissioner of the Pollution Control Agency.\nThis section does not apply to agricultural chemicals, as defined in section 18D.01, subdivision 3, that are subject to chapter 18B or 18C.",
	"repealed": false
}