{
	"id": "103E.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.611",
	"title": "103E.611 PAYING DRAINAGE LIENS AND INTEREST.",
	"text": "(a) Drainage liens against property benefited under this chapter are payable to the treasurer of the county in 20 or less equal annual installments. The first installment of the principal is due on or before November 1 after the drainage lien statement is recorded, and each subsequent installment is due on or before November 1 of each year afterwards until the principal is paid.\n(b) The drainage authority may, by order, direct the drainage lien to be paid by 1/15 of the principal on or before five years from November 1 after the lien statement is recorded, and 1/15 on or before November 1 of each year afterwards until the principal is paid.\n(c) The drainage authority may order that the drainage lien must be paid by one or two installments, notwithstanding paragraphs (a) and (b), if the principal amount of a lien against a lot or tract of property or against a county or municipality is less than $500.\n(a) Interest is an additional drainage lien on all property until paid. The interest rate on the drainage lien principal from the date the drainage lien statement is recorded must be set by the board but may not exceed the rate determined by the state court administrator for judgments under section 549.09, or six percent, whichever is greater.\n(b) Before the tax lists for the year are given to the county treasurer, the auditor shall compute the interest on the unpaid balance of the drainage lien at the rate set by the board. The amount of interest must be computed on the entire unpaid principal from the date the drainage lien was recorded to August 15 of the next calendar year, and afterwards from August 15 to August 15 of each year.\n(c) Interest is due and payable after November 1 of each year the drainage lien principal or interest is due and unpaid.\nInterest and any installment due must be entered on the tax lists for the year. The installment and interest must be collected in the same manner as real estate taxes for that year by collecting one-half of the total of the installment and interest with and as a part of the real estate taxes.\nInterest may be paid at any time, computed to the date of payment, except that after the interest is entered on the tax lists for the year, it is due as entered, without a reduction for prepayment.\nThe board may direct the county treasurer to accept any outstanding bond that is a legal obligation of the county under this chapter issued on account of a drainage lien in payment of drainage liens under the provisions of this chapter. The bonds must be accepted at their par value plus accrued interest.\nThe auditor shall keep a drainage lien record for each drainage project and system showing the amount of the drainage lien remaining unpaid against each tract of property.\nThe enforcement, collection, penalty, and interest provisions relating to real estate taxes apply to the payment of drainage liens.",
	"repealed": false
}