{
	"id": "176.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.341",
	"title": "176.341 HEARING ON PETITION.",
	"text": "Upon the filing of a petition, the chief administrative law judge shall fix a time and place for hearing the petition. The hearing shall be held as soon as practicable and at a time and place determined by the chief administrative law judge to be the most convenient for the parties, keeping in mind the intent of chapter 176 and the requirements of section 176.306. Except where a shorter time period is required under this chapter, all hearings must be held within 26 months after a petition has been filed, unless the chief administrative law judge issues an order for a later date for the hearing explaining why the hearing could not be held within 26 months.\nUnless otherwise ordered by the chief administrative law judge, the hearing shall be held in the county where the injury or death occurred.\nUnless subdivision 6 applies, at least 30 days prior to the date of hearing, the chief administrative law judge shall mail a notice of the time and place of hearing to each interested party. This subdivision does not apply to hearings which have been continued from an earlier date. In those cases, the notice shall be given in a manner deemed appropriate by the chief administrative law judge after considering the particular circumstances in each case.\nOnly the chief administrative law judge or designee, on a showing of good cause, may grant a continuance of a hearing at the office. Except in cases of emergency or other good cause shown, any request for a continuance must be signed by both the party and the attorney seeking the continuance.\nA continuance of a hearing will be granted only upon a showing of good cause. Good cause is established when the underlying eventuality is unforeseen, is not due to lack of preparation, is relevant, is brought to the chief administrative law judge's attention in a timely manner and does not prejudice the adversary.\nContinuances will not be granted for the reason that an attorney for one of the parties has scheduled a vacation for the date set for the hearing unless the attorney has, prior to the setting of the hearing date, notified the office of the unavailable dates.\nContinuances which are requested during the course of a hearing are subject to the same standards but may be granted or denied by the compensation judge assigned to the hearing. Continuances of prehearing or settlement conferences at the office are subject to the same standards but may be granted or denied by a compensation judge, the calendar judge, or other presiding officer assigned to the prehearing or settlement conference. Cancellation of settlement conferences shall be granted if all parties agree to cancellation.\nAbsent a clear showing of surprise at the hearing or the unexpected unavailability of a crucial witness, all evidence must be submitted at the time of the hearing. Upon a showing of good cause, the compensation judge may grant an extension not to exceed 30 days following the hearing date.\nAn employee may file a request for an expedited hearing which must be granted upon a showing of significant financial hardship. In determining whether a significant financial hardship exists, consideration shall be given to whether the employee is presently employed, the employee's income from all sources, the nature and extent of the employee's expenses and debts, whether the employee is the sole support of any dependents, whether either foreclosure of homestead property or repossession of necessary personal property is imminent, and any other matters which have a direct bearing on the employee's ability to provide food, clothing, and shelter for the employee and any dependents.\nA request for an expedited hearing must be accompanied by a sworn affidavit of the employee providing facts necessary to satisfy the criteria for a significant financial hardship. The request may be made at the time a claim petition is filed or any time thereafter. Unless the employer objects to the request in the answer to the claim petition or within 30 calendar days of the filing of a request made subsequent to the filing of the claim petition, the affidavit is a sufficient showing of significant financial hardship.\nIf a request for an expedited hearing has been served and filed, the compensation judge shall grant or deny the request, provided that where the parties agree that significant financial hardship exists or no objection to the request is timely filed, the request is automatically granted. If it is denied, the matter will be returned to the regular calendar of cases and the request for an expedited hearing may be renewed at a settlement conference.",
	"repealed": false
}