{
	"id": "169A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.03",
	"title": "169A.03 DEFINITIONS.",
	"text": "(a) As used in this chapter, unless the context clearly indicates otherwise, the terms defined in this section have the meanings given.\n(b) If a term defined in section 169.011, but not defined in this chapter, is used in this chapter, the term has the meaning given in section 169.011, unless the context clearly indicates otherwise.\n\"Alcohol concentration\" means:\n(1) the number of grams of alcohol per 100 milliliters of blood;\n(2) the number of grams of alcohol per 210 liters of breath; or\n(3) the number of grams of alcohol per 67 milliliters of urine.\n\"Aggravating factor\" includes:\n(1) a qualified prior impaired driving incident within the ten years immediately preceding the current offense;\n(2) having an alcohol concentration of 0.16 or more as measured at the time, or within two hours of the time, of the offense; or\n(3) having a child under the age of 16 in the motor vehicle at the time of the offense if the child is more than 36 months younger than the offender.\n\"Artificially derived cannabinoid\" has the meaning given in section 342.01, subdivision 6.\n\"Cannabis flower\" has the meaning given in section 342.01, subdivision 16.\n\"Cannabis product\" has the meaning given in section 342.01, subdivision 20.\n\"Commercial motor vehicle\" has the meaning given in section 169.011, subdivision 16.\n\"Commissioner\" means the commissioner of public safety or a designee.\n\"Control analysis\" means a procedure involving a solution that yields a predictable alcohol concentration reading.\n\"Controlled substance\" has the meaning given in section 152.01, subdivision 4.\n\"Driver\" has the meaning given in section 169.011, subdivision 24.\n\"Gross misdemeanor\" means a crime for which a person may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $3,000, or both.\nMS 2016 [Repealed, 2018 c 195 art 2 s 3]\n\"Head Start bus\" has the meaning given in section 169.011, subdivision 34.\n\"Hemp-derived consumer product\" has the meaning given in section 342.01, subdivision 37.\n\"Infrared or other approved breath-testing instrument\" means a breath-testing instrument that employs infrared or other technology and has been approved by the commissioner of public safety for determining alcohol concentration.\n\"Intoxicating substance\" means a drug or chemical, as those terms are defined in section 151.01, that when introduced into the human body impairs the central nervous system or impairs the human audio, visual, or mental processes. The term does not include alcohol or controlled substances.\n\"Lower-potency hemp edible\" has the meaning given in section 342.01, subdivision 50.\n\"Misdemeanor\" means a crime for which a person may be sentenced to imprisonment for not more than 90 days, or to payment of a fine of not more than $1,000, or both.\n\"Motorboat\" has the meaning given in section 86B.005, subdivision 9.\n\"Motorboat in operation\" does not include a motorboat that is anchored, beached, or securely fastened to a dock or other permanent mooring or a motorboat that is being rowed or propelled by other than mechanical means.\n\"Motor vehicle\" means every vehicle that is self-propelled and every vehicle that is propelled by electric power obtained from overhead trolley wires. The term includes motorboats in operation and off-road recreational vehicles, but does not include a vehicle moved solely by human power.\n\"Off-road recreational vehicle\" means an off-highway motorcycle as defined in section 84.787, subdivision 7; off-road vehicle as defined in section 84.797, subdivision 7; snowmobile as defined in section 84.81, subdivision 3; and all-terrain vehicle as defined in section 84.92, subdivision 8.\n\"Owner\" has the meaning given in section 169.011, subdivision 51.\n\"Peace officer\" means:\n(1) a State Patrol officer;\n(2) a University of Minnesota peace officer;\n(3) a police officer of any municipality, including towns having powers under section 368.01, or county; and\n(4) a state conservation officer.\n\"Police officer\" has the meaning given in section 169.011, subdivision 56.\n\"Prior impaired driving conviction\" includes a prior conviction under:\n(1) section 169A.20 (driving while impaired); 169A.31 (alcohol-related school bus or Head Start bus driving); or 360.0752 (impaired aircraft operation);\n(2) Minnesota Statutes 2012, section 609.21 (criminal vehicular homicide and injury, substance-related offenses), subdivision 1, clauses (2) to (6);\n(3) Minnesota Statutes 1998, section 169.121 (driver under influence of alcohol or controlled substance); 169.1211 (alcohol-related driving by commercial vehicle drivers); or 169.129 (aggravated DWI-related violations; penalty);\n(4) Minnesota Statutes 1996, section 84.91, subdivision 1, paragraph (a) (operating snowmobile or all-terrain vehicle while impaired); or Minnesota Statutes 2020, section 86B.331, subdivision 1, paragraph (a) (operating motorboat while impaired);\n(5) Minnesota Statutes 2006, section 609.21 (criminal vehicular homicide and injury, substance-related offenses), subdivision 1, clauses (2) to (6); subdivision 2, clauses (2) to (6); subdivision 2a, clauses (2) to (6); subdivision 2b, clauses (2) to (6); subdivision 3, clauses (2) to (6); or subdivision 4, clauses (2) to (6);\n(6) section 609.2112, subdivision 1, paragraph (a), clauses (2) to (6); 609.2113, subdivision 1, clauses (2) to (6), subdivision 2, clauses (2) to (6), or subdivision 3, clauses (2) to (6); or 609.2114, subdivision 1, paragraph (a), clauses (2) to (6), or subdivision 2, clauses (2) to (6); or\n(7) an ordinance from this state, or a statute or ordinance from another state, in conformity with any provision listed in clause (1), (2), (3), (4), (5), or (6).\nA \"prior impaired driving conviction\" also includes a prior juvenile adjudication that would have been a prior impaired driving conviction if committed by an adult.\n(a) \"Prior impaired driving-related loss of license\" includes a driver's license suspension, revocation, cancellation, denial, or disqualification under:\n(1) section 169A.31 (alcohol-related school bus or Head Start bus driving); 169A.50 to 169A.53 (implied consent law); 169A.54 (impaired driving convictions and adjudications; administrative penalties); 171.04 (persons not eligible for drivers' licenses); 171.14 (cancellation); 171.16 (court may recommend suspension); 171.165 (commercial driver's license, disqualification); 171.17 (revocation); 171.177 (revocation; pursuant to search warrant); or 171.18 (suspension); because of an alcohol-related incident;\n(2) Minnesota Statutes 2012, section 609.21 (criminal vehicular homicide and injury, substance-related offenses), subdivision 1, clauses (2) to (6);\n(3) Minnesota Statutes 1998, section 169.121 (driver under influence of alcohol or controlled substance); 169.1211 (alcohol-related driving by commercial vehicle drivers); or 169.123 (chemical tests for intoxication);\n(4) Minnesota Statutes 2006, section 609.21 (criminal vehicular homicide and injury, substance-related offenses), subdivision 1, clauses (2) to (6); subdivision 2, clauses (2) to (6); subdivision 2a, clauses (2) to (6); subdivision 2b, clauses (2) to (6); subdivision 3, clauses (2) to (6); or subdivision 4, clauses (2) to (6);\n(5) section 609.2112, subdivision 1, clauses (2) to (6); 609.2113, subdivision 1, clauses (2) to (6), subdivision 2, clauses (2) to (6), or subdivision 3, clauses (2) to (6); or 609.2114, subdivision 1, clauses (2) to (6), or subdivision 2, clauses (2) to (6); or\n(6) an ordinance from this state, or a statute or ordinance from another state, in conformity with any provision listed in clause (1), (2), (3), (4), or (5).\n(b) \"Prior impaired driving-related loss of license\" also includes the revocation of snowmobile or all-terrain vehicle operating privileges under section 84.911 (chemical testing), or motorboat operating privileges under section 86B.335 (testing for alcohol and controlled substances), for violations that occurred on or after August 1, 1994; the revocation of snowmobile or all-terrain vehicle operating privileges under section 84.91 (operation of snowmobiles and all-terrain vehicles by persons under the influence of alcohol or controlled substances); or the revocation of motorboat operating privileges under section 86B.331 (operation while using alcohol or drugs or with a physical or mental disability).\n(c) \"Prior impaired driving-related loss of license\" does not include any license action stemming solely from a violation of section 169A.33 (underage drinking and driving), 171.09 (conditions of a restricted license), or 340A.503 (persons under the age of 21, illegal acts).\n\"Qualified prior impaired driving incident\" includes prior impaired driving convictions and prior impaired driving-related losses of license.\n\"School bus\" has the meaning given in section 169.011, subdivision 71. In addition, the term includes type III vehicles as defined in section 169.011, subdivision 71, when driven by employees or agents of school districts.\nAs used in this section, \"search warrant\" means an order in writing that is:\n(1) in the name of this state or, if the person is located in an adjacent state, in the name of the adjacent state;\n(2) signed by a court other than a court exercising probate jurisdiction; and\n(3) obtained pursuant to the requirements in sections 626.04 to 626.18 or conforming statutes in the adjacent state.\n\"Street or highway\" has the meaning given in section 169.011, subdivision 81.\n\"Twice the legal limit\" means an alcohol concentration of two times the limit specified in section 169A.20, subdivision 1, clause (5).\n\"Vehicle\" has the meaning given in section 169.011, subdivision 92.",
	"repealed": false
}