{
	"id": "27.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/27.01",
	"title": "27.01 DEFINITIONS.",
	"text": "[Repealed, 1996 c 310 s 1]\n\"Perishable farm products\" means:\n(1) produce, including fresh fruits, vegetables, and mushrooms;\n(2) milk and cream and products manufactured from milk and cream; and\n(3) poultry and poultry products, including eggs.\n[Repealed, 1996 c 310 s 1]\nThe term \"voluntary extension of credit\" means a written agreement between a seller and a buyer wherein the time of payment for the purchase price of perishable farm products is extended beyond a due date.\n(a) \"Due date\" means 30 days from the date of delivery of perishable farm products by a seller to a buyer if the due date is not specified in the contract. For purposes of this definition a signed invoice with a due date is a contract.\n(b) If perishable farm products are consigned, \"due date\" means 30 days from the date the sale is made by the broker or handler, except as to milk processing plants, where the due date means 15 days following the monthly day of accounting subsequent to deliveries following the date fixed by each milk processing plant for that accounting.\n[Repealed, 1996 c 310 s 1]\n\"Commissioner\" means the commissioner of agriculture.\n(a) \"Farm products dealer,\" \"dealer of farm products,\" or \"dealer\" means any person operating as a retail food handler, wholesale food handler, wholesale food processor or manufacturer, or food broker who buys from or contracts with a seller for production or sale of perishable farm products for resale.\n(b) \"Farm products dealer,\" \"dealer of farm products,\" or \"dealer\" does not include:\n(1) a truck owner and operator who regularly engages in the business of transporting freight, including perishable farm products, for a transportation fee only, and who does not purchase, contract to purchase, or sell produce;\n(2) a marketing cooperative association in which substantially all of the voting stock is held by patrons who patronize the association and in which at least 75 percent of the business of the association is transacted with member or stockholder patrons;\n(3) a person who purchases perishable farm products and pays in cash, including lawful money of the United States, a cashier's check, a certified check, or a bank draft; or\n(4) a person who handles and deals in only canned, packaged, or processed perishable farm products that are no longer perishable as determined by the commissioner by rule.\n[Repealed, 1996 c 310 s 1]\n\"Seller\" means a farmer or perishable farm products supplier, whether the person is the owner of the perishable farm products or produces it for another person who holds title to it.\n\"Person\" has the meaning given in section 34A.01, subdivision 10.\n\"Retail food handler,\" \"wholesale food handler,\" \"wholesale food processor or manufacturer,\" and \"food broker\" have the meanings given in section 28A.05.",
	"repealed": false
}