{
	"id": "60B.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.55",
	"title": "60B.55 ANCILLARY FORMAL PROCEEDINGS.",
	"text": "If a domiciliary liquidator has been appointed for an insurer not domiciled in this state, the commissioner shall file a petition with the District Court for Ramsey County requesting appointment as ancillary receiver in this state:\n(a) if the commissioner finds that there are sufficient assets of the insurer located in this state to justify the appointment of an ancillary receiver;\n(b) if ten or more persons resident in this state having claims against the insurer file a petition with the commissioner requesting appointment of an ancillary receiver; or\n(c) if the protection of creditors or policyholders in this state so requires.\nThe court may issue an order appointing an ancillary receiver in whatever terms it deems appropriate. The recording of the order with any county recorder in this state imparts the same notice as a deed, bill of sale, or other evidence of title duly recorded with that county recorder.\nWhen a domiciliary liquidator has been appointed in a reciprocal state, the ancillary receiver appointed in this state under subdivision 1 shall have the sole right to recover all the assets of the insurer in this state not already recovered by the domiciliary liquidator, except that the domiciliary liquidator shall be entitled to and have the sole right to recover balances due from agents and the books, accounts, and other records of the insurer. The ancillary receiver shall have the right to recover balances due from agents and books, accounts, and other records of the insurer, if such action is necessary to protect the assets because of inaction by the domiciliary liquidator. The ancillary receiver shall, as soon as practicable, liquidate from their respective securities those special deposit claims and secured claims which are proved and allowed in the ancillary proceedings in this state, and shall pay the necessary expenses of the proceedings. The ancillary receiver shall promptly transfer all remaining assets to the domiciliary liquidator. Subject to this section, the ancillary receiver and deputies shall have the same powers and be subject to the same duties with respect to the administration of assets as a liquidator of an insurer domiciled in this state.\nWhen a domiciliary liquidator has been appointed in this state, ancillary receivers appointed in reciprocal states shall have, as to assets and books, accounts, and other records located in their respective states, corresponding rights and powers to those prescribed in subdivision 3 for ancillary receivers appointed in this state.",
	"repealed": false
}