{
	"id": "103E.323",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.323",
	"title": "103E.323 PROPERTY OWNERS' REPORT.",
	"text": "Within 30 days after the viewers' report is filed, the auditor must make a property owners' report from the information in the viewers' report showing for each property owner benefited or damaged by the proposed drainage project:\n(1) the name and address of the property owner;\n(2) each lot or tract and its area that is benefited or damaged;\n(3) the total number and value of acres added to a tract or lot by the proposed drainage of public waters, wetlands, and other areas not currently being cultivated;\n(4) the number of acres and amount of benefits being assessed for drainage of areas which before the drainage benefits could be realized would require a public-waters-work permit to work in public waters under section 103G.245 to excavate or fill a navigable water body under United States Code, title 33, section 403, or a permit to discharge into waters of the United States under United States Code, title 33, section 1344;\n(5) the number of acres and amount of benefits being assessed for drainage of areas that would be considered conversion of a wetland under United States Code, title 16, section 3821, if the area was placed in agricultural production;\n(6) the damage, if any, to riparian rights;\n(7) the amount of right-of-way acreage required;\n(8) the amount that each tract or lot will be benefited or damaged;\n(9) the net damages or benefits to each property owner;\n(10) the estimated cost to be assessed to the property owner based on the cost of the drainage project in the engineer's detailed survey report; and\n(11) a copy of the benefits and damages statement under section 103E.321, subdivision 2, paragraph (a), relating to the property owner.\nThe auditor must mail a copy of the property owners' report to each owner of property affected by the proposed drainage project, and may prepare and file an affidavit of mailing.",
	"repealed": false
}