{
	"id": "61A.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.072",
	"title": "61A.072 ACCELERATED BENEFITS.",
	"text": "(a) \"Accelerated benefits\" covered under this section are benefits payable under the life insurance contract:\n(1) to a policyholder or certificate holder, during the lifetime of the insured, in the anticipation of death or upon the occurrence of a specified life-threatening or catastrophic condition as defined by the policy or rider;\n(2) that reduce the death benefit otherwise payable under the life insurance contract; and\n(3) that are payable upon the occurrence of a single qualifying event that results in the payment of a benefit amount fixed at the time of acceleration.\n(b) \"Qualifying event\" means one or more of the following:\n(1) a medical condition that would result in a drastically limited life span as specified in the contract;\n(2) a medical condition that has required or requires extraordinary medical intervention, such as, but not limited to, major organ transplant or continuous artificial life support without which the insured would die;\n(3) a condition that usually requires continuous confinement in an eligible institution as defined in the contract if the insured is expected to remain there for the rest of the insured's life;\n(4) a medical condition that would, in the absence of extensive or extraordinary medical treatment, result in a drastically limited life span. Such conditions may include, but are not limited to, one or more of the following:\n(i) coronary artery disease resulting in an acute infarction or requiring surgery;\n(ii) permanent neurological deficit resulting from cerebral vascular accident;\n(iii) end stage renal failure;\n(iv) Acquired Immune Deficiency Syndrome; or\n(v) other medical conditions that the commissioner shall approve for any particular filing; or\n(5) other qualifying events that the commissioner approves for a particular filing.\nMS 2004 [Repealed, 2005 c 132 s 38]\nAccelerated benefit riders and life insurance policies with accelerated benefit provisions are primarily mortality risks rather than morbidity risks. They are life insurance benefits subject to this chapter.\nMS 1994 [Repealed, 1995 c 258 s 67]\nBefore paying the accelerated benefit, the insurer is required to obtain from an assignee or irrevocable beneficiary a signed acknowledgment of concurrence for payout. If the insurer making the accelerated benefit is itself the assignee under the policy, no acknowledgment is required.\n(a) Contract payment options shall include the option to take the benefit as a lump sum. The benefit shall not be made available as an annuity contingent upon the life of the insured.\n(b) No restrictions are permitted on the use of the proceeds.\n(c) If any death benefit remains after payment of an accelerated benefit, the accidental death benefit provision, if any, in the policy or rider shall not be affected by the payment of the accelerated benefit.\n(a) The terminology \"accelerated benefit\" shall be included in the descriptive title. Products regulated under this section shall not be described or marketed as long-term care insurance or as providing long-term care benefits.\n(b) A disclosure statement is required at the time of application for the policy or rider and at the time the accelerated benefit payment request is submitted that receipt of these accelerated benefits may be taxable and that assistance should be sought from a personal tax advisor. The disclosure statement shall be prominently displayed on the first page of the policy or rider and any other related documents.\n(c)(1) A written disclosure including, but not necessarily limited to, a brief description of the accelerated benefit and definitions of the conditions or occurrences triggering payment of the benefits shall be given to the applicant. The description shall include an explanation of any effect of the payment of a benefit on the policy's cash value, accumulation account, death benefit, premium, policy loans, and policy liens.\n(i) In the case of agent-solicited insurance, the agent shall provide the disclosure form to the applicant prior to or concurrently with the application. Acknowledgment of the disclosure shall be signed by the applicant and writing agent.\n(ii) In the case of a solicitation by direct response methods, the insurer shall provide the disclosure form to the applicant at the time the policy is delivered, with a notice that a full premium refund shall be received if the policy is returned to the company within the free look period.\n(iii) In the case of group insurance policies, the disclosure form shall be contained as part of the certificate of coverage or any related document furnished by the insurer for the certificate holder.\n(2) If there is a premium or cost of insurance charge, the insurer shall give the applicant a generic illustration numerically demonstrating any effect of the payment of a benefit on the policy's cash value, accumulation account, death benefit, premium, policy loans, and policy liens.\n(i) In the case of agent-solicited insurance, the agent shall provide the illustration to the applicant prior to or concurrently with the application.\n(ii) In the case of a solicitation by direct response methods, the insurer shall provide the illustration to the applicant at the time the policy is delivered.\n(iii) In the case of group insurance policies, the disclosure form shall be contained as part of the certificate of coverage or any related document furnished by the insurer for the certificate holder.\n(3) Disclosure of premium charge.\n(i) An insurer with financing options other than as described in subdivision 9, paragraph (a), clauses (2) and (3), shall disclose to the policy owner any premium or cost of insurance charge for the accelerated benefit. The insurer shall make a reasonable effort to assure that the certificate holder is aware of any additional premium or cost of insurance charge if the certificate holder is required to pay a charge.\n(ii) An insurer shall furnish an actuarial demonstration to the state insurance department when filing the product disclosing the method of arriving at its cost for the accelerated benefit.\n(4) The insurer shall disclose to the policy owner any administrative expense charge. The insurer shall make a reasonable effort to assure that the certificate holder is aware of any administrative expense charge if the certificate holder is required to pay the charge.\n(d) When a policy owner or certificate holder requests an acceleration, the insurer shall send a statement to the policy owner or certificate holder and irrevocable beneficiary showing any effect that the payment of the accelerated benefit will have on the policy's cash value, accumulation account, death benefit, premium, policy loans, and policy liens. The statement shall disclose that receipt of accelerated benefit payments may adversely affect the recipient's eligibility for Medicaid or other government benefits or entitlements. In addition, receipt of an accelerated benefit payment may be taxable and assistance should be sought from a personal tax advisor. When a previous disclosure statement becomes invalid as a result of an acceleration of the death benefit, the insurer shall send a revised disclosure statement to the policy owner or certificate holder and irrevocable beneficiary. When the insurer agrees to accelerate death benefits, the insurer shall issue an amended schedule page to the policyholder or notify the certificate holder under a group policy to reflect any new reduced in-force face amount of the contract.\nThe accelerated benefit provision shall be effective for accidents on the effective date of the policy or rider. The accelerated benefit provision shall be effective for illness no more than 30 days following the effective date of the policy or rider.\nThe insurer may offer a waiver of premium for the accelerated benefit provision in the absence of a regular waiver of premium provision being in effect. At the time the benefit is claimed, the insurer shall explain any continuing premium requirement to keep the policy in force.\nAn insurer shall not unfairly discriminate among insureds with differing qualifying events covered under the policy or among insureds with similar qualifying events covered under the policy. An insurer shall not apply further conditions on the payment of the accelerated benefits other than those conditions specified in the policy or rider.\n(a) The issuer may use the following financing options:\n(1) requiring a premium charge or cost of insurance charge for the accelerated benefit. This charge shall be based on sound actuarial principles. In the case of group insurance, the additional cost may also be reflected in the experience rating;\n(2) paying a present value of the face amount. The calculation shall be based on any applicable actuarial discount appropriate to the policy design. The interest rate or interest rate methodology used in the calculation shall be based on sound actuarial principles and disclosed in the contract or actuarial memorandum. The maximum interest rate used shall be no greater than the greater of:\n(i) current yield on 90-day treasury bills; or\n(ii) current maximum statutory adjustable policy loan interest rate;\n(3) accruing an interest charge on the amount of the accelerated benefits. The interest rate or interest rate methodology used in the calculation shall be based on sound actuarial principles and disclosed in the contract or actuarial memorandum. The maximum interest rate shall be no greater than the greater of:\n(i) current yield on 90-day treasury bills; or\n(ii) current maximum statutory adjustable policy loan interest rate.\nThe interest rate accrued on the portion of the lien that is equal in amount to the cash value of the contract at the time of the benefit acceleration shall be no more than the policy loan interest rate stated in the contract.\n(b)(1) Except as provided in clause (2), when an accelerated benefit is payable, there shall be no more than a pro rata reduction in the cash value based on the percentage of death benefits accelerated to produce the accelerated benefit payment.\n(2) Alternatively, the payment of accelerated benefits, any administrative expense charges, any future premiums, and any accrued interest can be considered a lien against the death benefit of the policy or rider and the access to the cash value may be restricted to any excess of the cash value over the sum of any other outstanding loans and the lien. Future access to additional policy loans could also be limited to any excess of the cash value over the sum of the lien and any other outstanding policy loans.\n(c) When payment of an accelerated benefit results in a pro rata reduction in the cash value, the payment may not be applied toward repaying an amount greater than a pro rata portion of any outstanding policy loans.\n(a) A qualified actuary should describe the accelerated benefits, the risks, the expected costs, and the calculation of statutory reserves in an actuarial memorandum accompanying each state filing. The insurer shall maintain in its files descriptions of the bases and procedures used to calculate benefits payable under these provisions. These descriptions shall be made available for examination by the commissioner upon request.\n(b)(1) When benefits are provided through the acceleration of benefits under group or individual life policies or riders to such policies, policy reserves shall be determined in accordance with the Standard Valuation Law. All valuation assumptions used in constructing the reserves shall be determined as appropriate for statutory valuation purposes by a member in good standing of the American Academy of Actuaries. Mortality tables and interest currently recognized for life insurance reserves by the National Association of Insurance Commissioners (NAIC) may be used as well as appropriate assumptions for the other provisions incorporated in the policy form. The actuary shall follow both actuarial standards and certification for good and sufficient reserves. Reserves in the aggregate should be sufficient to cover:\n(i) policies upon which no claim has yet arisen; and\n(ii) policies upon which an accelerated claim has arisen.\n(2) For policies and certificates that provide actuarially equivalent benefits, no additional reserves need to be established.\n(3) Policy liens and policy loans, including accrued interest, represent assets of the company for statutory reporting purposes. For a policy on which the policy lien exceeds the policy's statutory reserve liability, the excess shall be held as a nonadmitted asset.\nThe filing and prior approval of forms containing an accelerated benefit is required.",
	"repealed": false
}