{
	"id": "428B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/428B.01",
	"title": "428B.01 DEFINITIONS.",
	"text": "As used in sections 428B.01 to 428B.09, the terms in this section have the meanings given them.\n\"Activity\" means but is not limited to all of the following:\n(1) promotion of tourism within the district;\n(2) promotion of business activity, including but not limited to tourism, of businesses subject to the service charge within the tourism improvement district;\n(3) marketing, sales, and economic development; and\n(4) other services provided for the purpose of conferring benefits upon businesses located in the tourism improvement district that are subject to the tourism improvement district service charge.\n\"Business\" means a lodging business as defined by municipal ordinance.\n\"Business owner\" means a person recognized by a municipality as the owner of a business.\n\"City\" means a home rule charter or statutory city.\n\"Clerk\" means the chief clerical officer of the municipality.\n\"Governing body\" means, with respect to a city, a city council or other governing body of a city. With respect to a town, governing body means a town board or other governing body of a town. With respect to a county, governing body means a board of commissioners or other governing body of a county.\n\"Impacted business owners\" means a majority of business owners located within a proposed or established tourism improvement district.\n\"Municipality\" means a county, city, or town.\n\"Tourism improvement association\" means a new or existing and tax-exempt nonprofit corporation, entity, or agency charged with promoting tourism within the tourism improvement district and that is under contract with the municipality to administer the tourism improvement district and implement the activities and improvements listed in the municipality's ordinance.\n\"Tourism improvement district\" means a tourism improvement district established under this chapter.",
	"repealed": false
}