{
	"id": "121A.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.611",
	"title": "121A.611 RECESS AND OTHER BREAKS.",
	"text": "(a) \"Recess detention\" as used in this chapter means excluding or excessively delaying a student from participating in a scheduled recess period as a consequence for student behavior. Recess detention does not include, among other things, providing alternative recess at the student's choice.\n(b) A school district or charter school is encouraged to ensure student access to structured breaks from the demands of school and to support teachers, principals, and other school staff in their efforts to use evidence-based approaches to reduce exclusionary forms of discipline.\n(c) A school district or charter school must not use recess detention unless:\n(1) a student causes or is likely to cause serious physical harm to other students or staff;\n(2) the student's parent or guardian specifically consents to the use of recess detention; or\n(3) for students receiving special education services, the student's individualized education program team has determined that withholding recess is appropriate based on the individualized needs of the student.\n(d) A school district or charter school must not withhold recess from a student based on incomplete schoolwork.\n(e) A school district or charter school must require school staff to make a reasonable attempt to notify a parent or guardian within 24 hours of using recess detention.\n(f) A school district or charter school must compile information on each recess detention at the end of each school year, including the student's age, grade, gender, race or ethnicity, and special education status. This information must be available to the public upon request. A school district or charter school is encouraged to use the data in professional development promoting the use of nonexclusionary discipline.\n(g) A school district or charter school must not withhold or excessively delay a student's participation in scheduled mealtimes. This section does not alter a district or school's existing responsibilities under section 124D.111 or other state or federal law.",
	"repealed": false
}