{
	"id": "473.845",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.845",
	"title": "473.845 METROPOLITAN LANDFILL CONTINGENCY ACTION ACCOUNT.",
	"text": "The metropolitan landfill contingency action trust account is an expendable trust account in the remediation fund. The account consists of revenue deposited in the account under section 473.843, subdivision 2, clause (2); amounts recovered under subdivision 7; and interest earned on investment of money in the account. The account must be managed to maximize long-term gain through the State Board of Investment.\nMS 1998 [Repealed, 1999 c 231 s 207]\nMoney in the account is appropriated to the agency for expenditure for any of the following:\n(1) to take reasonable and necessary actions for closure and postclosure care of a mixed municipal solid waste disposal facility in the metropolitan area for a 30-year period after closure, if the agency determines that the operator or owner will not take the necessary actions requested by the agency for closure and postclosure in the manner and within the time requested;\n(2) to take reasonable and necessary response actions and postclosure care actions at a mixed municipal solid waste disposal facility in the metropolitan area that has been closed for 30 years in compliance with the closure and postclosure rules of the agency;\n(3) to reimburse a local government unit for costs incurred over $400,000 under a work plan approved by the commissioner of the agency to remediate methane at a closed disposal facility owned by the local government unit; or\n(4) reasonable and necessary response costs at an unpermitted facility for mixed municipal solid waste disposal in the metropolitan area that was permitted by the agency for disposal of sludge ash from a wastewater treatment facility.\nIf money in the metropolitan landfill contingency action trust account is spent or transferred for purposes other than the purposes provided under this section, the commissioner must provide written notification to each county with a facility eligible for spending from the metropolitan landfill contingency action trust account within 30 days of the transfer or expenditure that includes the amount, purpose, and authority used to spend or transfer the money.\nMS 2002 [Repealed, 2003 c 128 art 2 s 56]\nThe operator or owner of a mixed municipal solid waste disposal facility or a solid waste disposal facility shall provide the necessary information to the agency required by sections 473.842 to 473.847 or by agency rules.\nThe agency or any member, employee, or agent thereof authorized by the agency, upon presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda, or data of any person who has a duty to provide information to the agency under sections 473.842 to 473.847; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized by this section including obtaining information from any person who has a duty to provide the information, conducting surveys or investigations, and taking response action.\nWhen the agency incurs expenses for response actions at a facility, the agency is subrogated to any right of action which the operator or owner of the facility may have against any other person for the recovery of the expenses. The attorney general may bring an action to recover amounts spent by the agency under this section from persons who may be liable for them. Amounts recovered, including money paid under any agreement, stipulation, or settlement must be deposited in the metropolitan landfill contingency action account in the remediation fund created under section 116.155.\nThe civil penalties of sections 115.071 and 116.072 apply to any person in violation of this section.",
	"repealed": false
}