{
	"id": "211B.076",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.076",
	"title": "211B.076 INTERFERENCE RELATED TO THE PERFORMANCE OF DUTIES BY AN ELECTION OFFICIAL; PENALTIES.",
	"text": "For the purposes of this section, \"election official\" means a member of a canvassing board, the county auditor or municipal clerk charged with duties relating to elections, a member of a ballot board, an election judge, an election judge trainee, or any other individual assigned by a state entity or county or municipal government to perform official duties related to elections.\n(a) A person may not directly or indirectly use or threaten force, coercion, violence, restraint, damage, harm, or loss, including loss of employment or economic reprisal, against another with the intent to influence an election official in the performance of a duty of election administration.\n(b) In a civil action brought to prevent and restrain violations of this subdivision or to require the payment of civil penalties, the plaintiff may show that the action or attempted action would cause a reasonable person to feel intimidated. The plaintiff does not need to show that the defendant intended to cause the victim to feel intimidated.\nA person may not intentionally hinder, interfere with, or prevent an election official's performance of a duty related to election administration.\n(a) A person may not knowingly and without consent make publicly available, including but not limited to through the Internet, personal information about an election official or an election official's family or household member if:\n(1) the public availability of information poses an imminent and serious threat to the official's safety or the safety of an official's family or household member; and\n(2) the person making the information publicly available knows or reasonably should know of any imminent and serious threat.\n(b) As used in this subdivision, \"personal information\" means a home telephone number, personal cell number, personal email address, name of the official's minor child, photographs of the official's minor child, home address, directions to a home, or photographs of a home.\nA person may not intentionally and physically obstruct an election official's access to or egress from a polling place, meeting of a canvassing board, place where ballots and elections equipment are located or stored, or any other place where the election official performs a duty related to election administration.\n(a) A person may not access without authorization, tamper with, or facilitate unauthorized access to or tampering with an electronic voting system, electromechanical voting equipment, or an election night reporting system before, during, or after any election required by law.\n(b) A person may not knowingly publish or cause to be published passwords or other confidential information relating to an electronic voting system. In addition to any other remedies and penalties provided by this section, the secretary of state, county auditor, or municipal clerk must immediately revoke any authorized access rights of a person found to be in violation of this paragraph.\nA person may not willfully tamper with or open a ballot box, including a ballot drop box, except for the purpose of conducting official duties as expressly authorized by law.\nExcept for the purpose of conducting official duties, a person may not engage in any of the following, with an intention to procure or prevent the election of any person, or to prevent any voter from voting:\n(1) mutilate, change, or erase any name, figure, or word in the statewide voter registration system;\n(2) mutilate, change, erase, or destroy any part of a registration list or polling place roster, including any name, figure, or word on the list or roster; or\n(3) remove any part of a registration list or polling place roster from the place where it has been deposited.\nA person may not knowingly access, or attempt to access, the statewide voter registration system except for the purpose of conducting official duties as expressly authorized by law.\nA person may be held vicariously liable for any damages resulting from the violation of this section and may be identified in an order restraining violations of this section if that person:\n(1) intentionally aids, advises, hires, counsels, abets, incites, compels, or coerces a person to violate any provision of this section or attempts to aid, advise, hire, counsel, abet, incite, compel, or coerce a person to violate any provision of this section; or\n(2) conspires, combines, agrees, or arranges with another to either commit a violation of this section or aid, advise, hire, counsel, abet, incite, compel, or coerce a third person to violate any provision of this section.\n(a) Except as otherwise provided, a person who violates this section is guilty of a gross misdemeanor.\n(b) The attorney general, a county attorney, or an election official may bring a civil action to prevent or restrain a violation of this section if there is a reasonable basis to believe that an individual or entity is committing or intends to commit a prohibited act.\n(c) The attorney general, or an election official injured by an act prohibited by this section, may bring a civil action pursuant to section 8.31 to recover damages, together with costs of investigation and reasonable attorney fees, and receive other equitable relief as determined by the court. An action brought by an election official under section 8.31, subdivision 3a, is in the public interest. In addition to all other damages, the court may impose a civil penalty of up to $1,000 for each violation.\n(d) Civil remedies allowable under this section are cumulative and do not restrict any other right or remedy otherwise available. An action for a penalty or remedy under this section must be brought within two years of the date the violation is alleged to have occurred. The complaint process provided in sections 211B.31 to 211B.36 does not apply to violations of this section.",
	"repealed": false
}