{
	"id": "14.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.51",
	"title": "14.51 PROCEDURAL RULES.",
	"text": "The chief administrative law judge shall adopt rules to govern: (1) the procedural conduct of all hearings, relating to both rule adoption, amendment, suspension or repeal hearings, contested case hearings, and workers' compensation hearings, and to govern the conduct of voluntary mediation sessions for rulemaking and contested cases other than those within the jurisdiction of the Bureau of Mediation Services; and (2) the review of rules adopted without a public hearing. The chief administrative law judge may adopt rules to govern the procedural conduct of other hearings conducted by the Office of Administrative Hearings. The procedural rules shall be binding upon all agencies and shall supersede any other agency procedural rules with which they may be in conflict. The procedural rules shall include in addition to normal procedural matters provisions relating to the procedure to be followed when the proposed final rule of an agency is substantially different, as determined under section 14.05, subdivision 2, from that which was proposed. The procedural rules shall establish a procedure whereby the proposed final rule of an agency shall be reviewed by the chief administrative law judge on the issue of whether the proposed final rule of the agency is substantially different than that which was proposed or failure of the agency to meet the requirements of chapter 14. The rules must also provide: (1) an expedited procedure, consistent with section 14.001, clauses (1) to (5), for the adoption of substantially different rules by agencies; and (2) a procedure to allow an agency to receive prior binding approval of its plan regarding the additional notice contemplated under sections 14.101, 14.131, 14.14, 14.22, and 14.23. Upon the chief administrative law judge's own initiative or upon written request of an interested party, the chief administrative law judge may issue a subpoena for the attendance of a witness or the production of books, papers, records or other documents as are material to any matter being heard by the Office of Administrative Hearings. The subpoenas shall be enforceable through the district court in the district in which the subpoena is issued.",
	"repealed": false
}