{
	"id": "477A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.32",
	"title": "477A.32 LOCAL GOVERNMENT CANNABIS AID.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"city\" means a statutory or home rule charter city; and\n(2) \"director\" means the director of the Office of Cannabis Management under section 342.02.\n(a) By July 15, 2024, and annually thereafter, the commissioner of management and budget must certify to the commissioner of revenue the balance of the local government cannabis aid account in the special revenue fund as of the immediately preceding June 30.\n(b) By June 1, 2024, and annually thereafter, the director must certify to the commissioner of revenue the number of cannabis businesses, as defined under section 342.01, subdivision 14, licensed under chapter 342 as of the previous January 1, disaggregated by county and city.\n(a) Beginning for aid payable in 2024, the amount available for aid to counties under this subdivision equals 50 percent of the amount certified in that year to the commissioner under subdivision 2, paragraph (a).\n(b) Twenty percent of the amount under paragraph (a) must be distributed equally among all counties.\n(c) Eighty percent of the amount under paragraph (a) must be distributed proportionally to each county according to the number of cannabis businesses located in the county as compared to the number of cannabis businesses in all counties as of the most recent certification under subdivision 2, paragraph (b).\n(a) Beginning for aid payable in 2024, the amount available for aid to cities under this subdivision equals 50 percent of the amount certified in that year to the commissioner under subdivision 2, paragraph (a).\n(b) The amount under paragraph (a) must be distributed proportionally to each city according to the number of cannabis businesses located in the city as compared to the number of cannabis businesses in all cities as of the most recent certification under subdivision 2, paragraph (b).\nThe commissioner of revenue must compute the amount of aid payable to each county and city under this section. On or before September 1 of each year, the commissioner must certify the amount to be paid to each county and city in that year. The commissioner must pay the full amount of the aid on December 26 annually.\nBeginning in fiscal year 2025 and annually thereafter, the amount in the local government cannabis aid account in the special revenue fund is annually appropriated to the commissioner of revenue to make the aid payments required under this section.",
	"repealed": false
}