{
	"id": "383E.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/383E.15",
	"title": "383E.15 SALE OF TAX-FORFEITED LAND.",
	"text": "(a) Notwithstanding section 282.018, Anoka County may sell certain tax-forfeited lands that border public waters in the cities of Andover, Coon Rapids, East Bethel, and St. Francis and the towns of Burns and Oak Grove that are described in paragraph (c).\n(b) The lands described in paragraph (c) may be sold in accordance with the remaining provisions of chapter 282. The conveyance must be in a form approved by the attorney general. For the land described in paragraph (c), clauses (3), (8), and (9), the deed issued by the commissioner of revenue must be subject to conservation easements. With regard to clause (3), the conservation easement shall apply only to the north 360 feet of the described parcel.\n(c) The lands that may be conveyed are located in Anoka County and described as follows:\n(1) That part of the Northwest Quarter of the Northwest Quarter of Section 7, Township 32, Range 24 described as follows: commencing at the intersection of the northerly extension of the westerly line of the plat of Grow Oak View Estates and the north line of said Quarter Quarter; thence South 00 degrees 26 minutes East along said westerly line and its northerly extension 1287 feet to the point of beginning; thence West parallel with said north line 338.46 feet; thence South 00 degrees 26 minutes East to the south line of said Quarter Quarter; thence easterly along said south line to the westerly line of said plat; thence northerly along said westerly line to the point of beginning. Subject to easements of record, if any.\n(2) Lot 27, Block 4, Pleasure Creek Coleman Acres Plat 1, as recorded with the Anoka County recorder, Anoka County, Minnesota.\n(3) That part of the Southwest Quarter of the Southeast Quarter of Section 8, Township 33, Range 23 lying easterly of the east line of Linges East Bethel Center, westerly of the west line of Wisens 6th Addition and northerly of the northerly right-of-way line of 214th Avenue NE. Subject to easements of record, if any.\n(4) The north 363 feet of the south 2042 feet of the east 300 feet of the west 1089 feet of the West Half of the Southwest Quarter of Section 36, Township 34, Range 23, Anoka County, Minnesota as measured along the west and south lines of said West Half of the Southwest Quarter reserving an easement for road purposes over the south 33 feet thereof. Together with an easement for road purposes for ingress and egress in common with other users of record.\n(5) Lot 7, Block 1, Creekview Estates, as recorded with the Anoka County recorder, Anoka County, Minnesota.\n(6) Lot 4, Block 3, Creekview Estates, as recorded with the Anoka County recorder, Anoka County, Minnesota.\n(7) Lot 2, Block 3, Creekview Estates, as recorded with the Anoka County recorder, Anoka County, Minnesota.\n(8) Lot 1, Block 8, Rustic Oaks Estates, as recorded with the Anoka County recorder, Anoka County, Minnesota.\n(9) The west 330 feet of the Southwest Quarter of the Southeast Quarter of Section 27, Township 33, Range 24, Anoka County, Minnesota as measured along the north line thereof and lying southerly of the following described line: Commencing at the northwest corner of said Quarter Quarter; thence on an assumed bearing of South 00 degrees 04 minutes 41 seconds East along the west line of said Quarter Quarter 742.84 feet to the actual point of beginning of the line to be described; thence South 66 degrees 37 minutes 51 seconds East to the east line of said west 330 feet of said Quarter Quarter and there terminating. Subject to easements of record, if any.\n(d) The lands to be conveyed have little or no surface water use potential and will realize a higher and better use under private ownership.",
	"repealed": false
}