{
	"id": "115B.443",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.443",
	"title": "115B.443 SETTLEMENT PROCESS.",
	"text": "Beginning not later than one year after selection of a qualified facility under section 115B.442, subdivision 1, the commissioner shall determine the current total estimated amount of environmental response costs incurred and to be incurred by the state for the qualified facility under sections 115B.39 to 115B.43, including reimbursement under section 115B.43.\nThe attorney general and the commissioner shall select one or more insurers who have been identified by the commissioner as providing potential coverage to persons identified under section 115B.442 as potential insurance policyholders for a qualified facility and shall make settlement offers with respect to one or more of the qualified facilities to the selected insurers. The attorney general and the commissioner shall base the settlement offer on their evaluation of the potential coverage available for environmental response costs under policies issued by the insurer to persons identified as potential insurance policyholders for that qualified facility and on the total estimated costs for the qualified facility, as determined under subdivision 1. The attorney general shall provide written notice of the settlement to the insurer together with a written explanation of how the offer was calculated. The attorney general may exclude from a settlement offer claims relating to policyholders who are known by the attorney general to have claims against the insurer for coverage for environmental liabilities at locations other than qualified facilities, or who are actively litigating or settling claims against their insurers relating to any qualified facility.\n(a) An insurer shall have 60 days after receipt of a settlement offer and written explanation from the state to evaluate the offer, after which the insurer, the commissioner, and the attorney general shall commence negotiations to attempt to reach a settlement with respect to the potential insurance coverage and qualified facilities subject to the settlement offer. The insurer shall have 180 days to negotiate and commit to a settlement with the state before the attorney general may commence an action under section 115B.444, unless the commissioner and the attorney general agree to extend the negotiation period upon request by the insurer made before expiration of the 180-day period. Any extension shall be limited to one additional 60-day period.\n(b) The attorney general, commissioner, and the insurer may agree to use any method of alternative dispute resolution for all or a portion of the issues in the negotiation, or may agree to negotiate all matters directly among themselves. If the parties do not agree in writing on the manner in which they will negotiate a settlement within 60 days after commencement of the negotiation period, the parties shall submit the negotiation of the settlement to mediation by an independent and neutral mediator selected by the Minnesota Office of Dispute Resolution. The attorney general shall submit on behalf of all parties a request to the Office of Dispute Resolution to appoint a mediator for the negotiations. The cost of mediation under this subdivision shall be divided equally between the state and the insurer.\n(c) Any settlement offer or any proposal, statement, or view expressed or document prepared in the course of negotiation under this section shall not be considered an admission by any party and shall not be admissible in evidence in any judicial proceeding affecting matters subject to settlement negotiation, provided that any matter otherwise admissible in a judicial proceeding is not made inadmissible by virtue of its use in negotiation under this section.\n(a) Within 30 days of notifying an insurer of a settlement offer, the attorney general shall make reasonable efforts to notify policyholders who may be affected by settlement negotiations under subdivision 3. The notification shall inform the policyholder of the commencement of negotiations between the state and the insurer and the manner in which a policyholder, with agreement of the insurer, may participate in the negotiation process. If the insurer and the state reach a settlement of the state's claims, the attorney general shall provide notice of any proposed settlement to any affected policyholder who makes a written request for such notice.\n(b) Subject to the limitations of this paragraph, an insurer to whom a settlement offer is made under subdivision 3, and any policyholder who may be affected by the negotiation, may agree to negotiate a resolution of any other outstanding environmental claims, related to the qualified facility or facilities that are subject to the state's settlement offer, within the settlement negotiation process provided under this section. Environmental claims unrelated to the qualified facility or facilities that are subject to the state settlement offer may be included within the settlement negotiation process provided under this section at the discretion of the attorney general, provided that the state will not bear any costs of mediation or alternative dispute resolution arising from the unrelated claims. The agreement of the insurer and affected policyholders to negotiate must be reached by the time that the insurer and the state commence negotiations as provided under subdivision 3. The policyholder shall not participate in the selection of the method of negotiation by the state and the insurer under subdivision 3. If the attorney general in the attorney general's discretion determines, at any time after the first 60 days of the negotiation period, that continued participation of the policyholders in the negotiation process with the state and the insurer is detrimental to the effective negotiation of a settlement between the state and the insurer, the attorney general shall so notify the insurer and the policyholders. After such notification by the attorney general, the insurer and policyholders may continue to negotiate separately from the negotiation between the insurer and the state, and may use the same mediator or other person who is facilitating negotiation between the state and the insurer. Policyholders shall be responsible for an equitable share of any costs of mediation or other alternative dispute resolution process in which they participate. Notwithstanding a determination to discontinue negotiations involving policyholders, the attorney general may engage in an additional 30 days of negotiation with the insurer and policyholders if, within the time limit for committing to a settlement provided under subdivision 3, the attorney general finds, in the discretion of the attorney general, that participation by the policyholders in a settlement between the state and the insurer would be beneficial to that settlement.\n(c) Inability of the insurer or the state to reach a settlement with policyholders under this subdivision shall not preclude a settlement between the state and the insurer.\nA settlement that includes payment of any amount under a policy subject to a retrospective premium plan shall include terms which assure that the settlement does not result in the imposition of any retrospective premium on any policyholder. In negotiating with respect to any state offer of settlement which is based in whole or in part on coverage known to the insurer to be subject to a retrospective premium plan:\n(1) the insurer shall calculate the amount of any retrospective premium that would result from payment of the state's settlement offer amount and shall disclose the calculation and the basis for it to the attorney general and the commissioner; and\n(2) the attorney general and commissioner may reduce the settlement offer amount by the amount of the retrospective premium or agree to assume the obligation to pay the retrospective premium in order to assure that no retrospective premium is imposed on the policyholder.\nAn insurer who has received a settlement offer may request the attorney general and the commissioner to address in any settlement under this section natural resource damages related to qualified facilities subject to the settlement offer. The attorney general and the commissioner, after receiving a request under this subdivision, shall determine an amount to be added to the state's settlement offer that would be sufficient to address and resolve in the settlement any state claims for natural resource damages related to the qualified facilities subject to the settlement.\nIf an insurer has entered settlements with the state under this section with respect to qualified facilities for which the aggregate amount of total estimated environmental response costs equals at least 60 percent of the total estimated environmental response costs for all qualified facilities as determined by the commissioner, the attorney general and the commissioner, upon request of the insurer, may settle with the insurer with respect to the remaining qualified facilities for the amount determined in this subdivision. The amount of the settlement for the remaining qualified facilities must be the amount that bears the same proportion to the total estimated costs for the remaining facilities that the amount payable under all of the insurer's existing settlements under this section bears to the aggregate of the total estimated costs for the qualified facilities subject to those settlements.\nExcept for any claims excluded from the settlement process under subdivision 2, a settlement under this section shall release a settling insurer, and its policyholders to the extent of their insurance coverage under policies of that insurer, from all liability for all environmental response costs incurred and to be incurred by the state related to the qualified facility or facilities that are the subject of the settlement, including natural resource damages if addressed in the settlement. Except for claims excluded under subdivision 2, the settlement shall release a settling insurer and its policyholders from liability as described in this subdivision under all insurance policies issued by the insurer, regardless of whether the policies or policyholders were identified by the commissioner or attorney general under section 115B.442.\n(a) An insurer who enters a settlement under this section is not liable for claims for contribution regarding matters addressed in the settlement. As a condition of settlement, an insurer shall waive its rights to seek contribution for any amounts paid in the settlement or to bring a subrogation action against any other person for any amounts paid in the settlement.\n(b) Settlement under this section does not discharge the liability of an insurer that has not entered a settlement under this section nor of a person to whom a nonsettling insurer has issued insurance coverage to the extent of that coverage.\n(c) No settlement offer, settlement, or negotiation under this section shall affect any joint and several liability for environmental response costs or damages related to the facility of any person whose liability has not been settled under this section.\n(d) A settlement under this section or section 115B.444, subdivision 2, paragraph (b), reduces the state's claims for environmental response costs, and natural resource damages if addressed in the settlement, related to qualified facilities subject to the settlement by the amounts paid to the state under the settlement for the facilities.\n(e) A settlement agreement approved by the attorney general and the commissioner under this section shall be presumed to be a reasonable settlement of the state's claims.\nAny amounts paid by an insurer pursuant to a judgment under section 115B.444 or settlement under this section reduce the outstanding coverage available under policies of the insurer to the extent permitted under applicable law and policy provisions.",
	"repealed": false
}