{
	"id": "352B.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.013",
	"title": "352B.013 AUTHORIZED LEAVE OF ABSENCE SERVICE CREDIT PURCHASE PROCEDURE.",
	"text": "This section specifies the procedure for purchasing service credit in the State Patrol retirement plan for authorized leaves of absence under section 352B.011, subdivision 3, unless an alternative payment procedure is specified in law for a particular form of leave or break in service.\n(a) An employee covered by the plan specified in this chapter may purchase credit for allowable service in the plan for a period specified in subdivision 1 if the employee makes a payment as specified in paragraph (b) or (c), whichever applies. The employing unit, at its option, may pay the employer portion of the amount specified in paragraph (b) on behalf of its employees.\n(b) If payment is received by the executive director within one year from the date the employee returned to work following the authorized leave, the payment amount is equal to the employee and employer contribution rates specified in section 352B.02 at the end of the leave period multiplied by the employee's hourly rate of salary on the date of return from the leave of absence and by the days and months of the leave of absence for which the employee is eligible for allowable service credit. The payment must include compound interest at the applicable monthly rate or rates specified in section 356.59, subdivision 2, from the last day of the leave period until the last day of the month in which payment is received. If payment is received by the executive director after one year from the date the employee returned to work following the authorized leave, the payment amount is the amount determined under section 356.551. Payment under this paragraph must be made before the date of termination from public employment covered under this chapter.\n(c) If the employee terminates employment covered by this chapter during the leave or following the leave rather than returning to covered employment, payment must be received by the executive director within 30 days after the termination date. The payment amount is equal to the employee and employer contribution rates specified in section 352B.02 on the day prior to the termination date, multiplied by the employee's hourly rate of salary on that date and by the days and months of the leave of absence prior to termination.",
	"repealed": false
}