{
	"id": "232.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/232.21",
	"title": "232.21 DEFINITIONS.",
	"text": "For the purpose of sections 232.20 to 232.24, the terms defined in this section have the meanings given them.\n\"Bond\" means an acceptable obligation, running to the state as obligee, for the purpose of indemnifying depositors and producers of grain against breach of contract by a public grain warehouse.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's designee.\n[Repealed, 2012 c 244 art 1 s 83]\n[Repealed, 1982 c 508 s 12]\n\"Depositor\" means a person who is the owner or legal holder of an outstanding grain warehouse receipt, grain bank receipt or open scale ticket marked for storage on which a receipt is to be issued, representing any grain stored in a public grain warehouse.\n\"Electronic document\" means a document that is generated, sent, received, or stored by electronic, optical, or similar means, including electronic data interchange, electronic mail, telegram, telex, or telecopy. \"Electronic document\" includes, but is not limited to, warehouse receipts, grain purchase contracts, and voluntary extension of credit contracts.\n\"Electronic grain warehouse receipt\" means an electronic version of a grain warehouse receipt issued or transmitted to a depositor by a grain warehouse operator under the provisions of section 232.23 in the form of an electronic document. An electronic grain warehouse receipt is a negotiable instrument except as provided in section 232.23, subdivision 11.\n\"Electronic signature\" means an electronic sound, symbol, or process attached to or logically associated with a record and executed or adopted by a person with the intent to sign the record.\n\"Grain\" means any product commonly referred to as grain, including wheat, corn, oats, barley, rye, rice, soybeans, emmer, sorghum, triticale, millet, pulses, dry edible beans, sunflower seed, rapeseed, canola, safflower, flaxseed, mustard seed, crambe, sesame seed, and other products ordinarily stored in grain warehouses.\n\"Grain bank\" means a feed-processing plant that receives and stores grain it processes and returns to the grain's owner in amounts, at intervals, and with added ingredients that are mutually agreeable to the grain's owner and the person operating the plant. Grain bank does not include a seed cleaning plant.\n\"Grain warehouse\" means an elevator, flour, cereal or feed mill, malthouse or warehouse in which grain belonging to a person other than the grain warehouse operator is received for purchase or storage.\n\"Grain warehouse receipt\" means a formal record issued to a depositor by a grain warehouse operator under the provisions of section 232.23. A grain warehouse receipt is a negotiable instrument except as provided in section 232.23, subdivision 11.\n\"Person\" means a corporation, company, joint stock company or association, partnership, firm or individual, including their agents, trustees, assignees or duly appointed receivers.\n\"Producer\" means a person who grows grain on land owned or leased by the person.\n\"Public grain warehouse operator\" means: (1) a person operating a grain warehouse in which grain belonging to persons other than the grain warehouse operator is accepted for storage or purchase; (2) a person who offers grain storage or grain warehouse facilities to the public for hire; or (3) a feed-processing plant that receives and stores grain, the equivalent of which it processes and returns to the grain's owner in amounts, at intervals, and with added ingredients that are mutually agreeable to the grain's owner and the person operating the plant.\n\"Scale ticket\" means a memorandum showing the weight and kind of grain which is issued by a grain elevator or warehouse operator to a depositor at the time the grain is delivered.\n\"Open storage\" means grain or agricultural products received by a warehouse operator from a depositor for which warehouse receipts have not been issued or a purchase made and the records documented accordingly.\n\"Temporary storage\" means grain stored in outdoor piles or suitable structures, which are not in use for the entirety of the license period.",
	"repealed": false
}