{
	"id": "518B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/518B.01",
	"title": "518B.01 DOMESTIC ABUSE ACT.",
	"text": "This section may be cited as the \"Domestic Abuse Act.\"\nAs used in this section, the following terms shall have the meanings given them:\n(a) \"Domestic abuse\" means the following, if committed against a family or household member by a family or household member:\n(1) physical harm, bodily injury, or assault;\n(2) the infliction of fear of imminent physical harm, bodily injury, or assault; or\n(3) terroristic threats, within the meaning of section 609.713, subdivision 1; criminal sexual conduct, within the meaning of section 609.342, 609.343, 609.344, 609.345, or 609.3451; sexual extortion within the meaning of section 609.3458; or interference with an emergency call within the meaning of section 609.78, subdivision 2.\n(b) \"Family or household members\" means:\n(1) spouses and former spouses;\n(2) parents and children;\n(3) persons related by blood;\n(4) persons who are presently residing together or who have resided together in the past;\n(5) persons who have a child in common regardless of whether they have been married or have lived together at any time;\n(6) a man and woman if the woman is pregnant and the man is alleged to be the father, regardless of whether they have been married or have lived together at any time; and\n(7) persons involved in a significant romantic or sexual relationship.\nIssuance of an order for protection on the ground in clause (6) does not affect a determination of paternity under sections 257.51 to 257.74. In determining whether persons are or have been involved in a significant romantic or sexual relationship under clause (7), the court shall consider the length of time of the relationship; type of relationship; frequency of interaction between the parties; and, if the relationship has terminated, length of time since the termination.\n(c) \"Qualified domestic violence-related offense\" has the meaning given in section 609.02, subdivision 16.\n(d) \"Custodian\" means any person other than the petitioner or respondent who is under a legal obligation to provide care and support for a minor child of a petitioner or who is in fact providing care and support for a minor child of a petitioner. Custodian does not include any person caring for a minor child if the petitioner's parental rights have been terminated.\nAn application for relief under this section may be filed in the court having jurisdiction over dissolution actions, in the county of residence of either party, in the county in which a pending or completed family court proceeding involving the parties or their minor children was brought, or in the county in which the alleged domestic abuse occurred. There are no residency requirements that apply to a petition for an order for protection. In a jurisdiction which utilizes referees in dissolution actions, the court or judge may refer actions under this section to a referee to take and report the evidence in the action in the same manner and subject to the same limitations provided in section 518.13. Actions under this section shall be given docket priorities by the court.\nThe filing fees for an order for protection under this section are waived for the petitioner and respondent.\n(a) Upon the petitioner's request, information maintained by the court regarding the petitioner's location or residence is not accessible to the public and may be disclosed only to court personnel or law enforcement for purposes of service of process, conducting an investigation, or enforcing an order.\n(b) Upon request of the petitioner or a custodian of the petitioner's minor children, information maintained by the court regarding the location or residence of the petitioner's minor children is not accessible to the public and may be disclosed only to court personnel or law enforcement for purposes of service of process, conducting an investigation, or enforcing an order. If any custodian is a program participant as defined in section 5B.02, paragraph (g), the protections, limitations, and requirements in chapter 5B apply and information maintained by the court regarding the location or residence of the petitioner's minor children is not accessible to the public.\nThere shall exist an action known as a petition for an order for protection in cases of domestic abuse.\n(a) A petition for relief under this section may be made by any family or household member personally or by a family or household member, a guardian as defined in section 524.1-201, clause (27), or, if the court finds that it is in the best interests of the minor, by a reputable adult age 25 or older on behalf of minor family or household members. A minor age 16 or older may make a petition on the minor's own behalf against a spouse or former spouse, or a person with whom the minor has a child in common, if the court determines that the minor has sufficient maturity and judgment and that it is in the best interests of the minor.\n(b) A petition for relief shall allege the existence of domestic abuse, and shall be accompanied by an affidavit made under oath stating the specific facts and circumstances from which relief is sought.\n(c) A petition for relief must state whether the petitioner has ever had an order for protection in effect against the respondent.\n(d) A petition for relief must state whether there is an existing order for protection in effect under this chapter governing both the parties and whether there is a pending lawsuit, complaint, petition or other action between the parties under chapter 257, 518, 518A, 518B, or 518C. The court administrator shall verify the terms of any existing order governing the parties. The court may not delay granting relief because of the existence of a pending action between the parties or the necessity of verifying the terms of an existing order. A subsequent order in a separate action under this chapter may modify only the provision of an existing order that grants relief authorized under subdivision 6, paragraph (a), clause (1). A petition for relief may be granted, regardless of whether there is a pending action between the parties.\n(e) A petition for relief must state whether the petitioner has any minor children and, if so, must provide the name of any custodian of the minor children and must identify the location or residence of the custodian. If any custodian is a program participant as defined in section 5B.02, paragraph (g), the location or residence of the custodian is the address designated by the secretary of state as the address of the program participant. A petition must not be rejected or denied for failure to identify any custodian.\n(f) The court shall provide simplified forms and clerical assistance to help with the writing and filing of a petition under this section.\n(g) The court shall advise a petitioner under paragraph (f) of the right to file a motion and affidavit and to sue in forma pauperis pursuant to section 563.01 and shall assist with the writing and filing of the motion and affidavit.\n(h) The court shall advise a petitioner under paragraph (f) of the right to serve the respondent by published notice under subdivision 5, paragraph (b), if the respondent is avoiding personal service by concealment or otherwise, and shall assist with the writing and filing of the affidavit.\n(i) The court shall advise the petitioner of the right to seek restitution under the petition for relief.\n(j) The court shall advise the petitioner of the right to request a hearing under subdivision 7, paragraph (c). If the petitioner does not request a hearing, the court shall advise the petitioner that the respondent may request a hearing and that notice of the hearing date and time will be provided to the petitioner and the custodian of any of the petitioner's minor children by mail at least five days before the hearing.\n(k) The court shall advise the petitioner of the right to request supervised parenting time, as provided in section 518.175, subdivision 1a.\n(a) Upon receipt of the petition, the court shall order a hearing which shall be held not later than 14 days from the date of the order for hearing unless an ex parte order is issued.\n(b) If an ex parte order has been issued under subdivision 7 and the petitioner seeks only the relief under subdivision 7, paragraph (a), a hearing is not required unless:\n(1) the court declines to order the requested relief; or\n(2) one of the parties requests a hearing.\n(c) If an ex parte order has been issued under subdivision 7 and the petitioner seeks relief beyond that specified in subdivision 7, paragraph (a), or if the court declines to order relief requested by the petitioner, a hearing must be held within seven days. Personal service of the ex parte order may be made upon the respondent and any custodian at any time up to 12 hours prior to the time set for the hearing, provided that the respondent at the hearing may request a continuance of up to five days if served fewer than five days prior to the hearing which continuance shall be granted unless there are compelling reasons not to.\n(d) If an ex parte order has been issued only granting relief under subdivision 7, paragraph (a), and the respondent requests a hearing, the hearing shall be held within ten days of the court's receipt of the respondent's request. Service of the notice of hearing must be made upon the petitioner and any custodian not less than five days prior to the hearing. The court shall serve the notice of hearing upon the petitioner and any custodian by mail in the manner provided in the Rules of Civil Procedure for pleadings subsequent to a complaint and motions and shall also mail notice of the date and time of the hearing to the respondent. In the event that service cannot be completed in time to give the respondent, petitioner, or any custodian the minimum notice required under this subdivision, the court may set a new hearing date no more than five days later.\n(e) If for good cause shown either party is unable to proceed at the initial hearing and requests a continuance and the court finds that a continuance is appropriate, the hearing may be continued. Unless otherwise agreed by the parties and approved by the court, the continuance shall be for no more than five days. If the court grants the requested continuance, the court shall also issue a written order continuing all provisions of the ex parte order pending the issuance of an order after the hearing.\n(f) Notwithstanding the preceding provisions of this subdivision, service on the respondent may be made by one week published notice, as provided under section 645.11, provided the petitioner files with the court an affidavit stating that an attempt at personal service made by a sheriff or other law enforcement or corrections officer was unsuccessful because the respondent is avoiding service by concealment or otherwise, and that a copy of the petition and notice of hearing has been mailed to the respondent at the respondent's residence or that the residence is not known to the petitioner. Service under this paragraph is complete seven days after publication. The court shall set a new hearing date if necessary to allow the respondent the five-day minimum notice required under paragraph (d).\n(a) Upon notice and hearing, the court may provide relief as follows:\n(1) restrain the abusing party from committing acts of domestic abuse;\n(2) exclude the abusing party from the dwelling which the parties share or from the residence of the petitioner;\n(3) exclude the abusing party from a reasonable area surrounding the dwelling or residence, which area shall be described specifically in the order;\n(4) award temporary custody or establish temporary parenting time with regard to minor children of the parties on a basis which gives primary consideration to the safety of the victim and the children. In addition to the primary safety considerations, the court may consider particular best interest factors that are found to be relevant to the temporary custody and parenting time award. Findings under section 257.025, 518.17, or 518.175 are not required with respect to the particular best interest factors not considered by the court. If the court finds that the safety of the victim or the children will be jeopardized by unsupervised or unrestricted parenting time, the court shall condition or restrict parenting time as to time, place, duration, or supervision, or deny parenting time entirely, as needed to guard the safety of the victim and the children. The court's decision on custody and parenting time shall in no way delay the issuance of an order for protection granting other relief provided for in this section. The court must not enter a parenting plan under section 518.1705 as part of an action for an order for protection;\n(5) on the same basis as is provided in chapter 518 or 518A, establish temporary support for minor children or a spouse, and order the withholding of support from the income of the person obligated to pay the support according to chapter 518A;\n(6) provide upon request of the petitioner counseling or other social services for the parties, if married, or if there are minor children;\n(7) order the abusing party to participate in treatment or counseling services, including requiring the abusing party to successfully complete a domestic abuse counseling program or educational program under section 518B.02;\n(8) award temporary use and possession of property and restrain one or both parties from transferring, encumbering, concealing, or disposing of property except in the usual course of business or for the necessities of life, and to account to the court for all such transfers, encumbrances, dispositions, and expenditures made after the order is served or communicated to the party restrained in open court;\n(9) exclude the abusing party from the place of employment of the petitioner, or otherwise limit access to the petitioner by the abusing party at the petitioner's place of employment;\n(10) order the abusing party to have no contact with the petitioner whether in person, by telephone, mail, or electronic mail or messaging, through a third party, or by any other means;\n(11) order the abusing party to pay restitution to the petitioner;\n(12) order the continuance of all currently available insurance coverage without change in coverage or beneficiary designation;\n(13) order, in its discretion, other relief as it deems necessary for the protection of a family or household member, including orders or directives to the sheriff or other law enforcement or corrections officer as provided by this section;\n(14) direct the care, possession, or control of a pet or companion animal owned, possessed, or kept by the petitioner or respondent or a child of the petitioner or respondent; and\n(15) direct the respondent to refrain from physically abusing or injuring any pet or companion animal, without legal justification, known to be owned, possessed, kept, or held by either party or a minor child residing in the residence or household of either party as an indirect means of intentionally threatening the safety of such person.\n(b) Any relief granted by the order for protection shall be for a period not to exceed two years, except when the court determines a longer period is appropriate. When a referee presides at the hearing on the petition, the order granting relief becomes effective upon the referee's signature.\n(c) An order granting the relief authorized in paragraph (a), clause (1), may not be vacated or modified in a proceeding for dissolution of marriage or legal separation, except that the court may hear a motion for modification of an order for protection concurrently with a proceeding for dissolution of marriage upon notice of motion and motion. The notice required by court rule shall not be waived. If the proceedings are consolidated and the motion to modify is granted, a separate order for modification of an order for protection shall be issued.\n(d) An order granting the relief authorized in paragraph (a), clause (2) or (3), is not voided by the admittance of the abusing party into the dwelling from which the abusing party is excluded.\n(e) If a proceeding for dissolution of marriage or legal separation is pending between the parties, the court shall provide a copy of the order for protection to the court with jurisdiction over the dissolution or separation proceeding for inclusion in its file.\n(f) An order for restitution issued under this subdivision is enforceable as civil judgment.\n(g) An order granting relief shall prohibit the abusing party from possessing firearms for the length the order is in effect if the order (1) restrains the abusing party from harassing, stalking, or threatening the petitioner or restrains the abusing party from engaging in other conduct that would place the petitioner in reasonable fear of bodily injury, and (2) includes a finding that the abusing party represents a credible threat to the physical safety of the petitioner or prohibits the abusing party from using, attempting to use, or threatening to use physical force against the petitioner. The order shall inform the abusing party of that party's prohibited status. Except as provided in paragraph (i), the court shall order the abusing party to transfer any firearms that the person possesses, within three business days, to a federally licensed firearms dealer, a law enforcement agency, or a third party who may lawfully receive them. The transfer may be permanent or temporary. A temporary firearm transfer only entitles the receiving party to possess the firearm. A temporary transfer does not transfer ownership or title. An abusing party may not transfer firearms to a third party who resides with the abusing party. If an abusing party makes a temporary transfer, a federally licensed firearms dealer or law enforcement agency may charge the abusing party a reasonable fee to store the person's firearms and may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified via certified mail prior to disposal of abandoned firearms. For temporary firearms transfers under this paragraph, a law enforcement agency, federally licensed firearms dealer, or third party shall exercise due care to preserve the quality and function of the transferred firearms and shall return the transferred firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The return of temporarily transferred firearms to an abusing party shall comply with state and federal law. If an abusing party permanently transfers the abusing party's firearms to a law enforcement agency, the agency is not required to compensate the abusing party and may charge the abusing party a reasonable processing fee. A law enforcement agency is not required to accept an abusing party's firearm under this paragraph.\n(h) An abusing party who is ordered to transfer firearms under paragraph (g) must file proof of transfer as provided for in this paragraph. If the transfer is made to a third party, the third party must sign an affidavit under oath before a notary public either acknowledging that the abusing party permanently transferred the abusing party's firearms to the third party or agreeing to temporarily store the abusing party's firearms until such time as the abusing party is legally permitted to possess firearms. The affidavit shall indicate the serial number, make, and model of all firearms transferred by the abusing party to the third party. The third party shall acknowledge in the affidavit that the third party may be held criminally and civilly responsible under section 624.7144 if the abusing party gains access to a transferred firearm while the firearm is in the custody of the third party. If the transfer is to a law enforcement agency or federally licensed firearms dealer, the law enforcement agency or federally licensed firearms dealer shall provide proof of transfer to the abusing party. The proof of transfer must specify whether the firearms were permanently or temporarily transferred and include the name of the abusing party, date of transfer, and the serial number, make, and model of all transferred firearms. The abusing party shall provide the court with a signed and notarized affidavit or proof of transfer as described in this section within two business days of the firearms transfer. The court shall seal affidavits and proofs of transfer filed pursuant to this paragraph.\n(i) When a court issues an order containing a firearms restriction provided for in paragraph (g), the court shall determine by a preponderance of evidence if an abusing party poses an imminent risk of causing another person substantial bodily harm. Upon a finding of imminent risk, the court shall order that the local law enforcement agency take immediate possession of all firearms in the abusing party's possession. The local law enforcement agency shall exercise due care to preserve the quality and function of the abusing party's firearms and shall return the firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The local law enforcement agency shall, upon written notice from the abusing party, transfer the firearms to a federally licensed firearms dealer or a third party who may lawfully receive them. Before a local law enforcement agency transfers a firearm under this paragraph, the agency shall require the third party or federally licensed firearms dealer receiving the firearm to submit an affidavit or proof of transfer that complies with the requirements for affidavits or proofs of transfer established in paragraph (h). The agency shall file all affidavits or proofs of transfer received with the court within two business days of the transfer. The court shall seal all affidavits or proofs of transfer filed pursuant to this paragraph. A federally licensed firearms dealer or third party who accepts a firearm transfer pursuant to this paragraph shall comply with paragraphs (g) and (h) as if accepting transfer from the abusing party. If the law enforcement agency does not receive written notice from the abusing party within three business days, the agency may charge a reasonable fee to store the abusing party's firearms. A law enforcement agency may establish policies for disposal of abandoned firearms, provided such policies require that the abusing party be notified via certified mail prior to disposal of abandoned firearms.\n(a) Upon application, notice to all parties, notice to any custodian, and hearing, the court may extend the relief granted in an existing order for protection or, if a petitioner's order for protection is no longer in effect when an application for subsequent relief is made, grant a new order. If the petitioner seeks only the relief under subdivision 7, paragraph (a), a hearing is not required unless the court declines to order the requested relief or the respondent requests a hearing. If a hearing is required, subdivisions 5 and 7 apply to service of the application, notice to the parties and any custodian, and time for the hearing.\n(b) The court may extend the terms of an existing order or, if an order is no longer in effect, grant a new order upon a showing that:\n(1) the respondent has violated a prior or existing order for protection;\n(2) the petitioner is reasonably in fear of physical harm from the respondent;\n(3) the respondent has engaged in the act of harassment within the meaning of section 609.749, subdivision 2; or\n(4) the respondent is incarcerated and about to be released, or has recently been released from incarceration.\nA petitioner does not need to show that physical harm is imminent to obtain an extension or a subsequent order under this subdivision.\n(c) Relief granted by the order for protection may be for a period of up to 50 years, if the court finds:\n(1) the respondent has violated a prior or existing order for protection on two or more occasions; or\n(2) the petitioner has had two or more orders for protection in effect against the same respondent.\nAn order issued under this paragraph may restrain the abusing party from committing acts of domestic abuse; or prohibit the abusing party from having any contact with the petitioner, whether in person, by telephone, mail or electronic mail or messaging, through electronic devices, through a third party, or by any other means.\n(a) Where an application under this section alleges an immediate and present danger of domestic abuse, the court may grant an ex parte order for protection and granting relief as the court deems proper, including an order:\n(1) restraining the abusing party from committing acts of domestic abuse;\n(2) excluding any party from the dwelling they share or from the residence of the other, including a reasonable area surrounding the dwelling or residence, which area shall be described specifically in the order, except by further order of the court;\n(3) excluding the abusing party from the place of employment of the petitioner or otherwise limiting access to the petitioner by the abusing party at the petitioner's place of employment;\n(4) ordering the abusing party to have no contact with the petitioner whether in person, by telephone, mail, email, through electronic devices, or through a third party;\n(5) continuing all currently available insurance coverage without change in coverage or beneficiary designation;\n(6) directing the care, possession, or control of a pet or companion animal owned, possessed, or kept by a party or a child of a party; and\n(7) directing the respondent to refrain from physically abusing or injuring any pet or companion animal, without legal justification, known to be owned, possessed, kept, or held by either party or a minor child residing in the residence or household of either party as an indirect means of intentionally threatening the safety of such person.\n(b) A finding by the court that there is a basis for issuing an ex parte order for protection constitutes a finding that sufficient reasons exist not to require notice under applicable court rules governing applications for ex parte relief.\n(c) Subject to paragraph (d), an ex parte order for protection shall be effective for a fixed period set by the court, as provided in subdivision 6, paragraph (b), or until modified or vacated by the court pursuant to a hearing. When signed by a referee, the ex parte order becomes effective upon the referee's signature. Upon request, a hearing, as provided by this section, shall be set. Except as provided in paragraph (d), the respondent shall be personally served forthwith a copy of the ex parte order along with a copy of the petition and, if requested by the petitioner, notice of the date set for the hearing. Any custodian must be served with a copy of the ex parte order. Service on a custodian may be made by personal service or by certified mail. If the petitioner does not request a hearing, an order served on a respondent under this subdivision must include a notice advising the respondent of the right to request a hearing, must be accompanied by a form that can be used by the respondent to request a hearing and must include a conspicuous notice that a hearing will not be held unless requested by the respondent within five days of service of the order.\n(d) Service of the ex parte order on the respondent may be made by published notice, as provided under subdivision 5, provided that the petitioner files the affidavit required under that subdivision. If personal service is not made or the affidavit is not filed within 14 days of issuance of the ex parte order, the order expires. If the petitioner does not request a hearing, the petition mailed to the respondent's residence, if known, must be accompanied by the form for requesting a hearing and notice described in paragraph (c). Unless personal service is completed, if service by published notice is not completed within 28 days of issuance of the ex parte order, the order expires. Notice that an order has expired under this paragraph must be sent to any custodian.\n(e) If the petitioner seeks relief under subdivision 6 other than the relief described in paragraph (a), the petitioner must request a hearing to obtain the additional relief.\n(f) Nothing in this subdivision affects the right of a party to seek modification of an order under subdivision 11.\n(a) The petition and any order issued under this section other than orders for dismissal shall be served on the respondent personally, or if the respondent appears remotely for a hearing and is notified at the hearing by the judicial officer that an order for protection will be issued, the order may be served on the respondent electronically or by first class mail, as ordered by the court. Orders for dismissal may be served on the respondent personally or by certified mail. In lieu of personal service of an order for protection, a law enforcement officer may serve a respondent with a short-form notification as provided in subdivision 8a. The petition and any order issued under this section may be served on any custodian personally or by certified mail.\n(b) When service is made out of this state and in the United States, it may be proved by the affidavit of the person making the service. When service is made outside the United States, it may be proved by the affidavit of the person making the service, taken before and certified by any United States minister, charge d'affaires, commissioner, consul, or commercial agent, or other consular or diplomatic officer of the United States appointed to reside in the other country, including all deputies or other representatives of the officer authorized to perform their duties; or before an office authorized to administer an oath with the certificate of an officer of a court of record of the country in which the affidavit is taken as to the identity and authority of the officer taking the affidavit.\n(c) If personal service cannot be made on a respondent, the court may order service of the petition and any order issued under this section by alternate means, or by publication, which publication must be made as in other actions. The application for alternate service must include the last known location of the respondent; the petitioner's most recent contacts with the respondent; the last known location of the respondent's employment; the names and locations of the respondent's parents, siblings, children, and other close relatives; the names and locations of other persons who are likely to know the respondent's whereabouts; and a description of efforts to locate those persons.\nThe court shall consider the length of time the respondent's location has been unknown, the likelihood that the respondent's location will become known, the nature of the relief sought, and the nature of efforts made to locate the respondent. The court shall order service by first class mail, forwarding address requested, to any addresses where there is a reasonable possibility that mail or information will be forwarded or communicated to the respondent.\nThe court may also order publication, within or without the state, but only if it might reasonably succeed in notifying the respondent of the proceeding. Service shall be deemed complete 14 days after mailing or 14 days after court-ordered publication.\n(d) A petition and any order issued under this section, including the short-form notification, must include a notice to the respondent that if an order for protection is issued to protect the petitioner or a child of the parties, upon request of the petitioner in any parenting time proceeding, the court shall consider the order for protection in making a decision regarding parenting time.\n(a) In lieu of personal service of an order for protection under subdivision 8, a law enforcement officer may serve a respondent with a short-form notification. The short-form notification must include the following clauses: the respondent's name; the respondent's date of birth, if known; the petitioner's name; the names of other protected parties; the date and county in which the ex parte order for protection or order for protection was filed; the court file number; the hearing date and time, if known; the conditions that apply to the respondent, either in checklist form or handwritten; and the name of the judge who signed the order.\nThe short-form notification must be in bold print in the following form:\nThe order for protection is now enforceable. You must report to your nearest sheriff office or county court to obtain a copy of the order for protection. You are subject to arrest and may be charged with a misdemeanor, gross misdemeanor, or felony if you violate any of the terms of the order for protection or this short-form notification.\n(b) Upon verification of the identity of the respondent and the existence of an unserved order for protection against the respondent, a law enforcement officer may detain the respondent for a reasonable time necessary to complete and serve the short-form notification.\n(c) When service is made by short-form notification, it may be proved by the affidavit of the law enforcement officer making the service.\n(d) For service under this section only, service upon an individual may occur at any time, including Sundays, and legal holidays.\n(e) The superintendent of the Bureau of Criminal Apprehension shall provide the short form to law enforcement agencies.\n(f) This section does not apply to service of an order for protection on any custodian.\nWhen an order is issued under this section upon request of the petitioner, the court shall order the sheriff to accompany the petitioner and assist in placing the petitioner in possession of the dwelling or residence.\n(a) Where personal service is required under this section, service must comply with subdivision 8 and rule 4.03 of the Rules of Civil Procedure.\n(b) Upon request of the petitioner or order of the court, the sheriff of any county in this state in which a respondent resides or is present must execute or serve any petition, ex parte order, notice of hearing, order for protection, and any other order of a court on the respondent. If the application for relief is brought in a county in which the respondent is not present, the sheriff of the county where the application for relief was brought shall forward the pleadings necessary for service upon the respondent to the sheriff of the county in which the respondent is present. This transmittal must be expedited to allow for timely service.\n(c) Peace officers licensed by the state of Minnesota and corrections officers, including, but not limited to, probation officers, court services officers, parole officers, and employees of jails or correctional facilities, may serve an order for protection on a respondent or any custodian and must, to the extent possible, provide any sheriff, law enforcement officer, or other peace officer attempting to effectuate service with relevant information regarding where a respondent may be found, such as the respondent's residence, the respondent's place of employment or schooling, or other locations frequented by the respondent.\n(d) The court administrator, the sheriff of any county in this state, and any other law enforcement officer, peace officer, or corrections officer shall perform the duties relating to service of process without charge to the petitioner. The court shall direct payment of the reasonable costs of service of process if served by a private process server when the sheriff or other law enforcement officer, peace officer, or corrections officer is unavailable or if service is made by publication, without requiring the petitioner to make application under section 563.01.\n(e) A sheriff, law enforcement officer, or any other peace officer must make reasonable efforts to locate a respondent to effectuate service. Reasonable efforts may include:\n(1) a search of any information that is publicly available;\n(2) a search of any government data in a database to which the sheriff, law enforcement officer, or other peace officer has access, provided the data is classified as public data on individuals as defined in section 13.02, subdivision 15, or is otherwise available to criminal justice agencies, as defined in section 13.02, subdivision 3a; and\n(3) communication with any court administrator, the sheriff of any county in this state, and any other law enforcement officer, peace officer, or corrections officer.\n(f) A sheriff, law enforcement officer, or any other peace officer who serves a respondent who the sheriff or officer knows is on supervised probation or supervised release with an ex parte order, order for protection, or short-form notification must provide a copy of the served order or notification to the respondent's probation officer, supervised release or conditional release agent, or parole officer.\n(a) A person's right to apply for relief shall not be affected by the person's leaving the residence or household to avoid abuse.\n(b) The court shall not require security or bond of any party unless it deems necessary in exceptional cases.\n(a) Upon application, notice to all parties, notice to any custodian, and hearing, the court may modify the terms of an existing order for protection.\n(b) If the court orders relief under subdivision 6a, paragraph (c), the respondent named in the order for protection may request to have the order vacated or modified if the order has been in effect for at least five years and the respondent has not violated the order during that time. Application for relief under this subdivision must be made in the county in which the order for protection was issued. Upon receipt of the request, the court shall set a hearing date. Personal service must be made upon the petitioner named in the order for protection not less than 30 days before the date of the hearing. Notice of the request and hearing may be made on any custodian personally or by certified mail. At the hearing, the respondent named in the order for protection has the burden of proving by a preponderance of the evidence that there has been a material change in circumstances and that the reasons upon which the court relied in granting or extending the order for protection no longer apply and are unlikely to occur. If the court finds that the respondent named in the order for protection has met the burden of proof, the court may vacate or modify the order. If the court finds that the respondent named in the order for protection has not met the burden of proof, the court shall deny the request and no request may be made to vacate or modify the order for protection until five years have elapsed from the date of denial. An order vacated or modified under this paragraph must be personally served on the petitioner named in the order for protection and may be served on any custodian personally or by certified mail.\n(a) A custodian who is a program participant as defined in section 5B.02, paragraph (g), may direct the court to use the address designated by the secretary of state as the address of the program participant. Section 5B.03, subdivision 1, clause (3), applies to service of any notice, order, or other document required to be served under this section. The protections, limitations, and requirements in chapter 5B apply to any information regarding a custodian who is a program participant.\n(b) Failure to serve a custodian with a petition, order for protection, dismissal, or any other order must not prevent any order from taking effect or otherwise invalidate any order issued pursuant to this section. In the event that service of a notice of a hearing is not completed on any custodian at least 24 hours prior to the time set for the hearing, the court may set a new hearing date no more than five days later.\nNothing in this section shall affect the title to real estate.\n(a) An order for protection and any continuance of an order for protection granted pursuant to this section shall be forwarded by the court administrator within 24 hours to the local law enforcement agency with jurisdiction over the residence of the applicant.\nEach appropriate law enforcement agency shall make available to other law enforcement officers through a system for verification, information as to the existence and status of any order for protection issued pursuant to this section.\n(b) If the applicant notifies the court administrator of a change in the applicant's residence so that a different local law enforcement agency has jurisdiction over the residence, the order for protection and any continuance of an order for protection must be forwarded by the court administrator to the new law enforcement agency within 24 hours of the notice. If the applicant notifies the new law enforcement agency that an order for protection has been issued under this section and the applicant has established a new residence within that agency's jurisdiction, within 24 hours the local law enforcement agency shall request a copy of the order for protection from the court administrator in the county that issued the order.\n(c) When an order for protection is granted, the applicant for an order for protection must be told by the court that:\n(1) notification of a change in residence should be given immediately to the court administrator and to the local law enforcement agency having jurisdiction over the new residence of the applicant;\n(2) the reason for notification of a change in residence is to forward an order for protection to the proper law enforcement agency; and\n(3) the order for protection must be forwarded to the law enforcement agency having jurisdiction over the new residence within 24 hours of notification of a change in residence, whether notification is given to the court administrator or to the local law enforcement agency having jurisdiction over the applicant's new residence.\nAn order for protection is enforceable even if the applicant does not notify the court administrator or the appropriate law enforcement agency of a change in residence.\n(a) A person who violates an order for protection issued by a judge or referee is subject to the penalties provided in paragraphs (b) to (d).\n(b) Except as otherwise provided in paragraphs (c) and (d), whenever an order for protection is granted by a judge or referee or pursuant to a similar law of another state, the United States, the District of Columbia, tribal lands, United States territories, Canada, or a Canadian province, and the respondent or person to be restrained knows of the existence of the order, violation of the order for protection is a misdemeanor. Upon a misdemeanor conviction under this paragraph, the defendant must be sentenced to a minimum of three days imprisonment and must be ordered to participate in counseling or other appropriate programs selected by the court. If the court stays imposition or execution of the jail sentence and the defendant refuses or fails to comply with the court's treatment order, the court must impose and execute the stayed jail sentence. A violation of an order for protection shall also constitute contempt of court and be subject to the penalties provided in chapter 588.\n(c) A person is guilty of a gross misdemeanor who violates this subdivision within ten years of a previous qualified domestic violence-related offense conviction or adjudication of delinquency. Upon a gross misdemeanor conviction under this paragraph, the defendant must be sentenced to a minimum of ten days imprisonment and must be ordered to participate in counseling or other appropriate programs selected by the court. Notwithstanding section 609.135, the court must impose and execute the minimum sentence provided in this paragraph for gross misdemeanor convictions.\n(d) A person is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the person violates this subdivision:\n(1) within ten years of the first of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency; or\n(2) while possessing a dangerous weapon, as defined in section 609.02, subdivision 6.\nUpon a felony conviction under this paragraph in which the court stays imposition or execution of sentence, the court shall impose at least a 30-day period of incarceration as a condition of probation. The court also shall order that the defendant participate in counseling or other appropriate programs selected by the court. Notwithstanding section 609.135, the court must impose and execute the minimum sentence provided in this paragraph for felony convictions.\n(e) A peace officer shall arrest without a warrant and take into custody a person whom the peace officer has probable cause to believe has violated an order granted pursuant to this section or a similar law of another state, the United States, the District of Columbia, tribal lands, United States territories, Canada, or a Canadian province restraining the person or excluding the person from the residence or the petitioner's place of employment, even if the violation of the order did not take place in the presence of the peace officer, if the existence of the order can be verified by the officer. The probable cause required under this paragraph includes probable cause that the person knows of the existence of the order. If the order has not been served, the officer shall immediately serve the order whenever reasonably safe and possible to do so. An order for purposes of this subdivision, includes the short-form order described in subdivision 8a. When the order is first served upon the person at a location at which, under the terms of the order, the person's presence constitutes a violation, the person shall not be arrested for violation of the order without first being given a reasonable opportunity to leave the location in the presence of the peace officer. A person arrested under this paragraph shall be held in custody for at least 36 hours, excluding the day of arrest, Sundays, and holidays, unless the person is released earlier by a judge or judicial officer. A peace officer acting in good faith and exercising due care in making an arrest pursuant to this paragraph is immune from civil liability that might result from the officer's actions.\n(f) If the court finds that the respondent has violated an order for protection and that there is reason to believe that the respondent will commit a further violation of the provisions of the order restraining the respondent from committing acts of domestic abuse or excluding the respondent from the petitioner's residence, the court may require the respondent to acknowledge an obligation to comply with the order on the record. The court may require a bond sufficient to deter the respondent from committing further violations of the order for protection, considering the financial resources of the respondent, and not to exceed $10,000. If the respondent refuses to comply with an order to acknowledge the obligation or post a bond under this paragraph, the court shall commit the respondent to the county jail during the term of the order for protection or until the respondent complies with the order under this paragraph. The warrant must state the cause of commitment, with the sum and time for which any bond is required. If an order is issued under this paragraph, the court may order the costs of the contempt action, or any part of them, to be paid by the respondent. An order under this paragraph is appealable.\n(g) Upon the filing of an affidavit by the petitioner, any peace officer, or an interested party designated by the court, alleging that the respondent has violated any order for protection granted pursuant to this section or a similar law of another state, the United States, the District of Columbia, tribal lands, United States territories, Canada, or a Canadian province, the court may issue an order to the respondent, requiring the respondent to appear and show cause within 14 days why the respondent should not be found in contempt of court and punished therefor. The hearing may be held by the court in any county in which the petitioner or respondent temporarily or permanently resides at the time of the alleged violation, or in the county in which the alleged violation occurred, if the petitioner and respondent do not reside in this state. The court also shall refer the violation of the order for protection to the appropriate prosecuting authority for possible prosecution under paragraph (b), (c), or (d).\n(h) If it is alleged that the respondent has violated an order for protection issued under subdivision 6 or a similar law of another state, the United States, the District of Columbia, tribal lands, United States territories, Canada, or a Canadian province, and the court finds that the order has expired between the time of the alleged violation and the court's hearing on the violation, the court may grant a new order for protection under subdivision 6 based solely on the respondent's alleged violation of the prior order, to be effective until the hearing on the alleged violation of the prior order. If the court finds that the respondent has violated the prior order, the relief granted in the new order for protection shall be extended for a fixed period, not to exceed one year, except when the court determines a longer fixed period is appropriate.\n(i) The admittance into petitioner's dwelling of an abusing party excluded from the dwelling under an order for protection is not a violation by the petitioner of the order for protection.\nA peace officer is not liable under section 609.43, clause (1), for a failure to perform a duty required by paragraph (e).\n(j) When a person is convicted under paragraph (b) or (c) of violating an order for protection and the court determines that the person used a firearm in any way during commission of the violation, the court may order that the person is prohibited from possessing any type of firearm for any period longer than three years or for the remainder of the person's life. A person who violates this paragraph is guilty of a gross misdemeanor. At the time of the conviction, the court shall inform the defendant whether and for how long the defendant is prohibited from possessing a firearm and that it is a gross misdemeanor to violate this paragraph. The failure of the court to provide this information to a defendant does not affect the applicability of the firearm possession prohibition or the gross misdemeanor penalty to that defendant.\n(k) Except as otherwise provided in paragraph (j), when a person is convicted under paragraph (b) or (c) of violating an order for protection, the court shall inform the defendant that the defendant is prohibited from possessing a pistol for three years from the date of conviction and that it is a gross misdemeanor offense to violate this prohibition. The failure of the court to provide this information to a defendant does not affect the applicability of the pistol possession prohibition or the gross misdemeanor penalty to that defendant.\n(l) Except as otherwise provided in paragraph (j), a person is not entitled to possess a pistol if the person has been convicted under paragraph (b) or (c) after August 1, 1996, of violating an order for protection, unless three years have elapsed from the date of conviction and, during that time, the person has not been convicted of any other violation of this section. Property rights may not be abated but access may be restricted by the courts. A person who possesses a pistol in violation of this paragraph is guilty of a gross misdemeanor.\n(m) If the court determines that a person convicted under paragraph (b) or (c) of violating an order for protection owns or possesses a firearm and used it in any way during the commission of the violation, it shall order that the firearm be summarily forfeited under section 609.5316, subdivision 3.\nA person may be prosecuted under subdivision 14 at the place where any call is made or received or, in the case of wireless or electronic communication or any communication made through any available technologies, where the actor or victim resides, or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established under chapter 5B.\nAny testimony offered by a respondent in a hearing pursuant to this section is inadmissible in a criminal proceeding.\nAny proceeding under this section shall be in addition to other civil or criminal remedies.\nIn a subsequent custody proceeding the court must consider a finding in a proceeding under this chapter or under a similar law of another state that domestic abuse has occurred between the parties.\n(a) Each order for protection granted under this chapter must contain a conspicuous notice to the respondent or person to be restrained that:\n(1) violation of an order for protection is either (i) a misdemeanor punishable by imprisonment for up to 90 days or a fine of up to $1,000, or both, (ii) a gross misdemeanor punishable by imprisonment of up to 364 days or a fine of up to $3,000, or both, or (iii) a felony punishable by imprisonment of up to five years or a fine of up to $10,000, or both;\n(2) the respondent is forbidden to enter or stay at the petitioner's residence, even if invited to do so by the petitioner or any other person; in no event is the order for protection voided;\n(3) a peace officer must arrest without warrant and take into custody a person whom the peace officer has probable cause to believe has violated an order for protection restraining the person or excluding the person from a residence; and\n(4) pursuant to the Violence Against Women Act of 1994, United States Code, title 18, section 2265, the order is enforceable in all 50 states, the District of Columbia, tribal lands, and United States territories, that violation of the order may also subject the respondent to federal charges and punishment under United States Code, title 18, sections 2261 and 2262, and that if a final order is entered against the respondent after the hearing, the respondent may be prohibited from possessing, transporting, or accepting a firearm under the 1994 amendment to the Gun Control Act, United States Code, title 18, section 922(g)(8).\n(b) If the court grants relief under subdivision 6a, paragraph (c), the order for protection must also contain a conspicuous notice to the respondent or person to be restrained that the respondent must wait five years to seek a modification of the order.\nProceedings under this section must be recorded.\n(a) As used in this subdivision, \"foreign protective order\" means an order for protection entered by a court of another state; an order by an Indian tribe or United States territory that would be a protective order entered under this chapter; a Canadian order for protection as defined in section 518F.02; a temporary or permanent order or protective order to exclude a respondent from a dwelling; or an order that establishes conditions of release or is a protective order or sentencing order in a criminal prosecution arising from a domestic abuse assault if it had been entered in Minnesota.\n(b) A person for whom a foreign protection order has been issued or the issuing court or tribunal may provide a certified or authenticated copy of a foreign protective order to the court administrator in any county that would have venue if the original action was being commenced in this state or in which the person in whose favor the order was entered may be present, for filing and entering of the same into the state order for protection database.\n(c) The court administrator shall file and enter foreign protective orders that are not certified or authenticated, if supported by an affidavit of a person with personal knowledge, subject to the penalties for perjury. The person protected by the order may provide this affidavit.\n(d) The court administrator shall provide copies of the order as required by this section.\n(e) A valid foreign protective order has the same effect and shall be enforced in the same manner as an order for protection issued in this state whether or not filed with a court administrator or otherwise entered in the state order for protection database.\n(f) A foreign protective order is presumed valid if it meets all of the following:\n(1) the order states the name of the protected individual and the individual against whom enforcement is sought;\n(2) the order has not expired;\n(3) the order was issued by a court or tribunal that had jurisdiction over the parties and subject matter under the law of the foreign jurisdiction; and\n(4) the order was issued in accordance with the respondent's due process rights, either after the respondent was provided with reasonable notice and an opportunity to be heard before the court or tribunal that issued the order, or in the case of an ex parte order, the respondent was granted notice and an opportunity to be heard within a reasonable time after the order was issued.\n(g) Proof that a foreign protective order failed to meet all of the factors listed in paragraph (f) is an affirmative defense in any action seeking enforcement of the order.\n(h) A peace officer shall treat a foreign protective order as a valid legal document and shall make an arrest for a violation of the foreign protective order in the same manner that a peace officer would make an arrest for a violation of a protective order issued within this state.\n(i) The fact that a foreign protective order has not been filed with the court administrator or otherwise entered into the state order for protection database shall not be grounds to refuse to enforce the terms of the order unless it is apparent to the officer that the order is invalid on its face.\n(j) A peace officer acting reasonably and in good faith in connection with the enforcement of a foreign protective order is immune from civil and criminal liability in any action arising in connection with the enforcement.\n(k) Filing and service costs in connection with foreign protective orders are waived.\nAn order for protection granted under this section applies throughout this state.\nThe state court administrator, in consultation with city and county attorneys and legal advocates who work with victims, shall update the uniform order for protection form that facilitates the consistent enforcement of orders for protection throughout the state.\n[Repealed, 2010 c 299 s 15]\n(a) An employer shall not discharge, discipline, threaten, otherwise discriminate against, or penalize an employee regarding the employee's compensation, terms, conditions, location, or privileges of employment, because the employee took reasonable time off from work to obtain or attempt to obtain relief under this chapter. Except in cases of imminent danger to the health or safety of the employee or the employee's child, or unless impracticable, an employee who is absent from the workplace shall give 48 hours' advance notice to the employer. Upon request of the employer, the employee shall provide verification that supports the employee's reason for being absent from the workplace. All information related to the employee's leave pursuant to this section shall be kept confidential by the employer.\n(b) An employer who violates paragraph (a) is guilty of a misdemeanor and may be punished for contempt of court. In addition, the court shall order the employer to pay back wages and offer job reinstatement to any employee discharged from employment in violation of paragraph (a).\n(c) In addition to any remedies otherwise provided by law, an employee injured by a violation of paragraph (a) may bring a civil action for recovery of damages, together with costs and disbursements, including reasonable attorneys fees, and may receive such injunctive and other equitable relief, including reinstatement, as determined by the court.",
	"repealed": false
}