{
	"id": "325E.026",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.026",
	"title": "325E.026 UNAUTHORIZED USE OF UTILITY METERS.",
	"text": "When used in this section, the terms defined in section 216B.02 have the same meanings. Other terms used in this section have the following meanings:\n(a) \"Bypassing\" means the act of attaching, connecting, or otherwise affixing a wire, cord, socket, pipe, hose, motor, or other instrument or device to utility or customer-owned facilities or equipment so that service provided by the utility is transmitted, supplied, or used without passing through a meter authorized by the utility for measuring or registering the amount of service provided.\n(b) \"Tampering\" means damaging, altering, adjusting, or obstructing the operation of a meter or submeter provided by a utility for measuring or registering the amount of electricity, natural gas, or other utility service passing through the meter.\n(c) \"Unauthorized connection\" means the physical connection or physical reconnection of utility service by a person without the authorization or consent of the utility.\n(d) \"Unauthorized metering\" means removing, installing, connecting, reconnecting, or disconnecting a meter, submeter, or metering device for service by a utility, by a person other than an authorized employee or agent of the utility.\n(e) \"Utility\" means a public utility defined in section 216B.02, subdivision 4; a municipal utility; or a cooperative electric association organized under chapter 308A.\nA utility may bring a civil action for damages against a person who: (1) deliberately commits, authorizes, attempts, solicits, aids, or abets bypassing, tampering, unauthorized connection, or unauthorized metering that results in damages to the utility; or (2) knowingly receives service provided as a result of bypassing, tampering, unauthorized connection, or unauthorized metering. The utility may recover double the costs of the service provided; the costs and expenses for investigation, disconnection, reconnection, service calls, equipment, and employees; and the trial costs and witness fees.\nDamages recovered under this section in excess of the actual damages sustained by a public utility regulated by the commission must be taken into account by the commission and applied for the benefit of the public utility's ratepayers in establishing utility rates.\nThe remedies provided in this section are supplemental and additional to other remedies or powers conferred by law and not in limitation of other civil or criminal statutory or common law remedies.",
	"repealed": false
}