{
	"id": "171.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.09",
	"title": "171.09 DRIVING RESTRICTIONS; AUTHORITY, VIOLATIONS.",
	"text": "(a) The commissioner, when good cause appears, may impose restrictions suitable to the licensee's driving ability or other restrictions applicable to the licensee as the commissioner may determine to be appropriate to assure the safe operation of a motor vehicle by the licensee.\n(b) Pursuant to Code of Federal Regulations, title 49, section 383.95, if an applicant for a commercial driver's license either does not successfully complete the air brake component of the knowledge test, or does not successfully complete the skills test in a vehicle equipped with air brakes as such tests are prescribed in Code of Federal Regulations, title 49, part 384, the department shall indicate on the class C, class B, or class A commercial driver's license, if issued, that the individual is restricted from operating a commercial motor vehicle equipped with air brakes.\n(c) The commissioner shall restrict the operating privileges of a holder of a class A, class B, or class C commercial driver's license in accordance with Code of Federal Regulations, title 49, sections 383.73 and 383.95.\n(d) The commissioner may restrict the operating privileges of a holder of a class A, class B, or class C commercial driver's license to the extent that the restrictions are authorized by section 221.0314, subdivision 3 or 3a, or rules adopted under those subdivisions or section 221.031.\n(e) Upon receiving satisfactory evidence of any violation of the restrictions on the license, the commissioner may suspend or revoke the license. A license suspension under this section is subject to section 171.18, subdivisions 2 and 3.\n(f) A person who drives, operates, or is in physical control of a motor vehicle while in violation of the restrictions imposed in a restricted driver's license issued to that person under this section is guilty of a crime as follows:\n(1) if the restriction relates to the possession or consumption of alcohol or controlled substances, the person is guilty of a gross misdemeanor; or\n(2) if the restriction relates to another matter, the person is guilty of a misdemeanor.\n(g) It is a misdemeanor for a person who holds a restricted license issued under section 171.306 to drive, operate, or be in physical control of any motor vehicle that is not equipped with a functioning ignition interlock device certified by the commissioner.\n[Expired, 2005 c 136 art 18 s 11]\n(a) As used in this subdivision, \"impaired driving incident\" has the meaning given in section 169A.03, subdivision 22.\n(b) Upon proper application by a person having a valid driver's license containing the restriction that the person must not consume alcohol or controlled substances, who has not been documented as having consumed alcohol or having possessed or used a controlled substance within the past ten years, and whose driving record contains no impaired driving incident within the past ten years, the commissioner must remove the no-alcohol/controlled substance restriction on the person's driving record and issue to the person a duplicate driver's license that does not show that restriction.",
	"repealed": false
}