{
	"id": "402.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/402.02",
	"title": "402.02 LOCAL BOARDS; COMPOSITION; POWERS; FUNDING.",
	"text": "Human services boards shall be composed as follows:\n(a) not less than one county commissioner from each county party to the agreement, the commissioner or commissioners to be selected by the county board of the participating county; and\n(b) optional citizen members who in number shall not comprise more than one-third of the membership of the human services board, one of whom shall be the chair of the human services advisory committee, appointed in a manner determined by the county boards which are party to the agreement.\nBoard members shall serve for terms of three years, so arranged that as nearly as practicable, the terms of one-third of the members shall expire each year. Vacancies shall be filled in the same manner as original appointments.\nIf a single county forms a human services board, the county board of commissioners may assume the powers and duties of a human services board.\nNotwithstanding the population requirements of sections 145A.11 to 145A.131 and 245.61 to 245.66 and chapter 401, a human services board shall possess all the powers and duties now assigned by law to:\n(a) manage the public resources devoted to human services delivered or purchased by the counties, which are subsidized or regulated by the Departments of Corrections, Health, and Human Services;\n(b) employ staff to carry out the purposes of sections 402.01 to 402.10;\n(c) deliver services directly or through contract with other governmental or nongovernmental providers;\n(d) plan for the delivery of human services, which shall include corrections services, public health services, public assistance, developmental disability services, social services, mental health services, and others of similar classification;\n(e) receive and expend funds for the purposes of sections 402.01 to 402.10;\n(f) rent, purchase, sell, or otherwise dispose of real and personal property and equipment; and\n(g) county health boards, local social services agencies, and mental health boards.\nThe county boards of commissioners, party to the agreement, shall determine the proportional financial responsibility of each county to support the programs and services of the board. The agreement may provide for payments by each county based upon use by residents of the county of a particular program or service provided, or by other arrangements as determined pursuant to the agreement. Each county shall be subject to applicable requirements of law concerning funding, and to existing limitations upon the authority to levy taxes, for any particular program or service.\nThe Departments of Corrections, Health, and Human Services shall provide funds from any grant or subsidy program or other authorized source to the human services board, based upon an approved plan. The grant or subsidy shall represent all money for human services which each agency commits to programs within counties comprising the human services board.",
	"repealed": false
}