{
	"id": "400.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/400.161",
	"title": "400.161 HAZARDOUS WASTE REGULATIONS.",
	"text": "(a) The county may by ordinance establish and revise rules, regulations, and standards relating to (1) identification of hazardous waste, (2) the labeling and classification of hazardous waste, (3) the collection, transportation, processing, disposal, and storage of hazardous waste, and (4) other matters as may be determined necessary for the public health, welfare, and safety. The county may issue permits or licenses for hazardous waste generation and may require the generators be registered with a county office. The ordinance may require appropriate procedures for the payment by the generator of any costs incurred by the county in completing such procedures. If the generator fails to complete such procedures, the county may recover the costs of completion in a civil action in any court of competent jurisdiction or, in the discretion of the board, the costs may be certified to the county auditor as a special tax against the land as other taxes are collected. The ordinance may be enforced by injunction, action to compel performance, other action in district court, or administrative penalty order authorized under section 116.072. County hazardous waste ordinances shall embody and be consistent with agency hazardous waste rules. Counties shall submit adopted ordinances to the agency for review. In the event that agency rules are modified, each county shall modify its ordinances accordingly and shall submit the modification to the agency for review within 120 days. Issuing, denying, modifying, imposing conditions upon, or revoking permits or licenses and county hazardous waste regulations and ordinances shall be subject to review, denial, suspension, modification, and reversal by the Pollution Control Agency. The Pollution Control Agency shall after written notification have 15 days in the case of hazardous waste permits and licenses and 30 days in the case of hazardous waste ordinances to review, deny, suspend, modify, or reverse the action of the county. After this period, the action of the county board shall be final subject to appeal to the district court as provided in section 115.05.\n(b) A county may not impose a fee under this section on material that is reused at the facility where the material is generated in a manner that the facility owner or operator can demonstrate does not increase the toxicity of, or the level of hazardous substances or pollutants or contaminants in, products that leave the facility.",
	"repealed": false
}