{
	"id": "232.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/232.23",
	"title": "232.23 DUTIES OF PUBLIC GRAIN WAREHOUSE OPERATOR.",
	"text": "(a) Except as provided in paragraph (b), a public grain warehouse operator must receive for storage, so far as the capacity of the grain warehouse will permit, all sound grain tendered in warehouseable condition without discrimination against any person tendering the grain.\n(b) The requirements in paragraph (a) do not apply to storage capacity owned by producers that is managed by the public grain warehouse operator but is not under the same ownership as the grain warehouse.\nA public or private grain warehouse operator, upon receiving grain, shall issue a scale ticket for each load of grain received. Scale tickets shall contain the name, location and the date of each transaction, weight, volume, kind of grain, signature of warehouse operator, and be consecutively numbered. Electronic scale tickets do not require a signature. A duplicate copy of each scale ticket shall remain in the possession of the public or private grain warehouse operator as a permanent record. The original scale ticket shall be delivered to the depositor upon receipt of each load of grain. Each scale ticket shall have printed across its face \"This is a memorandum, nonnegotiable, possession of which does not signify that settlement has or has not been consummated.\" The scale ticket shall state specifically whether the grain is received on contract, for storage, for shipment or consignment or sold. If the grain is received on contract or sold, the price shall be indicated on the scale ticket. All paper scale tickets shall be dated and signed by the public or private grain warehouse operator or the operator's agent or manager.\nAll grain delivered to a public grain warehouse operator shall be considered stored at the time of delivery, unless arrangements have been made with the public grain warehouse operator prior to or at the time of delivery to apply the grain on contract, for shipment or consignment or for cash sale. Grain may be held in open storage or placed on a warehouse receipt. Warehouse receipts must be issued for all grain held in open storage within six months of delivery to the warehouse unless the depositor has signed a statement that the depositor does not desire a warehouse receipt. The warehouse operator's tariff applies for any grain that is retained in open storage or under warehouse receipt. All grain in temporary storage must be owned and exclusively maintained by the licensee. Grain assigned to a grain bank is considered stored grain.\n(a) A grain warehouse receipt must be in duplicate, contain the name and location of the grain warehouse, and be delivered to the depositor or the depositor's agent. Grain warehouse receipts shall be consecutively numbered as prescribed by the commissioner and state the date of deposit, except where the deposit of a certain lot for storage is not completed in one day. In that case, the grain warehouse receipt, when issued, shall be dated not later than Saturday of the week of delivery.\n(b) A grain warehouse receipt shall contain either on its face or reverse side the following specific grain warehouse and storage contract: \"This grain is received, insured and stored through the date of expiration of the annual licenses of this grain warehouse and terms expressed in the body of this grain warehouse receipt shall constitute due notice to its holder of the expiration of the storage period. It is unlawful for a public grain warehouse operator to charge or collect a greater or lesser amount than the amount filed with the commissioner. All charges shall be collected by the grain warehouse operator upon the owner's presentation of the grain warehouse receipt for the sale or delivery of the grain represented by the receipt, or the termination of the storage period. Upon the presentation of this grain warehouse receipt and payment of all charges accrued up to the time of presentation, the above amount, kind and grade of grain will be delivered within the time prescribed by law to the depositor or the depositor's order.\"\n(c) A grain warehouse receipt shall also have printed on it the following:\n\"Redemption of Receipt\nReceived from .............., the sum of $........ or ........ bushels in full satisfaction of the obligation represented by this grain warehouse receipt.\nGross price per bushel $.......\nStorage per bushel $.......\nNet price per bushel $.......\nAll blank spaces in this grain warehouse receipt were filled in before I signed it and I certify that I am the owner of the commodity for which this grain warehouse receipt was issued and that there are no liens, chattel mortgages or other claims against the commodity represented by this grain warehouse receipt.\nThis redemption shall be signed by the depositor or the depositor's agent in the event that the grain represented is redelivered or purchased by the public grain warehouse operator. Signature of this redemption by the depositor constitutes a valid cancellation of the obligation embraced in the storage contract.\"\n(d) A warehouse receipt for dry edible beans must state the grade of the dry edible beans delivered to the grain warehouse and the redelivery charge required under subdivision 10a, paragraph (a).\n(e) An electronic version of a grain warehouse receipt generated by a vendor licensed and approved by the United States Department of Agriculture that contains the same information as the paper version of a grain warehouse receipt may be issued instead of a paper document. The electronic version of a grain warehouse receipt carries the same rights and obligations as the paper version. At no time may a paper receipt and an electronic receipt represent the same lot of grain. Redemption of an electronic version of a warehouse receipt may be accomplished by the warehouse receipt holder applying an electronic signature registered and authenticated by a vendor credited by the United States Department of Agriculture.\nA provision or agreement in a grain warehouse receipt not contained in subdivision 4 is void. The failure to issue a grain warehouse receipt, as directed, or the issuance of slips, memoranda or other forms of receipt embracing a different grain warehouse or storage contract is a misdemeanor, and no slip, memorandum or other form of receipt is admissible as evidence in any civil action. Nothing in sections 232.20 to 232.24 requires or compels any person operating a flour, cereal or feed mill or malthouse doing a manufacturing business, to receive, store or purchase at the mill or malthouse any kind of grain.\nA public grain warehouse operator is liable to the depositor for the delivery of the kind, grade, and net quantity of grain called for by the grain warehouse receipt or scale ticket marked \"store.\"\nNo public grain warehouse operator may issue a grain warehouse receipt for grain not actually received into the grain warehouse.\nA receipt record stating the grain warehouse receipt number and date of deposit, gross weight, dockage and net weight shall remain in the possession of the public grain warehouse operator issuing the grain warehouse receipt and shall be open for inspection by the commissioner or interested parties.\nA public grain warehouse operator must keep a proper record of all grain received, stored or shipped, stating the weight, grade, dockage, and the name of the owner.\n(a) On the redemption of a grain warehouse receipt and payment of all lawful charges, the grain represented by the receipt is immediately deliverable to the depositor or the depositor's order, and is not subject to any further charge for storage after demand for delivery has been made and proper facilities for receiving and shipping the grain have been provided. If delivery has not commenced within 48 hours after demand has been made and proper facilities have been provided, the public grain warehouse operator issuing the grain warehouse receipt is liable to the owner in damages not exceeding two cents per bushel for each day's delay, unless the public grain warehouse operator makes delivery to different owners in the order demanded as rapidly as it can be done through ordinary diligence, or unless insolvency has occurred.\n(b) If a disagreement arises between the person receiving and the person delivering the grain at a public grain warehouse in this state as to the proper grade or dockage of any grain, an average sample of at least three quarts of the grain in dispute may be taken by either or both of the persons interested. The sample shall be certified by both the owner and the public grain warehouse operator as being true samples of the grain in dispute on the delivery day. The samples shall be forwarded in a suitable airtight container by parcel post or express, prepaid, with the name and address of both parties, to a United States Department of Agriculture authorized grain inspection program, who shall, upon request, examine the grain, and determine what grade or dockage the samples of grain are entitled to under the inspection rules. Before the results of the inspection are released to the person requesting the inspection, the person shall pay the required fee. The fee shall be the same as that required for similar services rendered by the grain inspection program.\n(a) A public grain warehouse shall deliver dry edible beans to a holder of a warehouse receipt after the warehouse receipt holder pays a redelivery charge and the charges accrued until the time the warehouse receipt is surrendered to the grain warehouse operator. The dry edible beans must be dry and processed to acceptable standards for canning and packaging use. The redelivery charge may not exceed $3 per net hundredweight of the dry edible beans. The commissioner may determine the maximum redelivery charge by rule, after receiving a petition to change the redelivery charge signed by at least 25 dry edible bean processors, producers, and public warehouse operators.\n(b) A grain warehouse operator shall deliver dry edible beans in bags or in bulk as requested by the warehouse receipt holder. The warehouse receipt holder shall furnish the bags if dry edible beans are to be bagged.\n(c) A grain warehouse operator shall grade the dry edible beans if requested by the warehouse receipt holder. The grain warehouse operator may determine grade by United States Department of Agriculture standards, Northharvest standards, or Michigan Bean Shippers Association standards. The warehouse receipt holder shall pay grading fees.\nStorage contracts on grain being stored at public grain warehouses terminate on the expiration date of the storage license under which the grain warehouse operates. The expiration date must be plainly imprinted on each grain warehouse receipt issued by a public grain warehouse operator. Grain storage may be terminated by the depositor at any time before the expiration date by the payment or tender of all legal charges and the surrender of the grain warehouse receipt together with a demand for delivery of the grain or notice to the public grain warehouse operator to sell the grain. In the absence of a demand for delivery, order to sell or mutual agreement for the renewal of the storage contract, entered prior to the expiration of the original storage contract, the public grain warehouse operator shall, upon the expiration of the contract, and after notification by registered letter to the depositor, sell the stored grain at the local market price on the close of business on that day, deduct from the proceeds of the sale all legal accrued charges, and pay the balance of the proceeds to the depositor upon surrender of the grain warehouse receipt.\nUpon the payment of all legally accrued charges and the return of the grain warehouse receipt, the public grain warehouse operator and the depositor may by mutual consent enter into an agreement for renewal of the grain storage. When the agreement is made, the warehouse operator shall issue a new grain warehouse receipt to the owner and cancel the former grain warehouse receipt by endorsing on it the words \"Canceled by the issuance of grain warehouse receipt No...,\" and inserting the number of the new grain warehouse receipt in the blank space. The canceled grain warehouse receipt shall be signed by the warehouse operator and the depositor.\nExcept as provided in subdivision 11, no warehouse operator may sell or dispose of or deliver out of store any grain stored without the express authority of the depositor and the return of the grain warehouse receipt.\nIt is unlawful for a public grain warehouse operator or the operator's agent to enter into a contract, agreement, combination or understanding with any other public grain warehouse operator whereby the amount of grain to be received or handled by the grain warehouses is equalized or pooled between the grain warehouses, whereby the profits or earnings derived from the grain warehouses is equalized, pooled or apportioned or whereby the price to be paid for any kind of grain at the grain warehouses is fixed or in any manner affected. Each continued day of the contract, agreement, combination or understanding is a separate offense.\n(a) In case of loss or destruction by fire or other cause for the closing of a public grain warehouse, the licensee shall immediately notify the Department of Agriculture in writing.\n(b) Whenever a grain warehouse is closed for more than 48 consecutive hours, not including Sundays and legal holidays, the grain warehouse operator shall advise all patrons of the closing by posting conspicuously at each entrance a notice showing the date of reopening and giving the name and telephone number of a person authorized to act as agent for the purpose of making redeliveries, purchases or conducting other grain warehouse business.\nThe operator of a public grain warehouse must keep all grain in the grain warehouse fully insured against loss by fire, windstorm and extended coverage risks and shall furnish the Department of Agriculture with evidence it requires that the insurance is in force.",
	"repealed": false
}