{
	"id": "473.565",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.565",
	"title": "473.565 POST 1977 SERVICE IN MSRS; EXCEPTIONS.",
	"text": "All employees of the commission shall be members of the Minnesota State Retirement System with respect to service rendered on or after May 17, 1977, except as provided in this section.\nTemporary employees hired for a period of less than six months and part-time employees hired to work less than 30 hours per week shall be excluded from membership in the retirement system if the commission certifies them to the executive director of the retirement system as being temporary or part-time employees.\nAny employee of the commission who was an employee of the Metropolitan Sports Area Commission on May 17, 1977, and who was a member of the Public Employees Retirement Association on account of that employment may elect no later than 30 days following transfer of employment to the commission to remain a member of the Public Employees Retirement Association. The election shall be made on forms provided by the commission, and the commission shall give immediate notice of any such elections to the executive directors of the Public Employees Retirement Association and the Minnesota State Retirement System. Any person who makes such an election shall be excluded from membership in the Minnesota State Retirement System with respect to employment by the commission. The commission shall make the required employer contributions to the Public Employees Retirement Association.\nAny permanent full-time employee of the commission who was a permanent full-time employee of the Metropolitan Sports Area Commission on May 17, 1977, for whom the prior employment was not covered by the Public Employees Retirement Association, may obtain allowable service credit in the Minnesota State Retirement System by paying to the retirement system (a) an amount equal to four percent of current salary rate multiplied by the days and months of such prior service for which the employee desires to obtain allowable service credit plus (b) a matching amount representing the employer's required contributions, except that the commission may agree to pay the matching amount on behalf of its employees. Proof of prior permanent full-time service and the duration thereof shall be established by the certification of the commission to the executive director of the retirement system. The payments shall be made either in a lump sum or by payroll deduction arranged for on or before July 1, 1978.",
	"repealed": false
}