{
	"id": "270C.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.52",
	"title": "270C.52 SETTLEMENT AGREEMENTS, PAYMENT AGREEMENTS, AND OFFERS IN COMPROMISE.",
	"text": "The commissioner, or any employee of the department authorized in writing by the commissioner, is authorized to enter into an agreement in writing with any taxpayer, or duly authorized agent or representative of the taxpayer, relating to the liability of the taxpayer in respect of any tax for any tax period ending prior to the date of the agreement. The agreement shall be final and conclusive and, except upon a showing of fraud or malfeasance, or misrepresentation of a material fact, the case shall not be reopened as to the matters agreed upon, or the agreement modified, by any employee or agent of the state; and, in any suit, action, or proceeding, the agreement, or any determination, assessment, collection, payment, abatement, refund, or credit, made in accordance with the agreement, shall not be annulled, modified, set aside, or disregarded.\n(a) When any portion of any tax payable to the commissioner together with interest and penalty thereon, if any, has not been paid, the commissioner may extend the time for payment for a further period. When the authority of this section is invoked, the extension shall be evidenced by written agreement signed by the taxpayer and the commissioner, stating the amount of the tax with penalty and interest, if any, and providing for the payment of the amount in installments.\n(b) The agreement may contain a confession of judgment for the amount and for any unpaid portion thereof. If the agreement contains a confession of judgment, the confession of judgment must provide that the commissioner may enter judgment against the taxpayer in the district court of the county of residence as shown upon the taxpayer's tax return for the unpaid portion of the amount specified in the extension agreement.\n(c) The agreement shall provide that it can be terminated, after notice by the commissioner, if information provided by the taxpayer prior to the agreement was inaccurate or incomplete, collection of the tax covered by the agreement is in jeopardy, there is a subsequent change in the taxpayer's financial condition, the taxpayer has failed to make a payment due under the agreement, or the taxpayer has failed to pay any other tax or file a tax return coming due after the agreement.\n(d) The notice must be given at least 14 calendar days prior to termination, and shall advise the taxpayer of the right to request a reconsideration from the commissioner of whether termination is reasonable and appropriate under the circumstances. A request for reconsideration does not stay collection action beyond the 14-day notice period. If the commissioner has reason to believe that collection of the tax covered by the agreement is in jeopardy, the commissioner may proceed under section 270C.36 and terminate the agreement without regard to the 14-day period.\n(e) The commissioner may accept other collateral the commissioner considers appropriate to secure satisfaction of the tax liability. The principal sum specified in the agreement shall bear interest at the rate specified in section 270C.40 on all unpaid portions thereof until the same has been fully paid or the unpaid portion thereof has been entered as a judgment. The judgment shall bear interest at the rate specified in section 270C.40.\n(f) If it appears to the commissioner that the tax reported by the taxpayer is in excess of the amount actually owing by the taxpayer, the extension agreement or the judgment entered pursuant thereto shall be corrected. If after making the extension agreement or entering judgment with respect thereto, the commissioner determines that the tax as reported by the taxpayer is less than the amount actually due, the commissioner shall assess a further tax in accordance with the provisions of law applicable to the tax.\n(g) The authority granted to the commissioner by this section is in addition to any other authority granted to the commissioner by law to extend the time of payment or the time for filing a return and shall not be construed in limitation thereof.\n(a) In implementing the authority provided in subdivision 2 or in sections 8.30 and 16D.15 to accept offers of installment payments or offers-in-compromise of tax liabilities, the commissioner shall prescribe guidelines for employees of the department to determine whether an offer-in-compromise or an offer to make installment payments is adequate and should be accepted to resolve a dispute. In prescribing the guidelines, the commissioner shall develop and publish schedules of national and local allowances designed to provide that taxpayers entering into a compromise or payment agreement have an adequate means to provide for basic living expenses. The guidelines must provide that the taxpayer's ownership interest in a motor vehicle, to the extent of the value allowed in section 550.37, will not be considered as an asset; in the case of an offer related to a joint tax liability of spouses, that value of two motor vehicles must be excluded. The guidelines must provide that employees of the department shall determine, on the basis of the facts and circumstances of each taxpayer, whether the use of the schedules is appropriate and that employees must not use the schedules to the extent the use would result in the taxpayer not having adequate means to provide for basic living expenses. The guidelines must provide that:\n(1) an employee of the department shall not reject an offer-in-compromise or an offer to make installment payments from a low-income taxpayer solely on the basis of the amount of the offer; and\n(2) in the case of an offer-in-compromise which relates only to issues of liability of the taxpayer:\n(i) the offer must not be rejected solely because the commissioner is unable to locate the taxpayer's return or return information for verification of the liability; and\n(ii) the taxpayer shall not be required to provide an audited, reviewed, or compiled financial statement.\n(b) The commissioner shall establish procedures:\n(1) that require presentation of a counteroffer or a written rejection of the offer by the commissioner if the amount offered by the taxpayer in an offer-in-compromise or an offer to make installment payments is not accepted by the commissioner;\n(2) for an administrative review of any written rejection of a proposed offer-in-compromise or installment agreement made by a taxpayer under this section before the rejection is communicated to the taxpayer;\n(3) that allow a taxpayer to request reconsideration of any written rejection of the offer or agreement to the commissioner to determine whether the rejection is reasonable and appropriate under the circumstances; and\n(4) that provide for notification to the taxpayer when an offer-in-compromise has been accepted, and issuance of certificates of release of any liens imposed under section 270C.63 related to the liability which is the subject of the compromise.\n(c) Each compromise proposal must be accompanied by a nonrefundable payment of $250. If the compromise proposal is accepted, the payment must be applied to the accepted compromise amount. If the compromise is rejected, the payment must be applied to the outstanding tax debts of the taxpayer pursuant to section 270C.51. In cases of financial hardship, upon presentation of information establishing an inability to make the $250 payment, the commissioner may waive this requirement.",
	"repealed": false
}