{
	"id": "115B.407",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.407",
	"title": "115B.407 ACQUIRING AND DISPOSING OF REAL PROPERTY AT PRIORITY QUALIFIED FACILITIES.",
	"text": "(a) The commissioner may acquire interests in real property by donation or eminent domain at all or a portion of a priority qualified facility. Condemnation under this section includes acquisition of fee title or an easement. After acquiring an interest in real property under this section, the commissioner must take environmental response actions at the priority qualified facility according to sections 115B.39 to 115B.414 after the legislature makes an appropriation for that purpose.\n(b) The commissioner may dispose of real property acquired under this section according to section 115B.17, subdivision 16.\n(c) Except as modified by this section, chapter 117 governs condemnation proceedings by the commissioner under this section. The exceptions under section 117.189 apply to the use of eminent domain authority under this section. Section 117.226 does not apply to properties acquired by the use of eminent domain authority under this section.\n(d) The state is not liable under this chapter solely as a result of acquiring an interest in real property under this section.\n(a) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"after-market value\" means the property value of that portion of the subject property remaining after a partial taking;\n(2) \"as remediated\" means the condition of the property assuming the environmental response actions selected by the commissioner have been completed, including environmental covenants and easements and other institutional controls that may apply;\n(3) \"before-market value\" means the property value of the entire subject property before the taking, less the remediation costs;\n(4) \"property value\" means the fair market value of the real property, as remediated, less any reduction in value attributable to the stigma of pollution; and\n(5) \"remediation costs\" means the reasonably foreseeable costs and expenses, including administrative and legal expenses, that the commissioner will incur to implement the environmental response actions that the commissioner selected for the property according to section 115B.406, subdivision 3, less the amount, if any, that the property owner demonstrates was released under section 115B.443, subdivision 8, which must not be greater than the extent of insurance coverage under policies for the property included in a settlement consistent with section 115B.443, subdivision 8.\n(b) The damages awarded for condemnation of real property under this section is the greater of $500 or:\n(1) for a total taking of the subject property, the before-market value; or\n(2) for a partial taking of the subject property, the before-market value less the after-market value.\n(c) When awarding damages in a condemnation proceeding under this section, in addition to any other requirement of chapter 117, the finder of fact must report:\n(1) the amount determined for the property value of the entire subject property before the taking; and\n(2) the itemized amount determined for remediation costs.\n(d) The commissioner may seek recovery of environmental response costs only to the extent the costs exceed the lower of the remediation costs or the property value of the entire subject property before the taking as reported under paragraph (c).\n(e) If the actual expenses incurred by the commissioner to take environmental response actions at the priority qualified facility as determined at the time construction of the final environmental response action was completed would have yielded a higher award of damages under this section, then the commissioner must reimburse the owner an amount equal to the amount of damages as if the actual expenses were used instead of the remediation costs, less any damages already awarded.",
	"repealed": false
}