{
	"id": "349.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.211",
	"title": "349.211 PRIZE LIMITS.",
	"text": "Except as provided in subdivisions 1a, 1b, and 2, prizes for a single bingo game may not exceed $500 except prizes for a cover-all or cover-none game, which may exceed $500 if the aggregate value of all cover-all or cover-none prizes in a bingo occasion does not exceed $2,000. A prize may be determined based on the value of the bingo packet sold to the player. For purposes of this subdivision, a cover-all game is one in which a player must cover all spaces except a single free space to win and includes a game in which all odd or all even numbers are designated by the organization as covered prior to the start of the game and a cover-none game is one in which a player does not cover any numbered spaces to win.\nPrizes for a linked bingo game shall be limited as follows:\n(1) an organization may not contribute more than 85 percent of the gross receipts per permitted premises to a linked bingo game prize pool;\n(2) no organization may award more than $200 for a linked bingo game consolation prize. For purposes of this subdivision, a linked bingo game consolation prize is a prize awarded by an organization after a prize from the linked bingo prize pool has been won;\n(3) for a progressive linked bingo game, if no player declares a valid bingo for a progressive prize or prizes based on a predetermined and posted win determination, a portion of the gross receipts may be carried over to another game until the accumulated progressive prize is won. The portion of the prize that is not carried over must be awarded to the first player or players who declares a valid bingo as additional numbers are called. If a valid bingo is declared, the entire prize pool for that game is awarded to the winner; and\n(4) for linked bingo games played exclusively with electronic bingo devices, linked bingo prizes in excess of $599 shall be paid by the linked bingo game provider to the player within three business days. Winners of linked bingo prizes in excess of $599 will be given a receipt or claim voucher as proof of a win.\nAn organization may award up to $500 for a hot-ball bingo prize in a bingo occasion.\nExcept as provided in subdivision 1a, a prize of up to $2,000 may be awarded for a progressive bingo game, including a cover-all game. The prize for a progressive bingo game may start at up to $500 and be increased by up to $100 for each game or occasion during which the progressive bingo game is played. A consolation prize of up to $200 for a progressive bingo game may be awarded in each occasion during which the progressive bingo game is played and the accumulated prize is not won.\nThe maximum prize which may be awarded for any single pull-tab is $599 for $2 and under pull-tabs, $899 for $3 pull-tabs, $1,199 for $4 pull-tabs, and $1,499 for $5 pull-tabs, not including any cumulative or carryover prizes. Cumulative or carryover prizes in a pull-tab game shall not exceed $2,500. An organization may not sell any pull-tab for more than $5.\nThe maximum cash prize which may be awarded for a paddle ticket is $70. An organization may not sell any paddle ticket for more than $2.\n(a) The maximum prize which may be awarded for a tipboard ticket is $599 for $2 and under tipboard tickets, $899 for $3 tipboard tickets, $1,199 for $4 tipboard tickets, and $1,499 for $5 tipboard tickets, not including any cumulative or carryover prizes. Cumulative or carryover prizes in tipboard games shall not exceed $2,500. An organization may not sell any tipboard ticket for more than $5.\n(b) For sports-themed tipboards, the total prize payout may not exceed the amount in section 349.2113, and each chance or ticket may not be sold for more than $10.\nThe board may not impose an annual limit on the value of raffle prizes awarded by licensed organizations but the total value of an individual raffle prize may not exceed $50,000.\nThe board by rule shall establish a schedule of prize limits for all other forms of gambling consistent with the purposes set out in section 349.11. The schedule may include daily prize limits and prize limits for each game, raffle or operation of a gambling device.\n(a) Merchandise prizes must be valued at their fair market value. For purposes of sections 349.11 to 349.22 \"prizes\" do not include free plays awarded.\n(b) Merchandise prizes for a paddlewheel consisting of 32 numbers or less or a tipboard consisting of 32 tickets or less may be paid for by the organization up to 30 days after the prize is received by the organization.",
	"repealed": false
}