{
	"id": "462.355",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.355",
	"title": "462.355 ADOPT, AMEND COMPREHENSIVE PLAN; INTERIM ORDINANCE.",
	"text": "The planning agency shall prepare the comprehensive municipal plan. In discharging this duty the planning agency shall consult with and coordinate the planning activities of other departments and agencies of the municipality to insure conformity with and to assist in the development of the comprehensive municipal plan. In its planning activities the planning agency shall take due cognizance of the planning activities of adjacent units of government and other affected public agencies. The planning agency shall periodically review the plan and recommend amendments whenever necessary. When preparing or recommending amendments to the comprehensive plan, the planning agency of a municipality located within a county that is not a greater than 80 percent area, as defined in section 103G.005, subdivision 10b, must consider adopting goals and objectives that will protect open space and the environment. When preparing or recommending amendments to the comprehensive plan, the planning agency must consider (1) the location and dimensions of airport safety zones in any portion of the municipality, and (2) any airport improvements identified in the airport's most recent approved airport layout plan.\nEach municipality in the metropolitan area, as defined in section 473.121, subdivision 2, shall review and update its comprehensive plan and fiscal devices and official controls as provided in section 473.864, subdivision 2.\nThe planning agency may, unless otherwise provided by charter or ordinance consistent with the municipal charter, recommend to the governing body the adoption and amendment from time to time of a comprehensive municipal plan. The plan may be prepared and adopted in sections, each of which relates to a major subject of the plan or to a major geographical section of the municipality. The governing body may propose the comprehensive municipal plan and amendments to it by resolution submitted to the planning agency. Before adopting the comprehensive municipal plan or any section or amendment of the plan, the planning agency shall hold at least one public hearing thereon. A notice of the time, place and purpose of the hearing shall be published once in the official newspaper of the municipality at least ten days before the day of the hearing.\nA proposed comprehensive plan or an amendment to it may not be acted upon by the governing body until it has received the recommendation of the planning agency or until 60 days have elapsed from the date an amendment proposed by the governing body has been submitted to the planning agency for its recommendation. Unless otherwise provided by charter, the governing body may by resolution adopt and amend the comprehensive plan or portion thereof as the official municipal plan upon such notice and hearing as may be prescribed by ordinance. Except for amendments to permit affordable housing development, a resolution to amend or adopt a comprehensive plan must be approved by a two-thirds vote of all of the members. Amendments to permit an affordable housing development are approved by a simple majority of all of the members. For purposes of this subdivision, \"affordable housing development\" means a development in which at least 20 percent of the residential units are restricted to occupancy for at least ten years by residents whose household income at the time of initial occupancy does not exceed 60 percent of area median income, adjusted for household size, as determined by the United States Department of Housing and Urban Development, and with respect to rental units, the rents for affordable units do not exceed 30 percent of 60 percent of area median income, adjusted for household size, as determined annually by the United States Department of Housing and Urban Development.\n(a) If a municipality is conducting studies or has authorized a study to be conducted or has held or has scheduled a hearing for the purpose of considering adoption or amendment of a comprehensive plan or official controls as defined in section 462.352, subdivision 15, or if new territory for which plans or controls have not been adopted is annexed to a municipality, the governing body of the municipality may adopt an interim ordinance applicable to all or part of its jurisdiction for the purpose of protecting the planning process and the health, safety and welfare of its citizens. The interim ordinance may regulate, restrict, or prohibit any use, development, or subdivision within the jurisdiction or a portion thereof for a period not to exceed one year from the date it is effective.\n(b) If a proposed interim ordinance purports to regulate, restrict, or prohibit activities relating to livestock production, a public hearing must be held following a ten-day notice given by publication in a newspaper of general circulation in the municipality before the interim ordinance takes effect.\n(c)(1) A statutory or home rule charter city may adopt an interim ordinance that regulates, restricts, or prohibits a housing proposal only if the ordinance is approved by majority vote of all members of the city council.\n(2) Before adopting the interim ordinance, the city council must hold a public hearing after providing written notice to any person who has submitted a housing proposal, has a pending housing proposal, or has provided a written request to be notified of interim ordinances related to housing proposals. The written notice must be provided at least three business days before the public hearing. Notice also must be posted on the city's official website, if the city has an official website.\n(3) The date of the public hearing shall be the earlier of the next regularly scheduled city council meeting after the notice period or within ten days of the notice.\n(4) The activities proposed to be restricted by the proposed interim ordinance may not be undertaken before the public hearing.\n(5) For the purposes of this paragraph, \"housing proposal\" means a written request for city approval of a project intended primarily to provide residential dwellings, either single family or multi-family, and involves the subdivision or development of land or the demolition, construction, reconstruction, alteration, repair, or occupancy of residential dwellings.\n(d) The period of an interim ordinance applicable to an area that is affected by a city's master plan for a municipal airport may be extended for such additional periods as the municipality may deem appropriate, not exceeding a total additional period of 18 months. In all other cases, no interim ordinance may halt, delay, or impede a subdivision that has been given preliminary approval, nor may any interim ordinance extend the time deadline for agency action set forth in section 15.99 with respect to any application filed prior to the effective date of the interim ordinance. The governing body of the municipality may extend the interim ordinance after a public hearing and written findings have been adopted based upon one or more of the conditions in clause (1), (2), or (3). The public hearing must be held at least 15 days but not more than 30 days before the expiration of the interim ordinance, and notice of the hearing must be published at least ten days before the hearing. The interim ordinance may be extended for the following conditions and durations, but, except as provided in clause (3), an interim ordinance may not be extended more than an additional 18 months:\n(1) up to an additional 120 days following the receipt of the final approval or review by a federal, state, or metropolitan agency when the approval is required by law and the review or approval has not been completed and received by the municipality at least 30 days before the expiration of the interim ordinance;\n(2) up to an additional 120 days following the completion of any other process required by a state statute, federal law, or court order, when the process is not completed at least 30 days before the expiration of the interim ordinance; or\n(3) up to an additional one year if the municipality has not adopted a comprehensive plan under this section at the time the interim ordinance is enacted.",
	"repealed": false
}