{
	"id": "60A.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.171",
	"title": "60A.171 REHABILITATION AND CANCELLATION OF INDEPENDENT AGENT CONTRACTS BY INSURANCE COMPANIES.",
	"text": "(a) After an agency contractual relationship has been in effect for a period of three years, an insurance company writing fire or casualty loss insurance in this state may not terminate the agency contractual relationship with any appointed agent unless the company has provided written notice of termination to the agent at least 60 days in advance of the effective date of the termination.\n(b) The notice of termination must include the reasons for termination.\n(c) An insurance company may not terminate an agency contract based upon any of the following:\n(1) an adverse loss experience for a single year;\n(2) the geographic location of the agent's auto and homeowners insurance business; or\n(3) the performance of obligations required of an insurer under Minnesota Statutes.\n(d) For purposes of this section, \"fire or casualty loss insurance\" means any line of insurance which an insurance agent with a personal lines, property, or casualty license under sections 60K.30 to 60K.56 may write in this state.\nThe company shall at the request of the agent renew any insurance contract written by the agent for the company for not more than one year for fire or casualty loss insurance during a period of 18 months after the effective date of the termination, but in the event any risk does not meet current underwriting standards of the company, the company may decline its renewal, provided that the company shall give the agent not less than 60 days' notice of its intention not to renew the contract of insurance. The company shall not reduce the agent's commissions, unless the company is reducing the commissions for other appointed agents in the state at the same time.\nNo new insurance or bond contract shall be written by the agent for the company after the effective date of the termination without the written approval of the company. The agent may increase liability on renewal or in force business for not more than one year for the insured after the effective date of the termination if the increased liability meets the current underwriting standards of the company.\n[Renumbered subd 4]\nMS 1990 [Renumbered subd 5]\nMS 2004 [Repealed, 2005 c 74 s 13]\nMS 1990 [Renumbered subd 6]\nNothing contained in this section prohibits the earlier termination of an amendment or addendum subsequent to the inception date of the original agency agreement provided that the subsequent amendment or addendum provides for termination on shorter notice and the agent agrees in writing to the earlier termination.\nMS 1990 [Renumbered subd 7]\nDuring the term of the contract the company shall not refuse to renew such business from the agent as would be in accordance with the company's current underwriting standards.\nMS 1990 [Renumbered subd 8]\nThe provisions of this section do not apply to the termination of an agent's contract for insolvency, abandonment, gross and willful misconduct, or failure to pay over to the company money due to the company after receipt by the agent of a written demand therefor, or after revocation of the agent's license by the commissioner of commerce. This section does not apply to the termination of an agent's contract if the agent is directly employed by the company or if the agent writes 80 percent or more of the agent's gross annual insurance business for one company or any or all of its subsidiaries.\nMS 1990 [Renumbered subd 9]\nAll future and presently existing agency contractual relationships between an agent and a company writing fire or casualty loss insurance in this state are subject to the provisions of this section.\nIf it is found, after notice and an opportunity to be heard as determined by the commissioner of commerce, that an insurance company has violated this section, the insurance company shall be subject to a civil action by the agent for actual damages suffered because of the premature termination of the contract by the company. The commissioner of commerce shall employ the department's investigative and enforcement authority if the commissioner has a reason to believe that an insurer has violated this section. An insurer found in violation of this section is subject to a civil penalty imposed by the commissioner not to exceed $10,000 per violation.\nIn the event that a company's compliance with this section is demonstrated to the satisfaction of the commissioner to represent a hazard or potential hazard to the financial integrity of the company, the commissioner may, after a hearing, issue an order relieving the company from its obligation to provide the renewal policies otherwise required by this section.\nUpon termination of an agency, a company is prohibited from soliciting business in the notice of nonrenewal required by section 60A.37. If termination of an agency contract is the ground for nonrenewal of a policy of homeowner's insurance, as defined in section 65A.27, subdivision 4, the company must provide notice to the policyholder that the policy is not being renewed due to the termination of the company's contract with the agency. If the agency is unable to replace the homeowner's insurance policy with a suitable policy from another insurer, the agent must notify the policyholder of the policyholder's right to renew with the company terminating the agency contract. The company must renew the policy if the insured or the insured's agent makes a written request for the renewal before the renewal date.\nFor purposes of this section, a cancellation or termination of an agent's contract is considered to have occurred if the company cancels a line of insurance business or a volume of insurance business that equals or exceeds 75 percent of the insurance business placed by that agent with the company.",
	"repealed": false
}