{
	"id": "256.975",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.975",
	"title": "256.975 MINNESOTA BOARD ON AGING.",
	"text": "There is created a Minnesota Board on Aging consisting of 25 members to be appointed by the governor. At least one member shall be appointed from each congressional district and the remaining members shall be appointed at large. No member shall be appointed for more than two consecutive terms of four years each. In making appointments, the governor shall give consideration to individuals having a special interest in aging, and so far as practicable, shall include persons affiliated with agriculture, labor, industry, education, social work, health, housing, religion, recreation, and voluntary citizen groups, including senior citizens.\nThe governor shall designate the chair. Other officers, including vice-chair and secretary, shall be elected by the board members.\nThe membership terms, compensation, removal of members, and filling of vacancies on the board shall be as provided in section 15.0575.\nThe board shall carry out the following duties:\n(1) to advise the governor and heads of state departments and agencies regarding policy, programs, and services affecting the aging;\n(2) to provide a mechanism for coordinating plans and activities of state departments and citizens' groups as they pertain to aging;\n(3) to create public awareness of the special needs and potentialities of older persons;\n(4) to gather and disseminate information about research and action programs, and to encourage state departments and other agencies to conduct needed research in the field of aging;\n(5) to stimulate, guide, and provide technical assistance in the organization of local councils on aging;\n(6) to provide continuous review of ongoing services, programs and proposed legislation affecting the elderly in Minnesota;\n(7) to administer and to make policy relating to all aspects of the Older Americans Act of 1965, as amended, including implementation thereof; and\n(8) to award grants, enter into contracts, and adopt rules the Minnesota Board on Aging deems necessary to carry out the purposes of this section.\n(a) Notwithstanding section 13D.01, the Minnesota Board on Aging may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the board participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the board can hear all discussion and testimony and all votes of members of the board;\n(3) at least one member of the board is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so that each member's vote on each issue can be identified and recorded.\n(b) Each member of the board participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If telephone or other electronic means is used to conduct a meeting, the board, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The board may require the person making a connection to pay for documented marginal costs that the board incurs as a result of the additional connection.\n(d) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the board shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and of the provisions of paragraph (c). The timing and method of providing notice is governed by section 13D.04.\n[Repealed, 2014 c 262 art 4 s 9]\nThe Board on Aging shall take appropriate action to secure reimbursement from public and private medical care programs, health plans, and health insurers for home-delivered meals that are a necessary part of medical treatment for the elderly.\nAny sums collected under section 325F.71 must be deposited into the state treasury and credited to the account of the state Board on Aging. The money credited to the account of the state Board on Aging is annually appropriated to the state Board on Aging and shall be expended for the following purposes:\n(1) to prepare and distribute educational materials to inform senior citizens, persons with a disability, and the public regarding consumer protection laws and consumer rights that are of particular interest to senior citizens and persons with a disability; or\n(2) to underwrite educational seminars and other forms of educational projects for the benefit of senior citizens and persons with a disability.\n(a) The Minnesota Board on Aging shall create a Native American elders coordinator position and shall hire staff as appropriations permit for the purposes of facilitating the coordination and development of a statewide Tribal-based service system for Native American elders.\n(b) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"Native American elder\" means an individual enrolled in a federally recognized Tribe and identified as an elder according to the requirements of the individual's home Tribe; and\n(2) \"Tribal government\" means representatives of each of the 11 federally recognized Native American Tribes located wholly or partially within the boundaries of the state of Minnesota.\n(c) The statewide Tribal-based service system may include the following components:\n(1) a plan to grant, or make recommendations for granting, federal and state funding for statewide Tribal-based Native American programs and services;\n(2) a plan to develop business initiatives involving Tribal members that will qualify for federal- and state-funded elder service contracts;\n(3) a plan for statewide Tribal-based service focal points for socialization and service accessibility for Native American elders;\n(4) a plan to develop and implement statewide education and public awareness promotions, including cultural sensitivity training and public education on Native American elders;\n(5) a plan for statewide culturally appropriate information and referral services for Native American elders, including legal advice and counsel and trained advocates;\n(6) a plan for a coordinated statewide Tribal-based health care system including health promotion and prevention, in-home service, long-term care service, and health care services;\n(7) a plan for ongoing collection of significant data on Native American elders, including population, health, socialization, mortality, homelessness, and economic status; and\n(8) a plan to coordinate services with existing organizations, including but not limited to the state of Minnesota, the Minnesota Indian Affairs Council, the Minnesota Board on Aging, Wisdom Steps, and Minnesota Tribal governments.\n(a) The Minnesota Board on Aging shall operate a statewide service to aid older Minnesotans and their families in making informed choices about long-term care options and health care benefits. Language services to persons with limited English language skills may be made available. The service, known as Senior LinkAge Line, shall serve older adults as the designated Aging and Disability Resource Center under United States Code, title 42, section 3001, the Older Americans Act Amendments of 2006 in partnership with the Disability Hub under section 256.01, subdivision 24, and must be available during business hours through a statewide toll-free number and the Internet. The Minnesota Board on Aging shall consult with, and when appropriate work through, the area agencies on aging counties, and other entities that serve aging and disabled populations of all ages, to provide and maintain the telephone infrastructure and related support for the Aging and Disability Resource Center partners which agree by memorandum to access the infrastructure, including the designated providers of the Senior LinkAge Line and the Disability Hub.\n(b) The service must provide long-term care options counseling by assisting older adults, caregivers, and providers in accessing information and options counseling about choices in long-term care services that are purchased through private providers or available through public options. The service must:\n(1) develop and provide for regular updating of a comprehensive database that includes detailed listings in both consumer- and provider-oriented formats that can provide search results down to the neighborhood level;\n(2) make the database accessible on the Internet and through other telecommunication and media-related tools;\n(3) link callers to interactive long-term care screening tools and make these tools available through the Internet by integrating the tools with the database;\n(4) develop community education materials with a focus on planning for long-term care and evaluating independent living, housing, and service options;\n(5) conduct an outreach campaign to assist older adults and their caregivers in finding information on the Internet and through other means of communication;\n(6) implement a messaging system for overflow callers and respond to these callers by the next business day;\n(7) link callers with county human services and other providers to receive more in-depth assistance and consultation related to long-term care options;\n(8) link callers with quality profiles for nursing facilities and other home and community-based services providers developed by the commissioners of health and human services;\n(9) develop an outreach plan to seniors and their caregivers with a particular focus on establishing a clear presence in places that seniors recognize and:\n(i) place a significant emphasis on improved outreach and service to seniors and their caregivers by establishing annual plans by neighborhood, city, and county, as necessary, to address the unique needs of geographic areas in the state where there are dense populations of seniors;\n(ii) establish an efficient workforce management approach and assign community living specialist staff and volunteers to geographic areas as well as aging and disability resource center sites so that seniors and their caregivers and professionals recognize the Senior LinkAge Line as the place to call for aging services and information;\n(iii) recognize the size and complexity of the metropolitan area service system by working with metropolitan counties to establish a clear partnership with them, including seeking county advice on the establishment of local aging and disabilities resource center sites; and\n(iv) maintain dashboards with metrics that demonstrate how the service is expanding and extending or enhancing its outreach efforts in dispersed or hard to reach locations in varied population centers;\n(10) incorporate information about the availability of housing options, as well as registered housing with services and consumer rights within the MinnesotaHelp.info network long-term care database to facilitate consumer comparison of services and costs among housing with services establishments and with other in-home services and to support financial self-sufficiency as long as possible. Housing with services establishments and their arranged home care providers shall provide information that will facilitate price comparisons, including delineation of charges for rent and for services available. The commissioners of health and human services shall align the data elements required by the Uniform Checklist of Services under Minnesota Rules, part 4659.0090, the Uniform Consumer Information Guide, and this section to provide consumers standardized information and ease of comparison of long-term care options. The commissioner of human services shall provide the data to the Minnesota Board on Aging for inclusion in the MinnesotaHelp.info network long-term care database;\n(11) provide long-term care options counseling. Long-term care options counselors shall:\n(i) for individuals not eligible for case management under a public program or public funding source, provide interactive decision support under which consumers, family members, or other helpers are supported in their deliberations to determine appropriate long-term care choices in the context of the consumer's needs, preferences, values, and individual circumstances, including implementing an assessment summary;\n(ii) provide web-based educational information and collateral written materials to familiarize consumers, family members, or other helpers with the long-term care basics, issues to be considered, and the range of options available in the community;\n(iii) provide long-term care futures planning, which means providing assistance to individuals who anticipate having long-term care needs to develop a plan for the more distant future; and\n(iv) provide expertise in benefits and financing options for long-term care, including Medicare, long-term care insurance, tax or employer-based incentives, reverse mortgages, private pay options, and ways to access low or no-cost services or benefits through volunteer-based or charitable programs;\n(12) using risk management and support planning protocols, provide long-term care options counseling under clause (13) to current residents of nursing homes deemed appropriate for discharge by the commissioner who meet a profile that demonstrates that the consumer is either at risk of readmission to a nursing home or hospital, or would benefit from long-term care options counseling to age in place. The Senior LinkAge Line shall identify and contact residents or patients deemed appropriate by developing targeting criteria and creating a profile in consultation with the commissioner. The commissioner shall provide designated Senior LinkAge Line contact centers with a list of current or former nursing home residents or people discharged from a hospital or for whom Medicare home care has ended, that meet the criteria as being appropriate for long-term care options counseling through a referral via a secure web portal. Senior LinkAge Line shall provide these residents, if they indicate a preference to receive long-term care options counseling, with initial assessment and, if appropriate, a referral to:\n(i) long-term care consultation services under section 256B.0911;\n(ii) designated care coordinators of contracted entities under section 256B.035 for persons who are enrolled in a managed care plan; or\n(iii) the long-term care consultation team for those who are eligible for relocation service coordination due to high-risk factors or psychological or physical disability; and\n(13) develop referral protocols and processes that will assist certified health care homes, Medicare home care, and hospitals to identify at-risk older adults and determine when to refer these individuals to the Senior LinkAge Line for long-term care options counseling under this section. The commissioner is directed to work with the commissioner of health to develop protocols that would comply with the health care home designation criteria and protocols available at the time of hospital discharge or the end of Medicare home care. The commissioner shall keep a record of the number of people who choose long-term care options counseling as a result of this section.\n(c) Nursing homes shall provide contact information to the Senior LinkAge Line for residents identified in paragraph (b), clause (12), to provide long-term care options counseling pursuant to paragraph (b), clause (11). The contact information for residents shall include all information reasonably necessary to contact residents, including first and last names, permanent and temporary addresses, telephone numbers, and email addresses.\n(d) The Senior LinkAge Line shall determine when it is appropriate to refer a consumer who receives long-term care options counseling under paragraph (b), clause (12) or (13), and who uses an unpaid caregiver to the self-directed caregiver service under subdivision 12.\n(a) All individuals seeking admission to Medicaid-certified nursing facilities, including certified boarding care facilities, must be screened prior to admission regardless of income, assets, or funding sources for nursing facility care, except as described in subdivision 7b, paragraphs (a) and (b). The purpose of the screening is to determine the need for nursing facility level of care as described in section 256B.0911, subdivision 26, and to complete activities required under federal law related to mental illness and developmental disability as outlined in paragraph (b).\n(b) A person who has a diagnosis or possible diagnosis of mental illness or developmental disability must receive a preadmission screening before admission regardless of the exemptions outlined in subdivision 7b, paragraphs (a) and (b), to identify the need for further evaluation and specialized services, unless the admission prior to screening is authorized by the local mental health authority or the local developmental disabilities case manager, or unless authorized by the county agency according to Public Law 101-508.\n(c) The following criteria apply to the preadmission screening:\n(1) requests for preadmission screenings must be submitted via an online form developed by the commissioner;\n(2) the Senior LinkAge Line must use forms and criteria developed by the commissioner to identify persons who require referral for further evaluation and determination of the need for specialized services; and\n(3) the evaluation and determination of the need for specialized services must be done by:\n(i) a qualified independent mental health professional, for persons with a primary or secondary diagnosis of a serious mental illness; or\n(ii) a qualified developmental disability professional, for persons with a primary or secondary diagnosis of developmental disability. For purposes of this requirement, a qualified developmental disability professional must meet the standards for a qualified developmental disability professional under Code of Federal Regulations, title 42, section 483.430.\n(d) The local county mental health authority or the state developmental disability authority under Public Laws 100-203 and 101-508 may prohibit admission to a nursing facility if the individual does not meet the nursing facility level of care criteria or needs specialized services as defined in Public Laws 100-203 and 101-508. For purposes of this section, \"specialized services\" for a person with developmental disability means active treatment as that term is defined under Code of Federal Regulations, title 42, section 483.440 (a)(1).\n(e) In assessing a person's needs, the screener shall:\n(1) use an automated system designated by the commissioner;\n(2) consult with care transitions coordinators, physician, advanced practice registered nurse, or physician assistant; and\n(3) consider the assessment of the individual's physician, advanced practice registered nurse, or physician assistant.\n(f) Other personnel may be included in the level of care determination as deemed necessary by the screener.\n(a) Exemptions from the federal screening requirements outlined in subdivision 7a, paragraphs (b) and (c), are limited to:\n(1) a person who, having entered an acute care facility from a certified nursing facility, is returning to a certified nursing facility; or\n(2) a person transferring from one certified nursing facility in Minnesota to another certified nursing facility in Minnesota.\n(b) Persons who are exempt from preadmission screening for purposes of level of care determination include:\n(1) persons described in paragraph (a);\n(2) an individual who has a contractual right to have nursing facility care paid for indefinitely by the Veterans Administration;\n(3) an individual enrolled in a demonstration project under section 256B.69, subdivision 8, at the time of application to a nursing facility; and\n(4) an individual currently being served under the alternative care program or under a home and community-based services waiver authorized under section 1915(c) of the federal Social Security Act.\n(c) Persons admitted to a Medicaid-certified nursing facility from the community on an emergency basis as described in paragraph (d) or from an acute care facility on a nonworking day must be screened the first working day after admission.\n(d) Emergency admission to a nursing facility prior to screening is permitted when all of the following conditions are met:\n(1) a person is admitted from the community to a certified nursing or certified boarding care facility during Senior LinkAge Line nonworking hours;\n(2) a physician, advanced practice registered nurse, or physician assistant has determined that delaying admission until preadmission screening is completed would adversely affect the person's health and safety;\n(3) there is a recent precipitating event that precludes the client from living safely in the community, such as sustaining an injury, sudden onset of acute illness, or a caregiver's inability to continue to provide care;\n(4) the attending physician, advanced practice registered nurse, or physician assistant has authorized the emergency placement and has documented the reason that the emergency placement is recommended; and\n(5) the Senior LinkAge Line is contacted on the first working day following the emergency admission.\n(e) Transfer of a patient from an acute care hospital to a nursing facility is not considered an emergency except for a person who has received hospital services in the following situations: hospital admission for observation, care in an emergency room without hospital admission, or following hospital 24-hour bed care and from whom admission is being sought on a nonworking day.\n(f) A nursing facility must provide written information to all persons admitted regarding the person's right to request and receive long-term care consultation services as defined in section 256B.0911, subdivision 11. The information must be provided prior to the person's discharge from the facility and in a format specified by the commissioner.\n(a) A person may be screened for nursing facility admission by telephone or in a face-to-face screening interview. The Senior LinkAge Line shall identify each individual's needs using the following categories:\n(1) the person needs no face-to-face long-term care consultation assessment completed under section 256B.0911, subdivisions 17 to 21, 24, 27, or 28, by a county, tribe, or managed care organization under contract with the Department of Human Services to determine the need for nursing facility level of care based on information obtained from other health care professionals;\n(2) the person needs an immediate face-to-face long-term care consultation assessment completed under section 256B.0911, subdivisions 17 to 21, 24, 27, or 28, by a county, tribe, or managed care organization under contract with the Department of Human Services to determine the need for nursing facility level of care and complete activities required under subdivision 7a; or\n(3) the person may be exempt from screening requirements as outlined in subdivision 7b, but will need transition assistance after admission or in-person follow-along after a return home.\n(b) The Senior LinkAge Line shall refer individuals under 65 years of age who are admitted to nursing facilities with only a telephone screening for an in-person assessment from the long-term care consultation team member of the county in which the facility is located or from the recipient's county case manager as described in section 256B.0911, subdivision 28, paragraph (a).\n(c) Persons admitted on a nonemergency basis to a Medicaid-certified nursing facility must be screened prior to admission.\n(d) Screenings provided by the Senior LinkAge Line must include processes to identify persons who may require transition assistance described in subdivision 7, paragraph (b), clause (12), and section 256B.0911, subdivision 27.\n(a) The Department of Human Services shall provide funding for preadmission screening to the Minnesota Board on Aging to cover screener salaries and expenses to provide the services described in subdivisions 7a to 7c. The Minnesota Board on Aging shall:\n(1) employ, or contract with other agencies to employ, within the limits of available funding, sufficient personnel to provide preadmission screening and level of care determination services; and\n(2) seek to maximize federal funding for the service as provided under section 256.01, subdivision 2, paragraph (aa).\n(b) The Department of Human Services shall provide funding for preadmission screening follow-up to the Disability Hub for the under-60 population to cover options counseling salaries and expenses to provide the services described in subdivisions 7a to 7c. The Disability Hub shall:\n(1) employ, or contract with other agencies to employ, within the limits of available funding, sufficient personnel to provide preadmission screening follow-up services; and\n(2) seek to maximize federal funding for the service as provided under section 256.01, subdivision 2, paragraph (aa).\n(a) The purpose of long-term care options counseling is to support persons with current or anticipated long-term care needs in making informed choices among options that include the most cost-effective and least restrictive settings. Reaching people before a crisis and during care transitions is important to ensure quality of care and life, prevent unnecessary hospitalizations and readmissions, reduce the burden on the health care system, reduce costs, and support personal preferences.\n(b) Counseling must be delivered by Senior LinkAge Line either by telephone or in-person. Counseling must:\n(1) be performed in a manner that provides objective and complete information;\n(2) include a review of the person's personal goals, discussion of the person's immediate and projected long-term care needs, and alternative community services or settings that may meet the person's needs; and\n(3) include the counseling and referral protocols in subdivision 7, paragraph (b), clauses (11) to (13).\n(c) An assisted living facility licensed under chapter 144G must inform each prospective resident or the prospective resident's designated or legal representative of the availability of and contact information for long-term care options counseling services under this subdivision by providing Senior LinkAge Line information at the facility tour.\n(d) Prior to discharge, hospitals must refer older adults who are at risk of nursing home placement to the Senior LinkAge Line for long-term care options counseling. Hospitals must make these referrals using referral protocols and processes developed under subdivision 7.\nMS 2022 [Repealed, 2024 c 108 art 3 s 7]\nMS 2022 [Repealed, 2024 c 108 art 3 s 7]\nWithin the limits of appropriations specifically for this purpose, the Minnesota Board on Aging, either directly or through contract, shall promote the provision of employer-sponsored, long-term care insurance. The board shall encourage private and public sector employers to make long-term care insurance available to employees, provide interested employers with information on the long-term care insurance product offered to state employees, and provide technical assistance to employers in designing long-term care insurance products and contacting companies offering long-term care insurance products.\nThe Minnesota Board on Aging shall establish and administer a prescription drug assistance program to assist individuals in accessing programs offered by pharmaceutical manufacturers that provide free or discounted prescription drugs or provide coverage for prescription drugs. The board shall use computer software programs to:\n(1) list eligibility requirements for pharmaceutical assistance programs offered by manufacturers;\n(2) list drugs that are included in a supplemental rebate contract between the commissioner and a pharmaceutical manufacturer under section 256.01, subdivision 2, paragraph (u); and\n(3) link individuals with the pharmaceutical assistance programs most appropriate for the individual. The board shall make information on the prescription drug assistance program available to interested individuals and health care providers and shall coordinate the program with the statewide information and assistance service provided through the Senior LinkAge Line under subdivision 7.\n(a) For purposes of this subdivision, \"communities for a lifetime\" means partnerships of small cities, counties, municipalities, statutory or home rule charter cities, or towns, whose citizens seek to affirmatively extend to persons ages 65 and older the opportunities, supports, and services that will enable them to continue to be contributing, civically engaged residents.\n(b) The opportunities extended within a reasonable distance to senior residents by communities for a lifetime must include, but not be limited to:\n(1) the opportunity to contribute time and talents through volunteer community service;\n(2) the opportunity to participate in the paid workforce, with flexibility of hours and scheduling;\n(3) the opportunity for socializing, recreation, and wellness activities, including both physical exercise and mental stimulation;\n(4) the opportunity to \"age in place\" and choose among a variety of affordable, accessible housing options, including single-family housing, independent congregate senior housing, and senior housing with services;\n(5) the opportunity to access quality long-term care in the setting of the senior's own choice; and\n(6) the opportunity for community-wide mobility and to access public transportation, including door-to-door assistance and weekend and evening access.\n(c) Communities for a lifetime must demonstrate the availability of supports and services for senior residents that include, but are not limited to:\n(1) an array of home and community-based services to support seniors' options to remain in an independent living setting as they age and become more frail;\n(2) access to contemporary remote medical technology for cost-effective home-based monitoring of medical conditions;\n(3) access to nutrition programs, including congregate meal and home-delivered meal opportunities;\n(4) access to a comprehensive caregiver support system for family members and volunteer caregivers, including:\n(i) technological support for caregivers remaining in the paid workforce to manage caregiver responsibilities effectively; and\n(ii) respite care that offers temporary substitute care and supervision for frail seniors;\n(5) personal assistance in accessing services and supports, and in seeking financing for these services and supports;\n(6) high-quality assisted living facilities within a senior's geographic setting of choice;\n(7) high-quality nursing care facilities within a senior's geographic setting of choice; and\n(8) the protection offered to vulnerable seniors by a publicly operated adult protective service.\n(d) Communities for a lifetime must also:\n(1) establish an ongoing local commission to advise the community for a lifetime on its provision of the opportunities, services, and supports identified in paragraphs (b) and (c);\n(2) offer training and learning opportunities for businesses, civic groups, fire and police personnel, and others frequently interacting with seniors on appropriate methods of interacting with seniors; and\n(3) incorporate into its local plan, developed in accordance with Minnesota Statutes 2020, section 366.10, and sections 394.232 and 462.353, elements that address the impact of the forecast change in population age structure on land use, housing, public facilities, transportation, capital improvement, and other areas addressed by local plans; provisions addressing the availability of the opportunities, supports, and services identified in paragraphs (b) and (c); and strategies to develop physical infrastructure responsive to the needs of the projected population.\n(e) In implementing this subdivision, the Minnesota Board on Aging shall:\n(1) consult with, and when appropriate work through, the area agencies on aging;\n(2) consult with the commissioners of human services, health, and employment and economic development, and the League of Minnesota Cities and other organizations representing local units of government; and\n(3) review models of senior-friendly community initiatives from other states and organizations.\n(f) The Board on Aging shall report to the legislature by February 28, 2010, with recommendations on (1) a process for communities to request and receive the designation of community for a lifetime, and (2) funding sources to implement these communities.\n(a) The Minnesota Board on Aging shall award competitive grants to eligible applicants for regional and local projects and initiatives targeted to a designated community, which may consist of a specific geographic area or population, to increase awareness of Alzheimer's disease and other dementias, increase the rate of cognitive testing in the population at risk for dementias, promote the benefits of early diagnosis of dementias, or connect caregivers of persons with dementia to education and resources.\n(b) The project areas for grants include:\n(1) local or community-based initiatives to promote the benefits of physician, advanced practice registered nurse, or physician assistant consultations for all individuals who suspect a memory or cognitive problem;\n(2) local or community-based initiatives to promote the benefits of early diagnosis of Alzheimer's disease and other dementias; and\n(3) local or community-based initiatives to provide informational materials and other resources to caregivers of persons with dementia.\n(c) Eligible applicants for local and regional grants may include, but are not limited to, community health boards, school districts, colleges and universities, community clinics, tribal communities, nonprofit organizations, and other health care organizations.\n(d) Applicants must:\n(1) describe the proposed initiative, including the targeted community and how the initiative meets the requirements of this subdivision; and\n(2) identify the proposed outcomes of the initiative and the evaluation process to be used to measure these outcomes.\n(e) In awarding the regional and local dementia grants, the Minnesota Board on Aging must give priority to applicants who demonstrate that the proposed project:\n(1) is supported by and appropriately targeted to the community the applicant serves;\n(2) is designed to coordinate with other community activities related to other health initiatives, particularly those initiatives targeted at the elderly;\n(3) is conducted by an applicant able to demonstrate expertise in the project areas;\n(4) utilizes and enhances existing activities and resources or involves innovative approaches to achieve success in the project areas; and\n(5) strengthens community relationships and partnerships in order to achieve the project areas.\n(f) The board shall divide the state into specific geographic regions and allocate a percentage of the money available for the local and regional dementia grants to projects or initiatives aimed at each geographic region.\n(g) The board shall award any available grants by January 1, 2016, and each July 1 thereafter.\n(h) Each grant recipient shall report to the board on the progress of the initiative at least once during the grant period, and within two months of the end of the grant period shall submit a final report to the board that includes the outcome results.\n(i) The Minnesota Board on Aging shall develop the criteria and procedures to allocate the grants under this subdivision, evaluate all applicants on a competitive basis and award the grants, and select qualified providers to offer technical assistance to grant applicants and grantees. The selected provider shall provide applicants and grantees assistance with project design, evaluation methods, materials, and training.\nThe Minnesota Board on Aging shall, in consultation with area agencies on aging and other community caregiver stakeholders, administer self-directed caregiver grants to support at-risk family caregivers of older adults or others eligible under the Older Americans Act of 1965, United States Code, title 42, chapter 35, sections 3001 to 3058ff, to sustain family caregivers in the caregivers' roles so older adults can remain at home longer.",
	"repealed": false
}