{
	"id": "252.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.32",
	"title": "252.32 FAMILY SUPPORT PROGRAM.",
	"text": "In accordance with state policy that all children are entitled to live in families that offer safe, nurturing, permanent relationships, and that public services be directed toward preventing the unnecessary separation of children from their families, and because many families who have children with disabilities have special needs and expenses that other families do not have, the commissioner of human services shall establish a program to assist families who have dependent children with disabilities living in their home. The program shall make support grants available to the families.\n(a) Provision of support grants must be limited to families who require support and whose dependents are under the age of 25 and who have been certified as persons with disabilities under section 256B.055, subdivision 12, paragraphs (a), (b), (c), (d), and (e). Families who are receiving: home and community-based waivered services for persons with disabilities authorized under section 256B.092 or 256B.49; personal care assistance under section 256B.0652; or a consumer support grant under section 256.476 are not eligible for support grants.\nNew grant allocations, beginning July 1, 2019, are intended to support families with dependents age 14 through 24 to support transition-related activities.\nFamilies whose annual adjusted gross income is $60,000 or more are not eligible for support grants except in cases where extreme hardship is demonstrated. Beginning in state fiscal year 1994, the commissioner shall adjust the income ceiling annually to reflect the projected change in the average value in the United States Department of Labor Bureau of Labor Statistics Consumer Price Index (all urban) for that year.\n(b) Support grants may be made available as monthly subsidy grants and lump-sum grants.\n(c) Support grants may be issued in the form of cash, voucher, and direct county payment to a vendor.\n(d) Applications for the support grant shall be made by the legal guardian to the county social service agency. The application shall specify the needs of the families, the form of the grant requested by the families, and the items and services to be reimbursed.\n[Repealed, 1Sp2003 c 14 art 3 s 60]\n(a) Support grant amounts shall be determined by the county social service agency. Services and items purchased with a support grant must:\n(1) be over and above the normal costs of caring for the dependent if the dependent did not have a disability;\n(2) be directly attributable to the dependent's disabling condition; and\n(3) enable the family to delay or prevent the out-of-home placement of the dependent.\n(b) The design and delivery of services and items purchased under this section must be provided in the least restrictive environment possible, consistent with the needs identified in the individual service plan.\n(c) Items and services purchased with support grants must be those for which there are no other public or private funds available to the family. Fees assessed to parents for health or human services that are funded by federal, state, or county dollars are not reimbursable through this program.\n(d) In approving or denying applications, the county shall consider the following factors:\n(1) the extent and areas of the functional limitations of a child with a disability;\n(2) the degree of need in the home environment for additional support; and\n(3) the potential effectiveness of the grant to maintain and support the person in the family environment.\n(e) The maximum monthly grant amount shall be $250 per eligible dependent, or $3,000 per eligible dependent per state fiscal year, within the limits of available funds and as adjusted by any legislatively authorized cost of living adjustment. The county social service agency may consider the dependent's Supplemental Security Income in determining the amount of the support grant.\n(f) Any adjustments to their monthly grant amount must be based on the needs of the family and funding availability.\n(a) The commissioner shall specify requirements for quarterly fiscal and annual program reports according to section 256.01, subdivision 2, paragraph (o). Program reports shall include data which will enable the commissioner to evaluate program effectiveness and to audit compliance. The commissioner shall reimburse county costs on a quarterly basis.\n(b) The commissioner shall allocate state funds made available under this section to county social service agencies on a calendar year basis. The commissioner shall allocate to each county first in amounts equal to each county's guaranteed floor as described in clause (1), and second, any remaining funds will be allocated to county agencies to support children in their family homes.\n(1) Each county's guaranteed floor shall be calculated as follows:\n(i) 95 percent of the county's allocation received in the preceding calendar year;\n(ii) when the amount of funds available for allocation is less than the amount available in the preceding year, each county's previous year allocation shall be reduced in proportion to the reduction in statewide funding, for the purpose of establishing the guaranteed floor.\n(2) The commissioner shall regularly review the use of family support fund allocations by county. The commissioner may reallocate unexpended or unencumbered money at any time to those counties that have a demonstrated need for additional funding.\n(c) County allocations under this section will be adjusted for transfers that occur according to section 256.476 or when the county of financial responsibility changes according to chapter 256G for eligible recipients.\nThe commissioner and the counties shall make every reasonable effort to maximize the use of federal funds for family supports.\nCounty boards receiving funds under this section shall:\n(1) submit a plan to the department for the management of the family support grant program. The plan must include the projected number of families the county will serve and policies and procedures for:\n(i) identifying potential families for the program;\n(ii) grant distribution;\n(iii) waiting list procedures; and\n(iv) prioritization of families to receive grants;\n(2) determine the eligibility of all persons proposed for program participation;\n(3) approve a plan for items and services to be reimbursed and inform families of the county's approval decision;\n(4) issue support grants directly to, or on behalf of, eligible families;\n(5) inform recipients of their right to appeal under subdivision 3e;\n(6) submit quarterly financial reports under subdivision 3b and indicate the annual grant level for each family, the families denied grants, and the families eligible but waiting for funding; and\n(7) coordinate services with other programs offered by the county.\nThe denial, suspension, or termination of services under this program may be appealed by a recipient or application under section 256.045, subdivision 3.\n[Repealed, 1997 c 203 art 7 s 29]\nIf a county board or grantee does not comply with this section, the commissioner may recover, suspend, or withhold payments.",
	"repealed": false
}