{
	"id": "462C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.07",
	"title": "462C.07 HOUSING REVENUE BONDS.",
	"text": "To finance programs or developments described in any plan the city may, upon approval of the program as provided in section 462C.04, subdivision 2, issue and sell revenue bonds or obligations which shall be payable exclusively from the revenues of the programs or developments. In the purchase or making of single-family housing loans and the purchase or making of multifamily housing loans and the issuance of revenue bonds or other obligations the city may exercise within its corporate limits, any of the powers the Minnesota Housing Finance Agency may exercise under chapter 462A, without limitation under the provisions of chapter 475. The proceeds of revenue bonds issued to make or purchase single-family housing loans that are jointly issued by two or more cities pursuant to section 471.59 may be used to make or purchase single-family housing loans secured by homes in any of the cities.\nMS 1981 Supp [Repealed, 1982 c 624 s 15]\nUpon approval of the housing plan as provided in section 462C.01, clause (c), any port authority referred to in chapter 458 may, until July 1, 1982, issue revenue bonds of the port authority to finance multifamily housing developments undertaken in accordance with the provisions of section 462C.05, and for such purpose the port authority may exercise any and all powers set forth in chapters 458 and 474, provided that nothing herein shall be construed as authorizing a port authority to finance any housing program other than that authorized by section 462C.05. After July 1, 1982, the port authority may issue revenue bonds solely in accordance with the provisions of Laws 1979, chapter 306, sections 1 to 16.\nUpon foreclosure of any mortgage securing a revenue agreement entered into with respect to revenue bonds issued under this section, the city, trustee, or other mortgagee may determine that the mortgage debt for purposes of chapters 580, 581, 582, and 583 is the revenue agreement debt and does not include the bond debt, or the mortgagee may determine that the mortgage debt includes both the revenue agreement debt and the bond debt. The notice of sale or complaint shall state whether the foreclosure is to enforce only the revenue agreement debt or both the revenue agreement debt and the bond debt. If the mortgagee determines that the foreclosure is to enforce only the revenue agreement debt and not the bond debt:\n(1) the revenue agreement debt is the mortgage debt for all purposes under chapters 580, 581, 582, and 583;\n(2) the bond debt will remain outstanding as a valid and continuing separate debt and will not be extinguished, satisfied, relinquished, or otherwise terminated by the foreclosure sale; and\n(3) the city or mortgagee may enter into a revenue agreement with the purchaser of the mortgaged property or a subsequent transferee, which provides for satisfaction by payment in full or otherwise of all principal of and interest on the bonds then in arrears and to become due.",
	"repealed": false
}