{
	"id": "216C.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.33",
	"title": "216C.33 MINNESOTA BIOMASS CENTER.",
	"text": "The commissioner, in consultation with the commissioner of agriculture, may organize a Minnesota Biomass Center.\nThe center shall be the focus of biomass energy activities for the state. To the maximum extent possible, the center shall coordinate its activities and the use of its staff and facilities with those of other entities involved in biomass energy projects.\nThe center shall:\n(1) coordinate existing education and training programs for biomass energy production and use within the state and develop new programs where necessary. Educational programs shall cover all types of biomass energy production use, including but not limited to production from grain, biowaste, and cellulosic materials;\n(2) serve as a central information resource in conjunction with existing agencies and academic institutions in order to provide information to the public on the production and use of biomass energy. The center shall obtain and analyze available information on biomass energy topics and prepare it for distribution to ensure that the public receives the most accurate and up-to-date information available;\n(3) participate in necessary research projects to assist in technological advancement in areas of biomass energy production, distribution, and use. The center shall also study the environmental and safety aspects of biomass energy use;\n(4) support and coordinate financing activities for biomass energy production, including providing technical assistance and manuals to individuals and groups seeking private, local, state or federal funding. The center shall be responsible for evaluating projects for any state assistance that may become available;\n(5) develop consumer information and protection programs for all aspects of biomass energy production and use;\n(6) investigate marketing and distribution needs within the state;\n(7) review state and federal laws and regulations affecting biomass energy production and use, and evaluate regulatory incentives in order to provide the legislature with legislative proposals for the encouragement of biomass energy production and use within the state.",
	"repealed": false
}