{
	"id": "94.344",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.344",
	"title": "94.344 CLASS B LAND EXCHANGED; CONDITIONS.",
	"text": "Class B land, by resolution of the county board of the county where the land is located and with the unanimous approval of the Land Exchange Board, may be exchanged for any publicly held or privately owned land in the same county. Class B land may be exchanged only if it meets the requirements of subdivision 3 or 5.\nNo class B land which is not classified for sale, and no class B land, however classified, lying within any zone or district which is restricted against any use for which the land may be suitable shall be given in exchange for any privately owned land.\nFor an exchange involving class B land for class A land, the value of the lands shall be determined by the commissioner, with approval of the Land Exchange Board. For purposes of the determination, the commissioner shall determine the value of the state and tax-forfeited land proposed to be exchanged in the same manner as class A land. For all other purposes, the county board shall appraise the state land and the land in the proposed exchange in the same manner as tax-forfeited land to be offered for sale. The determined values shall not be conclusive, but shall be taken into consideration, together with such other matters as may be deemed material, in determining the values for the purposes of exchange.\n(a) Except as otherwise provided, class B land may be exchanged only for land of substantially equal value to the state, as determined by the county board, with the approval of the commissioner and the Land Exchange Board.\n(b) For the purposes of this subdivision, \"substantially equal value\" means:\n(1) where the lands being exchanged are both over 100 acres, their values do not differ by more than ten percent; and\n(2) in other cases, the values of the exchanged lands do not differ by more than 20 percent.\n(c) Class B land may be exchanged for land of lesser value if the other party to the exchange pays to the state the amount of the difference in value. Money received by the county treasurer shall be disposed of in like manner as the proceeds of a sale of tax-forfeited land.\nThere shall be reserved to the state in all class B land conveyed in exchange the same rights and easements as may be required by law in case of sale of tax-forfeited land and such other rights and easements as the county board, with the approval of the commissioner and the board, shall direct. Land may be received in exchange subject to any mineral reservations or other reservations thereon. All such reservations and conditions shall be taken into consideration in determining the value of the lands exchanged.\n(a) Class B land may be exchanged for land of greater value if the other party to the exchange waives payment for the difference.\n(b) Except for class A school trust land, class B land may be exchanged for class A land of greater value if the county pays to the state the difference in value.\n(c) Class B land may be exchanged for United States-owned land of greater value if the county agrees to pay the difference in value.\n[Repealed, 1Sp2005 c 1 art 2 s 162]\n(a) Except for land described in paragraph (b), before giving final approval to any exchange of class B land, the county board shall hold a public hearing thereon. At least two weeks before the hearing the county auditor shall post in the auditor's office a notice thereof, containing a description of the lands affected.\n(b) In an exchange of class B land for class A or class C land, the commissioner is responsible for holding the public hearing.\nBy direction of the county board, the county auditor may submit a proposal for exchange of class B land to any land owner concerned. Any land owner may file with the county auditor a proposal for exchange for consideration by the county board.\nNo exchange of class B land shall be consummated unless the title to the land proposed to be exchanged therefor is first approved by the county attorney in like manner as provided for approval by the commissioner in case of class A land. The county attorney's opinion on the title is subject to approval by the commissioner.\nAfter approval by the county board, every proposal for the exchange of class B land shall be transmitted to the commissioner in such form and with such information as the commissioner may prescribe for consideration by the commissioner and by the board. The county attorney's opinion on the title, with the abstract and other evidence of title, if any, shall accompany the proposal. If the proposal is approved by the commissioner and the board and the title is approved by the attorney general, the same shall be certified to the commissioner of revenue, who shall execute a deed in the name of the state conveying the land given in exchange and transmit the deed to the county auditor to be delivered upon receipt of a deed conveying to the state the land received in exchange, approved by the county attorney; provided, that if any amount is due the state under the terms of the exchange, the deed from the state shall not be executed or delivered until such amount is paid in full and a certificate thereof by the county auditor is filed with the commissioner of revenue. The county auditor shall cause all deeds received by the state in such exchanges to be recorded or registered. If the land received by the county in the exchange is class A land, the commissioner of revenue shall deliver the deed for the class B land to the commissioner of natural resources and following the recording of this deed, the commissioner of natural resources shall deliver to the county auditor a deed conveying the class A land to the county auditor to be recorded or registered.\n(a) Forthwith after the consummation of any land exchange, the county board shall determine the amount to be paid, if any, to the governmental subdivision wherein the class B lands were located as full compensation for the trusts said governmental subdivision held in such land, and the amount so determined shall be transferred by the county auditor from the tax-forfeited funds accruing to the governmental subdivision wherein the privately owned lands were situated to the governmental subdivision wherein the class B lands lie. The lands received shall thereupon become subject to trust in favor of the governmental subdivision wherein they lie and to all laws relating to tax-forfeited lands.\n(b) The county board may also make a determination of payment to be made as to land exchanges heretofore made and direct the county auditor to make such transfer; and when such transfer has been made, such lands shall become subject to trust in favor of the governmental subdivision in which they lie.\n(c) The maximum which may be fixed as payment for the equity held by any governmental subdivision shall in no case exceed the amount said governmental subdivision would have received if the lands had been sold for the appraised value as determined for the purpose of the exchange.",
	"repealed": false
}