{
	"id": "375.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.51",
	"title": "375.51 ORDINANCES; ENACTMENT, PUBLICATION.",
	"text": "In any instance in which a county board is authorized by law to enact ordinances, the ordinances shall be adopted in the manner prescribed in this section except as otherwise provided by law. A public hearing shall be held before the enactment of any ordinance adopting or amending a comprehensive plan or official control as defined in section 394.22. Every county ordinance shall be enacted by a majority vote of all the members of the county board unless a larger number is required by law. It shall be signed by the chair of the board and attested by the clerk of the board. The ordinance shall be published as provided in this section. Proof of the publication shall be attached to and filed with the ordinance in the office of the county auditor. Every ordinance shall be recorded in an ordinance book in the office of the county auditor within 20 days after its publication. All ordinances shall be suitably entitled and shall be substantially in the style: \"The county board of ...... county ordains:\".\nNo county ordinance shall be enacted unless a notice of the intention to enact it has been published in the official newspaper of the county not less than ten days before the meeting or public hearing required by subdivision 1 at which it is to be considered. Public hearings may be continued from time to time and additional hearings may be held. The notice shall state the subject matter and the general purpose of the proposed ordinance. Proof of the publication of the notice shall be attached to and filed with the ordinance, if enacted, in the office of the county auditor.\nEvery ordinance enacted by a county board shall be published at least once as part of the proceedings of the meeting at which the ordinance was enacted. Publication shall be made in the official newspaper of the county but additional publications, either in the official newspaper or other newspaper, may be ordered. An ordinance may be published in its entirety, or otherwise as provided in this subdivision.\nTo the extent of the authority described in subdivision 1, a county may incorporate in an ordinance by reference any statute of Minnesota, any administrative rule of any department of the state of Minnesota affecting the county, or any code. The term \"code\" as used in this subdivision means any compilation or parts of a compilation of regulations or standards prepared by any governmental agency or any trade or professional association for general distribution in printed form as a standard or model on the subject of building construction, plumbing, electric wiring, inflammable liquids, sanitary provisions, public health, safety, or general welfare.\nA lengthy ordinance or an ordinance which includes charts or maps need not be published in its entirety if the title and a summary of the ordinance conforming to section 331A.01, subdivision 10, are included in the publication of the proceedings of the meeting at which it is enacted, with notice that a printed copy of the ordinance is available for inspection by any person during regular office hours at the office of the county auditor. In that case and if a statute, administrative rule or a code is adopted by reference, all requirements of statute for the publication of ordinances shall be satisfied if the summary of the ordinance or the ordinance incorporating the statute, rule or code is published in the required manner and if, prior to publication, at least one copy of the entire ordinance or of the statute, rule, or code is marked as the official copy and filed for use and examination by the public in the office of the county auditor. Provisions of the entire ordinance or of the statute, rule, or code incorporated in the ordinance by reference shall be as much a part of the ordinance as if they had been set out in full in it.",
	"repealed": false
}