{
	"id": "15B.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.36",
	"title": "15B.36 CAPITOL ART EXHIBIT ADVISORY COMMITTEE.",
	"text": "This section applies to art exhibits in the following spaces within the State Capitol: third floor east wing, the egress lobbies added as part of the Capitol restoration completed in 2017, the tunnels connecting legislative office buildings to the Capitol, room 104A of the Capitol, and the entire Capitol basement, excluding the historic Rathskeller, Governor's Dining Room, and Justices' Dining Room. Historic paintings located in Room 317A remain subject to section 138.68. The speaker of the house, president of the senate, and chief justice of the Minnesota Supreme Court may request the advisory committee to provide recommendations on art in their respective hearing rooms and other tenant spaces.\n(a) The Capitol Art Exhibit Advisory Committee is established to advise and make recommendations to the State Capitol Preservation Commission regarding art exhibits to be displayed in State Capitol spaces listed in subdivision 1. To develop these recommendations, the committee shall:\n(1) receive proposals from a broad diversity of Minnesota artists, art organizations, and other individuals and evaluate the extent to which proposals meet the criteria in paragraph (b); and\n(2) prepare a list of recommended art exhibits for consideration by the commission, including information on the availability of the exhibits, a summary of how the recommended exhibits meet the criteria in paragraph (b) and reflect Minnesota history not covered by previous art exhibits, and the estimated costs and logistical needs for recommended exhibits.\n(b) Art exhibits displayed in the State Capitol should tell Minnesota stories and engage people to:\n(1) reflect on Minnesota history;\n(2) understand Minnesota government;\n(3) recognize the contributions of Minnesota's diverse peoples;\n(4) inspire citizen engagement; and\n(5) appreciate the varied landscapes of Minnesota.\n(c) The commissioner of administration shall provide administrative support for the art exhibits approved by the commission under section 15B.32, subdivision 6, paragraph (a), clause (8).\n(d) A preference shall be given for recommended art exhibits for artists currently living in Minnesota or living in Minnesota at the time portrayed. The selection process should ensure that a wide range of artists have a chance to be considered and that, over time, the art reflects the contributions of artists of various demographic backgrounds, including age, disability, gender, and racial and ethnic identity.\n(a) The advisory committee consists of members of the public appointed as follows:\n(1) five appointed by the governor;\n(2) two appointed by the majority leader of the senate and two appointed by the minority leader of the senate; and\n(3) two appointed by the speaker of the house and two appointed by the minority leader of the house of representatives.\n(b) To the extent practicable, the appointing authorities shall appoint individuals with knowledge or experience in art, Minnesota history, or Native American history, so that the advisory committee reflects the demographic and geographic diversity of the state. The public members appointed by the governor must be appointed using the public appointments process under section 15.0597.\n(c) The State Arts Board, the Minnesota Historical Society, the Capitol Area Architectural and Planning Board, and the commissioner of administration shall each appoint one individual to serve ex-officio on the advisory committee as a nonvoting member.\n(d) The advisory committee may meet as frequently as needed to complete its work and shall annually, or when requested by the commissioner, provide the commission with a list of recommended exhibits of works of art by Minnesota artists for possible display in the State Capitol.\nExcept as otherwise provided in this section, terms, removal, vacancies, and compensation are as provided in section 15.059. Terms of advisory committee members begin the first Tuesday after the first Monday in January and are for four years.\nThe committee shall elect a chair from among its members. The committee may elect other officers as it deems necessary.\nCommittee meetings are subject to chapter 13D.\nA member of the committee may not participate in the discussion of or vote on a decision of the committee relating to an organization in which the member has either a direct or indirect financial interest.\nThe committee may accept gifts and grants, which are accepted on behalf of the state and constitute donations to the state. Funds received under this subdivision are appropriated to the commissioner of administration for purposes of the committee.",
	"repealed": false
}