{
	"id": "171.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.35",
	"title": "171.35 LICENSE FOR INSTRUCTOR REQUIRED.",
	"text": "No person shall act as an instructor after January 1, 1968, unless such person has applied for and obtained a license from the commissioner. The commissioner shall issue or adopt rules governing the requirements for an instructor's license, which may include requirements concerning moral character, physical condition, knowledge of the courses of instruction and of motor vehicle laws and safety principles and practices, previous personnel and employment records, teaching experience and qualifications, and such other matters as the commissioner may prescribe, but the applicant shall not be required to have qualified for a teacher's certificate as required in the public school system.\n(a) Before issuing a driving instructor license, the commissioner shall conduct a criminal history and driver's license records check of the applicant. The commissioner may also conduct the check at any time while a person is so licensed. The check must consist of a criminal history check of the state criminal records repository, a national criminal history check, and a check of the driver's license records system. The commissioner shall accept the applicant's signed informed consent form for the national criminal history check request, fingerprints, and required fees. The commissioner shall submit the applicant's signed informed consent form, fingerprints, and fees to the superintendent of the Bureau of Criminal Apprehension, who is authorized to exchange the fingerprints with the Federal Bureau of Investigation to obtain the applicant's national criminal history record information. The superintendent shall also retrieve Minnesota criminal history data and provide the results of both checks to the commissioner. Using the criminal history data provided by the superintendent, the commissioner shall determine whether the applicant is disqualified from licensure. The applicant's failure to cooperate with the commissioner in conducting the records check is reasonable cause to deny an application or suspend a driving instructor license.\n(b) The commissioner may issue to an otherwise qualified applicant a temporary driving instructor license, effective for no more than 180 days, upon presentation of (1) an affidavit by the applicant that the applicant has not been convicted of a gross misdemeanor or felony, and (2) a criminal history check from each state of residence. The criminal history check may be conducted and prepared by any public or private source acceptable to the commissioner. The commissioner may reissue the temporary endorsement if the national criminal records repository check is timely submitted but not completed within the 180-day period.",
	"repealed": false
}