{
	"id": "473.703",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.703",
	"title": "473.703 COMMISSION.",
	"text": "The district shall be operated by a commission which shall consist of three members from Anoka County, two members from Carver County, three members from Dakota County, three members from Hennepin County, three members from Ramsey County, two members from Scott County, and two members from Washington County. Commissioners shall be members of the Board of County Commissioners of their respective counties, and shall be appointed by their respective boards of county commissioners.\nThe terms of the members of the first commission shall expire on December 31 next following their appointment. Thereafter the terms of the commissioners shall be one year commencing on January 1 of each year.\nIf a vacancy occurs on the commission, it shall be filled by the appropriate board of county commissioners.\nA person appointed to the commission shall qualify as a commissioner by filing with the director of the commission a written certificate of appointment from the person's county auditor, together with a written acceptance of appointment from the county auditor, together with a written acceptance of the appointment; provided that the members of the first commission shall file in the office of the county auditor of Hennepin County.\nThe commission shall meet on the first Thursday after the first Monday in January of each year in order to select the officers of the commission for the current year and to conduct such other organizational business as may be necessary.\nThe officers, who shall be commissioners, shall be a chair, a vice-chair, and a secretary, no two of whom shall be from the same county. The chair shall preside at all meetings of the commission, and in the chair's absence, the vice-chair shall preside. The secretary shall keep a complete record of the minutes of each meeting.\nContracts and other written instruments of the commission shall be signed by the chair or vice-chair and by the business administrator of the commission pursuant to authority from the commission.\nThe commission may adopt bylaws to regulate its own proceedings.\nEach commissioner shall have one vote. The majority of the voting power of the commission shall be a quorum although a smaller number may adjourn from time to time. Any motion other than adjournment shall be favored by a majority of the voting power of the commission in order to carry.\nThe legislative auditor shall audit the books and accounts of the commission once each year or as often as the legislative auditor's funds and personnel permit. The commission shall pay the total cost of the audit pursuant to section 3.9741.",
	"repealed": false
}