{
	"id": "84.523",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.523",
	"title": "84.523 BWCA; MANAGING MINERALS AND RELATED RESOURCES.",
	"text": "For the purposes of this section, the term \"Boundary Waters Canoe Area\" means that area of lands and waters included within the boundaries designated in federal regulation REG U-3, Code of Federal Regulations, title 36, section 293.16, as that regulation provided on January 1, 1975.\nThe legislature finds that a combination of state legislative and administrative actions and court decisions have established a public policy of primarily wilderness management for state lands and waters within the Boundary Waters Canoe Area. This state policy, together with a similar federal policy and international actions consistent with these state and federal policies, has created an area of hundreds of thousands of acres of land and water containing myriad lakes and streams, wooded shores, virgin forests, and other natural attractions of surpassing scenic beauty and solitude, free from substantially all commercial activities and artificial development such as hydroelectric dams and power lines, resorts, roads, sawmills, and timber harvesting in no-cut zones.\nExcept with the prior approval of the legislature in those cases of national emergency which have been declared by the Congress and which direct the need for exploration and mining of federal lands within the Boundary Waters Canoe Area, and after an investigation and determination by the commissioner of natural resources pursuant to subdivision 5 no state-owned or administered land may be leased for exploration or mining of minerals, and no state permits, licenses or leases shall be issued to use any other state natural resources for any mineral exploration or mining operations in the Boundary Waters Canoe Area.\nExcept with prior approval of the legislature in those cases of national emergency which have been declared by the Congress and which direct the need for exploitation of peat deposits on federal land within the Boundary Waters Canoe Area, and after an investigation and determination by the commissioner of natural resources pursuant to subdivision 5 no state-owned or administered land may be leased for the purpose of harvesting peat, and no state permits, licenses or leases shall be issued to use any other state natural resources for the purpose of harvesting peat in the Boundary Waters Canoe Area.\nIn the event of a national emergency declared by Congress which requires, for the protection of national interests, exploitation of natural resources of the type found in the Boundary Waters Canoe Area, the commissioner of natural resources shall investigate and determine if there are reasonable alternative methods for providing the needed resources. If the investigation shows there are reasonable alternatives to exploitation of natural resources in the area, no permit for development shall be issued. If the commissioner of natural resources determines there is a need to provide resources from within the Boundary Waters Canoe Area, and that there is no reasonable alternative available to meet the need, a permit may be issued upon approval by the state legislature.\nAcquired lands owned by the state within the Boundary Waters Canoe Area defined in subdivision 1 are designated as state wilderness areas under section 86A.05, subdivision 6.",
	"repealed": false
}