{
	"id": "176.1365",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.1365",
	"title": "176.1365 OUTPATIENT BILLING, PAYMENT, AND DISPUTE RESOLUTION.",
	"text": "This section applies to billing, payment, and dispute resolution for services provided by an ambulatory surgical center (ASC) under section 176.1363 and hospital outpatient services under section 176.1364. For purposes of this section, \"insurer\" includes self-insured employer and \"services\" is as defined in section 176.1364.\n(a) Ambulatory surgical centers and hospitals must bill workers' compensation insurers for services governed by sections 176.1363 and 176.1364 using the same codes, formats, and details that are required for billing the Medicare program, including coding consistent with the American Medical Association Current Procedural Terminology coding system and Medicare's Ambulatory Surgical Center Payment System, Outpatient Prospective Payment System, Outpatient Code Editor, Healthcare Current Procedural Terminology Coding System, and the National Correct Coding Initiative Policy Manual for Medicare Services and associated web page and tables.\n(b) All charges for ASC or hospital outpatient fee schedule services governed by sections 176.1363 and 176.1364 must be submitted to the insurer on the appropriate electronic transaction required by section 176.135, subdivisions 7 and 7a. ASCs must submit charges on the electronic 837P form. ASCs must not separately bill for the services and items included in the ASC facility fee under Code of Federal Regulations, title 42, section 416.164(a). Minnesota Rules, part 5221.4033, subpart 1a, does not apply to ASCs under this section, but does apply to hospital outpatient facility fees to the extent they are not covered by the hospital outpatient fee schedule under section 176.1364.\n(c) Hospitals, ASCs, and insurers must comply with the prior notification and approval or authorization requirements specified in Minnesota Rules, part 5221.6050, subpart 9. Prior notification may be provided by either the hospital, ASC, or the surgeon. For purposes of prior notification under Minnesota Rules, part 5221.6050, subpart 9, \"inpatient\" has the meaning as provided under section 176.136, subdivision 1b, paragraph (d).\n(d) ASC or hospital bills must be submitted to insurers as required by section 176.135, subdivisions 7 and 7a, and within the time period required by section 62Q.75, subdivision 3. Insurers must respond to the initial bill as provided in section 176.135, subdivisions 6 and 7a. Copies of any records or reports relating to the items for which payment is sought are separately payable as provided in section 176.135, subdivision 7, paragraph (a).\n(a) Following receipt of the insurer's explanation of review (EOR) or explanation of benefits (EOB), the ASC or hospital may request reconsideration of a payment denial or reduction. The ASC or hospital must submit its request for reconsideration in writing to the insurer within one year of the date of the EOR or EOB.\n(b) The insurer must issue a written response to the ASC or hospital's request for reconsideration within 30 days, as provided in section 176.135, subdivision 6. The written response must address the issues raised by the request for reconsideration and not simply reiterate the information on the EOR or EOB.\nIf the payer determines it has overpaid an ASC or hospital's charges based on workers' compensation statutes and rules, the payer must submit its request for reimbursement in writing to the ASC or hospital within one year of the date of the payment.\n(a) An ASC, hospital, or insurer must notify the provider or payer, as applicable, of its intent to file a medical request for an administrative conference under section 176.106 at least 20 days before filing one with the department. The insurer, or the ASC or hospital if permitted by section 176.136, subdivision 2, must file the medical request for an administrative conference no later than the latest of:\n(1) one year after the date of the initial EOR or EOB if the ASC or hospital does not request a reconsideration of a payment denial or reduction under subdivision 3;\n(2) one year after the date of the insurer's response to the ASC or hospital's request for reconsideration under subdivision 3; or\n(3) one year after the insurer's request for reimbursement of an overpayment from an ASC or hospital under subdivision 4.\n(b) Paragraph (a) does not prohibit an employee from filing a medical request for assistance or claim petition for the payment denied or reduced by the insurer. However, the ASC or hospital may not bill the employee for the denied or reduced payment when prohibited by this chapter.\n(a) An insurer must pay the ASC or hospital interest at an annual rate of four percent if it is determined that the insurer is liable for additional ASC or hospital charges following a denial of payment. Interest is payable by the insurer on the additional amount owed from the date payment was due.\n(b) An ASC or hospital must pay the insurer interest at an annual rate of four percent if it is determined that the hospital owes the insurer reimbursement following the insurer's request for reimbursement of an overpayment. Interest is payable by the ASC or hospital on the amount of the overpayment from the date the overpayment was made.",
	"repealed": false
}