{
	"id": "275.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.74",
	"title": "275.74 STATE REGULATION OF LEVIES.",
	"text": "The commissioner of revenue shall make all necessary calculations for determining levy limits for local governmental units and notify the affected governmental units of their levy limits directly by September 1 of each levy year. The local governmental units shall, upon request, provide the commissioner with any information needed to make the calculations. The local governmental unit shall report by September 30, in a manner prescribed by the commissioner, the maximum amount of taxes it plans to levy for each of the purposes listed under special levies and any additional levy authorized under section 275.73, along with any necessary documentation. The commissioner shall review the proposed special levies and make any adjustments needed. The commissioner's decision is final. The final allowed special levy amounts and any levy limit adjustments must be certified back to the local governments by December 10. In addition, the commissioner of revenue shall notify all county auditors on or before five working days after December 20 of the sum of the levy limit plus the total of allowed special levies for each local governmental unit located within their boundaries so that they may fix the levies as required in section 275.16. The local governmental units shall provide the commissioner of revenue with all information that the commissioner deems necessary to make the calculations provided for in sections 275.70 to 275.73.\n(a) A local governmental unit may request authorization to levy for unreimbursed costs for natural disasters under section 275.70, subdivision 5, clause (7). The local governmental unit shall submit a request to levy under section 275.70, subdivision 5, clause (7), to the commissioner of revenue by September 30 of the levy year and the request must include information documenting the estimated unreimbursed costs. The commissioner of revenue may grant levy authority, up to the amount requested based on the documentation submitted. All decisions of the commissioner are final.\n(b) A city may request authorization to levy for reasonable and necessary costs for securing, maintaining, or demolishing foreclosed or abandoned residential properties under section 275.70, subdivision 5, clause (18). The local governmental unit shall submit a request to levy under section 275.70, subdivision 5, clause (18), to the commissioner of revenue by September 30 of the levy year and the request must include information documenting the estimated costs. For taxes payable in 2009, the amount may include unanticipated costs incurred above the amount budgeted for these purposes in 2008. Costs of securing foreclosed or abandoned residential properties include payment for police and fire department services. The commissioner of revenue may grant levy authority, up to the lesser of (1) the amount requested based on the documentation submitted, or (2) $3,000 multiplied by the number of foreclosed residential properties, as defined by sheriff sales records, in calendar year 2007. All decisions of the commissioner are final.\nA local governmental unit must provide the commissioner with the information required to calculate the amount under section 275.71, subdivision 2, by July 20 of the levy year. If the information is not received by the commissioner by that date, or is not deemed sufficient to make the calculation under that clause, the commissioner has the discretion to set the local governmental unit's levy limit for all purposes including those purposes for which special levies may be made, equal to the amount of the local governmental unit's certified levy for the prior year.",
	"repealed": false
}