{
	"id": "609.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.215",
	"title": "609.215 SUICIDE.",
	"text": "Whoever intentionally advises, encourages, or assists another in taking the other's own life may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $30,000, or both.\n[See Note.]\nWhoever intentionally advises, encourages, or assists another who attempts but fails to take the other's own life may be sentenced to imprisonment for not more than seven years or to payment of a fine of not more than $14,000, or both.\n(a) A health care provider, as defined in section 145B.02, subdivision 6, who administers, prescribes, or dispenses medications or procedures to relieve another person's pain or discomfort, even if the medication or procedure may hasten or increase the risk of death, does not violate this section unless the medications or procedures are knowingly administered, prescribed, or dispensed to cause death.\n(b) A health care provider, as defined in section 145B.02, subdivision 6, who withholds or withdraws a life-sustaining procedure in compliance with chapter 145B or 145C or in accordance with reasonable medical practice does not violate this section.\nA cause of action for injunctive relief may be maintained against any person who is reasonably believed to be about to violate or who is in the course of violating this section by any person who is:\n(1) the spouse, parent, child, or sibling of the person who would commit suicide;\n(2) an heir or a beneficiary under a life insurance policy of the person who would commit suicide;\n(3) a health care provider of the person who would commit suicide;\n(4) a person authorized to prosecute or enforce the laws of this state; or\n(5) a legally appointed guardian or conservator of the person who would have committed suicide.\nA person given standing by subdivision 4, clause (1), (2), or (5), or the person who would have committed suicide, in the case of an attempt, may maintain a cause of action against any person who violates or who attempts to violate subdivision 1 or 2 for compensatory damages and punitive damages as provided in section 549.20. A person described in subdivision 4, clause (4), may maintain a cause of action against a person who violates or attempts to violate subdivision 1 or 2 for a civil penalty of up to $50,000 on behalf of the state. An action under this subdivision may be brought whether or not the plaintiff had prior knowledge of the violation or attempt.\nReasonable attorney fees shall be awarded to the prevailing plaintiff in a civil action brought under subdivision 4 or 5.",
	"repealed": false
}