{
	"id": "62U.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.01",
	"title": "62U.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given, unless otherwise specified.\n\"Basket\" or \"baskets of care\" means a collection of health care services that are paid separately under a fee-for-service system, but which are ordinarily combined by a provider in delivering a full diagnostic or treatment procedure to a patient.\n\"Clinically effective\" means that the use of a particular health technology or service improves or prevents a decline in patient clinical status, as measured by medical condition, survival rates, and other variables, and that the use of the particular technology or service demonstrates a clinical or outcome advantage over alternative technologies or services. This definition shall not be used to exclude or deny technology or treatment necessary to preserve life on the basis of an individual's age or expected length of life or of the individual's present or predicted disability, degree of medical dependency, or quality of life.\n\"Commissioner\" means the commissioner of health unless otherwise specified.\n\"Cost-effective\" means that the economic costs of using a particular service, device, or health technology to achieve improvement or prevent a decline in a patient's health outcome are justified given the comparison to both the economic costs and the improvement or prevention of decline in patient health outcome resulting from the use of an alternative service, device, or technology, or from not providing the service, device, or technology. This definition shall not be used to exclude or deny technology or treatment necessary to preserve life on the basis of an individual's age or expected length of life or of the individual's present or predicted disability, degree of medical dependency, or quality of life.\n\"Dental organization\" has the meaning given in section 62Q.76, subdivision 7.\n\"Group purchaser\" has the meaning provided in section 62J.03.\n\"Health plan\" means a health plan as defined in section 62A.011.\n\"Health plan company\" has the meaning provided in section 62Q.01, subdivision 4. For the purposes of this chapter, health plan company shall include county-based purchasing arrangements authorized under section 256B.692.\n\"Participating provider\" means a provider who has entered into a service agreement with a health plan company.\n\"Provider\" or \"health care provider\" means a health care provider as defined in section 62J.03, subdivision 8.\n\"Self-insurer\" has the meaning given in section 62E.02, subdivision 21.\n\"Service agreement\" means an agreement, contract, or other arrangement between a health plan company and a provider under which the provider agrees that when health services are provided for an enrollee, the provider shall not make a direct charge against the enrollee for those services or parts of services that are covered by the enrollee's contract, but shall look to the health plan company for the payment for covered services, to the extent they are covered.\n\"State health care program\" means the medical assistance and MinnesotaCare programs.\n\"Third-party administrator\" means a vendor of risk-management services or an entity administering a self-insurance or health insurance plan under section 60A.23.",
	"repealed": false
}