{
	"id": "12A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/12A.09",
	"title": "12A.09 HOUSING FINANCE.",
	"text": "The economic development and housing challenge program under section 462A.33 may provide for housing assistance in the disaster area as provided in this section.\nWithin the limits of state appropriations, assistance is provided to homeowners and rental property owners as forgivable loans up to a maximum set in law. Loans may be used for capital improvements to housing damaged by the disaster, including rehabilitation, replacement on the owner's site, or replacement on a different site within the disaster area. Loans are forgiven for owner-occupied housing if the home remains the borrower's primary residence for a period of time determined by the Housing Finance Agency to encourage continued residence in the community after the date of the loan. Loans are forgiven for rental properties if the rents remain affordable to the local work force for at least ten years after the date of the loan. The Housing Finance Agency may set income limits in excess of the limits established in section 462A.33, subdivision 5. Eligible applicants for assistance under this subdivision must apply for and accept assistance from federal programs.\nGrants may be made under section 462A.21, subdivision 3b:\n(1) to local units of government, including regional consortia, in the disaster area;\n(2) to nonprofit organizations; and\n(3) to federally recognized American Indian Tribes or subdivisions located in Minnesota, and Tribal housing corporations\nworking in the disaster area to assess housing and related needs, develop and implement community or regional plans to meet those needs, and provide capacity to implement recovery plans.\nFor assistance under subdivision 2, the requirements of section 462A.33, subdivision 3, and Minnesota Rules, parts 4900.3632 and 4900.3634, subpart 4, are waived.\nAny repayments of loans made under this section must be deposited in the Housing Finance Agency's disaster relief contingency fund established in section 462A.21, subdivision 29.",
	"repealed": false
}