{
	"id": "202A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/202A.14",
	"title": "202A.14 PRECINCT CAUCUS.",
	"text": "(a) In every state general election year, beginning at 7:00 p.m. on the date established pursuant to paragraph (b), there shall be held for every election precinct a party caucus in the manner provided in sections 202A.14 to 202A.19.\n(b)(1) The chairs of the two largest major political parties shall jointly submit to the secretary of state, no later than March 1 of each odd-numbered year, the single date on which the two parties have agreed to conduct their precinct caucuses in the next even-numbered year. For a year when a presidential nomination primary is scheduled, the date submitted must not be the date of the presidential nomination primary, or the town general election date provided in section 205.075, subdivision 1.\n(2) Within two business days after the parties have agreed on a single date on which to conduct their precinct caucuses, the secretary of state shall publicly announce the official state precinct caucus date for the following general election year.\n(3) If the chairs of the two largest major political parties do not jointly submit a single date for conducting their precinct caucuses as provided in this paragraph, then for purposes of the next general election year, one of the following dates shall be considered the day of a major political party precinct caucus and sections 202A.19 and 202A.192 shall only apply on that date:\n(i) the first Tuesday in February in a year when no presidential nomination primary is required; or\n(ii) the Tuesday immediately prior to the presidential nomination primary in a year when a presidential nomination primary is required.\n(4) For purposes of this paragraph, the two largest major political parties shall be the parties whose candidates for governor received the greatest and second greatest number of votes at the most recent gubernatorial election.\n(c) In the event of severe weather a major political party may request the secretary of state to postpone caucuses. If a major political party makes a request, or upon the secretary of state's own initiative, after consultation with all major political parties and on the advice of the federal Weather Bureau and the Department of Transportation, the secretary of state may declare precinct caucuses to be postponed for a week in counties where weather makes travel especially dangerous. The secretary of state shall submit a notice of the postponement to news media covering the affected counties by 6:00 p.m. on the scheduled day of the caucus. A postponed caucus may also be postponed pursuant to this subdivision.\nThe chair of the county or legislative district executive committee, whichever is provided for by party rules, shall issue the call for the precinct caucus at least 20 days before the time set for holding the caucus, and the call shall contain the following:\n(a) name of party;\n(b) precinct number;\n(c) date caucus is to be held;\n(d) place caucus is to be held;\n(e) hours during which caucus shall be held;\n(f) statutory rules governing the caucus;\n(g) a statement of business to be conducted including the election of a chair and such other officers as may be provided by party rules, and the election of delegates to county or district conventions;\n(h) number of delegates to be elected;\n(i) name of the county or legislative district chair issuing the call;\n(j) name of the present precinct chair or other person who will be the convener of the caucus;\n(k) a space for entering the names of the officers and delegates elected by the caucus.\nThe county or legislative district chair shall give at least six days' published notice of the holding of the precinct caucus, stating the place, date, and time for holding the caucus, and shall deliver the same information to the municipal clerk and county auditor at least 20 days before the precinct caucus. The county auditor shall make this information available at least ten days before the date of the caucuses to persons who request it.",
	"repealed": false
}