{
	"id": "103I.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.605",
	"title": "103I.605 SUBMISSION OF DATA FROM EXPLORATORY BORINGS.",
	"text": "Data obtained from exploratory borings must be submitted by the explorer to the commissioner of natural resources as provided in this section.\n(a) In applying for a permit required for activities relating to mineral deposit evaluation, which means examining an area to determine the quality and quantity of minerals, excluding exploratory boring but including obtaining a bulk sample, by excavating, trenching, constructing shafts, ramps, tunnels, pits, and producing refuse and other associated activities, but does not include activities intended, by themselves, for commercial exploitation of the ore body, the explorer must submit to the commissioner of natural resources data relevant to the proposal under consideration. The explorer may identify portions of the data that, if released, would impair the competitive position of the explorer submitting the data. Data identified must be considered to be not public data.\n(b) If requested to disclose the data, the commissioner shall mail notice of the request to the explorer and determine whether release of the data would impair the competitive position of the explorer submitting the data. If the commissioner determines that release of the data would impair the competitive position of the explorer submitting the data, the commissioner may not release the data to a person other than parties to the proceedings relating to the permit under consideration. Parties to the proceedings shall maintain the confidentiality of data.\n(c) Data that are classified as not public may not be released by the commissioner until 30 days after mailed notice to the explorer of the commissioner's intention to release the data. The commissioner may not release data to a person engaged in exploration, mining, milling, or related industry pertaining to minerals. If the commissioner determines to release data, the explorer may demand a contested case hearing on the commissioner's determination or may withdraw the permit application and the data may not be released.\n(d) Any person aggrieved by the decision of the commissioner may appeal the decision according to chapter 14.\nIn applying for a permit required for mine development, which means activities undertaken after mineral deposit evaluation for commercial exploitation of the ore body, the explorer must submit to the commissioner of natural resources data relevant to the proposal under consideration. The data is public data and persons submitting or releasing the data are not subject to civil or criminal liability for its use by others.\n(a) By 180 days after termination by the explorer of a lease or other type of exploration agreement on a property the data from the exploration must be submitted to the commissioner of natural resources. The data are public data and persons submitting or releasing the data are not subject to civil or criminal liability for its use by others.\n(b) Data that will become public under paragraph (a) may be submitted, with the prior written permission of the commissioner of natural resources, before the termination. If the data are submitted earlier than the required time, the data do not become public data until 180 days after termination by the explorer of the lease or other type of exploration agreement on the property from which the data are obtained. An explorer submitting data before the time required by paragraph (a) shall provide to the commissioner of natural resources at the time the data are submitted and every 180 days after that time, in a format designated by the commissioner of natural resources, satisfactory evidence that the lease or other type of exploration agreement is in effect. If satisfactory evidence that the mineral lease or other exploration agreement is still in effect is not provided to the commissioner of natural resources for a given 180-day period by the required date, the data immediately become public data. The explorer may waive, in writing, the data privacy requirements and agree that data submitted before the time required by paragraph (a) are public data.\n(c) Upon the written request of the explorer, data submitted under paragraph (a) are nonpublic data until 180 days after termination by the explorer of: (1) all other leases or other types of exploration agreements on property located within the same government section as the property on which the exploratory boring was done, and (2) all other leases or other types of exploration agreements on property located within a government section having at least one point in common along its boundary line with the government section in which the exploratory boring was done; provided that the owner of the property on which the exploration occurred consents to the data not becoming public data.\nAn explorer requesting that the exploration data not become public data shall provide to the commissioner of natural resources at the time the data are submitted and every 180 days after that time, in a format designated by the commissioner of natural resources: (1) satisfactory evidence that the lease or exploration agreement that provides the basis for requesting that the data remain as not public data remains in effect, and (2) satisfactory evidence that the owner of the property upon which the exploration occurred consents to the data not becoming public data.\nIf either of the pieces of satisfactory evidence is not provided to the commissioner of natural resources for a given 180-day period by the required date, the data immediately become public data. The explorer may waive, in writing, the data privacy requirements and agree that the submitted data are public data.\n(d) Exploration data and samples submitted under paragraphs (b) and (c) become public data no later than five years after receipt of the exploration data and samples by the commissioner of natural resources even if the lease or other type of exploration agreement described in paragraphs (b) and (c) has not terminated.\nThe commissioner of natural resources shall designate the samples to be submitted, and specify where the sample is to be delivered. If an explorer requires certain samples in their entirety, the commissioner of natural resources may waive the requirement for a one-fourth portion of the samples. Samples submitted are property of the state.",
	"repealed": false
}