{
	"id": "290.068",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.068",
	"title": "290.068 CREDIT FOR INCREASING RESEARCH ACTIVITIES.",
	"text": "A corporation, partners in a partnership, or shareholders in a corporation treated as an S corporation under section 290.9725 are allowed a credit against the tax computed under this chapter for the taxable year equal to:\n(a) ten percent of the first $2,000,000 of the excess (if any) of\n(1) the qualified research expenses for the taxable year, over\n(2) the base amount; and\n(b) four percent on all of such excess expenses over $2,000,000.\nFor purposes of this section, the following terms have the meanings given.\n(a) \"Qualified research expenses\" means (i) qualified research expenses and basic research payments as defined in section 41(b) and (e) of the Internal Revenue Code, except it does not include expenses incurred for qualified research or basic research conducted outside the state of Minnesota pursuant to section 41(d) and (e) of the Internal Revenue Code; and (ii) contributions to a nonprofit corporation established and operated pursuant to the provisions of chapter 317A for the purpose of promoting the establishment and expansion of business in this state, provided the contributions are invested by the nonprofit corporation for the purpose of providing funds for small, technologically innovative enterprises in Minnesota during the early stages of their development.\n(b) \"Qualified research\" means qualified research as defined in section 41(d) of the Internal Revenue Code, except that the term does not include qualified research conducted outside the state of Minnesota.\n(c) \"Base amount\" means base amount as defined in section 41(c) of the Internal Revenue Code, except that the average annual gross receipts and aggregate gross receipts must be calculated using Minnesota sales or receipts under section 290.191 and the definitions contained in paragraphs (a) and (b) shall apply.\n(d) \"Liability for tax\" means the sum of the tax imposed under section 290.06, subdivisions 1 and 2c, for the taxable year reduced by the sum of the nonrefundable credits allowed under this chapter, on all of the entities required to be included on the combined report of the unitary business.\n(a) The credit shall not exceed the liability for tax. If the amount of the credit allowed exceeds the liability for tax of the taxpayer, but is allowed as a result of the liability for tax of other members of the unitary group for the taxable year, the taxpayer must allocate the excess as a research credit to another member of the unitary group.\n(b) In the case of a corporation which is a partner in a partnership, the credit allowed for the taxable year shall not exceed the lesser of the amount determined under paragraph (a) for the taxable year or an amount (separately computed with respect to the corporation's interest in the trade or business or entity) equal to the amount of tax attributable to that portion of taxable income which is allocable or apportionable to the corporation's interest in the trade or business or entity.\n(c) If the amount of the credit determined under this section for any taxable year exceeds the limitation under paragraph (a) or (b), including amounts allocated to other members of the unitary group, the excess shall be a research credit carryover to each of the 15 succeeding taxable years. The entire amount of the excess unused credit for the taxable year shall be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit which may be added under this clause shall not exceed the taxpayer's liability for tax less the research credit for the taxable year.\nIn the case of partnerships the credit shall be allocated in the same manner provided by section 41(f)(2) of the Internal Revenue Code.\nFor shareholders in S corporations the credit must be allocated in the same manner as provided by section 1366(a) of the Internal Revenue Code.\nIf a taxpayer acquires or disposes of the major portion of a trade or business or the major portion of a separate unit of a trade or business in a transaction with another taxpayer, the taxpayer's qualified research expenses and base amount are adjusted in the same manner provided by section 41(f)(3) of the Internal Revenue Code.\n[Repealed, 1991 c 291 art 7 s 26]\nMS 2022 [Repealed, 2023 c 25 s 190]\nMS 2022 [Repealed, 2023 c 25 s 190]",
	"repealed": false
}