{
	"id": "609.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.761",
	"title": "609.761 OPERATIONS PERMITTED.",
	"text": "Notwithstanding sections 609.755 and 609.76, an organization may conduct lawful gambling as defined in section 349.12, if authorized under chapter 349, and a person may manufacture, sell, or offer for sale a gambling device to an organization authorized under chapter 349 to conduct lawful gambling, and pari-mutuel betting on horse racing may be conducted under chapter 240.\nSections 609.755 and 609.76 do not prohibit the operation of the State Lottery or the sale, possession, or purchase of tickets for the State Lottery under chapter 349A.\nSections 609.755 and 609.76 do not prohibit tournaments or contests that satisfy all of the following requirements:\n(1) the tournament or contest consists of the card games of chance commonly known as cribbage, skat, sheepshead, bridge, euchre, pinochle, gin, 500, smear, Texas hold'em, or whist;\n(2) the tournament or contest does not provide any direct financial benefit to the promoter or organizer;\n(3) the value of all prizes awarded for each tournament or contest does not exceed $200; and\n(4) for a tournament or contest involving Texas hold'em:\n(i) no person under 18 years of age may participate;\n(ii) the payment of an entry fee or other consideration for participating is prohibited;\n(iii) the value of all prizes awarded to an individual winner of a tournament or contest at a single location may not exceed $200 each day; and\n(iv) the organizer or promoter must ensure that reasonable accommodations are made for players with disabilities. Accommodations to the table and the cards shall include the announcement of the cards visible to the entire table and the use of Braille cards for players who are blind.\nSections 609.755 and 609.76 do not prohibit dice games conducted on the premises and adjoining rooms of a retail establishment licensed to sell alcoholic beverages if the following requirements are satisfied:\n(1) the games consist of board games played with dice or commonly known dice games such as \"shake-a-day,\" \"3-2-1,\" \"who buys,\" \"last chance,\" \"liar's poker,\" \"6-5-4,\" \"horse,\" and \"aces\";\n(2) wagers or prizes for the games are limited to food or beverages; and\n(3) the retail establishment does not organize or participate financially in the games.\nSections 609.755 and 609.76 do not prohibit a raffle, as defined in section 349.12, subdivision 33, conducted by a school district or a nonprofit organization organized primarily to support programs of a school district, if the following conditions are complied with:\n(1) tickets for the raffle may only be sold and the drawing conducted at a high school event sponsored by a school district. All tickets must be sold for the same price;\n(2) tickets may only be sold to persons 18 years of age or older attending the event;\n(3) the drawing must be held during or immediately after the conclusion of the event;\n(4) one-half of the gross receipts from the sale of tickets must be awarded as prizes for the raffle, and the remaining one-half may only be expended to defray the school district's costs of sending event participants to high school activities held at other locations; and\n(5) if a school district's or nonprofit organization's gross receipts from the conduct of raffles exceeds $12,000 in a calendar year or $5,000 in a single raffle, the school district or organization must report the following information to the Gambling Control Board annually: the total amount of gross receipts received, the total expenses for the raffles, the total prizes awarded, and an accounting of the expenditures from the gross receipts of the raffles.\nSections 609.755 and 609.76 do not prohibit the conduct of or participation in a savings promotion raffle, as defined in section 609.75, subdivision 14, if the following conditions are complied with:\n(1) participants in a savings promotion raffle shall not be required to provide any consideration, other than the deposit of a sum of money in a qualifying account, to obtain chances to win prizes in a savings promotion raffle. For purposes of this clause, participants shall not be deemed to have provided such consideration merely because the interest rate, if any, associated with a qualifying account is lower than the interest rate associated with comparable nonqualifying accounts. Participants shall not be deemed to have given consideration as a consequence of paying any fees associated with a qualifying account, so long as such fees are approximately of a kind and in an amount charged in connection with comparable nonqualifying accounts, if any, offered by the savings promotion raffle sponsor;\n(2) a savings promotion raffle shall be conducted so that each entry in the savings promotion raffle has an equal chance of being drawn; and\n(3) participants in a savings promotion raffle shall not be required to be present at a prize drawing in order to win.",
	"repealed": false
}