{
	"id": "515A.3-112",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.3-112",
	"title": "515A.3-112 INSURANCE.",
	"text": "(a) Commencing not later than the time of the first conveyance of a unit to a unit owner other than a declarant, the association shall maintain, to the extent reasonably available:\n(1) Property insurance on the common elements and units, exclusive of land, excavations, foundations, and other items normally excluded from property policies, insuring against all risks of direct physical loss. The total amount of insurance after application of any deductibles shall be not less than 80 percent of the full insurable replacement cost of the insured property. The association or its authorized agent may enter a unit at reasonable times upon reasonable notice for the purpose of making appraisals for insurance purposes.\n(2) Comprehensive general liability insurance, in an amount determined by the board of directors but not less than any amount specified in the declaration, covering all occurrences commonly insured against for death, bodily injury, and property damage arising out of or in connection with the use, ownership, or maintenance of the common elements.\n(b) If the insurance described in subsection (a) is not maintained, the association shall immediately cause notice of that fact to be sent postage prepaid by United States mail to all unit owners at their respective units and other addresses provided to the association. The declaration may require the association to carry any other insurance, and the association in any event may carry any other insurance it deems appropriate to protect the association or the unit owners.\n(c) Insurance policies carried pursuant to subsection (a) shall provide that:\n(1) Each unit owner and holder of a vendor's interest in a contract for deed is an insured person under the policy with respect to liability arising out of ownership of an undivided interest in the common elements;\n(2) The insurer waives its right to subrogation under the policy against any unit owner of the condominium or members of the unit owner's household and against the association and members of the board of directors;\n(3) No act or omission by any unit owner or holder of an interest as security for an obligation, unless acting within the scope of authority on behalf of the association, shall void the policy or be a condition to recovery under the policy; and\n(4) If, at the time of a loss under the policy, there is other insurance in the name of a unit owner covering the same property covered by the policy, the policy is primary insurance not contributing with the other insurance.\n(d) Any loss covered by the property policy under subsection (a)(1) shall be adjusted with the association, but the insurance proceeds for that loss shall be payable to any insurance trustee designated for that purpose, or otherwise to the association. The insurance trustee or the association shall hold any insurance proceeds in trust for unit owners and holders of an interest as security for an obligation as their interests may appear. The proceeds shall be disbursed first for the repair or restoration of the damaged common elements and units, and unit owners and holders of an interest as security for an obligation are not entitled to receive payment of any portion of the proceeds unless there is a surplus of proceeds after the common elements and units have been completely repaired or restored, or the condominium is terminated.\n(e) An insurance policy issued to the association does not prevent a unit owner from obtaining insurance for personal benefit.\n(f) An insurer that has issued an insurance policy under this section shall issue certificates or memoranda of insurance, upon request, to any unit owner, or holder of an interest as security for an obligation. The insurance may not be canceled until 60 days after notice of the proposed cancellation has been mailed to the association and to each unit owner and holder of an interest as security for an obligation to whom certificates of insurance have been issued.\n(g) Any portion of the condominium damaged or destroyed shall be promptly repaired or replaced by the association unless (1) the condominium is terminated and the association votes not to repair or replace all or part thereof, (2) repair or replacement would be illegal under any state or local health or safety statute or ordinance, or (3) 80 percent of the unit owners, including every owner and first mortgagee of a unit or assigned limited common element which will not be rebuilt, vote not to rebuild. The cost of repair or replacement of a unit or the common area in excess of insurance proceeds and reserves shall be a common expense. If less than the entire condominium is repaired or replaced, (1) the insurance proceeds attributable to the damaged common elements shall be used to restore the damaged area to a condition compatible with the remainder of the condominium, (2) the insurance proceeds attributable to units and limited common elements which are not rebuilt shall be distributed to the owners of those units and the holders of an interest as security for an obligation of those units and the owners and holders of an interest as security for an obligation of the units to which those limited common elements were assigned, as their interests may appear, and (3) the remainder of the proceeds shall be distributed to all the unit owners and holders of an interest as security for an obligation as their interests may appear in proportion to their common element interest. In the event the unit owners vote not to rebuild a unit, that unit's entire common element interest, votes in the association, and common expense liability are automatically reallocated upon the vote as if the unit had been condemned under section 515A.1-107(a), and the association shall promptly prepare, execute and record an amendment to the declaration reflecting the reallocations. Notwithstanding the provisions of this subsection, if the condominium is terminated, insurance proceeds not used for repair or replacement shall be distributed in the same manner as sales proceeds pursuant to section 515A.2-120.\n(h) The provisions of this section may be varied or waived in the case of a condominium all of the units of which are restricted to nonresidential use.",
	"repealed": false
}