{
	"id": "84.633",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.633",
	"title": "84.633 EXCHANGING ROAD EASEMENTS.",
	"text": "The commissioner of natural resources, on behalf of the state, may convey a road easement according to this section for access across state land under the commissioner's jurisdiction in exchange for a road easement for access to property owned by the United States, the state of Minnesota or any of its subdivisions, or a private party. The exercise of the easement across state land must not cause significant adverse environmental or natural resources management impacts. Exchanges under this section are limited to existing access corridors.\nThe acres covered by the state easement conveyed by the commissioner must be substantially equal to the acres covered by the easement being received by the commissioner. For purposes of this section, \"substantially equal\" means that the acres do not differ by more than 20 percent. The commissioner's finding of substantially equal acres is in lieu of an appraisal or other determination of value of the lands. A state easement may be exchanged for an easement that has more than substantially equal acres if the other party to the exchange waives payment for the difference.\nIf the commissioner conveys a road easement over school trust land to a nongovernmental entity, the term of the road easement is limited to 50 years. The easement exchanged with the state may be limited to 50 years or may be perpetual.\nThe commissioner may impose terms and conditions of use as necessary and appropriate under the circumstances. The state may accept an easement with similar terms and conditions as the state easement.\nIf the commissioner determines that a survey is required, the governmental unit or private landowner shall pay to the commissioner a survey fee of not less than one half of the cost of the survey as determined by the commissioner.\nWhen a private landowner or governmental unit, except the state, presents to the commissioner an offer to exchange road easements, the private landowner or governmental unit shall pay an application fee as provided under section 84.63 to cover reasonable costs for reviewing the application and preparing the easements.\nIf the commissioner determines it is necessary to obtain an opinion as to the title of the land being encumbered by the easement that will be received by the commissioner, the governmental unit or private landowner shall submit an abstract of title or other title information sufficient to determine possession of the land, improvements, liens, encumbrances, and other matters affecting title.\n(a) Any fee paid under subdivision 5 must be credited to the account from which expenses are or will be paid and the fee is appropriated for the expenditures in the same manner as other money in the account.\n(b) Any fee paid under subdivision 6 must be deposited in the land management account in the natural resources fund and is appropriated to the commissioner to cover the reasonable costs incurred for preparing and issuing the state road easement and accepting the road easement from the private landowner or governmental entity.",
	"repealed": false
}