{
	"id": "270C.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.285",
	"title": "270C.285 PROCEDURES INVOLVING IN-PERSON TAXPAYER INTERVIEWS.",
	"text": "(a) Upon reasonable advance notice from the taxpayer, a taxpayer shall be allowed to make an audio recording, with the taxpayer's equipment and at the taxpayer's expense, of an interview of the taxpayer by the department regarding the audit or collection of a tax.\n(b) An employee of the department may record an interview described in paragraph (a) if the taxpayer is informed of the recording before the interview and a transcript or copy of the recording is made available to the taxpayer on the taxpayer's request, provided the department is reimbursed by the taxpayer for the cost of transcribing or copying the recording.\n(a) Before or at the start of an initial interview, an employee of the department shall provide to the taxpayer in the case of an audit interview an explanation of the audit process and the taxpayer's rights under that process and, in the case of a collection interview, an explanation of the collection process and the taxpayer's rights under that process.\n(b) If a taxpayer requests to consult with an attorney, accountant, agent, preparer, or any other person permitted to represent the taxpayer before the department at any time during an interview, except an interview initiated by an administrative subpoena, the interview must be suspended for no more than 30 days.\nAn attorney, accountant, agent, preparer, or any other person permitted to represent the taxpayer before the department who has a written power of attorney executed by the taxpayer may represent the taxpayer in an interview described in subdivision 1. The taxpayer may be required to accompany the representative only if a subpoena is issued. In this instance, with the consent of an immediate supervisor and after ten days' notice to the representative, the department employee may notify the taxpayer directly that the employee believes the representative is unreasonably delaying the examination or investigation process.\nThis section does not apply to criminal investigations or investigations relating to the conduct of an employee of the department.",
	"repealed": false
}