{
	"id": "216C.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.42",
	"title": "216C.42 DEFINITIONS; ENERGY IMPROVEMENTS FOR BUILDINGS.",
	"text": "For the purpose of this section and section 216C.43, the terms defined in this section have the meanings given them.\n\"Energy improvement project\" means a project to improve energy efficiency in a building or facility, including the design, acquisition, installation, construction, and commissioning of equipment or improvements to a building or facility, and training of building or facility staff necessary to properly operate and maintain the equipment or improvements.\n\"Energy project study\" means a technical and financial study of one or more energy improvement projects, including:\n(1) an analysis of historical energy consumption and cost data;\n(2) a description of existing equipment, structural elements, operating characteristics, and other conditions affecting energy use;\n(3) a description of the proposed energy improvement projects;\n(4) a detailed budget for the proposed project;\n(5) calculations sufficient to demonstrate the expected energy savings; and\n(6) if a geothermal energy improvement, whether the project is calculated to produce savings in terms of nongeothermal energy and costs.\n\"Financing agreement\" means a tax-exempt lease-purchase agreement entered into by a local government and a financial institution under a standard project financing agreement offered under section 216C.43, subdivision 6.\n\"Local government\" means a Minnesota county, statutory or home rule charter city, town, school district, park district, or any combination of those units operating under an agreement to exercise powers jointly.\n\"Program\" means the energy improvement financing program for local governments authorized by section 216C.43.\n\"Supplemental cash flow agreement\" means an agreement by the commissioner to lend funds to a local government up to an amount necessary to ensure that the cumulative payments made by the local government under a financing agreement minus the amount loaned by the commissioner do not exceed the actual energy and operating cost savings attributable to the energy improvement project for the term of the supplemental cash flow agreement.",
	"repealed": false
}