{
	"id": "518A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.41",
	"title": "518A.41 MEDICAL SUPPORT.",
	"text": "The definitions in this subdivision apply to this chapter and chapter 518.\n(a) \"Health care coverage\" means private health care coverage, including fee for service, health maintenance organization, preferred provider organization, and other types of private health care coverage. Health care coverage also means public health care coverage under which medical or dental services could be provided to a dependent child.\n(b) \"Private health care coverage\" means a health plan that provides medical, dental, or other health care benefits and is:\n(1) provided on an individual or group basis;\n(2) provided by an employer or union;\n(3) purchased in the private market;\n(4) provided through MinnesotaCare under chapter 256L; or\n(5) available to a person eligible to carry insurance for the joint child, including a party's spouse or parent.\nPrivate health care coverage includes, but is not limited to, a health plan meeting the definition under section 62A.011, subdivision 3, except that the exclusion of coverage designed solely to provide dental or vision care under section 62A.011, subdivision 3, clause (6), does not apply to the definition of private health care coverage under this section; a group health plan governed under the federal Employee Retirement Income Security Act of 1974 (ERISA); a self-insured plan under sections 43A.23 to 43A.317 and 471.617; and a policy, contract, or certificate issued by a community-integrated service network licensed under chapter 62N.\n(c) \"Public health care coverage\" means health care benefits provided by any form of medical assistance under chapter 256B. Public health care coverage does not include MinnesotaCare or health plans subsidized by federal premium tax credits or federal cost-sharing reductions.\n(d) \"Medical support\" means providing health care coverage for a joint child by contributing to the cost of health care coverage, unreimbursed health-related expenses, and uninsured health-related expenses of the joint child.\n(e) \"National medical support notice\" means an administrative notice issued by the public authority to enforce health insurance provisions of a support order in accordance with Code of Federal Regulations, title 45, section 303.32, in cases where the public authority provides support enforcement services.\n(f) \"Uninsured health-related expenses\" means a joint child's reasonable and necessary medical and dental expenses if the joint child is not covered by private health insurance care when the expenses are incurred.\n(g) \"Unreimbursed health-related expenses\" means a joint child's reasonable and necessary medical and dental expenses if a joint child is covered by health care coverage and health care coverage does not pay for the total cost of the expenses when the expenses are incurred. Unreimbursed health-related expenses do not include the cost of premiums. Unreimbursed health-related expenses include, but are not limited to, deductibles, co-payments, and expenses for orthodontia, and prescription eyeglasses and contact lenses, but not over-the-counter medications if provided through health care coverage.\n(a) A completed national medical support notice issued by the public authority or a court order that complies with this section is a qualified medical child support order under the federal Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1169(a).\n(b) Every order addressing child support must state:\n(1) the names, last known addresses, and Social Security numbers of the parents and the joint child that is a subject of the order unless the court prohibits the inclusion of an address or Social Security number and orders the parents to provide the address and Social Security number to the administrator of the health plan;\n(2) whether appropriate health care coverage for the joint child is available and, if so, state:\n(i) the parents' responsibilities for carrying health care coverage;\n(ii) the cost of premiums and how the cost is allocated between the parents;\n(iii) the circumstances, if any, under which an obligation to provide private health care coverage for the joint child will shift from one parent to the other; and\n(iv) whether a contribution for public health care coverage is required; and\n(3) how unreimbursed or uninsured health-related expenses will be allocated between the parents.\nPublic health care coverage is presumed appropriate. In determining whether a parent has appropriate private health care coverage for the joint child, the court must consider the following factors:\n(1) comprehensiveness of private health care coverage providing medical benefits. Dependent private health care coverage providing medical benefits is presumed comprehensive if it includes medical and hospital coverage and provides for preventive, emergency, acute, and chronic care; or if it meets the minimum essential coverage definition in United States Code, title 26, section 5000A(f). If both parents have private health care coverage providing medical benefits that is presumed comprehensive under this paragraph, the court must determine which parent's private health care coverage is more comprehensive by considering what other benefits are included in the private health care coverage;\n(2) accessibility. Dependent private health care coverage is accessible if the covered joint child can obtain services from a health plan provider with reasonable effort by the parent with whom the joint child resides. Private health care coverage is presumed accessible if:\n(i) primary care is available within 30 minutes or 30 miles of the joint child's residence and specialty care is available within 60 minutes or 60 miles of the joint child's residence;\n(ii) the private health care coverage is available through an employer and the employee can be expected to remain employed for a reasonable amount of time; and\n(iii) no preexisting conditions exist to unduly delay enrollment in private health care coverage;\n(3) the joint child's special medical needs, if any; and\n(4) affordability. Dependent private health care coverage is presumed affordable if the premium to cover the marginal cost of the joint child does not exceed five percent of the parents' combined monthly PICS. A court may additionally consider high deductibles and the cost to enroll the parent if the parent must enroll themselves in private health care coverage to access private health care coverage for the child.\n(a) If a joint child is presently enrolled in health care coverage, the court shall order that the parent who currently has the joint child enrolled in health care coverage continue that enrollment if the health care coverage is appropriate as defined under subdivision 3.\n(b) If only one parent has appropriate health care coverage providing medical benefits available, the court must order that parent to carry the coverage for the joint child.\n(c) If both parents have appropriate health care coverage providing medical benefits available, the court must order the parent with whom the joint child resides to carry the health care coverage for the joint child, unless:\n(1) a party expresses a preference for private health care coverage providing medical benefits available through the parent with whom the joint child does not reside;\n(2) the parent with whom the joint child does not reside is already carrying dependent private health care coverage providing medical benefits for other children and the cost of contributing to the premiums of the other parent's health care coverage would cause the parent with whom the joint child does not reside extreme hardship; or\n(3) the parties agree as to which parent will carry health care coverage providing medical benefits and agree on the allocation of costs.\n(d) If the exception in paragraph (c), clause (1) or (2), applies, the court must determine which parent has the most appropriate health care coverage providing medical benefits available and order that parent to carry health care coverage for the joint child.\n(e) If neither parent has appropriate health care coverage available, the court must order the parents to contribute toward the actual health care costs of the joint children based on a pro rata share.\n(f) If neither parent has appropriate health care coverage available, the court may order the parent with whom the child resides to apply for public health care coverage for the child.\n(g) If a joint child is not presently enrolled in private health care coverage providing dental benefits, upon motion of a parent or the public authority, the court must determine whether one or both parents have appropriate private health care coverage providing dental benefits for the joint child, and the court may order a parent with appropriate private health care coverage providing dental benefits available to carry the health care coverage for the joint child.\n(h) If a joint child is not presently enrolled in available private health care coverage providing benefits other than medical benefits or dental benefits, upon motion of a parent or the public authority, the court may determine whether private health care coverage providing other health benefits for the joint child is appropriate, and the court may order a parent with that appropriate private health care coverage available to carry the coverage for the joint child.\n(a) Unless otherwise agreed to by the parties and approved by the court, the court must order that the cost of private health care coverage and all unreimbursed and uninsured health-related expenses be divided between the obligor and obligee based on their proportionate share of the parties' combined monthly PICS. The amount allocated for medical support is considered child support but is not subject to a cost-of-living adjustment under section 518A.75.\n(b) If a party owes a basic support obligation for a joint child and is ordered to carry private health care coverage for the joint child, and the other party is ordered to contribute to the carrying party's cost for coverage, the carrying party's basic support payment must be reduced by the amount of the contributing party's contribution.\n(c) If a party owes a basic support obligation for a joint child and is ordered to contribute to the other party's cost for carrying private health care coverage for the joint child, the contributing party's child support payment must be increased by the amount of the contribution. The contribution toward private health care coverage must not be charged in any month in which the party ordered to carry private health care coverage fails to maintain private coverage.\n(d) If the party ordered to carry private health care coverage for the joint child already carries dependent private health care coverage for other dependents and would incur no additional premium costs to add the joint child to the existing health care coverage, the court must not order the other party to contribute to the premium costs for health care coverage of the joint child.\n(e) If a party ordered to carry private health care coverage for the joint child does not already carry dependent private health care coverage but has other dependents who may be added to the ordered health care coverage, the full premium costs of the dependent private health care coverage must be allocated between the parties in proportion to the party's share of the parties' combined monthly PICS, unless the parties agree otherwise.\n(f) If a party ordered to carry private health care coverage for the joint child is required to enroll in a health plan so that the joint child can be enrolled in dependent private health care coverage under the plan, the court must allocate the costs of the dependent private health care coverage between the parties. The costs of the private health care coverage for the party ordered to carry the health care coverage for the joint child must not be allocated between the parties.\n(g) If the joint child is receiving any form of public health care coverage:\n(1) the parent with whom the joint child does not reside shall contribute a monthly amount toward the actual cost of public health care coverage. The amount of the noncustodial parent's contribution is determined by applying the noncustodial parent's PICS to the premium scale for MinnesotaCare under section 256L.15, subdivision 2, paragraph (d). If the noncustodial parent's PICS meets the eligibility requirements for MinnesotaCare, the contribution is the amount that the noncustodial parent would pay for the child's premium;\n(2) if the noncustodial parent's PICS exceeds the eligibility requirements, the contribution is the amount of the premium for the highest eligible income on the premium scale for MinnesotaCare under section 256L.15, subdivision 2, paragraph (d). For purposes of determining the premium amount, the noncustodial parent's household size is equal to one parent plus the child or children who are the subject of the order;\n(3) the custodial parent's obligation is determined under the requirements for public health care coverage in chapter 256B; or\n(4) if the noncustodial parent's PICS is less than 200 percent of the federal poverty guidelines for one person or the noncustodial parent receives public assistance, the noncustodial parent must not be ordered to contribute toward the cost of public health care coverage.\n(h) The commissioner of children, youth, and families must publish a table for section 256L.15, subdivision 2, paragraph (d), and update the table with changes to the schedule by July 1 of each year.\n(a) The public authority must forward a copy of the national medical support notice or court order for private health care coverage to the party's employer within two business days after the date the party is entered into the work reporting system under section 142A.29.\n(b) The public authority or a party seeking to enforce an order for private health care coverage must forward a copy of the national medical support notice or court order to the obligor's employer or union, or to the health carrier under the following circumstances:\n(1) the party ordered to carry private health care coverage for the joint child fails to provide written proof to the other party or the public authority, within 30 days of the effective date of the court order, that the party has applied for private health care coverage for the joint child;\n(2) the party seeking to enforce the order or the public authority gives written notice to the party ordered to carry private health care coverage for the joint child of its intent to enforce medical support. The party seeking to enforce the order or public authority must mail the written notice to the last known address of the party ordered to carry private health care coverage for the joint child; and\n(3) the party ordered to carry private health care coverage for the joint child fails, within 15 days after the date on which the written notice under clause (2) was mailed, to provide written proof to the other party or the public authority that the party has applied for private health care coverage for the joint child.\n(c) The public authority is not required to forward a copy of the national medical support notice or court order to the obligor's employer or union, or to the health carrier, if the court orders private health care coverage for the joint child that is not employer-based or union-based coverage.\n(a) An employer or union must forward the national medical support notice or court order to its health plan within 20 business days after the date on the national medical support notice or after receipt of the court order.\n(b) Upon determination by an employer's or union's health plan administrator that a joint child is eligible to be covered under the health plan, the employer or union and health plan must enroll the joint child as a beneficiary in the health plan, and the employer must withhold any required premiums from the income or wages of the party ordered to carry health care coverage for the joint child.\n(c) If enrollment of the party ordered to carry private health care coverage for a joint child is necessary to obtain dependent private health care coverage under the plan, and the party is not enrolled in the health plan, the employer or union must enroll the party in the plan.\n(d) Enrollment of dependents and, if necessary, the party ordered to carry private health care coverage for the joint child must be immediate and not dependent upon open enrollment periods. Enrollment is not subject to the underwriting policies under section 62A.048.\n(e) Failure of the party ordered to carry private health care coverage for the joint child to execute any documents necessary to enroll the dependent in the health plan does not affect the obligation of the employer or union and health plan to enroll the dependent in a plan. Information and authorization provided by the public authority, or by a party or guardian, is valid for the purposes of meeting enrollment requirements of the health plan.\n(f) An employer or union that is included under the federal Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1169(a), may not deny enrollment to the joint child or to the parent if necessary to enroll the joint child based on exclusionary clauses described in section 62A.048.\n(g) A new employer or union of a party who is ordered to provide private health care coverage for a joint child must enroll the joint child in the party's health plan as required by a national medical support notice or court order.\n(a) If a health plan administrator receives a completed national medical support notice or court order, the plan administrator must notify the parties, and the public authority if the public authority provides support enforcement services, within 40 business days after the date of the notice or after receipt of the court order, of the following:\n(1) whether health care coverage is available to the joint child under the terms of the health plan and, if not, the reason why health care coverage is not available;\n(2) whether the joint child is covered under the health plan;\n(3) the effective date of the joint child's coverage under the health plan; and\n(4) what steps, if any, are required to effectuate the joint child's coverage under the health plan.\n(b) If the employer or union offers more than one plan and the national medical support notice or court order does not specify the plan to be carried, the plan administrator must notify the parents and the public authority if the public authority provides support enforcement services. When there is more than one option available under the plan, the public authority, in consultation with the parent with whom the joint child resides, must promptly select from available plan options.\n(c) The plan administrator must provide the parents and public authority, if the public authority provides support enforcement services, with a notice of the joint child's enrollment, description of the health care coverage, and any documents necessary to effectuate coverage.\n(d) The health plan must send copies of all correspondence regarding the private health care coverage to the parents.\n(e) An insured joint child's parent's signature is a valid authorization to a health plan for purposes of processing an insurance reimbursement payment to the medical services provider or to the parent, if medical services have been prepaid by that parent.\n(a) An employer or union that willfully fails to comply with the order or notice is liable for any uninsured health-related expenses incurred by the dependents while the dependents were eligible to be enrolled in the health plan and for any other premium costs incurred because the employer or union willfully failed to comply with the order or notice.\n(b) An employer or union that fails to comply with the order or notice is subject to a contempt finding, a $250 civil penalty under section 518A.73, and is subject to a civil penalty of $500 to be paid to the party entitled to reimbursement or the public authority. Penalties paid to the public authority are designated for child support enforcement services.\n(a) A party may contest a joint child's enrollment in a health plan on the limited grounds that the enrollment is improper due to mistake of fact or that the enrollment meets the requirements of section 518.145.\n(b) If the party chooses to contest the enrollment, the party must do so no later than 15 days after the employer notifies the party of the enrollment by doing the following:\n(1) filing a motion in district court or according to section 484.702 and the expedited child support process rules if the public authority provides support enforcement services;\n(2) serving the motion on the other party and public authority if the public authority provides support enforcement services; and\n(3) securing a date for the matter to be heard no later than 45 days after the notice of enrollment.\n(c) The enrollment must remain in place while the party contests the enrollment.\n(a) Unless a court order provides otherwise, a child for whom a party is required to provide private health care coverage under this section must be covered as a dependent of the party until the child is emancipated, until further order of the court, or as consistent with the terms of the health care coverage.\n(b) The health carrier, employer, or union may not disenroll or eliminate health care coverage for the child unless:\n(1) the health carrier, employer, or union is provided satisfactory written evidence that the court order is no longer in effect;\n(2) the joint child is or will be enrolled in comparable private health care coverage through another health plan that will take effect no later than the effective date of the disenrollment;\n(3) the employee is no longer eligible for dependent health care coverage; or\n(4) the required premium has not been paid by or on behalf of the joint child.\n(c) The health plan must provide 30 days' written notice to the joint child's parents, and the public authority if the public authority provides support enforcement services, before the health plan disenrolls or eliminates the joint child's health care coverage.\n(d) A joint child enrolled in private health care coverage under a qualified medical child support order, including a national medical support notice, under this section is a dependent and a qualified beneficiary under the Consolidated Omnibus Budget and Reconciliation Act of 1985 (COBRA), Public Law 99-272. Upon expiration of the order, the joint child is entitled to the opportunity to elect continued health care coverage that is available under the health plan. The employer or union must provide notice to the parties and the public authority, if it provides support services, within ten days of the termination date.\n(e) If the public authority provides support enforcement services and a plan administrator reports to the public authority that there is more than one coverage option available under the health plan, the public authority, in consultation with the parent with whom the joint child resides, must promptly select health care coverage from the available options.\nThe court must require the parent with whom the joint child does not reside to provide dependent private health care coverage for the benefit of the parent with whom the joint child resides if the parent with whom the child does not reside is ordered to provide dependent private health care coverage for the parties' joint child and adding the other parent to the health care coverage results in no additional premium cost.\n(a) If the public authority provides support enforcement services, the parties must provide the public authority with the following information:\n(1) information relating to dependent health care coverage available for the benefit of the joint child for whom support is sought, including all information required to be included in a medical support order under this section;\n(2) verification that application for court-ordered health care coverage was made within 30 days of the court's order; and\n(3) the reason that a joint child is not enrolled in court-ordered health care coverage, if a joint child is not enrolled in health care coverage or subsequently loses health care coverage.\n(b) Upon request from the public authority under section 518A.83, an employer, union, or plan administrator, including an employer subject to the federal Employee Retirement Income Security Act of 1974 (ERISA), United States Code, title 29, section 1169(a), must provide the public authority the following information:\n(1) information relating to dependent private health care coverage available to a party for the benefit of the joint child for whom support is sought, including all information required to be included in a medical support order under this section; and\n(2) information that will enable the public authority to determine whether a health plan is appropriate for a joint child, including, but not limited to, all available plan options, any geographic service restrictions, and the location of service providers.\n(c) The employer, union, or plan administrator must not release information regarding one party to the other party. The employer, union, or plan administrator must provide both parties with insurance identification cards and all necessary written information to enable the parties to utilize the insurance benefits for the covered dependent.\n(d) The public authority is authorized to release to a party's employer, union, or health plan information necessary to verify availability of dependent private health care coverage, or to establish, modify, or enforce medical support.\n(e) An employee must disclose to an employer if medical support is required to be withheld under this section and the employer must begin withholding according to the terms of the order and under section 518A.53. If an employee discloses an obligation to obtain private health care coverage and health care coverage is available through the employer, the employer must make all application processes known to the individual and enroll the employee and dependent in the plan.\nThe public authority must take necessary steps to establish, enforce, and modify an order for medical support if the joint child receives public assistance or a party completes an application for services from the public authority under section 518A.51.\n(a) Remedies available for collecting and enforcing child support apply to medical support.\n(b) For the purpose of enforcement, the following are additional support:\n(1) the costs of individual or group health or hospitalization coverage;\n(2) dental coverage;\n(3) medical costs ordered by the court to be paid by either party, including health care coverage premiums paid by the obligee because of the obligor's failure to obtain health care coverage as ordered; and\n(4) liabilities established under this subdivision.\n(c) A party who fails to carry court-ordered dependent private health care coverage is liable for the joint child's uninsured health-related expenses unless a court order provides otherwise. A party's failure to carry court-ordered health care coverage, or to provide other medical support as ordered, is a basis for modification of medical support under section 518A.39, subdivision 8, unless it meets the presumption in section 518A.39, subdivision 2.\n(d) Payments by the health carrier or employer for services rendered to the dependents that are directed to a party not owed reimbursement must be endorsed over to and forwarded to the vendor or appropriate party or the public authority. A party retaining insurance reimbursement not owed to the party is liable for the amount of the reimbursement.\n(a) If a party is the parent with primary physical custody as defined in section 518A.26, subdivision 17, and is an obligor ordered to contribute to the other party's cost for carrying health care coverage for the joint child, the other party's child support and spousal maintenance obligations are subject to an offset under subdivision 5.\n(b) The public authority, if the public authority provides child support enforcement services, may remove the offset to a party's child support obligation when:\n(1) the party's court-ordered private health care coverage for the joint child terminates;\n(2) the party does not enroll the joint child in other private health care coverage; and\n(3) a modification motion is not pending.\nThe public authority must provide notice to the parties of the action. If neither party requests a hearing, the public authority must remove the offset effective the first day of the month following termination of the joint child's private health care coverage.\n(c) The public authority, if the public authority provides child support enforcement services, may resume the offset when the party ordered to provide private health care coverage for the joint child has resumed the court-ordered private health care coverage or enrolled the joint child in other private health care coverage. The public authority must provide notice to the parties of the action. If neither party requests a hearing, the public authority must resume the offset effective the first day of the month following certification that private health care coverage is in place for the joint child.\n(d) A party may contest the public authority's action to remove or resume the offset to the child support obligation if the party makes a written request for a hearing within 30 days after receiving written notice. If a party makes a timely request for a hearing, the public authority must schedule a hearing and send written notice of the hearing to the parties by mail to the parties' last known addresses at least 14 days before the hearing. The hearing must be conducted in district court or in the expedited child support process if section 484.702 applies. The district court or child support magistrate must determine whether removing or resuming the offset is appropriate and, if appropriate, the effective date for the removal or resumption.\n(a) If a party is the parent with primary physical custody, as defined in section 518A.26, subdivision 17, and is ordered to carry private health care coverage for the joint child but fails to carry the court-ordered private health care coverage, the public authority may suspend the medical support obligation of the other party if that party has been court-ordered to contribute to the cost of the private health care coverage carried by the parent with primary physical custody of the joint child.\n(b) If the public authority provides child support enforcement services, the public authority may suspend the other party's medical support contribution toward private health care coverage when:\n(1) the party's court-ordered private health care coverage for the joint child terminates;\n(2) the party does not enroll the joint child in other private health care coverage; and\n(3) a modification motion is not pending.\nThe public authority must provide notice to the parties of the action. If neither party requests a hearing, the public authority must remove the medical support contribution effective the first day of the month following the termination of the joint child's private health care coverage.\n(c) If the public authority provides child support enforcement services, the public authority may reinstate the medical support contribution when the party ordered to provide private health care coverage for the joint child has resumed the joint child's court-ordered private health care coverage or has enrolled the joint child in other private health care coverage. The public authority must provide notice to the parties of the action. If neither party requests a hearing, the public authority must resume the medical support contribution effective the first day of the month following certification that the joint child is enrolled in private health care coverage.\n(d) A party may contest the public authority's action to suspend or reinstate the medical support contribution if the party makes a written request for a hearing within 30 days after receiving written notice. If a party makes a timely request for a hearing, the public authority must schedule a hearing and send written notice of the hearing to the parties by mail to the parties' last known addresses at least 14 days before the hearing. The hearing must be conducted in district court or in the expedited child support process if section 484.702 applies. The district court or child support magistrate must determine whether suspending or reinstating the medical support contribution is appropriate and, if appropriate, the effective date of the removal or reinstatement of the medical support contribution.\n(a) This subdivision and subdivision 18 apply when a court order has determined and ordered the parties' proportionate share and responsibility to contribute to unreimbursed or uninsured health-related expenses.\n(b) A party requesting reimbursement of unreimbursed or uninsured health-related expenses must initiate a request to the other party within two years of the date that the requesting party incurred the unreimbursed or uninsured health-related expenses. If a court order has been signed ordering the contribution toward unreimbursed or uninsured expenses, a two-year limitations provision must be applied to any requests made on or after January 1, 2007. The provisions of this section apply retroactively to court orders signed before January 1, 2007. Requests for unreimbursed or uninsured expenses made on or after January 1, 2007, may include expenses incurred before January 1, 2007, and on or after January 1, 2005.\n(c) A requesting party must mail a written notice of intent to collect the unreimbursed or uninsured health-related expenses and a copy of an affidavit of health care expenses to the other party at the other party's last known address.\n(d) The written notice must include a statement that the other party has 30 days from the date the notice was mailed to (1) pay in full; (2) agree to a payment schedule; or (3) file a motion requesting a hearing to contest the amount due or to set a court-ordered monthly payment amount. If the public authority provides services, the written notice also must include a statement that, if the other party does not respond within the 30 days, the requesting party may submit the amount due to the public authority for collection.\n(e) The affidavit of health care expenses must itemize and document the joint child's unreimbursed or uninsured health-related expenses and include copies of all bills, receipts, and insurance company explanations of benefits.\n(f) If the other party does not respond to the request for reimbursement within 30 days, the requesting party may commence enforcement against the other party under subdivision 18; file a motion for a court-ordered monthly payment amount under paragraph (i); or notify the public authority, if the public authority provides services, that the other party has not responded.\n(g) The notice to the public authority must include: a copy of the written notice, a copy of the affidavit of health care expenses, and copies of all bills, receipts, and insurance company explanations of benefits.\n(h) If noticed under paragraph (f), the public authority must serve the other party with a notice of intent to enforce unreimbursed and uninsured health-related expenses and file an affidavit of service by mail with the district court administrator. The notice must state that the other party has 14 days to (1) pay in full; or (2) file a motion to contest the amount due or to set a court-ordered monthly payment amount. The notice must also state that if there is no response within 14 days, the public authority will commence enforcement of the expenses as arrears under subdivision 18.\n(i) To contest the amount due or set a court-ordered monthly payment amount, a party must file a timely motion and schedule a hearing in district court or in the expedited child support process if section 484.702 applies. The moving party must provide the other party and the public authority, if the public authority provides services, with written notice at least 14 days before the hearing by mailing notice of the hearing to the public authority and to the requesting party at the requesting party's last known address. The moving party must file the affidavit of health care expenses with the court at least five days before the hearing. The district court or child support magistrate must determine liability for the expenses and order that the liable party is subject to enforcement of the expenses as arrears under subdivision 18 or set a court-ordered monthly payment amount.\n(a) Unreimbursed or uninsured health-related expenses enforced under this subdivision are collected as arrears.\n(b) If the liable party is the parent with primary physical custody as defined in section 518A.26, subdivision 17, the unreimbursed or uninsured health-related expenses must be deducted from any arrears the requesting party owes the liable party. If unreimbursed or uninsured expenses remain after the deduction, the expenses must be collected as follows:\n(1) If the requesting party owes a current child support obligation to the liable party, 20 percent of each payment received from the requesting party must be returned to the requesting party. The total amount returned to the requesting party each month must not exceed 20 percent of the current monthly support obligation.\n(2) If the requesting party does not owe current child support or arrears, a payment agreement under section 518A.69 is required. If the liable party fails to enter into or comply with a payment agreement, the requesting party or the public authority, if the public authority provides services, may schedule a hearing to set a court-ordered payment. The requesting party or the public authority must provide the liable party with written notice of the hearing at least 14 days before the hearing.\n(c) If the liable party is not the parent with primary physical custody as defined in section 518A.26, subdivision 17, the unreimbursed or uninsured health-related expenses must be deducted from any arrears the requesting party owes the liable party. If unreimbursed or uninsured expenses remain after the deduction, the expenses must be added and collected as arrears owed by the liable party.",
	"repealed": false
}