{
	"id": "123A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.24",
	"title": "123A.24 WITHDRAWING FROM COOPERATIVE UNIT; APPEALING DENIAL OF MEMBERSHIP.",
	"text": "(a) If a district withdraws from a cooperative unit defined in subdivision 2, the distribution of assets and assignment of liabilities to the withdrawing district shall be determined according to this subdivision.\n(b) The withdrawing district remains responsible for its share of debt incurred by the cooperative unit according to section 123B.02, subdivision 3. The district and cooperative unit may mutually agree, through a board resolution by each, to terms and conditions of the distribution of assets and the assignment of liabilities.\n(c) If the cooperative unit and the district cannot agree on the terms and conditions, the commissioner shall resolve the dispute by determining the district's proportionate share of assets and liabilities based on the district's enrollment, financial contribution, usage, or other factor or combination of factors determined appropriate by the commissioner. If the dispute requires the commissioner to involve an administrative law judge, any fees due to the Office of Administrative Hearings must be equally split between the district and cooperative unit. The assets must be disbursed to the withdrawing district in a manner that minimizes financial disruption to the cooperative unit.\n(d) Assets related to an insurance pool shall not be disbursed to a member district under paragraph (c).\nFor the purposes of this section, a cooperative unit is:\n(1) an education district organized under sections 123A.15 to 123A.19;\n(2) a cooperative vocational center organized under section 123A.22;\n(3) an intermediate district organized under chapter 136D;\n(4) a service cooperative organized under section 123A.21;\n(5) a regional management information center organized under section 123A.23 or as a joint powers district according to section 471.59; or\n(6) a special education cooperative organized under section 471.59.\nIf a cooperative unit as defined in subdivision 2, denies membership in the unit to a district, the district may appeal to the commissioner. The commissioner may require the cooperative unit to grant the district membership.",
	"repealed": false
}