{
	"id": "273.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.125",
	"title": "273.125 ASSESSMENT OF MANUFACTURED HOMES.",
	"text": "Subdivisions 1 to 7 apply to manufactured homes that are assessed under subdivision 8, paragraph (c). Each manufactured home must be valued each year by the assessor and assessed with reference to its value on January 2 of that year. Notice of the value must be mailed to the person to be assessed at least ten days before the meeting of the local board of review or equalization. The notice must contain the amount of valuation in terms of market value, the assessor's office address, and the date, place, and time set for the meeting of the local board of review or equalization and the county board of equalization.\nOn or before May 1, the assessor shall return to the county auditor the assessment books relating to the assessment of manufactured homes. After receiving the assessment books, the county auditor shall determine the tax to be due by applying the rate of levy of the preceding year and shall send a list of the taxes to the county treasurer by May 30.\nNot later than July 15 in the year of assessment the county treasurer shall mail to the taxpayer a statement of tax due on a manufactured home. The taxes are due on the last day of August, or 20 days after the postmark date on the envelope containing the property tax statement, whichever is later, except that if the tax exceeds $50, one-half of the amount due may be paid on August 31, or 20 days after the postmark date on the envelope containing the property tax statement, whichever is later, and the remainder on November 15. Taxes remaining unpaid after the due date are delinquent, and a penalty of eight percent must be assessed and collected as part of the unpaid taxes. The tax statement must contain a sentence notifying the taxpayer that the title to the manufactured home cannot be transferred unless the property taxes are paid.\nA person who claims that the person's manufactured home has been unfairly or unequally assessed, or that the property has been assessed at a valuation greater than its real or actual value, or that the tax levied against it is illegal, in whole or in part, or has been paid, or that the property is exempt from the tax so levied, may have the validity of the claim, defense, or objection determined in court. The determination must be made by the district court of the county in which the tax is levied or by the Tax Court. A person can request the determination by filing a petition for it in the office of the court administrator of the district court on or before October 1 of the year in which the tax becomes payable. A petition for determination under this section may be transferred by the district court to the Tax Court.\nThe right to continue prosecution of the petition is conditioned upon the payment of the tax when due unless the court permits the petitioner to continue without payment, or with a reduced payment, under section 278.03, subdivision 2. Upon ten days' notice to the county attorney and to the county auditor, given at least ten days before the last day of August, the petitioner may apply to the court for permission to continue prosecution of the petition without payment or with a reduced payment.\nIf the local board of review or equalization or the county board of equalization changes the assessor's valuation of a manufactured home, the change must be sent to the county auditor. The auditor shall immediately recompute the tax and advise the treasurer of the corrected tax. If the property is entitled to homestead classification, the auditor shall reduce the tax accordingly.\nThe tax assessed on manufactured homes is a personal property tax. Laws relating to assessment, review, and collection of personal property taxes apply to this tax, if consistent with this section.\n(a) In this section, \"manufactured home\" means a structure transportable in one or more sections, which is built on a permanent chassis, and designed to be used as a dwelling with or without a permanent foundation when connected to the required utilities, and contains the plumbing, heating, air conditioning, and electrical systems in it. Manufactured home includes any accessory structure that is an addition or supplement to the manufactured home and, when installed, becomes a part of the manufactured home.\n(b) Except as provided in paragraph (c), a manufactured home that meets each of the following criteria must be valued and assessed as an improvement to real property, the appropriate real property classification applies, and the valuation is subject to review and the taxes payable in the manner provided for real property:\n(1) the title to the land on which it is situated is held by: (i) the owner of the unit; or (ii) a Minnesota nonprofit corporation or a Minnesota cooperative to which the owner is a member;\n(2) the unit is affixed to the land by a permanent foundation or is installed at its location in accordance with the Manufactured Home Building Code in sections 327.31 to 327.34, and rules adopted under those sections, or is affixed to the land like other real property in the taxing district; and\n(3) the unit is connected to public utilities, has a well and septic tank system, or is serviced by water and sewer facilities comparable to other real property in the taxing district.\n(c) A manufactured home that meets each of the following criteria must be assessed at the rate provided by the appropriate real property classification but must be treated as personal property, and the valuation is subject to review and the taxes payable in the manner provided in this section:\n(1) the owner of the unit is a lessee of the land under the terms of a lease, or the unit is located in a manufactured home park but is not the homestead of the park owner;\n(2) the unit is affixed to the land by a permanent foundation or is installed at its location in accordance with the Manufactured Home Building Code contained in sections 327.31 to 327.34, and the rules adopted under those sections, or is affixed to the land like other real property in the taxing district; and\n(3) the unit is connected to public utilities, has a well and septic tank system, or is serviced by water and sewer facilities comparable to other real property in the taxing district.\n(d) Sectional structures must be valued and assessed as an improvement to real property if the owner of the structure holds title to the land on which it is located or is a qualifying lessee of the land under section 273.19. In this paragraph \"sectional structure\" means a building or structural unit that has been in whole or substantial part manufactured or constructed at an off-site location to be wholly or partially assembled on site alone or with other units and attached to a permanent foundation.\n(e) The commissioner of revenue may adopt rules under the Administrative Procedure Act to establish additional criteria for the classification of manufactured homes and sectional structures under this subdivision.\n(f) A storage shed, deck, or similar improvement constructed on property that is leased or rented as a site for a manufactured home, sectional structure, park trailer, or travel trailer is taxable as provided in this section. In the case of property that is leased or rented as a site for a travel trailer, a storage shed, deck, or similar improvement on the site that is considered personal property under this paragraph is taxable only if its total estimated market value is over $10,000. The property is taxable as personal property to the lessee of the site if it is not owned by the owner of the site. The property is taxable as real estate if it is owned by the owner of the site. As a condition of permitting the owner of the manufactured home, sectional structure, park trailer, or travel trailer to construct improvements on the leased or rented site, the owner of the site must obtain the permanent home address of the lessee or user of the site. The site owner must provide the name and address to the assessor upon request.",
	"repealed": false
}