{
	"id": "136A.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.031",
	"title": "136A.031 STUDENT ADVISORY COUNCIL.",
	"text": "[Repealed, 2005 c 107 art 2 s 61]\n[Repealed, 2013 c 99 art 2 s 30]\n(a) A Student Advisory Council (SAC) to the office is established. The members of SAC shall include: the chair of the University of Minnesota student senate; the state chair of the Minnesota State University Student Association; the president of the Minnesota State College Student Association and an officer of the Minnesota State College Student Association, one in a community college course of study and one in a technical college course of study; a student who is enrolled in a private nonprofit postsecondary institution, to be elected by students enrolled in Minnesota Private College Council institutions; a student who is enrolled in a private career school, to be elected by students enrolled in Minnesota private career schools; and a student who is enrolled in a Minnesota tribal college to be elected by students enrolled in Minnesota tribal colleges. If students from the private career schools or tribal colleges do not elect a representative, the commissioner must appoint a student representative. If students from the Minnesota Private College Council institutions do not elect a representative, the Minnesota Private College Council must appoint the private nonprofit representative. A member may be represented by a student designee who attends an institution from the same system that the absent member represents. The SAC shall select one of its members to serve as chair.\n(b) The office shall inform the SAC of all matters related to student issues under consideration. The SAC shall report to the office quarterly and at other times that the SAC considers desirable. The SAC shall determine its meeting times, but it shall also meet with the office within 30 days after the commissioner's request for a meeting.\n(c) The SAC shall:\n(1) bring to the attention of the office any matter that the SAC believes needs the attention of the office;\n(2) fulfill the requirements under section 135A.137, subdivision 2;\n(3) make recommendations to the office as it finds appropriate; and\n(4) approve student appointments by the office for each advisory group as provided in subdivision 4.\nThe commissioner shall invite the council to nominate a student or students to serve on task forces created by the office, when appropriate.\n[Repealed, 2014 c 286 art 8 s 40]",
	"repealed": false
}