{
	"id": "290.0682",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0682",
	"title": "290.0682 STUDENT LOAN CREDIT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Adjusted gross income\" means federal adjusted gross income as defined in section 62 of the Internal Revenue Code.\n(c) \"Earned income\" has the meaning given in section 290.0675, subdivision 1, paragraph (b).\n(d) \"Eligible individual\" means a resident individual with one or more qualified education loans related to an undergraduate or graduate degree program at a postsecondary educational institution.\n(e) \"Eligible loan payments\" means the amount the eligible individual paid during the taxable year in principal and interest on qualified education loans.\n(f) \"Postsecondary educational institution\" means a public or nonprofit postsecondary institution eligible for state student aid under section 136A.103 or, if the institution is not located in this state, a public or nonprofit postsecondary institution participating in the federal Pell Grant program under title IV of the Higher Education Act of 1965, Public Law 89-329, as amended.\n(g) \"Qualified education loan\" has the meaning given in section 221 of the Internal Revenue Code, but is limited to indebtedness incurred on behalf of the eligible individual.\n(a) An eligible individual is allowed a credit against the tax due under this chapter.\n(b) The credit for an eligible individual equals the least of:\n(1) eligible loan payments minus ten percent of an amount equal to adjusted gross income in excess of $10,000, but in no case less than zero;\n(2) the earned income for the taxable year of the eligible individual, if any;\n(3) the sum of:\n(i) the interest portion of eligible loan payments made during the taxable year; and\n(ii) ten percent of the original loan amount of all qualified education loans of the eligible individual; or\n(4) $500.\n(c) For a part-year resident, the credit must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\n(d) In the case of a married couple, each spouse is eligible for the credit in this section. For the purposes of paragraph (b), for married taxpayers filing joint returns, each spouse's adjusted gross income equals the spouse's percentage share of the couple's earned income, multiplied by the couple's combined adjusted gross income.",
	"repealed": false
}