{
	"id": "518.179",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.179",
	"title": "518.179 PARTICIPATION IN CUSTODY OR PARENTING TIME WHEN PERSON CONVICTED OF CERTAIN OFFENSES.",
	"text": "Notwithstanding any contrary provision in section 518.17 or 518.175, if a person seeking child custody or parenting time has been convicted of a crime described in subdivision 2, the person seeking custody or parenting time has the burden to prove that custody or parenting time by that person is in the best interests of the child if:\n(1) the conviction occurred within the preceding five years;\n(2) the person is currently incarcerated, on probation, or under supervised release for the offense; or\n(3) the victim of the crime was a family or household member as defined in section 518B.01, subdivision 2.\nIf this section applies, the court may not grant custody or parenting time to the person unless it finds that the custody or parenting time is in the best interests of the child. If the victim of the crime was a family or household member, the standard of proof is clear and convincing evidence. A guardian ad litem must be appointed in any case where this section applies.\nThis section applies to the following crimes or similar crimes under the laws of the United States, or any other state:\n(1) murder in the first, second, or third degree under section 609.185, 609.19, or 609.195;\n(2) manslaughter in the first degree under section 609.20;\n(3) assault in the first, second, or third degree under section 609.221, 609.222, or 609.223;\n(4) kidnapping under section 609.25;\n(5) depriving another of custodial or parental rights under section 609.26;\n(6) soliciting, inducing, promoting, or receiving profit derived from prostitution involving a minor under section 609.322;\n(7) criminal sexual conduct in the first degree under section 609.342;\n(8) criminal sexual conduct in the second degree under section 609.343;\n(9) criminal sexual conduct in the third degree under section 609.344, subdivision 1, clause (a) or (c), or subdivision 1a, clause (f) or (g);\n(10) solicitation of a child to engage in sexual conduct under section 609.352;\n(11) incest under section 609.365;\n(12) malicious punishment of a child under section 609.377;\n(13) neglect of a child under section 609.378;\n(14) terroristic threats under section 609.713;\n(15) felony harassment under section 609.749, subdivision 4; or\n(16) domestic assault by strangulation under section 609.2247.",
	"repealed": false
}