{
	"id": "257.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.62",
	"title": "257.62 BLOOD AND GENETIC TESTS.",
	"text": "(a) The court or public authority may, and upon request of a party shall, require the child, mother, or alleged father to submit to blood or genetic tests. A mother or alleged father requesting the tests shall file with the court an affidavit either alleging or denying paternity and setting forth facts that establish the reasonable possibility that there was, or was not, the requisite sexual contact between the parties.\n(b) A copy of the test results must be served on each party by first class mail to the party's last known address. Any objection to the results of blood or genetic tests must be made in writing no later than 30 days after service of the results. Test results served upon a party must include notice of this right to object.\n(c) If the alleged father is dead, the court may, and upon request of a party shall, require the decedent's parents or brothers and sisters or both to submit to blood or genetic tests. However, in a case involving these relatives of an alleged father, who is deceased, the court may refuse to order blood or genetic tests if the court makes an express finding that submitting to the tests presents a danger to the health of one or more of these relatives that outweighs the child's interest in having the tests performed. Unless the person gives consent to the use, the results of any blood or genetic tests of the decedent's parents, brothers, or sisters may be used only to establish the right of the child to public assistance including but not limited to Social Security and veterans' benefits. The tests shall be performed by a qualified expert appointed by the court.\nUnless otherwise agreed by the parties, a party wanting additional testing must first contest the original tests in subdivision 1, paragraph (b), and must pay in advance for the additional testing. The additional testing must be performed by another qualified expert.\nIn all cases, the court shall determine the number and qualifications of the experts.\n[Repealed, 1985 c 131 s 15]\n(a) If the results of blood or genetic tests completed in a laboratory accredited by the American Association of Blood Banks indicate that the likelihood of the alleged father's paternity, calculated with a prior probability of no more than 0.5 (50 percent), is 92 percent or greater, upon motion the court shall order the alleged father to pay temporary child support determined according to chapter 518A. The alleged father shall pay the support money to the public authority if the public authority is a party and is providing services to the parties or, if not, into court pursuant to the Rules of Civil Procedure to await the results of the paternity proceedings.\n(b) If the results of blood or genetic tests completed in a laboratory accredited by the American Association of Blood Banks indicate that likelihood of the alleged father's paternity, calculated with a prior probability of no more than 0.5 (50 percent), is 99 percent or greater, there is an evidentiary presumption that the alleged father is the biological father and the party opposing the establishment of the alleged father's paternity has the burden of proving by clear and convincing evidence that the alleged father is not the father of the child.\n(c) A determination under this subdivision that the alleged father is the biological father does not preclude the adjudication of another man as the legal father under section 257.55, subdivision 2, nor does it allow the donor of genetic material for assisted reproduction for the benefit of a recipient parent, whether sperm or ovum (egg), to claim to be the child's biological or legal parent.\nIn any hearing brought under subdivision 5, a certified report of the facts and results of a laboratory analysis or examination of blood or genetic tests, that is performed in a laboratory accredited to meet the Standards for Parentage Testing of the American Association of Blood Banks and is prepared and attested by a qualified expert appointed by the court, shall be admissible in evidence without proof of the seal, signature, or official character of the person whose name is signed to it. If no objection is made, the blood or genetic test results are admissible as evidence without the need for foundation testimony or other proof of authenticity or accuracy.",
	"repealed": false
}