{
	"id": "367.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/367.36",
	"title": "367.36 CLERK, TREASURER COMBINED; AUDIT STANDARDS.",
	"text": "(a) In a town in which option D is adopted, the incumbent treasurer shall continue in office until the expiration of the term. Thereafter, or at any time a vacancy other than a temporary vacancy under section 367.03 occurs in the position, the duties of the treasurer prescribed by law shall be performed by the clerk who shall be referred to as the clerk-treasurer. If option D is adopted at an election in which the treasurer is also elected, the election of the treasurer's position is void.\n(b) If the offices of clerk and treasurer are combined and the town's annual revenue is more than the amount in paragraph (c), the town board shall provide for an annual audit of the town's financial affairs by the state auditor or a public accountant in accordance with minimum audit procedures prescribed by the state auditor. If the offices of clerk and treasurer are combined and the town's annual revenue is the amount in paragraph (c) or less, the town board shall provide for an audit of the town's financial affairs by the state auditor or a public accountant in accordance with minimum audit procedures prescribed by the state auditor at least once every five years, which audit shall be for a one-year period to be determined at random by the person conducting the audit. Upon completion of an audit by a public accountant, the public accountant shall forward a copy of the audit to the state auditor. For purposes of this subdivision, \"public accountant\" means a certified public accountant or a certified public accounting firm licensed in accordance with chapter 326A.\n(c) For the purposes of paragraph (b), the amount in 2004 is $150,000, and in 2005 and after, $150,000 adjusted for inflation using the annual implicit price deflator for state and local expenditures as published by the United States Department of Commerce.\nIf option D is abandoned, the office of treasurer that would be filled at that election shall be filled conditionally at that election, and the ballot shall indicate that the candidate shall assume office only if the option is abandoned as a result of the election.",
	"repealed": false
}