{
	"id": "471.6175",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.6175",
	"title": "471.6175 TRUST FOR POSTEMPLOYMENT BENEFITS.",
	"text": "A political subdivision or other public entity that creates or has created an actuarial liability to pay postemployment benefits to employees or officers after their termination of service may establish a trust to pay those benefits. For purposes of this section, the term \"postemployment benefits\" means benefits giving rise to a liability under Statement No. 45 of the Governmental Accounting Standards Board and the term \"trust\" means a trust, a trust account, or a custodial account or contract authorized under section 401(f) of the Internal Revenue Code.\nThe trust established under this section may only be used to pay postemployment benefits and may be either revocable or irrevocable.\nThe trust administrator of a trust established under this section shall be either:\n(1) the Public Employees Retirement Association;\n(2) a bank or banking association incorporated under the laws of the United States or of any state and authorized by the laws under which it is organized to exercise corporate trust powers; or\n(3) an insurance company or agency qualified to do business in Minnesota which has at least five years' experience in investment products and services for group retirement benefits and which has a specialized department dedicated to services for retirement investment products.\nA political subdivision or public entity may, in its discretion and in compliance with any applicable trust document, change trust administrators and transfer trust assets accordingly.\n(a) A political subdivision or other public entity may establish a trust account to be held under the supervision of the trust administrator for the purposes of this section. A trust administrator shall establish a separate account for each participating political subdivision or public entity. The trust administrator may charge participating political subdivisions and public entities fees for reasonable administrative costs. The amount of any fees charged by the Public Employees Retirement Association is appropriated to the association from the account. A trust administrator may establish other reasonable terms and conditions for creation and maintenance of these accounts.\n(b) The trust administrator must report to the political subdivision or other public entity on the investment returns of invested trust assets and on all investment fees or costs incurred by the trust.\n(c) Annually, no later than October 25, each trust administrator shall report electronically to the state auditor based upon a fiscal year end of June 30. The report must contain, in the manner prescribed by the state auditor, the:\n(1) market value;\n(2) contributions and withdrawals made by the public entity;\n(3) time-weighted annual rates of return net of all costs and fees; and\n(4) all investment management and plan administrative fees and costs for the trust for the year.\nThe trust administrator shall certify that the information provided in the report is true and correct, and shall certify that the procedures used to compute rates of return are consistent with the measurement and presentation standards set by the CFA Institute.\n(a) The assets of a trust or trust account shall be invested and held as stipulated in paragraphs (b) to (e).\n(b) The Public Employees Retirement Association must certify all money in the trust accounts for which it is trust administrator to the State Board of Investment for investment under section 11A.14, subject to the policies and procedures established by the State Board of Investment. Investment earnings must be credited to the trust account of the individual political subdivision or public entity.\n(c) A trust administrator, other than the Public Employees Retirement Association, must ensure that all money in the trust accounts for which it is trust administrator is invested by a registered investment adviser, a bank investment trust department, or an insurance company or agency retirement investment department. Investment earnings must be credited to the trust account of the individual political subdivision or public entity.\n(d) For trust assets invested by the State Board of Investment, the investment restrictions shall be the same as those generally applicable to the State Board of Investment. For trust assets invested by a trust administrator other than the Public Employees Retirement Association, the assets may only be invested in investments authorized under chapter 118A or section 356A.06, subdivision 7, in the manner specified in the applicable trust document.\n(e) A political subdivision or public entity may provide investment direction to a trust administrator in compliance with any applicable trust document.\nA political subdivision or public entity may not deposit money in a trust or trust account created pursuant to this section if the total amount invested by that political subdivision or public entity would exceed the political subdivision's or public entity's actuarially determined liabilities for postemployment benefits due to officers and employees, as determined under the applicable standards of the Governmental Accounting Standards Board.\n(a) For a revocable account, a political subdivision or public entity may withdraw some or all of its money or terminate the trust account. Money and accrued investment earnings withdrawn from a revocable account must be deposited in a fund separate and distinct from any other funds of the political subdivision or public entity. This money, with accrued investment earnings, must be used to pay legally enforceable postemployment benefits to former officers and employees, unless (i) there has been a change in state or federal law affecting that political subdivision's or public entity's liabilities for postemployment benefits, or (ii) there has been a change in the demographic composition of that political subdivision's or public entity's employees eligible for postemployment benefits, or (iii) there has been a change in the provisions or terms of the postemployment benefits in that political subdivision or public entity including, but not limited to, the portion of the costs eligible employees must pay to receive the benefits, or (iv) other factors exist that have a material effect on that political subdivision's or public entity's actuarially determined liabilities for postemployment benefits, in which event any amount in excess of 100 percent of that political subdivision's or public entity's actuarially determined liabilities for postemployment benefits, as determined under standards of the Government Accounting Standards Board, may be withdrawn and used for any purpose.\n(b) For an irrevocable account, a political subdivision or public entity may withdraw money only:\n(1) as needed to pay postemployment benefits owed to former officers and employees of the political subdivision or public entity; or\n(2) when all postemployment benefit liability owed to former officers or employees of the political subdivision or public entity has been satisfied or otherwise defeased.\n(c) A political subdivision or public entity requesting withdrawal of money from an account created under this section must do so at a time and in the manner required by the executive director of the Public Employees Retirement Association or specified in an applicable trust document. The political subdivision or public entity that created the trust must ensure that withdrawals comply with the requirements of this section.\n(d) The legislature may not divert funds in these trusts or trust accounts for use for another purpose.\n(a) All money in an irrevocable trust or trust account created in this section is held in trust for the exclusive benefit of former officers and employees of the participating political subdivision or public entity, and is not subject to claims by creditors of the state, the participating political subdivision or public entity, the current or former officers and employees of the political subdivision or public entity, or the trust administrator.\n(b) An irrevocable trust fund or trust account created in this section shall be deemed an arrangement equivalent to a trust for all legal purposes.",
	"repealed": false
}