{
	"id": "103G.299",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.299",
	"title": "103G.299 ADMINISTRATIVE PENALTIES.",
	"text": "(a) As provided in paragraph (b), the commissioner may issue an order requiring violations to be corrected and administratively assessing monetary penalties for violations of sections 103G.271 and 103G.275, and any rules adopted under those sections.\n(b) An order under this section may be issued to a person for water appropriation activities without a required permit or for violating the terms of a required permit.\n(c) The order must be issued as provided in this section and in accordance with the plan prepared under subdivision 12.\n(a) The commissioner may issue orders assessing administrative penalties up to $40,000.\n(b) In determining the amount of a penalty the commissioner may consider:\n(1) the gravity of the violation, including potential for, or real, damage to the public interest or natural resources of the state;\n(2) the history of past violations;\n(3) the number of violations;\n(4) the economic benefit gained by the person by allowing or committing the violation based on data from local or state bureaus or educational institutions; and\n(5) other factors as justice may require, if the commissioner specifically identifies the additional factors in the commissioner's order.\n(c) For a violation after an initial violation, including a continuation of the initial violation, the commissioner must, in determining the amount of a penalty, consider the factors in paragraph (b) and the:\n(1) similarity of the most recent previous violation and the violation to be penalized;\n(2) time elapsed since the last violation;\n(3) number of previous violations; and\n(4) response of the person to the most recent previous violation identified.\nAn order assessing an administrative penalty under this section must include:\n(1) a concise statement of the facts alleged to constitute a violation;\n(2) a reference to the section of the statute, rule, order, or term or condition of a permit that has been violated;\n(3) a statement of the amount of the administrative penalty to be imposed and the factors upon which the penalty is based; and\n(4) a statement of the person's right to review of the order.\n(a) The commissioner may issue an order assessing a penalty and requiring the violations cited in the order to be corrected within a time period specified by the commissioner.\n(b) The person to whom the order was issued must provide information to the commissioner before the 31st day after the order was received demonstrating that the violation has been corrected or that appropriate steps toward correcting the violation have been taken.\n(c) The commissioner must determine whether the violation has been corrected and notify the person subject to the order of the commissioner's determination.\n(a) Except as provided in paragraph (b), if the commissioner determines that the violation has been corrected or appropriate steps have been taken to correct the action, the penalty must be forgiven. Unless the person requests review of the order under subdivision 6 or 7 before the penalty is due, the penalty in the order is due and payable:\n(1) on the 31st day after the order was received, if the person subject to the order fails to provide information to the commissioner showing that the violation has been corrected or that appropriate steps have been taken toward correcting the violation; or\n(2) on the 20th day after the person receives the commissioner's determination under subdivision 4, paragraph (c), if the person subject to the order has provided information to the commissioner that the commissioner determines is not sufficient to show that the violation has been corrected or that appropriate steps have been taken toward correcting the violation.\n(b) For repeated or serious violations, the commissioner may issue an order with a penalty that is not forgiven after the corrective action is taken. The penalty is due 31 days after the order is received, unless review of the order under subdivision 6 or 7 is sought.\n(c) Interest at the rate established in section 549.09 begins to accrue on penalties under this subdivision on the 31st day after the order with the penalty is received.\n(a) Within 30 days after receiving an order or within 20 days after receiving notice that the commissioner has determined that a violation has not been corrected or appropriate steps have not been taken, the person subject to an order under this section may request an expedited hearing, using the procedures under Minnesota Rules, parts 1400.8510 to 1400.8612, to review the commissioner's determination. The hearing request must specifically state the reasons for seeking review of the order. The person to whom the order is directed and the commissioner are the parties to the expedited hearing. The commissioner must notify the person to whom the order is directed of the time and place of the hearing at least 20 days before the hearing. The expedited hearing must be held within 30 days after a request for hearing has been filed with the commissioner unless the parties agree to a later date.\n(b) All written arguments must be submitted within ten days following the close of the hearing. The hearing must be conducted under Minnesota Rules, parts 1400.8510 to 1400.8612, as modified by this subdivision.\n(c) The administrative law judge must issue a report making recommendations about the commissioner's action to the commissioner within 30 days following the close of the record. The administrative law judge may not recommend a change in the amount of the proposed penalty unless the administrative law judge determines that, based on the factors in subdivision 2, the amount of the penalty is unreasonable.\n(d) If the administrative law judge makes a finding that the hearing was requested solely for purposes of delay or that the hearing request was frivolous, the commissioner may add to the amount of the penalty the costs charged to the department by the Office of Administrative Hearings for the hearing.\n(e) If a hearing has been held, the commissioner may not issue a final order until at least five days after receipt of the report of the administrative law judge. The person to whom an order is issued may, within those five days, comment to the commissioner on the recommendations, and the commissioner must consider the comments. The final order may be appealed in the manner provided in sections 14.63 to 14.69.\n(f) If a hearing has been held and a final order issued by the commissioner, the penalty must be paid by 30 days after the date the final order is received unless review of the final order is requested under sections 14.63 to 14.69. If review is not requested or the order is reviewed and upheld, the amount due is the penalty, together with interest accruing from 31 days after the original order was received at the rate established in section 549.09.\nIn addition to review under subdivision 6, the commissioner may enter into mediation concerning an order issued under this section if the commissioner and the person to whom the order is issued both agree to mediation.\nThe commissioner may enforce penalties that are due and payable under this section in any manner provided by law for the collection of debts.\nIf a person fails to pay a penalty owed under this section, the commissioner has grounds to revoke a permit or to refuse to amend a permit or issue a new permit.\nThe authority of the commissioner to issue a corrective order assessing penalties is in addition to other remedies available under statutory or common law. The payment of a penalty does not preclude the use of other enforcement provisions in connection with the violation for which the penalty was assessed.\nFees collected under this section must be credited to the water management account in the natural resources fund.\nThe commissioner must prepare a plan for using the administrative penalty authority in this section. The plan must include explanations for how the commissioner will determine whether violations are minor, moderate, or severe. The commissioner must provide a 30-day period for public comment on the plan. The plan must be finalized within six months after July 1, 2014.",
	"repealed": false
}