{
	"id": "345.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/345.72",
	"title": "345.72 ACQUIRING TITLE TO ABANDONED PROPERTY.",
	"text": "Property loaned to a museum or archives repository whose loan has an expiration date is abandoned when there has not been written contact between the owner and the museum or archives repository for at least seven years after that expiration date. If the loan has no expiration date, the property is abandoned when there has not been written contact between the owner and the museum or archives repository for at least seven years after the museum or archives repository took possession of the property.\n(a) If a museum or archives repository wishes to acquire title to abandoned property, the museum or archives repository shall, not less than 60 days after property is abandoned under subdivision 1, send a notice by certified mail with return receipt requested to the owner's last known address. The notice shall contain all of the following:\n(1) a statement that the loan is terminated and that the property is abandoned;\n(2) a description of the property;\n(3) a statement that the museum or archives repository will become the owner of the property if the present owner does not submit a written claim to the property to the museum or archives repository within 60 days after receipt of the notice; and\n(4) a statement that the museum or archives repository will make arrangements with the owner to return the property to the owner or dispose of the property as the owner requests if the owner submits a written claim to the property to the museum or archives repository within 60 days after receipt of the notice.\n(b) The notice in paragraph (a) shall be substantially in the following form:\nPlease be advised that the loan agreement is terminated for the following property (describe the property in sufficient detail to identify the property):\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nThe above described property that you loaned to .... (name and address of museum or archives repository) will be considered abandoned by you and will become the property of ..... (name of museum or archives repository) if you fail to submit to the museum or archives repository a written claim to the property within 60 days after receipt of this notice.\nIf you do submit a written claim to the property within 60 days after receipt of this notice, ..... (name of museum or archives repository) will arrange to return the property to you or dispose of the property as you request. The cost of returning the property to you or disposing of the property is your responsibility unless you have made other arrangements with the museum or archives repository.\nIf the notice sent by the museum or archives repository under subdivision 2 is returned to the museum or archives repository undelivered, the museum or archives repository shall give notice of the abandoned property by publication, and the organization's website, if applicable, containing the following:\n(1) the name and last known address of the present owner;\n(2) a description of the property;\n(3) a statement that the property is abandoned and that the museum or archives repository will become the owner of the property if no person can prove their ownership of the property;\n(4) a statement that a person claiming ownership of the property shall notify the museum or archives repository in writing of that claim within 60 days after publication of the last legal notice; and\n(5) the name and mailing address of the person who may be contacted at the museum or archives repository if a person wants to submit a written claim to the property.\n(a) If the museum or archives repository receives a timely written claim for the property from the owner or the owner's agent in response to the notice sent under subdivision 2 or 3, the museum or archives repository shall return the property to the owner or dispose of the property as the owner requests. The owner shall advise the museum or archives repository in writing as to how the property shall be disposed of or returned to the owner. Costs of returning the property or disposing of the property shall be the responsibility of the owner unless the owner and the museum or archives repository have made other arrangements.\n(b) If the museum or archives repository receives a timely written claim for the property from a person other than the person who loaned the property to the museum or archives repository in response to the notice sent under subdivision 2 or 3, the museum or archives repository shall, within 60 days after receipt of the written claim, determine if the claim is valid. A claimant shall submit proof of ownership with the claim. If more than one person submits a timely written claim, the museum or archives repository may delay its determination of ownership until the competing claims are resolved by agreement or legal action. If the museum or archives repository determines that the claim is valid, or if the competing claims are resolved by agreement or judicial action, the museum or archives repository shall return the property to the claimant submitting the valid claim or dispose of the property as the valid claimant requests. Costs of returning the property or disposing of the property shall be the responsibility of the valid claimant.\n(c) If the museum or archives repository does not receive a timely written claim to the property or if the museum or archives repository determines that no valid timely claim to the property was submitted, the museum or archives repository becomes the owner of the property. The museum or archives repository becomes the owner of the property on the day after the period for submitting a written claim ends or on the day after the museum or archives repository determines that no valid timely written claim was submitted. The museum or archives repository owns the property free from all claims.",
	"repealed": false
}