{
	"id": "123A.443",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.443",
	"title": "123A.443 GRANT APPLICATION PROCESS.",
	"text": "Any group of districts or a consolidated district that meets the criteria required under subdivision 2 may apply for an incentive grant for construction of a new facility or for remodeling and improving an existing facility. A grant for new construction must not exceed the lesser of $20,000,000, or 75 percent of the approved construction costs of a cooperative education facility. A grant for remodeling and improving an existing facility must not exceed the lesser of $10,000,000, or 75 percent of the approved remodeling costs.\n(a) A group of districts or a consolidated district that submits an application for a grant must submit a proposal to the commissioner for review and comment under section 123B.71. The commissioner shall prepare a review and comment on the proposed facility by July 1 of an odd-numbered year, regardless of the amount of the capital expenditure required to acquire, construct, remodel or improve the facility. The commissioner shall not approve an application for an incentive grant for any facility unless the facility receives a favorable review and comment under section 123B.71 and the following criteria are met:\n(1) the applicant is a consolidated district or a minimum of two or more districts that have entered into a joint powers agreement;\n(2) for a group of districts, a joint powers board representing all participating districts is established under section 471.59 to govern the cooperative facility;\n(3) for a group of districts, no more than one superintendent is employed by the joint powers board as a result of the cooperative facility agreement;\n(4) a statement of need is submitted, that may include reasons why the current facilities are inadequate, unsafe, or inaccessible to persons with disabilities;\n(5) an educational plan is prepared, that includes input from both community and professional staff;\n(6) for a group of districts, a combined seniority list for all participating districts is developed by the joint powers board;\n(7) for a group of districts, an education program is developed that provides for more learning opportunities and course offerings, including the offering of advanced placement courses, for students than is currently available in any single member district;\n(8) a plan is developed for providing instruction of any resident students in other districts when distance to the education facility makes attendance at the facility unreasonably difficult or impractical; and\n(9) for a secondary facility, the joint powers board established under clause (2) discusses with technical colleges located in the area how vocational education space in the cooperative facility could be jointly used for secondary and postsecondary purposes.\n(b) To the extent possible, the joint powers board is encouraged to provide for severance pay or for early retirement incentives under section 122A.48, for any teacher or administrator, as defined under section 122A.40, subdivision 1, who is placed on unrequested leave as a result of the cooperative facility agreement.\n(c) For the purpose of paragraph (a), clause (6), each district must be considered to have started school each year on the same date.\n(d) The districts may develop a plan that provides for the location of social service, health, and other programs serving pupils and community residents within the cooperative facility. The commissioner shall consider this plan when preparing a review and comment on the proposed facility.\n(e) The districts must schedule and conduct a meeting on library services. The school districts, in cooperation with the regional public library system and its appropriate member libraries, must discuss the possibility of including jointly operated library services at the cooperative facility.\n(f) The board of a district that has reorganized under section 123A.37 or 123A.48 and that is applying for a grant for remodeling or improving an existing facility may act in the place of a joint powers board to meet the criteria of this subdivision.\nA district that is a member of a joint powers board established under subdivision 2 and that is planning to reorganize under section 123A.45, 123A.46, or 123A.48 must notify the joint powers board one year in advance of the effective date of the reorganization. Notwithstanding section 471.59 or any other law to the contrary, the board of a district that reorganizes under section 123A.45, 123A.46, or 123A.48 may appoint representatives to the joint powers board who will serve on the joint powers board for two years after the effective date of the reorganization if authorized in the agreement establishing the joint powers board to govern the cooperative facility. These representatives shall have the same powers as representatives of any other school district under the joint powers agreement.\nA joint powers board of a district established under subdivision 2 or a school board of a reorganized district that intends to apply for a grant must adopt a resolution stating the proposed costs of the project, the purpose for which the costs are to be incurred, and an estimate of the dates when the facilities for which the grant is requested will be contracted for and completed. Applications for the state grants must be accompanied by (a) a copy of the resolution, (b) a certificate by the clerk and treasurer of the joint powers board showing the current outstanding indebtedness of each member district, and (c) a certificate by the county auditor of each county in which a portion of the joint powers district lies showing the information in the auditor's official records that is required to be used in computing the debt limit of the district under section 475.53, subdivision 4. The clerk's and treasurer's certificate must show, as to each outstanding bond issue of each member district, the amount originally issued, the purpose for which issued, the date of issue, the amount remaining unpaid as of the date of the resolution, and the interest rates and due dates and amounts of principal thereon. Applications and necessary data must be in the form prescribed by the commissioner. Applications must be received by the commissioner by September 1 of an odd-numbered year. When an application is received, the commissioner shall obtain from the commissioner of revenue, and from the Public Utilities Commission when required, the information in their official records that is required to be used in computing the debt limit of the joint powers district under section 475.53, subdivision 4.\nBy November 1 of the odd-numbered year, the commissioner shall examine and consider all applications for grants, and if any district is found not qualified, the commissioner shall promptly notify that board.\nA grant award is subject to verification by the district as specified in subdivision 8. A grant award for a new facility must not be made until the site of the facility has been determined. A grant award to remodel or improve an existing facility must not be made until the districts have reorganized. If the total amount of the approved applications exceeds the amount that is or can be made available, the commissioner shall first award grants to districts that will close at least one existing school building, and then, to the extent funds remain, allot the available amount equally between any other approved applicant districts. The commissioner shall promptly certify to each qualified district the amount, if any, of the grant awarded to it.\nA group of districts that receives a grant for a new facility under subdivision 4 is also eligible to receive an additional grant in the amount of $1,000,000. To receive the additional grant, the group of districts must develop a plan under subdivision 2, paragraph (d), that provides for the location of a significant number of noneducational student and community service programs within the cooperative facility.\nWithin 180 days after being awarded a grant for a new facility under subdivision 5, the joint powers board must submit the question of authorizing the borrowing of funds for the facility to the voters of the joint powers district at a special election, which may be held in conjunction with the general election of the school board members of the member districts. The question submitted must state the total amount of funding needed from all sources. A majority of those voting in the affirmative on the question is sufficient to authorize the joint powers board to accept the grant and to issue the bonds on public sale according to chapter 475. The clerk of the joint powers board must certify the vote of the bond election to the commissioner. If the question is approved by the voters, the commissioner shall notify the approved applicant districts that the grant amount certified under subdivision 5 is available and appropriated for payment under this subdivision. If a majority of those voting on the question do not vote in the affirmative, the grant must be canceled.\nEach grant must be evidenced by a contract between the board and the state acting through the commissioner. The contract obligates the state to pay to the board an amount computed according to subdivision 5, and according to a schedule, and terms and conditions acceptable to the commissioner of management and budget.\nA group of districts that operates a cooperative facility that was acquired, constructed, remodeled, or improved under this section and implements consolidation proceedings according to section 123A.48, may propose a temporary school board structure in the petition or resolution required under section 123A.48, subdivision 2. The districts may propose the number of existing school board members of each district to become members of the board of the consolidated district and a method to gradually reduce the membership to six or seven. The proposal must be approved, disapproved, or modified by the commissioner. The election requirements of section 123A.48, subdivision 20, do not apply to a proposal approved by the state board. Elections conducted after the effective date of the consolidation are subject to the Minnesota Election Law.",
	"repealed": false
}