{
	"id": "115C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.04",
	"title": "115C.04 LIABILITY FOR RESPONSE COSTS.",
	"text": "(a) A responsible person is liable for the cost of the corrective action taken by the agency under section 115C.03, subdivisions 2 and 3, including the cost of investigating the release and administrative and legal expenses, if:\n(1) the responsible person has failed to take a corrective action ordered by the commissioner and the agency has taken the action;\n(2) the agency has taken corrective action in an emergency under section 115C.03, subdivision 3; or\n(3) the agency has taken corrective action because a responsible person could not be identified.\n(b) A responsible person is liable for the reimbursement paid by the Petroleum Tank Release Compensation Board under section 115C.09, subdivision 3a, to the extent the reimbursement is for corrective action that the responsible person could have been ordered to perform under section 115C.03, subdivision 1.\n(a) A responsible person may not avoid the liability by means of a conveyance of any right, title, or interest in real property; or by any indemnification, hold harmless agreement, or similar agreement.\n(b) This subdivision does not:\n(1) prohibit a person who may be liable from entering an agreement by which the person is insured, held harmless, or indemnified for part or all of the liability;\n(2) prohibit the enforcement of an insurance, hold harmless, or indemnification agreement; or\n(3) bar a cause of action brought by a person who may be liable or by an insurer or guarantor, whether by right of subrogation or otherwise.\nReasonable and necessary expenses incurred by the agency in taking a corrective action, including costs of investigating a release, administrative and legal expenses, and reimbursement costs described in subdivision 1, paragraph (b), may be recovered in a civil action in district court brought by the attorney general on behalf of the board against a responsible person. The agency's certification of expenses is prima facie evidence that the expenses are reasonable and necessary. If the responsible person has petroleum tank leakage or spill insurance coverage that insures against the liability provided in this section, the board is subrogated to the rights of the responsible person with respect to that insurance coverage, to the extent of the expenses incurred by the agency and described in this subdivision. The board may request the attorney general to bring an action in district court against the insurer to enforce this subrogation right. Expenses that are recovered under this section must be deposited in the fund.",
	"repealed": false
}