{
	"id": "473.598",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.598",
	"title": "473.598 ARENA ACQUISITION.",
	"text": "The commission shall first determine whether to pursue negotiations to acquire the basketball and hockey arena.\nBefore making a final decision to acquire the basketball and hockey arena, the commission must obtain and examine all the terms, conditions, covenants, and other provisions of any loan agreements between the owners of the arena and third parties that provided financing secured by mortgages on or other security interests in the basketball and hockey arena. These terms specifically include any agreements that require a professional team affiliated with the owner to lease or use the arena or that restrict or limit the authority of the team owners or affiliates to relocate the team. The commission shall make the terms of the agreements available for public inspection.\n(a) If the commission makes a final determination to acquire the basketball and hockey arena, the commission may then submit to the Metropolitan Council a proposal to bond for and acquire the basketball and hockey arena. The commission's proposal shall contain all information deemed appropriate or necessary by the council to its determinations pursuant to section 473.599, subdivision 4. The commission, in preparing the proposal for the council, shall require of the sellers and of the professional teams that are potential lessees or other potential lessees and all of their affiliated entities any and all data relevant to the acquisition, financing, ownership, and operation of the basketball and hockey arena, including, but not limited to, contracts, agreements, profit and loss statements, annual audit statements and balance sheets. The commission shall contract with an independent, nationally recognized firm of certified public accountants to perform due diligence and provide an economic feasibility study or report with regard to the data received by the commission from the sellers, the potential lessees, and affiliated entities. In evaluating whether to acquire the basketball and hockey arena, the commission shall consider among other factors, (a) total capital and operating costs of the basketball and hockey arena to the commission and total commission revenues from the basketball and hockey arena over the expected life of the facility, including any contributions by the state, local units of government or other organizations, (b) the total governmental costs associated with the acquisition and operation of the basketball and hockey arena, including the cost to all units and agencies of government as well as the costs to the commission, (c) the net gain or loss of taxes to the state and all local government units, and (d) economic and other benefits accruing to the public.\n(b) Before submitting its proposal to the Metropolitan Council under paragraph (a), the commission shall submit the proposal to the Department of Management and Budget for review, evaluation, and comment. Any data which is not public data under subdivision 4 shall remain not public data when given to the Department of Management and Budget.\n(a) Except as specifically provided in this subdivision, all data received by the commission or council in the course of its negotiations and acquisition of the basketball and hockey arena is public data.\n(b) The commission may keep confidential data received or prepared by its accountants or counsel for purposes of negotiations with existing or potential lessees of the basketball and hockey arena. That data shall be confidential data on individuals under section 13.02, subdivision 3, or protected nonpublic data under section 13.02, subdivision 13, as the case may be, unless the commission determines that public release of the data would advance the negotiations, or until the potential lessees have executed agreements with the commission or the negotiations are unfavorably concluded.\n(c) The following data shall be private data on individuals under section 13.02, subdivision 12, or nonpublic data under section 13.02, subdivision 9, as the case may be:\n(1) data received by the commission or council from the present lessees or potential lessees of the basketball and hockey arena which if made public would, due to the disclosure, permit a competitive economic advantage to other persons;\n(2) data relating to affiliated entities of the parties referred to in subdivision 3 which is not relevant to the due diligence and economic feasibility study referred to under subdivision 3; and\n(3) data on individuals which is not relevant to the finances of the basketball and hockey arena or useful to demonstrate the financial ability of the potential lessees of the arena to perform their agreements with the commission.\n(d) For purposes of this subdivision, the terms \"commission\" and \"council\" include their members and employees, accountants, counsel, and consultants and the firm of independent certified public accountants to be engaged under subdivision 2.\n(e) Notwithstanding the exceptions in this subdivision, summary data which demonstrates the financial ability of the lessees and potential lessees of the basketball and hockey arena to perform their obligations under agreements with the commission and data which relates in any way to the value of the basketball and hockey arena and the amount by which the owners' investment in the arena, including debt obligations, exceeds the commission's payments to and assumption of the owners' debt obligations, shall be public data.\nThe commission shall exercise its best efforts, consistent with its other obligations under sections 473.551 to 473.599 to attempt to secure an agreement with a major league professional hockey organization to play its home games at the basketball and hockey arena.",
	"repealed": false
}