{
	"id": "142D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.05",
	"title": "142D.05 SCHOOL READINESS PROGRAMS.",
	"text": "A district or a group of districts may establish a school readiness program for children age three to kindergarten entrance. The purpose of a school readiness program is to prepare children to enter kindergarten.\nA school readiness program provider must:\n(1) assess each child's cognitive and language skills with a comprehensive child assessment instrument when the child enters and again before the child leaves the program to improve program planning and implementation, communicate with parents, and promote kindergarten readiness;\n(2) provide comprehensive program content and intentional instructional practice aligned with the state early childhood learning guidelines and kindergarten standards and based on early childhood research and professional practice that is focused on children's cognitive, social, emotional, and physical skills and development and prepares children for the transition to kindergarten, including early literacy and language skills;\n(3) coordinate appropriate kindergarten transition with parents and kindergarten teachers;\n(4) involve parents in program planning and decision making;\n(5) coordinate with relevant community-based services;\n(6) cooperate with adult basic education programs and other adult literacy programs;\n(7) ensure staff-child ratios of one-to-ten and maximum group size of 20 children with the first staff required to be a teacher; and\n(8) have teachers knowledgeable in early childhood curriculum content, assessment, native and English language development programs, and instruction.\n(a) A school readiness program provider must include a biennial plan in the district's comprehensive achievement and civic readiness plan under section 120B.11, describing how the school readiness program meets the program requirements under subdivision 3.\n(b) Programs receiving school readiness funds annually must submit a report to the department of education for transfer to the department of children, youth, and families.\nA district may contract with a charter school or community-based organization to provide eligible children developmentally appropriate services that meet the program requirements in subdivision 3. In the alternative, a district may pay tuition or fees to place an eligible child in an existing program. A district may establish a new program where no existing, reasonably accessible program meets the program requirements in subdivision 2. Services may be provided in a site-based program or in the home of the child or a combination of both. The district may not restrict participation to district residents.\nA program provided by a board must be supervised by a licensed early childhood teacher, a certified early childhood educator, or a licensed parent educator.\nA district must adopt a sliding fee schedule based on a family's income but must waive a fee for a participant unable to pay. School districts must use school readiness aid for eligible children. Children who do not meet the eligibility requirements in subdivision 8 may participate on a fee-for-service basis.\nThe department must assist districts, upon request, with programs under this section.\nA child is eligible to participate in a school readiness program if the child:\n(1) is at least three years old on September 1;\n(2) has completed health and developmental screening within 90 days of program enrollment under sections 142D.09 to 142D.093; and\n(3) has one or more of the following risk factors:\n(i) qualifies for free or reduced-price meals;\n(ii) is an English learner;\n(iii) is homeless;\n(iv) has an individualized education program (IEP) or standardized written plan;\n(v) is identified, through health and developmental screenings under sections 142D.09 to 142D.093, with a potential risk factor that may influence learning; or\n(vi) is defined as at risk by the school district.",
	"repealed": false
}