{
	"id": "256B.0638",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0638",
	"title": "256B.0638 OPIOID PRESCRIBING IMPROVEMENT PROGRAM.",
	"text": "The commissioner of human services, in conjunction with the commissioner of health, shall coordinate and implement an opioid prescribing improvement program to reduce opioid dependency and substance use by Minnesotans due to the prescribing of opioid analgesics by health care providers and to support patient-centered, compassionate care for Minnesotans who require treatment with opioid analgesics.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Commissioners\" means the commissioner of human services and the commissioner of health.\n(d) \"DEA\" means the United States Drug Enforcement Administration.\n(e) \"Minnesota health care program\" means a public health care program administered by the commissioner of human services under this chapter and chapter 256L, and the Minnesota restricted recipient program.\n(f) \"Opioid disenrollment standards\" means parameters of opioid prescribing practices that fall outside community standard thresholds for prescribing to such a degree that a provider must be disenrolled as a Minnesota health care program provider.\n(g) \"Opioid prescriber\" means a licensed health care provider who prescribes opioids to Minnesota health care program and MinnesotaCare enrollees under the fee-for-service system or under a managed care or county-based purchasing plan.\n(h) \"Opioid quality improvement standard thresholds\" means parameters of opioid prescribing practices that fall outside community standards for prescribing to such a degree that quality improvement is required.\n(i) \"Program\" means the statewide opioid prescribing improvement program established under this section.\n(j) \"Provider group\" means a clinic, hospital, or primary or specialty practice group that employs, contracts with, or is affiliated with an opioid prescriber. Provider group does not include a professional association supported by dues-paying members.\n(k) \"Sentinel measures\" means measures of opioid use that identify variations in prescribing practices during the prescribing intervals.\n(a) The commissioner of human services, in consultation with the commissioner of health, shall appoint the following voting members to an opioid prescribing work group:\n(1) two consumer members who have been impacted by an opioid abuse disorder or opioid dependence disorder, either personally or with family members;\n(2) one member who is a licensed physician actively practicing in Minnesota and registered as a practitioner with the DEA;\n(3) one member who is a licensed pharmacist actively practicing in Minnesota and registered as a practitioner with the DEA;\n(4) one member who is a licensed advanced practice registered nurse actively practicing in Minnesota and registered as a practitioner with the DEA;\n(5) one member who is a licensed dentist actively practicing in Minnesota and registered as a practitioner with the DEA;\n(6) two members who are nonphysician licensed health care professionals actively engaged in the practice of their profession in Minnesota, and their practice includes treating pain;\n(7) one member who is a mental health professional who is licensed or registered in a mental health profession, who is actively engaged in the practice of that profession in Minnesota, and whose practice includes treating patients with substance use disorder or substance abuse;\n(8) one member who is a medical examiner for a Minnesota county;\n(9) one member of the Health Services Advisory Council established under section 256B.0625, subdivisions 3c to 3e;\n(10) one member who is a medical director of a health plan company doing business in Minnesota;\n(11) one member who is a pharmacy director of a health plan company doing business in Minnesota;\n(12) one member representing Minnesota law enforcement; and\n(13) two consumer members who are Minnesota residents and who have used or are using opioids to manage chronic pain.\n(b) In addition, the work group shall include the following nonvoting members:\n(1) the medical director for the medical assistance program;\n(2) a member representing the Department of Human Services pharmacy unit;\n(3) the medical director for the Department of Labor and Industry; and\n(4) a member representing the Minnesota Department of Health.\n(c) An honorarium of $200 per meeting and reimbursement for mileage and parking shall be paid to each voting member in attendance.\n(a) The working group shall recommend to the commissioners the components of the statewide opioid prescribing improvement program, including, but not limited to, the following:\n(1) developing criteria for opioid prescribing protocols, including:\n(i) prescribing for the interval of up to four days immediately after an acute painful event;\n(ii) prescribing for the interval of up to 45 days after an acute painful event; and\n(iii) prescribing for chronic pain, which for purposes of this program means pain lasting longer than 45 days after an acute painful event;\n(2) developing sentinel measures;\n(3) developing educational resources for opioid prescribers about communicating with patients about pain management and the use of opioids to treat pain;\n(4) developing opioid quality improvement standard thresholds and opioid disenrollment standards for opioid prescribers and provider groups. In developing opioid disenrollment standards, the standards may be described in terms of the length of time in which prescribing practices fall outside community standards and the nature and amount of opioid prescribing that fall outside community standards; and\n(5) addressing other program issues as determined by the commissioners.\n(b) The opioid prescribing protocols shall not apply to opioids prescribed for patients who are experiencing pain caused by a malignant condition or who are receiving hospice care or palliative care, or to opioids prescribed for substance use disorder treatment with medications for opioid use disorder.\n(c) All opioid prescribers who prescribe opioids to Minnesota health care program enrollees must participate in the program in accordance with subdivision 5. Any other prescriber who prescribes opioids may comply with the components of this program described in paragraph (a) on a voluntary basis.\n(a) The commissioner shall implement the quality improvement program to improve the health of and quality of care provided to Minnesota health care program enrollees. The program must be designed to support patient-centered care consistent with community standards of care. The program must discourage unsafe tapering practices and patient abandonment by providers. The commissioner shall annually collect and report to provider groups the sentinel measures of data showing individual opioid prescribers' opioid prescribing patterns compared to their anonymized peers. Provider groups shall distribute data to their affiliated, contracted, or employed opioid prescribers.\n(b) The commissioner shall notify an opioid prescriber and all provider groups with which the opioid prescriber is employed or affiliated when the opioid prescriber's prescribing pattern exceeds the opioid quality improvement standard thresholds. An opioid prescriber and any provider group that receives a notice under this paragraph shall submit to the commissioner a quality improvement plan for review and approval by the commissioner with the goal of bringing the opioid prescriber's prescribing practices into alignment with community standards. A quality improvement plan must include:\n(1) components of the program described in subdivision 4, paragraph (a);\n(2) internal practice-based measures to review the prescribing practice of the opioid prescriber and, where appropriate, any other opioid prescribers employed by or affiliated with any of the provider groups with which the opioid prescriber is employed or affiliated; and\n(3) demonstration of patient-centered care consistent with community standards of care.\n(c) If, after a year from the commissioner's notice under paragraph (b), the opioid prescriber's prescribing practices for treatment of acute or postacute pain do not improve so that they are consistent with community standards, the commissioner may take one or more of the following steps:\n(1) require the prescriber, the provider group, or both, to monitor prescribing practices more frequently than annually;\n(2) monitor more aspects of the opioid prescriber's prescribing practices than the sentinel measures; or\n(3) require the opioid prescriber to participate in additional quality improvement efforts.\n(d) Prescribers treating patients who are on chronic, high doses of opioids must meet community standards of care, including performing regular assessments and addressing unwarranted risks of opioid prescribing, but are not required to show measurable changes in chronic pain prescribing thresholds within a certain period.\n(e) The commissioner shall dismiss a prescriber from participating in the opioid prescribing quality improvement program on an annual basis when the prescriber demonstrates that the prescriber's practices are patient-centered and reflect community standards for safe and compassionate treatment of patients experiencing pain.\n(f) The commissioner may investigate for possible disenrollment all opioid prescribers and provider groups whose prescribing practices fall within the applicable opioid disenrollment standards.\n(g) No physician, advanced practice registered nurse, or physician assistant, acting in good faith based on the needs of the patient, may be disenrolled by the commissioner of human services solely for prescribing a dosage that equates to an upward deviation from morphine milligram equivalent dosage recommendations specified in state or federal opioid prescribing guidelines or policies, or quality improvement thresholds established under this section.\n(a) Reports and data identifying an opioid prescriber are private data on individuals as defined under section 13.02, subdivision 12, until an opioid prescriber is subject to termination as a medical assistance provider under this section. Notwithstanding this data classification, the commissioner shall share with all of the provider groups with which an opioid prescriber is employed, contracted, or affiliated, the data under subdivision 5, paragraph (a), (b), or (c).\n(b) Reports and data identifying a provider group are nonpublic data as defined under section 13.02, subdivision 9, until the provider group is subject to termination as a medical assistance provider under this section.\n(c) Upon termination under this section, reports and data identifying an opioid prescriber or provider group are public, except that any identifying information of Minnesota health care program enrollees must be redacted by the commissioner.\n(a) This section does not apply to prescribers employed by, or under contract or affiliated with, a provider group for which the commissioner has granted a waiver from the requirements of this section.\n(b) The commissioner, in consultation with opioid prescribers, shall develop waiver criteria for provider groups, and shall make waivers available beginning July 1, 2023. In granting waivers, the commissioner shall consider whether the medical director of the provider group and a majority of the practitioners within a provider group have specialty training, fellowship training, or experience in treating chronic pain. Waivers under this subdivision must be granted on an annual basis.\nMS 2020 [Repealed, 2022 c 98 art 14 s 33]",
	"repealed": false
}