{
	"id": "123B.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.69",
	"title": "123B.69 GRANT APPLICATION PROCESS.",
	"text": "A school district that meets the criteria required under subdivision 2 may apply for a grant in an amount up to 50 percent of the approved costs of removing architectural barriers from a building or site. A grant may not exceed $150,000 to a recipient district in any fiscal year.\nThe commissioner, in consultation with the Minnesota State Council on Disability, shall review applications for grants. A school district must apply by July 1 of each year in order to be considered for a grant.\nThe commissioner shall examine and consider all applications for grants, and if a district is found not qualified, the commissioner shall promptly notify the district board. The commissioner shall give first priority to districts that have entered into the cooperation and combination process under sections 123A.35 to 123A.43, or that have consolidated since January 1, 1987. The commissioner shall further prioritize grants on the basis of the following: the district's tax burden, the long-term feasibility of the project, the suitability of the project, and the district's need for the project. If the total amount of the applications exceeds the amount that is or can be made available, the commissioner shall award grants according to the commissioner's judgment and discretion and based upon a ranking of the projects according to the factors listed in this paragraph. The commissioner shall promptly certify to each district the amount, if any, of the grant awarded to it.\nUpon being awarded a grant under subdivision 3, the board shall determine the need for additional revenue. If the board determines that the local match cannot be made from existing revenue, the board may levy according to section 123B.58.\nA district that receives a grant must provide the commissioner with the project budget and any other information the commissioner requests.",
	"repealed": false
}