{
	"id": "216C.437",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.437",
	"title": "216C.437 RESIDENTIAL PACE LOAN PROGRAM; AUTHORITY; CONSUMER PROTECTIONS.",
	"text": "This section applies only to programs established under subdivision 2 that are offered to a homeowner.\n(a) An implementing entity may establish a residential PACE loan program to finance cost-effective energy improvements to enable homeowners to pay for the cost-effective energy improvements to qualifying residential real property with the net proceeds and interest earnings of revenue bonds authorized in section 216C.436, subdivision 8. The program must serve a public purpose and not primarily be for the benefit of private entities or private investors even though private benefit may result incidentally.\n(b) An implementing entity may limit the number of qualifying residential real properties for which a homeowner may receive program financing.\n(c) No implementing entity or residential PACE administrator may:\n(1) provide, offer, or facilitate financing to a homeowner who is not current on mortgage or real property tax payments; or\n(2) permit a homeowner to have more than one residential PACE loan outstanding at a time or a combination of a residential PACE loan and one or more other loan products offered by the administrator or any affiliate or related entity of the administrator.\n(d) Upon completion of a project, an implementing entity shall provide a homeowner with a certificate stating participation in the program and identify what cost-effective energy improvements have been made with financing program proceeds.\n(a) An implementing entity shall ensure that financing provided under this section has:\n(1) a cost-weighted average maturity not exceeding the useful life of the cost-effective energy improvements installed, as determined by the commissioner, but in no event may a term exceed 20 years; and\n(2) a principal amount not to exceed:\n(i) for a residential PACE loan for energy efficiency improvements only, the lesser of ten percent of the estimated market value of the property on which the improvements are to be installed or the actual cost of installing the cost-effective energy improvements; and\n(ii) for a residential PACE loan for a renewable energy system or a combination of a renewable energy system and energy efficiency improvements, the lesser of 20 percent of the estimated market value of the property on which the improvements are to be installed or the actual cost of installing the cost-effective energy improvements.\nFor the purposes of this clause, the \"actual cost of installing cost-effective energy improvements\" includes the costs of necessary equipment, materials and labor, and the cost of verification of installation.\n(b) The combined debt of existing mortgages, the residential PACE lien, and all other liens on the qualified residential real property may not exceed 90 percent of the estimated market value of the property.\n(a) Notwithstanding any statute or ordinance to the contrary, a residential PACE lien shall be:\n(1) subordinate to all liens on the qualifying residential real property recorded prior to the time the PACE lien is recorded;\n(2) subordinate to a first mortgage on the qualifying property recorded after the PACE lien is recorded; and\n(3) superior to any other lien on the qualifying residential real property recorded after the PACE lien is recorded.\n(b) Notwithstanding any other law to the contrary, in the event of a foreclosure sale or a sale pursuant to the exercise of a power of sale under a mortgage relating to a qualifying residential real property, the holders of any mortgages or other liens, including delinquent annual assessments secured by PACE liens, shall receive proceeds in accordance with the priorities established under paragraph (a).\n(a) An implementing entity or a residential PACE administrator may not enter into a residential PACE loan contract with a homeowner unless the implementing entity or the residential PACE administrator has provided written notice to each of the servicers of any mortgage or other lien on the qualifying residential real property that the homeowner intends to enter into a residential PACE loan contract.\n(b) No residential PACE loan may be made unless the implementing entity or the residential PACE administrator obtains written, signed confirmation from the servicer of any mortgage or other lien on the qualifying residential real property that entering into the residential PACE loan contract does not constitute an event of default or give rise to any remedies under the terms of the mortgage loan or other contractual agreement.\n(c) A notice of the PACE loan, containing the legal description of the property shall be recorded by the PACE administrator with the county recorder or registrar of titles as appropriate, within 30 days of the first date of funding of the PACE loan.\nNo residential PACE administrator may operate in this state without first obtaining a license from the commissioner. An administrator applying for a license must provide the following information in a form prescribed by the commissioner:\n(1) the full name of each natural person who is a principal of the administrator;\n(2) the mailing address, which must not be a post office box, the telephone number, and, if applicable, the email address of the primary office of the administrator and any branch offices in this state;\n(3) consent to the jurisdiction of the courts of this state;\n(4) the name and address of the registered agent in this state authorized to accept service of process on behalf of the administrator;\n(5) disclosure of:\n(i) whether any controlling or affiliated party has ever been convicted of a crime or found civilly liable for an offense involving moral turpitude, including forgery, embezzlement, obtaining money under false pretenses, larceny, extortion, conspiracy to defraud, or any other similar offense or violation, or any violation of a federal or state law or regulation relating to any consumer fraud, false advertising, deceptive trade practices, or similar consumer protection law;\n(ii) any judgments, private or public litigation, tax liens, written complaints, administrative actions, or investigations by any government agency against the administrator, or against any officer, director, manager, or shareholder of owning more than five percent interest in the administrator, unresolved or otherwise, filed or otherwise commenced within the preceding ten years;\n(iii) whether the administrator, or any person employed by the administrator, has had a record of having defaulted in the payment of money collected for others, including the discharge of debts through bankruptcy proceedings; and\n(iv) whether authority granted to the administrator to operate in any other state has ever been denied, revoked, or suspended; and\n(6) any other information and material as the commissioner may require.\nLicenses for residential PACE administrators issued under this chapter expire on December 31 and are renewable on January 1 of each year after that date.\n(a) A person whose application is properly and timely filed and who has not received notice of denial of renewal is considered approved for renewal, and the person may continue to transact business as a residential PACE administrator whether or not the renewed license has been received on or before January 1 of the renewal year. An application for renewal of a license is considered timely filed if received by the commissioner by December 15 of the renewal year. An application for renewal is considered properly filed if made upon forms duly executed and sworn to, accompanied by fees prescribed by this chapter, and containing any information that the commissioner requires.\n(b) A person who fails to make a timely application for renewal of a license and who has not received the renewal license as of January 1 of the renewal year is unlicensed until the renewal license has been issued by the commissioner and is received by the person.\nApplication for the renewal of an existing license must contain the request for renewal and any changes to the information specified in subdivision 6.\nA licensee ceasing an activity or activities regulated by this chapter and desiring to no longer be licensed shall simultaneously inform the commissioner in writing and surrender the license and all other symbols or indicia of licensure. The licensee shall include a plan for the withdrawal from regulated business, including a timetable for the disposition of the business.\n(a) The commissioner has under this section the same powers the commissioner has under section 45.027, including the authority to impose a civil penalty not to exceed $10,000 per violation.\n(b) The commissioner may condition or refuse to renew a license for any of the reasons the commissioner may deny, suspend, or revoke a license.\n(c) The commissioner may order restitution against persons subject to this section for violations of this section.\n(d) The commissioner may issue orders or directives under this section as follows:\n(1) order or direct persons subject to this chapter to cease and desist from conducting business, including immediate temporary orders to cease and desist;\n(2) order or direct persons subject to this chapter to cease any harmful activities or violations of this chapter, including immediate temporary orders to cease and desist;\n(3) enter immediate temporary orders to cease business under a license if the commissioner determines that the license was erroneously granted or the licensee is currently in violation of this chapter; and\n(4) order or direct other affirmative action the commissioner considers necessary.\n(e) Each violation or failure to comply with any directive or order of the commissioner is a separate and distinct violation or failure.\n(f) Section 58A.04, subdivisions 2 and 3, apply to this section.\nThe following fees must be paid to the commissioner:\n(1) for an initial license, $1,000; and\n(2) for a renewal license, $500.\nThe commissioner shall have the power vested under section 46.04 to conduct financial examinations of licensees. Each residential PACE administrator must keep, and use in licensee's business, any books, accounts, and records, including electronic records, as will enable the commissioner to determine whether the licensee is complying with this section and any rules, orders, and directives adopted by the commissioner under this section. Every licensee must preserve the books, accounts, and records for at least six years after making the final entry on any transaction recorded. Examinations of the books, records, and method of operations conducted under the supervision of the commissioner shall be done at the cost of the licensee. The cost must be assessed as determined under section 46.131.\n(a) An applicant for a residential PACE administrator license must file with the department a surety bond in the amount of $100,000, issued by an insurance company authorized to do so in this state. The bond must cover all persons who are employees or agents of the applicant. The bond must be available for the recovery of expenses, fines, and fees levied by the commissioner under this chapter and for losses incurred by homeowners as a result of a licensee's noncompliance with the requirements of this section, sections 325D.43 to 325D.48, 325F.67 to 325F.69, or breach of contract relating to activities regulated by this chapter.\n(b) The bond must be submitted with the administrator's license application and evidence of continued coverage must be submitted with each renewal. Any change in the bond must be submitted for approval by the commissioner within ten days of its execution. The bond or a substitute bond shall remain in effect during all periods of licensing.\n(c) A licensee shall maintain or increase its surety bond to reflect the total dollar amount of the residential PACE loans made in this state in the preceding year according to the table in this paragraph. A licensee may decrease its surety bond according to the table in this paragraph if the surety bond required is less than the amount of the surety bond on file with the department.\nResidential PACE administrators shall file reports by March 31 of each year on forms supplied by the commissioner and containing information required by the commissioner.\n(a) A residential PACE loan contract must:\n(1) be in writing and must be signed by:\n(i) the homeowner;\n(ii) all other persons on the deed, mortgage, or note having a legal interest in the property;\n(iii) the residential PACE contractor; and\n(iv) the residential PACE administrator;\n(2) contain all the terms and conditions of a residential PACE loan and the installation of cost-effective energy improvements;\n(3) be written in English and the primary language of the homeowner:\n(i) at the homeowner's request;\n(ii) if the residential PACE loan is advertised in that language; or\n(iii) if the residential PACE loan contract was described, discussed, or negotiated in that language, regardless of whether the residential PACE loan is advertised in that language;\n(4) conspicuously display both the verbatim statement that \"[insert name of the residential PACE administrator] is licensed with the Minnesota Department of Commerce\" and the license number of the administrator;\n(5) conspicuously display both the verbatim statement that \"[insert name of the residential PACE contractor] is licensed by [insert name of agency]\" and the license number of the contractor;\n(6) offer a fixed, simple interest rate;\n(7) charge an interest rate that does not exceed the interest rate limit set forth under section 334.01, subdivision 1, unless the residential PACE administrator is otherwise authorized to make loans under section 47.20;\n(8) fully amortize the debt obligation;\n(9) at any time, permit prepayment of some or all of the residential PACE loan balance; and\n(10) include the right to rescind, as provided under subdivision 19.\n(b) If a homeowner is requested to provide an electronic signature on the residential PACE loan contract:\n(1) the residential PACE contractor and residential PACE administrator must comply with United States Code, title 15, chapter 96; and\n(2) the residential PACE contractor or residential PACE administrator shall deliver a paper copy of the residential PACE loan contract to the homeowner no later than five business days following receipt from the homeowner of the electronically signed contract.\n(c) A residential PACE loan may not:\n(1) result at any time in negative amortization;\n(2) charge any interest upon interest or upon fees;\n(3) notwithstanding section 429.061, subdivision 1, contain any provision under which the homeowner is prohibited or restricted from making a prepayment or requiring a penalty, fee, premium, or other charge for prepayment of some or all of the residential PACE loan;\n(4) contain any provision requiring forced arbitration or restricting class actions; or\n(5) be entered into with a contract for deed vendee or vendor for the otherwise qualifying residential real property that is subject to the contract for deed.\n(d) It shall be unlawful for a residential PACE administrator or a residential PACE contractor to enter into a residential PACE loan contract financed through a residential PACE loan with a homeowner who the administrator or contractor knew or should have known:\n(1) is a vulnerable adult;\n(2) is a homeowner who is not sufficiently competent to understand the terms of the loan; or\n(3) does not have the ability to repay the loan, as provided under subdivision 17.\n(a) No residential PACE loan may be executed by a residential PACE administrator or a residential PACE contractor unless the administrator has first verified the ability of the homeowner to repay the residential PACE loan by:\n(1) determining that the ratio of the homeowner's total monthly debt to total monthly income at the time the loan is executed does not exceed 43 percent;\n(2) determining that the homeowner has sufficient residual income to meet basic living expenses;\n(3) considering whether reductions in income or increases in debt that could adversely impact the ability of the homeowner to repay the residential PACE loan are reasonably anticipated to occur following the execution of the residential PACE loan; and\n(4) considering any other factors, including credit reports and credit scores, that indicate that the homeowner may not have the ability to repay the residential PACE loan.\n(b) For the purposes of this subdivision:\n(1) \"total monthly income\" means the sum of the homeowner's current or reasonably expected income. Income may not be derived from temporary sources of income, illiquid assets, or proceeds derived from the equity the homeowner has in the qualifying residential real property;\n(2) \"total monthly debt\" means the sum of the homeowner's monthly debt obligations including but not limited to mortgage-related obligations that include all mortgage principal and interest payments; other secured debt; mortgage guaranty insurance; any other insurance; property taxes; preexisting fees and assessments on the property, including the PACE assessment; unsecured debt; alimony; and child support;\n(3) \"residual income\" means the homeowner's remaining income after subtracting the homeowner's total monthly debt obligations from the homeowner's total monthly income;\n(4) \"basic living expenses\" include but are not limited to food and other household necessities; medical expenses, including premiums, co-pays, and the cost of prescriptions and over-the-counter remedies; transportation costs such as fuel, auto insurance, and maintenance; public transit costs; and utility expenses; and\n(5) \"current or reasonably expected income\" includes income from assets and excludes the value of the qualifying residential real property, including any attached real property, that secures the residential PACE loan.\n(c) The residential PACE administrator must use only reliable documents and records to verify the homeowner's ability to repay the residential PACE loan. Reliable documents and records include Internal Revenue Service Form W-2 (Wage and Tax Statement) or other similar Internal Revenue Service forms that are used for reporting wages or tax withholding, tax returns, payroll receipts and statements, and financial institution records and statements. A statement by the homeowner to the residential PACE administrator of the homeowner's income is not sufficient to establish the existence of the income or resources when verifying the homeowner's ability to repay the residential PACE loan.\n(a) Prior to the execution by the homeowner of a residential PACE contract and prior to the commencement of any installation of any energy improvement, the residential PACE administrator must orally, in a live, recorded telephone conversation with the homeowner:\n(1) confirm the key terms of the agreement and the scope of energy improvement work, including, at a minimum, the measures to be installed that are financed by a residential PACE loan, the total estimated annual payment, the date the first tax payment will be due, the interest rate expressed as an annual percentage rate, the term of the loan, and that repayments will be made through the homeowner's property taxes;\n(2) verify that the homeowner understands:\n(i) the key terms of the agreement;\n(ii) that if taxes are escrowed, by how much the escrowed amounts will increase or, if taxes are not escrowed, that the homeowner should consider saving enough money during the year to cover the additional residential PACE assessment;\n(iii) that the residential PACE loan becomes a PACE lien on the homeowner's property and will likely need to be paid off when the house is sold;\n(iv) the monetary penalty that accompanies a homeowner delinquency or default on property tax payments; and\n(v) that the homeowner has the right to rescind a residential PACE loan contract, as provided in subdivision 19; and\n(3) communicate that:\n(i) energy savings are not guaranteed and the risk that energy savings from the cost-effective energy improvements may not equal or exceed the residential PACE loan payments that will be added to the homeowner's property taxes;\n(ii) refinancing a home encumbered by a residential PACE lien will likely be more difficult or impossible;\n(iii) selling a home encumbered by a residential PACE lien will likely be more difficult; and\n(iv) the homeowner risks tax forfeiture or foreclosure upon default.\n(b) At the commencement of the oral confirmation, the administrator must ask if the homeowner would prefer to communicate during the oral confirmation primarily in a language other than English. If the preferred language is supported by the residential PACE administrator, the oral confirmation shall be given in the preferred language, except where the homeowner on the call chooses to communicate through an interpreter chosen by the homeowner. If the preferred language is not supported and an interpreter is not chosen by the homeowner on the call, the administrator shall terminate the call and no residential PACE loan contract may be executed.\n(c) Notwithstanding paragraph (b), the oral confirmation must be conducted in the primary language of the homeowner if the PACE contract was explained, discussed, or negotiated in that language.\n(d) A voice mail message does not meet the requirements of this subdivision.\n(e) For purposes of this subdivision, \"an interpreter chosen by the homeowner\" means a person 18 years of age or older who is able to speak fluently and read with full understanding both the English language and the preferred language of the homeowner, and:\n(1) who is not employed by the residential PACE administrator or the residential PACE contractor or an affiliate or related entity of the administrator or contractor; or\n(2) whose services are not made available through the administrator or the contractor.\n(a) A homeowner shall have the right to rescind, without penalty or obligation, a residential PACE loan contract until midnight on the third calendar day following execution of the contract by the homeowner. For the purposes of this subdivision, the rescission period begins at 12:01 a.m. of the day following the day the contract was executed by the homeowner.\n(b) The homeowner shall notify the offering party of the rescission by:\n(1) mail or other written communications delivered to the offeror's physical address; or\n(2) by electronic means if the residential PACE administrator or residential PACE contractor has previously communicated with the homeowner via electronic means. Service by mail is effective upon deposit in the United States mail.\n(c) Any payments made by the homeowner in connection with the residential PACE loan or a home improvement contract for cost-effective energy improvements financed with a residential PACE loan must be returned to the homeowner within 20 business days after receipt by the administrator or the contractor by any means of notification of rescission.\n(d) When more than one homeowner in a transaction has the right to rescind, the exercise of the right by one consumer shall be effective as to all homeowners.\n(a) A residential PACE administrator and a residential PACE contractor shall furnish the buyer with the following rescission notice and form, which must be in a writing separate from the residential PACE loan contract and shall not be considered substantive law under this section:\nRESCISSION RIGHT AND FORM\nYour right to cancel\nYou have the right to rescind (cancel) this contract without penalty until midnight on [insert day and date].\nTo rescind (cancel): Mail or otherwise deliver a signed and dated copy of this form to [insert name of the residential PACE administrator] at [insert physical or, if the residential PACE administrator accepts electronic rescission, the email address of the residential PACE administrator].\nYou do not have to use this form, but must notify [insert the name of the residential PACE administrator] in writing at the address listed in the previous sentence of your intention to rescind (cancel).\nIf you rescind (cancel), any payments made by you under this contract will be returned within 20 business days after the residential PACE administrator receives this form.\nNotice of Rescission Form\nI HEREBY RESCIND (CANCEL) THIS CONTRACT.\n(b) The document containing the rescission right and form must be provided to the homeowner at the time the homeowner executes the residential PACE loan contract.\n(c) When a homeowner rescinds a residential PACE loan, the homeowner shall not be liable for any amount, including any finance charge, fees, or other charges.\n(a) Without exception and notwithstanding section 326B.805, subdivision 6, cost-effective energy improvements financed through a residential PACE loan must be installed by a residential PACE contractor who is licensed by the commissioner of labor and industry as a residential building contractor or residential remodeler. Mechanical contractors, plumbing contractors, electrical contractors, and technology system contractors properly registered or licensed under chapter 326B may act as subcontractors in order to perform installation of energy improvements that fall completely within the scope of their registration or license.\n(b) A residential PACE contractor may not commence work to install cost-effective energy improvements financed with a residential PACE loan prior to the expiration of the rescission period provided under subdivision 19. A residential PACE contractor who violates this paragraph:\n(1) is not entitled to compensation for that work;\n(2) must restore the property to its original condition at no cost to the homeowner; and\n(3) immediately and without condition return all money, property, and other consideration given by the homeowner.\n(c) A residential PACE contractor may not charge a homeowner a different price for the cost-effective energy improvements and their installation that the contractor would charge for the same or similar installations that are not financed through a residential PACE loan.\n(d) An implementing entity must inspect all installations and conduct a performance verification of at least ten percent of the cost-effective energy improvements financed by the program.\n(e) A residential PACE loan program shall require that all cost-effective energy improvements be made to a qualifying real property prior to, or in conjunction with, an applicant's repayment of financing for cost-effective energy improvements for that property.\nA residential PACE loan program must include cooperation and coordination with the conservation improvement activities of the utility serving the qualifying residential real property under section 216B.241 and other public and private energy improvement programs identified by the commissioner or the commissioner's designee.\n(a) Energy generated by an energy improvement may not be sold, transmitted, or distributed at retail and may not provide for end use of the electrical energy from an off-site facility. On-site generation is allowed to the extent provided for in section 216B.1611.\n(b) This section does not modify the exclusive service territories or exclusive right to serve as provided in sections 216B.37 to 216B.43.\n(a) No residential PACE administrator or residential PACE contractor may:\n(1) in any form of communication, make any statement or implication that is false, unfair, unlawful, deceptive, abusive, or misleading, or make any material omission, regardless of reliance on the statement or omission by the homeowner, in connection with a residential PACE loan or the marketing or offering of cost-effective energy improvements financed through a residential PACE loan;\n(2) indicate or imply that the cost-effective energy improvements will pay for themselves or offset or exceed the amount of the residential PACE loan, unless the residential PACE administrator or residential PACE contractor guarantees in writing that the improvements will pay for themselves or offset or exceed the amount of the residential PACE loan, and a provision for sufficient consideration to the homeowner is included in the residential PACE loan contract in the event that the guarantee does not materialize;\n(3) indicate or imply that the residential PACE loan is free, a form of public assistance, or a government program;\n(4) indicate or imply that the residential PACE loan will be repaid, in whole or in part, by a subsequent homeowner;\n(5) engage in any false, deceptive, or misleading advertising, act, or practice;\n(6) use an implementing entity's logo, city seal, or other graphic in marketing materials or representations;\n(7) steer or otherwise direct a homeowner to a residential PACE loan;\n(8) offer or provide any tax advice or information, unless the offeror or provider is a tax expert, provided that a residential PACE administrator or residential PACE contractor may:\n(i) indicate to a homeowner that tax benefits may be available to certain homeowners who obtain residential PACE loans; and\n(ii) direct the homeowner to seek the advice of an expert regarding tax matters related to the residential PACE loan;\n(9) offer or provide direct or indirect monetary payments or any other form of compensation, incentive, kickback, inducement, or any other thing of value to a homeowner to enter into a residential PACE loan;\n(10) engage in practices prohibited under section 47.605;\n(11) engage in practices prohibited under section 332.37;\n(12) engage in practices prohibited under section 326B.84;\n(13) enter into any residential PACE loan unless both the Federal Housing Finance Agency and the Federal Housing Administration will purchase, refinance, or insure mortgages encumbered by subordinate PACE liens;\n(14) violate state or federal do-not-call or telemarketing restrictions or prohibitions; or\n(15) violate any other state or federal law or rule.\n(b) No residential PACE administrator may:\n(1) offer or provide direct or indirect monetary payments or any other form of compensation, incentive, kickback, inducement, or any other thing of value to a residential PACE contractor to offer, favor, or refer a homeowner to a residential PACE loan over other forms of financing or credit; and\n(2) disclose or permit disclosure to a residential PACE contractor the amount of PACE loan financing for which a homeowner is eligible.\n(a) A residential PACE administrator must comply with the Servicemembers Civil Relief Act, United States Code, title 50, section 3901, et seq., except that, for the purposes of this section, the rights granted under the act may not be waived.\n(b) A residential PACE administrator is subject to section 582.043.\n(a) Neither a residential PACE administrator nor a residential PACE contractor may enter into a residential PACE loan contract with a homeowner unless the administrator first screens the homeowner for eligibility for, and, if eligible, refers the homeowner to, the free low-income weatherization assistance program and low-income home energy assistance programs, relevant programs offered by the Minnesota Housing Finance Agency, relevant programs offered by the electric and gas utility company or companies serving the homeowner, and any other relevant no- or low-cost programs known to the administrator or contractor.\n(b) For the purposes of this subdivision:\n(1) \"low-income\" means income qualifying a homeowner for assistance under the low-income home energy assistance program;\n(2) \"low-income home energy assistance program\" has the meaning given under section 142G.02, subdivision 59; and\n(3) \"low-income weatherization assistance program\" means the program described under section 216C.264.\n(a) The following verbatim disclosure must be provided to a homeowner on a one-page document, separate from any other, and in 14-point type:\nIMPORTANT THINGS TO KNOW ABOUT THIS LOAN\n1. This loan is called a PACE loan. PACE stands for Property Assessed Clean Energy Loan.\n2. This is not a typical loan. You pay it back through your property taxes. Property taxes are paid annually or twice a year, not monthly, like most loans.\n3. You are putting up your house as a guarantee of repayment (collateral) for this loan. You could lose your house in foreclosure or tax forfeiture if you fall behind or cannot meet the tax payments necessary to repay the loan.\n4. This PACE loan will increase your property tax bill by [$ insert annual amount] per year for [insert duration of the loan] years, unless you pay the loan back early.\n5. Having a PACE loan on the house will likely make it harder to sell your house because you will have to pay off the PACE loan or reduce the price of the house by the amount of the remaining PACE loan balance.\n6. Having a PACE loan on the house will likely make it more difficult to refinance your mortgage or get a loan modification. It may also delay a closing on a sale.\n7. To learn about the benefits and risks of a PACE loan, contact the Minnesota Homeownership Center at 651-659-9336 or 866-462-6466 (toll-free) to get the name and location of a local certified housing counseling organization. You might also consider talking to a lawyer.\n(b) A residential PACE administrator or a residential PACE contractor shall give the disclosure in paragraph (a) to the homeowner five days prior to the execution by the homeowner of a residential PACE loan contract at the first in-person encounter with the homeowner at which a residential PACE loan or the installation of energy measures to be financed by a residential PACE loan is discussed.\nNo other disclosures or papers may be proffered with the disclosures and annual statement required under this subdivision. The administrator must ensure that the contact information for the referral provided in the disclosure is up to date.\n(c) In addition to the disclosure required under paragraph (a), the residential PACE administrator must provide, before the execution of a PACE loan contract, a disclosure that is approved by the commissioner that includes information specified by the commissioner. The disclosure must include:\n(1) the total amount of the assessment;\n(2) the annual assessment payments and a payment schedule;\n(3) the term of the assessment;\n(4) the interest rate and annual percentage rate of the PACE loan, and all applicable fees;\n(5) the improvements to be installed;\n(6) that no penalty shall be assessed or collected for prepayment of the assessment;\n(7) that any potential utility savings are not guaranteed and may not be equal to or greater than the assessment payments or total assessment amount;\n(8) that the payments will be added to the homeowner's property tax bill; and\n(9) the amount by which escrowed property taxes will increase.\n(d) A residential PACE administrator must provide an annual statement of the status of the residential PACE loan, including, at a minimum, the amount paid to date and the remaining balance of the loan.\n(e) All legally required and voluntary disclosures made in connection with a residential PACE loan must be provided in the primary language of the homeowner if:\n(1) requested by the homeowner;\n(2) the residential PACE loan is advertised in that language; or\n(3) the residential PACE loan contract was explained, discussed, or negotiated in that language, regardless of whether the residential PACE loan is advertised in that language.\n(a) An implementing entity that finances an energy improvement under this section must:\n(1) secure payment with a lien against the qualifying real property;\n(2) collect repayments as a special assessment as provided for in section 429.101 or by charter, provided that special assessments may be made payable in up to 20 equal annual installments;\n(3) impose requirements and conditions on financing arrangements to ensure timely repayment;\n(4) require a petition to the implementing entity by all homeowners of the qualifying real property requesting collections of repayments as a special assessment under section 429.101;\n(5) provide that payments and assessments are not accelerated due to a default and that a tax delinquency for assessments not paid shall be subordinate to all other assessments on the property existing at the time. Payments made by the homeowner for unpaid special charges collected as a special assessment shall first be credited to any outstanding charge under section 429.021, subdivision 1, clauses (1) to (20), before applying any payment to unpaid special charges collected as a special assessment imposed under this section; and\n(6) require that liability for special assessments related to the financing runs with the qualifying real property.\n(b) If the implementing entity is an authority, the local government that authorized the authority to act as implementing entity shall impose and collect special assessments necessary to pay debt service on bonds issued by the implementing entity under section 216C.436, subdivision 8, and shall transfer all collections of the assessments upon receipt to the authority.\n(c) All residential PACE administrators must develop, offer, and implement binding residential PACE loan forbearance, modification, and forgiveness mechanisms for homeowners of residential real property who are facing economic hardship. The mechanisms may not result in an increase in monthly payments and must restructure or forgive debt in cases of permanent hardship, including loss of income due to death or disability.\nA homeowner may prepay a residential PACE loan, in whole or in part, at any time or from time to time without penalty or premium by paying the principal amount to be prepaid together with accrued interest to the date of prepayment.\nA homeowner or subsequent homeowner of, a successor in interest to, or any person obligated to pay the property taxes on qualifying residential real property encumbered by a PACE lien may assert all claims and defenses against a subsequent residential PACE administrator that the homeowner who originally entered into the residential PACE loan could assert against the original residential PACE administrator or servicer of a residential PACE loan.\n(a) Residential PACE administrators, residential PACE contractors, subcontractors of the residential PACE contractor, and agents thereof shall act in good faith toward and in the best interests of the homeowners.\n(b) For the purposes of this section, a residential PACE contractor, a subcontractor of the residential PACE contractor, and any other agent of the contractor is an agent of a residential PACE administrator. The performance of any act related to a residential PACE loan contract by a residential PACE contractor, a subcontractor of the residential PACE contractor, or any agent of the contractor is considered an act of the administrator, provided the act was within the contractual scope work.\n(a) Any homeowner aggrieved by a person or entity violating this section is entitled in an action to:\n(1) actual, incidental, and consequential damages;\n(2) statutory damages of either:\n(i) $5,000; or\n(ii) $10,000 if the defendant violated subdivision 17 or 24, paragraph (a), clause (1);\n(3) reasonable attorney fees; and\n(4) investigative and court costs.\n(b) A homeowner of qualified residential real property who is a vulnerable adult is entitled, in addition to any other relief available under this section, to the civil relief available under section 626.557, subdivision 20, if the homeowner prevails in any claim that the defendant:\n(1) did not possess a license as required under subdivision 6; and\n(2) violated subdivision 16, 17, 18, 19, 21, 24, 25, 26, 27, or 31.\n(c) The remedies provided under this subdivision are cumulative, not exclusive, and do not restrict any remedy that is otherwise available to a homeowner at law or in equity.\nThe parties to a residential PACE loan contract may not waive any of the rights or requirements set forth or any provision contained in this section. Any waiver of any right, requirement, or provision in a residential PACE loan contract or home improvement contract for cost-effective energy improvements financed with a residential PACE loan is void and unenforceable as contrary to public policy.",
	"repealed": false
}