{
	"id": "204B.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.181",
	"title": "204B.181 ELECTION EMERGENCY PLANS.",
	"text": "(a) The secretary of state, in consultation with the Minnesota director of the Department of Public Safety, Division of Homeland Security and Emergency Management, must develop a state elections emergency plan.\n(b) The secretary of state must also coordinate with the governor to incorporate election needs into the state's continuity of government and continuity of operations plans.\n(c) The secretary of state must create a state guide to assist county and local election officials in developing a county elections emergency plan required by subdivision 2. The secretary of state must consult with the Minnesota State Council on Disability in developing the guide. The guide must include a model county elections emergency plan that meets the requirements of this section.\n(a) County election officials, in consultation with the political subdivision's local organization for emergency management established under section 12.25 and the municipalities and school districts within the county, must develop a county elections emergency plan to be made available for use in all state, county, municipal, and school district elections held in that county.\n(b) In developing the county elections emergency plan, the county must address the needs of voters with disabilities in all aspects of the plan. Where ballot security is affected, the plan must provide procedures to maintain the security of the ballots. When an emergency requires the relocation of the polling place, the plan must include procedures for securing the ballots and voting equipment, notifying the public and other government officials, and restoring voting activities as soon as possible. If the county contains jurisdictions that cross county lines, the affected counties must make efforts to ensure that the emergency procedures affecting the local jurisdiction are uniform throughout the jurisdiction.\n(c) Cities, towns, and school districts may create a local elections emergency plan that meets the requirements of the county elections emergency plan. If a local jurisdiction creates a local elections emergency plan, the procedures within the local elections emergency plan govern in all election emergencies within that local jurisdiction.\n(d) County election officials and any municipality with a local elections emergency plan must review their county or local elections emergency plan prior to each state general election. Any revisions to the county or local elections emergency plan must be completed and filed with the secretary of state by July 1 prior to the state general election.",
	"repealed": false
}