{
	"id": "638.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/638.14",
	"title": "638.14 COMMISSION MEETINGS.",
	"text": "The commission must meet at least four times each year for one or more days at each meeting to hear eligible clemency applications and recommend appropriate action to the board on each application. One or more of the meetings may be held at a department-operated correctional facility.\nAll commission meetings are open to the public as provided under chapter 13D, but the commission may hold closed meetings:\n(1) as provided under chapter 13D; or\n(2) as necessary to protect sensitive or confidential information, including (i) a victim's identity, and (ii) sensitive or confidential victim testimony.\nWhen possible, the commission must record its meetings by audio or audiovisual means.\nThe governor, attorney general, and chief justice, or their designees, may attend commission meetings as ex-officio nonvoting members, but their attendance does not affect whether the commission has a quorum.\n(a) An applicant for clemency must appear before the commission either in person or through available forms of telecommunication.\n(b) The victim of an applicant's crime may appear and speak at the meeting or submit a written statement to the commission. The commission may treat a victim's written statement as confidential and not disclose the statement to the applicant or the public if there is or has been an order for protection, harassment restraining order, or other no-contact order prohibiting the applicant from contacting the victim.\n(c) A law enforcement agency's representative may provide the agency's position on whether the commission should recommend clemency by:\n(1) appearing and speaking at the meeting; or\n(2) submitting a written statement to the commission.\n(d) The sentencing judge and the prosecuting attorney, or their successors, may provide their positions on whether the commission should recommend clemency by:\n(1) appearing and speaking at the meeting; or\n(2) submitting their statements under section 638.11, subdivision 2.",
	"repealed": false
}