{
	"id": "59D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/59D.04",
	"title": "59D.04 GUARANTEED ASSET PROTECTION WAIVER REQUIREMENTS.",
	"text": "GAP waivers may be offered, sold, or provided to borrowers in Minnesota in compliance with this chapter.\nGAP waivers may, at the option of the creditor, be sold for a single payment or may be offered with a monthly or periodic payment option.\nNotwithstanding any other provision of law, any cost to the borrower for a guaranteed asset protection waiver entered into in compliance with United States Code, title 15, sections 1601 to 1667F, and its implementing regulations under Code of Federal Regulations, title 12, part 226, as they may be amended from time to time, must be separately stated and is not to be considered a finance charge or interest.\nA retail seller must insure its GAP waiver obligations under a contractual liability or other insurance policy issued by an insurer. A creditor, other than a retail seller, may insure its GAP waiver obligations under a contractual liability policy or other such policy issued by an insurer. The insurance policy may be directly obtained by a creditor or retail seller, or may be procured by an administrator to cover a creditor's or retail seller's obligations. Retail sellers that are lessors on motor vehicles are not required to insure obligations related to GAP waivers on leased vehicles.\nThe GAP waiver must be part of, or a separate addendum to, the finance agreement and must remain a part of the finance agreement upon the assignment, sale, or transfer of the finance agreement by the creditor.\nThe extension of credit, the terms of the credit, or the terms and conditions of the related motor vehicle sale or lease must not be conditioned upon the purchase of a GAP waiver.\nA creditor that offers a GAP waiver must report the sale of, and forward funds received on, all such waivers to the designated party, if any, as prescribed in any applicable administrative services agreement, contractual liability policy, other insurance policy, or other specified program documents.\nFunds received or held by a creditor or administrator and belonging to an insurer, creditor, or administrator, pursuant to the terms of a written agreement, must be held by the creditor or administrator in a fiduciary capacity.\nThe terms defined in section 59D.02 are not intended to provide actual terms that are required in guaranteed asset protection waivers.",
	"repealed": false
}