{
	"id": "257.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.57",
	"title": "257.57 DETERMINATION OF FATHER AND CHILD RELATIONSHIP; WHO MAY BRING ACTION; WHEN ACTION MAY BE BROUGHT.",
	"text": "A child, the child's biological mother, or a man presumed to be the child's father under section 257.55, subdivision 1, paragraph (a), (b), or (c) may bring an action:\n(1) at any time for the purpose of declaring the existence of the father and child relationship presumed under section 257.55, subdivision 1, paragraph (a), (b), or (c); or\n(2) for the purpose of declaring the nonexistence of the father and child relationship presumed under section 257.55, subdivision 1, paragraph (a), (b), or (c), only if the action is brought within two years after the person bringing the action has reason to believe that the presumed father is not the father of the child, but in no event later than three years after the child's birth. However, if the presumed father was divorced from the child's mother and if, on or before the 280th day after the judgment and decree of divorce or dissolution became final, he did not know that the child was born during the marriage or within 280 days after the marriage was terminated, the action is not barred until one year after the child reaches the age of majority or one year after the presumed father knows or reasonably should have known of the birth of the child, whichever is earlier. After the presumption has been rebutted, paternity of the child by another man may be determined in the same action, if he has been made a party.\nThe child, the mother, or personal representative of the child, the public authority chargeable by law with the support of the child, the personal representative or a parent of the mother if the mother has died or is a minor, a man alleged or alleging himself to be the father, or the personal representative or a parent of the alleged father if the alleged father has died or is a minor may bring an action:\n(1) at any time for the purpose of declaring the existence of the father and child relationship presumed under sections 257.55, subdivision 1, paragraph (d), (e), (g), or (h), and 257.62, subdivision 5, paragraph (b), or the nonexistence of the father and child relationship presumed under section 257.55, subdivision 1, clause (d);\n(2) for the purpose of declaring the nonexistence of the father and child relationship presumed under section 257.55, subdivision 1, paragraph (e) or (g), only if the action is brought within six months after the person bringing the action obtains the results of blood or genetic tests that indicate that the presumed father is not the father of the child;\n(3) for the purpose of declaring the nonexistence of the father and child relationship presumed under section 257.62, subdivision 5, paragraph (b), only if the action is brought within three years after the party bringing the action, or the party's attorney of record, has been provided the blood or genetic test results; or\n(4) for the purpose of declaring the nonexistence of the father and child relationship presumed under section 257.75, subdivision 9, only if the action is brought by the minor signatory within six months after the minor signatory reaches the age of 18. In the case of a recognition of parentage executed by two minor signatories, the action to declare the nonexistence of the father and child relationship must be brought within six months after the youngest signatory reaches the age of 18.\nAn action to determine the existence of the father and child relationship with respect to a child who has no presumed father under section 257.55 may be brought by the child, the mother or personal representative of the child, the public authority chargeable by law with the support of the child, the personal representative or a parent of the mother if the mother has died or is a minor, a man alleged or alleging himself to be the father, or the personal representative or a parent of the alleged father if the alleged father has died or is a minor.\nRegardless of its terms, an agreement, other than an agreement approved by the court in accordance with section 257.64, between an alleged or presumed father and the mother, does not bar an action under this section by the child or the public authority chargeable by law with the support of the child.\nIf an action under this section is brought before the birth of the child, all proceedings shall be stayed until after the birth, except service of process and the taking of depositions to perpetuate testimony.\nIf the child has been adopted, an action may not be brought.",
	"repealed": false
}