{
	"id": "325F.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.09",
	"title": "325F.09 DEFINITIONS.",
	"text": "(a) \"Child\" means any person less than 14 years of age.\n(b) A toy presents an electrical hazard if, in normal use or when subjected to reasonably foreseeable damage or abuse, its design or manufacture may cause personal injury or illness by electrical shock or electrocution.\n(c) A toy presents a mechanical hazard if, in normal use or when subjected to reasonably foreseeable damage or abuse, its design or manufacture presents an unreasonable risk of personal injury or illness:\n(1) from fracture, fragmentation, or disassembly of the article;\n(2) from propulsion of the article or any part or accessory thereof;\n(3) from points or other protrusions, surfaces, edges, openings, or closures;\n(4) from moving parts;\n(5) from lack or insufficiency of controls to reduce or stop motion;\n(6) as a result of self-adhering characteristics of the article;\n(7) because the article or any part or accessory thereof may be aspirated or ingested;\n(8) because of instability;\n(9) from stuffing material which is not free of dangerous or harmful substances; or\n(10) because of any other aspect of the article's design or manufacture.\n(d) A toy presents a thermal hazard if, in normal use or when subjected to reasonably foreseeable damage or abuse, its design or manufacture presents an unreasonable risk of personal injury or illness because of heat as from heated parts, substances, or surfaces.\n(e) \"Toxic\" means able to produce personal injury or illness to a person through ingestion, inhalation, or absorption through any body surface and can apply to any substance other than a radioactive substance.\n(f) \"Flammable\" means having a flash point up to 80 degrees Fahrenheit as determined by the Tagliabue Open Cup Tester. The flammability of solids and of the contents of self-pressurized containers shall be determined by methods generally recognized as applicable to the materials or containers and established by rules issued by the commissioner.\n(g) A toy presents a hazard of asphyxiation or suffocation if, in normal use or when subject to reasonably foreseeable damage or abuse, its design, manufacture or storage presents a risk of personal injury or illness from interference with normal breathing.\n(h) \"Commissioner\" means commissioner of commerce.\n(i) \"Inspector\" means an inspector of the Department of Commerce.",
	"repealed": false
}