{
	"id": "326.336",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.336",
	"title": "326.336 EMPLOYEES OF LICENSE HOLDERS.",
	"text": "A license holder may employ, in connection with the business of private detective or protective agent, as many unlicensed persons as may be necessary; provided that every license holder is at all times accountable for the good conduct of every person employed. When a license holder hires a person to perform services as a private detective or protective agent, the employer shall submit to the Bureau of Criminal Apprehension a full set of fingerprints of each employee and the written consent of the employee to enable the bureau to determine whether that person has a criminal record. The employee is a conditional employee until the employer receives a report from the bureau that, based on a check of the criminal records maintained by the bureau, the prospective employee has not been convicted in Minnesota of a felony or any offense listed in section 326.3381, subdivision 3, other than a misdemeanor or gross misdemeanor assault. During the period of conditional employment, the person may not serve as a private detective or protective agent, but may be trained by the employer. The bureau shall immediately forward the fingerprints to the Federal Bureau of Investigation and request the Federal Bureau of Investigation to conduct a criminal history check of each conditional employee. The bureau shall determine if the Federal Bureau of Investigation report indicates that the employee was convicted of a disqualifying offense and shall notify the employer accordingly. The employer shall immediately dismiss an employee who has been convicted of a disqualifying offense.\nAn identification card must be issued by the license holder to each employee. The card must be in the possession of the employee to whom it is issued at all times. The identification card must contain the license holder's name, logo (if any), address or Minnesota office address, and the employee's photograph and physical description. The card must be signed by the employee and by the license holder, qualified representative, or Minnesota office manager. The card must be presented upon request.\nAny person who shall be issued an identification card, badge, holster, weapon, shield, or any other equipment bearing the name, trademark or trade name, or any combination thereof, of any licensed agency, or indicating that such person is a private detective, protective agent, or employee of same, who does not return such badge, weapon, holster, identification card, uniform emblem, or other equipment to the owner thereof within ten days of the termination of employment, or of receiving a written request to return same, made by certified mail to the person's last known address, whichever shall last occur, shall be guilty of a misdemeanor.\nNo employee of any license holder shall divulge to anyone other than the employer, or as the employer shall direct, except as may be required by law, any information acquired during such employment in respect of any matter or investigation undertaken or done by such employer. Any employee who shall make any false statement in an employment statement or who willfully makes a false report to the employer in respect to any matter in the course of the employer's business, or who shall otherwise violate the provisions of this subdivision is guilty of a misdemeanor.",
	"repealed": false
}