{
	"id": "473.811",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.811",
	"title": "473.811 WASTE MANAGEMENT BY COUNTIES, DEFINED LOCAL UNITS.",
	"text": "To accomplish the purpose specified in section 473.803, each metropolitan county may acquire by purchase, lease, gift or condemnation as provided by law, upon such terms and conditions as it shall determine, including contracts for deed and conditional sales contracts, solid waste facilities or properties or easements for solid waste facilities which are in accordance with rules adopted by the agency, the policy plan and the approved county plan, and may improve or construct improvements on any property or facility so acquired. No metropolitan city, county or town shall own or operate a hazardous waste facility, except a facility to manage household hazardous waste. Each metropolitan county is authorized to levy a tax in anticipation of need for expenditure for the acquisition and betterment of solid waste facilities. If a tax is levied in anticipation of need, the purpose must be specified in a resolution of the county directing that the levy and the proceeds of the tax may be used only for that purpose. Until so used, the proceeds shall be retained in a separate fund or invested in the same manner as surplus in a sinking fund may be invested under section 118A.04. The right of condemnation shall be exercised in accordance with chapter 117.\nFor the purposes of this section \"solid waste facility\" includes a facility to manage household hazardous waste.\nWhenever the county deems it necessary to the evaluation of a waste facility for enforcement purposes or for the accomplishment of any purpose under sections 473.149 and 473.801 to 473.834, the county, or any employee or agent thereof when authorized by it, may enter upon any property, public or private, for the purpose of obtaining information or conducting surveys or investigations, provided that the entrance and activity is undertaken after reasonable notice and during normal business hours and provided that compensation is made for any damage to the property caused by the entrance and activity.\nEach metropolitan county may by resolution authorize the issuance of bonds to provide funds for the acquisition or betterment of solid waste facilities, closure, postclosure, and contingency costs, related transmission facilities, or property or property rights for the facilities, for responses, as defined in section 115B.02, to releases from closed solid waste facilities, or for refunding any outstanding bonds issued for any such purpose. The proceeds of bonds issued under this section for closure, postclosure, and contingency costs and noncapital responses to releases may be used only for solid waste facilities in existence on May 15, 1989. The county may pledge to the payment of the bonds and the interest thereon, its full faith, credit, and taxing powers, or the proceeds of any designated tax levies, or the gross or net revenues or charges to be derived from any facility operated by or for the county, or any combination thereof. Taxes levied for the payment of the bonds and interest shall not reduce the amounts of other taxes which the county is authorized by law to levy. The proceeds of the bonds may be used in part to establish a reserve as further security for the payment of the principal and interest of the bonds when due. Bonds issued pursuant to this section may be sold at public or private sale upon such conditions as the county board shall determine. No election shall be required to authorize the issuance of the bonds. Except as otherwise provided, the bonds shall be issued and sold in accordance with the provisions of chapter 475.\nA metropolitan county may issue revenue bonds to finance solid waste and related facilities projects located inside or outside the boundaries of cities or towns described in section 368.01 under and pursuant to the provisions of chapter 474.\nEach metropolitan county may operate and maintain solid waste facilities, and for this purpose may employ all necessary personnel, may adopt regulations governing operation, and may establish and collect reasonable, nondiscriminatory rates and charges, except as authorized under section 115A.919, for the use of the facilities by any local government unit or person, estimated to be sufficient, with any other moneys appropriated for the purpose, to pay all costs of acquisition, operation and maintenance. Each metropolitan county may use itself or sell all or any part of materials or energy recovered from solid waste to private interests or public agencies for consumption or reuse by them. Section 471.345 and Laws 1951, chapter 556, as amended shall not apply to the sale of the materials or energy.\nMetropolitan counties have the authority provided in section 400.08.\nEach metropolitan county may contract for the acquisition or use of existing public or private solid waste facilities or any facilities deemed necessary or useful for resource recovery from solid waste and may contract with any person for the operation or maintenance, or both, of any solid waste facility owned by the county. The contract shall provide for the operation or maintenance, or both, of the facility in accordance with any regulations, criteria, and standards of the agency, the Metropolitan Council and the county relating thereto. Any contract for the operation or maintenance of a solid waste facility may provide for the sale of solid waste, materials, electric energy, steam or other product to the operator or for a fee payable to the operator, which may be a fixed fee, or a fee based on tonnage or a percentage of income or other measure, or any combination thereof. A metropolitan county may warrant to the operator of a solid waste facility or contract purchaser of any solid waste, materials, electric energy, steam or other product the quality, composition and available quantity of the solid waste, materials, electric energy, steam or other product to be sold or delivered. A metropolitan county may enter into an agreement with any local government unit or the University of Minnesota for the purpose of compensating for the local risks, costs, or other effects of a waste processing facility.\nOrdinances of counties and local government units related to or affecting waste management shall embody plans, policies, rules, standards and requirements adopted by any state agency authorized to manage or plan for or regulate the management of waste and the waste management plans adopted under section 473.149 and shall be consistent with approved county plans. Except as provided in this subdivision, a county may establish and operate or contract for the establishment or operation of a solid waste disposal facility without complying with local ordinances if the commissioner certifies need under section 473.823, subdivision 6. With the approval of the commissioner, local government units may impose and enforce reasonable conditions respecting the construction, operation, inspection, monitoring, and maintenance of the disposal facilities. No local government unit shall prevent the establishment or operation of any solid waste facility in accordance with the commissioner's decision under section 473.823, subdivision 5, except that, with the approval of the commissioner, the local government unit may impose reasonable conditions respecting the construction, inspection, monitoring, and maintenance of a facility.\nNotwithstanding any other law, a metropolitan county may contract for the acquisition, construction, improvement, maintenance or operation of solid waste facilities or property or property rights for solid waste facilities by any means available and in the manner determined by the county board, with or without advertisement for bids. A metropolitan county may select and employ a construction manager for construction and acquisition of solid waste facilities or property or property rights for solid waste facilities and negotiate and enter into a construction management agreement, which may but need not include a guaranteed maximum price. A construction manager shall give a bond to the county in accordance with section 574.26 if a construction management agreement provides for a guaranteed maximum price, provided that the amount of any bond furnished by any contractor or subcontractor for performance of and payment of labor and materials under a contract or subcontract for solid waste facilities or property or property rights for solid waste facilities included in the guaranteed maximum price may be substituted to the extent of the bond amount for the bond of the construction manager. A construction management agreement for acquisition and construction of solid waste facilities or property or property rights for solid waste facilities may be combined with a contract for maintenance or operation, or both, of the facilities and negotiated with the same person.\n(a) Each metropolitan county may adopt ordinances governing the collection of solid waste. A county may adopt, but may not be required to adopt, an ordinance that requires the separation from mixed municipal waste, by generators before collection, of materials that can readily be separated for use or reuse as substitutes for raw materials or for transformation into a usable soil amendment.\n(b) Each local unit of government within the metropolitan area shall adopt an ordinance governing the collection of solid waste within its boundaries. If the county within which it is located has adopted a collection ordinance, the local unit shall adopt either the county ordinance by reference or a more strict ordinance. If the county within which it is located has adopted a separation ordinance, the ordinance applies in all local units within the county that have failed to meet the local abatement performance standards, as stated in the most recent annual county report.\n(c) Ordinances of counties and local government units may establish reasonable conditions respecting but shall not prevent the transportation of solid waste by a licensed collector through and between counties and local units, except as required for the enforcement of any designation of a facility by a county under chapter 115A or for enforcement of the prohibition on disposal of unprocessed mixed municipal solid waste under sections 473.848 and 473.849.\n(d) A licensed collector or a metropolitan county or local government unit may request review by the commissioner of an ordinance adopted under this subdivision. The commissioner shall approve or disapprove the ordinance within 60 days of the submission of a request for review. The ordinance shall remain in effect unless it is disapproved.\n(e) Ordinances of counties and local units of government:\n(1) shall provide for the enforcement of any designation of facilities by the counties under chapter 115A;\n(2) may require waste collectors and transporters to deliver unprocessed mixed municipal solid waste generated in the county to processing facilities; and\n(3) may prohibit waste collectors and transporters from delivering unprocessed mixed municipal solid waste generated in the county to disposal facilities for final disposal.\n(f) Nothing in this subdivision limits the authority of the local government unit to regulate and license collectors of solid waste or to require review or approval by the commissioner for ordinances regulating collection.\nEach metropolitan county shall by ordinance establish and from time to time revise rules, regulations, and standards for solid waste facilities within the county, relating to location, sanitary operation, periodic inspection and monitoring, maintenance, termination and abandonment, and other pertinent matters. The county ordinance may require facilities accepting mixed municipal solid waste for disposal to install scales. The county ordinance may prohibit disposal facilities from accepting unprocessed mixed municipal solid waste for final disposal. The county ordinance shall require permits or licenses for solid waste facilities and shall require that such facilities be registered with a county office.\n(a) Each metropolitan county shall by ordinance establish and revise rules, regulations, and standards relating to (1) the identification of hazardous waste, (2) the labeling and classification of hazardous waste, (3) the collection, storage, transportation, processing, and disposal of hazardous waste, and (4) other matters necessary for the public health, welfare and safety. The county shall require permits or licenses for the generation, collection, processing, and disposal of hazardous waste and shall require registration with a county office. County hazardous waste ordinances may not be inconsistent with, and must be at least as stringent as, the agency hazardous waste rules. Counties shall submit adopted ordinances to the agency for review. Counties may adopt ordinances for the issuance of permits or licenses for generators, collectors, or processors of hazardous waste that are more stringent than agency rules if the ordinances do not present an obstacle or impediment to implementation of the agency rules. In the event that agency rules are modified, each county shall modify its ordinances accordingly and shall submit the modification to the agency for review within 120 days. Issuing, denying, suspending, modifying, imposing conditions upon, or revoking hazardous waste permits or licenses, and county hazardous waste regulations and ordinances, shall be subject to review, denial, suspension, modification, and reversal by the agency. The agency shall after written notification have 15 days in the case of hazardous waste permits and licenses and 30 days in the case of hazardous waste ordinances to review, suspend, modify, or reverse the action of the county. After this period, the action of the county board shall be final subject to appeal to the district court in the manner provided in chapter 14.\n(b) A metropolitan county may not impose a volume-based fee under this subdivision on material that is reused at the facility where the material is generated in a manner that the facility owner or operator can demonstrate does not increase the toxicity of, or the level of hazardous substances or pollutants or contaminants in, products that leave the facility. A metropolitan county may impose a flat annual fee on a facility that generates the type of material described in the preceding sentence, provided that the fee reflects the reasonable and necessary costs of inspections of the facility. A county imposing a fee under this paragraph must comply with section 373.41.\nEach metropolitan county shall be responsible for insuring that waste facilities, solid waste collection operations licensed or regulated by the county and hazardous waste generation and collection operations are brought into conformance with, or terminated and abandoned in accordance with, applicable county ordinances; rules and requirements of the state; and the policy plan. Counties may provide by ordinance that operators or owners or both of such facilities or operations shall be responsible to the county for satisfactorily performing the procedures required. If operators or owners or both fail to perform, the county may recover the costs incurred by the county in completing the procedures in a civil action in any court of competent jurisdiction or, in the discretion of the board, the costs may be certified to the county auditor as a special tax against the land. The ordinances may be enforced by action in district court or administrative penalty order authorized under section 116.072. The county may prescribe a criminal penalty for the violation of any ordinance enacted under this section not exceeding the maximum which may be specified for a misdemeanor.\nEach metropolitan county may accept gifts, may apply for and accept grants or loans of money or other property from the United States, the state, the Metropolitan Council, any local government unit, or any person, to accomplish the purposes specified in sections 473.149, 473.151, 473.801 to 473.823, and 473.834, may enter into any agreement required in connection therewith, and may hold, use, and dispose of the money or property in accordance with the terms of the gift, grant, loan or agreement relating thereto.\nAny local governmental unit or metropolitan agency may act together with any county, city, or town within or without the metropolitan area, or with the Pollution Control Agency under the provisions of section 471.59 or any other appropriate law providing for joint or cooperative action between government units, to accomplish any purpose specified in sections 473.149, 473.151, 473.801 to 473.823, 473.834, 116.05 and 115A.06.\nAny agreement regarding data processing services relating to the generation, management, identification, labeling, classification, storage, collection, treatment, transportation, processing or disposal of waste and entered into pursuant to section 471.59, or other law authorizing joint or cooperative action may provide that any party to the agreement may agree to defend, indemnify and hold harmless any other party to the agreement providing the services, including its employees, officers or volunteers, against any judgments, expenses, reasonable attorney's fees and amounts paid in settlement actually and reasonably incurred in connection with any third-party claim or demand arising out of an alleged act or omission by a party to the agreement, its employees, officers or volunteers occurring in connection with any exchange, retention, storage or processing of data, information or records required by the agreement. Any liability incurred by a party to an agreement under this subdivision shall be subject to the limitations set forth in section 3.736 or 466.04.\nEach metropolitan county may sell or lease any facilities or property or property rights previously used or acquired to accomplish the purposes specified by sections 473.149, 473.151, 473.801 to 473.823, and 473.834. Such property may be sold in the manner provided by section 469.065, or may be sold in the manner and on the terms and conditions determined by the county board. Each metropolitan county may convey to or permit the use of any such property by a local government unit, with or without compensation, without submitting the matter to the voters of the county. No real property or property rights acquired pursuant to this section may be disposed of in any manner unless and until the county shall have submitted to the agency for review and comment the terms on and the use for which the property will be disposed of. The agency shall review and comment on the proposed disposition within 60 days after each has received the data relating thereto from the county.\nAll money received by any metropolitan county from any source specified in sections 473.149, 473.151, 473.801 to 473.823, and 473.834 shall be paid into the county treasury, placed in a special fund designated as the county solid and hazardous waste fund, and used only for the purposes authorized in those sections, as appropriated by the county board, subject to any lawful restrictions, conditions, or pledges applicable thereto.\nA qualifying county may be authorized to designate a resource recovery facility under sections 115A.80 to 115A.89.\nMS 1985 Supp [Repealed, 1986 c 425 s 46]",
	"repealed": false
}