{
	"id": "501B.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.41",
	"title": "501B.41 BREACH OF TRUST; PROCEEDINGS TO SECURE COMPLIANCE.",
	"text": "The attorney general may institute appropriate proceedings to obtain compliance with sections 501B.33 to 501B.45 and the proper administration of a charitable trust. The powers and duties of the attorney general in this section are in addition to all other powers and duties.\nThe attorney general must be notified of, and has the right to participate as a party in, all court proceedings:\n(1) to terminate a charitable trust or to liquidate or distribute its assets;\n(2) to modify or depart from the objects or purposes of a charitable trust as contained in the instrument governing the trust, including a proceeding for the application of the doctrine of cy pres;\n(3) to construe the provisions of an instrument with respect to a charitable trust;\n(4) to review an accounting of a charitable trust submitted by a trustee; or\n(5) involving a charitable trust when the interests of the uncertain or indefinite charitable beneficiaries may be affected.\nThe attorney general need not be provided with notice under subdivision 2 of a charitable gift, devise, or bequest (1) for which the donor or testator has named as a charitable beneficiary an organization that is then in existence; or (2) that is not held and continued by a private express trust or corporation, whether or not the gift, devise, or bequest creates a fiduciary relationship.\nThis subdivision does not affect any other notice to the attorney general required by this chapter or chapter 501C.\nIf proceedings are commenced without service of process and service of the pleadings upon the attorney general, a judgment or order rendered in the proceedings is voidable, unenforceable, and, upon the attorney general's motion seeking relief, may be set aside. With respect to the proceedings, no compromise, settlement agreement, contract, or judgment agreed to by any or all of the parties having or claiming to have an interest in a charitable trust is valid unless the attorney general was made a party to the proceedings and joined any agreement or the attorney general, in writing, waived the right to participate. The attorney general may enter into a compromise, settlement agreement, contract, or judgment that the attorney general believes is in the best interests of the people of the state and the uncertain or indefinite beneficiaries.\nThe personal representative shall send to the attorney general a copy of the petition or application for probate together with a copy of the will and any codicils that are being offered for probate:\n(1) when a will provides for a bequest or devise for a charitable purpose for which there is no named charitable beneficiary or for which there is then in existence no named charitable beneficiary;\n(2) when a will provides for bequests or devises for charitable purposes in excess of $150,000;\n(3) when a will provides for a bequest or devise to a named charitable beneficiary that is in receivership; or\n(4) upon a written request served on the personal representative by a named charitable beneficiary prior to the order allowing the final account or, in unsupervised proceedings, within 30 days after service of the final account on the charitable beneficiary.\nThe personal representative shall serve the documents on the attorney general and file with the appropriate court a copy of the affidavit of service on the attorney general. If the personal representative was requested to notify the attorney general of the probate proceedings according to clause (4), the requesting party shall file with the court a copy of the request and the affidavit of service on the personal representative.\nIf objections are filed to a will or codicil containing any bequest or devise to a charitable trust, the person filing the objections, at least 14 days before the hearing, shall send to the attorney general a copy of the objections, a copy of the petition or application for probate, a copy of the will, and any codicil that has been offered for probate.\nAny service upon the attorney general under this section must be made personally or by registered or certified mail, return receipt requested. The attorney general may become a party in the estate proceedings.\nThe failure of a trustee to register under section 501B.37, to file annual reports under section 501B.38, or to administer and manage property held for charitable purposes in accordance with law or consistent with fiduciary obligations constitutes a breach of trust.\nThe attorney general may begin a civil action in order to remedy and redress a breach of trust, as described in subdivision 6 or as otherwise provided by law, committed by a trustee subject to sections 501B.33 to 501B.45. If it appears to the attorney general that a breach of trust has been committed, the attorney general may sue for and obtain:\n(1) injunctive relief against the breach of trust or threatened breach of trust;\n(2) the removal of a trustee who has committed or is committing a breach of trust;\n(3) the recovery of damages; and\n(4) another appropriate remedy.",
	"repealed": false
}