{
	"id": "179.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.231",
	"title": "179.231 VIOLATIONS.",
	"text": "Whenever it reasonably appears to the commissioner that a labor organization has failed to comply with any of the requirements of sections 179.18 to 179.25, the commissioner may appoint a labor referee to act in the dispute.\nWithin ten days of appointment, the labor referee shall fix a time and place for a hearing upon the matter and send written notice thereof to the labor organization, and its officers who are charged in the complaint, the complainant, and to other persons who are parties to the dispute.\nA party to or party affected by the dispute may appear at the hearing before the labor referee in person, by attorney, or by other representative. The party has the right to offer competent evidence and to be heard on the issues before an order is made by the referee. Within 30 days of the close of the hearing, the referee shall prepare and file with the commissioner findings of fact and an order sustaining or dismissing the charges. If the charges are sustained, a labor organization may be suspended from acting as the representative of employees by the commissioner until the basis for the failure to comply with the requirements of sections 179.18 to 179.25 has been removed as provided in subdivision 4. The commissioner shall suspend a labor organization which does not act affirmatively to remove the basis of sustained charges within 30 days of the filing of the referee's order with the commissioner.\nA labor organization which has had charges sustained against it under this section, whether suspended from acting as the representative of employees or not, may remove the basis for the charges or suspension by applying to the commissioner and submitting proof that the basis for the charges has been removed or corrected. Upon receipt of the application, the commissioner shall notify all parties to the hearing before the referee of the filing of the application. If within 20 days after providing notice, written objection by one of the parties to the removal of the basis or suspension is received by the commissioner, the matter shall be referred for additional investigation by a referee under this section. If no objection is so filed, the commissioner shall provide written notice of the removal of the basis for the original complaint and remove any suspension imposed.\nA labor referee appointed by the commissioner under this section shall have the same powers as provided to commissions under section 179.08.",
	"repealed": false
}