{
	"id": "125A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.091",
	"title": "125A.091 ALTERNATIVE DISPUTE RESOLUTION AND DUE PROCESS HEARINGS.",
	"text": "[Repealed by amendment, 2009 c 96 art 3 s 8]\n[Repealed by amendment, 2009 c 96 art 3 s 8]\n[Repealed by amendment, 2009 c 96 art 3 s 8]\nIn addition to federal law requirements, a prior written notice shall:\n(1) inform the parent that except for the initial placement of a child in special education, the school district will proceed with its proposal for the child's placement or for providing special education services unless the child's parent notifies the district of an objection within 14 days of when the district sends the prior written notice to the parent; and\n(2) state that a parent who objects to a proposal or refusal in the prior written notice may:\n(i) request a conciliation conference under subdivision 7 or another alternative dispute resolution procedure under subdivision 8 or 9; or\n(ii) identify the specific part of the proposal or refusal the parent objects to and request a meeting with appropriate members of the individualized education program team.\n[Repealed by amendment, 2009 c 96 art 3 s 8]\n(a) The district must not proceed with the initial evaluation of a child, the initial placement of a child in a special education program, or the initial provision of special education services for a child without the prior written consent of the child's parent. A district may not override the written refusal of a parent to consent to an initial evaluation or reevaluation.\n(b) A parent, after consulting with health care, education, or other professional providers, may agree or disagree to provide the parent's child with sympathomimetic medications unless section 144.344 applies.\nParties are encouraged to resolve disputes over the identification, evaluation, educational placement, manifestation determination, interim alternative educational placement, or the provision of a free appropriate public education to a child with a disability through conciliation, mediation, facilitated team meetings, or other alternative process. All dispute resolution options are voluntary on the part of the parent and must not be used to deny or delay the right to a due process hearing. All dispute resolution processes under this section are provided at no cost to the parent.\nA parent must have an opportunity to request a meeting with appropriate members of the individualized education program team or meet with appropriate district staff in at least one conciliation conference if the parent objects to any proposal of which the parent receives notice under subdivision 3a. A district must hold a conciliation conference within ten calendar days from the date the district receives a parent's request for a conciliation conference. Except as provided in this section, all discussions held during a conciliation conference are confidential and are not admissible in a due process hearing. Within five school days after the final conciliation conference, the district must prepare and provide to the parent a conciliation conference memorandum that describes the district's final proposed offer of service. This memorandum is admissible in evidence in any subsequent proceeding.\nIn addition to offering at least one conciliation conference, a district must inform a parent of other dispute resolution processes, including at least mediation and facilitated team meetings. The fact that an alternative dispute resolution process was used is admissible in evidence at any subsequent proceeding. State-provided mediators and team meeting facilitators shall not be subpoenaed to testify at a due process hearing or civil action under federal special education law nor are any records of mediators or state-provided team meeting facilitators accessible to the parties.\nMediation is a dispute resolution process that involves a neutral party provided by the state to assist a parent and a district in resolving disputes over the identification, evaluation, educational placement, manifestation determination, interim alternative educational placement, or the provision of a free appropriate public education to a child with a disability. A mediation process is available as an informal alternative to a due process hearing but must not be used to deny or postpone the opportunity of a parent or district to obtain a due process hearing. Mediation is voluntary for all parties. All mediation discussions are confidential and inadmissible in evidence in any subsequent proceeding, unless the:\n(1) parties expressly agree otherwise;\n(2) evidence is otherwise available; or\n(3) evidence is offered to prove bias or prejudice of a witness.\nIf the parties resolve all or a portion of the dispute, or agree to use another procedure to resolve the dispute, the mediator shall ensure that the resolution or agreement is in writing and signed by the parties and each party is given a copy of the document. The written resolution or agreement shall state that all discussions that occurred during mediation are confidential and may not be used as evidence in any hearing or civil proceeding. The resolution or agreement is legally binding upon the parties and is enforceable in the state or federal district court. A party may request another mediation to resolve a dispute over implementing the mediated agreement.\nA facilitated team meeting is an IEP, IFSP, or multiagency team meeting led by an impartial state-provided facilitator to promote effective communication and assist a team in developing an individualized education program.\nA parent or a district is entitled to an impartial due process hearing conducted by the state when a dispute arises over the identification, evaluation, educational placement, manifestation determination, interim alternative educational placement, or the provision of a free appropriate public education to a child with a disability. The hearing must be held in the district responsible for ensuring that a free appropriate public education is provided according to state and federal law. The proceedings must be recorded and preserved, at state expense, pending ultimate disposition of the action. The parent and the district shall receive, at state expense, a copy of the hearing transcript or recording and the hearing officer's findings of fact, conclusion of law, and decisions.\nThe commissioner shall maintain a list of qualified hearing officers. The list shall include a statement of the qualifications of each person listed. Upon receipt of a written request for a hearing, the commissioner shall appoint a hearing officer from the list. The hearing officer must:\n(1) be knowledgeable and impartial;\n(2) have no personal interest in or specific involvement with the student who is a party to the hearing;\n(3) not have been employed as an administrator by the district that is a party to the hearing;\n(4) not have been involved in selecting the district administrator who is a party to the hearing;\n(5) have no personal, economic, or professional interest in the outcome of the hearing other than properly administering federal and state laws, rules, and policies;\n(6) have no substantial involvement in developing state or local policies or procedures challenged in the hearing;\n(7) not be a current employee or board member of a Minnesota public school district, education district, intermediate unit or regional education agency, or the department if the department is the service provider;\n(8) not be a current employee or board member of a disability advocacy organization or group;\n(9) not otherwise be under contract with the department or the school district;\n(10) know and understand state and federal special education laws, rules, and regulations, and legal interpretations by federal and state courts; and\n(11) have the knowledge and ability to conduct hearings and render and write decisions according to appropriate, standard legal practice.\n(a) A parent or a school district may file a written request for a due process hearing regarding a proposal or refusal to initiate or change that child's evaluation, individualized education program, or educational placement, or to provide a free appropriate public education.\n(b) The parent shall include in the hearing request the name of the child, the address of the child's residence, the name of the school the child attends, a description of the child's problem relating to the proposed or refused initiation or change, including facts relating to the problem, and a proposed resolution of the problem to the extent known and available to the parents at the time.\n(c) A parent or a school district may file a written request for a hearing under United States Code, title 20, section 1415, paragraph (k).\n(d) A parent or school district filing a request for a hearing under this subdivision must provide the request to the other party and a copy of the request to the department. Upon receiving a request for a hearing, the department shall give to the child's parent a copy of the procedural safeguards notice available to a parent under federal regulations.\n(e)(1) If the parent of a child with a disability files a written request for a hearing, and the school district has not previously sent a written notice to the parent under subdivision 3a, regarding the subject matter of the hearing request, the school district shall, within ten days of receiving the hearing request, send to the child's parent a written explanation of why the school district proposed or refused to take the action raised in the hearing request. The explanation must include a description of other options that the individualized education program team considered and the reason why those options were rejected; a description of each evaluation procedure, assessment, record, or report that the school district used as the basis for the proposed or refused action; and a description of the factors that are relevant to the school district's proposal or refusal. A response by a school district under this subdivision does not preclude the school district from asserting that the parent's request for a hearing is insufficient under clause (2); and\n(2) a hearing may not occur until the party requesting the hearing files a request that meets the requirements of paragraph (b). The request under paragraph (b) is considered sufficient unless the party receiving the request notifies the hearing officer and the other party in writing within 15 days of receiving the request that the receiving party believes the request does not meet the requirements of paragraph (b). Within five days of receiving a notice under this subdivision, the hearing officer shall determine whether the request meets the requirements under paragraph (b) and notify the parties.\n(f) Except as provided in paragraph (e), clause (1), the party receiving a request for a hearing shall send to the party requesting the hearing a written response that addresses the issues raised in the hearing request within ten days of receiving the request.\nA prehearing conference must be held within five business days of the date the commissioner appoints the hearing officer. The hearing officer must initiate the prehearing conference which may be conducted in person, at a location within the district, or by telephone. The hearing officer must create a written verbatim record of the prehearing conference which is available to either party upon request. At the prehearing conference, the hearing officer must:\n(1) identify the questions that must be answered to resolve the dispute and eliminate claims and complaints that are without merit;\n(2) set a scheduling order for the hearing and additional prehearing activities;\n(3) determine if the hearing can be disposed of without an evidentiary hearing and, if so, establish the schedule and procedure for doing so; and\n(4) establish the management, control, and location of the hearing to ensure its fair, efficient, and effective disposition.\nThe burden of proof at a due process hearing is on the party seeking relief.\nThe hearing officer may admit all evidence that possesses probative value, including hearsay, if it is the type of evidence on which reasonable, prudent persons are accustomed to rely in conducting their serious affairs. The hearing officer must give effect to the rules of privilege recognized by law and exclude evidence that is incompetent, irrelevant, immaterial, or unduly repetitious.\n(a) A hearing officer must limit an impartial due process hearing to the time sufficient for each party to present its case.\n(b) A hearing officer must establish and maintain control and manage the hearing. This authority includes, but is not limited to:\n(1) requiring attorneys representing parties at the hearing, after notice and an opportunity to be heard, to pay court reporting and hearing officer costs, or fines payable to the state, for failing to: (i) obey scheduling or prehearing orders, (ii) appear, (iii) be prepared, or (iv) participate in the hearing process in good faith;\n(2) administering oaths and affirmations;\n(3) issuing subpoenas;\n(4) determining the responsible and providing districts and joining those districts, if not already notified, in the proceedings;\n(5) making decisions involving identification, evaluation, educational placement, manifestation determination, interim alternative educational placement, or the provision of a free appropriate public education to a child with a disability;\n(6) ordering an independent educational evaluation of a child at district expense; and\n(7) extending the hearing decision timeline if the hearing officer determines that good cause exists.\n(c) Good cause includes, but is not limited to, the time required for mediation or other settlement discussions, independent educational evaluation, complexity and volume of issues, or finding or changing counsel.\nConsistent with federal law, a parent or a school district may file a written request for an expedited due process hearing. A hearing officer must hold an expedited due process hearing within 20 school days of the date the expedited due process request is filed and must issue a decision within ten school days after the hearing. A resolution meeting must occur within seven days of receiving the request for an expedited due process hearing unless the parent and the school district agree in writing either to waive the resolution meeting or use the mediation process. The expedited due process hearing may proceed unless the matter has been resolved to the satisfaction of both parties within 15 days of receiving the expedited due process hearing request.\n(a) The hearing officer must ensure that not later than 45 days after the 30-day period or the adjusted time periods under federal regulations expire, the hearing officer reaches a final decision in the due process hearing and transmits a copy of the decision to each party. A hearing officer, at the request of either party, may grant specific extensions of time beyond the 45-day period under subdivision 18. The hearing officer must conduct the oral arguments in a hearing at a time and place that is reasonably convenient to the parents and child involved. A hearing officer is encouraged to accelerate the time line to 30 days for a child under the age of three whose needs change rapidly and who requires quick resolution of a dispute.\n(b) Once the hearing officer has issued a final decision, the hearing officer lacks authority to amend the decision except for clerical or mathematical errors.\n(c) Nothing in this subdivision precludes a hearing officer from ordering a school district to comply with federal procedural safeguards under the federal Individuals with Disabilities Education Act.\nThe hearing officer may require the resident or responsible district to provide compensatory educational services to the child if the hearing officer finds that the district has not offered or made available to the child a free appropriate public education in the least restrictive environment and the child suffered a loss of educational benefit. Such services take the form of direct and indirect special education and related services designed to address any loss of educational benefit that may have occurred. The hearing officer's finding must be based on a present determination of whether the child has suffered a loss of educational benefit.\n[Repealed by amendment, 2009 c 96 art 3 s 8]\n[Repealed by amendment, 2009 c 96 art 3 s 8]\nThe parent or district may seek review of the hearing officer's decision in the Minnesota Court of Appeals or in the federal district court. A party must appeal to the Minnesota Court of Appeals within 60 days of receiving the hearing officer's decision or must appeal to federal district court within 90 days of receiving the hearing officer's decision.\nThe commissioner must monitor final hearing officer decisions and ensure enforcement of hearing officer decisions.\nA hearing officer or person conducting alternative dispute resolution under this section is an employee of the state under section 3.732 for purposes of section 3.736 only.\nA hearing officer must participate in training offered by the commissioner.\nA district is not liable for harmless technical violations of federal or state laws, rules, or regulations governing special education if the school district can demonstrate that the violations did not harm a student's educational progress or the parent's right to notice, participation, or due process. This subdivision is applicable to due process hearings and special education complaints filed with the department.",
	"repealed": false
}