{
	"id": "120B.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.215",
	"title": "120B.215 EDUCATION ON CANNABIS USE AND SUBSTANCE USE.",
	"text": "The commissioner of education, in consultation with the commissioners of health and human services, local district and school health education specialists, and other qualified experts, shall identify one or more model programs that may be used to educate middle school and high school students on the health effects on children and adolescents of cannabis use and substance use, including but not limited to the use of fentanyl or mixtures containing fentanyl, consistent with local standards as required in section 120B.021, subdivision 1, paragraph (a), clause (6), for elementary and secondary school students. The commissioner must publish a list of model programs that include written materials, resources, and training for instructors by June 1, 2025. A model program identified by the commissioner must be medically accurate, age and developmentally appropriate, culturally inclusive, and grounded in science, and must address:\n(1) the physical and mental health effects of cannabis use and substance use by children, adolescents, and persons under 25 years of age, including effects on the developing brains of children, adolescents, and persons under 25 years of age;\n(2) unsafe or unhealthy behaviors associated with cannabis use and substance use;\n(3) signs of substance use disorders;\n(4) treatment options; and\n(5) healthy coping strategies for children and adolescents.\n(a) Starting in the 2026-2027 school year, a school district or charter school must implement a comprehensive education program on cannabis use and substance use, including but not limited to the use of fentanyl or mixtures containing fentanyl, for students in middle school and high school. The program must include instruction on the topics listed in subdivision 1 and must:\n(1) respect community values and encourage students to communicate with parents, guardians, and other trusted adults about cannabis use and substance use, including but not limited to the use of fentanyl or mixtures containing fentanyl; and\n(2) refer students to local resources where students may obtain medically accurate information about cannabis use and substance use, including but not limited to the use of fentanyl or mixtures containing fentanyl, and treatment for a substance use disorder.\n(b) District efforts to develop, implement, or improve instruction or curriculum as a result of the provisions of this section must be consistent with sections 120B.10 and 120B.11.\nNotwithstanding any law to the contrary, each school district shall have a procedure for a parent, a guardian, or an adult student 18 years of age or older to review the content of the instructional materials to be provided to a minor child or to an adult student pursuant to this section. The district or charter school must allow a parent or adult student to opt out of instruction under this section with no academic or other penalty for the student and must inform parents and adult students of this right to opt out.\nA school district or charter school may establish one or more youth councils in which student members of the council receive education and training on cannabis use and substance use, including but not limited to the use of fentanyl or mixtures containing fentanyl, and provide peer-to-peer education on these topics.",
	"repealed": false
}