{
	"id": "308C.603",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.603",
	"title": "308C.603 DEVELOPER RIGHTS, RESTRICTIONS, AND OBLIGATIONS.",
	"text": "If a developer causes a cooperative to be organized under this chapter, the developer shall have the right to appoint an initial board of directors consisting of three persons. The developer's control of the board shall terminate on the date of the first annual meeting of members. The first annual meeting shall occur on or about 60 days after the date of the certificate of occupancy issued for the project by the municipality in which the project is situated and subject to any requirements under the mortgage for permanent financing related to the project.\nAny contract, lease, or license binding the cooperative and to which the developer or an affiliate of the developer is a party may be terminated without penalty by the cooperative upon not less than 90 days' notice if entered into prior to termination of the period of developer control. The notice shall be in writing and is effective upon hand delivery or upon mailing properly addressed with postage prepaid and deposited in the United States mail. This subdivision does not apply to any mortgage encumbering the cooperative's real estate.\n(a) During the period of the developer's control of the cooperative, the developer and any of the developer's representatives who are acting as officers or directors of the cooperative shall be subject to the provisions of sections 308C.401 and 308C.455.\n(b) At such time as the developer's control of the cooperative terminates, the developer shall deliver to the board exclusive control of all funds of the cooperative, all contracts and agreements to which the cooperative was or is a party, all corporate records of the cooperative, and all plans and specifications relating to the project.\n(a) Prior to the commencement of occupancy of the project by the members, the developer shall pay all accrued expenses of the cooperative.\n(b) After the commencement of occupancy of the project by the members, the developer shall pay all common expenses and payments to reserves allocated to the dwelling unit appurtenant to the membership interests that have not been conveyed to members, and the payment obligation shall remain in effect until each unissued membership interest has been conveyed to a member.",
	"repealed": false
}