{
	"id": "469.028",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.028",
	"title": "469.028 MUNICIPAL GOVERNING BODY.",
	"text": "When an authority determines that a redevelopment project should be undertaken, it shall apply to the governing body of the city in which the project is located for approval. The application shall be accompanied by a redevelopment plan, a statement of the method proposed for financing the project, and the written opinion of the planning agency, if there is one. Before approving any redevelopment plan, the governing body shall hold a public hearing thereon after published notice in a newspaper of general circulation in the municipality at least once not less than ten days nor more than 30 days prior to the date of the hearing.\nThe authority shall not proceed with the project unless the governing body finds by resolution that:\n(1) the land in the project area would not be made available for redevelopment without the financial aid to be sought;\n(2) the redevelopment plans for the redevelopment areas in the locality will afford maximum opportunity, consistent with the needs of the locality as a whole, for the redevelopment of the areas by private enterprise; and\n(3) the redevelopment plan conforms to a general plan for the development of the locality as a whole.\nThe governing body shall within 30 days after submission of the application, or resubmission as hereinafter provided, give written notice to the authority of its decision with respect to the project. When an authority has determined the location of a proposed redevelopment project, it may, without awaiting the approval of the governing body, proceed, by option or otherwise, to obtain control of the real property within the area, but it shall not, without the prior approval by the governing body of the redevelopment plan, unconditionally obligate itself to purchase any such property. A plan which has not been approved by the governing body when submitted to it may be again submitted to it with the modifications necessary to meet its objections. Once approved, the determination of the authority to undertake the project and the resolution of the governing body shall be conclusive, in any condemnation proceeding, of the public need for the project.\nA redevelopment project may include any work or undertaking to acquire open or undeveloped land determined to be blighted by virtue of the following conditions:\n(1) unusual and difficult physical characteristics of the ground;\n(2) the existence of faulty planning characterized by the subdivision or sale of lots laid out in disregard of the contours or of irregular form and shape or of inadequate size; or\n(3) a combination of these or other conditions which have prevented normal development of the land by private enterprise and have resulted in a stagnant and unproductive condition of land potentially useful and valuable for contributing to the public health, safety, and welfare. Acquisition of such land shall be a redevelopment project only if a redevelopment plan has been adopted which provides for the elimination of these conditions, thereby making the land useful and valuable for contributing to the public health, safety, and welfare and the acquisition of the land is necessary to carry out the redevelopment plan.\nA redevelopment project may include any work or undertaking to acquire land or space that is vacant, unused, underused or inappropriately used, including infrequently used rail yards and rail storage facilities, and excessive or vacated railroad rights-of-way; air rights over streets, expressways, railroads, waterways, and similar locations; land which is occupied by functionally obsolete nonresidential buildings, or is used for low utility purposes, or is covered by shallow water, or is subject to periodic flooding, or consists of unused or underused slips or dock areas or other waterfront property. This subdivision applies only to land or space that the authority determines may be developed at a cost reasonably related to the public purpose to be served without major residential clearance activities, and with full consideration of the preservation of beneficial aspects of the urban and natural environment, for uses that are consistent with emphasis on housing for low and moderate income families. These uses include the provision of schools, hospitals, parks and other essential public facilities and, where appropriate, all uses associated with new community development programs as defined in the United States Urban Growth and New Community Development Act of 1970, as amended, or similar large scale undertakings related to inner city needs, including concentrated sources of employment.\nWhen an authority has determined the location of a proposed redevelopment project, but prior to the approval of the redevelopment plan and project as provided in subdivision 2, the authority may acquire individual tracts of real property with the approval of the governing body as to each separate tract. Before approving early acquisition, the governing body shall hold a public hearing on the proposed acquisition activities after published notice in a newspaper of general circulation in the municipality at least once not less than ten days nor more than 30 days prior to the date of the hearing.\nThe authority shall not proceed with the acquisition unless the governing body finds by resolution that (1) the proposed acquisition is necessary to carry out public improvements in the area, or that the acquisition will contribute to the elimination of blight or deterioration within the area or that the acquisition is necessary to relieve hardship; and (2) there is a feasible method for the relocation of families and individuals to be displaced by the proposed acquisition.\nThe governing body may, in approving early acquisition, agree to assume the responsibility for any loss that may arise as a result of the acquisition of land and related activities, including any costs of demolition, removal, and relocation, in the event that the property so acquired is not used for urban renewal purposes because the urban renewal plan is not approved, or is amended to omit the acquired property or is abandoned for any reason. Nothing in this subdivision shall be construed to waive the requirement for public hearing upon the redevelopment plan for the redevelopment project.",
	"repealed": false
}