{
	"id": "51A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.03",
	"title": "51A.03 INCORPORATION.",
	"text": "Any three or more individuals, residents of this state, may apply to form a mutual association or capital stock association to promote thrift and home financing subject to approval as provided in sections 51A.01 to 51A.57. Three of the individual applicants shall be incorporators and sign and acknowledge before an officer competent to take acknowledgments of deeds, two copies of an application for a certificate of incorporation in the form prescribed by the commissioner of commerce, and of the bylaws in the form set out in this section or in a form approved by the commissioner, which shall be filed with the commissioner, accompanied by the incorporation fee. The applicants shall submit with their application statements, exhibits, map, and other data which the commissioner may require. The data must be sufficiently detailed and comprehensive to enable the commissioner of commerce to pass upon the application as to the criteria set out in subdivision 3.\nThe following form of bylaws may be adopted and used by any mutual association without specific approval of the commissioner. The bylaws may be amended and different bylaws may be adopted with the approval of the commissioner.\n(1) Meeting procedure. All meetings of the members and of the board of directors shall be conducted in accordance with Robert's Rules of Order.\n(2) Annual meeting of members. The annual meeting of the members of the association for the election of directors and for the transaction of other business of the association shall be held at its home office at a time and day to be specified in January in each year, or, if a legal holiday, then on the next succeeding day not a legal holiday. The annual meeting may be held at another time and day in January or at another place in the same community the board of directors determines, but at least ten days' written notice thereof shall be sent to the last known address of each member as it appears upon the membership records of the association, or ten days' notice of the other time, date, and place of meeting shall be given by publication in a newspaper of general circulation in the county in which the home office of the association is located. At each annual meeting, the officers shall make a report of the financial condition of the association and of its progress for the preceding year, and shall outline a program for the succeeding year.\n(3) Special meetings of members. A special meeting of the members of the association may be called at any time by the chair of the board of directors, the president, or the board of directors, and shall be called by the president, a vice-president, or the secretary upon the written request of members of record holding, in the aggregate, at least one-tenth of the savings liability of the association. The written requests shall state the purposes of the meeting and shall be delivered at the principal office of the association addressed to the president.\n(4) Notice of meetings of members. Except as hereinabove provided, no notice of annual meetings of members need be given to members. Notice of each special meeting of members shall state the purposes for which the meeting is called, the place of meeting, and the time when it shall convene, and shall be published once a week for two consecutive calendar weeks, in each instance on any day of the week, prior to the date on which the special meeting shall convene, in a newspaper of general circulation in the county in which the principal office of the association is located. In addition to the publication of the notice, a copy thereof shall be posted in a conspicuous public place in the principal office of the association during the 14 days immediately preceding the date on which the special meeting shall convene.\n(5) Procedure for nomination of directors. On or before the 30th day prior to the date of the annual meeting the president, with the approval of the board of directors, shall appoint a nominating committee of three members of the association, and the nominating committee shall, on or before the 15th day prior to the date of the annual meeting, nominate a qualified member of the association to serve as a director for each vacancy in the board of directors of the association and to succeed each director whose term is expiring at the annual meeting. The nominations shall be in writing, signed by the members of the nominating committee, and shall be filed with the secretary of the association. Any member of the association, acting in that capacity, may nominate any qualified member of the association for the office of director to fill any vacancy in the board of directors or to succeed each director whose term is expiring at the annual meeting, provided the nomination is made in writing, signed by the member, and filed with the secretary of the association and with the commissioner at least 15 days before the meeting. The written nomination by a member acting in that capacity shall contain the following information to the extent known to the member: (1) The names and addresses of the nominees; (2) the major occupations of the nominees; (3) the total number of votes that to the knowledge of the member will be voted for the nominees; (4) the name and residence address of the member; and (5) the number of votes which may be cast by the members. The names of all nominees nominated by the nominating committee and by members, as herein provided, shall be printed, typed, or written upon ballots, which shall be used in the election of directors at the annual meeting, and no other nomination shall be considered at the meeting; provided that in the event no nomination has been made either by the nominating committee or by a member as herein provided, nominations may be made from the floor at the annual meeting.\n(6) New business. Any new business to be taken up at the annual meeting, including any proposal to increase or decrease the number of directors of the association, shall be stated in writing and filed with the secretary of the association on or before the 20th day prior to the date of the annual meeting, and all business so stated, proposed, and filed shall be considered at the annual meeting, but no other proposals shall be acted upon at the annual meeting. Any member may make any other proposal at the annual meeting and the same may be discussed; but unless stated in writing and filed with the secretary at least 20 days before the meeting, the proposals shall be laid over for action at an adjourned, special, or regular meeting of the members taking place 30 days or more after the annual meeting. This provision shall not prevent consideration at the annual meeting of the reports of officers and reports of committees. No new business shall be acted upon at a special meeting of the members except that which has been stated in the published notice of the meeting as provided in paragraph 4 of the bylaws.\n(7) Meetings of the board of directors. The board of directors shall meet regularly without notice at least once each month at the place, hour, and date fixed by resolution of the board of directors. Special meetings of the board of directors may be held and shall be called by the secretary upon the written request of the president or of three directors. All special meetings shall be held upon at least three days' written notice to each director unless notice be waived in writing by each director before or after the meeting. The notice shall state the place, time, and purposes of the meeting. No notice need be given of any meeting at which every director shall be present. A majority of the total number of directors authorized shall constitute a quorum for the transaction of business. The act of a majority of the directors present at any meeting at which there is a quorum shall be the act of the board of directors. If the board of directors of the association elects a chair of the board of directors, that person shall preside at all meetings of the board of directors, if present, and may exercise any and all powers and perform any and all duties which the board of directors, by resolution, confers.\n(8) Resignation and removal of directors. Any director may resign at any time by sending a written notice of the resignation to the principal office of the association addressed to the secretary. Unless otherwise specified therein, the resignation shall take effect upon receipt thereof by the secretary. Any director may be removed either with or without cause at any time by the majority of all votes cast at any annual meeting of members, or at any special meeting of members called for that purpose. Any director, after an opportunity for being heard, may be removed for cause by a two-thirds majority vote of the total number of directors authorized, at any regular meeting or at any special meeting called for that purpose. More than three consecutive absences from regular meetings of the board of directors, unless excused by resolution of the board of directors, shall automatically constitute a resignation, effective when the resignation is accepted by the board of directors.\n(9) Compensation of directors. The board of directors, by resolution, may provide for reasonable compensation to be paid to directors for services as directors, which compensation shall not preclude any director from serving the association in any other capacity and receiving compensation therefor.\n(10) Executive and other committees. The president with the approval of the board of directors may appoint an executive committee of not less than three members of the board which shall have all the powers of the board of directors between meetings of the board. Actions taken by the executive committee shall be disclosed to the board of directors at its next regular or special meeting. There may be a loan policy committee, and other committees the president appoints and empowers with the approval of the board of directors.\n(11) Officers. The officers of the association shall consist of a president to be chosen from among the directors, one or more vice-presidents, a secretary, a treasurer, and any other officers authorized by the board of directors, and shall be elected at the first meeting of the board of directors which follows the annual meeting of members, and which shall be held within 30 days after the annual meeting of members. The board of directors may authorize the appointment of additional officers and employees as it may from time to time determine. Any one person may hold any two offices, except that during tenure as president, the president may not hold the office of secretary or treasurer. The term of office of all officers shall be one year or until their respective successors are elected and qualified; but any officer may be removed at any time by the board of directors for or without cause. The officers shall have the powers, duties, and authority generally appropriate to the office held, subject to special provision made by the board of directors at any time.\n(12) Execution of instruments. All contracts, notes, drafts, acceptances, checks, endorsements, assignments, releases, deeds, all evidences of indebtedness of the association, and all documents, instruments, or writings of any nature shall be signed, executed, verified, acknowledged, and delivered by the officers, agents, or employees of the association, or any one of them in a manner as from time to time may be determined by resolution of the board of directors. Proxies to vote with respect to securities or accounts owned by the association may be executed and delivered from time to time by the president, a vice-president, the secretary or treasurer of the association, or by any other person authorized by resolution of the board of directors.\n(13) Evidence of savings account. Officers or employees designated by the board of directors shall deliver to each person upon the initial credit to that person's savings account in the association an account book or other written evidence of the account where the issuance of the evidence may be required.\n(14) Corporate seal. The seal shall be two concentric circles between which shall be the name of the association. The year of incorporation and the name of this state shall, and an emblem may, appear in the center.\n(15) Fiscal year. The fiscal year shall be the calendar year.\n(16) Amendments. With the approval of the commissioner, amendments of these bylaws may be made from time to time or different bylaws adopted by vote of the members, or by a two-thirds majority vote of the total number of directors authorized.\nWe, the undersigned, being the incorporators of the .................... SAVINGS ASSOCIATION, do hereby adopt and for that purpose do sign and acknowledge the foregoing bylaws as and for the bylaws of the .................... SAVINGS ASSOCIATION, this ..... day of ..............., .....\n[Repealed, 1988 c 666 s 75]\nThe incorporation, formation, and corporate governance of capital stock associations are governed by chapter 302A, except to the extent the provisions of this chapter conflict with the provisions of chapter 302A, in which case the provisions of this chapter govern.\nUpon receipt of an application for a certificate of incorporation to form an association, including supporting data, the commissioner of commerce shall fix a time, within 60 days after the filing of the application, for a hearing at its office at the State Capitol, at which hearing it shall decide whether or not the application shall be granted. A notice of hearing shall be published in the form prescribed by the commissioner of commerce in a newspaper of general circulation published in the municipality in which the proposed association is to be located, and if there be no such newspaper, then at the county seat of the county in which the association is proposed to be located. The notice shall be published once, at the expense of the applicants, not less than 30 days prior to the date of the hearing. Any interested person may appear at the hearing in person or by agent or attorney, and orally or in writing show cause upon any relevant ground why the certificate should not be issued.\nIf upon the hearing it appears that the applicants are of good moral character and financial integrity, that there is a reasonable public demand for this association in the location specified by the application, that there is a reasonable probability of the proposed association's usefulness and success, that the association can be established without undue injury to the properly conducted, existing financial institution in the locality, and that the association will be properly and safely managed, the application may be granted; otherwise it shall be denied. Any hearing required by this section shall be conducted by the commissioner of commerce in accordance with the provisions of the Administrative Procedure Act, sections 14.001 to 14.69, governing contested cases, including the provisions of the act relating to judicial review of agency decisions.\nThe procedure for processing the application, conducting the hearing, and other matters pertinent thereto, must be established by rules adopted by the commissioner. After approval, if approved, the commissioner shall issue a certificate of approval and the articles of incorporation must then be filed with the secretary of state, who shall record them and certify the fact thereon.\n[Repealed, 1984 c 618 s 61]",
	"repealed": false
}