{
	"id": "253D.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.24",
	"title": "253D.24 RETURN OF ABSENT PERSON.",
	"text": "If a committed person is absent without authorization, including failure to return to the custody of the Minnesota Sex Offender Program upon the revocation of a provisional discharge, the executive director shall report the absence to the local law enforcement agency. The executive director shall inform the committing court of the revocation or absence, and the committing court or other district court shall issue an order for the apprehension and holding of the committed person by a peace officer in any jurisdiction and transportation of the committed person to a facility operated by the Minnesota Sex Offender Program or otherwise returned to the custody of the Minnesota Sex Offender Program.\nAn employee of Direct Care and Treatment may apprehend, detain, or transport an absent committed person at any time. The immunity provided under section 253B.23, subdivision 4, applies to the apprehension, detention, and transport of an absent committed person.\nUpon receiving either the report or the apprehend and hold order in subdivision 1, a law enforcement agency shall enter information on the committed person into the missing persons file of the National Crime Information Center database according to the missing persons practices. Where probable cause exists of a violation of section 609.485, a law enforcement agency shall also seek a felony arrest warrant and enter the warrant in the National Crime Information Center database.\nFor the purposes of ensuring public safety and the apprehension of an absent committed person, and notwithstanding state and federal data privacy laws, the Minnesota Sex Offender Program shall disclose information about the absent committed person relevant to the person's apprehension and return to law enforcement agencies where the absent committed person is likely to be located or likely to travel through and to agencies with statewide jurisdiction.\nUpon receiving either the report or the apprehend and hold order in subdivision 1, a committed person shall be apprehended and held by a peace officer in any jurisdiction pending return to a facility operated by the Minnesota Sex Offender Program or otherwise returned to the custody of the Minnesota Sex Offender Program.\nA committed person detained solely under this section may be held in a jail or lockup only if:\n(1) there is no other feasible place of detention for the person;\n(2) the detention is for less than 24 hours; and\n(3) there are protections in place, including segregation of the person, to ensure the safety of the person.\nThese limitations do not apply to a committed person being held for criminal prosecution, including for violation of section 609.485.\nIf a committed person is detained under this section, the Minnesota Sex Offender Program shall arrange to pick up the person within 24 hours of the time detention was begun and shall be responsible for securing transportation for the person to a facility operated by the Minnesota Sex Offender Program, as determined by the executive director. The expense of detaining and transporting a committed person shall be the responsibility of the Minnesota Sex Offender Program.\nImmediately after an absent committed person is apprehended, the Minnesota Sex Offender Program or the law enforcement agency that apprehended or returned the absent committed person shall notify the law enforcement agency that first received the absent committed person report under this section, and that agency shall cancel the missing persons entry from the National Crime Information Center computer.",
	"repealed": false
}