{
	"id": "116L.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.90",
	"title": "116L.90 CANNABIS INDUSTRY TRAINING GRANTS.",
	"text": "The commissioner of employment and economic development shall establish CanTrain, a program to award grants to (1) eligible organizations to train people for work in the legal cannabis industry, and (2) eligible individuals to acquire such training.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Eligible organization\" means any organization capable of providing training relevant to the legal cannabis industry, particularly for individuals facing barriers to education or employment, and may include educational institutions, nonprofit organizations, private businesses, community groups, units of local government, labor organizations that represent cannabis workers in the state, or partnerships between different types of organizations.\n(d) \"Eligible individual\" means a Minnesota resident who is 21 years old or older.\n(e) \"Industry\" means the legal cannabis industry in Minnesota.\n(f) \"Program\" means the CanTrain grant program.\n(g) \"Social equity applicant\" means a person who meets the qualification requirements in section 342.17.\n(a) Grant money awarded to eligible organizations may be used for both developing a training program relevant to the legal cannabis industry and for providing such training to individuals.\n(b) The commissioner must award grants to eligible organizations through a competitive grant process.\n(c) To receive grant money, an eligible organization must submit a written application to the commissioner, using a form developed by the commissioner, explaining the organization's ability to train individuals for successful careers in the legal cannabis industry, particularly individuals facing barriers to education or employment.\n(d) An eligible organization's grant application must also include:\n(1) a description of the proposed training;\n(2) an analysis of the degree of demand in the legal cannabis industry for the skills gained through the proposed training;\n(3) any evidence of the organization's past success in training individuals for successful careers, particularly in new or emerging industries;\n(4) an estimate of the cost of providing the proposed training;\n(5) the sources and amounts of any nonstate funds or in-kind contributions that will supplement grant money, including any amounts that individuals will be charged to participate in the training; and\n(6) any additional information requested by the commissioner.\n(e) In awarding grants under this subdivision, the commissioner shall give weight to applications from organizations that demonstrate a history of successful career training, particularly for individuals facing barriers to education or employment. The commissioner shall also give weight to applications where the proposed training will:\n(1) result in an industry-relevant credential; or\n(2) include opportunities for hands-on or on-site experience in the industry.\nThe commissioner shall fund training for a broad range of careers in the legal cannabis industry, including both potential business owners and employees and for work in the growing, processing, and retail sectors of the legal cannabis industry.\n(a) The commissioner shall award grants of up to $20,000 to eligible individuals to pursue a training program relevant to a career in the legal cannabis industry.\n(b) To receive grant money, an eligible individual must submit a written application to the commissioner, using a form developed by the commissioner, identifying a training program relevant to the legal cannabis industry and the estimated cost of completing that training. The application must also indicate whether:\n(1) the applicant is eligible to be a social equity applicant;\n(2) the proposed training program results in an industry-relevant credential; and\n(3) the proposed training program includes opportunities for hands-on or on-site experience in the industry.\nThe commissioner shall attempt to make the application process simple for individuals to complete, such as by publishing lists of industry-relevant training programs along with the training program's estimated cost of completing the training programs and whether the training programs will result in an industry-relevant credential or include opportunities for hands-on or on-site experience in the legal cannabis industry.\n(c) The commissioner must award grants to eligible individuals through a lottery process. Applicants who have filed complete applications by the deadline set by the commissioner shall receive one entry in the lottery, plus one additional entry for each of the following:\n(1) being eligible to be a social equity applicant;\n(2) seeking to enroll in a training program that results in an industry-relevant credential; and\n(3) seeking to enroll in a training program that includes opportunities for hands-on or on-site experience in the industry.\n(d) Grant money awarded to eligible individuals shall be used to pay the costs of enrolling in a training program relevant to the legal cannabis industry, including tuition, fees, and materials costs. Grant money may also be used to remove external barriers to attending such a training program, such as the cost of child care, transportation, or other expenses approved by the commissioner.\nThe commissioner shall make extensive efforts to publicize these grants, including through partnerships with community organizations, particularly those organizations located in areas where long-term residents are eligible to be social equity applicants.\nBy January 15, 2024, and each January 15 thereafter, the commissioner must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over workforce development that describes awards given through the CanTrain program and the use of grant money, including any measures of success toward training people for successful careers in the legal cannabis industry.",
	"repealed": false
}