{
	"id": "168.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.381",
	"title": "168.381 MANUFACTURE OF VEHICLE PLATES; APPROPRIATIONS.",
	"text": "(a) Plates required by this chapter may be manufactured by the Minnesota Correctional Facility-St. Cloud, the Minnesota Correctional Facility-Stillwater, or other facility established by law for the confinement of persons convicted of felony, upon order from the commissioner. The order must state the quality of material desired in the plates, the plate specifications, and the amount or number desired.\n(b) Should the commissioner of corrections decide not to supply the required quantity of plates, or discontinue the manufacture of plates, the commissioner of public safety is authorized to seek other suppliers on a competitive basis.\n(a) Materials purchased to be used in the manufacture of plates must be tested as to conformance with specifications established by the commissioner in a privately operated laboratory service to be designated by the commissioner. The cost of the laboratory must be included in the cost of materials purchased.\n(b) The cost of delivery of plates to the commissioner at places designated by the commissioner must be included in the expenses incurred in their manufacture.\nThe commissioner shall establish new or revised specifications for the material and equipment used in the manufacture of plates ordered for manufacture after August 1, 1975, and may from time to time revise the specifications; provided that the specifications conform to the requirements of section 168.12. In establishing new or revised specifications, the commissioner shall consult with and give consideration to the advice and recommendations of representatives of the Minnesota State Patrol, local police officers' associations, and the county sheriffs' association.\n(a) Money appropriated to the Department of Public Safety to procure the plates for any fiscal year or years is available for allotment, encumbrance, and expenditure from and after the date of the enactment of the appropriation. Materials and equipment used in the manufacture of plates are subject only to the approval of the commissioner.\n(b) This section contemplates that money to be appropriated to the Department of Public Safety to carry out the terms and provisions of this section will be appropriated by the legislature from the highway user tax distribution fund.\n(c) A sum sufficient is appropriated annually from the driver and vehicle services operating account under section 299A.705 to the commissioner to pay the costs of purchasing, delivering, and mailing plates, registration stickers, and registration notices.",
	"repealed": false
}