{
	"id": "157.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.20",
	"title": "157.20 INSPECTION; FREQUENCY; RISK CATEGORIES; ORDERS.",
	"text": "It shall be the duty of the commissioner to inspect, or cause to be inspected, every public pool, food and beverage service establishment, hotel, motel, lodging establishment, or resort. For the purpose of conducting inspections, the commissioner shall have the right to enter and have access thereto at any time during the conduct of business.\n(a) The frequency of inspections of the establishments shall be based on the degree of health risk.\n(b) High-risk establishments must be inspected at least once every 12 months.\n(c) Medium-risk establishments must be inspected at least once every 18 months.\n(d) Low-risk establishments must be inspected at least once every 24 months.\n(a) High-risk establishment. \"High-risk establishment\" means a public pool, or any food and beverage service establishment, hotel, motel, lodging establishment, or resort that:\n(1) serves potentially hazardous foods that require extensive processing on the premises, including manual handling, cooling, reheating, or holding for service;\n(2) prepares foods several hours or days before service;\n(3) serves menu items that epidemiologic experience has demonstrated to be common vehicles of food-borne illness;\n(4) has a public swimming pool; or\n(5) draws its drinking water from a surface water supply.\n(b) Medium-risk establishment. \"Medium-risk establishment\" means a food and beverage service establishment, hotel, motel, lodging establishment, or resort that:\n(1) serves potentially hazardous foods but with minimal holding between preparation and service; or\n(2) serves foods, such as pizza, that require extensive handling followed by heat treatment.\n(c) Low-risk establishment. \"Low-risk establishment\" means a food and beverage service establishment, hotel, motel, lodging establishment, or resort that is not a high-risk or medium-risk establishment.\n(d) Risk exceptions. Mobile food units, seasonal permanent and seasonal temporary food stands, food carts, and special event food stands are not inspected on an established schedule and therefore are not defined as high-risk, medium-risk, or low-risk establishments.\n(e) School inspection frequency. Elementary and secondary school food service establishments must be inspected according to the assigned risk category or by the frequency required in the Richard B. Russell National School Lunch Act, whichever frequency is more restrictive.\nWhen, upon inspection, it is found that the business and property so inspected is not being conducted, or is not equipped, in the manner required by the provisions of this chapter or the rules of the commissioner, or is being conducted in violation of any of the laws of this state pertaining to the business, it is the duty of the commissioner to notify the person in charge of the business, or the owner or agent of the buildings so occupied, of the condition found and issue an order for correction of the violations. Each person shall comply with the provisions of this chapter or the rules of the commissioner. A reasonable time may be granted by the commissioner for compliance with the provisions of this chapter.\n(a) A local agency operating with a delegation agreement under section 145A.07 may request approval from the commissioner to supplant subdivisions 1 to 3 with alternative compliance methods. The local agency must submit to the commissioner:\n(1) the alternative compliance methods that will be taken to ensure an equivalent degree of protection to public health, safety, or the environment;\n(2) the reasons why alternative methods are requested;\n(3) a plan for evaluating the effectiveness of the alternative methods;\n(4) a statement that the local agency applying for approval of the alternative methods will comply with the terms, if granted; and\n(5) other relevant information the commissioner determines necessary to evaluate the request.\n(b) The commissioner may approve the request if the alternative methods will have no potential adverse effect on public health, safety, or the environment and if the alternative methods are equivalent to or superior to those prescribed in subdivisions 1 to 3. In approving the request, the commissioner may attach conditions the commissioner determines are needed to protect public health, safety, or the environment. The commissioner shall notify the local agency in writing of the commissioner's decision to approve or deny the request. If a request is denied, the commissioner shall specify the reasons for the denial.\n(a) A person may request a variance from all parts of Minnesota Rules, chapter 4626, except as provided in paragraph (b) or Minnesota Rules, chapter 4626. At the time of application for plan review, the person, operator, or submitter must be notified of the right to request variances.\n(b) No variance may be requested or approved for the following parts of Minnesota Rules, chapter 4626:\n(1) Minnesota Rules, part 4626.0020, subpart 35;\n(2) Minnesota Rules, parts 4626.0040 to 4626.0060;\n(3) Minnesota Rules, parts 4626.0065 to 4626.0100;\n(4) Minnesota Rules, parts 4626.0105 to 4626.0120;\n(5) Minnesota Rules, part 4626.1565;\n(6) Minnesota Rules, parts 4626.1590 and 4626.1595; and\n(7) Minnesota Rules, parts 4626.1600 to 4626.1675.",
	"repealed": false
}