{
	"id": "38.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/38.02",
	"title": "38.02 AID, DISTRIBUTION.",
	"text": "(a) Money appropriated to aid county and district agricultural societies and associations shall be distributed among all county and district agricultural societies or associations in the state pro rata, upon condition that each of them has complied with the conditions specified in paragraph (b).\n(b) To be eligible to participate in the distribution of aid, each agricultural society or association shall have:\n(1) held an annual fair for each of the three years last past, unless prevented from doing so because of a calamity or an epidemic declared by the community health board as defined in section 145A.02, subdivision 5, the state commissioner of health, or the Board of Animal Health to exist;\n(2) an annual membership of 15 or more;\n(3) paid out to exhibitors for premiums awarded at the last fair held a sum not less than the amount to be received from the state;\n(4) published and distributed, or made available on an Internet website, not less than three weeks before the opening day of the fair a premium list, listing all items or articles on which premiums are offered and the amounts of such premiums and shall have paid premiums pursuant to the amount shown for each article or item to be exhibited; provided that premiums for school exhibits may be advertised in the published premium list by reference to a school premium list prepared and circulated during the preceding school year; and shall have collected all fees charged for entering an exhibit at the time the entry was made and in accordance with schedule of entry fees to be charged as published in the premium list;\n(5) paid not more than one premium on each article or item exhibited, excluding championship or sweepstake awards, and excluding the payment of open class premium awards to 4H Club exhibits which at this same fair had won a first prize award in regular 4H Club competition; and\n(6) submitted to the commissioner of agriculture on or before the first day of November of the year in which the fair was held its annual report of premiums paid.\n(c) All payments authorized under the provisions of this chapter shall be made only upon the presentation by the commissioner of agriculture with the commissioner of management and budget of a statement of premium allocations. As used herein the term premium shall mean the cash award paid to an exhibitor for the merit of an exhibit of livestock, livestock products, grains, fruits, flowers, vegetables, articles of domestic science, handicrafts, hobbies, fine arts, other products of a creative nature, and articles made by school pupils, or the cash award paid to the merit winner of events such as 4H Club or Future Farmer contest, youth group contests, school spelling contests and school current events contests, the award corresponding to the amount offered in the advertised premium list referred to in schedule 2. Payments of awards for horse races, horse pulls, tractor pulls, demolition derby, automobile or other racing, jackpot premiums, ball games, musical contests, talent contests, parades, and for amusement features for which admission is charged, are specifically excluded from consideration as premiums within the meaning of that term as used herein. The amount shall be computed as follows: On the first $750 premiums paid by each society or association at the last fair held, the society or association shall receive 100 percent reimbursement; on the second $750 premiums paid, 80 percent; on the third $750 premiums paid, 60 percent; and on any sum in excess of $2,250, 40 percent. The commissioner of management and budget shall make payments not later than July 15 of the year following the calendar year in which the annual fair was held to those agricultural societies or associations entitled to payments under the provisions of this chapter.\n(d) If the total amount of state aid to which the agricultural societies and associations are entitled under the provisions of this chapter exceeds the amount of the appropriation, the amounts to which the societies or associations are entitled shall be prorated so that the total payments by the state will not exceed the appropriation.\nA livestock and livestock product exhibit for which a premium may be paid pursuant to subdivision 1, paragraph 3, includes, but is not limited to, livestock exhibited live on the association or society grounds and the carcass of the same animal exhibited later at a place of slaughter off the association or society grounds.\n[Repealed, 2004 c 254 s 49]\n[Repealed, 2009 c 94 art 1 s 107]\n[Repealed, 2009 c 94 art 1 s 107]",
	"repealed": false
}