{
	"id": "80A.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.57",
	"title": "80A.57 SECTION 402; AGENT REGISTRATION REQUIREMENT AND EXEMPTIONS.",
	"text": "(a) Registration requirement. It is unlawful for an individual to transact business in the state as an agent unless the individual is registered under this chapter as an agent or is exempt from registration as an agent under subsection (b).\n(b) Exemptions from registration. The following individuals are exempt from the registration requirement of subsection (a):\n(1) an individual who represents a broker-dealer in effecting transactions in this state limited to those described in Section 15(h)(2) of the Securities Exchange Act of 1934 (15 U.S.C. Section 78(o)(2));\n(2) an individual who represents a broker-dealer that is exempt under section 80A.56(b) or (d);\n(3) an individual who represents an issuer with respect to an offer or sale of the issuer's own securities or those of the issuer's parent or any of the issuer's subsidiaries, and who is not compensated in connection with the individual's participation by the payment of commissions or other remuneration based, directly or indirectly, on transactions in those securities;\n(4) an individual who represents an issuer and who effects transactions in the issuer's securities exempted by section 80A.46, other than section 80A.46(11) and (14);\n(5) an individual who represents an issuer that effects transactions solely in federal covered securities of the issuer, but an individual who effects transactions in a federal covered security under Section 18(b)(3) or 18(b)(4)(D) of the Securities Act of 1933 (15 U.S.C. Section 77r(b)(3) or 77r(b)(4)(D)) is not exempt if the individual is compensated in connection with the agent's participation by the payment of commissions or other remuneration based, directly or indirectly, on transactions in those securities;\n(6) an individual who represents a broker-dealer registered in this state under section 80A.56(a) or exempt from registration under section 80A.56(b) in the offer and sale of securities for an account of a nonaffiliated federal covered investment adviser with investments under management in excess of $100,000,000 acting for the account of others pursuant to discretionary authority in a signed record;\n(7) an individual who represents an issuer in connection with the purchase of the issuer's own securities;\n(8) an individual who represents an issuer and who restricts participation to performing clerical or ministerial acts;\n(9) an individual who represents an issuer in effecting transactions in a security exempted by section 80A.45;\n(10) an individual who represents an issuer in effecting transactions with existing employees, partners, or directors of the issuer if no commission or other remuneration is paid or given directly or indirectly for soliciting any person in this state;\n(11) an individual who represents one or more issuers with respect to an offer or sale of the issuer's securities if the offer or sale of the securities is exempted by section 80A.46(11) or 80A.46(14) and the individual complies with or satisfies each of the following conditions:\n(A) the individual (i) would not be deemed disqualified pursuant to section 80A.50(b)(3)(D)(ii) to (iv); (ii) is not employed by or associated with a broker-dealer; and (iii) has not been the subject of (a) an action, order, or decision by any self-regulatory organization, commodities exchange, or securities exchange resulting in a censure or other sanction within 12 months prior to the offer or sale or (b) a denial, revocation, or restriction of any license or membership by any self-regulatory organization, commodities exchange, or securities exchange that has been effective at any time within 12 months prior to the offer or sale;\n(B) neither the individual nor any person associated with the individual handles or takes possession of funds or securities;\n(C) the individual files with the administrator a consent to service of process complying with section 80A.88 before commencing any such representation; and\n(D) the individual files with the administrator a notice that contains (i) the full legal name, address, and phone of the individual; (ii) any other names used by the individual in the prior five years; (iii) a statement whether the individual is, or within the prior five years has been, licensed by or registered with any state or federal government, government agency, or any self-regulatory organization, commodities exchange, or securities exchange as a broker-dealer, registered representative, investment advisor, or investment advisor representative, including, if applicable, the individual's IARD/CRD number; (iv) an undertaking to notify the administrator in writing of a change in any of the foregoing within five business days of such change; and (v) any additional information that may be required by rule adopted or order issued under this chapter. This notice must be filed before the individual commences any issuer representation. The notice is effective through December 31 of the year following the year in which it is filed and may be renewed annually in such manner as prescribed by the administrator; and\n(12) any other individual exempted by rule adopted or order issued under this chapter.\n(c) Registration effective only while employed or associated. The registration of an agent is effective only while the agent is employed by or associated with a broker-dealer registered under this chapter or an issuer that is offering, selling, or purchasing its securities in this state.\n(d) Limit on employment or association. It is unlawful for a broker-dealer, or an issuer engaged in offering, selling, or purchasing securities in this state, to employ or associate with an agent who transacts business in the state on behalf of broker-dealers or issuers unless the agent is registered under subsection (a) or exempt from registration under subsection (b).\n(e) Limit on affiliations. An individual may not act as an agent for more than one broker-dealer or one issuer at a time, unless the broker-dealer or the issuer for which the agent acts are affiliated by direct or indirect common control or are authorized by rule or order under this chapter.",
	"repealed": false
}