{
	"id": "177.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.25",
	"title": "177.25 OVERTIME.",
	"text": "No employer may employ an employee for a workweek longer than 48 hours, unless the employee receives compensation for employment in excess of 48 hours in a workweek at a rate of at least 1-1/2 times the regular rate at which the employee is employed. The state of Minnesota or a political subdivision may grant time off at the rate of 1-1/2 hours for each hour worked in excess of 48 hours in a week in lieu of monetary compensation. An employer does not violate the overtime pay provisions of this section by employing any employees for a workweek in excess of 48 hours without paying the compensation for overtime employment prescribed (1) if the employee is employed under an agreement meeting the requirement of section 7(b)(2) of the Fair Labor Standards Act of 1938, as amended, or (2) if the employee is employed as a sugar beet hand laborer on a piece rate basis, provided that the regular rate of pay received per hour of work exceeds the applicable wage provided in section 177.24, subdivision 1 by at least 40 cents.\nAn employer who operates a health care facility does not violate subdivision 1 if the employer and employee agree before performance of the work to accept a work period of 14 consecutive days in lieu of the workweek of seven consecutive days for the purpose of overtime compensation and if for the employment in excess of eight hours in any workday and in excess of 80 hours in the 14-day period the employee receives compensation at a rate not less than 1-1/2 times the regular rate at which the employee is employed.\nSubdivision 1 does not apply to any salesperson, parts person, or mechanic primarily engaged in selling or servicing automobiles, trailers, trucks, or farm implements and paid on a commission or incentive basis, if employed by a nonmanufacturing establishment primarily engaged in selling the vehicles to ultimate purchasers.\nSubdivision 1 does not apply if the employee is employed in the construction of on-farm silos or the installation of appurtenant equipment on a unit or piece rate basis, if the regular rate of pay received per hour of work exceeds the applicable wage provided in section 177.24, subdivision 1.\nSubdivision 1 does not apply to employees of air carriers subject to the provisions of title II of the Railway Labor Act, when the hours worked by an employee in excess of 48 in a workweek are not required by the carrier, but are arranged through a voluntary agreement among employees to trade scheduled work hours.",
	"repealed": false
}