{
	"id": "611.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.24",
	"title": "611.24 CHIEF APPELLATE PUBLIC DEFENDER; ORGANIZATION OF OFFICE; ASSISTANTS.",
	"text": "(a) Beginning January 1, 2007, and for every four years after that date, the State Board of Public Defense shall appoint a chief appellate public defender in charge of appellate services, who shall employ or retain assistant state public defenders and other personnel as may be necessary to discharge the functions of the office. The chief appellate public defender shall serve a four-year term and may only be removed before the end of a term by a majority vote of board members present at a meeting of the State Board of Public Defense. The chief appellate public defender shall be a full-time qualified attorney, licensed to practice law in this state, and serve in the unclassified service of the state. Vacancies in the office shall be filled by the appointing authority for the unexpired term.\n(b) An assistant state public defender shall be a qualified attorney licensed to practice law in this state. Retained or part-time employed assistant state public defenders may engage in the general practice of law. The compensation of the chief appellate public defender shall be set by the State Board of Public Defense. The chief appellate public defender shall devote full time to the performance of duties and shall not engage in the general practice of law.\nIf the chief appellate public defender or a district public defender deems it necessary to make a motion for a new trial, to take an appeal, or other postconviction proceedings in order to properly represent a defendant or other person whom that public defender had been directed to represent, that public defender may use the transcripts of the testimony and other proceedings filed with the court administrator of the district court as provided by section 243.49.\nIn appeal cases and postconviction cases where the appellate public defender's office does not have sufficient funds to pay for transcripts and other necessary expenses because it has spent or committed all of the transcript funds in its annual budget, the Board of Public Defense may pay for these transcripts and other necessary expenses from county program aid transferred by the commissioner of revenue for that purpose under section 477A.03, subdivision 2b, paragraph (a).\nOn or before January 15 of each year, the chief judge of the judicial district, after consultation with city and county attorneys, the chief public defender, and members of the private bar in the district, shall establish a reimbursement rate for attorney fees and costs associated with representation of a defendant on appeal. The compensation to be paid to an attorney for such service rendered to a defendant under this subdivision may not exceed $10,000, exclusive of reimbursement for expenses reasonably incurred, unless payment in excess of that limit is certified by the chief judge of the district as necessary to provide fair compensation for services of an unusual character or duration.",
	"repealed": false
}