{
	"id": "169.812",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.812",
	"title": "169.812 ESCORT VEHICLES FOR OVERDIMENSIONAL LOADS; DEFINITIONS; REQUIREMENTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Licensed peace officer\" means a law enforcement officer licensed under sections 626.84 to 626.863, who holds a certificate under section 299D.085, and who may operate an authorized emergency vehicle and direct and control traffic and require traffic to yield to an overdimensional load.\n(c) \"Escort driver\" means an individual who holds a certificate under section 299D.085 and is authorized to control and direct traffic as a flagger during the movement of an overdimensional load following the Manual on Uniform Traffic Control Devices standards as defined by the Federal Highway Administration and section 169.06, subdivision 4.\n(d) \"Flagger\" means a person who actively controls the flow of vehicular traffic into, through, or into and through a temporary traffic control zone using hand-signaling devices or an automated flagger assistance device.\n(e) \"Overdimensional load\" is a vehicle or combination of vehicles of a size or weight of vehicle or load exceeding the maximum specified in this chapter, or otherwise not in conformity with the provisions of this chapter.\n(a) Except as provided in paragraphs (d) and (e), no escort vehicle is required if the width of an overdimensional load is 15 feet or less as measured at the bottom of the load or is 16 feet or less as measured at the top of the load.\n(b) Only one rear escort vehicle is required on a multilane divided roadway if the width of an overdimensional load is more than 15 feet as measured at the bottom of the load or is more than 16 feet as measured at the top of the load.\n(c) Only one lead escort vehicle and one rear escort vehicle is required on any undivided roadway if the width of an overdimensional load is more than 15 feet as measured at the bottom of the load or is more than 16 feet as measured at the top of the load.\n(d) One lead escort vehicle, one rear escort vehicle, and one lead licensed peace officer is required when any part of an overdimensional load or a vehicle transporting an overdimensional load extends beyond the left of the centerline on an undivided roadway.\n(e) The commissioner may require additional escorts when deemed necessary to protect public safety or to ensure against undue damage to the road foundations, surfaces, or structures. The commissioner must specify in the permit (1) the number of additional escorts required; and (2) whether the operators of the escort vehicles must be licensed peace officers or may be escort drivers, as defined in subdivision 1.\n(a) When a vehicle transporting an overdimensional load is operated on a multilane divided roadway:\n(1) only one rear escort vehicle is required if the overdimensional load has an overall length exceeding 110 feet; or\n(2) only one lead escort vehicle and one rear escort vehicle is required if the overdimensional load has an overall length exceeding 150 feet.\n(b) One lead escort vehicle and one rear escort vehicle is required on any undivided roadway if the overall length of the overdimensional load exceeds 110 feet.\n(c) Notwithstanding paragraphs (a) and (b), the commissioner may require additional escorts when deemed necessary to protect public safety or to ensure against undue damage to the road foundations, surfaces, or structures. The commissioner must specify in the permit (1) the number of additional escorts required; and (2) whether the operators of the escort vehicles must be licensed peace officers or may be escort drivers, as defined in subdivision 1.",
	"repealed": false
}