{
	"id": "609.904",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.904",
	"title": "609.904 CRIMINAL PENALTIES.",
	"text": "A person convicted of violating section 609.903 may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $1,000,000, or both.\nIn lieu of the fine authorized by subdivision 1, a person convicted of violating section 609.903, who received economic gain from the act or caused economic loss or personal injury during the act, may be sentenced to pay a fine calculated under this subdivision. The maximum fine is three times the gross value gained or three times the gross loss caused, whichever is greater, plus court costs and the costs of investigation and prosecution reasonably incurred, less the value of any property forfeited under section 609.905. The district court shall hold a hearing to determine the amount of the fine authorized by this subdivision. In imposing a fine, the court shall consider the seriousness of the conduct, whether the amount of the fine is disproportionate to the conduct in which the person engaged, its impact on victims and any legitimate enterprise involved in that conduct, as well as the economic circumstances of the convicted person, including the effect of the imposition of the fine on the person's immediate family. For purposes of this subdivision, loss does not include pain and suffering.\nAfter the entry of a judgment that includes a fine or an order of criminal forfeiture under section 609.905, the district court may enter a restraining order or injunction, require the execution of a satisfactory performance bond, or take other action, including the appointment of a receiver, that the court deems proper to protect the interests of the prosecuting authority in collecting the money or forfeiture or an innocent party.\nThe court shall apply fines collected under this section to the costs and expenses of investigation and prosecution, including costs of resources and personnel incurred in investigation and prosecution and the balance, if any, as provided under section 574.34.\nIn a settlement discussion or before the imposition of a sentence under this section, the prosecuting authority shall vigorously advocate full and complete restitution to an aggrieved person. Before the acceptance of a plea or after a verdict but before the imposition of a sentence under this section, the district court must ensure that full and complete restitution has been duly effected or that a satisfactory explanation of why it is impractical has been made to the court.",
	"repealed": false
}