{
	"id": "216B.2424",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2424",
	"title": "216B.2424 BIOMASS POWER MANDATE.",
	"text": "(a) For the purposes of this section, \"farm-grown closed-loop biomass\" means herbaceous crops, trees, agricultural waste, and aquatic plant matter that is used to generate electricity, but does not include mixed municipal solid waste, as defined in section 115A.03, and that:\n(1) is intentionally cultivated, harvested, and prepared for use, in whole or in part, as a fuel for the generation of electricity;\n(2) when combusted, releases an amount of carbon dioxide that is less than or approximately equal to the carbon dioxide absorbed by the biomass fuel during its growing cycle; and\n(3) is fired in a new or substantially retrofitted electric generating facility that is:\n(i) located within 400 miles of the site of the biomass production; and\n(ii) designed to use biomass to meet at least 75 percent of its fuel requirements.\n(b) The legislature finds that the negative environmental impacts within 400 miles of the facility resulting from transporting and combusting the biomass are offset in that region by the environmental benefits to air, soil, and water of the biomass production.\n(c) Among the biomass fuel sources that meet the requirements of paragraph (a), clauses (1) and (2), are poplar, aspen, willow, switch grass, sorghum, alfalfa, cultivated prairie grass, and sustainably managed woody biomass.\n(d) For the purpose of this section, \"sustainably managed woody biomass\" means:\n(1) brush, trees, and other biomass harvested from within designated utility, railroad, and road rights-of-way;\n(2) upland and lowland brush harvested from lands incorporated into brushland habitat management activities of the Minnesota Department of Natural Resources;\n(3) upland and lowland brush harvested from lands managed in accordance with Minnesota Department of Natural Resources \"Best Management Practices for Managing Brushlands\";\n(4) logging slash or waste wood that is created by harvest, by precommercial timber stand improvement to meet silvicultural objectives, or by fire, disease, or insect control treatments, and that is managed in compliance with the Minnesota Forest Resources Council's \"Sustaining Minnesota Forest Resources: Voluntary Site-Level Forest Management Guidelines for Landowners, Loggers and Resource Managers\" as modified by the requirement of this subdivision; and\n(5) trees or parts of trees that do not meet the utilization standards for pulpwood, posts, bolts, or sawtimber as described in the Minnesota Department of Natural Resources Division of Forestry Timber Sales Manual, 1998, as amended as of May 1, 2005, and the Minnesota Department of Natural Resources Timber Scaling Manual, 1981, as amended as of May 1, 2005, except as provided in paragraph (a), clause (1), and this paragraph, clauses (1) to (3).\n(a) This subdivision applies only to a biomass project owned or controlled, directly or indirectly, by two municipal utilities as described in subdivision 5a, paragraph (b).\n(b) Woody biomass from state-owned land must be harvested in compliance with an adopted management plan and a program of ecologically based third-party certification.\n(c) The project must prepare a fuel plan on an annual basis after commercial operation of the project as described in the power contract between the project and the public utility, and must also prepare annually certificates reflecting the types of fuel used in the preceding year by the project, as described in the power contract. The fuel plans and certificates shall also be filed with the Minnesota Department of Natural Resources and the Minnesota Department of Commerce within 30 days after being provided to the public utility, as provided by the power contract. Any person who believes the fuel plans, as amended, and certificates show that the project does not or will not comply with the fuel requirements of this subdivision may file a petition with the commission seeking such a determination.\n(d) The wood procurement process must utilize third-party audit certification systems to verify that applicable best management practices were utilized in the procurement of the sustainably managed biomass. If there is a failure to so verify in any two consecutive years during the original contract term, the farm-grown closed-loop biomass requirements of subdivision 2 must be increased to 50 percent for the remaining contract term period; however, if in two consecutive subsequent years after the increase has been implemented, it is verified that the conditions in this subdivision have been met, then for the remaining original contract term the closed-loop biomass mandate reverts to 25 percent. If there is a subsequent failure to verify in a year after the first failure and implementation of the 50 percent requirement, then the closed-loop percentage shall remain at 50 percent for each remaining year of the contract term.\n(e) In the closed-loop plantation, no transgenic plants may be used.\n(f) No wood may be harvested from any lands identified by the final or preliminary Minnesota County Biological Survey as having statewide significance as native plant communities, large populations or concentrations of rare species, or critical animal habitat.\n(g) A wood procurement plan must be prepared every five years and public meetings must be held and written comments taken on the plan and documentation must be provided on why or why not the public inputs were used.\n(h) Guidelines or best management practices for sustainably managed woody biomass must be adopted by:\n(1) the Minnesota Department of Natural Resources for managing and maintaining brushland and open land habitat on public and private lands, including, but not limited to, provisions of sections 84.941, 84.942, and 97A.125; and\n(2) the Minnesota Forest Resources Council for logging slash, using the most recent available scientific information regarding the removal of woody biomass from forest lands, to sustain the management of forest resources as defined by section 89.001, subdivisions 8 and 9, with particular attention to soil productivity, biological diversity as defined by section 89A.01, subdivision 3, and wildlife habitat.\nThese guidelines must be completed by July 1, 2007, and the process of developing them must incorporate public notification and comment.\n(i) The University of Minnesota Initiative for Renewable Energy and the Environment is encouraged to solicit and fund high-quality research projects to develop and consolidate scientific information regarding the removal of woody biomass from forest and brush lands, with particular attention to the environmental impacts on soil productivity, biological diversity, and sequestration of carbon. The results of this research shall be made available to the public.\n(j) The two utilities owning or controlling, directly or indirectly, the biomass project described in subdivision 5a, paragraph (b), shall fund or obtain funding from nonstate sources of up to $150,000 by April 1, 2006, to complete the guidelines or best management practices described in paragraph (h). The expenditures to be funded under this paragraph do not include any of the expenditures to be funded under paragraph (i).\n(a) A biomass project proposing to use, as its primary fuel over the life of the project, short-rotation woody crops, may use as an interim fuel agricultural waste and other biomass which is not farm-grown closed-loop biomass for up to six years after the project's electric generating facility becomes operational; provided, the project developer demonstrates the project will use the designated short-rotation woody crops as its primary fuel after the interim period and provided the location of the interim fuel production meets the requirements of subdivision 1, paragraph (a), clause (3).\n(b) A biomass project proposing to use, as its primary fuel over the life of the project, short-rotation woody crops, may use as an interim fuel agricultural waste and other biomass which is not farm-grown closed-loop biomass for up to three years after the project's electric generating facility becomes operational; provided, the project developer demonstrates the project will use the designated short-rotation woody crops as its primary fuel after the interim period.\n(c) A biomass project that uses an interim fuel under the terms of paragraph (b) may, in addition, use an interim fuel under the terms of paragraph (a) for six years less the number of years that an interim fuel was used under paragraph (b).\n(d) A project developer proposing to use an exempt interim fuel under paragraphs (a) and (b) must demonstrate to the public utility that the project will have an adequate supply of short-rotation woody crops which meet the requirements of subdivision 1 to fuel the project after the interim period.\n(e) If a biomass project using an interim fuel under this subdivision is or becomes owned or controlled, directly or indirectly, by two municipal utilities as described in subdivision 5a, paragraph (b), the project is deemed to comply with the requirement under this subdivision to use as its primary fuel farm-grown closed-loop biomass if farm-grown closed-loop biomass comprises no less than 25 percent of the fuel used over the life of the project. For purposes of this subdivision, \"life of the project\" means 20 years from the date the project becomes operational or the term of the applicable power purchase agreement between the project owner and the public utility, whichever is longer.\nOver the duration of the contract of a biomass power facility selected to satisfy the mandate in subdivision 5, fuel sources that are not biomass may be used to satisfy up to 25 percent of the fuel requirements of a biomass power facility selected to satisfy the biomass power mandate in subdivision 5, except that agricultural crop wastes, such as oat hulls, may be used to satisfy more than 25 percent of the fuel requirements of a power facility selected to satisfy the biomass power mandate in subdivision 5 if the wastes are co-fired with the fuel authorized for the facility. A biomass power facility selected to satisfy the mandate in subdivision 5 also may use fuel sources that are not biomass during any period when biomass fuel sources are not reasonably available to the facility due to any circumstances constituting an act of God. Fuel sources that are not biomass used during such a period of biomass fuel source unavailability shall not be counted toward the 25 percent exemption provided in this subdivision. For purposes of this subdivision, \"act of God\" means any natural disaster or other natural phenomenon of an exceptional, inevitable, or irresistible character, including, but not limited to, flood, fire, drought, earthquake, and crop failure resulting from climatic conditions, infestation, or disease.\nA biomass project developer must demonstrate to the public utility evidence of sufficient financial viability necessary for the construction and operation of the biomass project.\n(a) A public utility, as defined in section 216B.02, subdivision 4, that operates a nuclear-powered electric generating plant within this state must construct and operate, purchase, or contract to construct and operate (1) by December 31, 1998, 50 megawatts of electric energy installed capacity generated by farm-grown closed-loop biomass scheduled to be operational by December 31, 2001; and (2) by December 31, 1998, an additional 75 megawatts of installed capacity so generated scheduled to be operational by December 31, 2002.\n(b) Of the 125 megawatts of biomass electricity installed capacity required under this subdivision, no more than 55 megawatts of this capacity may be provided by a facility that uses poultry litter as its primary fuel source and any such facility:\n(1) need not use biomass that complies with the definition in subdivision 1;\n(2) must enter into a contract with the public utility for such capacity, that has an average purchase price per megawatt hour over the life of the contract that is equal to or less than the average purchase price per megawatt hour over the life of the contract in contracts approved by the Public Utilities Commission before April 1, 2000, to satisfy the mandate of this section, and file that contract with the Public Utilities Commission prior to September 1, 2000; and\n(3) must schedule such capacity to be operational by December 31, 2002.\n(c) Of the total 125 megawatts of biomass electric energy installed capacity required under this section, no more than 75 megawatts may be provided by a single project.\n(d) Of the 75 megawatts of biomass electric energy installed capacity required under paragraph (a), clause (2), no more than 33 megawatts of this capacity may be provided by a St. Paul district heating and cooling system cogeneration facility utilizing waste wood as a primary fuel source. The St. Paul district heating and cooling system cogeneration facility need not use biomass that complies with the definition in subdivision 1.\n(e) The public utility must accept and consider on an equal basis with other biomass proposals:\n(1) a proposal to satisfy the requirements of this section that includes a project that exceeds the megawatt capacity requirements of either paragraph (a), clause (1) or (2), and that proposes to sell the excess capacity to the public utility or to other purchasers; and\n(2) a proposal for a new facility to satisfy more than ten but not more than 20 megawatts of the electrical generation requirements by a small business-sponsored independent power producer facility to be located within the northern quarter of the state, which means the area located north of Constitutional Route No. 8 as described in section 161.114, subdivision 2, and that utilizes biomass residue wood, sawdust, bark, chipped wood, or brush to generate electricity. A facility described in this clause is not required to utilize biomass complying with the definition in subdivision 1, but must be under construction by December 31, 2005.\n(f) If a public utility files a contract with the commission for electric energy installed capacity that uses poultry litter as its primary fuel source, the commission must do a preliminary review of the contract to determine if it meets the purchase price criteria provided in paragraph (b), clause (2). The commission shall perform its review and advise the parties of its determination within 30 days of filing of such a contract by a public utility. A public utility may submit by September 1, 2000, a revised contract to address the commission's preliminary determination.\n(g) The commission shall finally approve, modify, or disapprove no later than July 1, 2001, all contracts submitted by a public utility as of September 1, 2000, to meet the mandate set forth in this subdivision.\n(h) If a public utility subject to this section exercises an option to increase the generating capacity of a project in a contract approved by the commission prior to April 25, 2000, to satisfy the mandate in this subdivision, the public utility must notify the commission by September 1, 2000, that it has exercised the option and include in the notice the amount of additional megawatts to be generated under the option exercised. Any review by the commission of the project after exercise of such an option shall be based on the same criteria used to review the existing contract.\n(i) A facility specified in this subdivision qualifies for exemption from property taxation under section 272.02, subdivision 45.\n(a) Notwithstanding subdivision 5, the biomass electric energy mandate must be reduced from 125 megawatts to 110 megawatts.\n(b) The Public Utilities Commission shall approve a request pending before the commission as of May 15, 2003, for amendments to and assignment of a power purchase agreement with the owner of a facility that uses short-rotation, woody crops as its primary fuel previously approved to satisfy a portion of the biomass mandate if the owner of the project agrees to reduce the size of its project from 50 megawatts to 35 megawatts, while maintaining an average price for energy in nominal dollars measured over the term of the power purchase agreement at or below $104 per megawatt-hour, exclusive of any price adjustments that may take effect subsequent to commission approval of the power purchase agreement, as amended. The commission shall also approve, as necessary, any subsequent assignment or sale of the power purchase agreement or ownership of the project to an entity owned or controlled, directly or indirectly, by two municipal utilities located north of Constitutional Route No. 8, as described in section 161.114, which currently own electric and steam generation facilities using coal as a fuel and which propose to retrofit their existing municipal electrical generating facilities to utilize biomass fuels in order to perform the power purchase agreement.\n(c) If the power purchase agreement described in paragraph (b) is assigned to an entity that is, or becomes, owned or controlled, directly or indirectly, by two municipal entities as described in paragraph (b), and the power purchase agreement meets the price requirements of paragraph (b), the commission shall approve any amendments to the power purchase agreement necessary to reflect the changes in project location and ownership and any other amendments made necessary by those changes. The commission shall also specifically find that:\n(1) the power purchase agreement complies with and fully satisfies the provisions of this section to the full extent of its 35-megawatt capacity;\n(2) all costs incurred by the public utility and all amounts to be paid by the public utility to the project owner under the terms of the power purchase agreement are fully recoverable pursuant to section 216B.1645;\n(3) subject to prudency review by the commission, the public utility may recover from its Minnesota retail customers the amounts that may be incurred and paid by the public utility during the full term of the power purchase agreement; and\n(4) if the purchase power agreement meets the requirements of this subdivision, it is reasonable and in the public interest.\n(d) The commission shall specifically approve recovery by the public utility of any and all Minnesota jurisdictional costs incurred by the public utility to improve, construct, install, or upgrade transmission, distribution, or other electrical facilities owned by the public utility or other persons in order to permit interconnection of the retrofitted biomass-fueled generating facilities or to obtain transmission service for the energy provided by the facilities to the public utility pursuant to section 216B.1645, and shall disapprove any provision in the power purchase agreement that requires the developer or owner of the project to pay the jurisdictional costs or that permit the public utility to terminate the power purchase agreement as a result of the existence of those costs or the public utility's obligation to pay any or all of those costs.\n(e) Upon request by the project owner, the public utility shall agree to amend the power purchase agreement described in paragraph (b) and approved by the commission as required by paragraph (c). The amendment must be negotiated and executed within 45 days of May 14, 2013, and must apply to prices paid after January 1, 2014. The average price for energy in nominal dollars measured over the term of the power purchase agreement must not exceed $109.20 per megawatt hour. The public utility shall request approval of the amendment by the commission within 30 days of execution of the amended power purchase agreement. The amendment is not effective until approval by the commission. The commission shall act on the amendment within 90 days of submission of the request by the public utility. Upon approval of the amended power purchase agreement, the commission shall allow the public utility to recover the costs of the amended power purchase agreement, as provided in section 216B.1645.\n(f) With respect to the power purchase agreement described in paragraph (b), and amended and approved by the commission pursuant to paragraphs (c) and (e), upon request by the project owner, the public utility shall agree to amend the power purchase agreement to include a fuel cost adjustment clause which requires the public utility to reimburse the project owner monthly for all costs incurred by the project owner during the applicable month to procure and transport all fuel used to produce energy for delivery to the public utility pursuant to the power purchase agreement to the extent such costs exceeded $3.40 per million metric British thermal unit (MMBTU), in addition to the price to be paid for the energy produced and delivered by the project owner. Reimbursable costs include but are not limited to: (1) all costs incurred to load fuel at its source; (2) costs to transport fuel (i) to the biomass-fueled generating facilities or to an intermediate woodyard, storage facility, or handling facility, or (ii) from a facility to the biomass-fueled generating facilities; (3) depreciation of any depreciable loading, woodyard, storage, handling, or transportation equipment whether the vehicle or equipment is located at the fuel source, a woodyard, storage facility, handling facility, or at the generating facilities; and (4) costs to unload fuel at the generating facilities. Beginning with 2014, at the end of each calendar year of the term of the power purchase agreement, the project owner shall calculate the amount by which actual fuel costs for the year exceeded $3.40 per MMBTU, and prior monthly payment for such fuel costs shall be reconciled against actual fuel costs for the applicable calendar year. If such prior monthly fuel payments for the year in the aggregate exceed the amount due based on the annual calculation, the project owner shall credit the public utility for the excess paid. If the annual calculation of fuel costs due exceeds the prior monthly fuel payments for the year in the aggregate, the project owner shall be entitled to be paid for the deficiency with the next invoice to the public utility. The amendment shall be negotiated and executed within 45 days of May 13, 2013, and shall be effective for fuel costs incurred and prices after January 1, 2014. The public utility shall request approval of the amendment by the commission, and the commission shall approve the amendment as reasonable and in the public interest and allow the public utility to recover from its Minnesota retail customers the amounts paid by the public utility to the project owner pursuant to the power purchase agreement during the full term of the power purchase agreement, including the reimbursement of fuel costs pursuant to the power purchase agreement amendment, reimbursable costs as provided in this paragraph, pursuant to section 216B.1645, or otherwise.\n(g) With respect to the power purchase agreement described in paragraph (b) and approved by the commission pursuant to paragraphs (c) and (e), the public utility is prohibited from recovering from the project owner any costs which were not actually and reasonably incurred by the utility, notwithstanding any provision in the power purchase agreement to the contrary. In addition, beginning with 2012, the public utility shall pay for all energy delivered by the project owner pursuant to the power purchase agreement at the full price for such energy in the power purchase agreement approved and amended pursuant to paragraph (e), provided that the project owner does not deliver more than 110 percent of the amount scheduled for delivery in any year of the power purchase agreement, and does not deliver, on average over any five consecutive years of the power purchase agreement, an amount greater than 105 percent of the amount scheduled for delivery over the five-year period.\n(a) For the purposes of subdivision 5c, the following terms have the meanings given.\n(b) \"Agreement period\" means the period beginning January 1, 2023, and ending December 31, 2024.\n(c) \"Ash\" means all species of the genus Fraxinus.\n(d) \"Cogeneration facility\" means the St. Paul district heating and cooling system cogeneration facility that uses waste wood as the facility's primary fuel source, provides thermal energy to St. Paul, and sells electricity to a public utility through a power purchase agreement approved by the Public Utilities Commission.\n(e) \"Department\" means the Department of Agriculture.\n(f) \"Emerald ash borer\" means the insect known as emerald ash borer, Agrilus planipennis Fairmaire, in any stage of development.\n(g) \"Renewable energy technology\" has the meaning given to \"eligible energy technology\" in section 216B.1691, subdivision 1.\n(h) \"St. Paul district heating and cooling system\" means a system of boilers, distribution pipes, and other equipment that provides energy for heating and cooling in St. Paul, and includes the cogeneration facility.\n(i) \"Waste wood from ash trees\" means ash logs and lumber, ash tree waste, and ash chips and mulch.\n(a) No later than August 1, 2021, a public utility subject to subdivision 5 and the cogeneration facility may file a proposal with the commission to enter into a power purchase agreement that governs the public utility's purchase of electricity generated by the cogeneration facility. The power purchase agreement may extend no later than December 31, 2024, and must not be extended beyond that date except as provided in paragraph (f).\n(b) The commission is prohibited from approving a new power purchase agreement filed under this subdivision that does not meet all of the following conditions:\n(1) the cogeneration facility agrees that any waste wood from ash trees removed from Minnesota counties that have been designated as quarantined areas in Section IV of the Minnesota State Formal Quarantine for Emerald Ash Borer, issued by the commissioner of agriculture under section 18G.06, effective November 14, 2019, as amended, for utilization as biomass fuel by the cogeneration facility must be accompanied by evidence:\n(i) demonstrating that the transport of biomass fuel from processed waste wood from ash trees to the cogeneration facility complies with the department's regulatory requirements under the Minnesota State Formal Quarantine for Emerald Ash Borer, which may consist of:\n(A) a certificate authorized or prepared by the commissioner of agriculture or an employee of the Animal and Plant Health Inspection Service of the United States Department of Agriculture verifying compliance; or\n(B) shipping documents demonstrating compliance; or\n(ii) certifying that the waste wood from ash trees has been chipped to one inch or less in two dimensions, and was chipped within the county from which the ash trees were originally removed;\n(2) the price per megawatt hour of electricity paid by the public utility demonstrates significant savings compared to the existing power purchase agreement, with a price that does not exceed $98 per megawatt hour;\n(3) the proposal includes a proposal to the commission for one or more electrification projects that result in the St. Paul district heating and cooling system being powered by electricity generated from renewable energy technologies. The plan must evaluate electrification at three or more levels from ten to 100 percent, including 100 percent of the energy used by the St. Paul district heating and cooling system to be implemented by December 31, 2027. The proposal may also evaluate alternative dates for implementation. For each level of electrification analyzed, the proposal must contain:\n(i) a description of the alternative electrification technologies evaluated and whose implementation is proposed as part of the electrification project;\n(ii) an estimate of the cost of the electrification project to the public utility, the impact on the monthly energy bills of the public utility's Minnesota customers, and the impact on the monthly energy bills of St. Paul district heating and cooling system customers;\n(iii) an estimate of the reduction in greenhouse gas emissions resulting from the electrification project, including greenhouse gas emissions associated with the transportation of waste wood;\n(iv) estimated impacts on the operations of the St. Paul district heating and cooling system; and\n(v) a timeline for the electrification project; and\n(4) the power purchase agreement provides a net benefit to the utility customers or the state.\n(c) The commission may approve, or approve as modified, a proposed electrification project that meets the requirements of this subdivision if it finds the electrification project is in the public interest, or the commission may reject the project if it finds that the project is not in the public interest. When determining whether an electrification project is in the public interest, the commission may consider the effects of the electrification project on air emissions from the St. Paul district heating and cooling system and how the emissions impact the environment and residents of affected neighborhoods.\n(d) During the agreement period, the cogeneration facility must attempt to obtain funding to reduce the cost of generating electricity and enable the facility to continue to operate beyond the agreement period to address the removal of ash trees, as described in paragraph (b), clause (1). The cogeneration facility must submit periodic reports to the commission regarding the efforts made under this paragraph.\n(e) Upon approval of the new power purchase agreement, the commission must require periodic reporting regarding progress toward development of a proposal for an electrification project.\n(f) Except as provided in paragraph (a), the commission is allowed to approve a power purchase agreement after the agreement period without approving an electrification project. Nothing in this section shall require any utility to enter into a power purchase agreement with the cogeneration facility after December 31, 2024.\n(g) Upon approval of an electrification project, the commission must require periodic reporting regarding the progress toward implementation of the electrification project.\n(h) If the commission approves the proposal submitted under paragraph (b), clause (3), the commission may allow the public utility to recover prudently incurred costs net of revenues resulting from the electrification project through an automatic cost recovery mechanism that allows for cost recovery outside of a general rate case. The cost recovery mechanism approved by the commission must:\n(1) allow a reasonable return on the capital invested in the electrification project by the public utility, as determined by the commission; and\n(2) recover costs only from the public utility's Minnesota electric service customers.\n(a) If there remain megawatts of biomass power generating capacity to fulfill the mandate in subdivision 5 after the commission has taken final action on all contracts filed by September 1, 2000, by a public utility, as amended and assigned, this subdivision governs final compliance with the biomass energy mandate in subdivision 5 subject to the requirements of subdivisions 7 and 8.\n(b) To the extent not inconsistent with this subdivision, the provisions of subdivisions 2, 3, 4, and 5 apply to proposals subject to this subdivision.\n(c) A public utility must submit proposals to the commission to complete the biomass mandate. The commission shall require a public utility subject to this section to issue a request for competitive proposals for projects for electric generation utilizing biomass as defined in paragraph (f) of this subdivision to provide the remaining megawatts of the mandate. The commission shall set an expedited schedule for submission of proposals to the utility, selection by the utility of proposals or projects, negotiation of contracts, and review by the commission of the contracts or projects submitted by the utility to the commission.\n(d) Notwithstanding the provisions of subdivisions 1 to 5 but subject to the provisions of subdivisions 7 and 8, a new or existing facility proposed under this subdivision that is fueled either by biomass or by co-firing biomass with nonbiomass may satisfy the mandate in this section. Such a facility need not use biomass that complies with the definition in subdivision 1 if it uses biomass as defined in paragraph (f) of this subdivision. Generating capacity produced by co-firing of biomass that is operational as of April 25, 2000, does not meet the requirements of the mandate, except that additional co-firing capacity added at an existing facility after April 25, 2000, may be used to satisfy this mandate. Only the number of megawatts of capacity at a facility which co-fires biomass that are directly attributable to the biomass and that become operational after April 25, 2000, count toward meeting the biomass mandate in this section.\n(e) Nothing in this subdivision precludes a facility proposed and approved under this subdivision from using fuel sources that are not biomass in compliance with subdivision 3.\n(f) Notwithstanding the provisions of subdivision 1, for proposals subject to this subdivision, \"biomass\" includes farm-grown closed-loop biomass; agricultural wastes, including animal, poultry, and plant wastes; and waste wood, including chipped wood, bark, brush, residue wood, and sawdust.\n(g) Nothing in this subdivision affects in any way contracts entered into as of April 25, 2000, to satisfy the mandate in subdivision 5.\n(h) Nothing in this subdivision requires a public utility to retrofit its own power plants for the purpose of co-firing biomass fuel, nor is a utility prohibited from retrofitting its own power plants for the purpose of co-firing biomass fuel to meet the requirements of this subdivision.\nThe commission may not approve a project proposed after April 25, 2000, which would have an adverse impact on the ability of a project approved before April 25, 2000, to obtain an adequate supply of the fuel source designated for the project.\nOf the 125 megawatts mandated in subdivision 5, or 110 megawatts mandated in subdivision 5a, at least 75 megawatts of the generating capacity must be generated by facilities that use agricultural biomass as the principal fuel source. For purposes of this subdivision, agricultural biomass includes only farm-grown closed-loop biomass and agricultural waste, including animal, poultry, and plant wastes. For purposes of this subdivision, \"principal fuel source\" means a fuel source that satisfies at least 75 percent of the fuel requirements of an electric power generating facility. Nothing in this subdivision is intended to expand the fuel source requirements of subdivision 5.\n(a) Notwithstanding any provision in this section, the public utility subject to this section may, with respect to a facility approved under this section, file a petition with the commission for approval of:\n(1) a new or amended power purchase agreement;\n(2) the early termination of a power purchase agreement; or\n(3) the purchase and closure of the facility.\n(b) The commission may approve a new or amended power purchase agreement under this subdivision, notwithstanding the fuel requirements of this section, if the commission determines that:\n(1) all parties to the original power purchase agreement, or their successors or assigns, as applicable, agree to the terms and conditions of the new or amended power purchase agreement; and\n(2) the new or amended power purchase agreement is in the best interest of the customers of the public utility subject to this section, taking into consideration any savings realized by customers in the new or amended power purchase agreement and any costs imposed on customers under paragraph (e). A new or amended power purchase agreement approved under this paragraph may be for any term agreed to by the parties and may govern the purchase of any amount of energy.\n(c) The commission may approve the early termination of a power purchase agreement or the purchase and closure of a facility under this subdivision if it determines that:\n(1) all parties to the power purchase agreement, or their successors or assigns, as applicable, agree to the early termination of the power purchase agreement or the purchase and closure of the facility; and\n(2) the early termination of the power purchase agreement or the purchase and closure of the facility is in the best interest of the customers of the public utility subject to this section, taking into consideration any savings realized by customers as a result of the early termination of the power purchase agreement or the purchase and closure of the facility and any costs imposed on the customers under paragraph (e).\n(d) The commission's approval of a new or amended power purchase agreement under paragraph (b) or of the termination of a power purchase agreement or the purchase and closure of a facility under paragraph (c), shall not require the public utility subject to this section to purchase replacement amounts of biomass energy to fulfill the requirements of this section.\n(e) A utility may petition the commission to approve a rate schedule that provides for the automatic adjustment of charges to recover investments, expenses and costs, and earnings on the investments associated with a new or amended power purchase agreement, the early termination of a power purchase agreement, or the purchase and closure of a facility. The commission may approve the rate schedule upon a showing that the recovery of investments, expenses and costs, and earnings on the investments is less than the costs that would have been recovered from customers had the utility continued to purchase energy under the power purchase agreement in effect before any option available under this section is approved by the commission. If approved by the commission, cost recovery under this paragraph may include all cost recovery allowed for renewable facilities under section 216B.1645, subdivisions 2 and 2a.\n(f) This subdivision does not apply to a St. Paul district heating and cooling system cogeneration facility, and nothing in this subdivision precludes a public utility that operates a nuclear-power electric generating plant from filing a petition with the commission for approval of a new or amended power purchase agreement with such a facility.\n(g) For the purposes of this subdivision, \"facility\" means a biomass facility previously approved by the commission to satisfy a portion of the biomass mandate in this section.",
	"repealed": false
}