{
	"id": "353.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.29",
	"title": "353.29 RETIREMENT ANNUITY UPON TERMINATION OF MEMBERSHIP.",
	"text": "Upon termination of public service, a member who has attained normal retirement age and who is vested under section 353.01, subdivision 47, is entitled upon application to a retirement annuity. The retirement annuity is known as the \"normal\" retirement annuity.\n[Repealed, 1Sp2005 c 8 art 1 s 32]\n(a) This paragraph, in conjunction with section 353.30, subdivisions 1a, 1b, and 1c, applies to any member who first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, unless paragraph (b), in conjunction with section 353.30, subdivision 5, produces a higher annuity amount, in which case paragraph (b) applies. The average salary as defined in section 353.01, subdivision 17a, multiplied by 2.2 percent for each year of allowable service for the first ten years and thereafter by 2.7 percent per year of allowable service and completed months less than a full year for a basic member, and 1.2 percent for each year of allowable service for the first ten years and thereafter by 1.7 percent per year of allowable service and completed months less than a full year for a coordinated member determines the amount of the normal retirement annuity.\n(b) This paragraph applies to a member who has become at least 55 years old and first became a public employee after June 30, 1989, and to any other member whose annuity amount, when calculated under this paragraph and in conjunction with section 353.30, subdivision 5, is higher than it is when calculated under paragraph (a), in conjunction with section 353.30, subdivisions 1a, 1b, and 1c. The average salary, as defined in section 353.01, subdivision 17a, multiplied by 2.7 percent for each year of allowable service and completed months less than a full year for a basic member and 1.7 percent per year of allowable service and completed months less than a full year for a coordinated member, determines the amount of the normal retirement annuity.\nApplication for a retirement annuity or optional annuity may be made by a member or by a person acting on behalf of the member, upon proof of authority satisfactory to the executive director. Every application must be made on a form or in a format prescribed by the executive director and must be substantiated by proof of the member's age and identity. The notarized signature of a member's spouse on a retirement annuity application acknowledging the member's annuity selection meets the notice requirement to the spouse under section 356.46, subdivision 3. An application for a retirement annuity is not complete until all necessary supporting documents are received by the executive director.\n[Repealed, 1959 c 650 s 57]\n[Repealed, 2013 c 111 art 3 s 31]\n(a) Except as specified in paragraph (b), a retirement annuity granted under this chapter begins on the first day of the first calendar month after the date of termination of public service or up to five months before the first of the month in which a complete application is received by the executive director under subdivision 4, whichever is later. The annuity must be paid in equal monthly installments. Annuity payments shall not be paid beyond the end of the month in which entitlement to the annuity has terminated.\n(b) An annuity granted to an elected public official may begin on the day following the expiration of the public office that qualified the elected official for membership under section 353.01, subdivision 2a or 2d, if a complete application is received by the executive director under subdivision 4 within six months of the date of termination of public service. The annuity for the month during which the expiration occurred is prorated accordingly.\n(c) An annuity, once granted, must not be increased, decreased, or revoked except under this chapter.\n(d) If an annuitant dies before negotiating the check for the month in which death occurs, payment must first be made to the surviving spouse, or if none, then to the designated beneficiary, or if none, lastly to the estate.\nPayment of any annuity or benefit for a given month must be mailed by the association to the annuitant, recipient of a disability benefit, or survivor, or must be automatically deposited under section 356.401, subdivision 2, during the first week of that month. The board may contract for professional services to identify deceased annuitants and benefit recipients through a review of nationally maintained death records.\nAn annuity under this section or section 353.30 is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}