{
	"id": "306.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.025",
	"title": "306.025 TRANSFER OF CEMETERY TO LOCAL GOVERNMENT UNIT.",
	"text": "A public cemetery association owning a cemetery may transfer it to a statutory or home rule charter city, town, or county in which the cemetery is wholly or partly located, together with all the funds and property of the association, whether the funds are of a trust character or otherwise. The statutory or home rule charter city, town, or county in which the cemetery is wholly or partly located may accept a transfer of the cemetery and of its property and funds, and may continue to operate, maintain, manage, and conduct the cemetery, and to sell lots and provide for the burial of the dead in the cemetery. Funds received from the cemetery association upon transfer shall be administered by the statutory or home rule charter city, town, or county for the same purposes and upon the same trusts for which they were originally established.\nTo accomplish a transfer, the board of trustees of the cemetery association shall first adopt a resolution to that effect by a unanimous vote of the members of the board of trustees, after which the chair or president of the board of trustees and the secretary are authorized to execute the proper instruments to evidence the transfer. However, the transfer must first have been authorized by a majority vote of all the members of the association at a regular or special meeting called for that express purpose.\nBefore the transfer is made, the governing body of the statutory or home rule charter city, town, or county in which the cemetery is wholly or partly located shall first adopt a resolution agreeing to accept the transfer of the property and funds of the association, and agree to continue to operate, maintain, manage, conduct, and control the cemetery, to sell lots in it, and to administer its funds for the same purposes and upon the same trusts for which they were originally established.\nIf a trust fund for the perpetual care of cemetery lots is transferred to a statutory or home rule charter city, town, or county under this section, then the fund must be preserved and kept and used and administered for the same purposes and upon the same trusts as if the transfer had not been made. Lots for which payment in full for perpetual care has been made to the cemetery association are entitled to receive perpetual care, and the statutory or home rule charter city, town, or county shall provide it.\nAfter transfer, lot owners are entitled to the same rights and privileges concerning their lots as if the transfer had not been made.\nAfter the transfer has been made and accepted by the statutory or home rule charter city, town, or county, the governing body of the statutory or home rule charter city, town, or county shall operate, maintain, conduct, control, and manage the transferred cemetery. For that purpose it may appoint a committee of the governing body.\nThe governing body of the statutory or home rule charter city, town, or county may adopt rules and regulations to conduct, manage, maintain, and operate the cemetery, but the rules may not infringe upon the rights of persons who were lot owners at the time the transfer was made.",
	"repealed": false
}