{
	"id": "127A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.30",
	"title": "127A.30 LEGISLATIVE PERMANENT SCHOOL FUND COMMISSION.",
	"text": "(a) The Legislative Permanent School Fund Commission of 12 members is established to advise the Department of Natural Resources and the school trust lands director on the management of permanent school fund land, which is held in trust for the school districts of the state and to review legislation affecting permanent school fund land. The commission consists of the following persons:\n(1) six members of the senate, including three majority party members appointed by the majority leader and three minority party members appointed by the minority leader; and\n(2) six members of the house of representatives, including three majority party members appointed by the speaker of the house and three minority party members appointed by the minority leader.\n(b) Appointed legislative members serve at the pleasure of the appointing authority and continue to serve until their successors are appointed.\n(c) The first meeting of the commission shall be convened by the chair of the Legislative Coordinating Commission. Members shall elect a chair, vice-chair, secretary, and other officers as determined by the commission. The chair may convene meetings as necessary to conduct the duties prescribed by this section.\nThe commission shall review current statutes on management of school trust fund lands at least annually and shall recommend necessary changes in statutes, policy, and implementation in order to ensure provident utilization of the permanent school fund lands. By January 15 of each year, the commission shall submit a report to the legislature with recommendations for the management of school trust lands to secure long-term economic return for the permanent school fund, consistent with sections 92.122 and 127A.31. The commission's annual report may include recommendations to:\n(1) manage the school trust lands efficiently;\n(2) reduce the management expenditures of school trust lands and maximize the revenues deposited in the permanent school trust fund;\n(3) manage the sale, exchange, and commercial leasing of school trust lands to maximize the revenues deposited in the permanent school trust fund and retain the value from the long-term appreciation of the school trust lands;\n(4) manage the school trust lands to maximize the long-term economic return for the permanent school trust fund while maintaining sound natural resource conservation and management principles; and\n(5) manage the asset allocation of the permanent school fund.\n[Repealed by amendment, 2012 c 249 s 7]",
	"repealed": false
}