{
	"id": "178.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.011",
	"title": "178.011 DEFINITIONS.",
	"text": "The terms defined in this section have the meanings given and apply to this chapter.\n\"Apprentice\" means a worker who is at least 16 years of age who is employed to learn an apprenticeable trade or occupation in a registered apprenticeship program under this chapter.\n\"Apprenticeship Advisory Board\" or \"board\" means the Apprenticeship Advisory Board established under section 178.02 and as an advisory State Apprenticeship Council as defined in Code of Federal Regulations, title 29, section 29.2.\n\"Apprenticeship program\" means a program registered under this chapter that includes standards containing all terms and conditions for the qualification, recruitment, selection, employment, and training of apprentices, as required under Code of Federal Regulations, title 29, parts 29 and 30, and a written apprenticeship agreement.\n\"Commissioner\" means the commissioner of labor and industry or a duly designated representative of the commissioner who is an employee of the department.\n\"Department\" means the Department of Labor and Industry established under section 175.001.\n\"Division\" means the department's Apprenticeship Division, established under sections 175.16 and 178.03, and the State Apprenticeship Agency as defined in Code of Federal Regulations, title 29, part 29, section 29.2.\n\"Employer\" means any person or organization employing an apprentice whether or not the person or organization is a party to an apprenticeship agreement with the apprentice.\n\"Journeyworker\" means a person who has attained a level of skill, abilities, and competencies recognized within an industry as having mastered the skills and competencies required for the trade or occupation. Use of the term may also refer to a mentor, technician, specialist, or other skilled worker who has documented sufficient skills and knowledge of an occupation, either through formal apprenticeship or through practical on-the-job experience and formal training.\n\"Registered apprenticeship agreement\" or \"apprenticeship agreement\" means a written agreement, complying with section 178.07, between the division, sponsor, and apprentice, and, if the apprentice is a minor, the minor's parent or guardian, which contains the terms and conditions of the employment and training of the apprentice.\n\"Related instruction\" means an organized and systematic form of instruction designed to provide the apprentice with the knowledge of the theoretical and technical subjects related to the apprentice's trade or occupation. The instruction may be given in a classroom through trade, occupational, or industrial courses or, when of equivalent value, by correspondence, electronic media, or other forms of self-study approved by the commissioner.\n\"Sponsor\" means an employer, employer association, or apprenticeship committee as defined by Code of Federal Regulations, title 29, part 29, section 29.2, that operates an apprenticeship program and in whose name the program is or is to be registered or approved.",
	"repealed": false
}