{
	"id": "115C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.12",
	"title": "115C.12 APPEALING REIMBURSEMENT DETERMINATION.",
	"text": "An applicant for reimbursement may appeal to the board a reimbursement determination made by the commissioner of commerce under authority delegated by the board according to section 115C.09, subdivision 10, by submitting a written notice setting forth the specific basis for the appeal. The commissioner of commerce shall send written notification of the reimbursement determination by first class United States mail to the applicant for reimbursement at the applicant's last known address. The applicant for reimbursement must file written notice with the board of an appeal of a reimbursement determination made by the commissioner of commerce within 60 days of the date that the commissioner of commerce sends written notice to the applicant of the reimbursement determination. The board shall consider the appeal within 90 days of receipt of the written notice of appeal by the applicant for reimbursement. The written notice must set forth the specific basis for the appeal.\n(a) An applicant for reimbursement may appeal a reimbursement determination of the board as a contested case under chapter 14. An applicant for reimbursement must provide written notification to the board of a request for a contested case, setting forth the specific basis for the appeal, within 30 days of the date that the board makes a reimbursement determination.\n(b) This subdivision applies to reimbursement determinations made by the board as a result of an appeal to the board under subdivision 1 and reimbursement determinations made by the board when the board has not delegated its authority to make reimbursement determinations.\n(c) An appeal of a reimbursement determination may only be made by an applicant as defined by this chapter.\nThe final decision in a contested case requested by an applicant under subdivision 2 shall be made by the commissioner of commerce.",
	"repealed": false
}