{
	"id": "116J.617",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.617",
	"title": "116J.617 TOURISM LOAN PROGRAM.",
	"text": "The commissioner may establish a tourism revolving loan program and a tourism guarantee loan program to provide loans, participate in loans, or guarantee loans to resorts, campgrounds, lodging facilities, and other tourism-related businesses. The commissioner shall work with financial institutions in making or participating in loans or guaranteeing loans under this section.\nTo receive a loan under this section, the borrower must be a sole proprietorship, partnership, or corporation engaged in a tourism-related business or other entity that is defined by the standard industrial classification codes of 7011 and 7033 as set out in the Code of Federal Regulations, title 13, section 121.2. An eligible borrower under this section must maintain the business or other entity as a tourism-related entity as defined by this subdivision during the term of the loan. An eligible borrower may not receive a loan or loan guarantee under this section if the borrower has received a tourism-related loan, loan participation, or guarantee made by the state in the past 36 months.\nThe maximum loan made or participated in under this section may not be for more than 50 percent of the total cost of the project. Loan proceeds may be used for the following purposes: acquisition of an existing building, building construction and improvement, land site improvement, equipment, other construction costs, and engineering costs. Project-related expenditures made more than 30 days before an application may not be financed by a loan made, guaranteed, or participated in under this section.\nThe maximum term of a loan made, guaranteed, or participated in under this section may not exceed the useful life of the real property or 80 percent of the useful life of the equipment or machinery, or the following limits, whichever is less:\n(1) ten years for land, building, or other real property;\n(2) five years for equipment or machinery; or\n(3) a weighted average of the limits under clauses (1) and (2) for loans made, guaranteed, or participated in for a combination of real property and equipment or machinery.\nThe commissioner may establish interest rates for loans made under this section. All loans made must be secured by collateral.\n[Repealed, 2003 c 128 art 13 s 40]\n[Repealed, 2003 c 128 art 13 s 40]",
	"repealed": false
}