{
	"id": "181.950",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.950",
	"title": "181.950 DEFINITIONS.",
	"text": "For the purposes of sections 181.950 to 181.957, the terms and phrases defined in this section have the meanings given them.\n\"Confirmatory test\" and \"confirmatory retest\" mean a drug or alcohol test or cannabis test that uses a method of analysis allowed under one of the programs listed in section 181.953, subdivision 1.\n[Repealed, 1991 c 60 s 12]\n\"Drug\" means a controlled substance as defined in section 152.01, subdivision 4, but does not include marijuana, tetrahydrocannabinols, cannabis flower as defined in section 342.01, subdivision 16, cannabis products as defined in section 342.01, subdivision 20, lower-potency hemp edibles as defined in section 342.01, subdivision 50, and hemp-derived consumer products as defined in section 342.01, subdivision 37.\n\"Drug and alcohol testing,\" \"drug or alcohol testing,\" and \"drug or alcohol test\" mean analysis of a body component sample according to the standards established under one of the programs listed in section 181.953, subdivision 1, for the purpose of measuring the presence or absence of drugs, alcohol, or their metabolites in the sample tested. \"Drug and alcohol testing,\" \"drug or alcohol testing,\" and \"drug or alcohol test\" do not include cannabis or cannabis testing, unless stated otherwise.\n\"Cannabis testing\" means the analysis of a body component sample according to the standards established under one of the programs listed in section 181.953, subdivision 1, for the purpose of measuring the presence or absence of cannabis flower, as defined in section 342.01, subdivision 16, cannabis products, as defined in section 342.01, subdivision 20, lower-potency hemp edibles as defined in section 342.01, subdivision 50, hemp-derived consumer products as defined in section 342.01, subdivision 37, or cannabis metabolites in the sample tested. The definitions in this section apply to cannabis testing unless stated otherwise.\n\"Employee\" means a person, independent contractor, or person working for an independent contractor who performs services for compensation, in whatever form, for an employer.\n\"Employer\" means a person or entity located or doing business in this state and having one or more employees, and includes the state and all political or other governmental subdivisions of the state.\n\"Initial screening test\" means a drug or alcohol test or cannabis test which uses a method of analysis under one of the programs listed in section 181.953, subdivision 1.\n\"Job applicant\" means a person, independent contractor, or person working for an independent contractor who applies to become an employee of an employer, and includes a person who has received a job offer made contingent on the person passing drug or alcohol testing.\n\"Oral fluid test\" means analysis of a saliva sample for the purpose of measuring the presence of the same substances as drug and alcohol testing and cannabis testing that:\n(1) can detect drugs, alcohol, cannabis, or their metabolites in levels at or above the threshold detection levels contained in the standards of one of the programs listed in section 181.953, subdivision 1; and\n(2) does not require the services of a testing laboratory under section 181.953, subdivision 1.\n\"Positive test result\" means a finding of the presence of drugs, cannabis, alcohol, or their metabolites in the sample tested in levels at or above the threshold detection levels contained in the standards of one of the programs listed in section 181.953, subdivision 1.\n\"Random selection basis\" means a mechanism for selection of employees that (1) results in an equal probability that any employee from a group of employees subject to the selection mechanism will be selected and (2) does not give an employer discretion to waive the selection of any employee selected under the mechanism.\n\"Reasonable suspicion\" means a basis for forming a belief based on specific facts and rational inferences drawn from those facts.\n\"Safety-sensitive position\" means a job, including any supervisory or management position, in which an impairment caused by drug, alcohol, or cannabis usage would threaten the health or safety of any person.",
	"repealed": false
}