{
	"id": "477C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/477C.02",
	"title": "477C.02 QUALIFYING FOR POLICE STATE AID.",
	"text": "(a) A certification made under this section must be filed with the commissioner on a form prescribed by the commissioner and must include all other facts that the commissioner requires.\n(b) Except as provided in subdivision 2, on or before March 15 annually, the municipal clerk, municipal clerk-treasurer, or county auditor of each municipality employing one or more peace officers must certify to the commissioner the number of peace officers employed during the previous calendar year. No peace officer may be included in the certification by more than one municipality for the same month.\n(c) Credit for peace officers employed less than a full year must be apportioned. Each full month of employment of a qualifying officer during the calendar year entitles the employing municipality to credit for 1/12 of the payment for employment of a peace officer for the entire year. For purposes of this chapter, employment of a peace officer begins when the peace officer is entered on the payroll of the employing municipality.\nOn or before March 15 annually, the commissioner of natural resources must certify the number of peace officers employed by the Enforcement Division and the commissioner of public safety must certify the number of peace officers employed by the Bureau of Criminal Apprehension, the Gambling Enforcement Division, and the State Patrol Division. The certification must be on the form described in subdivision 1, paragraph (a). Peace officers certified under this subdivision must be included in the total certifications under subdivision 1.\nA peace officer employed by the University of Minnesota who is required by the Board of Regents to be a member of the University of Minnesota faculty retirement plan is not eligible to be included in any police state aid certification under this section.\n(a) If a certification under subdivision 1 or 2 is not filed with the commissioner on or before March 1, the commissioner must notify the municipal clerk, municipal clerk-treasurer, or county auditor that a penalty will be deducted from police state aid certified for the current year if the certification is not filed on or before March 15.\n(b) If the commissioner rejects the certification under subdivision 1 or 2 for inaccurate or incomplete information, the municipal clerk, municipal clerk-treasurer, or county auditor must file a corrective certification after taking corrective action as identified by the commissioner in the notice of rejection. The corrective certification must be filed within 30 days of the date on the notice of rejection, or by March 15, whichever date is later.\n(c) A penalty applies to (1) a certification under subdivisions 1 and 2 filed after March 15, and (2) a corrective certification under paragraph (b) filed after March 15 that is also filed more than 30 days after the date on the notice of rejection. The penalty is equal to the amount of police state aid determined for the municipality for the current year, multiplied by ten percent for each week or fraction of a week that the certification or corrective certification is filed after March 15 or more than 30 days after the date on the notice of rejection. All aid amounts forfeited as a result of the penalty revert to the state general fund. Failure to receive the certification form may not be used as a defense for a failure to file.\nThe commissioner must determine which municipalities are qualified to receive police state aid based on compliance with the requirements of this section. The commissioner may take into account any other relevant information that comes to the attention of the commissioner when making the determination.",
	"repealed": false
}