{
	"id": "473.759",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.759",
	"title": "473.759 CRITERIA AND CONDITIONS.",
	"text": "In developing the ballpark and entering into related contracts, the authority must follow and enforce the criteria and conditions in subdivisions 2 to 15, provided that a determination by the authority that those criteria or conditions have been met under any agreement or otherwise shall be conclusive.\nThe team must agree to contribute $130,000,000 toward ballpark costs, less a proportionate share of any amount by which actual ballpark costs may be less than a budgeted amount of $390,000,000. The team contributions must be funded in cash during the construction period. The team shall deposit $45,000,000 to the construction fund to pay for the first ballpark costs. The balance of the team's contribution must be used to pay the last costs of the ballpark construction. In addition to any other team contribution, the team must agree to assume and pay when due all cost overruns for the ballpark costs that exceed the budget.\nThe authority shall require that a reserve fund for capital improvements to the ballpark be established and funded with annual payments of $2,000,000, with the team's share of those payments to be approximately $1,000,000, as determined by agreement of the team and county. The annual payments shall increase according to an inflation index determined by the authority, provided that any portion of the team's contribution that has already been reduced to present value shall not increase according to an inflation index. The authority may accept contributions from the county or other source for the portion of the funding not required to be provided by the team.\nThe authority must agree to a long-term lease or use agreement with the team for its use of the ballpark. The team must agree to play all regularly scheduled and postseason home games at the ballpark. Preseason games may also be scheduled and played at the ballpark. The lease or use agreement must be for a term of at least 30 years from the date of ballpark completion. The lease or use agreement must include terms for default, termination, and breach of the agreement. Recognizing that the presence of major league baseball provides to Hennepin County, the state of Minnesota, and its citizens highly valued, intangible benefits that are virtually impossible to quantify and, therefore, not recoverable in the event of a team owner's breach of contract, the lease and use agreements must provide for specific performance and injunctive relief to enforce provisions relating to use of the ballpark for major league baseball and must not include escape clauses or buyout provisions. The team must not enter into or accept any agreement or requirement with or from Major League Baseball or any other entity that is inconsistent with the team's binding commitment to the 30-year term of the lease or use agreement or that would in any manner dilute, interfere with, or negate the provisions of the lease or use agreement, or of any grant agreement under section 473.757 that includes a specific performance clause, providing for specific performance or injunctive relief. The legislature conclusively determines, as a matter of public policy, that the lease or use agreement, and any grant agreement under section 473.757 that includes a specific performance clause: (a) explicitly authorize specific performance as a remedy for breach; (b) are made for adequate consideration and upon terms which are otherwise fair and reasonable; (c) have not been included through sharp practice, misrepresentation, or mistake; (d) if specifically enforced, do not cause unreasonable or disproportionate hardship or loss to the team or to third parties; and (e) involve performance in such a manner and the rendering of services of such a nature and under such circumstances that the beneficiary cannot be adequately compensated in damages.\nUntil 30 years from the date of ballpark completion, the team must provide written notice to the authority not less than 90 days prior to any action, including any action imposed upon the team by Major League Baseball, which would result in a breach or default of provisions of the lease or use agreements required to be included under subdivision 4. If this notice provision is violated and the team has already breached or been in default under the required provisions, the authority, the county, or the state of Minnesota is authorized to specifically enforce the lease or use agreement, and Minnesota courts are authorized and directed to fashion equitable remedies so that the team may fulfill the conditions of the lease and use agreements, including, but not limited to, remedies against Major League Baseball.\nThe authority must determine before ballpark construction begins that all public and private funding sources for construction of the ballpark are included in written agreements. The committed funds must be adequate to design, construct, furnish, and equip the ballpark.\nThe authority must comply with all environmental requirements imposed by regulatory agencies for the ballpark, site, and structure, except as provided by section 473.758, subdivision 1.\nThe lease or use agreement must provide that, prior to any planned sale of the team, the team must offer a corporation formed under section 473.763 a right of first refusal to purchase the team at the same price and upon the same terms and conditions as are contemplated in the intended sale.\nThe lease or use agreement must provide that, if the team is sold after May 27, 2006, a portion of the sale price must be paid to the authority and deposited in a reserve fund for improvements to the ballpark or expended as the authority may otherwise direct. The portion required to be so paid to the authority is 18 percent of the gross sale price, declining to zero ten years after commencement of ballpark construction in increments of 1.8 percent each year. The agreement shall provide exceptions for sales to members of the owner's family and entities and trusts beneficially owned by family members, sales to employees of equity interests aggregating up to ten percent, and sales related to capital infusions not distributed to the owners.\nThe lease or use agreement must provide the authority access to annual audited financial statements of the team and other financial books and records that the authority deems necessary to determine compliance by the team with Laws 2006, chapter 257, and to enforce the terms of any lease or use agreements entered into under Laws 2006, chapter 257. Any financial information obtained by the authority under this subdivision is nonpublic data under section 13.02, subdivision 9.\nTo the extent determined by the authority or required by a grant agreement, any lease or use agreement must provide for affordable access to the professional sporting events held in the ballpark.\nThe authority must negotiate a public sector project labor agreement or other agreement to prevent strikes and lockouts that would halt, delay, or impede construction of the ballpark and related facilities.\nThe lease or use agreement must require that the team provide or cause to be provided $250,000 annually for the term of the agreement for youth activities and youth and amateur sports without reducing the amounts otherwise normally provided for and on behalf of the team for those purposes. The amounts shall increase according to an inflation factor not to exceed 2.5 percent annually and may be subject to a condition that the county fund grants for similar purposes.\nThe lease or use agreement must provide that the team and league will transfer to the state of Minnesota the Minnesota Twins' heritage and records, including the name, logo, colors, history, playing records, trophies, and memorabilia in the event of any dissolution or relocation of the Twins franchise.\n(a) If the authority obtains grants sufficient to cover the increased costs, the authority must ensure that the ballpark receives Leadership in Energy and Environmental Design (LEED) certification for environmental design, and to the extent practicable, that the ballpark design is architecturally significant. The Department of Administration and the Department of Commerce must cooperate with the authority to obtain any grants or other funds that are available to help to pay for the cost of meeting the requirements for the LEED certification.\n(b) The ballpark design must, to the extent feasible, follow sustainable building guidelines established under section 16B.325.\n(c) The authority must ensure that the ballpark be, to the greatest extent practicable, constructed of American-made steel.",
	"repealed": false
}