{
	"id": "41A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.09",
	"title": "41A.09 ETHANOL DEVELOPMENT.",
	"text": "[Repealed, 2003 c 128 art 3 s 47]\nMS 2012 [Repealed, 2011 c 14 s 16]\n[Repealed, 1995 c 220 s 141]\nFor the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Ethanol\" means fermentation ethyl alcohol derived from agricultural products, including potatoes, cereal grains, cheese whey, and sugar beets; forest products; or other renewable resources, including residue and waste generated from the production, processing, and marketing of agricultural products, forest products, and other renewable resources, that:\n(1) meets all of the specifications in ASTM specification D4806-04a; and\n(2) is denatured as specified in Code of Federal Regulations, title 27, parts 20 and 21.\n(b) \"Ethanol plant\" means a plant at which ethanol is produced.\n(c) \"Commissioner\" means the commissioner of agriculture.\n(d) \"Rural economic infrastructure\" means the development of activities that will enhance the value of agricultural crop or livestock commodities or by-products or waste from farming operations through new and improved value-added conversion processes and technologies, the development of more timely and efficient infrastructure delivery systems, and the enhancement of marketing opportunities. \"Rural economic infrastructure\" also means land, buildings, structures, fixtures, and improvements located or to be located in Minnesota and used or operated primarily for the processing or the support of production of marketable products from agricultural commodities or wind energy produced in Minnesota.\n[Repealed, 1995 c 220 s 141]\nMS 2012 [Repealed, 2011 c 14 s 16]\nMS 2012 [Repealed, 2011 c 14 s 16]\n[Repealed, 1995 c 220 s 141]\n[Repealed, 2003 c 128 art 3 s 47]\n[Repealed, 2003 c 128 art 3 s 47]\n[Repealed, 2003 c 128 art 3 s 47]\n[Repealed, 2003 c 128 art 3 s 47]\n[Repealed, 2007 c 45 art 1 s 66]\nMS 2012 [Repealed, 2011 c 14 s 16]",
	"repealed": false
}