{
	"id": "62Q.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.75",
	"title": "62Q.75 PROMPT PAYMENT REQUIRED.",
	"text": "(a) For purposes of this section, the following terms have the meanings given to them.\n(b) \"Clean claim\" means a claim that has no defect or impropriety, including any lack of any required substantiating documentation, including, but not limited to, coordination of benefits information, or particular circumstance requiring special treatment that prevents timely payment from being made on a claim under this section. A special circumstance includes, but is not limited to, a claim held pending payment of an overdue premium for the time period during which the expense was incurred as allowed by the Affordable Care Act. Nothing in this section alters an enrollee's obligation to disclose information as required by law.\n(c) \"Third-party administrator\" means a third-party administrator or other entity subject to section 60A.23, subdivision 8, and Minnesota Rules, chapter 2767.\n(a) This section applies to clean claims submitted to a health plan company or third-party administrator for services provided by any:\n(1) health care provider, as defined in section 62Q.74, but does not include a provider licensed under chapter 151;\n(2) home health care provider, as defined in section 144A.43, subdivision 4; or\n(3) health care facility.\nAll health plan companies and third-party administrators must pay or deny claims that are clean claims within 30 calendar days after the date upon which the health plan company or third-party administrator received the claim.\n(b) The health plan company or third-party administrator shall, upon request, make available to the provider information about the status of a claim submitted by the provider consistent with section 62J.581.\n(c) If a health plan company or third-party administrator does not pay or deny a clean claim within the period provided in paragraph (a), the health plan company or third-party administrator must pay interest on the claim for the period beginning on the day after the required payment date specified in paragraph (a) and ending on the date on which the health plan company or third-party administrator makes the payment or denies the claim. In any payment, the health plan company or third-party administrator must itemize any interest payment being made separately from other payments being made for services provided. The health plan company or third-party administrator shall not require the health care provider to bill the health plan company or third-party administrator for the interest required under this section before any interest payment is made. Interest payments must be made to the health care provider no less frequently than quarterly.\n(d) The rate of interest paid by a health plan company or third-party administrator under this subdivision shall be 1.5 percent per month or any part of a month.\n(e) A health plan company or third-party administrator is not required to make an interest payment on a claim for which payment has been delayed for purposes of reviewing potentially fraudulent or abusive billing practices.\n(f) The commissioner may assess a financial administrative penalty against a health plan company for violation of this subdivision when there is a pattern of abuse that demonstrates a lack of good faith effort and a systematic failure of the health plan company to comply with this subdivision.\nUnless otherwise provided by contract, by section 16A.124, subdivision 4a, or by federal law, the health care providers and facilities specified in subdivision 2 must submit their charges to a health plan company or third-party administrator within six months from the date of service or the date the health care provider knew or was informed of the correct name and address of the responsible health plan company or third-party administrator, whichever is later. A health care provider or facility that does not make an initial submission of charges within the six-month period shall not be reimbursed for the charge and may not collect the charge from the recipient of the service or any other payer. The six-month submission requirement may be extended to 12 months in cases where a health care provider or facility specified in subdivision 2 has determined and can substantiate that it has experienced a significant disruption to normal operations that materially affects the ability to conduct business in a normal manner and to submit claims on a timely basis. Any request by a health care provider or facility specified in subdivision 2 for an exception to a contractually defined claims submission timeline must be reviewed and acted upon by the health plan company within the same time frame as the contractually agreed upon claims filing timeline. This subdivision also applies to all health care providers and facilities that submit charges to workers' compensation payers for treatment of a workers' compensation injury compensable under chapter 176, or to reparation obligors for treatment of an injury compensable under chapter 65B.\n(a) Once a clean claim, as defined in section 62Q.75, subdivision 1, has been paid, the contract must provide a 12-month deadline on all adjustments to and recoupments of the payment with the exception of payments related to coordination of benefits, subrogation, duplicate claims, retroactive terminations, and cases of fraud and abuse.\n(b) Paragraph (a) shall not apply to pharmacy contracts entered into between or on behalf of health plan companies.",
	"repealed": false
}