{
	"id": "341.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/341.25",
	"title": "341.25 RULES.",
	"text": "(a) The commissioner may adopt rules that include standards for the physical examination and condition of combatants and referees.\n(b) The commissioner may adopt other rules necessary to carry out the purposes of this chapter, including, but not limited to, the conduct of all combative sport contests and their manner, supervision, time, and place.\n(c) The most recent version of the Unified Rules of Mixed Martial Arts, as promulgated by the Association of Boxing Commissions, is incorporated by reference and made a part of this chapter except as qualified by this chapter and Minnesota Rules, chapter 2202. In the event of a conflict between this chapter and the Unified Rules, this chapter must govern.\n(d) The most recent version of the Unified Rules of Boxing, as promulgated by the Association of Boxing Commissions, is incorporated by reference and made a part of this chapter except as qualified by this chapter and Minnesota Rules, chapter 2201. In the event of a conflict between this chapter and the Unified Rules, this chapter must govern.\n(e) The most recent version of the Unified Rules of Kickboxing and Unified Rules of Muay Thai, as promulgated by the Association of Boxing Commissions, are incorporated by reference and made a part of this chapter except as qualified by this chapter and any applicable Minnesota Rules. In the event of a conflict between this chapter and those rules, this chapter must govern. If a promoter seeks to hold a kickboxing event governed by a different set of kickboxing rules, the promoter must send the commissioner a copy of the rules under which the proposed bouts will be conducted at least 45 days before the event. The commissioner may approve or deny the use of the alternative rules at the commissioner's discretion. If the alternative rules are approved for an event, this chapter and any applicable Minnesota Rules, except of those incorporating the Unified Rules of Kickboxing and Unified Rules of Muay Thai, must govern if there is a conflict between the rules and Minnesota law.",
	"repealed": false
}