{
	"id": "122A.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.091",
	"title": "122A.091 REPORTS.",
	"text": "(a) The Professional Educator Licensing and Standards Board and the Board of School Administrators, in cooperation with board-approved teacher or administrator preparation programs, annually must collect and report summary data on teacher and administrator preparation and performance outcomes, consistent with this subdivision. The Professional Educator Licensing and Standards Board and the Board of School Administrators annually by July 1 must update and post the reported summary preparation and performance data on teachers and administrators from the preceding school years on their respective websites.\n(b) Publicly reported summary data on teacher preparation providers must include:\n(1) summary data on teacher educator qualifications and their years of experience either as birth through grade 12 classroom teachers or school administrators;\n(2) the current number and percentage of enrolled candidates who entered the program through a transfer pathway disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(3) the current number and percentage of program completers by program who received a Tier 3 or Tier 4 license disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(4) the current number and percentage of program completers who entered the program through a transfer pathway and received a Tier 3 or Tier 4 license disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(5) the current number and percentage of program completers who were hired to teach full time in their licensure field in a Minnesota district or school in the preceding year disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(6) the current number and percentage of program completers who entered the program through a transfer pathway and who were hired to teach full time in their licensure field in a Minnesota district or school in the preceding year disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(7) board-adopted survey results measuring initial licensure program quality and structure in the preceding school year disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(8) board-adopted survey results from school principals or supervisors on initial licensure program quality and structure; and\n(9) the number and percentage of program completers who met or exceeded the state threshold score on the board-adopted teacher performance assessment.\nProgram reporting must be consistent with subdivision 2.\n(c) Publicly reported summary data on administrator preparation programs approved by the Board of School Administrators must include:\n(1) summary data on faculty qualifications, including at least the content areas of faculty undergraduate and graduate degrees and the years of experience either as kindergarten through grade 12 classroom teachers or school administrators;\n(2) the average time program graduates in the preceding year needed to complete the program;\n(3) the current number and percentage of students who graduated, received a standard Minnesota administrator license, and were employed as an administrator in a Minnesota school district or school in the preceding year disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual;\n(4) the number of credits by graduate program that students in the preceding school year needed to complete to graduate;\n(5) survey results measuring student, graduate, and employer satisfaction with the program in the preceding school year disaggregated by race, except when disaggregation would not yield statistically reliable results or would reveal personally identifiable information about an individual; and\n(6) information under subdivision 3, paragraphs (c) and (d).\nProgram reporting must be consistent with section 122A.14, subdivision 10.\nBy December 31, 2018, and annually thereafter, the Professional Educator Licensing and Standards Board shall report and publish on its website the cumulative summary results of at least three consecutive years of data reported to the board under subdivision 1, paragraph (b). Where the data are sufficient to yield statistically reliable information and the results would not reveal personally identifiable information about an individual teacher, the board shall report the data by teacher preparation program.\nMS 2022 [Repealed, 2023 c 55 art 5 s 67]\nThe Professional Educator Licensing and Standards Board must prepare reports in accordance with section 214.07.\nThe Professional Educator Licensing and Standards Board must submit a report to the education committees of the legislature by November 1, 2025, and November 1 of each even-numbered year thereafter, on the supply and demand of teachers. The report must be made available on the board's website. The report must include data regarding:\n(1) retirement patterns;\n(2) teacher licensure;\n(3) teacher diversity, including whether the state's teacher workforce reflects the diversity of the state's student population;\n(4) the teacher shortage, and the substitute teacher shortage, including patterns and shortages in licensure field areas and the economic development regions of the state;\n(5) survey data from school districts and teacher preparation programs; and\n(6) whether districts are making progress in hiring teachers and substitute teachers in the areas of shortage.\nMS 2022 [Repealed, 2023 c 55 art 5 s 67]",
	"repealed": false
}