{
	"id": "168D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/168D.02",
	"title": "168D.02 FUEL TAX COMPACT.",
	"text": "(a) The commissioner of public safety may enter into an agreement or arrangement with the duly authorized representative of another jurisdiction or make an independent declaration granting to motor carriers of qualified motor vehicles properly registered or licensed in another member jurisdiction benefits, privileges, and exemptions from paying, wholly or partially, fuel taxes, fees, or other charges imposed for operating the vehicles under the laws of Minnesota. The agreement, arrangement, or declaration may impose terms and conditions consistent with federal and state laws and regulations.\n(b) The commissioner of public safety may ratify and effectuate an international fuel tax agreement or other fuel tax agreement in accordance with state and federal authorities. The commissioner's authority includes collecting fuel taxes due, issuing fuel licenses, issuing refunds, conducting audits, assessing penalties and interest, issuing fuel trip permits, issuing decals, and suspending or denying licensing.\n(c) Based on these powers, the commissioner and the state of Minnesota have entered into a formal agreement with other states of the United States, the District of Columbia, provinces and territories of Canada, and any other member jurisdiction of the International Fuel Tax Agreement (IFTA) compact as approved by Congress in the Intermodal Surface Transportation Efficiency Act (ISTEA), Public Law 102-240, to assess and collect fuel tax in a uniform and consistent manner across jurisdictions.\n(a) As a member of the IFTA compact, the state of Minnesota recognizes and affirms the provisions set forth in that agreement.\n(b) Under the provisions of this agreement, the state of Minnesota shall provide an open exchange of information between member jurisdictions and the IFTA clearinghouse but reserves the right to stipulate the level of security and privacy of the information in transmission and storage to protect the privacy rights of its citizens according to chapters 13 through 13D.\n(c) An agreement or arrangement must be in writing and provide that when a qualified motor vehicle properly licensed for fuel in the state of Minnesota is operated on highways of another member jurisdiction, it must receive exemptions, benefits, and privileges of a similar kind or to a similar degree as are extended to a qualified motor vehicle properly licensed for fuel in that member jurisdiction while it is being operated in the state of Minnesota.\n(d) A declaration must be in writing and must contemplate and provide for mutual benefits, reciprocal privileges, or equitable treatment of the motor carrier of a qualified motor vehicle registered for fuel in Minnesota and the other member jurisdictions. In the judgment of the commissioner of public safety, an agreement, arrangement, or declaration must be in the best interest of Minnesota and its citizens and must be fair and equitable regarding the benefits that the agreement brings to the economy of Minnesota.",
	"repealed": false
}