{
	"id": "473.517",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.517",
	"title": "473.517 ALLOCATION OF COSTS.",
	"text": "Except as provided in subdivision 3, the estimated costs of operation, maintenance, and debt service of the metropolitan disposal system to be paid by the council in each fiscal year, and the costs of acquisition and betterment of the system which are to be paid during the year from funds other than bond proceeds, including all expenses incurred by the council pursuant to sections 473.501 to 473.545, are referred to in this section as current costs, and shall be allocated among and paid by all local government units which will discharge sewage, directly or indirectly, into the metropolitan disposal system during the budget year according to an allocation method determined by the council. The allocated costs may include an amount for a reserve or contingency fund and an amount for cash flow management. The cash flow management fund so established must not exceed five percent of the council's total wastewater services operating budget.\nMS 1996 [Repealed by amendment, 1997 c 181 s 2]\n(a) In preparing each budget the council shall estimate the current costs of acquisition, betterment, and debt service, only, of the treatment works in the metropolitan disposal system which will not be used to total capacity during the budget year, and the percentage of such capacity which will not be used, and shall deduct the same percentage of such treatment works costs from the current costs allocated under subdivision 1. The council shall also estimate the current costs of acquisition, betterment, and debt service, only, of the interceptors in the metropolitan disposal system that will not be used to total capacity during the budget year, shall estimate the percentage of the total capacity that will not be used, and shall deduct the same percentage of interceptor costs from the current costs allocated under subdivision 1. The total amount so deducted with respect to all treatment works and interceptors in the system shall be allocated among and paid by the respective local government units in the metropolitan area through a metropolitan sewer availability charge for each new connection or increase in capacity demand to the metropolitan disposal system within each local government unit. Amounts collected through the metropolitan sewer availability charge (SAC) must be deposited in the council's wastewater reserve capacity fund. Each fiscal year an amount from the wastewater reserve capacity fund shall be transferred to the wastewater operating fund for the reserved capacity costs described in this paragraph. For the purposes of this subdivision, the amount transferred from the wastewater reserve capacity fund to the wastewater operating fund shall be referred to as the \"SAC transfer amount.\"\n(b) The council will record on a cumulative basis the total SAC transfer deficit. In any year that the wastewater reserve capacity fund has a year-end balance of at least two years' estimated SAC transfer amount, the council shall increase the subsequent annual SAC transfer amount in excess of the amount required by paragraph (a) with the goal of eliminating the cumulative total SAC transfer deficit. The annual amount by which the council increases the SAC transfer amount shall be determined by the council after appropriate study and a public hearing.\nMS 1986 [Repealed, 1987 c 53 s 8]\nMS 1986 [Repealed, 1987 c 53 s 8]\n(a) Upon request of a local government unit, the council may provide for the deferment of payment of all or part of the allocated costs that are allocated by the council to that local government unit in any year pursuant to subdivision 1, repayable at the time or times specified by the council, with interest as determined by the council. A deferment must not result in an increase to the allocated costs which are allocated by the council to other local government units in any year pursuant to subdivision 1.\n(b) Upon request of a local government unit, the council may provide for the deferment of payment of all or part of the allocated costs which are allocated by the council to a local government unit in any year pursuant to subdivision 3, repayable at such time or times as the council shall specify, with interest at the approximate average annual rate borne by council bonds outstanding at the time of the deferment, as determined by the council. Such deferred costs shall be allocated to and paid by all local government units in the metropolitan area which will discharge sewage, directly or indirectly, into the metropolitan disposal system in the budget year for which the deferment is granted, in the same manner and proportions as costs are allocated under subdivision 1.\nMS 1986 [Repealed, 1987 c 53 s 8]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]\n(a) The term \"industrial discharger\" for the purposes of this subdivision means a recipient of wastewater treatment services that is required by council rules or procedures to have a permit issued by the council in order to discharge sewage to the metropolitan disposal system.\n(b) The council may directly impose on all or any category of industrial dischargers all or any portion of the costs that would otherwise be allocated among and paid by local government units under subdivision 1. Any amounts imposed directly on industrial dischargers by the council under this subdivision must be deducted from the amounts to be allocated among and paid by local government units under subdivision 1, and any charges imposed by a local government unit for the same purpose are of no further force and effect from and after the effective date of the council's direct charges. Charges imposed under this subdivision are in addition to any other charges imposed on industrial dischargers by a local government unit and must be paid by the industrial discharger at such intervals as may be established by the council. The council may impose interest charges upon delinquent payments.\n(c) Charges by the council to industrial dischargers under this subdivision including any interest charges, as well as any other charges or related fees owed by the industrial discharger pursuant to a discharge permit issued by the council for the subject property, are a charge jointly and severally against the owners, lessees, and occupants of the property served. The council may certify such unpaid amounts to the appropriate county auditor as a tax for collection as other taxes are collected on the property served. The proceeds of any tax collected pursuant to the council's certification must be paid by the county treasurer to the council when collected. Certification does not preclude the council from recovery of delinquent amounts and interest under any other available remedy.",
	"repealed": false
}