{
	"id": "260B.157",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.157",
	"title": "260B.157 INVESTIGATION; PHYSICAL AND MENTAL EXAMINATION.",
	"text": "Upon request of the court the local social services agency or probation officer shall investigate the personal and family history and environment of any minor coming within the jurisdiction of the court under section 260B.101 and shall report its findings to the court. The court may order any minor coming within its jurisdiction to be examined by a duly qualified physician, psychiatrist, or psychologist appointed by the court.\nThe court shall order a chemical use assessment conducted when a child is (1) found to be delinquent for violating a provision of chapter 152, or for committing a felony-level violation of a provision of chapter 609 if the probation officer determines that alcohol or drug use was a contributing factor in the commission of the offense, or (2) alleged to be delinquent for violating a provision of chapter 152, if the child is being held in custody under a detention order. The assessor's qualifications must comply with section 245G.11, subdivisions 1 and 5, and the assessment criteria must comply with section 245G.05. If funds under chapter 254B are to be used to pay for the recommended treatment, the assessment must comply with all provisions of sections 245G.05 and 254B.04. The commissioner of children, youth, and families shall reimburse the court for the cost of the chemical use assessment, up to a maximum of $100.\nThe court shall order a children's mental health screening conducted when a child is found to be delinquent. The screening shall be conducted with a screening instrument approved by the commissioner of human services and shall be conducted by a mental health practitioner as defined in section 245.4871, subdivision 26, or a probation officer who is trained in the use of the screening instrument. If the screening indicates a need for assessment, the local social services agency, in consultation with the child's family, shall have a diagnostic assessment conducted, including a functional assessment, as defined in section 245.4871.\nWith the consent of the commissioner of corrections and agreement of the county to pay the costs thereof, the court may, by order, place a minor coming within its jurisdiction in an institution maintained by the commissioner for the detention, diagnosis, custody and treatment of persons adjudicated to be delinquent, in order that the condition of the minor be given due consideration in the disposition of the case. Any funds received under the provisions of this subdivision shall not cancel until the end of the fiscal year immediately following the fiscal year in which the funds were received. The funds are available for use by the commissioner of corrections during that period and are hereby appropriated annually to the commissioner of corrections as reimbursement of the costs of providing these services to the juvenile courts.\nThe court may proceed as described in subdivision 1 only after a petition has been filed and, in delinquency cases, after the child has appeared before the court or a court appointed referee and has been informed of the allegations contained in the petition. However, when the child denies being delinquent before the court or court-appointed referee, the investigation or examination shall not be conducted before a hearing has been held as provided in section 260B.163.\n(a) The local social services agency shall establish a juvenile treatment screening team to conduct screenings and prepare case plans under this subdivision. The team, which may be the team constituted under section 245.4885 or 256B.092 or chapter 254B, shall consist of social workers, juvenile justice professionals, and persons with expertise in the treatment of juveniles who are emotionally disabled, chemically dependent, or have a developmental disability. The team shall involve parents or guardians in the screening process as appropriate. The team may be the same team as defined in section 260C.157, subdivision 3.\n(b) If the court, prior to, or as part of, a final disposition, proposes to place a child:\n(1) for the primary purpose of treatment for an emotional disturbance, and residential placement is consistent with section 260.012, a developmental disability, or chemical dependency in a residential treatment facility out of state or in one which is within the state and licensed by the commissioner of human services under chapter 245A; or\n(2) in any out-of-home setting potentially exceeding 30 days in duration, including a post-dispositional placement in a facility licensed by the commissioner of corrections or human services, the court shall notify the county welfare agency. The county's juvenile treatment screening team must either:\n(i) screen and evaluate the child and file its recommendations with the court within 14 days of receipt of the notice; or\n(ii) elect not to screen a given case, and notify the court of that decision within three working days.\n(c) If the screening team has elected to screen and evaluate the child, the child may not be placed for the primary purpose of treatment for an emotional disturbance, a developmental disability, or chemical dependency, in a residential treatment facility out of state nor in a residential treatment facility within the state that is licensed under chapter 245A, unless one of the following conditions applies:\n(1) a treatment professional certifies that an emergency requires the placement of the child in a facility within the state;\n(2) the screening team has evaluated the child and recommended that a residential placement is necessary to meet the child's treatment needs and the safety needs of the community, that it is a cost-effective means of meeting the treatment needs, and that it will be of therapeutic value to the child; or\n(3) the court, having reviewed a screening team recommendation against placement, determines to the contrary that a residential placement is necessary. The court shall state the reasons for its determination in writing, on the record, and shall respond specifically to the findings and recommendation of the screening team in explaining why the recommendation was rejected. The attorney representing the child and the prosecuting attorney shall be afforded an opportunity to be heard on the matter.",
	"repealed": false
}