{
	"id": "525.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/525.475",
	"title": "525.475 DORMANT ESTATE; REMOVAL OF REPRESENTATIVE OR ATTORNEY.",
	"text": "(1) In a supervised administration under sections 524.3-501 to 524.3-505:\n(a) If an order of complete settlement of the estate or a decree, as provided in section 524.3-1001, is not entered within 18 months after appointment of the personal representative, the court shall order the personal representative and the attorney to show good cause why an order of complete settlement of the estate or a decree has not been entered.\n(b) If good cause is not shown the court shall order the removal of the personal representative, instruct the personal representative to dismiss the attorney and employ another attorney, if necessary, to complete the administration of the estate, or shall order such other or further relief as may be appropriate. In addition, the court may refer a record of the proceeding to the state Board of Professional Responsibility. If removal of the personal representative is ordered, the court shall also direct by order the disposition of the assets remaining in the name of, or under the control of, the personal representative being removed.\n(c) If good cause is shown, the court shall order that the time for administration of the estate be extended for an additional period not to exceed one year. If an order of complete settlement of the estate or a decree, as provided in section 524.3-1001, is not entered within such extended period, the court shall again order the personal representative and the attorney to show cause why an order of complete settlement or a decree has not been entered. If good cause is not shown, the provisions of paragraph (b) of this section shall be applicable. If good cause is shown, the court shall order that the time for administration of the estate be again extended for an additional period not to exceed one year and the provisions of this paragraph (c) of this section shall be applicable to such additional extension.\n(2) In an administration other than a supervised administration under sections 524.3-501 to 524.3-505:\n(a) Upon the petition of an interested person and upon showing of probable cause for relief, the court shall order the personal representative and the attorney to show cause why the estate has not been closed pursuant to the provisions of sections 524.3-1001 to 524.3-1003.\n(b) If good cause is not shown, the court shall order the removal of the personal representative, instruct the personal representative to dismiss the attorney and employ another attorney, if necessary, to complete the administration of the estate or shall order such other or further relief as may be appropriate. In addition, the court may refer a record of the proceeding to the state Board of Professional Responsibility. If removal of the personal representative is ordered, the court shall also direct by order the disposition of the assets remaining in the name of, or under the control of, the personal representative being removed.\n(c) If good cause is shown, the court shall enter an order so finding. An interested party may thereafter again petition the court for an order directing the personal representative and the attorney to show cause why the estate has not been closed pursuant to the provisions of sections 524.3-1001 to 524.3-1003.\n(3) An attorney dismissed pursuant to this section and who is seeking attorney fees for services rendered to the estate has the burden of affirmatively proving that the estate has benefited from the services and that the benefits warrant the payment of the requested fee.",
	"repealed": false
}