{
	"id": "469.203",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.203",
	"title": "469.203 TARGETED COMMUNITY REVITALIZATION AND FINANCING.",
	"text": "For each targeted community for which a city requests state financial assistance under section 469.204, the city must prepare a comprehensive revitalization and financing program that includes the following:\n(1) the revitalization objectives of the city for the targeted community;\n(2) the specific activities or means by which the city intends to pursue and implement the revitalization objectives;\n(3) the extent to which the activities identified in clause (2) will benefit low- and moderate-income families, will alleviate the blighted condition of the targeted community, or will otherwise assist in the revitalization of the targeted community;\n(4) a statement of the intended outcomes to be achieved by implementation of the targeted revitalization program, how the outcomes will be measured both qualitatively and quantitatively, and the estimated time over which they will occur; and\n(5) a financing program and budget that identifies the financial resources necessary to implement the targeted revitalization program, including:\n(i) the estimated total cost to implement the targeted revitalization program;\n(ii) the estimated cost to implement each activity in the revitalization program identified in clause (2);\n(iii) the estimated amount of financial resources that will be available from all sources other than from the appropriation available under section 469.204 to implement the revitalization program, including the amount of private investment expected to result from the use of public money in the targeted community;\n(iv) the estimated amount of the appropriation available under section 469.204 that will be necessary to implement the targeted revitalization program;\n(v) a description of the activities identified in the targeted revitalization program for which the state appropriation will be committed or spent; and\n(vi) a statement of how the city intends to meet the requirement for a financial contribution from city matching money.\nA city requesting state financial assistance under section 469.204 shall follow a process to involve the residents of targeted communities in the development, drafting, and implementation of the targeted revitalization program. The process shall include the use of a citizen participation process established by the city. A description of the process must be included in the program. The process to involve residents of the targeted community must include at least one public meeting in the targeted community.\nMS 2008 [Repealed, 2009 c 78 art 8 s 23]\n(a) Before or after adoption of a revitalization program under paragraph (b), the city must submit a preliminary program to the commissioner and the Minnesota Housing Finance Agency for their comments. Comments received by the city from the state agencies within 30 days after submission of the preliminary program must be responded to in writing by the city.\n(b) The city may adopt a targeted revitalization program subject to any local public notification requirements and consistent with the citizen participation process established for identifying targeted communities.\n(c) A certification by the city that a targeted revitalization program has been approved by the city council for the targeted community must be provided to the commissioner together with a copy of the program. A copy of the program must also be provided to the Minnesota Housing Finance Agency.\n(d) A targeted revitalization program for the city may be modified at any time by the city council after a public hearing, notice of which is published in a newspaper of general circulation in the city at least ten days nor more than 30 days before the date of the hearing. If the city council determines that the proposed modification is a significant modification to the program originally certified under paragraph (c), the city council shall implement the targeted revitalization program approval and certification process of this subdivision for the proposed modification.\nMS 1989 Supp [Repealed, 1990 c 423 s 7]",
	"repealed": false
}