{
	"id": "298.2961",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.2961",
	"title": "298.2961 PRODUCER GRANTS.",
	"text": "(a) $10,000,000 is appropriated from the Douglas J. Johnson economic protection trust fund to a special account in the taconite area environmental protection fund for grants to producers on a project-by-project basis as provided in this section.\n(b) The proceeds of the tax designated under section 298.28, subdivision 9b, are appropriated for grants to producers on a project-by-project basis as provided in this section.\n(a) Projects funded must be for:\n(1) environmentally unique reclamation projects; or\n(2) pit or plant repairs, expansions, or modernizations other than for a value added iron products plant.\n(b) The commissioner may approve a project only after consultation with the advisory board.\n(c) The commissioner, after consultation with the advisory board, may require that the fund receive an equity percentage in any project to which it contributes under this section.\n(a) If a taconite production facility is sold after operations at the facility had ceased, any money remaining in the taconite environmental fund for the former producer may be released to the purchaser of the facility on the terms otherwise applicable to the former producer under this section.\n(b) Any portion of the taconite environmental fund that is not released by the commissioner within three years of its deposit in the taconite environmental fund shall be divided between the taconite environmental protection fund created in section 298.223 and the Douglas J. Johnson economic protection trust fund created in section 298.292 for placement in their respective special accounts. Two-thirds of the unreleased funds must be distributed to the taconite environmental protection fund and one-third to the Douglas J. Johnson economic protection trust fund.\n(a) A fund is established to receive distributions under section 298.28, subdivision 9b, and to make grants or loans as provided in this subdivision. Any grant or loan made under this subdivision must be approved by the commissioner, after consultation with the advisory board, established under section 298.22.\n(b) All distributions received in 2009 and subsequent years are allocated for projects under section 298.223, subdivision 1.\n[Repealed, 2016 c 158 art 1 s 215]\n[Repealed, 2016 c 158 art 1 s 215]\n[Repealed, 2016 c 158 art 1 s 215]",
	"repealed": false
}