{
	"id": "144.581",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.581",
	"title": "144.581 HOSPITAL AUTHORITIES.",
	"text": "A municipality, political subdivision, state agency, or other governmental entity that owns or operates a hospital authorized, organized, or operated under chapters 158, 250, 376, and 397, or under sections 412.221, 447.05 to 447.13, 447.31, or 471.59, or under any special law authorizing or establishing a hospital or hospital district shall, relative to the delivery of health care services, have, in addition to any authority vested by law, the authority and legal capacity of a nonprofit corporation under chapter 317A, including authority to:\n(1) enter shared service and other cooperative ventures;\n(2) join or sponsor membership in organizations intended to benefit the hospital or hospitals in general;\n(3) enter partnerships;\n(4) incorporate other corporations;\n(5) have members of its governing authority or its officers or administrators serve as directors, officers, or employees of the ventures, associations, or corporations;\n(6) own shares of stock in business corporations;\n(7) offer, directly or indirectly, products and services of the hospital, organization, association, partnership, or corporation to the general public;\n(8) expend funds, including public funds in any form, or devote the resources of the hospital or hospital district to recruit or retain physicians whose services are necessary or desirable for meeting the health care needs of the population, and for successful performance of the hospital or hospital district's public purpose of the promotion of health. Allowable uses of funds and resources include the retirement of medical education debt, payment of onetime amounts in consideration of services rendered or to be rendered, payment of recruitment expenses, payment of moving expenses, and the provision of other financial assistance necessary for the recruitment and retention of physicians, provided that the expenditures in whatever form are reasonable under the facts and circumstances of the situation; and\n(9) notwithstanding any limitation in chapter 118A, invest hospital funds in any security which has been recommended by an investment adviser registered under the federal Investment Advisers Act of 1940, United States Code, title 15, sections 80b-1 to 80b-21, or by a bank or trust company exercising its trust powers. Funds invested under this clause must be invested according to written investment policies and written investment procedures established by the governmental entity.\nIn the event that the municipality, political subdivision, state agency, or other governmental entity provides direct financial subsidy to the hospital from tax revenue at the time an undertaking authorized under subdivision 1, clauses (1) to (7), is established or funded, the hospital may not contribute funds to the undertaking for more than three years and thereafter all funds must be repaid, with interest in no more than ten years.\nThe conversion of public funds for the benefit of any individual shall constitute grounds for review and action by the attorney general or the county attorney under section 609.54.\nThe execution of the functions of the board of directors of a hospital by an organization established under this section shall be subject to the public purchasing requirements of section 471.345, the Open Meeting Law, chapter 13D, and the Data Practices Act, chapter 13.\n(a) Notwithstanding subdivision 4 or chapter 13D, a public hospital or an organization established under this section may hold a closed meeting to discuss specific marketing activity and contracts that might be entered into pursuant to the marketing activity in cases where the hospital or organization is in competition with health care providers that offer similar goods or services, and where disclosure of information pertaining to those matters would cause harm to the competitive position of the hospital or organization, provided that the goods or services do not require a tax levy. No contracts referred to in this paragraph may be entered into earlier than 15 days after the proposed contract has been described at a public meeting and the description entered in the minutes, except for contracts for consulting services or with individuals for personal services.\n(b) A meeting may not be closed under paragraph (a) except by a majority vote of the board of directors in a public meeting. The time and place of the closed meeting must be announced at the public meeting. A written roll of members present at the closed meeting must be available to the public after the closed meeting. The proceedings of a closed meeting must be tape-recorded and preserved by the board of directors for two years. The data on the tape are nonpublic data under section 13.02, subdivision 9. However, the data become public data under section 13.02, subdivision 14, two years after the meeting, or when the hospital or organization takes action on matters referred to in paragraph (a), except for contracts for consulting services. In the case of personal service contracts, the data become public when the contract is signed. For entities subject to section 471.345, a contract entered into by the board is subject to the requirements of section 471.345.\n(c) The board of directors may not discuss a tax levy, bond issuance, or other expenditure of money unless the expenditure is directly related to specific marketing activities and contracts described in paragraph (a) at a closed meeting.",
	"repealed": false
}