{
	"id": "17.697",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.697",
	"title": "17.697 INFORMATIONAL EXCHANGES; DISPUTE RESOLUTION.",
	"text": "As used in sections 17.691 to 17.702, \"informational exchange\" means the mutual obligation of a handler and an association or their designated representatives to meet at a mutually agreed-upon time in conformance with sections 17.691 to 17.702 and confer and provide information about their expectations for the upcoming marketing year. The informational exchange must be a serious, fair, and reasonable attempt to reach agreement by acknowledging or refuting with reason points brought up by either party with respect to the terms and conditions of a contract relative to trading between handlers and producers of the agricultural commodity. The topics may include, but are not limited to, the following:\n(1) prices and terms of sale;\n(2) quality specifications;\n(3) quantity to be marketed by acreage or weight;\n(4) transactions involving products and services utilized by one party and provided by the other party; and\n(5) checkoff procedures pursuant to assessments levied by the association whereby a portion of the producers' annual production payments under a contract are collected by handlers from producers within the bargaining unit and paid to the association on some other arrangement.\nThe handler and an association of producers or their designated representatives shall meet at least two times for informational exchanges prior to 60 days before the beginning of the marketing year. Neither party, however, is required to disclose proprietary business or financial records or information. Both parties shall inform the department in writing of the time of both informational exchanges at least ten days prior to the first meeting. Verification of completion of training in negotiation, as described in section 17.702, must be included with the notification sent to the commissioner.\nAfter the conclusion of the second informational exchange and no agreement is reached, negotiations may continue between the parties at mutually agreed-upon times. Mediation may be requested in accordance with this section by any party.\nThe parties may reach agreement for a contract during the informational exchanges. However, the obligation to meet for informational exchanges does not require either party to agree to a proposal, to make a concession, or to enter into a contract.\nIf an agreement is not reached during the informational exchanges, negotiations must be considered to continue and either party may request mediation as provided in this section. Negotiations may continue without mediation and an agreement may be reached without the use of mediation. Negotiations must be a serious, fair, and reasonable attempt to reach agreement by acknowledging or refuting with reason points brought up by either party with respect to the terms and conditions of a contract relative to trading between handlers and producers of the agricultural commodity. A request for mediation requires both parties to the negotiation to complete the mediation process described in this section, but does not obligate either party to agree to a proposal, to make a concession, or to enter into a contract. However, the parties are required to perform according to any agreement reached at the conclusion of the mediation process.\nAn association of producers or a handler may request mediation only within ten days after the second informational exchange meeting. Written notice requesting mediation must be mailed to the commissioner and postmarked within ten days of the second informational exchange, with a copy to the nonrequesting party, and the notice for mediation must contain the last offer made by the party requesting mediation. Within three days after receiving the request for mediation, the commissioner shall require the nonrequesting party to provide reasons for rejecting the last offer made by the requesting party and revisions to the last offer that might be required to reach an agreement. The nonrequesting party will have five days from the date of the postmark to provide a response to the commissioner and also provide a copy of the response to the requesting party. The commissioner shall request the American Arbitration Association or a comparable dispute resolution organization to make available a list of at least three qualified mediators, but not more than six, for the parties to select one individual to mediate the dispute. Qualified mediators are those who have met the training requirements of Rule 114.12 of the Minnesota General Rules of Practice for the District Courts, are familiar with sections 17.691 to 17.702, and have served as mediator in at least three other commercial disputes or have commensurate experience. The handler and the association may agree on a mediator or, failing agreement, the commissioner may select the mediator from the list provided by allowing each party to strike one mediator and choosing one from the remaining names on the list.\nThe American Arbitration Association mediation rules must be followed during the mediation process. If there is a conflict between those rules and this statute, the statute prevails. Any information shared in the mediation process or offers to settle are to be considered confidential and must not be used against either party in any other proceeding, court action, or dispute resolution process unless otherwise discoverable from outside of the mediation process.\nThe mediation process must conclude not more than 20 days after the mediator has been selected and notified by the department. If the mediator feels that additional time may result in an agreement between the parties, the mediator may extend the mediation process for an additional five days. However, the mediation must conclude, under any circumstance, no later than 15 days prior to the start of the marketing year, unless the parties agree to a different date, but no later than the first day of the marketing year.\nAll costs for retaining a mediator and proceedings during the mediation process must be shared equally by both parties.\nThe commissioner has the subpoena authority to compel participation in the mediation process for either party after the informational exchanges.\nAny final written agreement reached during the mediation procedure is enforceable under the law and in the courts of this state. The parties are not required to reach an agreement, but they are required to proceed through the mediation process as outlined in this section.\nIf an agreement is not reached during the mediation process, and upon written consent by both parties, binding arbitration as set forth in this chapter may be used to create a contract or resolve the dispute.\nThe parties shall each notify the commissioner after the end of the mediation period, if an agreement has not been reached, of their desire to use binding arbitration to settle the dispute. An arbitrator must be selected as provided in subdivision 18. The notification must include its final offer in which it shall identify all matters as to which the parties agree with contractual language setting forth these agreements and all matters as to which the parties do not agree with contractual language setting forth the party's final offer for resolution of those disagreements.\nFor all matters submitted to arbitration, the arbitrator may choose between the final offers of the parties or fashion a different solution between, but not exceeding, the final offers of the parties. If the parties reach an agreement on the matters under arbitration before the arbitrator issues a decision, they may submit a joint final offer that the arbitrator shall accept and render as the decision. The arbitrator may hold hearings and administer oaths, examine witnesses and documents, take testimony and receive evidence, and issue subpoenas to compel the attendance of witnesses and the production of records. A person who fails to obey the subpoena of an arbitrator may be punished for contempt of court on application by the arbitrator to the district court for the county in which the failure occurs. The arbitrator may use other information in addition to that provided by or elicited from the parties. The arbitrator shall issue a decision within ten days of the commencement of arbitration and that decision is binding on the parties. If the parties reach an agreement on the matters in the arbitrator's decision prior to signing the contract, they may submit a joint final offer to the arbitrator. The arbitrator shall rescind the previous decision and accept and render the joint final offer as the decision.\nWithin five days after the arbitrator's decision, the handler shall prepare a contract that must include all terms agreed to by the parties in bargaining or awarded in arbitration and shall present the contract to the association of producers who must accept the terms of the contract within five days of its presentation.\nThe commissioner, in consultation with the American Arbitration Association or comparable dispute resolution organization, shall establish a list of arbitrators who are qualified by education, training, and experience to carry out the responsibilities of an arbitrator under this section.\nAll costs of arbitration must be borne equally by the parties. The arbitrator shall submit a statement of charges and expenses to the parties and to the commissioner. Each party shall pay the arbitrator directly.\nThe arbitrator must be selected by the commissioner. The commissioner shall submit a list composed of the names of three persons knowledgeable in the marketing of the agricultural commodity from which the arbitrator must be chosen. Qualified arbitrators are those who have met the training requirements of Rule 114.12 of the Minnesota General Rules of Practice for the District Courts, are familiar with sections 17.691 to 17.702, and have served as an arbitrator in at least three other commercial disputes or have commensurate experience. The selection must be made by the association representative and the handler representative, each striking one name from the list. If two names remain, the commissioner shall decide which one is the arbitrator.",
	"repealed": false
}