{
	"id": "115A.9155",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.9155",
	"title": "115A.9155 DISPOSING OF CERTAIN DRY CELL BATTERIES.",
	"text": "A person may not place in mixed municipal solid waste a dry cell battery containing mercuric oxide electrode, silver oxide electrode, nickel-cadmium, or sealed lead-acid that was purchased for use or used by a government agency, or an industrial, communications, or medical facility.\n(a) A manufacturer of batteries subject to subdivision 1 shall:\n(1) ensure that a system for the proper collection, transportation, and processing of waste batteries exists for purchasers in Minnesota; and\n(2) clearly inform each final purchaser of the prohibition on disposal of waste batteries and of the system or systems for proper collection, transportation, and processing of waste batteries available to the purchaser.\n(b) To ensure that a system for the proper collection, transportation, and processing of waste batteries exists, a manufacturer shall:\n(1) identify collectors, transporters, and processors for the waste batteries and contract or otherwise expressly agree with a person or persons for the proper collection, transportation, and processing of the waste batteries; or\n(2) accept waste batteries returned to its manufacturing facility.\n(c) At the time of sale of a battery subject to subdivision 1, a manufacturer shall provide in a clear and conspicuous manner a telephone number that the final consumer of the battery can call to obtain information on specific procedures to follow in returning the battery for recycling or proper disposal. The manufacturer may include the telephone number and notice of return procedures on an invoice or other transaction document held by the purchaser. The manufacturer shall provide the telephone number to the commissioner of the agency.\n(d) A manufacturer shall ensure that the cost of proper collection, transportation, and processing of the waste batteries is included in the sales transaction or agreement between the manufacturer and any purchaser.\n(e) A manufacturer that has complied with this subdivision is not liable under subdivision 1 for improper disposal by a person other than the manufacturer of waste batteries.",
	"repealed": false
}