{
	"id": "148.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.032",
	"title": "148.032 REGISTRATION IN ANIMAL CHIROPRACTIC DIAGNOSIS AND TREATMENT.",
	"text": "(a) The following educational criteria must be applied to any licensed chiropractor who requests registration in animal chiropractic diagnosis and treatment. The criteria must include education and training in the following subjects:\n(1) anatomy;\n(2) anatomy laboratory;\n(3) biomechanics and gait;\n(4) chiropractic educational basics;\n(5) animal chiropractic diversified adjusting technique, including:\n(i) lecture cervical;\n(ii) thoracic;\n(iii) lumbosacral;\n(iv) pelvic; and\n(v) extremity;\n(6) animal chiropractic diversified adjusting technique, including:\n(i) laboratory cervical;\n(ii) thoracic;\n(iii) lumbosacral;\n(iv) pelvic; and\n(v) extremity;\n(7) case management and case studies;\n(8) chiropractic philosophy;\n(9) ethics and legalities;\n(10) neurology, neuroanatomy, and neurological conditions;\n(11) pathology;\n(12) radiology;\n(13) research in current chiropractic and veterinary topics;\n(14) rehabilitation, current topics, evaluation, and assessment;\n(15) normal foot anatomy and normal foot care;\n(16) saddle fit and evaluation, lecture, and laboratory;\n(17) veterinary educational basics;\n(18) vertebral subluxation complex; and\n(19) zoonotic diseases.\n(b) A licensed chiropractor requesting registration in animal chiropractic diagnosis and treatment must have completed and passed a course of study from an American Veterinary Chiropractic Association, International Veterinary Chiropractic Association, or higher institution-approved program, consisting of no less than 210 hours of education and training as set forth in paragraph (a).\n(c) A licensed chiropractor engaged in the practice of animal chiropractic diagnosis and treatment must maintain complete and accurate records and patient files in the chiropractor's office for at least three years.\n(d) A licensed chiropractor engaged in the practice of animal chiropractic diagnosis and treatment must make treatment notes and records available to the patient's owner upon request and must communicate their findings and treatment plan with the referring veterinarian if requested by the patient's owner.\n(e) A licensed chiropractor who treats both animal and human patients in the same facility must post a conspicuous sign in the reception area of that facility informing customers that nonhuman patients are treated on the premises.",
	"repealed": false
}