{
	"id": "163.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.04",
	"title": "163.04 EXPENDITURES.",
	"text": "The county board may appropriate and expend sums of money from the county road and bridge fund as it deems necessary for establishing, locating, constructing, improving, and maintaining any county highway or county state-aid highway, including those within the corporate limits of any city in the county.\nThe county board of any county may appropriate from its road and bridge fund to any town, statutory city, or city of the second, third, or fourth class in its county, such sums of money as are available and which it deems advisable to aid such towns, statutory cities, or cities of the second, third, or fourth class in the construction and maintenance of roads, streets, or bridges therein, and the appropriations may be directly expended by the county board, upon the roads, streets, or bridges as shall be designated by the governing bodies of the towns, statutory cities, or cities of the second, third, and fourth classes. In counties having a population of 400,000 or over, the county aid may be expended in accordance with the provisions of Laws 1905, Chapter 164, as amended. No statutory city, or city of the second, third, or fourth class shall receive, except as otherwise authorized by law, an appropriation hereunder exceeding 20 percent of the annual county tax levy for road and bridge purposes paid by the statutory city, or city of second, third, or fourth class.\nWhen the council of any statutory city or city of the third or fourth class may determine that it is necessary to build or improve any bridge or bridges, including approaches thereto, and any dam or retaining works connected therewith, upon or forming a part of streets or highways either wholly or partly within its limits, the county board shall appropriate one-half of the money as may be necessary therefor from the county road and bridge fund, not exceeding during any year one-half the amount of taxes paid into the county road and bridge fund during the preceding year, on property within the corporate limits of the city. The appropriation shall be made upon the petition of the council, which petition shall be filed by the council with the county board prior to the fixing by the board of the annual county tax levy. The county board shall determine the plans and specifications, shall let all necessary contracts, shall have charge of construction, and upon its request, warrants in payment thereof shall be issued by the county auditor, from time to time, as the construction work proceeds. Any unpaid balance may be paid or advanced by the city. On petition of the council, the appropriations of the county board, during not to exceed three successive years, may be made to apply on the construction of the same items and to repay any money advanced by the city in the construction thereof. None of the provisions of this section shall be construed to be mandatory as applied to any city whose estimated market value exceeds $2,100 per capita of its population.",
	"repealed": false
}