{
	"id": "326B.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.46",
	"title": "326B.46 LICENSING, BOND AND INSURANCE.",
	"text": "(a) No individual shall engage in or work at the business of a master plumber, restricted master plumber, journeyworker plumber, and restricted journeyworker plumber unless licensed to do so by the commissioner. A license is not required for individuals performing building sewer or water service installation who have completed pipe laying training as prescribed by the commissioner. A license is not required for individuals servicing or installing a commercial chemical dispensing system or servicing or replacing a commercial dishwashing machine, including connecting a commercial chemical dispensing system or commercial dishwashing machine to a water line or drain line, provided that:\n(1) the individual servicing or installing the commercial chemical dispensing system or servicing or replacing the commercial dishwashing machine is an employee of the manufacturer or distributor of the commercial chemical dispensing system or commercial dishwashing machine;\n(2) the individual servicing or installing the commercial chemical dispensing system or servicing or replacing the commercial dishwashing machine has a minimum of 25 hours of classroom or laboratory training, a minimum of 20 hours of in-field training with a qualified technician on the types of systems being installed, followed by a minimum of 100 hours of supervised field experience. The training and experience curriculum required under this clause must be approved by the commissioner, in consultation with the manufacturer or distributor, but the commissioner shall not require training or experience hours in excess of the amounts specified in this clause;\n(3) the manufacturer or distributor of the commercial chemical dispensing system or commercial dishwashing machine must meet the insurance requirements of section 326B.46, subdivision 2, paragraph (c);\n(4) the connection is a push fit fitting, compression fitting, or threaded pipe fitting to an existing water line or drain, which has been initially installed by a licensed plumber; and\n(5) the commercial chemical dispensing system complies with ASSE 1055 or contains code-approved integral backflow protection.\nA master plumber may also work as a journeyworker plumber, a restricted journeyworker plumber, and a restricted master plumber. A journeyworker plumber may also work as a restricted journeyworker plumber. Anyone not so licensed may do plumbing work which complies with the provisions of the minimum standards prescribed by the Plumbing Board on premises or that part of premises owned and actually occupied by the worker as a residence, unless otherwise forbidden to do so by a local ordinance.\n(b) No person shall engage in the business of planning, superintending, or installing plumbing or shall install plumbing in connection with the dealing in and selling of plumbing material and supplies unless at all times a licensed master plumber, or in cities and towns with a population of fewer than 5,000 according to the last federal census, a restricted master plumber, who shall be responsible for proper installation, is in charge of the plumbing work of the person.\n(c) Except as provided in subdivision 1a, no person shall perform or offer to perform plumbing work with or without compensation unless the person obtains a contractor's license. A contractor's license does not of itself qualify its holder to perform the plumbing work authorized by holding a master, journeyworker, restricted master, or restricted journeyworker license.\n(a) An individual without a contractor license may do plumbing work on the individual's residence in accordance with subdivision 1, paragraph (a).\n(b) An individual who is an employee working on the maintenance and repair of plumbing equipment, apparatus, or facilities owned or leased by the individual's employer and which is within the limits of property owned or leased, and operated or maintained by the individual's employer, shall not be required to maintain a contractor license as long as the employer has on file with the commissioner a current certificate of responsible individual. The responsible individual must be a master plumber or, in an area of the state that is not a city or town with a population of more than 5,000 according to the last federal census, a restricted master plumber. The certificate must be signed by the responsible individual and must state that the person signing the certificate is responsible for ensuring that the maintenance and repair work performed by the employer's employees complies with sections 326B.41 to 326B.49, all rules adopted under those sections and sections 326B.50 to 326B.59, and all orders issued under section 326B.082. The employer must pay a filing fee to file a certificate of responsible individual with the commissioner. The certificate shall expire two years from the date of filing. In order to maintain a current certificate of responsible individual, the employer must resubmit a certificate of responsible individual, with a filing fee, no later than two years from the date of the previous submittal. The filing of the certificate of responsible individual does not exempt any employee of the employer from the requirements of this chapter regarding individual licensing as a plumber or registration as an unlicensed individual.\n(c) If a contractor employs a licensed plumber, the licensed plumber does not need a separate contractor license to perform plumbing work on behalf of the employer within the scope of the licensed plumber's license.\n(d) A person may perform and offer to perform building sewer or water service installation without a contractor's license if the person is in compliance with the bond and insurance requirements of subdivision 2.\n(e) Waterproofing contractors licensed under sections 326B.801 to 326B.89 may install in existing single-family dwellings a single sump pump, which receives subsurface or seepage water through a subsoil drain and discharges to grade. The Minnesota Plumbing Code applies to this paragraph, including provisions relating to proper installation, use of approved materials, and proper support of the materials.\n(a) Each contractor must designate a responsible licensed plumber, who shall be responsible for the performance of all plumbing work in accordance with sections 326B.41 to 326B.49, all rules adopted under these sections and sections 326B.50 to 326B.59, and all orders issued under section 326B.082. A plumbing contractor's responsible individual must be a master plumber. A restricted plumbing contractor's responsible individual must be a master plumber or a restricted master plumber. A plumbing contractor license authorizes the contractor to offer to perform and, through licensed and registered individuals, to perform plumbing work in all areas of the state. A restricted plumbing contractor license authorizes the contractor to offer to perform and, through licensed and registered individuals, to perform plumbing work in all areas of the state except in cities and towns with a population of more than 5,000 according to the last federal census.\n(b) If the contractor is an individual or sole proprietorship, the responsible licensed individual must be the individual, proprietor, or managing employee. If the contractor is a partnership, the responsible licensed individual must be a general partner or managing employee. If the contractor is a limited liability company, the responsible licensed individual must be a chief manager or managing employee. If the contractor is a corporation, the responsible licensed individual must be an officer or managing employee. If the responsible licensed individual is a managing employee, the responsible licensed individual must be actively engaged in performing plumbing work on behalf of the contractor, and cannot be employed in any capacity as a plumber for any other contractor. An individual may be the responsible licensed individual for only one contractor.\n(c) All applications and renewals for contractor licenses shall include a verified statement that the applicant or licensee has complied with this subdivision.\n(d) Upon the departure or disqualification of a licensee's responsible licensed individual because of death, disability, retirement, position change, or other reason, the licensee must notify the commissioner within 15 business days. The licensee shall have 60 days from the departure of the responsible licensed individual to obtain a new responsible licensed individual. Failure to secure a new responsible licensed individual within 60 days will, with or without notice, result in the voluntary termination of the license.\n(a) The bond and insurance requirements of paragraphs (b) and (c) apply to each person who performs or offers to perform plumbing work within the state, including any person who offers to perform or performs sewer or water service installation without a contractor's license. If the person performs or offers to perform any plumbing work other than sewer or water service installation, then the person must meet the requirements of paragraphs (b) and (c) as a condition of holding a contractor's license.\n(b) Each person who performs or offers to perform plumbing work within the state shall give and maintain bond to the state in the penal sum of at least $25,000 for (1) all plumbing work entered into within the state or (2) all plumbing work and subsurface sewage treatment work entered into within the state. The bond must comply with section 326B.0921. If the bond is for both plumbing work and subsurface sewage treatment work, the bond must comply with the requirements of this section and section 115.56, subdivision 2, paragraph (e).\n(c) Each person who performs or offers to perform plumbing work within the state shall have and maintain in effect public liability insurance, including products liability insurance with limits of at least $50,000 per person and $100,000 per occurrence and property damage insurance with limits of at least $10,000. The insurance shall be written by an insurer licensed to do business in the state of Minnesota. Each person who performs or offers to perform plumbing work within the state shall maintain on file with the commissioner a certificate evidencing the insurance. In the event of a policy cancellation, the insurer shall send written notice to the commissioner at the same time that a cancellation request is received from or a notice is sent to the insured.\n[Repealed, 2010 c 347 art 3 s 29,76; 2010 c 385 s 6]\n[Repealed, 2010 c 347 art 3 s 29,76; 2010 c 385 s 6]\nPersons licensed as manufactured home installers under chapter 327B are not required to be licensed under sections 326B.42 to 326B.49 when connecting the exterior building drain sewer outlets to the aboveground building sewer system and when connecting the exterior water line to the aboveground water system to the manufactured home as described in National Manufactured Housing Construction and Safety Standards Act of 1974, United States Code, title 42, section 5401 et seq. No additional licensure, bond, or insurance related to the scope of work permitted under this subdivision may be required of a licensed manufactured home installer by any unit of government.\nNo license, registration, or bond under sections 326B.42 to 326B.49 is required of a well contractor or a limited well/boring contractor who is licensed and bonded under section 103I.525 or 103I.531 and is engaged in the work or business of designing and installing:\n(1) water service pipe from a well to a pressure tank;\n(2) a frost-free water hydrant with an antisiphon device on a well water service pipe located entirely outside of a building requiring potable water;\n(3) a control valve, located outside the building, on a well water service pipe; or\n(4) a main control valve located within two feet of the pressure tank on the distribution supply line.\nAny vehicle used by a plumbing contractor or restricted plumbing contractor while performing plumbing work for which a contractor's license is required shall have the contractor's name and license number as it appears on the contractor's license in contrasting color with characters at least three inches high and one-half inch in width affixed to each side of the vehicle.",
	"repealed": false
}