{
	"id": "216B.026",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.026",
	"title": "216B.026 COOPERATIVE ELECTRIC ASSOCIATION; ELECTION ON REGULATION.",
	"text": "A cooperative electric association may elect to become subject to rate regulation by the commission pursuant to sections 216B.03 to 216B.23. The election shall be approved by a majority of members or stockholders voting by mail ballot initiated by petition of not less than five percent of the members or stockholders of the association, as determined by membership figures submitted by the association to the Rural Electric Administration for the month in which the petition was submitted.\nThe petition form shall be prescribed by the department and sample forms shall be available from the department and electric cooperative associations. Petitions shall include a uniform statement that petition signers are requesting a balloting of the association membership on the question of regulation of electric rates of the association by the commission. The department shall, upon receipt, transmit the prescribed form of petition to the appropriate association for validation of petition signatures in accordance with agreed procedures between the association and the department. When the association rejects any signature on a petition as invalid, it shall provide the department with a written statement as to the reason the cooperative deems the signature invalid. The department may challenge the association's decisions on the validity of signatures and may appeal to the commission for a resolution of the issue through informal proceedings before the commission after notice to all parties.\nWhenever a vote or petition of members or stockholders of an association is submitted pursuant to this section, the spouse of the member or stockholder may sign the petition and vote on behalf of the member or stockholder unless the member or stockholder has notified the association in writing otherwise. Such a notification by a member or stockholder shall be provided to the association and to the department for those petition matters pursuant to this section.\nIf the department determines that the petition meets the percent requirement of subdivision 1, a balloting of members on the question of regulation of electric rates by the commission shall be supervised by the department. The ballot to be used for the election shall be approved by the board of directors of the association and the department. In the event of a dispute on balloting procedures, the dispute shall be resolved through informal proceedings before the commission after notice to all parties. The association shall mail ballots to the association's members who shall return the ballots to the department. The department shall keep the ballots sealed until a date agreed upon by the department and the board of directors. On this date, representatives of the department and the association shall count the ballots. If a majority of the association's members or spouses who vote, elect to become subject to rate regulation by the commission, the election shall be effective 30 days after certified copies of the resolutions approving the election are filed with the commission. These provisions also apply to associations that wish to be deregulated. Any cooperative that is regulated by the commission, pursuant to sections 216B.03 to 216B.23 may follow the procedures set forth above. Any association subject to regulation of rates by the commission shall be exempt from the provisions of sections 216B.48, 216B.49, 216B.50, and 216B.51.\nSection 216B.027, granting rights to stockholders, applies to the exercise of stockholders' rights regardless of whether a referendum has been held as required by section 216B.027, subdivision 7. Notwithstanding section 216B.027, subdivision 6, a cooperative shall pay the costs of including stockholders' positions on issues as provided under section 216B.027, subdivision 6. This subdivision applies only to elections that require no less than one percent of members to initiate pursuant to subdivision 1.",
	"repealed": false
}