{
	"id": "60K.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.381",
	"title": "60K.381 SALE OF PORTABLE ELECTRONICS INSURANCE.",
	"text": "For purposes of this section, the following terms have the following meanings:\n(a) \"Customer\" means a person who purchases portable electronics or services.\n(b) \"Covered customer\" means a customer who elects coverage under a portable electronics insurance policy issued to a vendor of portable electronics.\n(c) \"Portable electronics\" means electronic devices that are portable in nature, their accessories, and services related to the use of the device.\n(d)(1) \"Portable electronics insurance\" means insurance providing coverage for the repair or replacement of portable electronics, which may cover portable electronics against any one or more of the following causes of loss: loss, theft, mechanical failure, malfunction, damage, or other applicable perils.\n(2) \"Portable electronics insurance\" does not include:\n(i) a service contract governed by chapter 59B;\n(ii) a policy of insurance covering a seller's or a manufacturer's obligations under a warranty; or\n(iii) a homeowner's, renter's, private passenger automobile, commercial multiperil, or similar policy that covers loss or theft of portable electronics.\n(e) \"Portable electronics transaction\" means:\n(1) the sale or lease of portable electronics by a vendor to a customer; or\n(2) the sale of a service related to the use of portable electronics by a vendor to a customer.\n(f) \"Supervising entity\" means a business entity that is a licensed insurer or insurance producer that is appointed by an insurer to supervise the administration of a portable electronics insurance program.\n(g) \"Vendor\" means a business entity in the business of engaging in portable electronics transactions, directly or indirectly.\n(a) A vendor is required to hold a limited lines license issued under this section to sell or offer coverage under a policy of portable electronics insurance in connection with, and incidental to, a portable electronics transaction with a customer.\n(b) A limited lines license issued under this section shall authorize any employee or authorized representative of the vendor to sell or offer coverage under a policy of portable electronics insurance to a customer in connection with, and incidental to, a portable electronics transaction at each location at which the vendor engages in portable electronics transactions. The application for such a limited lines license shall:\n(1) provide the name, residence address, and other information required by the commissioner for an employee or officer of the vendor that is designated by the applicant as the person responsible for the vendor's compliance with the requirements of this chapter. However, if the vendor derives more than 50 percent of its revenue from the sale of portable electronics insurance, the information noted above must be provided for all officers, directors, and shareholders of record having beneficial ownership of ten percent or more of any class of securities of the vendor registered under the federal securities law; and\n(2) contain a statement by the applicant indicating whether it intends to offer portable electronics from more than ten locations in this state. For purposes of this section, a vendor offering coverage to customers through a website is deemed to be offering portable electronics insurance coverage from more than ten locations.\n(c) A vendor, or the supervising entity that is appointed to oversee the vendor's portable electronics insurance program, shall maintain a registry of locations which are authorized to sell or solicit portable electronics insurance coverage in this state. Upon request by the commissioner and within ten days' notice to the vendor or supervising entity, the registry must be made available for inspection by the commissioner.\n(d) Notwithstanding any other provision of law, a license issued pursuant to this section shall authorize the licensee and its employees or authorized representatives to engage only in those activities that are expressly permitted in this section.\n(a) At every location where portable electronics insurance is offered to customers, brochures or other written materials must be made available to a prospective customer which:\n(1) disclose that portable electronics insurance may provide a duplication of coverage already provided by a customer's homeowner's insurance policy, renter's insurance policy, or other source of coverage;\n(2) state that the enrollment by the customer in a portable electronics insurance program is not required in order to purchase or lease portable electronics or services;\n(3) summarize the material terms of the insurance coverage, including:\n(i) the identity of the insurer;\n(ii) the identity of the supervising entity;\n(iii) the amount of any applicable deductible and how it is to be paid;\n(iv) benefits of the coverage;\n(v) the terms for terminating or modifying coverage as set forth in the policy of portable electronics insurance; and\n(vi) any material exclusions, conditions, or other limitations of coverage including whether portable electronics may be repaired or replaced with similar make and model reconditioned or nonoriginal manufacturer parts or equipment;\n(4) describe the process for filing a claim, including a description of any requirements:\n(i) to return portable electronics and the maximum fee applicable in the event the customer fails to comply with any equipment return requirements; and\n(ii) any proof of loss requirements; and\n(5) state that the customer may cancel enrollment for coverage under a portable electronics insurance policy at any time and any unearned premium will be refunded or credited on a pro rata basis to the customer paying the premium.\n(b) Portable electronics insurance may be offered on a month-to-month or other periodic basis as a group or master commercial inland marine policy issued to a vendor of portable electronics under which individual customers may elect to enroll for coverage.\n(c) Notwithstanding any other provision of Minnesota law regarding the termination or modification of coverage under a policy of insurance, the terms for the termination or modification of coverage under a policy of portable electronics insurance issued in compliance with this chapter shall be as set forth in the policy.\n(d) Eligibility and underwriting standards for customers electing to enroll in coverage shall be established for each portable electronics insurance program.\n(a) The employees and authorized representatives of vendors may sell or offer portable electronics insurance to customers and shall not be subject to licensure as an insurance producer under this chapter provided that:\n(1) the vendor obtains a limited lines license to authorize its employees or authorized representatives to sell or offer portable electronics insurance pursuant to this section;\n(2) the insurer issuing the portable electronics insurance either directly supervises or appoints a supervising entity to supervise the administration of the program including development of a training program for employees and authorized representatives of the vendors. The training required by this subdivision shall comply with the following:\n(i) the training shall be delivered to all employees and authorized representatives of the vendors who sell or offer portable electronics insurance;\n(ii) the training may be provided in electronic form. However, if conducted in an electronic form, the supervising entity shall implement a supplemental education program regarding the portable electronics insurance product that is conducted by licensed employees of the supervising entity; and\n(iii) each employee and authorized representative shall receive basic instruction about the portable electronics insurance offered to customers and the disclosures required under subdivision 3; and\n(3) no employee or authorized representative of a vendor of portable electronics shall advertise, represent, or otherwise hold himself or herself out as a nonlimited lines licensed insurance producer.\n(b) The charges for portable electronics insurance coverage may be billed and collected by the vendor of portable electronics. Any charge to the covered customer for coverage that is not included in the cost associated with the purchase or lease of portable electronics or services shall be separately itemized from the charges for the purchase or lease of portable electronics or services. Vendors billing and collecting such charges shall not be required to maintain such funds in a segregated account provided that the vendor is authorized by the insurer to hold such funds in an alternative manner and remits such amounts to the supervising entity within 60 days of receipt. All funds received by a vendor from a customer for the sale of portable electronics insurance shall be considered funds held by the vendor in a fiduciary capacity for the benefit of the insurer. Vendors may receive compensation for billing and collection services.\n(c)(1) Whenever notice or correspondence with respect to a policy of portable electronics insurance is required pursuant to the policy or is otherwise required by law, the notice or correspondence may be sent either by mail or by electronic means in accordance with chapter 325L. If the notice or correspondence is mailed, it must be sent to the vendor at the vendor's mailing address specified for this purpose and to affected covered customers at their last known mailing addresses on file with the insurer. If the notice or correspondence is sent by electronic means, it must be sent to the vendor at the vendor's electronic mail address specified for such purpose and to affected covered customers at their last known electronic mail addresses as provided to the insurer or vendor, as the case may be.\n(2) Notice or correspondence required by a policy of portable electronics insurance or otherwise required by law may be sent on behalf of an insurer or vendor, as the case may be, by the supervising entity appointed by the insurer.",
	"repealed": false
}