{
	"id": "116J.4011",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.4011",
	"title": "116J.4011 LABOR MARKET INFORMATION DATA PRODUCTION REQUIREMENT.",
	"text": "(a) As part of the commissioner's obligation under section 116J.401, the commissioner must, in collaboration with the Office of Higher Education and local workforce councils, produce and publish labor market analysis describing the alignment between employer requirements and workforce qualifications.\n(b) The analysis must include a description of job trends that supports career choice and job seeking including:\n(1) measures of current job growth, projected future job growth, and current job vacancies;\n(2) a breakdown of these measures, whenever feasible, by industry, occupation, statewide and substate region, by educational requirement, state employee retirement trends, and by racial trends;\n(3) a description of industry- or occupation-based credentials and minimum educational standards necessary for successful employment in each area; and\n(4) a designation of areas of opportunity based on high growth, high vacancy, and high pay conditions.\n(c) The analysis must include a description of workforce supply and quality, including:\n(1) a description of the current educational attainment of the workforce and its distribution across industries, occupations, and regions;\n(2) the number and distribution of recent graduates of and current enrollees in postsecondary institutions by academic concentration or major and by credential type; and\n(3) the completion rate, employment outcome, and average debt for recent postsecondary graduates by program of study, institution type, and credential.\n(d) The analysis must be reviewed on a regular basis by representatives from the business and postsecondary sectors, and any feedback should be incorporated into data collection and presentation where feasible. This feedback may also include surveys of employers on their skill, credential, and other workforce requirements when necessary.\n(e) Analysis, data, and reports required by this section must be easily accessible, easily readable, and prominently presented on the Department of Employment and Economic Development website and websites of workforce centers. Information on job vacancies and areas of potential employment opportunities should link to educational or credential requirements, appropriate training or educational offerings, prevailing wages, and other indicators of market conditions deemed important to career choosers and job seekers.",
	"repealed": false
}