{
	"id": "35.244",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.244",
	"title": "35.244 CONTROL OF BOVINE TUBERCULOSIS.",
	"text": "The board may establish zones for the control and eradication of tuberculosis and restrict the movement of cattle, bison, goats, and farmed Cervidae within and between tuberculosis zones in the state.\nIn a tuberculosis control zone, the board may:\n(1) require owners of cattle, bison, goats, or farmed Cervidae to report personal contact information and location of livestock to the board;\n(2) require a permit or movement certificates for all cattle, bison, goats, and farmed Cervidae moving between premises within the zone or leaving or entering the zone;\n(3) require official identification of all cattle, bison, goats, and farmed Cervidae within the zone or leaving or entering the zone;\n(4) require a whole-herd tuberculosis test on each herd of cattle, bison, goats, or farmed Cervidae when any of the animals in the herd is kept on a premises within the zone;\n(5) require a negative tuberculosis test within 60 days prior to movement for any individual cattle, bison, goat, or farmed Cervidae moved from a premises in the zone to another location in Minnesota, with the exception of cattle moving under permit directly to a slaughter facility under state or federal inspection;\n(6) require a whole-herd tuberculosis test within 12 months prior to moving cattle, bison, goats, or farmed Cervidae from premises in the zone to another location in Minnesota;\n(7) require annual herd inventories on all cattle, bison, goat, or farmed Cervidae herds; and\n(8) require that a risk assessment be performed to evaluate the interaction of free-ranging deer and elk with cattle, bison, goat, and farmed Cervidae herds and require the owner to implement the recommendations of the risk assessment.\nThe board may adopt rules to provide for the control of tuberculosis in cattle. The rules may include provisions for quarantine, tests, and such other measures as the board deems appropriate. Federal regulations, as provided by Code of Federal Regulations, title 9, part 77, and the Bovine Tuberculosis Eradication Uniform Methods and Rules, are incorporated as part of the rules in this state.",
	"repealed": false
}