{
	"id": "115.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.071",
	"title": "115.071 ENFORCEMENT.",
	"text": "The provisions of sections 103F.701 to 103F.755, this chapter and chapters 114C, 115A, and 116, and sections 325E.10 to 325E.1251 and 325E.32 and all rules, standards, orders, stipulation agreements, schedules of compliance, and permits adopted or issued by the agency thereunder or under any other law now in force or hereafter enacted for the prevention, control, or abatement of pollution may be enforced by any one or any combination of the following: criminal prosecution; action to recover civil penalties; injunction; action to compel or cease performance; or other appropriate action, in accordance with the provisions of said chapters and this section.\n(a) Violations of laws; orders; permits. Except as provided in section 609.671, any person who willfully or negligently violates any provision of this chapter or chapter 114C or 116, or any standard, rule, variance, order, stipulation agreement, schedule of compliance or permit issued or adopted by the agency thereunder shall upon conviction be guilty of a misdemeanor.\n(b) Duty of law enforcement officials. It shall be the duty of all county attorneys, sheriffs and other peace officers, and other officers having authority in the enforcement of the general criminal laws to take all action to the extent of their authority, respectively, that may be necessary or proper for the enforcement of said provisions, rules, standards, orders, stipulation agreements, variances, schedule of compliance, or permits.\n[Repealed, 1987 c 267 s 5]\n[Repealed, 1987 c 267 s 5]\n(a) Any person who violates any provision of this chapter or chapter 114C or 116, except any provisions of chapter 116 relating to air and land pollution caused by agricultural operations that do not involve national pollutant discharge elimination system permits, or of (1) any effluent standards and limitations or water quality standards, (2) any permit or term or condition thereof, (3) any national pollutant discharge elimination system filing requirements, (4) any duty to permit or carry out inspection, entry or monitoring activities, or (5) any rules, stipulation agreements, variances, schedules of compliance, or orders issued by the agency, forfeits and must pay to the state a penalty, in an amount to be determined by the court, of not more than $15,000 per day of violation, except that if the violation relates to hazardous waste, the person forfeits and must pay to the state a penalty, in an amount to be determined by the court, of not more than $30,000 per day of violation.\n(b) In addition, in the discretion of the court, the defendant may be required to:\n(1) forfeit and pay to the state a sum which will adequately compensate the state for the reasonable value of cleanup and other expenses directly resulting from unauthorized discharge of pollutants, whether or not accidental; and\n(2) forfeit and pay to the state an additional sum to constitute just compensation for any loss or destruction to wildlife, fish or other aquatic life and for other actual damages to the state caused by an unauthorized discharge of pollutants.\n(c) As a defense to any of said damages, the defendant may prove that the violation was caused solely by (1) an act of God, (2) an act of war, (3) negligence on the part of the state of Minnesota, or (4) an act or failure to act which constitutes sabotage or vandalism, or any combination of the foregoing clauses.\n(d) The civil penalties and damages provided for in this subdivision may be recovered by a civil action brought by the attorney general in the name of the state.\nAny violation of the provisions, rules, standards, orders, stipulation agreements, variances, schedules of compliance, or permits specified in this chapter and chapters 114C and 116 constitutes a public nuisance and may be enjoined as provided by law in an action, in the name of the state, brought by the attorney general. Injunctive relief under this subdivision may include but is not limited to a requirement that a facility or person immediately cease operation or activities until such time as the commissioner has reasonable assurance that renewed operation or activities will not violate provisions, rules, standards, orders, stipulation agreements, variances, schedules of compliance, or permits specified in this chapter and chapters 114C and 116.\nIn any action to compel performance of an order of the agency for any purposes relating to the prevention, control or abatement of pollution under this chapter and chapters 114C and 116, the court may require any defendant adjudged responsible to do and perform any and all acts and things within the defendant's power which are reasonably necessary to accomplish the purposes of the order. In case a municipality or its governing or managing body or any of its officers is a defendant, the court may require it to exercise its powers, without regard to any limitation of any requirement for an election or referendum imposed thereon by law and without restricting the powers of the agency to do any or all of the following, without limiting the generality hereof: to levy taxes, levy special assessments, prescribe service or use charges, borrow money, issue bonds, employ assistance, acquire real or personal property, let contracts or otherwise provide for the doing of work or the construction, installation, maintenance, or operation of facilities, and do all other acts and things reasonably necessary to accomplish the purposes of the order, but the court shall grant the municipality the opportunity to determine the appropriate financial alternatives to be utilized in complying with the court imposed requirements.\nA provision of law that may be enforced under this section may also be enforced under section 116.072.\n(a) The commissioner may issue a red tag for failure to have the regulated underground tank system or aboveground tank facility at a bulk plant, as defined in section 115C.09, subdivision 3h, paragraph (a), protected from corrosion, failure to have spill and overfill protection, or failure to have a leak detection method in place. A red tag may also be issued for underground storage tank system or aboveground tank facility at a bulk plant violations if an enforcement action, including, but not limited to, a citation as defined in section 116.073, subdivision 1, has been issued and the violations are not corrected. Upon discovery of a violation at a facility with an underground storage tank system or aboveground tank facility at a bulk plant, the commissioner shall affix a red tag, in plain view, to the fill pipe cap of the tank system that provides notice that delivery of petroleum products to the tank system is prohibited. When the red tag is issued, agency staff must determine the product level in the tank.\n(b) No owner or operator of a facility having an underground storage tank system or aboveground tank facility at a bulk plant shall fill or allow the filling of a tank with a petroleum product while a red tag is affixed to the fill pipe cap of the tank system.\n(c) A person shall not remove, deface, alter, or otherwise tamper with a red tag so that the information contained on the tag is not legible.\n(d) A red tag may not be removed until the commissioner has inspected the underground storage tank system or aboveground tank facility at a bulk plant and established that it is no longer in violation. After making that determination, the commissioner shall remove the red tag within 24 hours or as soon as reasonably possible. Upon agreement by the commissioner, the red tag may also be removed by an agency-certified installer who provides documentation to the commissioner that the violation for which the system was red-tagged has been corrected.\n(e) The issuance of a red tag may be appealed under section 116.072, subdivision 6, paragraphs (a) to (e), except that the person subject to the order must request a hearing within 15 days after issuance of a red tag and, if a hearing is not requested within the 15-day period, the red tag becomes a final order not subject to further review.\nIf a party to a stipulation agreement asserts a good cause or force majeure claim for an extension of time to comply with a stipulated term, the commissioner may deny the extension if the assertion is based solely on increased costs of compliance.",
	"repealed": false
}