{
	"id": "72A.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.125",
	"title": "72A.125 RENTAL VEHICLE PERSONAL ACCIDENT INSURANCE; SPECIAL REQUIREMENTS.",
	"text": "(a) \"Auto rental company\" means a corporation, partnership, individual, or other person that is engaged primarily in the renting of motor vehicles at per diem rates.\n(b) \"Rental vehicle personal accident insurance\" means accident only insurance providing accidental death benefits, dismemberment benefits and/or reimbursement for medical expenses which is issued by an insurer authorized in this state to issue accident and health insurance. These coverages are nonqualified plans under chapter 62E.\n(c) \"Liability insurance\" means insurance that provides coverage, as applicable, to renters and other authorized drivers of rental vehicles for liability arising from the operation of the rental vehicle. At the option of the auto rental company, this coverage may include uninsured or underinsured motorist coverage whether offered separately or in combination with other liability insurance.\n(d) \"Personal effects insurance\" means coverage, as applicable, to renters and other rental vehicle occupants for the loss of, or damage to, personal effects which occurs during the rental period.\nAn auto rental company that offers or sells rental vehicle personal accident insurance, personal effects insurance, or liability insurance in this state in conjunction with the rental of a vehicle shall only sell these products if the forms and rates have met the relevant requirements of section 61A.02, 62A.02, or other relevant sections requiring approval of forms and rates taking into account the possible infrequency and severity of loss that may be incurred. An auto rental company offering insurance products for sale shall conduct a training program for its agents or employees, which must be submitted to the commissioner for approval. Sections 60K.30 to 60K.56 do not apply if the persons engaged in the sale of these products are employees of the auto rental company who do not receive commissions or other remuneration for selling the product in addition to their regular compensation. Compensation may not be determined in any part by the sale of insurance products. The auto rental company before engaging in the sale of the product must file with the commissioner the following documents:\n(1) an appointment of the commissioner as agent for service of process;\n(2) an agreement that the auto rental company assumes all responsibility for the authorized actions of all unlicensed employees who sell the insurance product on its behalf in conjunction with the rental of its vehicles;\n(3) an agreement that the auto rental company with respect to itself and its employees will be subject to this chapter regarding the marketing of the insurance products and the conduct of those persons involved in the sale of insurance products in the same manner as if it were a licensed agent.\nAn auto rental company failing to file the documents in clauses (1) to (3) is guilty of an individual violation as to the unlicensed sale of insurance for each sale that occurs after August 1, 1987, until they make the required filings. Each individual sale after August 1, 1987, and prior to the filing required by this section is subject to, in addition to any other penalties allowable by law, up to a $200 per violation fine. Further, the sale of the insurance product by an auto rental company or any employee or agent of the company after August 1, 1987, without having complied with this section shall be deemed to be in acceptance of the provisions of this section.\nInsurance sold pursuant to this subdivision must be limited in availability to rental vehicle customers though coverage may extend to the customer, other drivers, and passengers using or riding in the rented vehicles; and limited in duration to a period equal to and concurrent with that of the vehicle rental.\nPersons purchasing rental vehicle personal accident insurance, personal effects insurance, or liability insurance may be provided a certificate summarizing the policy provisions in lieu of a copy of the policy if a copy of the policy is available for inspection at the place of sale and a free copy of the policy may be obtained from the auto rental company's home office.\nThe commissioner may, after a hearing, revoke an auto rental company's right to operate under this section if the company has violated the insurance laws of this state and the revocation is in the public interest.\nA \"collision damage waiver\" is a discharge of the responsibility of the renter or lessee to return the motor vehicle in the same condition as when it was first rented. The waiver is a full and complete discharge of the responsibility to return the vehicle in the same condition as when it was first rented. The waiver may not contain any exclusions except those approved by the commissioner.",
	"repealed": false
}