{
	"id": "475.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.52",
	"title": "475.52 BOND ISSUES; PURPOSES.",
	"text": "Any statutory city may issue bonds or other obligations for the acquisition or betterment of public buildings, means of garbage disposal, hospitals, nursing homes, homes for the aged, schools, libraries, museums, art galleries, parks, playgrounds, stadia, sewers, sewage disposal plants, subways, streets, sidewalks, warning systems; for any utility or other public convenience from which a revenue is or may be derived; for a permanent improvement revolving fund; for changing, controlling or bridging streams and other waterways; for the acquisition and betterment of bridges and roads within two miles of the corporate limits; for the acquisition of development rights in the form of conservation easements under chapter 84C; and for acquisition of equipment for snow removal, street construction and maintenance, or firefighting. Without limitation by the foregoing the city may issue bonds to provide money for any authorized corporate purpose except current expenses.\nAny city governed by a home rule charter may issue bonds for any purpose enumerated in subdivision 1 unless forbidden by its charter, except that any such city may issue bonds for the acquisition of ambulances and related equipment notwithstanding the provisions of its charter; and for other purposes as authorized by its charter.\nAny county may issue bonds for the acquisition or betterment of courthouses, county administrative buildings, health or social service facilities, correctional facilities, law enforcement centers, jails, morgues, libraries, parks, and hospitals, for roads and bridges within the county or bordering thereon and for road equipment and machinery and for ambulances and related equipment; for the acquisition of development rights in the form of conservation easements under chapter 84C, and for capital equipment for the administration and conduct of elections providing the equipment is uniform countywide, except that the power of counties to issue bonds in connection with a library shall not exist in Hennepin County.\nAny town may issue bonds for the acquisition and betterment of town halls, town roads and bridges, nursing homes and homes for the aged, and for acquisition of equipment for snow removal, road construction or maintenance, and firefighting; for the acquisition of development rights in the form of conservation easements under chapter 84C; and for the acquisition and betterment of any buildings to house and maintain town equipment.\nFor capital improvements any school district may issue bonds for the acquisition or betterment of school facilities, including gymnasiums, athletic fields, stadia, teacherages, school garages, school buses, and all other facilities for administration, academic instruction, and physical and vocational education.\nAny municipality may issue bonds for paying judgments against it; for refunding outstanding bonds; for funding floating indebtedness; for funding actuarial liabilities to pay postemployment benefits to employees or officers after their termination of service; or for funding all or part of the municipality's current and future unfunded liability for a pension or retirement fund or plan referred to in section 356.20, subdivision 2, as those liabilities are most recently computed under sections 356.215 and 356.216. The board of trustees or directors of the Bloomington Fire Department Relief Association must consent and must be a party to any contract made under this section with respect to the fund held by it for the benefit of and in trust for its members. For purposes of this section, the term \"postemployment benefits\" means benefits giving rise to a liability under Statement No. 45 of the Governmental Accounting Standards Board.",
	"repealed": false
}