{
	"id": "114D.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.20",
	"title": "114D.20 IMPLEMENTATION; COORDINATION; GOALS; POLICIES; PRIORITIES.",
	"text": "In implementing this chapter, public agencies and private entities shall take into consideration the relevant provisions of local and other applicable water management, conservation, land use, land management, and development plans and programs. Public agencies with authority for local water management, conservation, land use, land management, and development plans shall take into consideration the manner in which their plans affect the implementation of this chapter. Public agencies shall identify opportunities to participate and assist in the successful implementation of this chapter, including the funding or technical assistance needs, if any, that may be necessary. In implementing this chapter, public agencies shall endeavor to engage the cooperation of organizations and individuals whose activities affect the quality of groundwater or surface waters, including point and nonpoint sources of pollution, and who have authority and responsibility for water management, planning, and protection. To the extent practicable, public agencies shall endeavor to enter into formal and informal agreements and arrangements with federal agencies and departments to jointly utilize staff and educational, technical, and financial resources to deliver programs or conduct activities to achieve the intent of this chapter, including efforts under the federal Clean Water Act and other federal farm and soil and water conservation programs. Nothing in this chapter affects the application of silvicultural exemptions under any federal, state, or local law or requires silvicultural practices more stringent than those recommended in the timber harvesting and forest management guidelines adopted by the Minnesota Forest Resources Council under section 89A.05.\nThe following goals must guide the implementation of this chapter:\n(1) to identify impaired waters in accordance with federal TMDL requirements and to ensure continuing evaluation of surface waters for impairments;\n(2) to submit TMDLs to the United States Environmental Protection Agency in a timely manner in accordance with federal TMDL requirements;\n(3) to inform and support strategies for implementing restoration and protection activities with the goal that all waters will have achieved the designated uses applicable to those waters by 2050;\n(4) to systematically evaluate waters, to provide assistance and incentives to prevent waters from becoming impaired, and to improve the quality of waters that are listed as impaired;\n(5) to promptly seek the delisting of waters from the impaired waters list when those waters are shown to achieve the designated uses applicable to the waters;\n(6) to achieve compliance with federal Clean Water Act requirements in Minnesota;\n(7) to support effective measures to prevent the degradation of groundwater according to the groundwater degradation prevention goal under section 103H.001; and\n(8) to support effective measures to restore degraded groundwater.\nThe following policies must guide the implementation of this chapter:\n(1) develop regional, multiple pollutant, or watershed TMDLs or WRAPSs, where reasonable and feasible;\n(2) maximize use of available organizational, technical, and financial resources to perform sampling, monitoring, and other activities to identify degraded groundwater and impaired waters, including use of citizen monitoring and citizen monitoring data used by the Pollution Control Agency in assessing water quality that meets the requirements established by the commissioner of the Pollution Control Agency;\n(3) maximize opportunities for restoration of degraded groundwater and impaired waters, by prioritizing and targeting of available programmatic, financial, and technical resources and by providing additional state resources to complement and leverage available resources;\n(4) use existing regulatory authorities to achieve restoration for point and nonpoint sources of pollution where applicable, and promote the development and use of effective nonregulatory measures to address pollution sources for which regulations are not applicable;\n(5) use restoration methods that have a demonstrated effectiveness in reducing impairments and provide the greatest long-term positive impact on water quality protection and improvement and related conservation benefits while incorporating innovative approaches on a case-by-case basis;\n(6) identify for the legislature any innovative approaches that may strengthen or complement existing programs;\n(7) identify and encourage implementation of measures to prevent surface waters from becoming impaired and to improve the quality of waters that are listed as impaired but have no approved TMDL addressing the impairment using the best available data and technology, and establish and report outcome-based performance measures that monitor the progress and effectiveness of protection and restoration measures;\n(8) monitor and enforce cost-sharing contracts and impose monetary damages in an amount up to 150 percent of the financial assistance received for failure to comply; and\n(9) identify and encourage implementation of measures to prevent groundwater from becoming degraded and measures that restore groundwater resources.\nThe Pollution Control Agency, in accordance with federal TMDL requirements, shall set priorities for identifying impaired waters, giving consideration to:\n(1) waters where impairments would pose the greatest potential risk to human or aquatic health; and\n(2) waters where data developed through public agency or citizen monitoring or other means, provides scientific evidence that an impaired condition exists.\nThe commissioner of the Pollution Control Agency must seek recommendations from the Clean Water Council; the commissioners of natural resources, health, and agriculture; and the Board of Water and Soil Resources regarding priorities for scheduling and preparing WRAPSs and TMDLs. Recommendations must consider the causes of impairments, the designated uses of the waters, applicable federal TMDL requirements, surface water and groundwater interactions, protection of high-quality waters, waters and watersheds with declining water quality trends, and waters used as drinking water sources. Furthermore, consideration must be given to waters and watersheds:\n(1) that have the greatest potential risk to human health;\n(2) that have the greatest potential risk to threatened or endangered species;\n(3) that have the greatest potential risk to aquatic health;\n(4) where other public agencies and participating organizations and individuals, especially local, basin-wide, watershed, or regional agencies or organizations, have demonstrated readiness to assist in carrying out the responsibilities, including availability and organization of human, technical, and financial resources necessary to undertake the work; and\n(5) where there is demonstrated coordination and cooperation among cities, counties, watershed districts, and soil and water conservation districts in planning and implementation of activities that will assist in carrying out the responsibilities.\nIn implementing restoration of impaired waters, in addition to the priority considerations in subdivision 5, the Clean Water Council shall give priority in its recommendations for restoration funding from the clean water fund to restoration projects that:\n(1) coordinate with and utilize existing local authorities and infrastructure for implementation;\n(2) can be implemented in whole or in part by providing support for existing or ongoing restoration efforts;\n(3) most effectively leverage other sources of restoration funding, including federal, state, local, and private sources of funds;\n(4) show a high potential for early restoration and delisting based upon scientific data developed through public agency or citizen monitoring or other means; and\n(5) show a high potential for long-term water quality and related conservation benefits.\nThe Clean Water Council shall apply the priorities applicable under subdivision 6, as far as practicable, when recommending priorities for funding actions to prevent groundwater and surface waters from becoming degraded or impaired and to improve the quality of surface waters that are listed as impaired.\n(a) If the commissioner of the Pollution Control Agency determines that a comprehensive watershed management plan or comprehensive local water management plan contains information that is sufficient and consistent with guidance from the United States Environmental Protection Agency under section 303(d) of the federal Clean Water Act, the commissioner may submit the plan to the Environmental Protection Agency according to federal TMDL requirements as an alternative to developing a TMDL after consultation with affected national pollutant discharge elimination system (NPDES) permit holders.\n(b) A TMDL implementation plan or a WRAPS, or portions thereof, are not needed for waters or watersheds when the commissioner of the Pollution Control Agency determines that a comprehensive watershed management plan, a comprehensive local water management plan, or a statewide or regional strategy published by the Pollution Control Agency meets the definition in section 114D.15, subdivision 11 or 13.\n(c) The commissioner of the Pollution Control Agency may request that the Board of Water and Soil Resources conduct an evaluation of the implementation efforts under a comprehensive watershed management plan or comprehensive local water management plan when the commissioner makes a determination under paragraph (b). The board must conduct the evaluation in accordance with section 103B.102.\n(d) The commissioner of the Pollution Control Agency may amend or revoke a determination made under paragraph (a) or (b) after considering the evaluation conducted under paragraph (c).\nA project, practice, or program for water quality improvement or protection that is conducted by a watershed management organization or a local government unit with a comprehensive watershed management plan or other water management plan approved according to chapter 103B, 103C, or 103D may be considered by the commissioner of the Pollution Control Agency as contributing to the requirements of a stormwater pollution prevention program (SWPPP) for a municipal separate storm sewer systems (MS4) permit unless the project, practice, or program was previously documented as contributing to a different SWPPP for an MS4 permit. The commissioner of health may determine that a comprehensive watershed management plan or a comprehensive local water management plan, in whole or in part, is sufficient to fulfill the requirements of wellhead protection plans.",
	"repealed": false
}