{
	"id": "216C.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.41",
	"title": "216C.41 RENEWABLE ENERGY PRODUCTION INCENTIVE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Qualified hydroelectric facility\" means a hydroelectric generating facility in this state that:\n(1) is located at the site of a dam, if the dam was in existence as of March 31, 1994; and\n(2) begins generating electricity after July 1, 1994, or generates electricity after substantial refurbishing of a facility that begins after July 1, 2001.\n(c) \"Qualified wind energy conversion facility\" means a wind energy conversion system in this state that:\n(1) produces two megawatts or less of electricity as measured by nameplate rating and begins generating electricity after December 31, 1996, and before July 1, 1999;\n(2) begins generating electricity after June 30, 1999, produces two megawatts or less of electricity as measured by nameplate rating, and is:\n(i) owned by a resident of Minnesota or an entity that is organized under the laws of this state, is not prohibited from owning agricultural land under section 500.24, and owns the land where the facility is sited;\n(ii) owned by a Minnesota small business as defined in section 645.445;\n(iii) owned by a Minnesota nonprofit organization;\n(iv) owned by a tribal council if the facility is located within the boundaries of the reservation;\n(v) owned by a Minnesota municipal utility or a Minnesota cooperative electric association; or\n(vi) owned by a Minnesota political subdivision or local government, including, but not limited to, a county, statutory or home rule charter city, town, school district, or any other local or regional governmental organization such as a board, commission, or association; or\n(3) begins generating electricity after June 30, 1999, produces seven megawatts or less of electricity as measured by nameplate rating, and:\n(i) is owned by a cooperative organized under chapter 308A other than a Minnesota cooperative electric association; and\n(ii) all shares and membership in the cooperative are held by an entity that is not prohibited from owning agricultural land under section 500.24.\n(d) \"Qualified on-farm biogas recovery facility\" means an anaerobic digester system that:\n(1) is located at the site of an agricultural operation; and\n(2) is owned by an entity that is not prohibited from owning agricultural land under section 500.24 and that owns or rents the land where the facility is located.\n(e) \"Anaerobic digester system\" means a system of components that processes animal waste based on the absence of oxygen and produces gas used to generate electricity.\n(a) Incentive payments must be made according to this section to (1) a qualified on-farm biogas recovery facility, (2) the owner or operator of a qualified hydropower facility or qualified wind energy conversion facility for electric energy generated and sold by the facility, (3) a publicly owned hydropower facility for electric energy that is generated by the facility and used by the owner of the facility outside the facility, or (4) the owner of a publicly owned dam that is in need of substantial repair, for electric energy that is generated by a hydropower facility at the dam and the annual incentive payments will be used to fund the structural repairs and replacement of structural components of the dam, or to retire debt incurred to fund those repairs.\n(b) Payment may only be made upon receipt by the commissioner of commerce of an incentive payment application that establishes that the applicant is eligible to receive an incentive payment and that satisfies other requirements the commissioner deems necessary. The application must be in a form and submitted at a time the commissioner establishes.\n(c) There is annually appropriated from the renewable development account under section 116C.779 to the commissioner of commerce sums sufficient to make the payments required under this section, in addition to the amounts funded by the renewable development account as specified in subdivision 5a.\nPayments may be made under this section only for:\n(a) electricity generated from:\n(1) a qualified hydroelectric facility that is operational and generating electricity before December 31, 2011;\n(2) a qualified wind energy conversion facility that is operational and generating electricity before January 1, 2008; or\n(3) a qualified on-farm biogas recovery facility from July 1, 2001, through December 31, 2017; and\n(b) gas generated from a qualified on-farm biogas recovery facility from July 1, 2007, through December 31, 2017.\n(a) A facility may receive payments under this section for a ten-year period. No payment under this section may be made for electricity generated:\n(1) by a qualified hydroelectric facility after December 31, 2021;\n(2) by a qualified wind energy conversion facility after December 31, 2018; or\n(3) by a qualified on-farm biogas recovery facility after December 31, 2017.\n(b) The payment period begins and runs consecutively from the date the facility begins generating electricity or, in the case of refurbishment of a hydropower facility, after substantial repairs to the hydropower facility dam funded by the incentive payments are initiated.\n(a) An incentive payment is based on the number of kilowatt-hours of electricity generated. The amount of the payment is:\n(1) for a facility described under subdivision 2, paragraph (a), clause (4), 1.0 cent per kilowatt-hour; and\n(2) for all other facilities, 1.5 cents per kilowatt-hour.\nFor electricity generated by qualified wind energy conversion facilities, the incentive payment under this section is limited to no more than 200 megawatts of nameplate capacity.\n(b) For wind energy conversion systems installed and contracted for after January 1, 2002, the total size of a wind energy conversion system under this section must be determined according to this paragraph. Unless the systems are interconnected with different distribution systems, the nameplate capacity of one wind energy conversion system must be combined with the nameplate capacity of any other wind energy conversion system that is:\n(1) located within five miles of the wind energy conversion system;\n(2) constructed within the same calendar year as the wind energy conversion system; and\n(3) under common ownership.\nIn the case of a dispute, the commissioner of commerce shall determine the total size of the system, and shall draw all reasonable inferences in favor of combining the systems.\n(c) In making a determination under paragraph (b), the commissioner of commerce may determine that two wind energy conversion systems are under common ownership when the underlying ownership structure contains similar persons or entities, even if the ownership shares differ between the two systems. Wind energy conversion systems are not under common ownership solely because the same person or entity provided equity financing for the systems.\nThe Department of Commerce shall authorize payment of the renewable energy production incentive to wind energy conversion systems that are eligible under this section or Laws 2005, chapter 40, to on-farm biogas recovery facilities, and to hydroelectric facilities. Payment of the incentive shall be made from the renewable energy development account as provided under section 116C.779, subdivision 2.\n(a) For the purposes of subdivision 1, paragraph (c), clause (2), a wind energy conversion facility qualifies if it is owned at least 51 percent by one or more of any combination of the entities listed in that clause.\n(b) A subsequent owner of a qualified facility may continue to receive the incentive payment for the duration of the original payment period if the subsequent owner qualifies for the incentive under subdivision 1.\n(c) Nothing in this section may be construed to deny incentive payment to an otherwise qualified facility that has obtained debt or equity financing for construction or operation as long as the ownership requirements of subdivision 1 and this subdivision are met. If, during the incentive payment period for a qualified facility, the owner of the facility is in default of a lending agreement and the lender takes possession of and operates the facility and makes reasonable efforts to transfer ownership of the facility to an entity other than the lender, the lender may continue to receive the incentive payment for electricity generated and sold by the facility for a period not to exceed 18 months. A lender who takes possession of a facility shall notify the commissioner immediately on taking possession and, at least quarterly, document efforts to transfer ownership of the facility.\n(d) If, during the incentive payment period, a qualified facility loses the right to receive the incentive because of changes in ownership, the facility may regain the right to receive the incentive upon cure of the ownership structure that resulted in the loss of eligibility and may reapply for the incentive, but in no case may the payment period be extended beyond the original ten-year limit.\n(e) A subsequent or requalifying owner under paragraph (b) or (d) retains the facility's original priority order for incentive payments as long as the ownership structure requalifies within two years from the date the facility became unqualified or two years from the date a lender takes possession.\n(a) A qualifying project is eligible for the incentive on the date the commissioner receives:\n(1) an application for payment of the incentive;\n(2) one of the following:\n(i) a copy of a signed power purchase agreement;\n(ii) a copy of a binding agreement other than a power purchase agreement to sell electricity generated by the project to a third person; or\n(iii) if the project developer or owner will sell electricity to its own members or customers, a copy of the purchase order for equipment to construct the project with a delivery date and a copy of a signed receipt for a nonrefundable deposit; and\n(3) any other information the commissioner deems necessary to determine whether the proposed project qualifies for the incentive under this section.\n(b) The commissioner shall determine whether a project qualifies for the incentive and respond in writing to the applicant approving or denying the application within 15 working days of receipt of the information required in paragraph (a). A project that is not operational within 18 months of receipt of a letter of approval is no longer approved for the incentive. The commissioner shall notify an applicant of potential loss of approval not less than 60 days prior to the end of the 18-month period. Eligibility for a project that loses approval may be reestablished as of the date the commissioner receives a new completed application.",
	"repealed": false
}