{
	"id": "13.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.072",
	"title": "13.072 OPINIONS BY THE COMMISSIONER.",
	"text": "(a) Upon request of a government entity, the commissioner may give a written opinion on any question relating to public access to government data, rights of subjects of data, or classification of data under this chapter or other Minnesota statutes governing government data practices. Upon request of any person who disagrees with a determination regarding data practices made by a government entity, the commissioner may give a written opinion regarding the person's rights as a subject of government data or right to have access to government data.\n(b) Upon request of a body subject to chapter 13D, the commissioner may give a written opinion on any question relating to the body's duties under chapter 13D. Upon request of a person who disagrees with the manner in which members of a governing body perform their duties under chapter 13D, the commissioner may give a written opinion on compliance with chapter 13D.\n(c) If the commissioner determines that no opinion will be issued, the commissioner shall give the government entity or body subject to chapter 13D or person requesting the opinion notice of the decision not to issue the opinion within five business days of receipt of the request. Notice must be in writing. For notice by mail, the decision not to issue an opinion is effective when placed with the United States Postal Service or with the central mail system of the state of Minnesota. If this notice is not given, the commissioner shall issue an opinion within 50 days of receipt of the request.\n(d) The government entity or the members of a body subject to chapter 13D must be provided a reasonable opportunity to explain the reasons for its decision regarding the data or how they perform their duties under chapter 13D. The commissioner or the government entity or body subject to chapter 13D may choose to give notice to the subject of the data concerning the dispute regarding the data or compliance with chapter 13D.\n(e) This section does not apply to a determination made by the commissioner of health under section 13.3805, subdivision 1, paragraph (b), or 144.6581.\n(f) A written, numbered, and published opinion issued by the attorney general shall take precedence over an opinion issued by the commissioner under this section.\nOpinions issued by the commissioner under this section are not binding on the government entity or members of a body subject to chapter 13D whose data or performance of duties is the subject of the opinion, but an opinion described in subdivision 1, paragraph (a), must be given deference by a court or other tribunal in a proceeding involving the data. The commissioner shall arrange for public dissemination of opinions issued under this section, and shall indicate when the principles stated in an opinion are not intended to provide guidance to all similarly situated persons or government entities. This section does not preclude a person from bringing any other action under this chapter or other law in addition to or instead of requesting a written opinion. A government entity, members of a body subject to chapter 13D, or person that acts in conformity with a written opinion of the commissioner issued to the government entity, members, or person or to another party is not liable for compensatory or exemplary damages or awards of attorneys fees in actions for violations arising under section 13.08 or 13.085, or for a penalty under section 13.09 or for fines, awards of attorney fees, or any other penalty under chapter 13D. A member of a body subject to chapter 13D is not subject to forfeiture of office if the member was acting in reliance on an opinion.\n[Repealed, 1Sp1997 c 3 s 47]\nA government entity may submit not public data to the commissioner for the purpose of requesting or responding to a person's request for an opinion. Government data submitted to the commissioner by a government entity or copies of government data submitted by other persons have the same classification as the data have when held by the government entity. If the nature of the opinion is such that the release of the opinion would reveal not public data, the commissioner may issue an opinion using pseudonyms for individuals. Data maintained by the commissioner, in the record of an opinion issued using pseudonyms that would reveal the identities of individuals protected by the use of the pseudonyms, are private data on individuals.",
	"repealed": false
}