{
	"id": "116P.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.21",
	"title": "116P.21 ADDITIONAL CAPITAL CONSTRUCTION PROJECT REQUIREMENTS.",
	"text": "If an appropriation from the trust fund for a capital construction project or project phase is not alone sufficient to complete the project or project phase and a commitment from sources other than the trust fund is required:\n(1) the commitment must be in an amount that, when added to the appropriation from the trust fund, is sufficient to complete the project or project phase; and\n(2) the agency administering the appropriation from the trust fund must not distribute the money until the commitment is determined to be sufficient. In determining the sufficiency of a commitment under this clause, the agency must apply the standards and principles applied by the commissioner of management and budget under section 16A.502.\nA recipient of money appropriated from the trust fund for a capital construction project must provide a cash or in-kind match from nontrust fund sources of at least 25 percent of the total costs to complete the project or project phase.\nThe sustainable building guidelines established under sections 16B.325 and 216B.241, subdivision 9, apply to new buildings and major renovations funded from the trust fund. A recipient of money appropriated from the trust fund for a new building or major renovation must ensure that the project complies with the guidelines.\n(a) Subdivisions 1, 2, and 3 do not apply to:\n(1) a capital construction project with a total cost of less than $10,000; or\n(2) a land acquisition project.\n(b) If land is acquired with trust fund money for the purpose of capital construction, the land acquisition is not exempted under paragraph (a), clause (2).\nThe following statutes also apply to recipients of appropriations from the trust fund: sections 16B.32; 16B.335, subdivisions 3 and 4; 16C.054; 16C.16; 16C.28; 16C.285; 138.40; 138.665; 138.666; 177.41 to 177.44; and 471.345.",
	"repealed": false
}