{
	"id": "103F.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.221",
	"title": "103F.221 MUNICIPAL SHORELAND MANAGEMENT.",
	"text": "(a) A municipality having shoreland within its corporate boundaries must submit ordinances or rules affecting the use and development of its shorelands to the commissioner for review. The commissioner must review the ordinances or rules and:\n(1) determine whether the rules and ordinances are in substantial compliance with municipal shoreland management standards and criteria under section 103F.211; and\n(2) consider any feature unique to the municipal shoreland in question, including the characteristics of the waters that may be affected by development, storm sewer facilities, and sanitary and waste disposal facilities in existence at the time of the commissioner's review.\n(b) If the commissioner determines that the ordinances or rules of a municipality do not substantially comply with the state standards and criteria for municipal shoreland management, the commissioner must notify the municipality. The notice must state the changes that are necessary to bring the ordinances or rules into substantial compliance with the standards and criteria. By one year after receiving the notice from the commissioner, the municipality must make changes necessary to bring the ordinances or rules into substantial compliance with state standards and criteria.\n(a) The commissioner may adopt an ordinance or rules for the municipality if:\n(1) a municipality does not have an ordinance or rule affecting the use and development of shoreland;\n(2) the corporate boundaries of the municipality are expanded to include shorelands not previously included within the municipal boundaries and the municipality fails to adopt an ordinance within one year after including the shorelands within its municipal boundaries; or\n(3) the commissioner determines that a municipal shoreland management ordinance does not substantially comply with the standards and criteria for municipal shoreland management and that the municipality has failed to make the necessary changes within one year after receiving notice of noncompliance.\n(b) The ordinance or rules for the municipality must be adopted as provided in this paragraph. The commissioner must hold at least one public hearing on the proposed ordinance or rules in the manner provided in section 462.357, after giving notice under section 462.357. The ordinance or rules are effective for the municipality on the date and in accordance with rules prescribed by the commissioner relating to compliance.\n(c) The ordinance must be enforced as provided in section 462.362. The penalties in section 462.362 apply to violations of the ordinances or rules adopted for the municipality by the commissioner.\nThe costs incurred by the commissioner in adopting the ordinances or rules for the municipality must be paid by the municipality and collected from the municipality in the same manner as costs are paid by a county and collected from a county under section 103F.215, subdivision 4.\nMunicipal planning and land use controls for land other than shoreland in the vicinity of shoreland must be, to the maximum extent practical, compatible with planning and land use controls for shoreland adopted under subdivision 1.\nA municipality may adopt and enforce ordinances or rules affecting the use and development of shoreland that are more restrictive than the standards and criteria adopted by the commissioner.",
	"repealed": false
}