{
	"id": "6.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.80",
	"title": "6.80 RULE AND LAW WAIVER REQUESTS.",
	"text": "(a) A local government unit may request the state auditor to grant a waiver from one or more administrative rules or a temporary, limited exemption from enforcement of state procedural laws governing delivery of services by the local government unit. Two or more local government units may submit a joint application for a waiver or exemption under this section if they propose to cooperate in providing a service or program that is subject to the rule or law. Before submitting an application to the state auditor, the governing body of the local government unit must approve, in concept, the proposed waiver or exemption at a meeting required to be public under chapter 13D. A local government unit or two or more units acting jointly may apply for a waiver or exemption on behalf of a nonprofit organization providing services to clients whose costs are paid by the unit or units. A waiver or exemption granted to a nonprofit organization under this section applies to services provided to all the organization's clients.\n(b) Before petitioning the state auditor's office for an exemption from an administrative rule, the petitioner must have requested and been denied such an exemption from the appropriate agency pursuant to sections 14.055 and 14.056.\nA local government unit requesting a waiver of a rule or exemption from enforcement of a law under this section shall present a written application to the state auditor. The application must include:\n(1) the name and address of the entity for whom a waiver of a rule or exemption from enforcement of a law is being requested;\n(2) identification of the service or program at issue;\n(3) identification of the administrative rule or the law imposing a procedural requirement with respect to which the waiver or exemption is sought;\n(4) a description of the improved service outcome sought, including an explanation of the effect of the waiver or exemption in accomplishing that outcome, and why that outcome cannot be accomplished under established rules or laws;\n(5) information on the state auditor's office treatment on similar cases;\n(6) the name, address, and telephone number of any person, business, or other government unit the petitioner knows would be adversely affected by the grant of the petition; and\n(7) a signed statement as to the accuracy of the facts presented.\nA copy of the application must be provided by the requesting local government unit to the exclusive representative certified under section 179A.12 to represent employees who provide the service or program affected by the requested waiver or exemption.\n(a) Upon receipt of an application from a local government unit, the state auditor shall review the application. The state auditor shall dismiss an application if the application proposes a waiver of rules or exemption from enforcement of laws that would result in due process violations, violations of federal law or the state or federal constitution, or the loss of services to people who are entitled to them.\n(b) The state auditor shall determine whether a law from which an exemption for enforcement is sought is a procedural law, specifying how a local government unit is to achieve an outcome, rather than a substantive law prescribing the outcome or otherwise establishing policy. For the purposes of this section, \"procedural law\" does not include a statutory notice requirement. In making the determination, the state auditor shall consider whether the law specifies such requirements as:\n(1) who must deliver a service;\n(2) where the service must be delivered;\n(3) to whom and in what form reports regarding the service must be made; and\n(4) how long or how often the service must be made available to a given recipient.\n(c) If the application requests a waiver of a rule or temporary, limited exemptions from enforcement of a procedural law over which the Metropolitan Council or a metropolitan agency has jurisdiction, the state auditor shall also transmit a copy of the application to the council or applicable metropolitan agency, whichever has jurisdiction, for review and comment. The council or agency shall report its comments to the board within 60 days of the date the application was transmitted to the council or agency. The council or agency may point out any resources or technical assistance it may be able to provide a local government unit submitting a request under this section.\n(d) Within 15 days after receipt of the application, the state auditor shall transmit a copy of it to the commissioner of each agency having jurisdiction over a rule or law from which a waiver or exemption is sought. The agency may mail a notice that it has received an application for a waiver or exemption to all persons who have registered with the agency under section 14.14, subdivision 1a, identifying the rule or law from which a waiver or exemption is requested. If no agency has jurisdiction over the rule or law, the state auditor shall transmit a copy of the application to the attorney general. The agency shall inform the state auditor of its agreement with or objection to and grounds for objection to the waiver or exemption request within 60 days of the date when the application was transmitted to it. An agency's failure to do so is considered agreement to the waiver or exemption. The state auditor shall decide whether to grant a waiver or exemption at the end of the 60-day response period. Interested persons may submit written comments to the state auditor on the waiver or exemption request up to the end of the 60-day response period.\n(e) If the exclusive representative of the affected employees of the requesting local government unit objects to the waiver or exemption request it may inform the state auditor of the objection to and the grounds for the objection to the waiver or exemption request within 60 days of the receipt of the application.\nIf a state agency under subdivision 3, paragraph (d), or the exclusive representative of the affected employees under subdivision 3, paragraph (e), has objected to a waiver or exemption request, the state auditor's office shall set a date for a hearing on the applications. The hearing must be conducted informally at a time and place determined by all parties. Persons representing the local government unit shall present their case for the waiver or exemption, and persons representing the agency or the exclusive representative of the affected employees shall explain their objection to it. The state auditor may request additional information from the local government unit or either objecting party. The state auditor may also request, either before or at the hearing, information or comments from representatives of business, labor, local governments, state agencies, consultants, and members of the public. If necessary, the hearing may be continued for a later date. The state auditor may modify the terms of the waiver or exemption request in arriving at the agreement required under subdivision 5.\n(a) In determining whether to grant a petition for a waiver of a rule or exemption from enforcement of a law, the state auditor should consider the following factors:\n(1) whether there is a true and unique impediment under current law to accomplishing the goal of the local government unit;\n(2) granting the waiver of a rule or exemption from enforcement of law will only change procedural requirements of a local government unit;\n(3) the purpose of any rule or law that is waived is still being met in another manner;\n(4) granting the proposed waiver of a rule or exemption from enforcement of a law would result in a more efficient means of providing government services; and\n(5) granting the proposed waiver will not have a significant negative impact on other state government, local government units, businesses, or citizens.\n(b) If the state auditor grants a request for a waiver or exemption, the state auditor and the local government unit shall enter into an agreement providing for the delivery of the service or program that is the subject of the application. The agreement must specify desired outcomes, the reasons why the desired outcomes cannot be met under current laws or rules, and the means of measurement by which the state auditor will determine whether the outcomes specified in the agreement have been met. The agreement must specify the duration of the waiver or exemption. The duration of a waiver from an administrative rule may be for no less than two years and no more than four years, subject to renewal if both parties agree. An exemption from enforcement of a law terminates ten days after adjournment of the regular legislative session held during the calendar year following the year when the exemption is granted, unless the legislature has acted to extend or make permanent the exemption.\n(c) The state auditor must report any grants of waivers or exemptions to the legislature, including the chairs of the governmental operations and appropriate policy committees in the house of representatives and senate, and the governor within 30 days.\n(d) The state auditor may reconsider or renegotiate the agreement if the rule or law affected by the waiver or exemption is amended or repealed during the term of the original agreement. A waiver of a rule under this section has the effect of a variance granted by an agency under section 14.055. A local unit of government that is granted an exemption from enforcement of a procedural requirement in state law under this section is exempt from that law for the duration of the exemption. The state auditor may require periodic reports from the local government unit, or conduct investigations of the service or program.\nIf the state auditor finds that the local government unit is failing to comply with the terms of the agreement under subdivision 5, the state auditor may rescind the agreement. Upon the rescission, the local unit of government becomes subject to the rules and laws covered by the agreement.\nIf a local government unit, through a cooperative program under this section, gains access to data collected, created, received, or maintained by another local government that is classified as not public, the unit gaining access is governed by the same restrictions on access to and use of the data as the unit that collected, created, received, or maintained the data.",
	"repealed": false
}