{
	"id": "16A.057",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.057",
	"title": "16A.057 INTERNAL CONTROLS AND INTERNAL AUDITING.",
	"text": "The commissioner is responsible for the system of internal controls across the executive branch. The commissioner must coordinate the design, implementation, and maintenance of an effective system of internal controls and internal auditing for all executive agencies. The system must:\n(1) safeguard public funds and assets and minimize incidences of fraud, waste, and abuse;\n(2) ensure that programs are administered in compliance with federal and state laws and rules; and\n(3) require documentation of internal control procedures over financial management activities, provide for analysis of risks, and provide for periodic evaluation of control procedures to satisfy the commissioner that these procedures are adequately designed, properly implemented, and functioning effectively.\nThe commissioner must adopt internal control standards and policies that agencies must follow to meet the requirements of subdivision 1. These standards and policies may include separation of duties, safeguarding receipts, time entry, approval of travel, and other topics the commissioner determines are necessary to comply with subdivision 1.\nThe commissioner shall coordinate training for accounting personnel and financial managers in state agencies on internal controls as necessary to ensure financial integrity in the state's financial transactions. The commissioner shall provide internal control support to agencies that the commissioner determines need this assistance.\nThe commissioner must administer a program for sharing internal auditors among executive agencies that do not have their own internal auditors and for assembling interagency teams of internal auditors as necessary.\nThe commissioner must review audit reports from the Office of the Legislative Auditor and take appropriate steps to address internal control problems found in executive agencies.\nThe commissioner of management and budget may require that each executive agency spend a specified percentage of its operating budget on internal control systems. The commissioner of management and budget may require that an agency transfer a portion of its operating budget to the commissioner to pay for internal control functions performed by the commissioner.\nThe commissioner must report to the legislative audit commission and the governor by January 31 of each odd-numbered year on the system of internal controls and internal auditing in executive agencies.\nThe head of each executive agency is responsible for designing, implementing, and maintaining an effective internal control system within the agency that complies with the requirements of subdivision 1, clauses (1) to (3). The head of each executive agency must annually certify that the agency head has reviewed the agency's internal control systems, and that these systems are in compliance with standards and policies established by the commissioner. The agency head must submit the signed certification form to the commissioner of management and budget, in a form specified by the commissioner.\nThis section does not apply to the Minnesota State Colleges and Universities system.",
	"repealed": false
}