{
	"id": "53B.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.60",
	"title": "53B.60 SURETY BOND.",
	"text": "(a) An applicant for a money transmission license must provide, and a licensee must at all times maintain (1) security consisting of a surety bond in a form satisfactory to the commissioner, or (2) with the commissioner's approval, a deposit instead of a bond in accordance with this section.\n(b) The amount of the required security under this section is:\n(1) the greater of (i) $100,000, or (ii) an amount equal to one hundred percent of the licensee's average daily money transmission liability in Minnesota, calculated for the most recently completed three-month period, up to a maximum of $500,000; or\n(2) in the event that the licensee's tangible net worth exceeds ten percent of total assets, the licensee must maintain a surety bond of $100,000.\n(c) A licensee that maintains a bond in the maximum amount provided for in paragraph (b), clause (1) or (2), as applicable, is not required to calculate the licensee's average daily money transmission liability in Minnesota for purposes of this section.\n(d) A licensee may exceed the maximum required bond amount pursuant to section 53B.62, paragraph (a), clause (5).\n(e) The security device remains effective until cancellation, which may occur only after 30 days' written notice to the commissioner. Cancellation does not affect the rights of any claimant for any liability incurred or accrued during the period for which the bond was in force.\n(f) The security device must remain in place for no longer than five years after the licensee ceases money transmission operations in Minnesota. Notwithstanding this paragraph, the commissioner may permit the security device to be reduced or eliminated before that time to the extent that the amount of the licensee's payment instruments outstanding in Minnesota are reduced. The commissioner may also permit a licensee to substitute a letter of credit or other form of security device acceptable to the commissioner for the security device in place at the time the licensee ceases money transmission operations in Minnesota.",
	"repealed": false
}