{
	"id": "609.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.84",
	"title": "609.84 SALE OF HUMAN REMAINS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Human remains\" means any part of a dead human body, the cremated remains of a dead human body, or the hydrolyzed remains of a dead human body.\n(c) \"Law enforcement agency\" has the meaning given in section 626.84, subdivision 1, paragraph (f).\n(d) \"Local organization for emergency management\" has the meaning given in section 12.03, subdivision 6.\n(e) \"Search and rescue unit\" means an organization, team, or individual authorized by the state or federal government, a Tribal government, or by a county, city, town, or a metropolitan airports commission organized and existing under sections 473.601 to 473.679 whose mission is to locate lost, missing, or trapped persons, victims of natural or other disasters, and human bodies.\n(a) Except as provided in paragraph (b), a person is prohibited from selling human remains or offering human remains for sale.\n(b) Paragraph (a) shall not be construed to limit the donation of human remains:\n(1) to a licensed health care provider, an individual employed by or under contract with a licensed health care provider, a public or private postsecondary educational institution, or an individual employed by or under contract with a public or private postsecondary educational institution, for legitimate medical or scientific purposes or for educational purposes;\n(2) to a company registered with the United States Food and Drug Administration or an individual, company, or entity employed by or under contract with a company registered with the United States Food and Drug Administration for legitimate medical or scientific purposes, including but not limited to the development, manufacturing, and research of medical products; or\n(3) to a law enforcement agency, search and rescue unit, or local organization for emergency management to conduct search and rescue training or to entities that train dogs to locate dead human bodies.\n(c) Paragraph (a) does not apply to the sale or offer for sale of human remains that is incidental to the sale of real property, including undisturbed burial plots, cemeteries, crypts, or other burial features.\n(d) Nothing in this section shall be construed to prohibit a person from recovering reasonable expenses for the processing, preservation, quality control, storage, transportation, or final disposition of human remains for the legitimate purposes as described in this section.\nA person who violates this section is guilty of a felony.",
	"repealed": false
}