{
	"id": "115B.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.43",
	"title": "115B.43 REIMBURSABLE PARTIES AND EXPENSES.",
	"text": "Environmental response costs at qualified facilities defined in section 115B.39, subdivision 2, paragraph (o), clause (1), for which a notice of compliance has been issued under section 115B.40, subdivision 7, are reimbursable as provided in this section.\n(a) Except as provided in paragraphs (b) to (d), the following persons are eligible for reimbursement under this section:\n(1) owners or operators, after the owners or operators have agreed to waive all claims for recovery of environmental response costs against any other persons and have agreed to reimburse, on a proportionate basis from each reimbursement received, each person from whom the applicant has collected funds towards reimbursable costs; and\n(2) persons, other than owners and operators after the persons have agreed to:\n(i) reimburse, on a proportionate basis from each reimbursement payment received, each person from whom the applicant has collected funds towards reimbursable costs; and\n(ii) waive all claims for environmental response costs related to the facility and all other qualified facilities, against all other persons.\n(b) A person is not eligible for reimbursement under this section if the person is an owner or operator who failed to properly close the qualified facility within the time specified in the facility's permit or the solid waste rules in effect at the time the facility stopped accepting waste.\n(c) A person is not eligible for reimbursement under this section for environmental response costs at a facility if the person's actions relating to a release or threatened release at the facility were in violation of federal or state hazardous waste management laws in effect at the time of those actions.\n(d) A person is not eligible for reimbursement under this section if, after June 15, 1994, the person files or continues to pursue an action asserting a claim for recovery of environmental response costs relating to a qualified facility, or otherwise seeks contributions for these costs, from another person.\n(a) Environmental response costs are eligible for reimbursement under this section to the extent that they:\n(1) exceed:\n(i) for each political subdivision that is an owner or operator of the facility, $250,000; and\n(ii) for a private owner or operator, or a political subdivision that jointly owned or operated the facility with two or more other political subdivisions under a valid joint powers agreement, $750,000;\n(2) are documented with billings or other proof of project cost; and\n(3) if the commissioner finds that they were reasonable and necessary under the circumstances. The commissioner may request further documentation from those requesting reimbursement if it is necessary in the commissioner's judgment.\n(b) For owners or operators, the following costs are not reimbursable:\n(1) costs attributable to normal operations of the facility or to activities required under the facility permit and applicable solid waste rules, including corrective action, closure, postclosure, and contingency action; and\n(2) the acquisition of real property if required of the owner or operator in order to carry out requirements of the facility permit or applicable solid waste rules.\nThe commissioner shall prepare a reimbursement plan and present it by October 1, 1995, to the Legislative Commission on Waste Management, the chairs of the senate Finance Committee and Environment and Natural Resources Finance Division and the committees on Ways and Means and Environment and Natural Resources Finance of the house of representatives, and owners and operators of, and persons subject to a cleanup order at, qualified facilities. The plan shall identify sites where reimbursement will occur and the estimated dollar amount for each site and shall set out priorities and payment schedules. The plan must give first priority for reimbursement to persons who are not owners or operators of qualified facilities.\nThe commissioner shall not issue reimbursement payments before October 15, 1995. The commissioner shall not issue reimbursements for expense statements filed after October 15, 1996, and shall approve or deny all reimbursement requests by October 15, 1997. The commissioner shall fully reimburse all persons eligible for reimbursement no later than six years after the date of notice of compliance for the facility under section 115B.40, subdivision 7.\nThe commissioner shall not issue reimbursements in an amount exceeding $7,000,000 per fiscal year.",
	"repealed": false
}