{
	"id": "13.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.085",
	"title": "13.085 ADMINISTRATIVE REMEDY.",
	"text": "As used in this section, \"office\" means the Office of Administrative Hearings.\n(a) A complaint alleging a violation of this chapter for which an order to compel compliance is requested may be filed with the office. An action to compel compliance does not include procedures pursuant to section 13.04, subdivision 4 or 4a.\n(b) The complaint must be filed with the office within two years after the occurrence of the act or failure to act that is the subject of the complaint, except that if the act or failure to act involves concealment or misrepresentation by the government entity that could not be discovered during that period, the complaint may be filed with the office within one year after the concealment or misrepresentation is discovered.\n(c) The complaint must be made in writing, submitted under oath, and detail the factual basis for the claim that a violation of law has occurred. The office may prescribe a standard form for the complaint. The complaint must be accompanied by a filing fee of $1,000 or a bond to guarantee the payment of this fee.\n(d) Upon receipt of a filed complaint, the office must immediately notify the respondent and, if known, the applicable responsible authority for the government entity, if the responsible authority is not otherwise named as the respondent. The office must provide the respondent with a copy of the complaint by the most expeditious means available. Notice to a responsible authority must be delivered by certified mail. The office must also notify, to the extent practicable, any individual or entity that is the subject of all or part of the data in dispute.\n(e) The office must notify the commissioner of administration of an action filed under this section. Proceedings under this section must be dismissed if a request for an opinion from the commissioner was accepted on the matter under section 13.072 before the complaint was filed, and the complainant's filing fee must be refunded.\n(f) The respondent must file a response to the complaint within 15 business days of receipt of the notice. For good cause shown, the office may extend the time for filing a response.\n(a) The chief administrative law judge must assign an administrative law judge to review each complaint. Within 20 business days after a response is filed, or the respondent's time to file the response, including any extension, has expired, the administrative law judge must make a preliminary determination for its disposition as follows:\n(1) if the administrative law judge determines that the complaint and any timely response of the respondent agency do not present sufficient facts to believe that a violation of this chapter has occurred, the complaint must be dismissed; or\n(2) if the administrative law judge determines that the complaint and any timely response of the respondent agency do present sufficient facts to believe that a violation of this chapter has occurred, the judge must schedule a hearing as provided in subdivision 4.\n(b) The office must notify all parties of the determination made under paragraph (a). The notice must provide as follows:\n(1) if the complaint is scheduled for a hearing, the notice must identify the time and place of the hearing and inform all parties that they may submit evidence, affidavits, documentation, and argument for consideration by the administrative law judge; or\n(2) if the complaint is dismissed for failure to present sufficient facts to believe that a violation of this chapter has occurred, the notice must inform the parties of the right of the complainant to seek reconsideration of the decision on the record by the chief administrative law judge, as provided in paragraph (c).\n(c) A petition for reconsideration may be filed no later than five business days after a complaint is dismissed for failure to present sufficient facts to believe that a violation of this chapter has occurred. The chief administrative law judge must review the petition and make a final ruling within ten business days after its receipt. If the chief administrative law judge determines that the assigned administrative law judge made a clear material error, the chief administrative law judge must schedule the matter for a hearing as provided in subdivision 4.\n(a) A hearing on a complaint must be held within 30 business days after the parties are notified that a hearing will be held. An oral hearing to resolve questions of law may be waived upon consent of all parties and the presiding administrative law judge. For good cause shown, the judge may delay the date of a hearing by no more than ten business days. The judge may continue a hearing to enable the parties to submit additional evidence or testimony.\n(b) The administrative law judge must consider any evidence and argument submitted until the hearing record is closed, including affidavits and documentation.\n(c) All hearings, and any records relating to the hearing, must be open to the public, except that the judge may inspect in camera any government data in dispute. If the hearing record contains information that is not public data, the judge may conduct a closed hearing to consider the information, issue necessary protective orders, and seal all or part of the hearing record, as provided in section 14.60, subdivision 2. If a party contends, and the judge concludes, that not public data could be improperly disclosed while that party is presenting its arguments, the judge shall close any portion of the hearing as necessary to prevent the disclosure. A hearing may be conducted by conference telephone call or interactive audio/video system, at the discretion of the presiding judge, and upon consent of all parties.\n(a) Following a hearing, the judge must determine whether the violation alleged in the complaint occurred and must make at least one of the following dispositions. The judge may:\n(1) dismiss the complaint;\n(2) find that an act or failure to act constituted a violation of this chapter;\n(3) impose a civil penalty against the respondent of up to $300;\n(4) issue an order compelling the respondent to comply with a provision of law that has been violated, and may establish a deadline for production of data, if necessary; and\n(5) refer the complaint to the appropriate prosecuting authority for consideration of criminal charges.\n(b) In determining whether to assess a civil penalty, the office shall consider the factors described in section 13.08, subdivision 4.\n(c) The judge must render a decision on a complaint within ten business days after the hearing record closes. The chief administrative law judge shall provide for public dissemination of orders issued under this section. If the judge determines that a government entity has violated a provision of law and issues an order to compel compliance, the office shall forward a copy of the order to the commissioner of administration. Any order issued pursuant to this section is enforceable through the district court for the district in which the respondent is located.\n(d) A party aggrieved by a final decision on a complaint filed under this section is entitled to judicial review as provided in sections 14.63 to 14.69. Proceedings on a complaint are not a contested case within the meaning of chapter 14 and are not otherwise governed by chapter 14.\n(e) A decision of the office under this section is not controlling in any subsequent action brought in district court alleging the same violation and seeking damages.\n(f) A government entity or person that releases not public data pursuant to an order under this section is immune from civil and criminal liability for that release. A government entity or person that acts in conformity with an order issued under this section to the government entity or to any other person is not liable for compensatory or exemplary damage or awards of attorney fees for acting in conformity with that order in actions under this section or section 13.08, or for a penalty under section 13.09.\n(a) A rebuttable presumption shall exist that a complainant who substantially prevails on the merits in an action brought under this section is entitled to an award of reasonable attorney fees, not to exceed $5,000. An award of attorney fees may be denied if the judge determines that the violation is merely technical or that there is a genuine uncertainty about the meaning of the governing law.\n(b) Reasonable attorney fees, not to exceed $5,000, must be awarded to a substantially prevailing complainant if the government entity that is the respondent in the action was also the subject of a written opinion issued under section 13.072 and the administrative law judge finds that the opinion is directly related to the matter in dispute and that the government entity did not act in conformity with the opinion.\n(c) The office shall refund the filing fee of a substantially prevailing complainant in full, less $50, and the office's costs in conducting the matter shall be billed to the respondent, not to exceed $1,000.\n(d) A complainant that does not substantially prevail on the merits shall be entitled to a refund of the filing fee, less any costs incurred by the office in conducting the matter.\n(e) If the administrative law judge determines that a complaint is frivolous, or brought for purposes of harassment, the judge must order that the complainant pay the respondent's reasonable attorney fees, not to exceed $5,000. The complainant shall not be entitled to a refund of the filing fee.\n(f) The court shall award the complainant costs and attorney fees incurred in bringing an action in district court to enforce an order of the Office of Administrative Hearings under this section.\nProceeds collected by the office from filing fees and bonds submitted under this section shall be deposited into the administrative hearings account established under section 14.54 and are appropriated to the office for use in administering the requirements of this section. By September 1 each year, the chief administrative law judge must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the office on receipt and expenditure of money under this section in the preceding fiscal year.",
	"repealed": false
}