{
	"id": "163.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.051",
	"title": "163.051 COUNTY WHEELAGE TAX.",
	"text": "(a) Except as provided in paragraph (c), the board of commissioners of each county is authorized to levy by resolution a wheelage tax at the rate specified in paragraph (b), on each motor vehicle that is kept in such county when not in operation and that is subject to annual registration and taxation under chapter 168. The board may provide by resolution for collection of the wheelage tax by county officials or it may request that the tax be collected by the state registrar of motor vehicles. The state registrar of motor vehicles shall collect such tax on behalf of the county if requested, as provided in subdivision 2.\n(b) The wheelage tax under this section is at the rate of up to $20 per year, in any increment of a whole dollar, as specified by each county that authorizes the tax.\n(c) The following vehicles are exempt from the wheelage tax:\n(1) motorcycles, as defined in section 169.011, subdivision 44;\n(2) motorized bicycles, as defined in section 169.011, subdivision 45;\n(3) motorized foot scooters, as defined in section 169.011, subdivision 46; and\n(4) vehicles that meet the requirements under section 168.012, subdivision 13.\n(d) For any county that authorized the tax prior to May 24, 2013, the wheelage tax continues at the rate provided under paragraph (b).\nThe wheelage tax levied by any county, if made collectible by the state registrar of motor vehicles, shall be certified by the county auditor to the registrar not later than August 1 in the year before the calendar year or years for which the tax is levied, and the registrar shall collect such tax with the motor vehicle taxes on the affected vehicles for such year or years. Every owner and every operator of such a motor vehicle shall furnish to the registrar all information requested by the registrar. No state motor vehicle tax on any such motor vehicle for any such year shall be received or deemed paid unless the applicable wheelage tax is paid therewith.\nNotwithstanding the provisions of any other law, the state registrar of motor vehicles shall deposit the proceeds of the wheelage tax imposed by subdivision 2, to the credit of the county wheelage tax account of each county. The amount necessary to pay the costs of collection of said tax is appropriated from the county wheelage tax account of each county to the state registrar of motor vehicles.\nOn a monthly basis, the registrar of motor vehicles shall issue a payment in favor of the treasurer of each county for which the registrar has collected a wheelage tax in the amount of such tax then on hand in the county wheelage tax account. There is hereby appropriated from the county wheelage tax account each year, to each county entitled to payments authorized by this section, sufficient moneys to make such payments.\nThe treasurer of each county receiving payments under subdivision 3 shall deposit such payments in the county road and bridge fund. The moneys shall be used for purposes authorized by law which are highway purposes within the meaning of the Minnesota Constitution, article 14.\nMS 2006 [Repealed, 2008 c 154 art 2 s 33]\nMS 2012 [Repealed by amendment, 2013 c 117 art 3 s 4]\n(a) Any owner or operator of a motor vehicle who willfully gives any false information relative to the tax authorized by this section to the registrar of motor vehicles or any county, or who willfully fails or refuses to furnish any such information, is guilty of a misdemeanor.\n(b) Except as otherwise provided in this section, the collection and payment of a wheelage tax and all matters relating thereto are subject to all provisions of law relating to collection and payment of motor vehicle taxes so far as applicable.",
	"repealed": false
}