{
	"id": "142E.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.13",
	"title": "142E.13 EXTENDED ELIGIBILITY AND AUTHORIZATION.",
	"text": "(a) A family in a situation under paragraph (b) continues to be eligible for up to three months or until the family's redetermination, whichever occurs first, rather than losing eligibility or having the family's eligibility suspended. During extended eligibility, the amount of child care authorized shall continue at the same number or more hours. The family must continue to meet all other eligibility requirements under this chapter.\n(b) The family's three-month extended eligibility period applies when:\n(1) a participant's employment or education program ends permanently;\n(2) the other parent moves in and does not participate in an authorized activity;\n(3) a participant's MFIP assistance ends and the participant is not participating in an authorized activity or the participant's participation in an authorized activity is unknown;\n(4) a student parent under section 142E.01, subdivision 26, stops attending school; or\n(5) a participant receiving basic sliding fee child care assistance or transition year child care assistance applied for MFIP assistance and is not participating in an authorized activity or the participant's participation in an authorized activity is unknown.\n(a) If the family received three months of extended eligibility and redetermination is not due, to continue receiving child care assistance the participant must be employed or have an education plan that meets the requirements of section 142E.12, subdivision 3, or have an MFIP employment plan. If child care assistance continues, the amount of child care authorized shall continue at the same number or more hours until redetermination, unless a condition in section 142E.11, subdivision 2, paragraph (c), applies. A family subject to section 142E.11, subdivision 1, paragraph (b), shall have child care authorized based on a verified activity schedule.\n(b) If the family's redetermination occurs before the end of the three-month extended eligibility period to continue receiving child care assistance, the participant must verify that the participant meets eligibility and activity requirements for child care assistance under this chapter. If child care assistance continues, the amount of child care authorized is based on section 142E.12. A family subject to section 142E.11, subdivision 1, paragraph (b), shall have child care authorized based on a verified activity schedule.\n[See Note.]",
	"repealed": false
}