{
	"id": "122A.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.76",
	"title": "122A.76 STATEWIDE CONCURRENT ENROLLMENT TEACHER TRAINING PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Northwest Regional Partnership\" means a voluntary association of the Lakes Country Service Cooperative, the Northwest Service Cooperative, and Minnesota State University-Moorhead that works together to provide coordinated higher learning opportunities for teachers.\n(c) \"State Partnership\" means a voluntary association of the Northwest Regional Partnership and the Metropolitan Educational Cooperative Service Unit.\n(d) \"Eligible postsecondary institution\" means a public or private postsecondary institution that awards graduate credits.\n(e) \"Eligible teacher\" means a licensed teacher of secondary school courses for postsecondary credit.\n(a) Lakes Country Service Cooperative, in consultation with the Northwest Service Cooperative, may develop a continuing education program to allow eligible teachers to attain the requisite graduate credits necessary to be qualified to teach secondary school courses for postsecondary credit.\n(b) If established, the State Partnership must contract with one or more eligible postsecondary institutions to establish a continuing education credit program to allow eligible teachers to attain sufficient graduate credits to qualify to teach secondary school courses for postsecondary credit. Members of the State Partnership must work to eliminate duplication of service and develop the continuing education credit program efficiently and cost-effectively.\nThe continuing education program must use flexible delivery models, such as an online education curriculum, that allow eligible secondary school teachers to attain graduate credit at a reduced credit rate. Information about the curriculum, including course length and course requirements, must be posted on the website of the eligible institution offering the course at least two weeks before eligible teachers are required to register for courses in the continuing education program.\n(a) Lakes Country Service Cooperative, in consultation with the other members of the Northwest Regional Partnership, shall:\n(1) provide funding for course development for up to 18 credits in applicable postsecondary subject areas;\n(2) provide scholarships for eligible teachers to enroll in the continuing education program; and\n(3) develop criteria for awarding educator stipends on a per-credit basis to incentivize participation in the continuing education program.\n(b) If established, the State Partnership must:\n(1) provide funding for course development for up to 18 credits in applicable postsecondary subject areas;\n(2) provide scholarships for eligible teachers to enroll in the continuing education program; and\n(3) develop criteria for awarding educator stipends on a per-credit basis to incentivize participation in the continuing education program.\nThe partnerships may receive private resources to supplement the available public money. All money received in fiscal year 2017 shall be administered by the Lakes Country Service Cooperative. All money received in fiscal year 2018 and later shall be administered by the State Partnership.\n(a) The Northwest Regional Partnership must submit a report by January 15, 2018, on the progress of its activities to the legislature, commissioner of education, and Board of Trustees of the Minnesota State Colleges and Universities. The report shall contain a financial report for the preceding year.\n(b) If established, the State Partnership must submit an annual joint report to the legislature and the Office of Higher Education by January 15 of each year on the progress of its activities. The report must include the number of teachers participating in the program, the geographic location of the teachers, the number of credits earned, and the subject areas of the courses in which participants earned credit. The report must include a financial report for the preceding year.",
	"repealed": false
}