{
	"id": "53.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.08",
	"title": "53.08 DIVIDENDS.",
	"text": "When an industrial loan and thrift company is organized under this chapter or operating thereunder, the board of directors may declare a dividend of so much of the net profits of the corporation, after providing for all expenses, reserves, interest, and taxes accrued or due from the corporation, as they shall judge expedient, but before any dividend is declared, not less than one-tenth of the net profits of the industrial loan and thrift company of the preceding half year, or for such period as is covered by the dividend, shall be carried to surplus until the aggregate of undivided profits and surplus shall amount to 20 percent of its capital represented by shares of common stock.\nIn addition to the conditions in subdivision 1, industrial loan and thrift companies having outstanding time certificates of indebtedness, savings accounts, or savings deposits must comply with the following special conditions:\n(1) the dividend period for the purpose of declaring dividends shall be the period beginning on January 1 and ending as of the close of business December 31 of each calendar year and the net income for this period shall be determined from the consolidated report of income of each company;\n(2) the Department of Commerce will supply each company with forms to be completed with information called for. The forms must be mailed or delivered to the commissioner within ten days of the date of declaration of any dividend and at least 15 days before the proposed payment date of any dividend. The forms shall contain a statement by the commissioner providing that if certain requirements as set forth in the statement are met, the company may pay a cash dividend or dividends without specific approval of the commissioner in the year after the dividend period in amounts so as not to reduce the company's capital, surplus, undivided profits, and reserves below these requirements;\n(3) declared dividends shall be deducted from undivided profits and carried on the books as another liability entitled \"dividends payable.\" The other liability account shall be reversed upon payment or nonapproval by the commissioner; and\n(4) except as provided in clause (2), no company shall pay a cash dividend to its stockholders until written approval for the dividend has been obtained from the commissioner.",
	"repealed": false
}