{
	"id": "626.557",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.557",
	"title": "626.557 REPORTING OF MALTREATMENT OF VULNERABLE ADULTS.",
	"text": "The legislature declares that the public policy of this state is to protect adults who, because of physical or mental disability or dependency on institutional services, are particularly vulnerable to maltreatment; to assist in providing safe environments for vulnerable adults; and to provide safe institutional or residential services, community-based services, or living environments for vulnerable adults who have been maltreated.\nIn addition, it is the policy of this state to require the reporting of suspected maltreatment of vulnerable adults, to provide for the voluntary reporting of maltreatment of vulnerable adults, to require the investigation of the reports, and to provide protective and counseling services in appropriate cases.\n[Repealed, 1995 c 229 art 1 s 24]\n(a) A mandated reporter who has reason to believe that a vulnerable adult is being or has been maltreated, or who has knowledge that a vulnerable adult has sustained a physical injury which is not reasonably explained shall immediately report the information to the common entry point. If an individual is a vulnerable adult solely because the individual is admitted to a facility, a mandated reporter is not required to report suspected maltreatment of the individual that occurred prior to admission, unless:\n(1) the individual was admitted to the facility from another facility and the reporter has reason to believe the vulnerable adult was maltreated in the previous facility; or\n(2) the reporter knows or has reason to believe that the individual is a vulnerable adult as defined in section 626.5572, subdivision 21, paragraph (a), clause (4).\n(b) A person not required to report under the provisions of this section may voluntarily report as described above.\n(c) Nothing in this section requires a report of known or suspected maltreatment, if the reporter knows or has reason to know that a report has been made to the common entry point.\n(d) Nothing in this section shall preclude a reporter from also reporting to a law enforcement agency.\n(e) A mandated reporter who knows or has reason to believe that an error under section 626.5572, subdivision 17, paragraph (d), clause (5), occurred must make a report under this subdivision. If the reporter or a facility, at any time believes that an investigation by a lead investigative agency will determine or should determine that the reported error was not neglect according to the criteria under section 626.5572, subdivision 17, paragraph (d), clause (5), the reporter or facility may provide to the common entry point or directly to the lead investigative agency information explaining how the event meets the criteria under section 626.5572, subdivision 17, paragraph (d), clause (5). The lead investigative agency shall consider this information when making an initial disposition of the report under subdivision 9c.\nThe following events are not required to be reported under this section:\n(1) A circumstance where federal law specifically prohibits a person from disclosing patient identifying information in connection with a report of suspected maltreatment, unless the vulnerable adult, or the vulnerable adult's guardian, conservator, or legal representative, has consented to disclosure in a manner which conforms to federal requirements. Facilities whose patients or residents are covered by such a federal law shall seek consent to the disclosure of suspected maltreatment from each patient or resident, or a guardian, conservator, or legal representative, upon the patient's or resident's admission to the facility. Persons who are prohibited by federal law from reporting an incident of suspected maltreatment shall immediately seek consent to make a report.\n(2) Verbal or physical aggression occurring between patients, residents, or clients of a facility, or self-abusive behavior by these persons does not constitute abuse unless the behavior causes serious harm. The operator of the facility or a designee shall record incidents of aggression and self-abusive behavior to facilitate review by licensing agencies and county and local welfare agencies.\n(3) Accidents as defined in section 626.5572, subdivision 3.\n(4) Events occurring in a facility that result from an individual's error in the provision of therapeutic conduct to a vulnerable adult, as provided in section 626.5572, subdivision 17, paragraph (d), clause (4).\n(5) Nothing in this section shall be construed to require a report of financial exploitation, as defined in section 626.5572, subdivision 9, solely on the basis of the transfer of money or property by gift or as compensation for services rendered.\n(a) Except as provided in paragraph (b), a mandated reporter shall immediately make a report to the common entry point. To the extent possible, the report must be of sufficient content to identify the vulnerable adult, the caregiver, the nature and extent of the suspected maltreatment, any evidence of previous maltreatment, the name and address of the reporter, the time, date, and location of the incident, and any other information that the reporter believes might be helpful in investigating the suspected maltreatment. A mandated reporter may disclose not public data, as defined in section 13.02, and medical records under sections 144.291 to 144.298, to the extent necessary to comply with this subdivision.\n(b) A boarding care home that is licensed under sections 144.50 to 144.58 and certified under Title 19 of the Social Security Act, a nursing home that is licensed under section 144A.02 and certified under Title 18 or Title 19 of the Social Security Act, or a hospital that is licensed under sections 144.50 to 144.58 and has swing beds certified under Code of Federal Regulations, title 42, section 482.66, may submit a report electronically to the common entry point instead of submitting an oral report. The report may be a duplicate of the initial report the facility submits electronically to the commissioner of health to comply with the reporting requirements under Code of Federal Regulations, title 42, section 483.12. The commissioner of health may modify these reporting requirements to include items required under paragraph (a) that are not currently included in the electronic reporting form.\n(a) Each facility shall establish and enforce an ongoing written procedure in compliance with applicable licensing rules to ensure that all cases of suspected maltreatment are reported. If a facility has an internal reporting procedure, a mandated reporter may meet the reporting requirements of this section by reporting internally. However, the facility remains responsible for complying with the immediate reporting requirements of this section.\n(b) A facility with an internal reporting procedure that receives an internal report by a mandated reporter shall give the mandated reporter a written notice stating whether the facility has reported the incident to the common entry point. The written notice must be provided within two working days and in a manner that protects the confidentiality of the reporter.\n(c) The written response to the mandated reporter shall note that if the mandated reporter is not satisfied with the action taken by the facility on whether to report the incident to the common entry point, then the mandated reporter may report externally.\n(d) A facility may not prohibit a mandated reporter from reporting externally, and a facility is prohibited from retaliating against a mandated reporter who reports an incident to the common entry point in good faith. The written notice by the facility must inform the mandated reporter of this protection from retaliatory measures by the facility against the mandated reporter for reporting externally.\n(a) A person who makes a good faith report is immune from any civil or criminal liability that might otherwise result from making the report, or from participating in the investigation, or for failure to comply fully with the reporting obligation under section 609.234 or 626.557, subdivision 7.\n(b) A person employed by a lead investigative agency or a state licensing agency who is conducting or supervising an investigation or enforcing the law in compliance with this section or any related rule or provision of law is immune from any civil or criminal liability that might otherwise result from the person's actions, if the person is acting in good faith and exercising due care.\n(c) A person who knows or has reason to know a report has been made to a common entry point and who in good faith participates in an investigation of alleged maltreatment is immune from civil or criminal liability that otherwise might result from making the report, or from failure to comply with the reporting obligation or from participating in the investigation.\n(d) The identity of any reporter may not be disclosed, except as provided in subdivision 12b.\n(e) For purposes of this subdivision, \"person\" includes a natural person or any form of a business or legal entity.\nFinancial institutions shall cooperate with a lead investigative agency, law enforcement, or prosecuting authority that is investigating maltreatment of a vulnerable adult and comply with reasonable requests for the production of financial records as authorized under section 13A.02, subdivision 1. Financial institutions are immune from any civil or criminal liability that might otherwise result from complying with this subdivision.\nA person or facility who intentionally makes a false report under the provisions of this section shall be liable in a civil suit for any actual damages suffered by the reported facility, person or persons and for punitive damages up to $10,000 and attorney fees.\nA mandated reporter who negligently or intentionally fails to report is liable for damages caused by the failure. Nothing in this subdivision imposes vicarious liability for the acts or omissions of others.\nNo evidence regarding the maltreatment of the vulnerable adult shall be excluded in any proceeding arising out of the alleged maltreatment on the grounds of lack of competency under section 595.02.\n(a) The commissioner of human services shall establish a common entry point. The common entry point is the unit responsible for receiving the report of suspected maltreatment under this section.\n(b) The common entry point must be available 24 hours per day to take calls from reporters of suspected maltreatment. The common entry point shall use a standard intake form that includes:\n(1) the time and date of the report;\n(2) the name, relationship, and identifying and contact information for the person believed to be a vulnerable adult and the individual or facility alleged responsible for maltreatment;\n(3) the name, relationship, and contact information for the:\n(i) reporter;\n(ii) initial reporter, witnesses, and persons who may have knowledge about the maltreatment; and\n(iii) legal surrogate and persons who may provide support to the vulnerable adult;\n(4) the basis of vulnerability for the vulnerable adult;\n(5) the time, date, and location of the incident;\n(6) the immediate safety risk to the vulnerable adult;\n(7) a description of the suspected maltreatment;\n(8) the impact of the suspected maltreatment on the vulnerable adult;\n(9) whether a facility was involved and, if so, which agency licenses the facility;\n(10) the actions taken to protect the vulnerable adult;\n(11) the required notifications and referrals made by the common entry point; and\n(12) whether the reporter wishes to receive notification of the disposition.\n(c) The common entry point is not required to complete each item on the form prior to dispatching the report to the appropriate lead investigative agency.\n(d) The common entry point shall immediately report to a law enforcement agency any incident in which there is reason to believe a crime has been committed.\n(e) If a report is initially made to a law enforcement agency or a lead investigative agency, those agencies shall take the report on the appropriate common entry point intake forms and immediately forward a copy to the common entry point.\n(f) The common entry point staff must receive training on how to screen and dispatch reports efficiently and in accordance with this section.\n(g) The commissioner of human services shall maintain a centralized database for the collection of common entry point data, lead investigative agency data including maltreatment report disposition, and appeals data. The common entry point shall have access to the centralized database and must log the reports into the database.\n(h) When appropriate, the common entry point staff must refer calls that do not allege the abuse, neglect, or exploitation of a vulnerable adult to other organizations that might resolve the reporter's concerns.\n(i) A common entry point must be operated in a manner that enables the commissioner of human services to:\n(1) track critical steps in the reporting, evaluation, referral, response, disposition, and investigative process to ensure compliance with all requirements for all reports;\n(2) maintain data to facilitate the production of aggregate statistical reports for monitoring patterns of abuse, neglect, or exploitation;\n(3) serve as a resource for the evaluation, management, and planning of preventative and remedial services for vulnerable adults who have been subject to abuse, neglect, or exploitation;\n(4) set standards, priorities, and policies to maximize the efficiency and effectiveness of the common entry point; and\n(5) track and manage consumer complaints related to the common entry point.\n(j) The commissioners of human services and health shall collaborate on the creation of a system for referring reports to the lead investigative agencies. This system shall enable the commissioner of human services to track critical steps in the reporting, evaluation, referral, response, disposition, investigation, notification, determination, and appeal processes.\n(a) The common entry point must screen the reports of alleged or suspected maltreatment for immediate risk and make all necessary referrals as follows:\n(1) if the common entry point determines that there is an immediate need for emergency adult protective services, the common entry point agency shall immediately notify the appropriate county agency;\n(2) if the report contains suspected criminal activity against a vulnerable adult, the common entry point shall immediately notify the appropriate law enforcement agency;\n(3) the common entry point shall refer all reports of alleged or suspected maltreatment to the appropriate lead investigative agency as soon as possible, but in any event no longer than two working days;\n(4) if the report contains information about a suspicious death, the common entry point shall immediately notify the appropriate law enforcement agencies, the local medical examiner, and the ombudsman for mental health and developmental disabilities established under section 245.92. Law enforcement agencies shall coordinate with the local medical examiner and the ombudsman as provided by law; and\n(5) for reports involving multiple locations or changing circumstances, the common entry point shall determine the county agency responsible for emergency adult protective services and the county responsible as the lead investigative agency, using referral guidelines established by the commissioner.\n(b) If the lead investigative agency receiving a report believes the report was referred by the common entry point in error, the lead investigative agency shall immediately notify the common entry point of the error, including the basis for the lead investigative agency's belief that the referral was made in error. The common entry point shall review the information submitted by the lead investigative agency and immediately refer the report to the appropriate lead investigative agency.\nLaw enforcement is the primary agency to conduct investigations of any incident in which there is reason to believe a crime has been committed. Law enforcement shall initiate a response immediately. If the common entry point notified a county agency for emergency adult protective services, law enforcement shall cooperate with that county agency when both agencies are involved and shall exchange data to the extent authorized in subdivision 12b, paragraph (g). County adult protection shall initiate a response immediately. Each lead investigative agency shall complete the investigative process for reports within its jurisdiction. A lead investigative agency, county, adult protective agency, licensed facility, or law enforcement agency shall cooperate with other agencies in the provision of protective services, coordinating its investigations, and assisting another agency within the limits of its resources and expertise and shall exchange data to the extent authorized in subdivision 12b, paragraph (g). The lead investigative agency shall obtain the results of any investigation conducted by law enforcement officials. The lead investigative agency has the right to enter facilities and inspect and copy records as part of investigations. The lead investigative agency has access to not public data, as defined in section 13.02, and medical records under sections 144.291 to 144.298, that are maintained by facilities to the extent necessary to conduct its investigation. Each lead investigative agency shall develop guidelines for prioritizing reports for investigation. When a county acts as a lead investigative agency, the county shall make guidelines available to the public regarding which reports the county prioritizes for investigation and adult protective services.\n(a) Upon request of the reporter, the lead investigative agency shall notify the reporter that it has received the report, and provide information on the initial disposition of the report within five business days of receipt of the report, provided that the notification will not endanger the vulnerable adult or hamper the investigation.\n(b) In making the initial disposition of a report alleging maltreatment of a vulnerable adult, the lead investigative agency may consider previous reports of suspected maltreatment and may request and consider public information, records maintained by a lead investigative agency or licensed providers, and information from any person who may have knowledge regarding the alleged maltreatment and the basis for the adult's vulnerability.\n(c) When the county social service agency does not accept a report for adult protective services or investigation, the agency may offer assistance to the reporter or the person who was the subject of the report.\n(d) While investigating reports and providing adult protective services, the lead investigative agency may coordinate with entities identified under subdivision 12b, paragraph (g), and may coordinate with support persons to safeguard the welfare of the vulnerable adult and prevent further maltreatment of the vulnerable adult.\n(e) Upon conclusion of every investigation it conducts, the lead investigative agency shall make a final disposition as defined in section 626.5572, subdivision 8.\n(f) When determining whether the facility or individual is the responsible party for substantiated maltreatment or whether both the facility and the individual are responsible for substantiated maltreatment, the lead investigative agency shall consider at least the following mitigating factors:\n(1) whether the actions of the facility or the individual caregivers were in accordance with, and followed the terms of, an erroneous physician order, prescription, resident care plan, or directive. This is not a mitigating factor when the facility or caregiver is responsible for the issuance of the erroneous order, prescription, plan, or directive or knows or should have known of the errors and took no reasonable measures to correct the defect before administering care;\n(2) the comparative responsibility between the facility, other caregivers, and requirements placed upon the employee, including but not limited to, the facility's compliance with related regulatory standards and factors such as the adequacy of facility policies and procedures, the adequacy of facility training, the adequacy of an individual's participation in the training, the adequacy of caregiver supervision, the adequacy of facility staffing levels, and a consideration of the scope of the individual employee's authority; and\n(3) whether the facility or individual followed professional standards in exercising professional judgment.\n(g) When substantiated maltreatment is determined to have been committed by an individual who is also the facility license holder, both the individual and the facility must be determined responsible for the maltreatment, and both the background study disqualification standards under section 245C.15, subdivision 4, and the licensing actions under section 245A.06 or 245A.07 apply.\n(h) The lead investigative agency shall complete its final disposition within 60 calendar days. If the lead investigative agency is unable to complete its final disposition within 60 calendar days, the lead investigative agency shall notify the following persons provided that the notification will not endanger the vulnerable adult or hamper the investigation: (1) the vulnerable adult or the vulnerable adult's guardian or health care agent, when known, if the lead investigative agency knows them to be aware of the investigation; and (2) the facility, where applicable. The notice shall contain the reason for the delay and the projected completion date. If the lead investigative agency is unable to complete its final disposition by a subsequent projected completion date, the lead investigative agency shall again notify the vulnerable adult or the vulnerable adult's guardian or health care agent, when known if the lead investigative agency knows them to be aware of the investigation, and the facility, where applicable, of the reason for the delay and the revised projected completion date provided that the notification will not endanger the vulnerable adult or hamper the investigation. The lead investigative agency must notify the health care agent of the vulnerable adult only if the health care agent's authority to make health care decisions for the vulnerable adult is currently effective under section 145C.06 and not suspended under section 524.5-310 and the investigation relates to a duty assigned to the health care agent by the principal. A lead investigative agency's inability to complete the final disposition within 60 calendar days or by any projected completion date does not invalidate the final disposition.\n(i) When the lead investigative agency is the Department of Health or the Department of Human Services, the lead investigative agency shall provide a copy of the public investigation memorandum under subdivision 12b, paragraph (b), clause (1), within ten calendar days of completing the final disposition to the following persons:\n(1) the vulnerable adult, or the vulnerable adult's guardian or health care agent, if known, unless the lead investigative agency knows that the notification would endanger the well-being of the vulnerable adult;\n(2) the reporter, if the reporter requested notification when making the report, provided this notification would not endanger the well-being of the vulnerable adult;\n(3) the person or facility alleged responsible for maltreatment, if known;\n(4) the facility; and\n(5) the ombudsman for long-term care, or the ombudsman for mental health and developmental disabilities, as appropriate.\n(j) When the lead investigative agency is a county agency, within ten calendar days of completing the final disposition, the lead investigative agency shall provide notification of the final disposition to the following persons:\n(1) the vulnerable adult, or the vulnerable adult's guardian or health care agent, if known, when the allegation is applicable to the authority of the vulnerable adult's guardian or health care agent, unless the agency knows that the notification would endanger the well-being of the vulnerable adult;\n(2) the individual determined responsible for maltreatment, if known; and\n(3) when the alleged incident involves a personal care assistant or provider agency, the personal care provider organization under section 256B.0659. Upon implementation of Community First Services and Supports (CFSS), this notification requirement applies to the CFSS support worker or CFSS agency under section 256B.85.\n(k) If, as a result of a reconsideration, review, or hearing, the lead investigative agency changes the final disposition, or if a final disposition is changed on appeal, the lead investigative agency shall notify the parties specified in paragraph (i).\n(l) The lead investigative agency shall notify the vulnerable adult who is the subject of the report or the vulnerable adult's guardian or health care agent, if known, and any person or facility determined to have maltreated a vulnerable adult, of their appeal or review rights under this section or section 256.021.\n(m) The lead investigative agency shall routinely provide investigation memoranda for substantiated reports to the appropriate licensing boards. These reports must include the names of substantiated perpetrators. The lead investigative agency may not provide investigative memoranda for inconclusive or false reports to the appropriate licensing boards unless the lead investigative agency's investigation gives reason to believe that there may have been a violation of the applicable professional practice laws. If the investigation memorandum is provided to a licensing board, the subject of the investigation memorandum shall be notified and receive a summary of the investigative findings.\n(n) In order to avoid duplication, licensing boards shall consider the findings of the lead investigative agency in their investigations if they choose to investigate. This does not preclude licensing boards from considering other information.\n(o) The lead investigative agency must provide to the commissioner of human services its final dispositions, including the names of all substantiated perpetrators. The commissioner of human services shall establish records to retain the names of substantiated perpetrators.\n(a) Except as provided under paragraph (e), any individual or facility which a lead investigative agency determines has maltreated a vulnerable adult, or the vulnerable adult or an interested person acting on behalf of the vulnerable adult, regardless of the lead investigative agency's determination, who contests the lead investigative agency's final disposition of an allegation of maltreatment, may request the lead investigative agency to reconsider its final disposition. The request for reconsideration must be submitted in writing to the lead investigative agency within 15 calendar days after receipt of notice of final disposition or, if the request is made by an interested person who is not entitled to notice, within 15 days after receipt of the notice by the vulnerable adult or the vulnerable adult's guardian or health care agent. If mailed, the request for reconsideration must be postmarked and sent to the lead investigative agency within 15 calendar days of the individual's or facility's receipt of the final disposition. If the request for reconsideration is made by personal service, it must be received by the lead investigative agency within 15 calendar days of the individual's or facility's receipt of the final disposition. An individual who was determined to have maltreated a vulnerable adult under this section and who was disqualified on the basis of serious or recurring maltreatment under sections 245C.14 and 245C.15, may request reconsideration of the maltreatment determination and the disqualification. The request for reconsideration of the maltreatment determination and the disqualification must be submitted in writing within 30 calendar days of the individual's receipt of the notice of disqualification under sections 245C.16 and 245C.17. If mailed, the request for reconsideration of the maltreatment determination and the disqualification must be postmarked and sent to the lead investigative agency within 30 calendar days of the individual's receipt of the notice of disqualification. If the request for reconsideration is made by personal service, it must be received by the lead investigative agency within 30 calendar days after the individual's receipt of the notice of disqualification.\n(b) Except as provided under paragraphs (e) and (f), if the lead investigative agency denies the request or fails to act upon the request within 15 working days after receiving the request for reconsideration, the person or facility entitled to a fair hearing under section 256.045, may submit to the commissioner of human services a written request for a hearing under that statute. The vulnerable adult, or an interested person acting on behalf of the vulnerable adult, may request a review by the Vulnerable Adult Maltreatment Review Panel under section 256.021 if the lead investigative agency denies the request or fails to act upon the request, or if the vulnerable adult or interested person contests a reconsidered disposition. The Vulnerable Adult Maltreatment Review Panel shall not conduct a review if the interested person making the request on behalf of the vulnerable adult is also the individual or facility alleged responsible for the maltreatment of the vulnerable adult. The lead investigative agency shall notify persons who request reconsideration of their rights under this paragraph. The request must be submitted in writing to the review panel and a copy sent to the lead investigative agency within 30 calendar days of receipt of notice of a denial of a request for reconsideration or of a reconsidered disposition. The request must specifically identify the aspects of the lead investigative agency determination with which the person is dissatisfied.\n(c) If, as a result of a reconsideration or review, the lead investigative agency changes the final disposition, it shall notify the parties specified in subdivision 9c, paragraph (i).\n(d) For purposes of this subdivision, \"interested person acting on behalf of the vulnerable adult\" means a person designated in writing by the vulnerable adult to act on behalf of the vulnerable adult, or a legal guardian or conservator or other legal representative, a proxy or health care agent appointed under chapter 145B or 145C, or an individual who is related to the vulnerable adult, as defined in section 245A.02, subdivision 13.\n(e) If an individual was disqualified under sections 245C.14 and 245C.15, on the basis of a determination of maltreatment, which was serious or recurring, and the individual has requested reconsideration of the maltreatment determination under paragraph (a) and reconsideration of the disqualification under sections 245C.21 to 245C.27, reconsideration of the maltreatment determination and requested reconsideration of the disqualification shall be consolidated into a single reconsideration. If reconsideration of the maltreatment determination is denied and the individual remains disqualified following a reconsideration decision, the individual may request a fair hearing under section 256.045. If an individual requests a fair hearing on the maltreatment determination and the disqualification, the scope of the fair hearing shall include both the maltreatment determination and the disqualification.\n(f) If a maltreatment determination or a disqualification based on serious or recurring maltreatment is the basis for a denial of a license under section 245A.05 or a licensing sanction under section 245A.07, the license holder has the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. As provided for under section 245A.08, the scope of the contested case hearing must include the maltreatment determination, disqualification, and licensing sanction or denial of a license. In such cases, a fair hearing must not be conducted under section 256.045. Except for family child care and child foster care, reconsideration of a maltreatment determination under this subdivision, and reconsideration of a disqualification under section 245C.22, must not be conducted when:\n(1) a denial of a license under section 245A.05, or a licensing sanction under section 245A.07, is based on a determination that the license holder is responsible for maltreatment or the disqualification of a license holder based on serious or recurring maltreatment;\n(2) the denial of a license or licensing sanction is issued at the same time as the maltreatment determination or disqualification; and\n(3) the license holder appeals the maltreatment determination or disqualification, and denial of a license or licensing sanction.\nNotwithstanding clauses (1) to (3), if the license holder appeals the maltreatment determination or disqualification, but does not appeal the denial of a license or a licensing sanction, reconsideration of the maltreatment determination shall be conducted under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of the disqualification shall be conducted under section 245C.22. In such cases, a fair hearing shall also be conducted as provided under sections 245C.27, 260E.33, and 626.557, subdivision 9d.\nIf the disqualified subject is an individual other than the license holder and upon whom a background study must be conducted under chapter 245C, the hearings of all parties may be consolidated into a single contested case hearing upon consent of all parties and the administrative law judge.\n(g) Until August 1, 2002, an individual or facility that was determined by the commissioner of human services or the commissioner of health to be responsible for neglect under section 626.5572, subdivision 17, after October 1, 1995, and before August 1, 2001, that believes that the finding of neglect does not meet an amended definition of neglect may request a reconsideration of the determination of neglect. The commissioner of human services or the commissioner of health shall mail a notice to the last known address of individuals who are eligible to seek this reconsideration. The request for reconsideration must state how the established findings no longer meet the elements of the definition of neglect. The commissioner shall review the request for reconsideration and make a determination within 15 calendar days. The commissioner's decision on this reconsideration is the final agency action.\n(1) For purposes of compliance with the data destruction schedule under subdivision 12b, paragraph (d), when a finding of substantiated maltreatment has been changed as a result of a reconsideration under this paragraph, the date of the original finding of a substantiated maltreatment must be used to calculate the destruction date.\n(2) For purposes of any background studies under chapter 245C, when a determination of substantiated maltreatment has been changed as a result of a reconsideration under this paragraph, any prior disqualification of the individual under chapter 245C that was based on this determination of maltreatment shall be rescinded, and for future background studies under chapter 245C the commissioner must not use the previous determination of substantiated maltreatment as a basis for disqualification or as a basis for referring the individual's maltreatment history to a health-related licensing board under section 245C.31.\n(a) The commissioners of health, human services, and public safety shall cooperate in the development of a joint program for education of lead investigative agency investigators in the appropriate techniques for investigation of complaints of maltreatment. This program must be developed by July 1, 1996. The program must include but need not be limited to the following areas: (1) information collection and preservation; (2) analysis of facts; (3) levels of evidence; (4) conclusions based on evidence; (5) interviewing skills, including specialized training to interview people with unique needs; (6) report writing; (7) coordination and referral to other necessary agencies such as law enforcement and judicial agencies; (8) human relations and cultural diversity; (9) the dynamics of adult abuse and neglect within family systems and the appropriate methods for interviewing relatives in the course of the assessment or investigation; (10) the protective social services that are available to protect alleged victims from further abuse, neglect, or financial exploitation; (11) the methods by which lead investigative agency investigators and law enforcement workers cooperate in conducting assessments and investigations in order to avoid duplication of efforts; and (12) data practices laws and procedures, including provisions for sharing data.\n(b) The commissioner of human services shall conduct an outreach campaign to promote the common entry point for reporting vulnerable adult maltreatment. This campaign shall use the Internet and other means of communication.\n(c) The commissioners of health, human services, and public safety shall offer at least annual education to others on the requirements of this section, on how this section is implemented, and investigation techniques.\n(d) The commissioner of human services, in coordination with the commissioner of public safety shall provide training for the common entry point staff as required in this subdivision and the program courses described in this subdivision, at least four times per year. At a minimum, the training shall be held twice annually in the seven-county metropolitan area and twice annually outside the seven-county metropolitan area. The commissioners shall give priority in the program areas cited in paragraph (a) to persons currently performing assessments and investigations pursuant to this section.\n(e) The commissioner of public safety shall notify in writing law enforcement personnel of any new requirements under this section. The commissioner of public safety shall conduct regional training for law enforcement personnel regarding their responsibility under this section.\n(f) Each lead investigative agency investigator must complete the education program specified by this subdivision within the first 12 months of work as a lead investigative agency investigator.\nA lead investigative agency investigator employed when these requirements take effect must complete the program within the first year after training is available or as soon as training is available.\nAll lead investigative agency investigators having responsibility for investigation duties under this section must receive a minimum of eight hours of continuing education or in-service training each year specific to their duties under this section.\n(a) When the common entry point refers a report to the county social service agency as the lead investigative agency or makes a referral to the county social service agency for emergency adult protective services, or when another lead investigative agency requests assistance from the county social service agency for adult protective services, the county social service agency shall immediately assess and offer emergency and continuing protective social services for purposes of preventing further maltreatment and for safeguarding the welfare of the maltreated vulnerable adult. The county shall use standardized tools and the data system made available by the commissioner. The information entered by the county into the standardized tool must be accessible to the Department of Human Services. In cases of suspected sexual abuse, the county social service agency shall immediately arrange for and make available to the vulnerable adult appropriate medical examination and treatment. When necessary in order to protect the vulnerable adult from further harm, the county social service agency shall seek authority to remove the vulnerable adult from the situation in which the maltreatment occurred. The county social service agency may also investigate to determine whether the conditions which resulted in the reported maltreatment place other vulnerable adults in jeopardy of being maltreated and offer protective social services that are called for by its determination.\n(b) Within five business days of receipt of a report screened in by the county social service agency for investigation, the county social service agency shall determine whether, in addition to an assessment and services for the vulnerable adult, to also conduct an investigation for final disposition of the individual or facility alleged to have maltreated the vulnerable adult.\n(c) The county social service agency must investigate for a final disposition the individual or facility alleged to have maltreated a vulnerable adult for each report accepted as lead investigative agency involving an allegation of abuse, caregiver neglect that resulted in harm to the vulnerable adult, financial exploitation that may be criminal, or an allegation against a caregiver under chapter 256B.\n(d) An investigating county social service agency must make a final disposition for any allegation when the county social service agency determines that a final disposition may safeguard a vulnerable adult or may prevent further maltreatment.\n(e) If the county social service agency learns of an allegation listed in paragraph (c) after the determination in paragraph (a), the county social service agency must change the initial determination and conduct an investigation for final disposition of the individual or facility alleged to have maltreated the vulnerable adult.\n(f) County social service agencies may enter facilities and inspect and copy records as part of an investigation. The county social service agency has access to not public data, as defined in section 13.02, and medical records under sections 144.291 to 144.298, that are maintained by facilities to the extent necessary to conduct its investigation. The inquiry is not limited to the written records of the facility, but may include every other available source of information.\n(g) When necessary in order to protect a vulnerable adult from serious harm, the county social service agency shall immediately intervene on behalf of that adult to help the family, vulnerable adult, or other interested person by seeking any of the following:\n(1) a restraining order or a court order for removal of the perpetrator from the residence of the vulnerable adult pursuant to section 518B.01;\n(2) the appointment of a guardian or conservator pursuant to sections 524.5-101 to 524.5-502, or guardianship or conservatorship pursuant to chapter 252A;\n(3) replacement of a guardian or conservator suspected of maltreatment and appointment of a suitable person as guardian or conservator, pursuant to sections 524.5-101 to 524.5-502; or\n(4) a referral to the prosecuting attorney for possible criminal prosecution of the perpetrator under chapter 609.\nThe expenses of legal intervention must be paid by the county in the case of indigent persons, under section 524.5-502 and chapter 563.\nIn proceedings under sections 524.5-101 to 524.5-502, if a suitable relative or other person is not available to petition for guardianship or conservatorship, a county employee shall present the petition with representation by the county attorney. The county shall contract with or arrange for a suitable person or organization to provide ongoing guardianship services. If the county presents evidence to the court exercising probate jurisdiction that it has made a diligent effort and no other suitable person can be found, a county employee may serve as guardian or conservator. The county shall not retaliate against the employee for any action taken on behalf of the person subject to guardianship or conservatorship, even if the action is adverse to the county's interest. Any person retaliated against in violation of this subdivision shall have a cause of action against the county and shall be entitled to reasonable attorney fees and costs of the action if the action is upheld by the court.\n[Repealed, 1995 c 229 art 1 s 24]\n(a) Each lead investigative agency shall develop guidelines for prioritizing reports for investigation.\n(b) When investigating a report, the lead investigative agency shall conduct the following activities as appropriate:\n(1) interview of the vulnerable adult;\n(2) interview of the reporter and others who may have relevant information;\n(3) interview of the individual or facility alleged responsible for maltreatment; and\n(4) review of records and pertinent documentation of the alleged incident.\n(c) The lead investigative agency shall conduct the following activities as appropriate to further the investigation, to prevent further maltreatment, or to safeguard the vulnerable adult:\n(1) examining the environment surrounding the alleged incident;\n(2) consulting with professionals; and\n(3) communicating with state, federal, tribal, and other agencies including:\n(i) service providers;\n(ii) case managers;\n(iii) ombudsmen; and\n(iv) support persons for the vulnerable adult.\n(d) The lead investigative agency may decide not to conduct an interview of a vulnerable adult, reporter, or witness under paragraph (b) if:\n(1) the vulnerable adult, reporter, or witness declines to have an interview with the agency or is unable to be contacted despite the agency's diligent attempts;\n(2) an interview of the vulnerable adult or reporter was conducted by law enforcement or a professional trained in forensic interview and an additional interview will not further the investigation;\n(3) an interview of the witness will not further the investigation; or\n(4) the agency has a reason to believe that the interview will endanger the vulnerable adult.\n[Repealed, 1995 c 229 art 1 s 24]\n[Repealed, 1995 c 229 art 1 s 24]\n[Repealed, 1995 c 229 art 1 s 24]\n[Repealed, 1983 c 273 s 8]\n(a) In performing any of the duties of this section as a lead investigative agency, the county social service agency shall maintain appropriate records. Data collected by the county social service agency under this section while providing adult protective services are welfare data under section 13.46. Investigative data collected under this section are confidential data on individuals or protected nonpublic data as defined under section 13.02. Notwithstanding section 13.46, subdivision 1, paragraph (a), data under this paragraph that are inactive investigative data on an individual who is a vendor of services are private data on individuals, as defined in section 13.02. The identity of the reporter may only be disclosed as provided in paragraph (c).\nData maintained by the common entry point are confidential data on individuals or protected nonpublic data as defined in section 13.02. Notwithstanding section 138.163, the common entry point shall maintain data for three calendar years after date of receipt and then destroy the data unless otherwise directed by federal requirements.\n(b) The commissioners of health and human services shall prepare an investigation memorandum for each report alleging maltreatment investigated under this section. County social service agencies must maintain private data on individuals but are not required to prepare an investigation memorandum. During an investigation by the commissioner of health or the commissioner of human services, data collected under this section are confidential data on individuals or protected nonpublic data as defined in section 13.02. Upon completion of the investigation, the data are classified as provided in clauses (1) to (3) and paragraph (c).\n(1) The investigation memorandum must contain the following data, which are public:\n(i) the name of the facility investigated;\n(ii) a statement of the nature of the alleged maltreatment;\n(iii) pertinent information obtained from medical or other records reviewed;\n(iv) the identity of the investigator;\n(v) a summary of the investigation's findings;\n(vi) statement of whether the report was found to be substantiated, inconclusive, false, or that no determination will be made;\n(vii) a statement of any action taken by the facility;\n(viii) a statement of any action taken by the lead investigative agency; and\n(ix) when a lead investigative agency's determination has substantiated maltreatment, a statement of whether an individual, individuals, or a facility were responsible for the substantiated maltreatment, if known.\nThe investigation memorandum must be written in a manner which protects the identity of the reporter and of the vulnerable adult and may not contain the names or, to the extent possible, data on individuals or private data listed in clause (2).\n(2) Data on individuals collected and maintained in the investigation memorandum are private data, including:\n(i) the name of the vulnerable adult;\n(ii) the identity of the individual alleged to be the perpetrator;\n(iii) the identity of the individual substantiated as the perpetrator; and\n(iv) the identity of all individuals interviewed as part of the investigation.\n(3) Other data on individuals maintained as part of an investigation under this section are private data on individuals upon completion of the investigation.\n(c) The name of the reporter must be confidential. The subject of the report may compel disclosure of the name of the reporter only with the consent of the reporter or upon a written finding by a court that the report was false and there is evidence that the report was made in bad faith. This subdivision does not alter disclosure responsibilities or obligations under the Rules of Criminal Procedure, except that where the identity of the reporter is relevant to a criminal prosecution, the district court shall do an in-camera review prior to determining whether to order disclosure of the identity of the reporter.\n(d) Notwithstanding section 138.163, data maintained under this section by the commissioners of health and human services must be maintained under the following schedule and then destroyed unless otherwise directed by federal requirements:\n(1) data from reports determined to be false, maintained for three years after the finding was made;\n(2) data from reports determined to be inconclusive, maintained for four years after the finding was made;\n(3) data from reports determined to be substantiated, maintained for seven years after the finding was made; and\n(4) data from reports which were not investigated by a lead investigative agency and for which there is no final disposition, maintained for three years from the date of the report.\n(e) The commissioners of health and human services shall annually publish on their websites the number and type of reports of alleged maltreatment involving licensed facilities reported under this section, the number of those requiring investigation under this section, and the resolution of those investigations.\n(f) Each lead investigative agency must have a record retention policy.\n(g) Lead investigative agencies, county agencies responsible for adult protective services, prosecuting authorities, and law enforcement agencies may exchange not public data, as defined in section 13.02, with a tribal agency, facility, service provider, vulnerable adult, primary support person for a vulnerable adult, state licensing board, federal or state agency, the ombudsman for long-term care, or the ombudsman for mental health and developmental disabilities, if the agency or authority providing the data determines that the data are pertinent and necessary to prevent further maltreatment of a vulnerable adult, to safeguard a vulnerable adult, or for an investigation under this section. Data collected under this section must be made available to prosecuting authorities and law enforcement officials, local county agencies, and licensing agencies investigating the alleged maltreatment under this section. The lead investigative agency shall exchange not public data with the vulnerable adult maltreatment review panel established in section 256.021 if the data are pertinent and necessary for a review requested under that section. Notwithstanding section 138.17, upon completion of the review, not public data received by the review panel must be destroyed.\n(h) Each lead investigative agency shall keep records of the length of time it takes to complete its investigations.\n(i) A lead investigative agency may notify other affected parties and their authorized representative if the lead investigative agency has reason to believe maltreatment has occurred and determines the information will safeguard the well-being of the affected parties or dispel widespread rumor or unrest in the affected facility.\n(j) Under any notification provision of this section, where federal law specifically prohibits the disclosure of patient identifying information, a lead investigative agency may not provide any notice unless the vulnerable adult has consented to disclosure in a manner which conforms to federal requirements.\n[Repealed, 1995 c 229 art 1 s 24]\n(a) Each facility, except home health agencies and personal care attendant services providers, shall establish and enforce an ongoing written abuse prevention plan. The plan shall contain an assessment of the physical plant, its environment, and its population identifying factors which may encourage or permit abuse, and a statement of specific measures to be taken to minimize the risk of abuse. The plan shall comply with any rules governing the plan promulgated by the licensing agency.\n(b) Each facility, including a home health care agency and personal care attendant services providers, shall develop an individual abuse prevention plan for each vulnerable adult residing there or receiving services from them. The plan shall contain an individualized assessment of: (1) the person's susceptibility to abuse by other individuals, including other vulnerable adults; (2) the person's risk of abusing other vulnerable adults; and (3) statements of the specific measures to be taken to minimize the risk of abuse to that person and other vulnerable adults. For the purposes of this paragraph, the term \"abuse\" includes self-abuse.\n(c) If the facility, except home health agencies and personal care attendant services providers, knows that the vulnerable adult has committed a violent crime or an act of physical aggression toward others, the individual abuse prevention plan must detail the measures to be taken to minimize the risk that the vulnerable adult might reasonably be expected to pose to visitors to the facility and persons outside the facility, if unsupervised. Under this section, a facility knows of a vulnerable adult's history of criminal misconduct or physical aggression if it receives such information from a law enforcement authority or through a medical record prepared by another facility, another health care provider, or the facility's ongoing assessments of the vulnerable adult.\n[Repealed, 1995 c 229 art 1 s 24]\n[Repealed, 2014 c 262 art 4 s 9]\n(a) A facility or person shall not retaliate against any person who reports in good faith suspected maltreatment pursuant to this section, or against a vulnerable adult with respect to whom a report is made, because of the report.\n(b) In addition to any remedies allowed under sections 181.931 to 181.935, any facility or person which retaliates against any person because of a report of suspected maltreatment is liable to that person for actual damages, punitive damages up to $10,000, and attorney fees.\n(c) There shall be a rebuttable presumption that any adverse action, as defined below, within 90 days of a report, is retaliatory. For purposes of this clause, the term \"adverse action\" refers to action taken by a facility or person involved in a report against the person making the report or the person with respect to whom the report was made because of the report, and includes, but is not limited to:\n(1) discharge or transfer from the facility;\n(2) discharge from or termination of employment;\n(3) demotion or reduction in remuneration for services;\n(4) restriction or prohibition of access to the facility or its residents; or\n(5) any restriction of rights set forth in section 144.651.\nThe commissioner of human services shall maintain an aggressive program to educate those required to report, as well as the general public, about the requirements of this section using a variety of media. The commissioner of human services shall print and make available the form developed under subdivision 9.\n[Repealed, 1995 c 229 art 1 s 24]\n(a) A vulnerable adult who is a victim of financial exploitation as defined in section 626.5572, subdivision 9, has a cause of action against a person who committed the financial exploitation. In an action under this subdivision, the vulnerable adult is entitled to recover damages equal to three times the amount of compensatory damages or $10,000, whichever is greater.\n(b) In addition to damages under paragraph (a), the vulnerable adult is entitled to recover reasonable attorney fees and costs, including reasonable fees for the services of a guardian or conservator or guardian ad litem incurred in connection with a claim under this subdivision.\n(c) An action may be brought under this subdivision regardless of whether there has been a report or final disposition under this section or a criminal complaint or conviction related to the financial exploitation.\nWhen an appeal of a lead investigative agency determination results in a contested case hearing under chapter 245A or 245C, the administrative law judge shall notify the vulnerable adult who is the subject of the maltreatment determination and, if known, a guardian of the vulnerable adult appointed under section 524.5-310, or a health care agent designated by the vulnerable adult in a health care directive that is currently effective under section 145C.06, and whose authority to make health care decisions is not suspended under section 524.5-310, of the hearing. The notice must be sent by certified mail and inform the vulnerable adult of the right to file a signed written statement in the proceedings. A guardian or health care agent who prepares or files a written statement for the vulnerable adult must indicate in the statement that the person is the vulnerable adult's guardian or health care agent and sign the statement in that capacity. The vulnerable adult, the guardian, or the health care agent may file a written statement with the administrative law judge hearing the case no later than five business days before commencement of the hearing. The administrative law judge shall include the written statement in the hearing record and consider the statement in deciding the appeal. This subdivision does not limit, prevent, or excuse the vulnerable adult from being called as a witness testifying at the hearing or grant the vulnerable adult, the guardian, or health care agent a right to participate in the proceedings or appeal the administrative law judge's decision in the case. The lead investigative agency must consider including the vulnerable adult victim of maltreatment as a witness in the hearing. If the lead investigative agency determines that participation in the hearing would endanger the well-being of the vulnerable adult or not be in the best interests of the vulnerable adult, the lead investigative agency shall inform the administrative law judge of the basis for this determination, which must be included in the final order. If the administrative law judge is not reasonably able to determine the address of the vulnerable adult, the guardian, or the health care agent, the administrative law judge is not required to send a hearing notice under this subdivision.",
	"repealed": false
}