{
	"id": "260B.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.171",
	"title": "260B.171 RECORDS.",
	"text": "(a) The juvenile court judge shall keep such minutes and in such manner as the court deems necessary and proper. Except as provided in paragraph (b), the court shall keep and maintain records pertaining to delinquent adjudications until the person reaches the age of 28 years and shall release the records on an individual to another juvenile court that has jurisdiction of the juvenile, to a requesting adult court for purposes of sentencing, or to an adult court or juvenile court as required by the right of confrontation of either the United States Constitution or the Minnesota Constitution. The juvenile court shall provide, upon the request of any other juvenile court, copies of the records concerning adjudications involving the particular child. The court also may provide copies of records concerning delinquency adjudications, on request, to law enforcement agencies, probation officers, and corrections agents if the court finds that providing these records serves public safety or is in the best interests of the child. Juvenile court delinquency proceeding records of adjudications, court transcripts, and delinquency petitions, including any probable cause attachments that have been filed or police officer reports relating to a petition, must be released to requesting law enforcement agencies and prosecuting authorities for purposes of investigating and prosecuting violations of section 609.229, provided that psychological or mental health reports may not be included with those records. The agency receiving the records may release the records only as permitted under this section or authorized by law.\nThe court shall also keep an index in which files pertaining to juvenile matters shall be indexed under the name of the child. After the name of each file shall be shown the file number and, if ordered by the court, the book and page of the register in which the documents pertaining to such file are listed. The court shall also keep a register properly indexed in which shall be listed under the name of the child all documents filed pertaining to the child and in the order filed. The list shall show the name of the document and the date of filing thereof. The juvenile court legal records shall be deposited in files and shall include the petition, summons, notice, findings, orders, decrees, judgments, and motions and such other matters as the court deems necessary and proper. Unless otherwise provided by law, all court records shall be open at all reasonable times to the inspection of any child to whom the records relate, and to the child's parent and guardian.\n(b) The court shall retain records of the court finding that a juvenile committed an act that would be a felony- or gross misdemeanor level offense until the offender reaches the age of 28. If the offender commits a felony as an adult, or the court convicts a child as an extended jurisdiction juvenile, the court shall retain the juvenile records for as long as the records would have been retained if the offender had been an adult at the time of the juvenile offense. This paragraph does not apply unless the juvenile was provided counsel as required by section 260B.163, subdivision 2.\n(a) The juvenile court shall forward to the Bureau of Criminal Apprehension the following data in juvenile petitions involving felony- or gross misdemeanor-level offenses:\n(1) the name and birthdate of the juvenile, including any of the juvenile's known aliases or street names;\n(2) the act for which the juvenile was petitioned and date of the offense; and\n(3) the date and county where the petition was filed.\n(b) Upon completion of the court proceedings, the court shall forward the court's finding and case disposition to the bureau. The court shall specify whether:\n(1) the juvenile was referred to a diversion program;\n(2) the petition was dismissed, continued for dismissal, or continued without adjudication; or\n(3) the juvenile was adjudicated delinquent.\n(c) The juvenile court shall forward to the bureau, the Sentencing Guidelines Commission, and the Department of Corrections the following data on individuals convicted as extended jurisdiction juveniles:\n(1) the name and birthdate of the offender, including any of the juvenile's known aliases or street names;\n(2) the crime committed by the offender and the date of the crime;\n(3) the date and county of the conviction; and\n(4) the case disposition.\nThe court shall notify the bureau, the Sentencing Guidelines Commission, and the Department of Corrections whenever it executes an extended jurisdiction juvenile's adult sentence under section 260B.130, subdivision 5.\n(d) The juvenile court shall forward to the statewide supervision system described in section 241.065 the following data in juvenile petitions for individuals under supervision by probation agencies or in an out-of-home placement:\n(1) the name, address, birth date, race, and gender of the juvenile, including any of the juvenile's known aliases or street names;\n(2) the act for which the juvenile was petitioned and date of offense;\n(3) the date and county where the petition was filed;\n(4) county, date of court action, and court file number of any adjudication or continuance;\n(5) the case disposition, including any conditions of supervision; and\n(6) the discharge or closing date and reason for the case under supervision.\n(e) The bureau, Sentencing Guidelines Commission, and the Department of Corrections shall retain the extended jurisdiction juvenile data for as long as the data would have been retained if the offender had been an adult at the time of the offense. Data retained on individuals under this subdivision are private data under section 13.02, except that extended jurisdiction juvenile data becomes public data under section 13.87, subdivision 2, when the juvenile court notifies the bureau that the individual's adult sentence has been executed under section 260B.130, subdivision 5.\n(a) If a juvenile is enrolled in school, the juvenile's probation officer shall ensure that either a mailed notice or an electronic copy of the court's disposition order be transmitted to the superintendent of the juvenile's school district or the chief administrative officer of the juvenile's school if the juvenile has been adjudicated delinquent for committing an act on the school's property or an act:\n(1) that would be a violation of section 609.185 (first-degree murder); 609.19 (second-degree murder); 609.195 (third-degree murder); 609.20 (first-degree manslaughter); 609.205 (second-degree manslaughter); 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.221 (first-degree assault); 609.222 (second-degree assault); 609.223 (third-degree assault); 609.2231 (fourth-degree assault); 609.224 (fifth-degree assault); 609.2242 (domestic assault); 609.24 (simple robbery); 609.245 (aggravated robbery); 609.247 (carjacking); 609.25 (kidnapping); 609.255 (false imprisonment); 609.342 (first-degree criminal sexual conduct); 609.343 (second-degree criminal sexual conduct); 609.344 (third-degree criminal sexual conduct); 609.345 (fourth-degree criminal sexual conduct); 609.3451 (fifth-degree criminal sexual conduct); 609.498 (tampering with a witness); 609.561 (first-degree arson); 609.582, subdivision 1 or 2 (burglary); 609.713 (terroristic threats); or 609.749 (harassment or stalking), if committed by an adult; or Minnesota Statutes 2012, section 609.21;\n(2) that would be a violation of section 152.021 (first-degree controlled substance crime); 152.022 (second-degree controlled substance crime); 152.023 (third-degree controlled substance crime); 152.024 (fourth-degree controlled substance crime); 152.025 (fifth-degree controlled substance crime); 152.0261 (importing a controlled substance); 152.0262 (possession of substances with intent to manufacture methamphetamine); or 152.027 (other controlled substance offenses), if committed by an adult; or\n(3) that involved the possession or use of a dangerous weapon as defined in section 609.02, subdivision 6.\nWhen a disposition order is transmitted under this subdivision, the probation officer shall notify the juvenile's parent or legal guardian that the disposition order has been shared with the juvenile's school.\n(b) In addition, the juvenile's probation officer may transmit a copy of the court's disposition order to the superintendent of the juvenile's school district or the chief administrative officer of the juvenile's school if the juvenile has been adjudicated delinquent for offenses not listed in paragraph (a) and placed on probation. The probation officer shall notify the superintendent or chief administrative officer when the juvenile is discharged from probation.\n(c) The disposition order must be accompanied by a notice to the school that the school may obtain additional information from the juvenile's probation officer with the consent of the juvenile or the juvenile's parents, as applicable. The disposition order must be maintained, shared, or released only as provided in section 121A.75.\n(d) The juvenile's probation officer shall maintain a record of disposition orders released under this subdivision and the basis for the release.\n(e) No later than September 1, 2002, the criminal and juvenile justice information policy group, in consultation with representatives of probation officers and educators, shall prepare standard forms for use by juvenile probation officers in forwarding information to schools under this subdivision and in maintaining a record of the information that is released. The group shall provide a copy of any forms or procedures developed under this paragraph to the legislature by January 15, 2003.\n(f) As used in this subdivision, \"school\" means a charter school or a school as defined in section 120A.22, subdivision 4, except a home school.\n(a) Legal records arising from proceedings or portions of proceedings that are public under section 260B.163, subdivision 1, are open to public inspection.\n(b) Except as otherwise provided by this section, none of the records of the juvenile court and none of the records relating to an appeal from a nonpublic juvenile court proceeding, except the written appellate opinion, shall be open to public inspection or their contents disclosed except:\n(1) by order of a court; or\n(2) as required by chapter 245C or sections 245A.04, 611A.03, 611A.04, 611A.06, and 629.73.\n(c) The victim of any alleged delinquent act may, upon the victim's request, obtain the following information, unless it reasonably appears that the request is prompted by a desire on the part of the requester to engage in unlawful activities:\n(1) the name and age of the juvenile;\n(2) the act for which the juvenile was petitioned and date of the offense; and\n(3) the disposition, including, but not limited to, dismissal of the petition, diversion, probation and conditions of probation, detention, fines, or restitution.\n(d) The records of juvenile probation officers and county home schools are records of the court for the purposes of this subdivision. Court services data relating to delinquent acts that are contained in records of the juvenile court may be released as allowed under section 13.84, subdivision 6. This subdivision applies to all proceedings under this chapter, including appeals from orders of the juvenile court, except that this subdivision does not apply to proceedings under section 260B.335 or 260B.425 when the proceeding involves an adult defendant. The court shall maintain the confidentiality of adoption files and records in accordance with the provisions of laws relating to adoptions. In juvenile court proceedings any report or social history furnished to the court shall be open to inspection by the attorneys of record and the guardian ad litem a reasonable time before it is used in connection with any proceeding before the court.\n(e) When a judge of a juvenile court, or duly authorized agent of the court, determines under a proceeding under this chapter that a child has violated a state or local law, ordinance, or regulation pertaining to the operation of a motor vehicle on streets and highways, except parking violations, the judge or agent shall immediately report the violation to the commissioner of public safety. The report must be made on a form provided by the Department of Public Safety and must contain the information required under section 169.95.\n(f) A county attorney may give a law enforcement agency that referred a delinquency matter to the county attorney a summary of the results of that referral, including the details of any juvenile court disposition.\n(a) Except for records relating to an offense where proceedings are public under section 260B.163, subdivision 1, peace officers' records of children who are or may be delinquent or who may be engaged in criminal acts shall be kept separate from records of persons 18 years of age or older and are private data but shall be disseminated: (1) by order of the juvenile court, (2) as required by section 121A.28, (3) as authorized under section 13.82, subdivision 2, (4) to the child or the child's parent or guardian unless disclosure of a record would interfere with an ongoing investigation, (5) to the Minnesota Crime Victims Reimbursement Board as required by section 611A.56, subdivision 2, clause (6), for the purpose of processing claims for crime victims reimbursement, or (6) as otherwise provided in this subdivision. Except as provided in paragraph (c), no photographs of a child taken into custody may be taken without the consent of the juvenile court unless the child is alleged to have violated section 169A.20. Peace officers' records containing data about children who are victims of crimes or witnesses to crimes must be administered consistent with section 13.82, subdivisions 2, 3, 6, and 17. Any person violating any of the provisions of this subdivision shall be guilty of a misdemeanor.\nIn the case of computerized records maintained about juveniles by peace officers, the requirement of this subdivision that records about juveniles must be kept separate from adult records does not mean that a law enforcement agency must keep its records concerning juveniles on a separate computer system. Law enforcement agencies may keep juvenile records on the same computer as adult records and may use a common index to access both juvenile and adult records so long as the agency has in place procedures that keep juvenile records in a separate place in computer storage and that comply with the special data retention and other requirements associated with protecting data on juveniles.\n(b) Nothing in this subdivision prohibits the exchange of information by law enforcement agencies if the exchanged information is pertinent and necessary for law enforcement purposes.\n(c) A photograph may be taken of a child taken into custody pursuant to section 260B.175, subdivision 1, clause (b), provided that the photograph must be destroyed when the child reaches the age of 19 years. The commissioner of corrections may photograph juveniles whose legal custody is transferred to the commissioner. Photographs of juveniles authorized by this paragraph may be used only for institution management purposes, case supervision by parole agents, and to assist law enforcement agencies to apprehend juvenile offenders. The commissioner shall maintain photographs of juveniles in the same manner as juvenile court records and names under this section.\n(d) Traffic investigation reports are open to inspection by a person who has sustained physical harm or economic loss as a result of the traffic accident. Identifying information on juveniles who are parties to traffic accidents may be disclosed as authorized under section 13.82, subdivision 6, and accident reports required under section 169.09 may be released under section 169.09, subdivision 13, unless the information would identify a juvenile who was taken into custody or who is suspected of committing an offense that would be a crime if committed by an adult, or would associate a juvenile with the offense, and the offense is not an adult court traffic offense under section 260B.225.\n(e) The head of a law enforcement agency or a person specifically given the duty by the head of the law enforcement agency shall notify the superintendent or chief administrative officer of a juvenile's school of an incident occurring within the agency's jurisdiction if:\n(1) the agency has probable cause to believe that the juvenile has committed an offense that would be a crime if committed as an adult, that the victim of the offense is a student or staff member of the school, and that notice to the school is reasonably necessary for the protection of the victim; or\n(2) the agency has probable cause to believe that the juvenile has committed an offense described in subdivision 3, paragraph (a), clauses (1) to (3), that would be a crime if committed by an adult, regardless of whether the victim is a student or staff member of the school.\nA law enforcement agency is not required to notify the school under this paragraph if the agency determines that notice would jeopardize an ongoing investigation. For purposes of this paragraph, \"school\" means a public or private elementary, middle, secondary, or charter school.\n(f) In any county in which the county attorney operates or authorizes the operation of a juvenile prepetition or pretrial diversion program, a law enforcement agency or county attorney's office may provide the juvenile diversion program with data concerning a juvenile who is a participant in or is being considered for participation in the program.\n(g) Upon request of a local social services agency, peace officer records of children who are or may be delinquent or who may be engaged in criminal acts may be disseminated to the agency to promote the best interests of the subject of the data.\n(h) Upon written request, the prosecuting authority shall release investigative data collected by a law enforcement agency to the victim of a criminal act or alleged criminal act or to the victim's legal representative, except as otherwise provided by this paragraph. Data shall not be released if:\n(1) the release to the individual subject of the data would be prohibited under section 13.821; or\n(2) the prosecuting authority reasonably believes:\n(i) that the release of that data will interfere with the investigation; or\n(ii) that the request is prompted by a desire on the part of the requester to engage in unlawful activities.\nAn attorney representing a child, parent, or guardian ad litem in a proceeding under this chapter shall be given access to records, local social services agency files, and reports which form the basis of any recommendation made to the court. An attorney does not have access under this subdivision to the identity of a person who made a report under chapter 260E. The court may issue protective orders to prohibit an attorney from sharing a specified record or portion of a record with a client other than a guardian ad litem.\nIf a prosecutor has probable cause to believe that a person has committed a gross misdemeanor violation of section 169A.20, and that a prior juvenile court adjudication forms, in part, the basis for the current violation, the prosecutor may file an application with the court having jurisdiction over the criminal matter attesting to this probable cause determination and seeking the relevant juvenile court records. The court shall transfer the application to the juvenile court where the requested records are maintained, and the juvenile court shall release to the prosecutor any records relating to the person's prior juvenile traffic adjudication, including a transcript, if any, of the court's advisory of the right to counsel and the person's exercise or waiver of that right.\nA person who receives access to juvenile court or peace officer records of children that are not accessible to the public may not release or disclose the records to any other person except as authorized by law. This subdivision does not apply to the child who is the subject of the records or the child's parent or guardian.\nThere shall be no direct public access to juvenile delinquency records maintained in electronic format in court information systems related to juvenile court proceedings that are public under section 260B.163, subdivision 1, except, unless the juvenile and the prosecutor agree otherwise, in cases where:\n(1) the prosecutor filed a motion for certification;\n(2) the prosecutor designated or requested that the proceeding be designated an extended jurisdiction juvenile prosecution; or\n(3) the juvenile has been adjudicated delinquent of a crime of violence as defined in section 624.712, subdivision 5, and not codified in chapter 152.",
	"repealed": false
}