{
	"id": "47.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.20",
	"title": "47.20 LENDING AUTHORITY OF FINANCIAL INSTITUTIONS.",
	"text": "Pursuant to rules the commissioner of commerce finds to be necessary and proper, if any, banks, savings banks, and savings associations organized under the laws of this state or the United States, trust companies, trust companies acting as fiduciaries, and other banking institutions subject to the supervision of the commissioner of commerce, and mortgagees or lenders approved or certified by the secretary of housing and urban development or approved or certified by the administrator of veterans affairs, or approved or certified by the administrator of the Farmers Home Administration or any successor, or approved or certified by the Federal Home Loan Mortgage Corporation, or approved or certified by the Federal National Mortgage Association, are authorized:\n(1) to make loans and advances of credit and purchases of obligations representing loans and advances of credit which are insured or guaranteed by the secretary of housing and urban development pursuant to the National Housing Act, as amended, or the administrator of veterans affairs pursuant to the Servicemen's Readjustment Act of 1944, as amended, or the administrator of the Farmers Home Administration or any successor pursuant to the Consolidated Farm and Rural Development Act, Public Law 87-128, as amended, and to obtain the insurance or guarantees;\n(2) to make loans secured by mortgages on real property and loans secured by a share or shares of stock or a membership certificate or certificates issued to a stockholder or member by a cooperative apartment corporation which the secretary of housing and urban development, the administrator of veterans affairs, or the administrator of the Farmers Home Administration or any successor has insured or guaranteed or made a commitment to insure or guarantee, and to obtain the insurance or guarantees;\n(3) to make, purchase, or participate in such loans and advances of credit; including reverse mortgage loans, notwithstanding anything in subdivision 4b, sections 47.58 and 334.01, and chapter 56 to the contrary; as would be eligible for purchase, in whole or in part, by the Federal National Mortgage Association or the Federal Home Loan Mortgage Corporation, but without regard to any limitation placed upon the maximum principal amount of an eligible loan;\n(4) to make, purchase or participate in such loans and advances of credit secured by mortgages on real property which are authorized or allowed by the Office of Thrift Supervision or the Office of the Comptroller of the Currency, or any successor to these federal agencies.\nFor the purposes of this section the terms defined in this subdivision have the meanings given them:\n(1) \"Actual closing costs\" mean reasonable charges for or sums paid for the following, whether or not retained by the mortgagee or lender:\n(a) Any insurance premiums including but not limited to premiums for title insurance, fire and extended coverage insurance, flood insurance, and private mortgage insurance, but excluding any charges or sums retained by the mortgagee or lender as self-insured retention.\n(b) Abstracting, title examination and search, and examination of public records.\n(c) The preparation and recording of any or all documents required by law or custom for closing a conventional or cooperative apartment loan.\n(d) Appraisal and survey of real property securing a conventional loan or real property owned by a cooperative apartment corporation of which a share or shares of stock or a membership certificate or certificates are to secure a cooperative apartment loan.\n(e) A single service charge, which includes any consideration, not otherwise specified herein as an \"actual closing cost\" paid by the borrower and received and retained by the lender for or related to the acquisition, making, refinancing or modification of a conventional or cooperative apartment loan, and also includes any consideration received by the lender for making a borrower's interest rate commitment or for making a borrower's loan commitment, whether or not an actual loan follows the commitment. The term service charge does not include forward commitment fees. The service charge shall not exceed one percent of the original bona fide principal amount of the conventional or cooperative apartment loan, except that in the case of a construction loan, the service charge shall not exceed two percent of the original bona fide principal amount of the loan. That portion of the service charge imposed because the loan is a construction loan shall be itemized and a copy of the itemization furnished the borrower. A lender shall not collect from a borrower the additional one percent service charge permitted for a construction loan if it does not perform the service for which the charge is imposed or if third parties perform and charge the borrower for the service for which the lender has imposed the charge.\n(f) Charges and fees necessary for or related to the transfer of real or personal property securing a conventional or cooperative apartment loan or the closing of a conventional or cooperative apartment loan paid by the borrower and received by any party other than the lender.\n(2) \"Contract for deed\" means an executory contract for the conveyance of real estate, the original principal amount of which is less than $300,000. A commitment for a contract for deed shall include an executed purchase agreement or earnest money contract wherein the seller agrees to finance any part or all of the purchase price by a contract for deed.\n(3) \"Conventional loan\" means a loan or advance of credit, other than a loan or advance of credit made by a credit union or made pursuant to section 334.011, to a noncorporate borrower in an original principal amount of less than or equal to the conforming loan limit established by the Federal Housing Finance Agency under the Housing and Recovery Act of 2018, Public Law 110-289, secured by a mortgage upon real property containing one or more residential units or upon which at the time the loan is made it is intended that one or more residential units are to be constructed, and which is not insured or guaranteed by the secretary of housing and urban development, by the administrator of veterans affairs, or by the administrator of the Farmers Home Administration, and which is not made pursuant to the authority granted in subdivision 1, clause (3) or (4). The term mortgage does not include contracts for deed or installment land contracts.\n(4) \"Cooperative apartment loan\" means a loan or advance of credit, other than a loan or advance of credit made by a credit union or made pursuant to section 334.011, to a noncorporate borrower in an original principal amount of less than $100,000, secured by a security interest on a share or shares of stock or a membership certificate or certificates issued to a stockholder or member by a cooperative apartment corporation, which may be accompanied by an assignment by way of security of the borrower's interest in the proprietary lease or occupancy agreement in property issued by the cooperative apartment corporation and which is not insured or guaranteed by the secretary of housing and urban development, by the administrator of veterans affairs, or by the administrator of the Farmers Home Administration.\n(5) \"Cooperative apartment corporation\" means a corporation or cooperative organized under chapter 308A or 317A, the shareholders or members of which are entitled, solely by reason of their ownership of stock or membership certificates in the corporation or association, to occupy one or more residential units in a building owned or leased by the corporation or association.\n(6) \"Forward commitment fee\" means a fee or other consideration paid to a lender for the purpose of securing a binding forward commitment by or through the lender to make conventional loans to two or more credit worthy purchasers, including future purchasers, of residential units, or a fee or other consideration paid to a lender for the purpose of securing a binding forward commitment by or through the lender to make conventional loans to two or more credit worthy purchasers, including future purchasers, of units to be created out of existing structures pursuant to chapter 515B, or a fee or other consideration paid to a lender for the purpose of securing a binding forward commitment by or through the lender to make cooperative apartment loans to two or more credit worthy purchasers, including future purchasers, of a share or shares of stock or a membership certificate or certificates in a cooperative apartment corporation; provided, that the forward commitment rate of interest does not exceed the maximum lawful rate of interest effective as of the date the forward commitment is issued by the lender.\n(7) \"Borrower's interest rate commitment\" means a binding commitment made by a lender to a borrower wherein the lender agrees that, if a conventional or cooperative apartment loan is made following issuance of and pursuant to the commitment, the conventional or cooperative apartment loan shall be made at a rate of interest not in excess of the rate of interest agreed to in the commitment, provided that the rate of interest agreed to in the commitment is not in excess of the maximum lawful rate of interest effective as of the date the commitment is issued by the lender to the borrower.\n(8) \"Borrower's loan commitment\" means a binding commitment made by a lender to a borrower wherein the lender agrees to make a conventional or cooperative apartment loan pursuant to the provisions, including the interest rate, of the commitment, provided that the commitment rate of interest does not exceed the maximum lawful rate of interest effective as of the date the commitment is issued and the commitment when issued and agreed to shall constitute a legally binding obligation on the part of the mortgagee or lender to make a conventional or cooperative apartment loan within a specified time period in the future at a rate of interest not exceeding the maximum lawful rate of interest effective as of the date the commitment is issued by the lender to the borrower; provided that a lender who issues a borrower's loan commitment pursuant to the provisions of a forward commitment is authorized to issue the borrower's loan commitment at a rate of interest not to exceed the maximum lawful rate of interest effective as of the date the forward commitment is issued by the lender.\n(9) \"Finance charge\" means the total cost of a conventional or cooperative apartment loan including extensions or grant of credit regardless of the characterization of the same and includes interest, finders fees, and other charges levied by a lender directly or indirectly against the person obtaining the conventional or cooperative apartment loan or against a seller of real property securing a conventional loan or a seller of a share or shares of stock or a membership certificate or certificates in a cooperative apartment corporation securing a cooperative apartment loan, or any other party to the transaction except any actual closing costs and any forward commitment fee. The finance charges plus the actual closing costs and any forward commitment fee, charged by a lender shall include all charges made by a lender other than the principal of the conventional or cooperative apartment loan. The finance charge, with respect to wraparound mortgages, shall be computed based upon the face amount of the wraparound mortgage note, which face amount shall consist of the aggregate of those funds actually advanced by the wraparound lender and the total outstanding principal balances of the prior note or notes which have been made a part of the wraparound mortgage note.\n(10) \"Lender\" means any person making a conventional or cooperative apartment loan, or any person arranging financing for a conventional or cooperative apartment loan. The term also includes the holder or assignee at any time of a conventional or cooperative apartment loan.\n(11) \"Loan yield\" means the annual rate of return obtained by a lender over the term of a conventional or cooperative apartment loan and shall be computed as the annual percentage rate as computed in accordance with sections 226.5 (b), (c), and (d) of Regulation Z, Code of Federal Regulations, title 12, part 226, but using the definition of finance charge provided for in this subdivision. For purposes of this section, with respect to wraparound mortgages, the rate of interest or loan yield shall be based upon the principal balance set forth in the wraparound note and mortgage and shall not include any interest differential or yield differential between the stated interest rate on the wraparound mortgage and the stated interest rate on the one or more prior mortgages included in the stated loan amount on a wraparound note and mortgage.\n(12) \"Person\" means an individual, corporation, business trust, partnership or association or any other legal entity.\n(13) \"Residential unit\" means any structure used principally for residential purposes or any portion thereof, and includes a unit in a common interest community, a nonowner occupied residence, and any other type of residence regardless of whether the unit is used as a principal residence, secondary residence, vacation residence, or residence of some other denomination.\n(14) \"Vendor\" means any person or persons who agree to sell real estate and finance any part or all of the purchase price by a contract for deed. The term also includes the holder or assignee at any time of the vendor's interest in a contract for deed.\nNotwithstanding the provisions of section 334.01, lenders are authorized to make conventional or cooperative apartment loans and purchases of obligations representing conventional or cooperative apartment loans pursuant to rules the commissioner of commerce finds to be necessary and proper, if any, at an interest rate not in excess of the maximum lawful interest rate prescribed in subdivision 4a. Contract for deed vendors are authorized to charge interest on contracts for deed at an interest rate not in excess of the maximum lawful interest rate prescribed in subdivision 4a.\n[Repealed, 1981 c 351 s 14]\n(a) No conventional or cooperative apartment loan or contract for deed shall be made at a rate of interest or loan yield in excess of a maximum lawful interest rate in an amount equal to the Federal National Mortgage Association posted yields on 30-year mortgage commitments for delivery within 60 days on standard conventional fixed-rate mortgages published in the Wall Street Journal for the last business day of the second preceding month plus four percentage points.\n(b) The maximum lawful interest rate applicable to a cooperative apartment loan or contract for deed at the time the loan or contract is made is the maximum lawful interest rate for the term of the cooperative apartment loan or contract for deed. Notwithstanding the provisions of section 334.01, a cooperative apartment loan or contract for deed may provide, at the time the loan or contract is made, for the application of specified different consecutive periodic interest rates to the unpaid principal balance, if no interest rate exceeds the maximum lawful interest rate applicable to the loan or contract at the time the loan or contract is made.\n(c) The maximum interest rate that can be charged on a conventional loan or a contract for deed, with a duration of ten years or less, for the purchase of real estate described in section 83.20, subdivisions 11 and 13, is three percentage points above the rate permitted under paragraph (a) or 15.75 percent per year, whichever is less. This paragraph is effective August 1, 1992.\n(d) Contracts for deed executed pursuant to a commitment for a contract for deed, or conventional or cooperative apartment loans made pursuant to a borrower's interest rate commitment or made pursuant to a borrower's loan commitment, or made pursuant to a commitment for conventional or cooperative apartment loans made upon payment of a forward commitment fee including a borrower's loan commitment issued pursuant to a forward commitment, which commitment provides for consummation within some future time following the issuance of the commitment may be consummated pursuant to the provisions, including the interest rate, of the commitment notwithstanding the fact that the maximum lawful rate of interest at the time the contract for deed or conventional or cooperative apartment loan is actually executed or made is less than the commitment rate of interest, provided the commitment rate of interest does not exceed the maximum lawful interest rate in effect on the date the commitment was issued. The refinancing of: (1) an existing conventional or cooperative apartment loan, (2) a loan insured or guaranteed by the secretary of housing and urban development, the administrator of veterans affairs, or the administrator of the Farmers Home Administration, or (3) a contract for deed by making a conventional or cooperative apartment loan is deemed to be a new conventional or cooperative apartment loan for purposes of determining the maximum lawful rate of interest under this subdivision. The renegotiation of a conventional or cooperative apartment loan or a contract for deed is deemed to be a new loan or contract for deed for purposes of paragraph (b) and for purposes of determining the maximum lawful rate of interest under this subdivision. A borrower's interest rate commitment or a borrower's loan commitment is deemed to be issued on the date the commitment is hand delivered by the lender to, or mailed to the borrower. A forward commitment is deemed to be issued on the date the forward commitment is hand delivered by the lender to, or mailed to the person paying the forward commitment fee to the lender, or to any one of them if there should be more than one. A commitment for a contract for deed is deemed to be issued on the date the commitment is initially executed by the contract for deed vendor or the vendor's authorized agent.\n(e) A contract for deed executed pursuant to a commitment for a contract for deed, or a loan made pursuant to a borrower's interest rate commitment, or made pursuant to a borrower's loan commitment, or made pursuant to a forward commitment for conventional or cooperative apartment loans made upon payment of a forward commitment fee including a borrower's loan commitment issued pursuant to a forward commitment at a rate of interest not in excess of the rate of interest authorized by this subdivision at the time the commitment was made continues to be enforceable in accordance with its terms until the indebtedness is fully satisfied.\nNotwithstanding any other provision of this chapter, including section 47.203, with respect to any conventional loan pursuant to which the mortgagee or lender shall receive any share of future appreciation of the mortgaged property, the following limitations shall apply:\n(1) The share of future appreciation of the mortgaged property which the lender or mortgagee may receive shall be limited to the proportionate amount produced by dividing the lesser of the acquisition cost or fair market value of the mortgaged property at the time the conventional loan is made into the original principal amount of the conventional loan; provided that in no event shall the annual rate of return obtained by the lender or mortgagee over the term of the conventional loan exceed the maximum lawful interest rate prescribed in subdivision 4a.\n(2) The lender or mortgagee shall not receive any share of future appreciation of the mortgaged property except (a) upon sale or transfer of the mortgaged property or any interest therein, whether by lease, deed, contract for deed or otherwise, whether for consideration or by gift or in the event of death, or otherwise, and whether voluntarily, involuntarily, or by operation of law, provided that if the mortgagor or mortgagors own the mortgaged property as cotenants, the transfer of the mortgaged property or any interest therein from one of such cotenants to another cotenant, whether by reason of death or otherwise, shall not be considered a sale or transfer, and a taking by eminent domain shall not be considered a sale or transfer unless it is a total taking for which payment is made for the full value of the mortgaged property, and a casualty loss shall not be considered a sale or transfer unless the proceeds of any insurance claim made in connection with such casualty loss are applied to prepay the principal of the conventional loan; or (b) upon the stated maturity of the loan, if the loan is made pursuant to or in connection with a specific housing program undertaken by a city, housing and rehabilitation authority, port authority, or other political subdivision or agency of the state.\n(3) Before the loan is made, the lender shall disclose to the mortgagor or mortgagors the terms and conditions upon which the lender or mortgagee shall receive any share of future appreciation of the mortgaged property.\nSubdivision 6a shall not be construed to prohibit the lender or mortgagee from declaring the entire debt of a conventional loan subject to this subdivision due and payable upon a sale or transfer of the mortgaged property or any interest therein, as provided in clause (2).\nThe commissioner may from time to time make, amend and rescind rules, forms and orders necessary to carry out the provisions of this subdivision. The provisions of this subdivision shall not apply to loans made pursuant to the program authorized by Laws 1981, chapter 97.\nA precomputed conventional loan or precomputed loan authorized in subdivision 1 shall provide for a refund of the precomputed finance charge according to the actuarial method if the loan is paid in full by cash, renewal or refinancing, or a new loan, one month or more before the final installment due date. The actuarial method for the purpose of this section is the amount of interest attributable to each fully unexpired monthly installment period of the loan contract following the date of prepayment in full, calculated as if the loan was made on an interest-bearing basis at the rate of interest provided for in the note based on the assumption that all payments were made according to schedule. A precomputed loan for the purpose of this section means a loan for which the debt is expressed as a sum comprised of the principal amount and the amount of interest for the entire term of the loan computed actuarially in advance on the assumption that all scheduled payments will be made when due, and does not include a loan for which interest is computed from time to time by application of a rate to the unpaid principal balance, interest-bearing loans, or simple-interest loans. For the purpose of calculating a refund for precomputed loans under this section, any portion of the finance charge for extending the first payment period beyond one month may be ignored. Nothing in this section shall be considered a limitation on discount points or other finance charges charged or collected in advance, and nothing in this section shall require a refund of the charges in the event of prepayment. Nothing in this section shall be considered to supersede section 47.204.\nIf the purpose of a conventional loan is to enable a borrower to purchase a one to four family dwelling for the borrower's primary residence, the lender shall consent to the subsequent transfer of the real estate if the existing borrower continues after transfer to be obligated for repayment of the entire remaining indebtedness. The lender shall release the existing borrower from all obligations under the loan instruments, if the transferee (1) meets the standards of credit worthiness normally used by persons in the business of making conventional loans, including but not limited to the ability of the transferee to make the loan payments and satisfactorily maintain the real estate used as collateral, and (2) executes an agreement in writing with the lender whereby the transferee assumes the obligations of the existing borrower under the loan instruments. Any such agreement shall not affect the priority, validity or enforceability of any loan instrument. A lender may charge a fee not in excess of one-tenth of one percent of the remaining unpaid principal balance in the event the loan or advance of credit is assumed by the transferee and the existing borrower continues after the transfer to be obligated for repayment of the entire assumed indebtedness. A lender may charge a fee not in excess of one percent of the remaining unpaid principal balance in the event the remaining indebtedness is assumed by the transferee and the existing borrower is released from all obligations under the loan instruments. This subdivision applies to all conventional loans made on or after June 1, 1979, and before May 9, 1981.\nIf the purpose of a conventional loan, or loan made pursuant to the authority granted in subdivision 1, clause (3) or (4), is to enable a borrower to purchase a one to four family dwelling for the borrower's primary residence, the lender shall consent to the subsequent transfer of the real estate and shall release the existing borrower from all obligations under the loan instruments, if the transferee (1) meets the standards of credit worthiness normally used by persons in the business of making conventional loans, including but not limited to the ability of the transferee to make the loan payments and satisfactorily maintain the real estate used as collateral, (2) executes an agreement in writing with the lender whereby the transferee assumes the obligations of the existing borrower under the loan instruments, and (3) executes an agreement in writing to pay interest on the remaining obligation at a new interest rate not to exceed the lender's current market rate of interest on similar loans at the time of the transfer, the most recently published monthly index of the Federal Home Loan Mortgage Corporation auction yields or the existing interest rate provided for by the terms of the note, whichever is greater. Any such agreement shall not affect the priority, validity or enforceability of any loan instrument.\nA lender making a conventional loan may assess and collect fees for late payments according to the provisions of section 47.59.\nConventional loans made on or after June 1, 1979, and before May 9, 1981, continue to be assumable under the provisions of Minnesota Statutes 1984, section 47.20, subdivision 6, until October 1, 1990.\n(1) Conventional or cooperative apartment loans made may contain provisions permitting discount points, if the loan does not provide a loan yield in excess of that permitted by subdivision 4a. The loan yield is computed using the amount resulting when the discount points are included in the finance charge.\n(2) Forward commitment fees are not discount points within the meaning of this subdivision.\n(3) No charges, fees, or sums permitted by this section which are paid to and received by a lender may be increased for purposes of evading compliance with this subdivision.\nA lender making a conventional loan shall comply with the following:\n(1) The promissory note and mortgage evidencing a conventional loan shall be printed in not less than the equivalent of 8-point type, .075 inch computer type, or elite-size typewritten numerals, or shall be legibly handwritten.\n(2) The mortgage evidencing a conventional loan shall contain a provision whereby the lender agrees to furnish the borrower with a conformed copy of the promissory note and mortgage at the time they are executed or within a reasonable time after recordation of the mortgage.\n(3) The mortgage evidencing a conventional loan shall contain a provision whereby the lender, if it intends to foreclose, agrees to give the borrower written notice of any default under the terms or conditions of the promissory note or mortgage, by sending the notice by certified mail to the address of the mortgaged property or such other address as the borrower may have designated in writing to the lender. The lender need not give the borrower the notice required by this paragraph if the default consists of the borrower selling the mortgaged property without the required consent of the lender. The mortgage shall further provide that the notice shall contain the following provisions:\n(a) the nature of the default by the borrower;\n(b) the action required to cure the default;\n(c) a date, not less than 30 days from the date the notice is mailed by which the default must be cured;\n(d) that failure to cure the default on or before the date specified in the notice may result in acceleration of the sums secured by the mortgage and sale of the mortgaged premises;\n(e) that the borrower has the right to reinstate the mortgage after acceleration; and\n(f) that the borrower has the right to bring a court action to assert the nonexistence of a default or any other defense of the borrower to acceleration and sale.\nFor purposes of this subdivision the term \"mortgagee\" shall mean all state banks and trust companies, national banking associations, state and federally chartered savings associations, mortgage banks, savings banks, insurance companies, credit unions or assignees of the above.\n(a) Each mortgagee requiring funds of a mortgagor to be paid into an escrow, agency or similar account for the payment of taxes or homeowner's insurance premiums with respect to a mortgaged one-to-four family, owner-occupied residence located in this state, unless the account is required by federal law or regulation or maintained in connection with a conventional loan in an original principal amount in excess of 80 percent of the lender's appraised value of the residential unit at the time the loan is made or maintained in connection with loans insured or guaranteed by the secretary of housing and urban development, by the administrator of veterans affairs, or by the administrator of the Farmers Home Administration or any successor, shall calculate interest on such funds at a rate of not less than three percent per annum. Such interest shall be computed on the average monthly balance in such account on the first of each month for the immediately preceding 12 months of the calendar year or such other fiscal year as may be uniformly adopted by the mortgagee for such purposes and shall be annually credited to the remaining principal balance on the mortgage, or at the election of the mortgagee, paid to the mortgagor or credited to the mortgagor's account. If the interest exceeds the remaining balance, the excess shall be paid to the mortgagor or vendee. The requirement to pay interest shall apply to such accounts created in conjunction with mortgage loans made prior to July 1, 1996.\n(b) Unless the account is exempt from the requirements of paragraph (a), a mortgagee shall allow a mortgagor to elect to discontinue escrowing for taxes and homeowner's insurance after the seventh anniversary of the date of the mortgage, unless the mortgagor has been more than 30 days delinquent in the previous 12 months. This paragraph shall apply to accounts created prior to July 1, 1996, as well as to accounts created on or after July 1, 1996. The mortgagor's election shall be in writing. The lender or mortgage broker shall, with respect to mortgages made on or after August 1, 1997, notify an applicant for a mortgage of the applicant's rights under this paragraph. This notice shall be given at or prior to the closing of the mortgage loan and shall read substantially as follows:\n\"NOTICE OF RIGHT TO DISCONTINUE ESCROW\nIf your mortgage loan involves an escrow account for taxes and homeowner's insurance, you may have the right in five years to discontinue the account and pay your own taxes and homeowner's insurance. If you are eligible to discontinue the escrow account, you will be notified in five years.\"\nIf the escrow account has a negative balance or a shortage at the time the mortgagor requests discontinuance, the mortgagee is not obligated to allow discontinuance until the escrow account is balanced or the shortage has been repaid.\n(c) The mortgagee shall notify the mortgagor within 60 days after the seventh anniversary of the date of the mortgage if the right to discontinue the escrow account is in accordance with paragraph (b). For mortgage loans entered into, on or prior to July 1, 1989, the notice required by this paragraph shall be provided to the mortgagor by January 1, 1997.\n(d) Effective January 1, 1998, the requirements of paragraph (b), regarding the mortgagor's election to discontinue the escrow account, and paragraph (c), regarding notification to mortgagor, shall apply when the fifth anniversary of the date of the mortgage has been reached.\n(e) A mortgagee may require the mortgagor to reestablish the escrow account if the mortgagor has failed to make timely payments for two consecutive payment periods at any time during the remaining term of the mortgage, or if the mortgagor has failed to pay taxes or insurance premiums when due. A payment received during a grace period shall be deemed timely.\n(f) The mortgagee shall, subject to paragraph (b), return any funds remaining in the account to the mortgagor within 60 days after receipt of the mortgagor's written notice of election to discontinue the escrow account.\n(g) The mortgagee shall not charge a direct fee for the administration of the escrow account, nor shall the mortgagee charge a fee or other consideration for allowing the mortgagor to discontinue the escrow account.\nExcept as provided in subdivision 5, the provisions of this section may not be waived by any oral or written agreement executed by any person.\n[Repealed, 1Sp1985 c 13 s 376]\n[Repealed, 1Sp1985 c 13 s 376]\nAny conventional loan having an interest rate or loan yield in excess of the maximum lawful interest rate provided for in subdivision 4a shall be usurious and subject to the same penalties as a loan made in violation of section 334.01. Any lender intentionally violating any other provision of this section shall be fined not more than $100 for each offense.\nAny contract for deed or cooperative apartment loan having an interest rate in excess of the maximum lawful interest rate provided for in subdivision 4a is usurious. No contract for deed or cooperative apartment loan is unenforceable solely because the interest rate thereon is usurious. Persons who have paid usurious interest may recover an amount not to exceed five times the usurious portion of the interest paid under the contract for deed or cooperative apartment loan plus attorneys' fees from the person to whom the interest has been paid. The penalty provisions of chapter 334, do not apply to usurious contracts for deed or cooperative apartment loans.\n[Repealed, 1999 c 151 s 49]\n[Repealed, 1983 c 215 s 16; 1984 c 474 s 7; 1985 c 306 s 26; 1987 c 292 s 36; 1989 c 350 art 16 s 7]",
	"repealed": false
}