{
	"id": "298.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.75",
	"title": "298.75 AGGREGATE MATERIAL REMOVAL; PRODUCTION TAX.",
	"text": "Except as may otherwise be provided, the following words, when used in this section, shall have the meanings herein ascribed to them.\n(a) \"Aggregate material\" means:\n(1) nonmetallic natural mineral aggregate including, but not limited to sand, silica sand, gravel, crushed rock, limestone, granite, and borrow, but only if the borrow is transported on a public road, street, or highway, provided that nonmetallic aggregate material does not include dimension stone and dimension granite; and\n(2) taconite tailings, crushed rock, and architectural or dimension stone and dimension granite removed from a taconite mine or the site of a previously operated taconite mine.\nAggregate material must be measured or weighed after it has been extracted from the pit, quarry, or deposit.\n(b) \"Person\" means any individual, firm, partnership, corporation, organization, trustee, association, or other entity.\n(c) \"Operator\" means any person engaged in the business of removing aggregate material from the surface or subsurface of the soil, for the purpose of sale, either directly or indirectly, through the use of the aggregate material in a marketable product or service.\n(d) \"Extraction site\" means a pit, quarry, or deposit containing aggregate material and any contiguous property to the pit, quarry, or deposit which is used by the operator for stockpiling the aggregate material.\n(e) \"Importer\" means any person who buys aggregate material excavated from a site on which the tax under this section is not imposed and causes the aggregate material to be imported into a county in this state which imposes a tax on aggregate material.\n(f) \"County\" means a county imposing the tax under this section on December 31, 2014, or any other county whose board has voted after a public hearing to impose the tax under this section and has notified the commissioner of revenue of the imposition of the tax.\n(g) \"Borrow\" means granular borrow, consisting of durable particles of gravel and sand, crushed quarry or mine rock, crushed gravel or stone, or any combination thereof, the ratio of the portion passing the (#200) sieve divided by the portion passing the (1 inch) sieve may not exceed 20 percent by mass.\n(a) Except as provided in paragraph (e), a county that imposes the aggregate production tax shall impose upon every operator a production tax of 21.5 cents per cubic yard or 15 cents per ton of aggregate material excavated in the county except that the county board may decide not to impose this tax if it determines that in the previous year operators removed less than 20,000 tons or 14,000 cubic yards of aggregate material from that county. The tax shall not be imposed on aggregate material excavated in the county until the aggregate material is transported from the extraction site or sold, whichever occurs first. When aggregate material is stored in a stockpile within the state of Minnesota and a public highway, road or street is not used for transporting the aggregate material, the tax shall not be imposed until either when the aggregate material is sold, or when it is transported from the stockpile site, or when it is used from the stockpile, whichever occurs first.\n(b) Except as provided in paragraph (e), a county that imposes the aggregate production tax under paragraph (a) shall impose upon every importer a production tax of 21.5 cents per cubic yard or 15 cents per ton of aggregate material imported into the county. The tax shall be imposed when the aggregate material is imported from the extraction site or sold. When imported aggregate material is stored in a stockpile within the state of Minnesota and a public highway, road, or street is not used for transporting the aggregate material, the tax shall be imposed either when the aggregate material is sold, when it is transported from the stockpile site, or when it is used from the stockpile, whichever occurs first. The tax shall be imposed on an importer when the aggregate material is imported into the county that imposes the tax.\n(c) If the aggregate material is transported directly from the extraction site to a waterway, railway, or another mode of transportation other than a highway, road or street, the tax imposed by this section shall be apportioned equally between the county where the aggregate material is extracted and the county to which the aggregate material is originally transported. If that destination is not located in Minnesota, then the county where the aggregate material was extracted shall receive all of the proceeds of the tax.\n(d) A county, city, or town that receives revenue under this section is prohibited from imposing any additional host community fees on aggregate production within that county, city, or town.\n(e) A county that borders two other states and that is not contiguous to a county that imposes a tax under this section may impose the taxes under paragraphs (a) and (b) at the rate of ten cents per cubic yard or seven cents per ton. This paragraph expires December 31, 2024.\n(a) By the 14th day following the last day of each calendar quarter, every operator or importer shall make and file with the county auditor of the county in which the aggregate material is removed or imported, a correct report under oath, in such form and containing such information as the auditor shall require relative to the quantity of aggregate material removed or imported during the preceding calendar quarter. The report shall be accompanied by a remittance of the amount of tax due.\n(b) If any of the proceeds of the tax is to be apportioned as provided in subdivision 2, the operator or importer shall also include on the report any relevant information concerning the amount of aggregate material transported, the tax and the county of destination. The county auditor shall notify the county treasurer of the amount of such tax and the county to which it is due. The county treasurer shall remit the tax to the appropriate county within 30 days, except as provided in paragraph (c).\n(c) The proceeds of the tax on aggregate material as defined in subdivision 1, paragraph (a), clause (2), must be remitted to the commissioner of Iron Range resources and rehabilitation to be deposited in the taconite area environmental protection fund under section 298.223, and used for the purposes of that fund.\nIf the county auditor has not received the report by the 15th day after the last day of each calendar quarter from the operator or importer as required by subdivision 3 or has received an erroneous report, the county auditor shall estimate the amount of tax due and notify the operator or importer by registered mail of the amount of tax so estimated within the next 14 days. An operator or importer may, within 30 days from the date of mailing the notice, and upon payment of the amount of tax determined to be due, file in the office of the county auditor a written statement of objections to the amount of taxes determined to be due. The statement of objections shall be deemed to be a petition within the meaning of chapter 278, and shall be governed by sections 278.02 to 278.13.\nFailure to file the report and submit payment shall result in a penalty of $5 for each of the first 30 days, beginning on the 15th day after the last day of each calendar quarter, for which the report and payment is due and no statement of objection has been filed as provided in subdivision 4, and a penalty of $10 for each subsequent day shall be assessed against the operator or importer who is required to file the report. The penalties imposed by this subdivision shall be collected as part of the tax and credited to the county revenue fund. If neither the report nor a statement of objection has been filed after more than 60 days have elapsed from the date when the notice was sent, the operator or importer who is required to file the report is guilty of a misdemeanor.\nIt is a misdemeanor for any operator or importer to remove aggregate material from a pit, quarry, or deposit or for any importer to import aggregate material unless all taxes due under this section for all previous reporting periods have been paid or objections thereto have been filed pursuant to subdivision 4.\nIt is a misdemeanor for the operator or importer who is required to file a report to file a false report with intent to evade the tax.\n(a) All money collected as taxes under this section on aggregate material as defined in subdivision 1, paragraph (a), clause (1), shall be deposited in the county treasury and credited according to this subdivision.\n(b) The county auditor may retain an annual administrative fee of up to five percent of the total taxes collected in any year.\n(c) The balance of the taxes, after any deduction under paragraph (b), shall be credited as follows:\n(1) 42.5 percent to the county road and bridge fund for expenditure for the maintenance, construction and reconstruction of roads, highways and bridges;\n(2) 42.5 percent to the general fund of the city or town in which the mine is located, or to the county, if the mine is located in an unorganized town, to be expended for maintenance, construction and reconstruction of roads, highways and bridges; and\n(3) 15 percent to a special reserve fund which is hereby established, for expenditure for the restoration of abandoned pits, quarries, or deposits located within the county.\nIf there are no abandoned pits, quarries or deposits located within the county, this portion of the tax shall be used for any other unmet reclamation need or for conservation or other environmental needs.\nThe county auditor or its duly authorized agent may examine records, including computer records, maintained by an importer or operator. The term \"record\" includes, but is not limited to, all accounts of an importer or operator. The county auditor must have access at all reasonable times to inspect and copy all business records related to an importer's or operator's collection, transportation, and disposal of aggregate to the extent necessary to ensure that all aggregate material production taxes required to be paid have been remitted to the county. The records must be maintained by the importer or operator for no less than six years.\n(a) If the St. Louis County Board does not approve Laws 1997, chapter 231, article 8, section 12, as provided in Laws 1997, chapter 231, article 8, section 18, each of the following towns in St. Louis County may impose the aggregate materials tax under this section: the towns of Alden, Brevator, Canosia, Duluth, Fredenburg, Gnesen, Grand Lake, Industrial, Lakewood, Midway, Normanna, North Star, Rice Lake, and Solway.\n(b) For purposes of exercising the powers contained in this section, the \"town\" is deemed to be the \"county.\"\n(c) In those towns located in St. Louis County that impose the tax under this section, all provisions in this section shall apply to those towns, except that in lieu of the distribution of the tax proceeds under subdivision 7, all proceeds from this tax shall be retained by each of the towns that impose the tax.\n(d) A tax imposed under this subdivision is effective in the town that approves it the day after compliance by the town with the requirements of section 645.021, subdivision 3.\nMS 2006 [Never effective, 2006 c 259 art 12 s 14]\n(a) If Otter Tail County does not impose a tax under this section and approves imposition of the tax under this subdivision, the town of Scambler in Otter Tail County may impose the aggregate materials tax under this section.\n(b) For purposes of exercising the powers contained in this section, the \"town\" is deemed to be the \"county.\"\n(c) All provisions in this section apply to the town of Scambler, except that all proceeds of the tax must be retained by the town and used for the purposes described in subdivision 7.\n(d) If Otter Tail County imposes an aggregate materials tax under this section, the tax imposed by the town of Scambler under this subdivision is repealed on the effective date of the Otter Tail County tax.",
	"repealed": false
}