{
	"id": "473.512",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.512",
	"title": "473.512 PENSION EXCLUSION FOR CERTAIN LABOR SERVICE EMPLOYEES.",
	"text": "A member of a trade who is employed by the former metropolitan waste control commission, and on July 1, 1994, is employed by the council, on a permanent basis with trade union pension plan coverage pursuant to a collective bargaining agreement shall be excluded from coverage by the Minnesota State Retirement System if the member was first employed on or after June 1, 1977 or, if the member was first employed prior to June 1, 1977, has elected to be excluded from coverage by the Minnesota State Retirement System pursuant to subdivision 2, and has accepted a refund of contributions pursuant to subdivision 3.\nA member of a trade entitled under subdivision 1 to make an election of exclusion from pension coverage by the Minnesota State Retirement System may make the election of exclusion no later than August 1, 1977 on forms provided by the executive director of the Minnesota State Retirement System. The election of exclusion from coverage shall be a one time election irrevocable while employed in such capacity and shall have retroactive application to the first day of membership in the Minnesota State Retirement System.\nUpon electing to be excluded from coverage as provided in subdivision 2 and making a valid application, a member of a trade shall be entitled to a refund of both the accumulated employee and the employer contributions made pursuant to Minnesota Statutes 1976, section 352.04, subdivision 3, on behalf of the member plus interest at the rate of 3-1/2 percent per annum compounded annually from the date of commencement of coverage, computed to the first day of the month in which the refund is processed and shall be based on fiscal year balances. The application for the refund may be made without the waiting period provided for in section 352.22, subdivision 1. No repayment of a refund made under this section shall be permitted.",
	"repealed": false
}