{
	"id": "480.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.181",
	"title": "480.181 TRANSFER OF EMPLOYEES TO JUDICIAL BRANCH.",
	"text": "(a) District court referees, judicial officers, court reporters, law clerks, district administration staff, other than district administration staff in the Second and Fourth Judicial Districts, guardian ad litem program coordinators and staff, staff court interpreters in the Second Judicial District, court psychological services staff in the Fourth Judicial District, and other court employees under paragraph (b), are state employees and are governed by the judicial branch personnel rules adopted by the supreme court. The supreme court, in consultation with the Judicial Council, shall establish the salary range of these employees under the judicial branch personnel rules. In establishing the salary ranges, the supreme court shall consider differences in the cost of living in different areas of the state.\n(b) The court administrator and employees of the court administrator who are in the Fifth, Seventh, Eighth, or Ninth Judicial District are state employees. The court administrator and employees of the court administrator in the remaining judicial districts become state employees as follows:\n(1) effective July 1, 2003, for the Second and Fourth Judicial Districts;\n(2) effective July 1, 2004, for the First and Third Judicial Districts; and\n(3) effective July 1, 2005, for the Sixth and Tenth Judicial Districts.\n(a) Before a person is transferred to state employment under this section, the person may elect to do either or both of the following:\n(1) keep life insurance; hospital, medical, and dental insurance; and vacation and sick leave benefits and accumulated time provided by the county instead of receiving benefits from the state under the judicial branch personnel rules; or\n(2) remain a member of the general employees retirement plan of the Public Employees Retirement Association instead of joining the Minnesota State Retirement System.\nEmployees who make an election under clause (1) remain on the county payroll, but the state shall reimburse the county on a quarterly basis for the salary and cost of the benefits provided by the county. The state shall make the employer contribution on behalf of employees who make an election under clause (2) to the general employees retirement plan of the Public Employees Retirement Association or the employer contribution under section 353.27, subdivision 3c, paragraphs (c) and (d), to the general employees retirement fund of the Public Employees Retirement Association for any employees who were members of the former Minneapolis Employees Retirement Fund on June 24, 2010.\n(b) An employee who makes an election under paragraph (a), clause (1), may revoke the election, once, at any time, but if the employee revokes the election, the employee cannot make another election. An employee who makes an election under paragraph (a), clause (2), may revoke the election at any time within six months after the person becomes a state employee. Once an employee revokes this election, the employee cannot make another election.\n(c) The supreme court, after consultation with the Judicial Council, the commissioner of management and budget, and the executive directors of the Public Employees Retirement Association and the Minnesota State Retirement Association shall adopt procedures for making elections under this section.\n(d) The supreme court shall notify all affected employees of the options available under this section. The executive directors of the Public Employees Retirement Association and the Minnesota State Retirement System shall provide counseling to affected employees on the effect of making an election to remain a member of the Public Employees Retirement Association.\nA person who begins to receive benefits from the state under the judicial branch personnel rules under this section must receive credit for accumulated vacation and sick leave time, as certified by the county auditor and district administrator.\nA person who becomes a state employee under this section is considered to have begun employment with the state on the date the person became a county or judicial district employee to determine eligibility for benefits.\nWhenever a group of court employees is transferred from county to state funding, the provisions of this section shall apply.",
	"repealed": false
}