{
	"id": "15.0597",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.0597",
	"title": "15.0597 APPOINTMENTS TO MULTIMEMBER AGENCIES.",
	"text": "(a) As used in this section, the following terms shall have the meanings given them.\n(b) \"Agency\" means (1) a state board, commission, council, committee, authority, task force, including an advisory task force created under section 15.014 or 15.0593, a group created by executive order of the governor, or other similar multimember agency created by law and having statewide jurisdiction; and (2) the Metropolitan Council, metropolitan agency, Capitol Area Architectural and Planning Board, and any agency with a regional jurisdiction created in this state pursuant to an interstate compact.\n(c) \"Vacancy\" or \"vacant agency position\" means (1) a vacancy in an existing agency, or (2) a new, unfilled agency position. Vacancy does not mean (1) a vacant position on an agency composed exclusively of persons employed by a political subdivision or another agency, (2) a vacancy to be filled by a person required to have a specific title or position, (3) a vacancy that is to be filled through appointment of a legislator by a legislator or group of legislators, or (4) a position appointed by a private entity or individual, in the manner specified in the document creating the agency, unless otherwise provided.\n(d) \"Secretary\" means the secretary of state.\n(e) \"Appointing authority\" means the individual or entity with the specific authority to appoint open or direct appointment positions. This includes, but is not limited to, the governor, state agency commissioners, indigenous Tribal leaders, designated legislative leaders and local agency heads, persons who have been specifically delegated the authority to make those appointments, or private entities or persons as designated by the document creating the agency. Appointments should be evidenced by a document signed by the appointing authority's most senior official. Appointments that do not specify an appointing authority shall be made in the manner provided in section 4.04.\n(f) \"Direct appointments\" means: (1) the appointment of members to an agency, pursuant to a process not subject to this section; and (2) those members of an agency appointed through a process not subject to this section. Direct appointments must be provided for specifically in the documents creating the agency, whether enabling law, executive order, commissioner's order, or otherwise.\nThe chair of an existing agency or the chair's designee, or the appointing authority for the members of a newly created agency, shall provide the secretary, in an electronic format prepared and distributed by the secretary, with the following data pertaining to that agency:\n(1) the name of the agency, its mailing address, and telephone number;\n(2) the legal authority for the creation of the agency and the name of the person appointing agency members;\n(3) the powers and duties of the agency;\n(4) the number of authorized members, together with any prescribed restrictions on eligibility such as employment experience or geographical representation;\n(5) the dates of commencement and expiration of the membership terms and the expiration date of the agency, if any;\n(6) the compensation of members, and appropriations or other funds available to the agency;\n(7) the regular meeting schedule, if any, and approximate number of hours per month of meetings or other activities required of members;\n(8) the roster of current members, including mailing addresses, electronic mail addresses, and telephone numbers; and\n(9) a breakdown of the membership showing distribution by county, legislative district, and congressional district, and, only if the member has voluntarily supplied the information, the sex, political party preference or lack of party preference, race, veteran status, and national origin of the members.\nThe secretary may require the submission of data in accordance with this subdivision by electronic means. The publication requirement under clause (8) may be met by publishing a member's home or business address and telephone number, the address and telephone number of the agency to which the member is appointed, the member's electronic mail address, if provided, or any other information that would enable the public to communicate with the member.\nThe secretary of state shall provide for annual updating of the required data and shall annually arrange for the publication on the website of the secretary of state of the compiled data from all agencies on or about October 15 of each year. The compilation must be electronically delivered to the governor and the legislature. Paper copies of the compilation must be made available by the secretary to any interested person at cost, and copies must be available for viewing by interested persons. The chair of an agency who does not submit data required by this section or who does not notify the secretary of a vacancy in the agency, is not eligible for a per diem or expenses in connection with agency service until December 1 of the following year.\n(a) The chair of an existing agency, shall notify the secretary by electronic means of a vacancy scheduled to occur in the agency as a result of the expiration of membership terms at least 45 days before the vacancy occurs. The chair of an existing agency must notify the secretary of each vacancy occurring as a result of newly created agency positions and of every other vacancy occurring for any reason other than the expiration of membership terms as soon as possible upon learning of the vacancy and in any case within 15 days after the occurrence of the vacancy. The chair may submit vacancy notices by posting seat openings on the secretary of state's boards and commission's website.\n(b) If a vacancy is to be appointed by the governor, the chair must first notify the governor and receive permission to post the vacancy. Where a vacancy is created by resignation, the vacancy may not be posted until receipt and acceptance of the resignation of the incumbent as provided by section 351.01, subdivision 1, clause (2), is confirmed by the governor.\n(c) The appointing authority for newly created agencies shall give electronic notification to the secretary of all vacancies in the new agency within 15 days after the creation of the agency. The secretary may require the submission of notices required by this subdivision by electronic means.\n(d) The secretary shall publish monthly on the website of the secretary of state a list of all vacancies of which the secretary has been so notified. Only one notice of a vacancy shall be so published, unless the appointing authority rejects all applicants and requests the secretary to republish the notice of vacancy. One copy of the listing shall be made available at the office of the secretary to any interested person. The secretary shall distribute by mail or electronic means copies of the listings to requesting persons.\n(e) The listing for all vacancies scheduled to occur in the month of January shall be published on the website of the secretary of state together with the compilation of agency data required to be published pursuant to subdivision 3.\n(f) If a vacancy occurs within three months after an appointment is made to fill a regularly scheduled vacancy, the appointing authority may, upon notification by electronic means to the secretary, fill the vacancy by appointment from the list of persons submitting applications to fill the regularly scheduled vacancy.\nAny person may make a self-nomination for appointment to an agency vacancy by completing an application on a form prepared and distributed by the secretary. The secretary may provide for the submission of the application by electronic means. Any person or group of persons may, on the prescribed application form, nominate another person to be appointed to a vacancy so long as the person so nominated consents on the application form to the nomination. The application form shall specify the nominee's name, mailing address, electronic mail address, telephone number, preferred agency position sought, a statement that the nominee satisfies any legally prescribed qualifications, and any other information the nominating person feels would be helpful to the appointing authority. The nominating person has the option of indicating the nominee's sex, political party preference or lack thereof, status with regard to disability, race, veteran status, and national origin on the application form. The application form shall make the option known. If a person submits an application at the suggestion of an appointing authority, the person shall so indicate on the application form. Twenty-one days after publication of a vacancy on the website of the secretary of state pursuant to subdivision 4, the secretary shall submit electronic copies of all applications received for a position to the appointing authority charged with filling the vacancy. Applications received by the secretary shall be deemed to have expired one year after receipt of the application. An application for a particular agency position shall be deemed to be an application for all vacancies in that agency occurring prior to the expiration of the application and shall be public information.\n(a) In making an appointment to a vacant agency position, the appointing authority shall consider applications for positions in that agency supplied by the secretary. No appointing authority may appoint someone to a vacant agency position until five days after receipt of the applications for positions in that agency from the secretary as provided for in subdivision 5. At least five days before the date of appointment, the appointing authority shall issue a public announcement and inform the secretary by electronic means of the name of the person the appointing authority has appointed to fill the agency vacancy and the expiration date of that person's term.\n(b) No person may serve in a position until the appointing authority has submitted either (1) a signed notice of appointment or (2) the documents required by paragraph (e) to the secretary of state, and the term of the appointee may not commence on a date preceding the date of the signature on the notice of appointment or the paragraph (e) submission.\n(c) An oath of office for each appointee to an agency must be submitted to the secretary of state under section 358.05.\n(d) If the appointing authority intends to appoint a person other than one for whom an application was submitted pursuant to this section, the appointing authority shall complete an application form on behalf of the appointee and submit it to the secretary indicating on the application that it is submitted by the appointing authority.\n(e) An appointing authority making a direct appointment must submit a letter to the secretary of state stating the name of the person appointed, the agency and the specific seat to which they are appointed, contact information, the date on which the term begins, and length of the term.\n(f) No person may simultaneously occupy more than one position on the same agency board. Appointment or designation of a member as chair of an agency does not constitute a violation of this paragraph.\nTogether with the compilation required in subdivision 3, the secretary shall annually deliver to the governor and the legislature a report in an electronic format containing the following information:\n(1) the number of vacancies occurring in the preceding year;\n(2) the number of vacancies occurring as a result of scheduled ends of terms, unscheduled vacancies and the creation of new positions;\n(3) breakdowns by county, legislative district, and congressional district, and, if known, the sex, political party preference or lack thereof, status with regard to disability, race, veteran status, and national origin, for members whose agency membership terminated during the year and appointees to the vacant positions; and\n(4) the number of vacancies filled from applications submitted by (i) the appointing authorities for the positions filled, (ii) nominating persons and self-nominees who submitted applications at the suggestion of appointing authorities, and (iii) all others.\nThe commissioner of administration with the approval of the governor may determine that the administration of the open appointment process provided for in this section more properly belongs in another agency of the state. On making that determination, the commissioner may, on or after July 1, 1981, transfer this function to that agency by reorganization order.",
	"repealed": false
}