{
	"id": "524.2-606",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-606",
	"title": "524.2-606 NONADEMPTION OF SPECIFIC DEVISES; UNPAID PROCEEDS OF SALE, CONDEMNATION, OR INSURANCE; SALE BY CONSERVATOR OR GUARDIAN.",
	"text": "(a) A specific devisee has a right to the specifically devised property in the testator's estate at death and:\n(1) any balance of the purchase price, together with any security agreement, owing from a purchaser to the testator at death by reason of sale of the property;\n(2) any amount of a condemnation award for the taking of the property unpaid at death;\n(3) any proceeds unpaid at death on fire or casualty insurance on or other recovery for injury to the property; and\n(4) property owned by the testator at death and acquired as a result of foreclosure, or obtained in lieu of foreclosure, of the security interest for a specifically devised obligation.\n(b) If specifically devised property is sold or mortgaged by a conservator or guardian, by an agent acting within the authority of a durable power of attorney for an incapacitated principal, or by the trustee of a revocable trust during the period of the settlor's incapacity, or if a condemnation award, insurance proceeds, or recovery for injury to the property are paid to a conservator or guardian, to an agent acting within the authority of a durable power of attorney for an incapacitated principal, or to the trustee of a revocable trust during the period of the settlor's incapacity, the specific devisee has the right to a general pecuniary devise equal to the net sale price, the amount of the unpaid loan, the condemnation award, the insurance proceeds, or the recovery.\n(c) The right of a specific devisee under paragraph (b) is reduced by any right the devisee has under paragraph (a).\n(d) For the purposes of the references in paragraph (b) to a conservator or guardian or an agent acting within the authority of a durable power of attorney or a trustee of a revocable trust during the period of the settlor's incapacity, paragraph (b) does not apply if after the sale, mortgage, condemnation, casualty, or recovery:\n(1) in the case of a conservator or guardian, it was adjudicated that the testator's incapacity ceased and the testator survived the adjudication by one year;\n(2) in the case of an agent acting within the authority of a durable power of attorney, the testator's incapacity ceased and the testator survived for one year after the incapacity ceased; or\n(3) in the case of a trustee, the settlor's incapacity ceased and the settlor survived for one year after the incapacity ceased.\n(e) For the purposes of the references in paragraph (b) to the trustee of a revocable trust during the period of the settlor's incapacity, paragraph (b) does not apply to a specific devise contained in a will if:\n(1) the revocable trust provides for the transfer, devise, or distribution of all trust assets held as of the death of the settlor to persons or entities other than the settlor's estate; and\n(2) the initial transfer of devised property into the trust occurred prior to the settlor's incapacity.\n(f) For the purposes of the references in paragraph (b) to an agent acting within the authority of a durable power of attorney for an incapacitated principal or the trustee of a revocable trust during the period of the settlor's incapacity, (i) \"incapacitated principal\" means a principal who is an incapacitated person as defined in section 524.5-102, subdivision 6, and the \"period of the settlor's incapacity\" means a period when the settlor of a revocable trust is an incapacitated person as defined by the trust instrument, or, if the trust instrument is silent, as defined in section 524.5-102, subdivision 6, and (ii) a finding of the principal's or settlor's incapacity need not occur during the principal's or settlor's life.",
	"repealed": false
}