{
	"id": "290.0921",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0921",
	"title": "290.0921 CORPORATE ALTERNATIVE MINIMUM TAX AFTER 1989.",
	"text": "In addition to the taxes computed under this chapter without regard to this section, the franchise tax imposed on corporations includes a tax equal to the excess, if any, for the taxable year of:\n(1) 5.8 percent of Minnesota alternative minimum taxable income; over\n(2) the tax imposed under section 290.06, subdivision 1, without regard to this section.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Alternative minimum taxable net income\" is alternative minimum taxable income,\n(1) less the exemption amount, and\n(2) apportioned or allocated to Minnesota under section 290.17, 290.191, or 290.20.\n(c) The \"exemption amount\" is $40,000, reduced, but not below zero, by 25 percent of the excess of alternative minimum taxable income over $150,000.\n(d) \"Minnesota alternative minimum taxable income\" is alternative minimum taxable net income, less the deductions for alternative tax net operating loss under subdivision 4; and dividends received under subdivision 6. The sum of the deductions under this paragraph may not exceed 90 percent of alternative minimum taxable net income. This limitation does not apply to:\n(1) a deduction for dividends paid to or received from a corporation which is subject to tax under section 290.36 and which is a member of an affiliated group of corporations as defined by the Internal Revenue Code; or\n(2) a deduction for dividends received from a property and casualty insurer as defined under section 60A.60, subdivision 8, which is a member of an affiliated group of corporations as defined by the Internal Revenue Code and either: (i) the dividend is eliminated in consolidation under Treasury Regulation 1.1502-14(a), as amended through December 31, 1989; or (ii) the dividend is deducted under an election under section 243(b) of the Internal Revenue Code.\n(e) \"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended through December 16, 2016.\n\"Alternative minimum taxable income\" is Minnesota net income as defined in section 290.01, subdivision 19, and includes the adjustments and tax preference items in sections 56, 57, 58, and 59(d), (e), (f), and (h) of the Internal Revenue Code. If a corporation files a separate company Minnesota tax return, the minimum tax must be computed on a separate company basis. If a corporation is part of a tax group filing a unitary return, the minimum tax must be computed on a unitary basis. The following adjustments must be made.\n(1) The portion of the depreciation deduction allowed for federal income tax purposes under section 168(k) of the Internal Revenue Code that is required as an addition under section 290.0133, subdivision 11, is disallowed in determining alternative minimum taxable income.\n(2) The subtraction for depreciation allowed under section 290.0134, subdivision 13, is allowed as a depreciation deduction in determining alternative minimum taxable income.\n(3) The alternative tax net operating loss deduction under sections 56(a)(4) and 56(d) of the Internal Revenue Code does not apply.\n(4) The special rule for certain dividends under section 56(g)(4)(C)(ii) of the Internal Revenue Code does not apply.\n(5) The tax preference for depletion under section 57(a)(1) of the Internal Revenue Code does not apply.\n(6) The tax preference for tax exempt interest under section 57(a)(5) of the Internal Revenue Code does not apply.\n(7) The tax preference for charitable contributions of appreciated property under section 57(a)(6) of the Internal Revenue Code does not apply.\n(8) For purposes of calculating the adjustment for adjusted current earnings in section 56(g) of the Internal Revenue Code, the term \"alternative minimum taxable income\" as it is used in section 56(g) of the Internal Revenue Code, means alternative minimum taxable income as defined in this subdivision, determined without regard to the adjustment for adjusted current earnings in section 56(g) of the Internal Revenue Code.\n(9) For purposes of determining the amount of adjusted current earnings under section 56(g)(3) of the Internal Revenue Code, no adjustment shall be made under section 56(g)(4) of the Internal Revenue Code with respect to (i) the amount of foreign dividend gross-up subtracted as provided in section 290.0134, subdivision 2, or (ii) the amount of refunds of income, excise, or franchise taxes subtracted as provided in section 290.0134, subdivision 8.\n(10) Alternative minimum taxable income excludes the income from operating in a job opportunity building zone as provided under section 469.317.\nItems of tax preference must not be reduced below zero as a result of the modifications in this subdivision.\n(11) The subtraction for disallowed section 280E expenses under section 290.0134, subdivision 19, is allowed as a deduction in determining alternative minimum taxable income.\nThe following entities are exempt from the tax imposed by this section:\n(1) cooperatives taxable under subchapter T of the Internal Revenue Code or organized under chapter 308 or a similar law of another state;\n(2) corporations subject to tax under section 297I.05, subdivisions 1 to 5;\n(3) real estate investment trusts;\n(4) regulated investment companies or a fund thereof;\n(5) entities having a valid election in effect under section 860D(b) of the Internal Revenue Code; and\n(6) small corporations exempt from the federal alternative minimum tax under section 55(e) of the Internal Revenue Code.\n(a) An alternative tax net operating loss deduction is allowed from alternative minimum taxable net income equal to the net operating loss deduction allowable for the taxable year under section 290.095 with the following modifications:\n(1) The amount of the net operating loss deduction must not exceed 90 percent of alternative minimum taxable net income.\n(2) In determining the amount of the net operating loss deduction (i) the net operating loss under section 290.095 must be adjusted as provided in paragraph (b), and (ii) for taxable years beginning after December 31, 1989, section 290.095, subdivision 3, must be applied by substituting \"90 percent of alternative minimum taxable net income\" for \"taxable net income.\"\n(b) For a loss year beginning after December 31, 1989, the net operating loss for each year under section 290.095 must be (1) determined with the adjustments provided in sections 56 and 58 of the Internal Revenue Code, as modified by subdivision 3 and (2) reduced by the items of tax preference for the year determined under section 57 of the Internal Revenue Code, as modified by subdivision 3.\n[Repealed, 2002 c 377 art 10 s 32]\n(a) A deduction is allowed from alternative minimum taxable net income equal to the deduction for dividends received under section 290.21, subdivision 4, for purposes of calculating taxable income under section 290.01, subdivision 29.\n(b) The amount of the deduction must not exceed 90 percent of alternative minimum taxable net income.\nThis limitation does not apply to:\n(1) dividends paid to or received from a corporation which is subject to tax under section 290.36 and which is a member of an affiliated group of corporations as defined by the Internal Revenue Code; or\n(2) dividends received from a property and casualty insurer as defined under section 60A.60, subdivision 8, which is a member of an affiliated group of corporations as defined by the Internal Revenue Code and either: (i) the dividend is eliminated in consolidation under Treasury Regulation 1.1502-14(a), as amended through December 31, 1989; or (ii) the dividend is deducted under an election under section 243(b) of the Internal Revenue Code.\n[Repealed, 2013 c 143 art 6 s 34]\n(a) A corporation is allowed a credit against qualified regular tax for qualified alternative minimum tax previously paid. The credit is allowable only if the corporation has no tax liability under this section for the taxable year and if the corporation has an alternative minimum tax credit carryover from a previous year. The credit allowable in a taxable year equals the lesser of\n(1) the excess of the qualified regular tax for the taxable year over the amount computed under subdivision 1, clause (1), for the taxable year or\n(2) the carryover credit to the taxable year.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Qualified alternative minimum tax\" equals the amount determined under subdivision 1 for the taxable year.\n(2) \"Qualified regular tax\" means the tax imposed under section 290.06, subdivision 1.\n(c) The qualified alternative minimum tax for a taxable year is an alternative minimum tax credit carryover to each of the taxable years succeeding the taxable year. The entire amount of the credit must be carried to the earliest taxable year to which the amount may be carried. Any unused portion of the credit must be carried to the following taxable year. No credit may be carried to a taxable year in which alternative minimum tax was paid.\n(d) An acquiring corporation may carry over this credit from a transferor or distributor corporation in a corporate acquisition. The provisions of section 381 of the Internal Revenue Code apply in determining the amount of the carryover, if any.",
	"repealed": false
}