{
	"id": "245C.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.27",
	"title": "245C.27 FAIR HEARING RIGHTS.",
	"text": "(a) An individual who is disqualified on the basis of a preponderance of evidence that the individual committed an act or acts that meet the definition of any of the crimes listed in section 245C.15; for a determination under section 626.557 or chapter 260E of substantiated maltreatment that was serious or recurring under section 245C.15; or for failure to make required reports under section 260E.06, subdivision 1 or 2; 260E.11, subdivision 1; or 626.557, subdivision 3, pursuant to section 245C.15, subdivision 4, paragraph (b), clause (1), may request a fair hearing under section 256.045, following a reconsideration decision issued under section 245C.23, unless the disqualification is deemed conclusive under section 245C.29.\n(b) The fair hearing is the only administrative appeal of the final agency determination for purposes of appeal by the disqualified individual. The disqualified individual does not have the right to challenge the accuracy and completeness of data under section 13.04.\n(c) Except as provided under paragraph (e), if the individual was disqualified based on a conviction of, admission to, or Alford Plea to any crimes listed in section 245C.15, subdivisions 1 to 4, or for a disqualification under section 256.98, subdivision 8, the reconsideration decision under section 245C.22 is the final agency determination for purposes of appeal by the disqualified individual and is not subject to a hearing under section 256.045. If the individual was disqualified based on a judicial determination, that determination is treated the same as a conviction for purposes of appeal.\n(d) This subdivision does not apply to a public employee's appeal of a disqualification under section 245C.28, subdivision 3.\n(e) Notwithstanding paragraph (c), if the commissioner does not set aside a disqualification of an individual who was disqualified based on both a preponderance of evidence and a conviction or admission, the individual may request a fair hearing under section 256.045, unless the disqualifications are deemed conclusive under section 245C.29. The scope of the hearing conducted under section 256.045 with regard to the disqualification based on a conviction or admission shall be limited solely to whether the individual poses a risk of harm, according to section 256.045, subdivision 3b. In this case, the reconsideration decision under section 245C.22 is not the final agency decision for purposes of appeal by the disqualified individual.\n(a) If an individual who is disqualified on the bases of serious or recurring maltreatment requests a fair hearing on the maltreatment determination under section 260E.33 or 626.557, subdivision 9d, and requests a fair hearing under this section on the disqualification following a reconsideration decision under section 245C.23, the scope of the fair hearing under section 256.045 shall include the maltreatment determination and the disqualification.\n(b) A fair hearing is the only administrative appeal of the final agency determination. The disqualified individual does not have the right to challenge the accuracy and completeness of data under section 13.04.\n(c) This subdivision does not apply to a public employee's appeal of a disqualification under section 245C.28, subdivision 3.",
	"repealed": false
}