{
	"id": "123A.485",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.485",
	"title": "123A.485 CONSOLIDATION TRANSITION REVENUE.",
	"text": "A district that has been reorganized after June 30, 1994, under section 123A.48 is eligible for consolidation transition revenue. Revenue is equal to the sum of aid under subdivision 2 and levy under subdivision 3. Consolidation transition revenue may only be used according to this section. Revenue must be used for the following purposes and may be distributed among these purposes at the discretion of the district:\n(1) to offer early retirement incentives as provided by section 123A.48, subdivision 23;\n(2) to reduce operating debt as defined in section 123B.82;\n(3) to enhance learning opportunities for students in the reorganized district; and\n(4) for other costs incurred in the reorganization.\nRevenue received and utilized under clause (3) or (4) may be expended for operating, facilities, and/or equipment.\n(a) Consolidation transition aid is equal to $200 times the number of resident pupil units in the newly created district in the year of consolidation and $100 times the number of resident pupil units in the first year following the year of consolidation. The number of pupil units used to calculate aid in either year shall not exceed 1,000 for districts consolidating July 1, 1994, and 1,500 for districts consolidating July 1, 1995, and thereafter.\n(b) If the total appropriation for consolidation transition aid for any fiscal year, plus any amount transferred under section 127A.41, subdivision 8, is insufficient to pay all districts the full amount of aid earned, the department must first pay the districts in the first year following the year of consolidation the full amount of aid earned and distribute any remaining funds to the newly created districts in the first year of consolidation.\nIf the aid available in subdivision 2 is insufficient to cover the costs of the district under section 123A.48, subdivision 23, the district may levy the difference over a period of time not to exceed three years.\nIf a district consolidates with another district that has received aid under section 123A.39, subdivision 3, or 123A.485 for a combination or consolidation taking effect within six years of the effective date of the new consolidation, only the pupil units in the district or districts not previously reorganized must be counted for aid purposes under subdivision 2. If two or more districts consolidate and all districts received aid under subdivision 2 for a consolidation taking effect within six years of the effective date of the new consolidation, only one quarter of the pupil units in the newly created district must be used to determine aid under subdivision 2.",
	"repealed": false
}