{
	"id": "342.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.52",
	"title": "342.52 PATIENT REGISTRY PROGRAM.",
	"text": "The office must administer the medical cannabis patient registry program.\n(a) A patient seeking to enroll in the registry program must submit to the office an application established by the office and a copy of the certification specified in paragraph (b) or, if the patient is a veteran, the information requested by the office pursuant to subdivision 3. The patient must provide at least the following information in the application:\n(1) the patient's name, mailing address, and date of birth;\n(2) the name, mailing address, and telephone number of the patient's health care practitioner;\n(3) the name, mailing address, and date of birth of the patient's registered designated caregiver, if any, or the patient's parent, legal guardian, or spouse if the parent, legal guardian, or spouse will be acting as the patient's caregiver;\n(4) a disclosure signed by the patient that includes:\n(i) a statement that, notwithstanding any law to the contrary, the office or an employee of the office may not be held civilly or criminally liable for any injury, loss of property, personal injury, or death caused by an act or omission while acting within the employee's scope of office or employment under this section; and\n(ii) the patient's acknowledgment that enrollment in the registry program is conditional on the patient's agreement to meet all other requirements of this section; and\n(5) all other information required by the office.\n(b) As part of the application under this subdivision, a patient must submit a copy of a certification from the patient's health care practitioner that is dated within 90 days prior to the submission of the application and that certifies that the patient has been diagnosed with a qualifying medical condition.\n(c) A patient's health care practitioner may submit a statement to the office declaring that the patient is no longer diagnosed with a qualifying medical condition. Within 30 days after receipt of a statement from a patient's health care practitioner, the office must provide written notice to a patient stating that the patient's enrollment in the registry program will be revoked in 30 days unless the patient submits a certification from a health care practitioner that the patient is currently diagnosed with a qualifying medical condition or, if the patient is a veteran, the patient submits confirmation that the patient is currently diagnosed with a qualifying medical condition in a form and manner consistent with the information required for an application made pursuant to subdivision 3. If the office revokes a patient's enrollment in the registry program pursuant to this paragraph, the division must provide notice to the patient and to the patient's health care practitioner.\n(a) The office shall establish an alternative certification procedure for veterans to enroll in the patient registry program.\n(b) The office may request that a patient who is a veteran and is seeking to enroll in the registry program submit to the office a copy of the patient's veteran identification card and an attestation that the veteran has been diagnosed with a qualifying medical condition listed in section 342.01, subdivision 63, clauses (1) to (19).\n(a) Within 30 days after the receipt of an application and certification or other documentation of a diagnosis with a qualifying medical condition, the office must approve or deny a patient's enrollment in the registry program. If the office approves a patient's enrollment in the registry program, the office must provide notice to the patient and to the patient's health care practitioner.\n(b) The office may deny a patient's enrollment in the registry program only if the patient:\n(1) does not submit a certification from a health care practitioner or, if the patient is a veteran, the documentation requested by the office under subdivision 3;\n(2) has not signed the disclosure required in subdivision 2;\n(3) does not provide the information required by the office;\n(4) provided false information on the application; or\n(5) at the time of application, is also enrolled in a federally approved clinical trial for the treatment of a qualifying medical condition with medical cannabis.\n(c) If the office denies a patient's enrollment in the registry program, the office must provide written notice to a patient of all reasons for denying enrollment. Denial of enrollment in the registry program is considered a final decision of the office and is subject to judicial review under chapter 14.\n(d) The office may revoke a patient's enrollment in the registry program only:\n(1) pursuant to subdivision 2, paragraph (c);\n(2) upon the death of the patient;\n(3) if the patient's certifying health care practitioner has filed a declaration under subdivision 2, paragraph (c), that the patient's qualifying diagnosis no longer exists and the patient does not submit another certification within 30 days;\n(4) if the patient does not comply with subdivision 6; or\n(5) if the patient intentionally sells or diverts medical cannabis flower or medical cannabinoid products in violation of this chapter.\n(e) If the office has revoked a patient's enrollment in the registry program due to a violation of subdivision 6, the patient may apply for enrollment 12 months after the date on which the patient's enrollment was revoked. The office must process such an application in accordance with this subdivision.\nWhen a patient is enrolled in the registry program, the office must assign the patient a patient registry number and must issue the patient and the patient's registered designated caregiver, parent, legal guardian, or spouse, if applicable, a registry verification. The office must also make the registry verification available to cannabis businesses with a medical cannabis retail endorsement. The registry verification must include:\n(1) the patient's name and date of birth;\n(2) the patient registry number assigned to the patient; and\n(3) the name and date of birth of the patient's registered designated caregiver, if any, or the name of the patient's parent, legal guardian, or spouse if the parent, legal guardian, or spouse will act as a caregiver.\nAs conditions of continued enrollment, a patient must:\n(1) continue to receive regularly scheduled treatment for the patient's qualifying medical condition from the patient's health care practitioner; and\n(2) report changes in the patient's qualifying medical condition to the patient's health care practitioner.\nEnrollment in the registry program is valid for three years. To re-enroll, a patient must submit the information required in subdivision 2 and a patient who is also a veteran must submit the information required in subdivision 3.\nMS 2023 Supp [Repealed, 2024 c 121 art 2 s 154]\n(a) The office must register a designated caregiver for a patient if the patient requires assistance in administering medical cannabis flower or medical cannabinoid products; obtaining medical cannabis flower, medical cannabinoid products, or medical cannabis paraphernalia from a cannabis business with a medical cannabis retail endorsement; or cultivating cannabis plants as permitted by section 342.09, subdivision 2.\n(b) In order to serve as a designated caregiver, a person must:\n(1) be at least 18 years of age;\n(2) agree to only possess the patient's medical cannabis flower and medical cannabinoid products for purposes of assisting the patient; and\n(3) agree that if the application is approved, the person will not serve as a registered designated caregiver for more than six registered patients at one time. Patients who reside in the same residence count as one patient.\n(c) Nothing in this section shall be construed to prevent a registered designated caregiver from being enrolled in the registry program as a patient and possessing and administering medical cannabis flower or medical cannabinoid products as a patient.\n(d) Notwithstanding any law to the contrary, a registered designated caregiver approved to assist a patient enrolled in the registry program with obtaining medical cannabis flower may cultivate cannabis plants on behalf of one patient. A registered designated caregiver may grow up to eight cannabis plants for the patient household that the registered designated caregiver is approved to assist with obtaining medical cannabis flower. If a patient enrolled in the registry program directs the patient's registered designated caregiver to cultivate cannabis plants on behalf of the patient, the patient must assign the patient's right to cultivate cannabis plants to the registered designated caregiver and the patient is prohibited from cultivating cannabis plants for personal use. Nothing in this paragraph limits the right of a registered designated caregiver cultivating cannabis plants on behalf of a patient enrolled in the registry program to also cultivate cannabis plants for personal use pursuant to section 342.09, subdivision 2.\nA parent, legal guardian, or spouse of a patient may act as the caregiver for a patient. The parent, legal guardian, or spouse who is acting as a caregiver must follow all requirements for parents, legal guardians, and spouses under this chapter. Nothing in this section limits any legal authority that a parent, legal guardian, or spouse may have for the patient under any other law.\nPatients and registered designated caregivers must notify the office of any address or name change within 30 days of the change having occurred. A patient or registered designated caregiver is subject to a $100 fine for failure to notify the office of the change.",
	"repealed": false
}