{
	"id": "245C.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.24",
	"title": "245C.24 DISQUALIFICATION; BAR TO SET ASIDE A DISQUALIFICATION; REQUEST FOR VARIANCE.",
	"text": "The disqualification periods under subdivisions 3 to 5 are the minimum applicable disqualification periods. The commissioner may determine that an individual should continue to be disqualified from licensure because the individual continues to pose a risk of harm to persons served by that individual, even after the minimum disqualification period has passed.\n(a) Except as provided in paragraphs (b) to (g), the commissioner may not set aside the disqualification of any individual disqualified pursuant to this chapter, regardless of how much time has passed, if the individual was disqualified for a crime or conduct listed in section 245C.15, subdivision 1.\n(b) For an individual in the substance use disorder or corrections field who was disqualified for a crime or conduct listed under section 245C.15, subdivision 1, and whose disqualification was set aside prior to July 1, 2005, the commissioner must consider granting a variance pursuant to section 245C.30 for the license holder for a program dealing primarily with adults. A request for reconsideration evaluated under this paragraph must include a letter of recommendation from the license holder that was subject to the prior set-aside decision addressing the individual's quality of care to children or vulnerable adults and the circumstances of the individual's departure from that service.\n(c) If an individual who requires a background study for nonemergency medical transportation services under section 245C.03, subdivision 12, was disqualified for a crime or conduct listed under section 245C.15, subdivision 1, and if more than 40 years have passed since the discharge of the sentence imposed, the commissioner may consider granting a set-aside pursuant to section 245C.22. A request for reconsideration evaluated under this paragraph must include a letter of recommendation from the employer. This paragraph does not apply to a person disqualified based on a violation of sections 243.166; 609.185 to 609.205; 609.25; 609.342 to 609.3453; 609.352; 617.23, subdivision 2, clause (1), or 3, clause (1); 617.246; or 617.247.\n(d) When a licensed foster care provider adopts an individual who had received foster care services from the provider for over six months, and the adopted individual is required to receive a background study under section 245C.03, subdivision 1, paragraph (a), clause (2) or (6), the commissioner may grant a variance to the license holder under section 245C.30 to permit the adopted individual with a permanent disqualification to remain affiliated with the license holder under the conditions of the variance when the variance is recommended by the county of responsibility for each of the remaining individuals in placement in the home and the licensing agency for the home.\n(e) For an individual 18 years of age or older affiliated with a licensed family foster setting, the commissioner must not set aside or grant a variance for the disqualification of any individual disqualified pursuant to this chapter, regardless of how much time has passed, if the individual was disqualified for a crime or conduct listed in section 245C.15, subdivision 4a, paragraphs (a) and (b).\n(f) In connection with a family foster setting license, the commissioner may grant a variance to the disqualification for an individual who is under 18 years of age at the time the background study is submitted.\n(g) In connection with foster residence settings and children's residential facilities, the commissioner must not set aside or grant a variance for the disqualification of any individual disqualified pursuant to this chapter, regardless of how much time has passed, if the individual was disqualified for a crime or conduct listed in section 245C.15, subdivision 4a, paragraph (a) or (b).\n(a) The commissioner may not set aside the disqualification of an individual in connection with a license to provide family child care for children or foster care or day care services for adults in the provider's home if: (1) less than ten years has passed since the discharge of the sentence imposed, if any, for the offense; or (2) when disqualified based on a preponderance of evidence determination under section 245C.14, subdivision 1, paragraph (a), clause (2), or an admission under section 245C.14, subdivision 1, paragraph (a), clause (1), and less than ten years has passed since the individual committed the act or admitted to committing the act, whichever is later; and (3) the individual has committed a violation of any of the following offenses: sections 609.165 (felon ineligible to possess firearm); criminal vehicular homicide or criminal vehicular operation causing death under 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.215 (aiding suicide or aiding attempted suicide); felony violations under 609.223 or 609.2231 (assault in the third or fourth degree); 609.229 (crimes committed for benefit of a gang); 609.713 (terroristic threats); 609.235 (use of drugs to injure or to facilitate crime); 609.24 (simple robbery); 609.247, subdivision 4 (carjacking in the third degree); 609.255 (false imprisonment); 609.562 (arson in the second degree); 609.71 (riot); 609.498, subdivision 1 or 1b (aggravated first-degree or first-degree tampering with a witness); burglary in the first or second degree under 609.582 (burglary); 609.66 (dangerous weapon); 609.665 (spring guns); 609.67 (machine guns and short-barreled shotguns); 609.749, subdivision 2 (gross misdemeanor harassment); 152.021 or 152.022 (controlled substance crime in the first or second degree); 152.023, subdivision 1, clause (3) or (4) or subdivision 2, clause (4) (controlled substance crime in the third degree); 152.024, subdivision 1, clause (2), (3), or (4) (controlled substance crime in the fourth degree); 609.224, subdivision 2, paragraph (c) (fifth-degree assault by a caregiver against a vulnerable adult); 609.23 (mistreatment of persons confined); 609.231 (mistreatment of residents or patients); 609.2325 (criminal abuse of a vulnerable adult); 609.233 (criminal neglect of a vulnerable adult); 609.2335 (financial exploitation of a vulnerable adult); 609.234 (failure to report); 609.265 (abduction); 609.2664 to 609.2665 (manslaughter of an unborn child in the first or second degree); 609.267 to 609.2672 (assault of an unborn child in the first, second, or third degree); 609.268 (injury or death of an unborn child in the commission of a crime); repeat offenses under 617.23 (indecent exposure); 617.293 (disseminating or displaying harmful material to minors); a felony-level conviction involving alcohol or drug use, a gross misdemeanor offense under 609.324, subdivision 1 (other prohibited acts); a gross misdemeanor offense under 609.378 (neglect or endangerment of a child); a gross misdemeanor offense under 609.377 (malicious punishment of a child); 609.72, subdivision 3 (disorderly conduct against a vulnerable adult); or 624.713 (certain persons not to possess firearms); or Minnesota Statutes 2012, section 609.21.\n(b) The commissioner may not set aside the disqualification of an individual if less than ten years have passed since the individual's aiding and abetting, attempt, or conspiracy to commit any of the offenses listed in paragraph (a) as each of these offenses is defined in Minnesota Statutes.\n(c) The commissioner may not set aside the disqualification of an individual if less than ten years have passed since the discharge of the sentence imposed for an offense in any other state or country, the elements of which are substantially similar to the elements of any of the offenses listed in paragraph (a).\nThe commissioner may not set aside the disqualification of an individual in connection with a license to provide family child care for children or foster care or day care services for adults in the provider's home if within seven years preceding the study:\n(1) the individual committed an act that constitutes maltreatment of a child under sections 260E.24, subdivisions 1, 2, and 3, and 260E.30, subdivisions 1, 2, and 4, and the maltreatment resulted in substantial bodily harm as defined in section 609.02, subdivision 7a, or substantial mental or emotional harm as supported by competent psychological or psychiatric evidence; or\n(2) the individual was determined under section 626.557 to be the perpetrator of a substantiated incident of maltreatment of a vulnerable adult that resulted in substantial bodily harm as defined in section 609.02, subdivision 7a, or substantial mental or emotional harm as supported by competent psychological or psychiatric evidence.\nThe commissioner shall not set aside or grant a variance for the disqualification of an individual in connection with a license for a children's residential facility or foster residence setting who was convicted of a felony within the past five years for: (1) physical assault or battery; or (2) a drug-related offense.\n(a) The commissioner shall not set aside or grant a variance for the disqualification of an individual 18 years of age or older in connection with a foster family setting license if within five years preceding the study the individual is convicted of a felony in section 245C.15, subdivision 4a, paragraph (d).\n(b) In connection with a foster family setting license, the commissioner may set aside or grant a variance to the disqualification for an individual who is under 18 years of age at the time the background study is submitted.",
	"repealed": false
}