{
	"id": "123B.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.97",
	"title": "123B.97 SCHOOLHOUSES AND SITES; COMMON SCHOOL DISTRICTS.",
	"text": "When authorized by the voters at a regular meeting or at a special meeting called for that purpose, the board may acquire necessary sites for school houses, or enlargements or additions to existing school house sites, by lease, purchase, or condemnation under the power of eminent domain; lease, erect or purchase garages for district-owned school buses; and sell or exchange school houses or sites and execute deeds of conveyances thereof. It may acquire by lease, purchase, or condemnation under eminent domain suitable tracts of land either in or outside of the district for the purpose of instruction, experimentation, and demonstration in agriculture. In any city, a school site, when practicable, must contain at least one block. Outside of any city, a school site must contain at least two acres. If any school house site contains less than the required amount the board may, without a vote of the electors, acquire other land adjacent to or near such site to make, with such site, all or part of the required amount. If property is taken by eminent domain by authority of this subdivision, when needed by the district for such purpose, the fact that the property was acquired by the owner under the power of eminent domain, or is already devoted to public use, shall not prevent its acquisition by the district.\nThe annual meeting or election shall have power to designate a site for a school house and provide for building or otherwise placing a school house thereon, when proper notice has been given. A site with an existing school house or where a school house is being built shall not be changed except by vote of three-fifths of the voters of the district voting on the question.\nWhen authorized by a two-thirds majority of all the electors voting at an annual or special meeting, the board may erect, purchase, or acquire a dwelling house for the use of its teachers. The proposition shall be submitted only at a meeting or election. The notice of the meeting shall state that the proposition shall be considered or submitted.",
	"repealed": false
}