{
	"id": "325D.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.421",
	"title": "325D.421 UNLAWFUL CIGARETTE TRADE PRACTICES.",
	"text": "(a) It is unlawful for any person to sell or distribute in this state; to acquire, hold, own, possess, or transport, for sale or distribution in this state; or to import, or cause to be imported, into this state for sale or distribution in this state, any cigarettes:\n(1) the package of which:\n(i) bears any statement, label, stamp, sticker, or notice indicating that the manufacturer did not intend the cigarettes to be sold, distributed, or used in the United States, including, but not limited to, labels stating \"For Export Only,\" \"U.S. Tax-Exempt,\" \"For Use Outside U.S.,\" or similar wording; or\n(ii) does not comply with all requirements imposed by or pursuant to federal law regarding warnings and other information on packages of cigarettes manufactured, packaged, or imported for sale, distribution, or use in the United States, including, but not limited to, the precise warning labels specified in the federal Cigarette Labeling and Advertising Act, United States Code, title 15, section 1333;\n(2) imported into the United States in violation of United States Code, title 26, section 5754, or any other federal law or regulation; or\n(3) for which there has not been submitted to the secretary of the United States Department of Health and Human Services the list or lists of the ingredients added to tobacco in the manufacture of the cigarettes required by the federal Cigarette Labeling and Advertising Act, United States Code, title 15, section 1335a.\n(b) It is unlawful for any person to alter the package of any cigarettes, prior to sale or distribution to the ultimate consumer, so as to remove, conceal, or obscure:\n(1) any statement, label, stamp, sticker, or notice described in paragraph (a), clause (1), item (i); or\n(2) any health warning that is not specified in, or does not conform with the requirements of the federal Cigarette Labeling and Advertising Act, United States Code, title 15, section 1333.\n(c) If cigarettes are sold or distributed under any trade name, trade dress, or trademark that is the same as, or is confusingly similar to, any trade name, trade dress, or trademark used for other cigarettes previously sold or distributed, it is unlawful for a wholesaler, as defined in section 325D.32, subdivision 4, or a retailer, as defined in section 325D.32, subdivision 5, to sell the cigarettes at a price lower than the minimum price presently permitted under sections 325D.30 to 325D.42 for the cigarettes which were previously sold or distributed in this state. For purposes of this subdivision, \"previously sold or distributed\" means cigarettes using a trade name, trade dress, or trademark that were sold or distributed in this state before January 1, 1998. No provision of sections 325D.30 to 325D.42 authorizes or permits sales of cigarettes, subject to this paragraph, at prices lower than the minimum prices under this paragraph. The commissioner of revenue is not responsible for enforcing this paragraph. None of the enforcement mechanisms or remedies under sections 325D.30 to 325D.42 apply to violations of this paragraph.\n(a) In addition to any other private remedy provided by law, any person that sustains economic damages or commercial injury as a result of any violation of subdivision 1 may bring an action for appropriate injunctive or other equitable relief, actual damages, if any, sustained by reason of the violation, and, as determined by the court, interest on the damages from the date of the complaint, taxable costs, and reasonable attorney fees.\n(b) If the trier of fact finds that the violation is egregious, it may increase the recovery to an amount not in excess of three times the actual damages sustained by reason of the violation. The trier of fact may, in addition, award exemplary damages for violations of subdivision 1, paragraph (c), equal to the difference between the permitted legal price and the actual price for the sales.\nThis section does not apply to cigarettes imported or reimported into the United States for personal use and cigarettes sold or intended to be sold as duty-free merchandise by a duty-free sales enterprise in accordance with the provisions of United States Code, title 19, section 1555(b), and any implementing regulations; unless the cigarettes are brought back into the customs territory for resale within the customs territory.\nA violation of this section is a misdemeanor.",
	"repealed": false
}