{
	"id": "176.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.321",
	"title": "176.321 ANSWER TO PETITION.",
	"text": "Within 30 days after service of the petition, an adverse party shall serve and file an answer to the petition. The party shall serve a copy of the answer on the petitioner or the petitioner's attorney.\nThe answer shall admit, deny, or affirmatively defend against the substantial averments of the petition, and shall state the contention of the adverse party with reference to the matter in dispute.\nEach fact alleged by the petition or answer and not specifically denied by the answer or reply is deemed admitted, but the failure to deny such a fact does not preclude the compensation judge from requiring proof of the fact.\nThe answer shall include the names and addresses of all known witnesses; whether or not the employer intends to schedule an adverse examination and, if known, the date, time, and place of all adverse examinations; the desired location for a hearing; any request for a prehearing or settlement conference; the estimated time needed to present evidence at a hearing; and, if an affidavit of significant financial hardship and request for an expedited hearing are included with the petition, any objection the employer may have to that request. If the date, time, and place of all adverse examinations is unknown at the time the answer is filed, the employer must notify the office in writing of the date, time, and place of all adverse examinations within 50 days of the filing of the claim petition.\nUpon showing of cause, the office may extend the time in which to file an answer or reply for not more than 30 additional days. The time to file an answer or reply may also be extended upon agreement of the petitioner, and provided that the office must be notified in writing by the employer no later than five days beyond the time required for the filing of the answer of the fact that an agreement has been reached, including the length of the extension. Any case received by the office that does not include an answer, written extension order, or written notification of the extension agreement shall be immediately set for pretrial conference and hearing at the first available date under section 176.331.",
	"repealed": false
}