{
	"id": "521A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/521A.15",
	"title": "521A.15 FIDUCIARY DUTY AND AUTHORITY.",
	"text": "(a) The legal duties imposed on a fiduciary charged with managing tangible property apply to the management of digital assets, including:\n(1) the duty of care;\n(2) the duty of loyalty; and\n(3) the duty of confidentiality.\n(b) A fiduciary's or designated recipient's authority with respect to a digital asset of a user:\n(1) except as otherwise provided in section 521A.04, is subject to the applicable terms of service;\n(2) is subject to other applicable law, including copyright law;\n(3) in the case of a fiduciary, is limited by the scope of the fiduciary's duties; and\n(4) may not be used to impersonate the user.\n(c) A fiduciary with authority over the property of a decedent, protected person, principal, or settlor has the right to access any digital asset in which the decedent, protected person, principal, or settlor had a right or interest and that is not held by a custodian or subject to a terms-of-service agreement.\n(d) A fiduciary acting within the scope of the fiduciary's duties is an authorized user of the property of the decedent, protected person, principal, or settlor for the purpose of applicable computer fraud and unauthorized computer access laws, including section 609.891.\n(e) A fiduciary with authority over the tangible personal property of a decedent, protected person, principal, or settlor:\n(1) has the right to access the property and any digital asset stored in it; and\n(2) is an authorized user for the purpose of computer fraud and unauthorized computer access laws, including section 609.891.\n(f) A custodian may disclose information in an account to a fiduciary of the user when the information is required to terminate an account used to access digital assets licensed to the user.\n(g) A fiduciary of a user may request a custodian to terminate the user's account. A request for termination must be in writing, in either physical or electronic form, and accompanied by:\n(1) if the user is deceased, a certified copy of the death certificate of the user;\n(2) a certified copy of the letter of appointment of the representative or a small estate affidavit or court order, court order, power of attorney, or trust giving the fiduciary authority over the account; and\n(3) if requested by the custodian:\n(i) a number, username, address, or other unique subscriber or account identifier assigned by the custodian to identify the user's account;\n(ii) evidence linking the account to the user; or\n(iii) a finding by the court that the user had a specific account with the custodian, identifiable by the information specified in item (i).",
	"repealed": false
}