{
	"id": "590.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/590.11",
	"title": "590.11 ORDER DETERMINING ELIGIBILITY FOR COMPENSATION BASED ON EXONERATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Exonerated\" means that:\n(1) a court:\n(i) vacated, reversed, or set aside a judgment of conviction on grounds consistent with innocence and there are no remaining felony charges in effect against the petitioner from the same behavioral incident, or if there are remaining felony charges against the petitioner from the same behavioral incident, the prosecutor dismisses those remaining felony charges; or\n(ii) ordered a new trial on grounds consistent with innocence and the prosecutor dismissed all felony charges against the petitioner arising from the same behavioral incident or the petitioner was found not guilty of all felony charges arising from the same behavioral incident at the new trial;\n(2) the time for appeal of the order resulting in exoneration has expired or the order has been affirmed and is final; and\n(3) 60 days have passed since the judgment of conviction was reversed or vacated, and the prosecutor has not filed any felony charges against the petitioner from the same behavioral incident, or if the prosecutor did file felony charges against the petitioner from the same behavioral incident, those felony charges were dismissed or the defendant was found not guilty of those charges at the new trial.\n(c) \"On grounds consistent with innocence\" means either:\n(1) exonerated, through a pardon or sentence commutation, based on factual innocence; or\n(2) exonerated because the judgment of conviction was vacated or reversed, or a new trial was ordered, and there is any evidence of factual innocence whether it was available at the time of investigation or trial or is newly discovered evidence.\nA petition for an order declaring eligibility for compensation based on exoneration under sections 611.362 to 611.368 must be brought before the district court where the original conviction was obtained. The state must be represented by the office of the prosecutor that obtained the conviction or the prosecutor's successor. Within 60 days after the filing of the petition, the prosecutor must respond to the petition. A petition must be brought within two years, but no less than 60 days after the petitioner is exonerated. If before July 1, 2019, a person did not meet both requirements of Minnesota Statutes 2018, section 590.11, subdivision 1, clause (1), item (i), and did not file a petition or the petition was denied, that person may commence an action meeting the requirements under subdivision 1, paragraph (b), clause (1), item (i), on or after July 1, 2019, and before July 1, 2021.\n(a) An individual who is exonerated is eligible for compensation in the interests of justice, if the prosecutor, within 60 days of filing the petition, joins the petition and indicates that it is likely that the original complaint or indictment would not have been filed or sought or would have been dismissed with the knowledge of all of the circumstances. Joinder and agreement to compensation based on the interests of justice by the prosecutor shall conclusively establish eligibility for compensation precluding any further proceedings under paragraph (b). Upon receipt of prosecutor's joinder and agreement, the court shall issue an order as described in subdivision 7, granting petitioner's eligibility for compensation under this subdivision.\n(b) If the prosecutor does not join and agree as provided under paragraph (a), the court shall determine if an individual who is exonerated is eligible for compensation based on the establishment of innocence if the petitioner establishes that a crime was not committed or that the crime was not committed by the petitioner. The petitioner's burden of proof and the procedures set forth in section 590.04, subdivision 3, apply to this proceeding.\nCourt records related to the conviction and the exoneration are admissible in a proceeding under this section. A written statement filed in court or oral statement on the record by the office of the prosecutor that obtained the conviction is admissible to support or refute the petition. The prosecutor may address the prosecutor's decision to dismiss the charges or other information that may not be fully reflected in the proceedings resulting in exoneration. Both the petitioner and the prosecutor have the right to present additional evidence. The court may consider acts by the petitioner that may have contributed to bringing about the conviction and any other offenses that may have been committed by the petitioner in the same behavioral incident, except for those acts contained in subdivision 5, paragraph (c). The victim of the offense has a right to submit an oral or written statement before the court issues its order. The statement may summarize the harm suffered by the victim as a result of the crime and give the victim's recommendation on whether the petition should be granted or denied.\n(a) A claim for compensation arises if a person is eligible for compensation under subdivision 3 and:\n(1) the person was convicted of a felony and served any part of the imposed sentence;\n(2) in cases where the person was convicted of multiple charges arising out of the same behavioral incident, the person was exonerated for all of those charges;\n(3) the person did not commit or induce another person to commit perjury or fabricate evidence to cause or bring about the conviction; and\n(4) the person was not serving a term of incarceration for another crime at the same time, except:\n(i) if the person served additional time in prison or jail due to the conviction that is the basis of the claim, the person may make a claim for that portion of time served in prison or jail during which the person was serving no other sentence; or\n(ii) if the person served additional executed sentences that had been previously stayed, and the reason the additional stayed sentences were executed was due to the conviction that is the basis for the claim.\n(b) A claimant may make a claim only for that portion of time served in prison or jail during which the claimant was serving no other sentence, unless the other sentence arose from the circumstances described in paragraph (a), clause (4), item (ii).\n(c) A confession or admission later found to be false or a guilty plea to a crime the claimant did not commit does not constitute bringing about the claimant's conviction for purposes of paragraph (a), clause (3).\nUnless the petition and the files and records of the proceeding conclusively show that the petitioner is not eligible for compensation, the court shall set a hearing on the petition and response thereto.\nIf, after considering all the files and records admitted and any evidence admitted at a hearing held pursuant to subdivision 4, the court determines that the petitioner is eligible for compensation, the court shall issue an order containing its findings and, if applicable, indicate the portion of the term of incarceration for which the petitioner is entitled to make a claim. The court shall notify the petitioner of the right to file a claim for compensation under sections 611.362 to 611.368 and provide the petitioner with a copy of those sections. The petitioner must acknowledge receipt of the notice and a copy of those sections in writing or on the record before the court.\nAn order issued pursuant to subdivision 3, paragraph (b), may be appealed as provided for under section 590.06. The petitioner may not appeal an order granting eligibility pursuant to subdivision 3, paragraph (a).",
	"repealed": false
}