{
	"id": "148.6443",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6443",
	"title": "148.6443 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "(a) A licensed occupational therapist must obtain a minimum of 24 contact hours of continuing education in the two-year licensure period. A licensed occupational therapy assistant must obtain a minimum of 18 contact hours of continuing education in the two-year licensure period. All continuing education coursework must be obtained between the effective and expiration dates of the license. Licensees who are issued licenses for a period of less than two years must obtain a prorated number of contact hours required for licensure renewal based on the number of months licensed during the two-year licensure period.\n(b) Each licensee is responsible for financing the cost of the licensee's continuing education activities.\n(a) To be accepted by the board, activities must be related to a licensee's current or anticipated roles and responsibilities as an occupational therapy practitioner and must directly or indirectly serve to protect the public by enhancing the licensee's continuing competence.\n(b) Except as provided in subdivision 3, paragraph (d), in order to qualify as a continuing education activity, the activity must:\n(1) constitute an organized program of learning;\n(2) reasonably be expected to advance the knowledge and skills of the occupational therapy practitioner;\n(3) be conducted by a sponsor approved by the American Occupational Therapy Association or by individuals who have education, training, and experience by reason of which the individuals should be considered experts on the subject matter of the activity; and\n(4) be presented by a sponsor who has a mechanism to verify participation and maintains attendance records for a minimum of three years.\n(a) The activities in this subdivision qualify for continuing education contact hours if they meet all other requirements of this section.\n(b) A minimum of one-half of the required contact hours must be directly related to occupational therapy practice. The remaining contact hours may be related to occupational therapy practice, the delivery of occupational therapy services, or to the practitioner's current professional role.\n(c) A licensee may obtain an unlimited number of contact hours in any two-year continuing education period through participation in the following:\n(1) attendance at educational programs of annual conferences, lectures, panel discussions, workshops, in-service training, seminars, and symposiums;\n(2) successful completion of college or university courses. The licensee must obtain a grade of at least a \"C\" or a pass in a pass/fail course in order to receive credit. One college credit equals six continuing education contact hours; or\n(3) successful completion of home study courses that require the participant to demonstrate the participant's knowledge following completion of the course.\n(d) A licensee may obtain a maximum of one-half of the required contact hours in any two-year continuing education period for:\n(1) teaching continuing education or occupational therapy related courses that meet the requirements of this section. A licensee is entitled to earn a maximum of two contact hours as preparation time for each contact hour of presentation time. Contact hours may be claimed only once for teaching the same course in any two-year continuing education period. A course schedule or brochure must be maintained for audit;\n(2) supervising occupational therapist or occupational therapy assistant students. A licensee may earn one contact hour for every eight hours of student supervision. Licensees must ensure they receive documentation regarding each student supervised and the dates and hours each student was supervised. Contact hours obtained by student supervision must be obtained by supervising students from an occupational therapy education program accredited by the Accreditation Council for Occupational Therapy Education;\n(3) teaching or participating in courses related to leisure activities, recreational activities, or hobbies if the practitioner uses these interventions within the practitioner's current practice or employment; and\n(4) engaging in research activities or outcome studies that are related to the practice of occupational therapy and associated with grants, postgraduate studies, or publications in professional journals or books.\n(e) A licensee may obtain a maximum of two contact hours in any two-year continuing education period for continuing education activities in the following areas:\n(1) personal skill topics: career burnout, communication skills, human relations, and similar topics;\n(2) training that is obtained in conjunction with a licensee's employment, occurs during a licensee's normal workday, and does not include subject matter specific to the fundamentals of occupational therapy; and\n(3) participation for a minimum of one year on a professional committee or board.\nCredit must not be granted for the following activities: hospital rounds, entertainment or recreational activities, noneducational association meetings, and employment orientation sessions.\nEach licensee must use the continuing education reporting form to verify meeting the continuing education requirements of this section. The licensee must maintain documentation, including but not limited to a signed certificate, transcript, or similar evidence of participation in an activity. The documentation must include a:\n(1) title of the continuing education activity;\n(2) brief description of the continuing education activity prepared by the presenter or sponsor;\n(3) sponsor, presenter, or author;\n(4) location and attendance dates;\n(5) number of contact hours; and\n(6) licensee's name.\n(a) The board may audit a percentage of the continuing education reports based on random selection. A licensee shall maintain all documentation required by this section for two years after the last day of the biennial licensure period in which the contact hours were earned.\n(b) All renewal applications that are received after the expiration date may be subject to a continuing education report audit.\n(c) Any licensee against whom a complaint is filed may be subject to a continuing education report audit.\n(d) The licensee shall make the following information available to the board for auditing purposes:\n(1) a copy of the completed continuing education reporting form for the continuing education reporting period that is the subject of the audit including all supporting documentation required by subdivision 5;\n(2) documentation of university, college, or vocational school courses by a transcript and a course syllabus, listing in a course bulletin, or equivalent documentation that includes the course title, instructor's name, course dates, number of contact hours, and course content, objectives, or goals; and\n(3) verification of attendance by:\n(i) a signature of the presenter or a designee at the continuing education activity on the continuing education report form or a certificate of attendance with the course name, course date, and licensee's name;\n(ii) a summary or outline of the educational content of an audio or video educational activity to verify the licensee's participation in the activity if a designee is not available to sign the continuing education report form; or\n(iii) verification of self-study programs by a certificate of completion or other documentation indicating that the individual has demonstrated knowledge and has successfully completed the program.\nThe board may waive or defer all or part of the continuing education requirements of this section if the licensee submits a written request and provides satisfactory evidence to the board of illness, injury, financial hardship, family hardship, or other similar extenuating circumstances that preclude completion of the requirements during the licensure period. The request for a waiver must be in writing, state the circumstances that constitute hardship, state the period of time the licensee wishes to have the continuing education requirement waived, and state the alternative measures that will be taken if a waiver is granted. The board must set forth, in writing, the reasons for granting or denying the waiver. Waivers granted by the board must specify, in writing, the time limitation and required alternative measures to be taken by the licensee. A request for waiver must be denied if the board finds that the circumstances stated by the licensee do not support a claim of hardship, the requested time period for waiver is unreasonable, the alternative measures proposed by the licensee are not equivalent to the continuing education activity being waived, or the request for waiver is not submitted to the board within 60 calendar days of the expiration date.\nThe board shall refuse to renew or grant, or shall suspend, condition, limit, or qualify the license of any person who the board determines has failed to comply with the continuing education requirements of this section. A licensee may request reconsideration of the board's determination of noncompliance or the penalty imposed under this section by making a written request to the board within 30 calendar days of the date of notification to the applicant. Individuals requesting reconsideration may submit information that the licensee wants considered in the reconsideration.",
	"repealed": false
}