{
	"id": "514.966",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.966",
	"title": "514.966 AGRICULTURAL LIEN ON LIVESTOCK.",
	"text": "A licensed veterinarian performing emergency veterinary services in the ordinary course of business that cost more than $25 for animals at the request of the owner or a person in possession of the animals has a lien on the animals for the value of the services. A lien under this section does not secure any veterinary services performed more than one year before the date on which the last item of the veterinary service is performed. A veterinarian's lien becomes effective upon the services being provided the obligor by the veterinarian.\nThe owner of any livestock used for breeding services in the ordinary course of business, or any provider, in the ordinary course of business, of semen or ova used in fertilizer, artificial insemination, or any other artificial means of impregnating livestock, has a lien upon the livestock bred and any resulting offspring for the price or value of the service provided. A breeder's lien becomes effective when the services are provided the obligor by the breeder.\n(a) A supplier furnishing livestock production inputs in the ordinary course of business has a livestock production input lien for the unpaid retail cost of the livestock production input. A perfected livestock production input lien that attaches to livestock may not exceed the amount, if any, that the sales price of the livestock exceeds the greater of the fair market value of the livestock at the time the lien attaches or the acquisition price of the livestock. A livestock production input lien becomes effective when the agricultural production inputs are furnished by the supplier to the purchaser.\n(b) A supplier shall notify a lender of a livestock production input lien by providing a lien-notification statement to the lender in an envelope marked \"IMPORTANT-LEGAL NOTICE.\" Delivery of the notice must be made by certified mail or another verifiable method.\n(c) The lien-notification statement must disclose the following:\n(1) the name and business address of the lender that is to receive notification;\n(2) the name and address of the supplier claiming the lien;\n(3) a description and the date or anticipated date or dates of the transaction and the retail cost or anticipated costs of the livestock production input;\n(4) the name and address of the person to whom the livestock production input was furnished;\n(5) the name and address of the owner of the livestock, the location where the livestock will be raised, and a description of the livestock; and\n(6) a statement that products and proceeds of the livestock are covered by the livestock input lien.\n(d) Within ten calendar days after receiving a lien-notification statement, the lender must respond to the supplier with either:\n(1) a letter of commitment for part or all of the amount in the lien-notification statement; or\n(2) a written refusal to issue a letter of commitment.\nA copy of the response must be mailed to the person for whom the financing was requested.\n(e) If a lender responds with a letter of commitment for part or all of the amount in the lien-notification statement, the supplier may not obtain a lien for the amount stated in the letter of commitment. If a lender responds with a refusal to provide a letter of commitment, the rights of the lender and the supplier are not affected.\n(f) If a lender does not respond under paragraph (d) to the supplier within ten calendar days after receiving the lien-notification statement, a perfected livestock production input lien corresponding to the lien-notification statement has priority over any security interest of the lender in the same livestock or their proceeds for the lesser of:\n(1) the amount stated in the lien-notification statement; or\n(2) the unpaid retail cost of the livestock production input identified in the lien-notification statement, subject to any limitation in paragraph (a).\n(a) A supplier furnishing livestock production inputs in the ordinary course of business to a debtor who has filed a mediation request under chapter 583 has a temporary livestock production input lien for the unpaid retail cost of the livestock production input. A perfected temporary livestock production input lien that attaches to livestock may not exceed the amount, if any, that the sales price of the livestock for which the inputs were received exceeds the greater of the fair market value of the livestock at the time the lien attaches or the acquisition price of the livestock. A temporary livestock production input lien becomes effective when the agricultural production inputs are furnished by the supplier to the purchaser.\n(b) A temporary livestock production input lien under this subdivision applies to livestock production inputs provided to the debtor during the 45 days following a mediation request under chapter 583.\n(c) A person who supplies livestock production inputs under this subdivision shall provide a lien-notification statement as required under subdivision 3, paragraphs (b) and (c), but is not subject to subdivision 3, paragraphs (d) to (f). A perfected temporary livestock production input lien corresponding to the lien-notification statement has priority over any security interest of the lender in the same livestock or their proceeds for the lesser of:\n(1) the amount stated in the lien-notification statement; or\n(2) the unpaid retail cost of the livestock production input identified in the lien-notification statement, subject to any limitation in paragraph (a).\n(a) A person has a feeder's lien on livestock if the person (1) stores, cares for, or contributes to the keeping, feeding, pasturing, or other care of livestock, including medical or surgical treatment and shoeing, and (2) does so in the ordinary course of business, at the request of the owner or legal possessor of the livestock.\n(b) A feeder's lien is a lien upon the livestock for the price or value of the storage, care, or contribution, and for any legal charges against the same paid by the person to any other person.\n(c) A feeder's lien becomes effective when the services or contributions are provided the obligor.\nA veterinarian's lien, breeder's lien, livestock production input lien, temporary livestock production lien, or feeder's lien attaches to the livestock serviced by the agricultural lienholder, and products and proceeds thereof to the extent of the price or value of the service provided.\n(a) An agricultural lien under this section is perfected if a financing statement is filed pursuant to sections 336.9-501 to 336.9-530 and within the time periods set forth in paragraphs (b) to (f).\n(b) A veterinarian's lien must be perfected on or before 180 days after the last item of the veterinary service is performed.\n(c) A breeder's lien must be perfected by six months after the last date that breeding services are provided the obligor.\n(d) Except as provided in paragraph (f), a livestock production input lien must be perfected by six months after the last date that livestock production inputs are furnished the obligor.\n(e) A feeder's lien must be perfected on or before 60 days after the last date that feeding services are furnished the obligor.\n(f) A temporary livestock production input lien, under subdivision 3a, must be perfected on or before 60 days after the last date that livestock production inputs are furnished the obligor.\nExcept as otherwise provided in this section, an agricultural lien is subject to the provisions of the Uniform Commercial Code - Secured Transactions, sections 336.9-101 to 336.9-709.\n(a) Except as provided in paragraph (b), a perfected veterinarian's lien under this section has priority over all competing security interests and all agricultural liens on the same animals.\n(b) If more than one veterinarian's lien is perfected under this section, the conflicting perfected veterinarian's liens have priority in order of the effectiveness of the liens.\n(c) Except as provided in paragraph (d), a perfected feeder's lien under this section has priority over all competing security interests and all agricultural liens except a perfected veterinarian's lien in the livestock and the products or proceeds thereof.\n(d) If more than one feeder's lien is perfected under this section, the conflicting perfected feeder's liens have priority in order of the effectiveness of the liens.\n(e) A perfected breeder's lien under this section has priority over all competing security interests and all agricultural liens except a perfected veterinarian's lien and a perfected feeder's lien in the livestock and the products and proceeds thereof.\n(f) Except as provided in paragraph (g), a perfected livestock production input lien under this section has priority against all agricultural liens except a perfected veterinarian's lien, feeder's lien, and breeder's lien in the livestock and the products or proceeds thereof.\n(g) If more than one livestock production input lien is perfected under this section, conflicting perfected livestock production input liens have priority in order of the effectiveness of the liens.\n(h) Except as provided in paragraph (i), a perfected livestock production input lien under this section has priority against all competing security interests as provided in subdivision 3 in livestock and the products and proceeds thereof.\n(i) A perfected livestock production input lien has priority over a competing security interest in the livestock and proceeds and products thereof if the livestock production input lien is effective before the secured party has given value to the debtor.\nDefault occurs when an obligor fails to perform any obligation, whether written or oral, owed to the agricultural lienholder.\nThe holder of an agricultural lien under this section may enforce the lien in the manner provided in sections 336.9-601 to 336.9-628.",
	"repealed": false
}