{
	"id": "147C.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/147C.25",
	"title": "147C.25 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "Two years after the date of initial licensure, and every two years thereafter, a licensee applying for license renewal must complete a minimum of 24 contact hours of board-approved continuing education in the two years preceding license renewal and attest to completion of continuing education requirements by reporting to the board.\nThe board shall approve continuing education programs that have been approved for continuing education credit by the American Association of Respiratory Care or the Minnesota Society for Respiratory Care or their successor organizations. The board shall also approve programs substantially related to respiratory therapy that are sponsored by an accredited university or college, medical school, state or national medical association, national medical specialty society, or that are approved for continuing education credit by the Minnesota Board of Nursing.\nThe board shall also approve continuing education programs that do not meet the requirements of subdivision 2 but that meet the following criteria:\n(1) the program content directly relates to the practice of respiratory therapy;\n(2) each member of the program faculty is knowledgeable in the subject matter as demonstrated by a degree from an accredited education program, verifiable experience in the field of respiratory therapy, special training in the subject matter, or experience teaching in the subject area;\n(3) the program lasts at least one contact hour;\n(4) there are specific, measurable, written objectives, consistent with the program, describing the expected outcomes for the participants; and\n(5) the program sponsor has a mechanism to verify participation and maintains attendance records for three years.\nHospital, health care facility, or medical company in-service programs may qualify for continuing education credits provided they meet the requirements of this section.\nA licensee may not apply contact hours acquired in one two-year reporting period to a future continuing education reporting period.\nThe board shall periodically select a random sample of licensees and require those licensees to supply the board with evidence of having completed the continuing education to which they attested. Documentation may come directly from the licensee or from state or national organizations that maintain continuing education records.\nA licensee may apply no more than a combined total of eight hours of continuing education in the areas of management, risk management, personal growth, and educational techniques to a two-year reporting period.\nA licensee may fulfill the continuing education requirements for a two-year reporting period by achieving a qualifying score on one of the credentialing examinations or a specialty credentialing examination of the National Board for Respiratory Care or another board-approved testing organization. A licensee may achieve 12 hours of continuing education credit by completing a National Board for Respiratory Care or other board-approved testing organization's specialty examination.",
	"repealed": false
}