{
	"id": "611A.039",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.039",
	"title": "611A.039 RIGHT TO NOTICE OF FINAL DISPOSITION OF CRIMINAL CASE.",
	"text": "(a) Except as otherwise provided in subdivision 2, within 15 working days after a conviction, acquittal, or dismissal in a criminal case in which there is an identifiable crime victim, the prosecutor shall make reasonable good faith efforts to provide to each affected crime victim oral or written notice of the final disposition of the case and of the victim rights under section 611A.06. When the court is considering modifying the sentence for a felony or a crime of violence or an attempted crime of violence, the prosecutor shall make a reasonable and good faith effort to notify the victim of the crime. The notice must include:\n(1) the date and approximate time of the review;\n(2) the location where the review will occur;\n(3) the name and telephone number of a person to contact for additional information; and\n(4) a statement that the victim may provide input to the court concerning the sentence modification.\n(b) The Office of Justice Programs in the Department of Public Safety shall develop and update a model notice of postconviction rights under this subdivision and section 611A.06.\n(c) As used in this section:\n(1) \"crime of violence\" has the meaning given in section 624.712, subdivision 5, and also includes violations of section 609.3458, gross misdemeanor violations of section 609.224, and nonfelony violations of sections 518B.01, 609.2231, 609.3451, 609.748, and 609.749; and\n(2) \"victim\" has the meaning given in section 611A.01, paragraph (b).\nIf a prosecutor contacts an identifiable crime victim in advance of the final case disposition, either orally or in writing, and notifies the victim of the victim's right to request information on the final disposition of the case, the prosecutor shall only be required to provide the notice described in subdivision 1 to those victims who have indicated in advance their desire to be notified of the final case disposition.",
	"repealed": false
}