{
	"id": "611A.675",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.675",
	"title": "611A.675 FUND FOR EMERGENCY NEEDS OF CRIME VICTIMS.",
	"text": "The commissioner of public safety shall make grants to prosecutors and victim assistance programs for the purpose of providing emergency assistance to victims. As used in this section, \"emergency assistance\" includes but is not limited to:\n(1) replacement of necessary property that was lost, damaged, or stolen as a result of the crime;\n(2) purchase and installation of necessary home security devices;\n(3) transportation to locations related to the victim's needs as a victim, such as medical facilities and facilities of the criminal justice system;\n(4) cleanup of the crime scene;\n(5) reimbursement for reasonable travel and living expenses the victim incurred to attend court proceedings that were held at a location other than the place where the crime occurred due to a change of venue; and\n(6) reimbursement of towing and storage fees incurred due to impoundment of a recovered stolen vehicle.\n(a) A city or county attorney's office or victim assistance program may apply to the commissioner of public safety for a grant for any of the purposes described in subdivision 1 or for any other emergency assistance purpose approved by the commissioner. The application must be on forms and pursuant to procedures developed by the commissioner. The application must describe the type or types of intended emergency assistance, estimate the amount of money required, and include any other information deemed necessary by the commissioner.\n(b) A city or county attorney's office or victim assistance program that applies for a grant for the purpose described in subdivision 1, clause (6), must make the application on a separate form and pursuant to procedures developed by the commissioner. The application must estimate the amount of money required for reimbursement costs, estimate the amount of money required for administrative costs, and include any other information deemed necessary by the commissioner. An applicant may not spend in any fiscal year more than five percent of the grant awarded for administrative costs.\n(a) No award may be granted under subdivision 1, clause (6), to a victim that fails to provide proof of insurance stating that security had been provided for the vehicle at the time the vehicle was stolen. As used in this paragraph, \"proof of insurance\" has the meaning given it in section 169.791, subdivision 1, paragraph (g).\n(b) An award paid to a victim under subdivision 1, clause (6), shall compensate the victim for actual costs incurred but shall not exceed $300.\nA city or county attorney's office or victim assistance program that receives a grant under this section shall file an annual report with the commissioner of public safety itemizing the expenditures made during the preceding year, the purpose of those expenditures, and the ultimate disposition, if any, of each assisted victim's criminal case.\nBy February 1, 2008, the commissioner of public safety shall report to the chairs and ranking members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and funding on the implementation, use, and administration of the grant programs created under this section.",
	"repealed": false
}