{
	"id": "94.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.09",
	"title": "94.09 SALE AND DISPOSITION OF SURPLUS STATE-OWNED LAND.",
	"text": "All tracts or lots of real property belonging to the state and under the control and supervision of the commissioner of natural resources shall be disposed of according to sections 94.09 to 94.16, unless otherwise provided by law.\n[Repealed, 2004 c 262 art 1 s 41]\nThe commissioner of natural resources shall send written notice to the Departments of Administration and Transportation, the Board of Water and Soil Resources, the Office of School Trust Lands, the legal or land departments of the University of Minnesota and Minnesota State Colleges and Universities, the Minnesota Indian Affairs Council, and any other state department or agency that requests to receive notices describing any lands or tracts that may be declared surplus. If a recipient of the notice desires custody of the lands or tracts, the recipient must submit a written request to the commissioner no later than four calendar weeks after mailing of the notice setting forth in detail the reasons for desiring to acquire and the intended use of the land or tract. The commissioner shall then determine whether any of the lands so requested should be declared surplus and offered for sale or otherwise disposed of by transferring custodial control to other requesting state departments or agencies or to the Board of Regents of the University of Minnesota for educational purposes, provided however that transfer to the Board of Regents is not determinative of tax exemption or immunity. If the commissioner determines that any of the lands are no longer needed for state purposes, the commissioner shall make findings of fact, describe the lands, declare the lands to be surplus state land, and state the reasons for the sale or disposition of the lands.\n[Repealed, 2004 c 262 art 1 s 41]\n[Repealed, 2004 c 262 art 1 s 41]\n[Repealed, 2004 c 262 art 1 s 41]",
	"repealed": false
}