{
	"id": "10A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.15",
	"title": "10A.15 CONTRIBUTIONS.",
	"text": "A political committee, political fund, principal campaign committee, or party unit may not retain an anonymous contribution in excess of $20, but must forward it to the board for deposit in the general account of the state elections campaign account.\nAn individual who receives a contribution in excess of $20 for a political committee, political fund, principal campaign committee, or party unit must, on demand of the treasurer, inform the treasurer of the name and, if known, the address of the source of the contribution, the amount of the contribution, and the date it was received.\n(a) A monetary contribution not made through electronic means is received for reporting and contribution limit purposes when the contribution is physically received by the treasurer, the candidate, or a committee, fund, or party unit worker.\n(b) A contribution delivered through the United States mail is received on the date the mail is collected from the delivery point by the treasurer or candidate, or by a committee, fund, or party unit worker.\n(c) A monetary contribution made through electronic means is received on the date that the contributor makes the contribution to the contribution processor for the following purposes:\n(1) the registration requirements in section 10A.14;\n(2) the reporting requirements in section 10A.20;\n(3) the requirements related to contributions during the legislative session in section 10A.273; and\n(4) the affidavit of contributions requirement in section 10A.323.\n(d) A monetary contribution made through electronic means is received for purposes of the deposit requirements in subdivision 3 on the date that the treasurer or candidate, or the committee, fund, or party unit worker has access to the funds under the terms of the agreement with the contribution processor.\nAll contributions received by or on behalf of a candidate, principal campaign committee, political committee, political fund, or party unit must be placed in a depository account designated \"Campaign Fund of ..... (name of candidate, committee, fund, or party unit).\" All contributions must be deposited promptly upon receipt and, except for contributions received during the last three days of a reporting period as described in section 10A.20, must be deposited during the reporting period in which they were received. A contribution received during the last three days of a reporting period must be deposited within 72 hours after receipt and must be reported as received during the reporting period whether or not deposited within that period. A contribution must not be deposited in any other account prior to being deposited within a depository of the principal campaign committee, political committee, political fund, or party unit. However, a contribution may temporarily be held within a digital wallet or other account immediately after receipt if the recipient principal campaign committee, political committee, political fund, or party unit has sole ownership of that account. A candidate, principal campaign committee, political committee, political fund, or party unit may refuse to accept a contribution. A deposited contribution may be returned to the contributor within 90 days after deposit. A contribution deposited and not returned within 90 days after that deposit must be reported as accepted.\nA treasurer of a principal campaign committee of a candidate may not deposit a contribution that on its face exceeds the limit on contributions to the candidate prescribed by section 10A.27 unless, at the time of deposit, the treasurer issues a check to the source for the amount of the excess.\nContributions made to a candidate or principal campaign committee that are directed to the candidate or principal campaign committee by a political fund, committee, or party unit must be reported as attributable to the political fund, committee, or party unit and count toward the contribution limits of that fund, committee, or party unit specified in section 10A.27, if the fund, committee, or party unit was organized or is operated primarily to direct contributions other than from its own money to one or more candidates or principal campaign committees. The treasurer of the political fund, committee, or party unit must advise the candidate or the candidate's principal campaign committee if the contribution or contributions are not from the money of the fund, committee, or party unit and the original source of the money. As used in this subdivision, the term \"direct\" includes, but is not limited to, order, command, control, or instruct. A violation of this subdivision is a violation of section 10A.29.\nAn individual, association, political committee, political fund, or party unit may establish, finance, maintain, or control a political committee, political fund, or party unit. One who does this is a \"parent.\" The political committee, fund, or party unit so established, financed, maintained, or controlled is a \"subsidiary.\" If the parent is an association, the association must create a political committee or political fund to serve as the parent for reporting purposes. A subsidiary must report its contribution to a candidate or principal campaign committee as attributable to its parent, and the contribution is counted toward the contribution limits in section 10A.27 of the parent as well as of the subsidiary.\nAn individual violating this section is subject to a civil penalty imposed by the board of up to $1,000.\nA contribution made to a candidate or local candidate by a lobbyist, political committee, political fund, or party unit must show the name of the lobbyist, political committee, political fund, or party unit and the number under which it is registered with the board.\nMS 2020 [Repealed, 2021 c 31 art 4 s 33]\nAn organization that provides contribution processing and delivery services, when acting in the ordinary course of business by collecting and disbursing contributions to a committee or fund that was designated by the contributor, is not required to register under section 10A.14 or report under section 10A.20.\n(a) A principal campaign committee, political committee, political fund, or party unit may accept a donation in kind in the form of virtual currency. Any virtual currency contribution must be made and received through a virtual currency payment processor based in the United States that is registered with the United States Department of Treasury and which utilizes protocols to verify the identity of the contributor for all contributions. The value of donated virtual currency is its fair market value at the time it is donated. The recipient of a virtual currency contribution must sell the virtual currency in exchange for United States currency within five business days after receipt.\n(b) Any increase in the value of donated virtual currency after its donation, but before its conversion to United States currency, must be reported as a receipt that is not a contribution pursuant to section 10A.20, subdivision 3. Any decrease in the value of donated virtual currency after its donation, but before its conversion to United States currency, must be reported as an expenditure pursuant to section 10A.20, subdivision 3.\n(c) A principal campaign committee, political committee, political fund, or party unit may not purchase goods or services with virtual currency.\n(a) A principal campaign committee, political committee, political fund, or party unit may accept a contribution of money made using a mobile payment service or platform, a service that is dependent upon direct carrier billing, or a website.\n(b) A principal campaign committee, political committee, political fund, or party unit may not solicit or accept a contribution made using a mobile payment service or platform that, to a potential contributor, displays only the name of an individual as the recipient or displays a name for the recipient that is not substantially similar to the name under which the recipient is registered with the board.\n(c) A mobile payment contribution must be deposited pursuant to subdivision 3 before the funds received may be used to make an expenditure or disbursement other than payment of any processing fee charged for using the mobile payment service or platform.",
	"repealed": false
}