{
	"id": "358.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.72",
	"title": "358.72 PROHIBITED ACTS.",
	"text": "A commission as a notary public does not authorize an individual to:\n(1) assist persons in drafting legal records, give legal advice, or otherwise practice law;\n(2) act as an immigration consultant or an expert on immigration matters;\n(3) represent a person in a judicial or administrative proceeding relating to immigration to the United States, United States citizenship, or related matters; or\n(4) receive compensation for performing any of the activities listed in this subdivision.\nA notary public may not engage in false or deceptive advertising.\nA notary public may not use the term \"notario\" or \"notario publico.\"\nA notary public, other than an attorney licensed to practice law in this state, may not advertise that the notary public may assist persons in drafting legal records, give legal advice, or otherwise practice law. If a notary public who is not an attorney licensed to practice law in this state in any manner advertises that the notary public offers notarial services, whether orally or in a record, including broadcast media, print media, digital media, and the Internet, the notary public shall include the following statement, or an alternate statement authorized or required by the commissioning officer or agency, in the advertisement or representation, prominently and in each language used in the advertisement: \"I am not an attorney licensed to practice law in this state. I am not allowed to draft legal records, give advice on legal matters, including immigration, or charge a fee for those activities.\" If the form of advertisement is not broadcast media, print media, or the Internet, and does not permit the inclusion of the statement required by this subdivision because of size, it must be prominently displayed or provided at the place of performance of the notarial act before the notarial act is performed.\nExcept as otherwise allowed by law, a notary public may not withhold access to or possession of an original record provided by a person that seeks performance of a notarial act by the notary public.",
	"repealed": false
}