{
	"id": "148.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.01",
	"title": "148.01 CHIROPRACTIC.",
	"text": "For the purposes of sections 148.01 to 148.10:\n(1) \"chiropractic\" means the health care discipline that recognizes the innate recuperative power of the body to heal itself without the use of drugs or surgery by identifying and caring for vertebral subluxations and other abnormal articulations by emphasizing the relationship between structure and function as coordinated by the nervous system and how that relationship affects the preservation and restoration of health;\n(2) \"chiropractic services\" means the evaluation and facilitation of structural, biomechanical, and neurological function and integrity through the use of adjustment, manipulation, mobilization, or other procedures accomplished by manual or mechanical forces applied to bones or joints and their related soft tissues for correction of vertebral subluxation, other abnormal articulations, neurological disturbances, structural alterations, or biomechanical alterations, and includes, but is not limited to, manual therapy and mechanical therapy as defined in section 146.23;\n(3) \"abnormal articulation\" means the condition of opposing bony joint surfaces and their related soft tissues that do not function normally, including subluxation, fixation, adhesion, degeneration, deformity, dislocation, or other pathology that results in pain or disturbances within the nervous system, results in postural alteration, inhibits motion, allows excessive motion, alters direction of motion, or results in loss of axial loading efficiency, or a combination of these;\n(4) \"diagnosis\" means the physical, clinical, and laboratory examination of the patient, and the use of diagnostic services for diagnostic purposes within the scope of the practice of chiropractic described in sections 148.01 to 148.10;\n(5) \"diagnostic services\" means clinical, physical, laboratory, and other diagnostic measures, including diagnostic imaging that may be necessary to determine the presence or absence of a condition, deficiency, deformity, abnormality, or disease as a basis for evaluation of a health concern, diagnosis, differential diagnosis, treatment, further examination, or referral;\n(6) \"therapeutic services\" means rehabilitative therapy as defined in Minnesota Rules, part 2500.0100, subpart 11, and all of the therapeutic, rehabilitative, and preventive sciences and procedures for which the licensee was subject to examination under section 148.06. When provided, therapeutic services must be performed within a practice where the primary focus is the provision of chiropractic services, to prepare the patient for chiropractic services, or to complement the provision of chiropractic services. The administration of therapeutic services is the responsibility of the treating chiropractor and must be rendered under the direct supervision of qualified staff;\n(7) \"acupuncture\" means a modality of treating abnormal physical conditions by stimulating various points of the body or interruption of the cutaneous integrity by needle insertion to secure a reflex relief of the symptoms by nerve stimulation as utilized as an adjunct to chiropractic adjustment. Acupuncture may not be used as an independent therapy or separately from chiropractic services. Acupuncture is permitted under section 148.01 only after registration with the board which requires completion of a board-approved course of study and successful completion of a board-approved national examination on acupuncture. Renewal of registration shall require completion of board-approved continuing education requirements in acupuncture. The restrictions of section 147B.02, subdivision 2, apply to individuals registered to perform acupuncture under this section; and\n(8) \"animal chiropractic diagnosis and treatment\" means treatment that includes identifying and resolving vertebral subluxation complexes, spinal manipulation, and manipulation of the extremity articulations of nonhuman vertebrates. Animal chiropractic diagnosis and treatment does not include:\n(i) performing surgery;\n(ii) dispensing or administering of medications; or\n(iii) performing traditional veterinary care and diagnosis.\nA licensed chiropractor may engage in the practice of animal chiropractic diagnosis and treatment if registered to do so by the board, and if the animal has been referred to the chiropractor by a veterinarian.\nCriteria for registration to engage in the practice of animal chiropractic diagnosis and treatment must be set by the board, and must include, but are not limited to: active chiropractic license; education and training in the field of animal chiropractic from an American Veterinary Chiropractic Association, International Veterinary Chiropractic Association, or higher institution-approved course consisting of no less than 210 hours, meeting continuing education requirements; and other conditions and rules set by the board. The board shall consult with the State Board of Veterinary Medicine in preparing proposed rules on animal chiropractic.\nNotwithstanding the limitations established in section 156.12, subdivision 4, a doctor of chiropractic properly registered to provide chiropractic care to animals in accordance with this chapter and rules of the board may use the title \"animal chiropractor.\"\nUpon approval by the board, a licensed chiropractor who has already taken and passed the education and training requirement set forth in subdivision 1b may engage in the practice of animal chiropractic during the time that the rules are being promulgated by the board. Enforcement actions may not be taken against persons who have completed the approved program of study by the American Veterinary Chiropractic Association or the International Veterinary Chiropractic Association until the rules have been adopted by the board.\nThe practice of chiropractic is not the practice of medicine, surgery, osteopathic medicine, or physical therapy.\n[Repealed, 2014 c 291 art 4 s 59]\nAn individual licensed to practice under section 148.06 is authorized to perform chiropractic services, acupuncture, and therapeutic services, and to provide diagnosis and to render opinions pertaining to those services for the purpose of determining a course of action in the best interests of the patient, such as a treatment plan, appropriate referral, or both.",
	"repealed": false
}