{
	"id": "84.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.415",
	"title": "84.415 UTILITY LICENSES; PERMITS.",
	"text": "The commissioner of natural resources shall, on or before January 1, 1974, promulgate in the manner provided by chapter 15, rules containing standards and criteria governing the sale of licenses permitting the passage of utilities over public lands and waters. The rules shall include provisions to insure that all projects for which licenses are sold will have a minimum adverse impact on the environment. The commissioner of natural resources may, at public or private sale and for such price and upon such terms as are specified in the rules (except where prohibited by law) grant licenses permitting passage over, under, or across any part of any school, university, internal improvement, swamp, tax-forfeited or other land or public water under the control of the commissioner of natural resources, of telephone, telegraph, and electric power lines, cables or conduits, underground or otherwise, or mains or pipe lines for gas, liquids, or solids in suspension. Any such license shall be cancelable upon reasonable notice by the commissioner for substantial violation of its terms, or if at any time its continuance will conflict with a public use of the land or water over or upon which it is granted, or for any other cause. All such land or public water shall remain subject to sale or lease or other legal use, but in case of sale, lease or other use there may be excepted from the grant or other disposition of land or public water all rights included in any license over, under, or across it, and the license may contain an agreement that there will be such exception. The commissioner may charge a fee in lieu of but not less than that authorized by subdivision 5 if issuing a license containing an agreement that there will be such an exception. All rights so excepted shall be reserved to the state and be cancelable by the commissioner for the same reasons or cause as they might have been canceled before such sale, lease or other use of the land or water. Upon such cancellation, which shall be only after reasonable notice to the licensee, all rights granted by the license shall be vested in the state and may be granted again by the commissioner on the terms and conditions the commissioner may prescribe, but subject to cancellation for the same reasons or causes as they might have been originally canceled unless ownership of the fee and of the license are merged. Any license granted before April 13, 1951, may be governed by it if the licensee and commissioner so agree. Reasonable notice as used in this subdivision means a 90-day written notice addressed to the record owner of the license at the last known address, and upon cancellation the commissioner may grant extensions of time to vacate the premises affected.\n[Repealed, 1967 c 536 s 3]\nThe application for license or permit must include a legal description of the lands or waters affected, a metes and bounds description of the required right-of-way, a map showing said features, and a detailed design of any structures necessary, or in lieu thereof shall be in such other form, and include such other descriptions, maps or designs, as the commissioner may require. The commissioner may at any time order such changes or modifications respecting construction or maintenance of structures or other conditions of the license or permit as the commissioner deems necessary to protect the public health and safety.\nAn application for a utility license may cover more than one type of utility if the utility lines are being installed for residential use only. Separate applications submitted by utilities for the same crossing shall be joined together and processed as one application, provided that the applications are submitted within one year of each other and the utility lines are for residential use only. The application fees for a joint application or separate applications subsequently joined together shall be as if only one application was submitted.\nThe license or permit to be granted shall be in a form to be prescribed by the attorney general; shall describe the location of the license or permit thereby granted and shall continue until canceled by the commissioner, subject to change or modification as herein provided.\n(a) In the event the construction of lines causes damage to timber or other property of the state on or along the same, the license or permit shall also provide for payment to the commissioner of management and budget of the amount of the damages as determined by the commissioner.\n(b) The application fee specified in Minnesota Rules is credited to the general fund.\n(c) The utility crossing fees specified in Minnesota Rules shall be credited to the fund to which other income or proceeds of sale from the land would be credited as provided by law, otherwise to the general fund.\n(d) Money received from licenses and permits issued under this section for use of the beds of navigable waters shall be credited to the permanent school fund.\n(e) Money received under subdivision 6 must be credited to the land management account in the natural resources fund and is appropriated to the commissioner of natural resources to cover the costs incurred for issuing and monitoring utility licenses.\n(a) In addition to the application fee and utility crossing fees specified in Minnesota Rules, the commissioner of natural resources shall assess the applicant for a utility license the following fees:\n(1) to cover reasonable costs for reviewing an application and preparing a license, supplemental application fees as follows:\n(i) $1,750 for a public water crossing license and $3,000 for a public lands crossing license for electric power lines, cables, or conduits of 100 kilovolts or more and for main pipelines for gas, liquids, or solids in suspension;\n(ii) $1,000 for a public water crossing license and $1,000 for a public lands crossing license for applications to which item (i) does not apply; and\n(iii) for all applications, an additional $500 for each water crossing or land crossing in excess of two crossings; and\n(2) a monitoring fee to cover the projected reasonable costs for monitoring the construction of the utility line and preparing special terms and conditions of the license to ensure proper construction. The commissioner must give the applicant an estimate of the monitoring fee before the applicant submits the fee.\n(b) The applicant shall pay fees under this subdivision to the commissioner of natural resources. The commissioner shall not issue the license until the applicant has paid all fees in full.\n(c) Upon completion of construction of the improvement for which the license or permit was issued, the commissioner shall refund the unobligated balance from the monitoring fee revenue. The commissioner shall not return the application fees, even if the application is withdrawn or denied.\n(d) For purposes of this subdivision:\n(1) \"water crossing\" means each location where the proposed utility will cross a public water between banks or shores; and\n(2) \"land crossing\" means each quarter-quarter section or government lot where the proposed utility will cross public land.\n(a) A utility license for crossing public lands or public waters is exempt from all application fees specified in rules adopted under this section.\n(b) This subdivision does not apply to electric power lines, cables, or conduits 100 kilovolts or greater or to main pipelines for gas, liquids, or solids in suspension.\nIn addition to fees specified in this section or in rules adopted by the commissioner, the applicant must reimburse the state for costs incurred for cultural resources review, monitoring, or other services provided by the Minnesota Historical Society under contract with the commissioner of natural resources or the State Historic Preservation Office of the Department of Administration in connection with the license application, preparing the license terms, or constructing the utility line.\nAt the end of the license period, if both parties wish to renew a license, the commissioner must assess the applicant for all fees in this section as if the renewal is an application for a new license.",
	"repealed": false
}