{
	"id": "481.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/481.10",
	"title": "481.10 CONSULTATION WITH PERSONS RESTRAINED.",
	"text": "All officers or persons having in their custody a person restrained of liberty, except in cases where imminent danger of escape or injury exists, shall admit any attorney retained by or on behalf of the person restrained, or whom the restrained person may desire to consult, to a private interview at the place of custody. Such custodians, upon request of the person restrained, as soon as practicable, and before other proceedings shall be had, shall notify the attorney of the request for a consultation with the attorney.\nExcept as provided in subdivision 3 and except in cases where imminent danger of escape or injury exists, all officers or persons having in their custody a person restrained of liberty whether or not the person restrained has been charged, tried, or convicted, shall provide private telephone access to any attorney retained by or on behalf of the person restrained, or whom the restrained person may desire to consult at no charge to the attorney or to the person restrained. Reasonable telephone access under this subdivision shall be provided following the request of the person restrained and before other proceedings shall be had regarding the alleged offense causing custody.\nExcept in cases where imminent danger of escape or injury exists, all officers or persons having in their custody a person restrained of liberty while serving an executed sentence in a state correctional facility, shall provide private telephone access to any attorney retained by or on behalf of the person restrained, or whom the restrained person may desire to consult at no charge to the attorney or to the person restrained. Telephone access under this subdivision shall be provided following the request of the person restrained and in accordance with policies adopted by the institution that meet constitutional requirements.\n(a) Except as provided in paragraph (b), whoever violates subdivision 1 or 2 is guilty of a misdemeanor and shall also forfeit $100 to the person aggrieved, to be recovered in a civil action.\n(b) The penalties described in paragraph (a) do not apply to officers or persons having in their custody persons restrained of liberty while serving an executed sentence in a state correctional facility.",
	"repealed": false
}