{
	"id": "56.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.131",
	"title": "56.131 MAXIMUM RATES AND CHARGES.",
	"text": "(a) On any loan in a principal amount not exceeding $100,000 or 15 percent of a Minnesota corporate licensee's capital stock and surplus as defined in section 53.015, if greater, a licensee may contract for and receive interest, finance charges, and other charges as provided in section 47.59.\n(b) A licensee making a loan that is a consumer small loan, as defined in section 47.60, subdivision 1, paragraph (a), must comply with section 47.60. A licensee making a loan that is a consumer short-term loan, as defined in section 47.601, subdivision 1, paragraph (d), must comply with section 47.601.\n(c) With respect to a loan secured by an interest in real estate, and having a maturity of more than 60 months, the original schedule of installment payments must fully amortize the principal and interest on the loan. The original schedule of installment payments for any other loan secured by an interest in real estate must provide for payment amounts that are sufficient to pay all interest scheduled to be due on the loan.\n(d) A licensee may contract for and collect a delinquency charge as provided for in section 47.59, subdivision 6, paragraph (a), clause (4).\n(e) A licensee may grant extensions, deferments, or conversions to interest-bearing as provided in section 47.59, subdivision 5.\nIn addition to the charges provided for by this section and section 56.155, and notwithstanding section 47.59, subdivision 6, to the contrary, no further or other amount whatsoever, shall be directly or indirectly charged, contracted for, or received for the loan made, except actual out of pocket expenses of the licensee to realize on a security after default, and except for the following additional charges which may be included in the principal amount of the loan:\n(a) lawful fees and taxes paid to any public officer to record, file, or release security;\n(b) with respect to a loan secured by an interest in real estate, the following closing costs, if they are bona fide, reasonable in amount, and not for the purpose of circumvention or evasion of this section; provided the costs do not exceed one percent of the principal amount or $760, whichever is greater:\n(1) fees or premiums for title examination, abstract of title, title insurance, surveys, or similar purposes;\n(2) fees, if not paid to the licensee, an employee of the licensee, or a person related to the licensee, for preparation of a mortgage, settlement statement, or other documents, fees for notarizing mortgages and other documents, and appraisal fees;\n(c) the premium for insurance in lieu of perfecting and releasing a security interest to the extent that the premium does not exceed the fees described in paragraph (a);\n(d) discount points and appraisal fees may not be included in the principal amount of a loan secured by an interest in real estate when the loan is a refinancing for the purpose of bringing the refinanced loan current and is made within 24 months of the original date of the refinanced loan. For purposes of this paragraph, a refinancing is not considered to be for the purpose of bringing the refinanced loan current if new funds advanced to the customer, not including closing costs or delinquent installments, exceed $1,900; and\n(e) the onetime loan administrative fee in section 47.59, subdivision 6, paragraph (d).\nNo licensee shall induce or permit any borrower to split up or divide any loan or permit any person to become obligated under more than one contract of loan for the same purpose or at the same time for the purpose or with the result of obtaining a higher rate of charge than would otherwise be permitted by this section. However, if a person becomes obligated on a contract of loan as an accommodation party, a preceding or subsequent loan to that person is not a violation of this subdivision nor shall such loans be aggregated in determining the applicable rate of charge.\nThe dollar amounts in subdivisions 2 and 6, sections 56.12 and 56.125 shall change periodically, as provided in section 47.59, subdivision 3.\nNo term of writing may provide for the payment by the debtor of attorney's fees, except for lawful fees to be paid to an attorney in connection with the foreclosure of a real estate mortgage.\nA loan made under this section that is secured by real estate and that is in a principal amount of $22,800 or more and has a maturity of 60 months or more may contain a provision permitting discount points, if the loan does not provide a loan yield in excess of the maximum rate of interest permitted by this section. Loan yield means the annual rate of return obtained by a licensee computed as the annual percentage rate is computed under Federal Regulation Z. If the loan is prepaid in full, the licensee must make a refund to the borrower to the extent that the loan yield will exceed the maximum rate of interest provided by this section when the prepayment is taken into account. Discount points permitted by this subdivision and not collected but included in the principal amount must not be included in the amount on which credit insurance premiums are calculated and charged.",
	"repealed": false
}