{
	"id": "216C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.16",
	"title": "216C.16 STATE PETROLEUM SET-ASIDE PROGRAM.",
	"text": "The purpose of this section is to grant to the commissioner authority to exercise specific power to deal with shortages of refined petroleum products. Authority granted shall be exercised for the purpose of minimizing the adverse impacts of shortages and dislocations upon the citizens and the economy of the state and nation.\nThe commissioner shall establish and is responsible for a state set-aside system for motor gasoline and middle distillates to provide emergency petroleum requirements and thereby relieve the hardship caused by shortage, supply dislocations, or other emergencies. The commissioner, for purposes of administration, may exercise all of the powers granted by this chapter.\nAs used in this section:\n(a) \"Middle distillates\" means distillates obtained between kerosene and lubricating oil fractions in the refining process, including but not limited to, kerosene, number one and number two heating oil and diesel fuel.\n(b) \"Motor gasoline\" means a liquid mixture of hydrocarbons produced by the distillation of petroleum and used chiefly as a fuel in internal combustion engines.\n(c) \"Prime supplier\" means the producer or supplier now or hereafter making the first sale of middle distillates or motor gasoline subject to the state set-aside for consumption within the state.\n(d) \"State set-aside\" means the amount of middle distillates or motor gasoline required to be made available by a prime supplier for utilization by the commissioner to resolve or mitigate emergencies or hardships due to shortages of supply.\nEvery prime supplier shall allocate for sale or exchange monthly upon order of the commissioner a volume of motor gasoline and middle distillate not exceeding the monthly set-aside amount. The amount of gasoline subject to monthly set-aside shall be an amount equal to three percent of the prime supplier's monthly supply estimate. The amount of middle distillate subject to monthly set-aside shall be an amount equal to four percent of the prime supplier's monthly supply estimate.\nEvery prime supplier shall file with the commissioner a monthly report of its estimated volume of gasoline and middle distillate deliveries. The report shall be in a form prescribed by the commissioner and shall be submitted by the 25th day of the month preceding the month covered by the report. Each prime supplier shall allocate monthly for sale or exchange upon order of the commissioner three percent of estimated motor gasoline supplies and four percent of estimated middle distillate supplies as shown by the report.\nEach prime supplier shall designate a representative to act for and on behalf of the prime supplier in respect to department state set-aside orders to be issued to the prime supplier. A prime supplier shall provide the amount of allocated product stated in the energy state set-aside order.\nThe commissioner shall adopt rules to govern the administration of the set-aside system. Rules shall cover matters such as the form and procedure for applications for set-aside allocations by dealers of bulk purchasers, reports on available gasoline and middle distillate supplies, orders and procedure for set-aside allocation and distribution and other rules deemed necessary or desirable in the implementation and administration of the set-aside system, including monthly reports of anticipated deliveries and actual sales of gasoline, middle distillates, propane, aviation fuels, and residual oils.\nThe commissioner may allocate gasoline and middle distillates from the set-aside system in accordance with the criteria in section 216C.15 and rules adopted pursuant thereto. The commissioner may prescribe additional priorities by rule.",
	"repealed": false
}