{
	"id": "325E.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.80",
	"title": "325E.80 ABNORMAL MARKET DISRUPTIONS; UNCONSCIONABLY EXCESSIVE PRICES.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Essential consumer good or service\" means a good or service that is vital and necessary for the health, safety, and welfare of the public, including without limitation: food; water; fuel; gasoline; shelter; construction materials; transportation; health care services; pharmaceuticals; and medical, personal hygiene, sanitation, and cleaning supplies.\n(c) \"Restoration and mitigation services provider\" means a person or business that provides a service to prevent further damage to property following a fire, smoke, water, or storm event. Services include but are not limited to boarding up property; water extraction; drying; smoke or odor removal; cleaning; and personal property inventory, removal, and storage.\n(d) \"Seller\" means a manufacturer, supplier, wholesaler, distributor, or retail seller of goods and services.\n(e) \"Tree trimmer\" means a person registered under section 18G.07.\n(f) \"Unconscionably excessive price\" means a price that represents a gross disparity compared to the seller's average price of an essential good or service, offered for sale or sold in the usual course of business, in the 60-day period before an abnormal market disruption is declared under subdivision 2. None of the following is an unconscionably excessive price:\n(1) a price that is substantially related to an increase in the cost of manufacturing, obtaining, replacing, providing, or selling a good or service;\n(2) a price that is no more than 25 percent above the seller's average price during the 60-day period before an abnormal market disruption is declared under subdivision 2;\n(3) a price that is consistent with the fluctuations in applicable commodity markets or seasonal fluctuations; or\n(4) a contract price, or the results of a price formula, that was established before an abnormal market disruption is declared under subdivision 2.\n(a) The governor may by executive order declare an abnormal market disruption if, in the governor's sole determination, there has been or is likely to be a substantial and atypical change in the market for an essential consumer good or service caused by an event or circumstances that result in a declaration of a state of emergency by the governor. The governor may specify an effective period for a declaration under this section that is shorter than the effective period for the state of emergency declaration.\n(b) The governor's abnormal market disruption declaration must state that the declaration is activating this section and must specify the geographic area of Minnesota to which the declaration applies.\n(c) Unless an earlier date is specified by the governor, an abnormal market disruption declaration under this subdivision terminates 30 days after the date that the state of emergency for which it was activated ends.\nUpon the implementation, renewal, limitation, or termination of an abnormal market disruption declaration made under subdivision 2: (1) the governor must immediately post notice on applicable government websites and provide notice to the media; and (2) the commissioner of commerce must provide notice directly to sellers by any practical means.\nIf the governor declares an abnormal market disruption, a person is prohibited from selling or offering to sell an essential consumer good or service for an amount that represents an unconscionably excessive price during the period in which the abnormal market disruption declaration is effective.\nUpon the occurrence of a weather event classified as a severe thunderstorm pursuant to the criteria established by the National Oceanic and Atmospheric Administration, a residential building contractor, tree trimmer, or restoration and mitigation services provider operating within the geographic region impacted by the weather event and repairing damage caused by the weather event shall not:\n(1) charge an unconscionably excessive price for labor in comparison to the market price charged for comparable services in the geographic region impacted by the weather event; or\n(2) charge an insurance company a rate that exceeds what the residential building contractor, tree trimmer, or restoration and mitigation services provider would otherwise charge a member of the general public.\nA person who is found to have violated subdivision 4 is subject to a civil penalty of not more than $1,000 per sale or transaction, with a maximum penalty of $25,000 per day. No other penalties may be imposed for the same conduct regulated under subdivision 4.\n(a) The attorney general may investigate and bring an action using the authority under section 8.31 against a seller, residential building contractor, tree trimmer, or restoration and mitigation services provider for an alleged violation of this section.\n(b) Nothing in this section creates a private cause of action in favor of a person injured by a violation of this section.",
	"repealed": false
}