{
	"id": "124D.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.98",
	"title": "124D.98 LITERACY INCENTIVE AID.",
	"text": "A district's literacy incentive aid equals the sum of the proficiency aid under subdivision 2, and the growth aid under subdivision 3.\nThe proficiency aid for each school in a district that has submitted to the commissioner its local literacy plan under section 120B.12, subdivision 4a, is equal to the product of the school's proficiency allowance times the number of third grade pupils at the school on October 1 of the previous fiscal year. A school's proficiency allowance is equal to the percentage of students in each building that meet or exceed proficiency on the third grade reading Minnesota Comprehensive Assessment, averaged across the previous three test administrations, times $530.\nThe growth aid for each school in a district that has submitted to the commissioner its local literacy plan under section 120B.12, subdivision 4a, is equal to the product of the school's growth allowance times the number of fourth grade pupils enrolled at the school on October 1 of the previous fiscal year. A school's growth allowance is equal to the percentage of students at that school making medium or high growth, under subdivision 4, on the fourth grade reading Minnesota Comprehensive Assessment, averaged across the previous three test administrations, times $530.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Medium growth\" is an assessment score within one-half standard deviation above or below the average year-two assessment scores for students with similar year-one assessment scores.\n(c) \"High growth\" is an assessment score one-half standard deviation or more above the average year-two assessment scores for students with similar year-one assessment scores.\nA school district must use its literacy incentive aid to support implementation of evidence-based reading instruction. The following are eligible uses of literacy incentive aid:\n(1) training for kindergarten through grade 3 teachers, early childhood educators, special education teachers, reading intervention teachers working with students in kindergarten through grade 12, curriculum directors, and instructional support staff that provide reading instruction, on using evidence-based screening and progress monitoring tools;\n(2) evidence-based training using a training program approved by the Department of Education under the Read Act;\n(3) employing or contracting with a literacy lead, as defined in section 120B.119;\n(4) employing an intervention specialist;\n(5) approved screeners, materials, training, and ongoing coaching to ensure reading interventions under section 125A.56, subdivision 1, are evidence-based;\n(6) costs of substitute teachers to allow teachers to complete required training during the teachers' contract day; and\n(7) stipends for teachers completing training required under section 120B.12.",
	"repealed": false
}