{
	"id": "97B.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.022",
	"title": "97B.022 APPRENTICE-HUNTER/TRAPPER VALIDATION.",
	"text": "For the purpose of this section, \"accompanied\" means to stay within a distance of another person that permits uninterrupted visual contact and unaided verbal communication.\n(a) A resident or nonresident born after December 31, 1979, who is age 12 or over and who does not possess a hunter education firearms safety certificate or a resident or nonresident born after December 31, 1989, who does not possess a trapper education certificate may be issued an apprentice-hunter/trapper validation. An apprentice-hunter/trapper validation may be purchased two license years in a lifetime and used to obtain hunting or trapping licenses during the same license year that the validation is purchased.\n(b) An individual in possession of an apprentice-hunter/trapper validation may take small game, deer, and bear only when accompanied by an adult who has a valid license to take the same species of game in Minnesota and whose license was not obtained using an apprentice validation.\n(c) When an individual in possession of an apprentice-hunter/trapper validation is hunting turkey or prairie chicken under paragraph (b), the accompanying adult may be licensed for another permit area or time period but must be licensed for the same season as the apprentice hunter. If the accompanying adult is not licensed for the same permit area or time period as the apprentice hunter, the accompanying adult may not shoot or possess a firearm or bow while accompanying the apprentice hunter under this paragraph.\n(d) An apprentice-hunter/trapper-validation holder must obtain all required licenses and stamps.\nThe fee for an apprentice-hunter/trapper validation is $3.50. Fees collected must be deposited in the firearms safety and trapper education training account, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, and issuing fees collected under section 97A.485, subdivision 6, and are appropriated annually to the Enforcement Division of the Department of Natural Resources for administering the firearm safety course and trapper education programs.",
	"repealed": false
}