{
	"id": "84.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.152",
	"title": "84.152 WILD RICE.",
	"text": "The commissioner shall prescribe rules for harvesting and possessing wild rice.\nA person who buys wild rice within the state for resale to anyone except consumers, or sells wild rice imported from outside the state to anyone within the state except consumers must have a wild rice dealer's license.\n(a) The application for a wild rice dealer's license application must include:\n(1) the amount of wild rice, whether raw or processed, bought or sold by the applicant during the preceding calendar year;\n(2) the amount of wild rice the applicant estimates will be bought or sold under the license; and\n(3) other pertinent information required by the commissioner.\n(b) The license fee must be paid in advance, based on the applicant's estimate. A license may not be issued for a fee based on a lesser amount of wild rice than was bought or sold by the applicant during the preceding calendar year.\n[See Note.]\nA wild rice dealer may not buy or sell wild rice for which a license is required in excess of the amount covered by the license. If a wild rice dealer desires to buy or sell wild rice in excess of the licensed amount, the dealer must apply for a supplemental license. The supplemental license shall be issued for the additional amount of wild rice upon payment of the prescribed fee, less credit for the fees paid for the previous license or licenses issued for the same calendar year. When the supplemental license is issued, the previous licenses held by the dealer shall be surrendered to the commissioner.\n[Repealed, 1989 c 350 art 19 s 2]\n(a) A person is guilty of a misdemeanor who:\n(1) willfully makes a false statement in an application for a license or in a required report or record; or\n(2) violates a provision relating to wild rice dealers.\n(b) Each violation is a separate offense. An acquittal prohibits later prosecution based on a similar charge involving other wild rice in the same transaction.\n(c) If a wild rice dealer is convicted of two offenses under this subdivision within three years, the dealer's license is null and void and the dealer may not be issued a license for one year after the date of the conviction.",
	"repealed": false
}