{
	"id": "60L.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.08",
	"title": "60L.08 LIMITATIONS GENERALLY APPLICABLE.",
	"text": "For the purposes of section 60L.11, the following limitations on classes of investments apply:\n(a) For investments authorized under section 60L.07, clause (2), and investments authorized under section 60L.07, clause (7), that are of the types described in section 60L.07, clause (2), the following restrictions apply:\n(1) the aggregate amount of medium and lower grade investments may not exceed 20 percent of the insurer's admitted assets;\n(2) the aggregate amount of lower grade investments may not exceed ten percent of the insurer's admitted assets;\n(3) the aggregate amount of investments rated 5 or 6 by the SVO may not exceed five percent of the insurer's admitted assets;\n(4) the aggregate amount of investments rated 6 by the SVO may not exceed one percent of the insurer's admitted assets; or\n(5) the aggregate amount of medium and lower grade investments that receive as cash income less than the equivalent yield for United States Treasury issues with a comparative average life, may not exceed one percent of the insurer's admitted assets.\n(b) Investments authorized under section 60L.07, clause (3), may not exceed 45 percent of admitted assets in the case of life insurers and 25 percent of admitted assets in the case of insurers other than life insurers.\n(c) Investments authorized under section 60L.07, clause (4), other than subsidiaries of the types authorized under section 60A.11, subdivision 18, paragraph (a), clause (4); 60D.16; or 61A.281, may not exceed 20 percent of admitted assets in the case of life insurers and 25 percent of admitted assets in the case of insurers other than life insurers.\n(d) Investments authorized under section 60L.07, clause (5), may not exceed ten percent of admitted assets.\n(e) Investments authorized under section 60L.07, clause (6), may not exceed 20 percent of admitted assets in the case of life insurers, and ten percent of admitted assets in the case of insurers other than life insurers.\n(f) Investments authorized under section 60L.07, clause (7), may not exceed 20 percent of admitted assets.\n(g) Investments authorized under section 60L.07, clause (8), may not exceed two percent of admitted assets.\n(h) Investments authorized under section 60L.07, clause (10), may not exceed two percent of admitted assets.\nFor purposes of determining compliance with section 60L.11, securities of a single issuer and its affiliates, other than the government of the United States and subsidiaries authorized under section 60A.11, subdivision 18, paragraph (a), clause (4); 60D.16; or 61A.281, may not exceed three percent of admitted assets in the case of life insurers, and five percent in the case of insurers other than life insurers. For purposes of this subdivision, in the case of asset-backed securities issued, assumed, insured, or guaranteed by a government-sponsored enterprise and secured by or evidencing an interest in a single asset or single pool of assets held by a trust or other business entity, the issuer is considered to be the asset or pool of assets.\nFor purposes of determining compliance with this section, the admitted portion of assets of subsidiaries under section 60A.11, subdivision 18, paragraph (a), clause (4); 60D.16, subdivision 2, paragraph (b); or 61A.281, subdivision 5, are considered to be owned directly by the insurer and any other investors in proportion to the market value, or if there is no market, the reasonable value, of their interest in the subsidiaries.\nTo the extent that investments exceed the limitations specified under subdivisions 1 and 2, the excess may be assigned to the investment class authorized in section 60L.07, clause (12), until that limit is exhausted.\nIf the commissioner considers it desirable in order to get a proper evaluation of the investment portfolio of an insurer, the commissioner may require that investments in mutual funds, pooled investment vehicles, or other investment companies be treated for purposes of sections 60L.01 to 60L.15, as if the investor owned directly its proportional share of the assets owned by the mutual fund, pooled investment vehicle, or investment company.\nUnless otherwise specified, an investment limitation computed on the basis of an insurer's admitted assets or capital and surplus must relate to the amount required to be shown on the statutory balance sheet of the insurer most recently required to be filed with the commissioner.\n(a) An insurer engaging in replication transactions shall include all replicated investment positions in calculating compliance with the limitations on investments contained in this section. So long as the insurer so complies with the limitations on investments contained in this section, then the insurer may count a replication transaction and any related investment of the insurer for the purposes specified in section 60L.11, to the extent the insurer has appropriately assigned the transaction or other investment to an investment class authorized in section 60L.07. An insurer shall not otherwise count replicated investment positions for the purposes specified in section 60L.11.\n(b) If an investment position of the insurer includes a replicated investment position and exceeds an applicable limitation contained in this section, then the insurer may allocate part or all of the replicated investment position as follows for the purposes of calculating compliance with the limitations on investments and other requirements contained in sections 60L.01 to 60L.15: to the extent an insurer owns assets in excess of its minimum asset requirement, the insurer may deem a replicated investment position to be among such excess assets, but only to the extent that the replicated investment position does not cause the total positions represented by such excess assets to be greater than the total positions represented by such excess assets as would be permitted in the absence of the replicated investment position.",
	"repealed": false
}