{
	"id": "256K.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.45",
	"title": "256K.45 HOMELESS YOUTH ACT.",
	"text": "The commissioner of human services shall establish a Homeless Youth Act fund and award grants to providers who are committed to serving homeless youth and youth at risk of homelessness, to provide street and community outreach and drop-in programs, emergency shelter programs, and integrated supportive housing and transitional living programs, consistent with the program descriptions in this section to reduce the incidence of homelessness among youth.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Homeless youth\" means a person 24 years of age or younger who is unaccompanied by a parent or guardian and is without shelter where appropriate care and supervision are available, whose parent or legal guardian is unable or unwilling to provide shelter and care, or who lacks a fixed, regular, and adequate nighttime residence. The following are not fixed, regular, or adequate nighttime residences:\n(1) a supervised publicly or privately operated shelter designed to provide temporary living accommodations;\n(2) an institution or a publicly or privately operated shelter designed to provide temporary living accommodations;\n(3) transitional housing;\n(4) a temporary placement with a peer, friend, or family member that has not offered permanent residence, a residential lease, or temporary lodging for more than 30 days; or\n(5) a public or private place not designed for, nor ordinarily used as, a regular sleeping accommodation for human beings.\nHomeless youth does not include persons incarcerated or otherwise detained under federal or state law.\n(d) \"Youth at risk of homelessness\" means a person 24 years of age or younger whose status or circumstances indicate a significant danger of experiencing homelessness in the near future. Status or circumstances that indicate a significant danger may include: (1) youth exiting out-of-home placements; (2) youth who previously were homeless; (3) youth whose parents or primary caregivers are or were previously homeless; (4) youth who are exposed to abuse and neglect in their homes; (5) youth who experience conflict with parents due to substance use disorder, mental health disability, or other disability; and (6) runaways.\n(e) \"Runaway\" means an unmarried child under the age of 18 years who is absent from the home of a parent or guardian or other lawful placement without the consent of the parent, guardian, or lawful custodian.\n(a) The commissioner shall prepare a biennial report, beginning February 1, 2025, which provides meaningful information to the chairs and ranking minority members of the legislative committees with jurisdiction over homeless youth, that includes but is not limited to: (1) a list of the areas of the state with the greatest need for services and housing for homeless youth, and the level and nature of the needs identified; (2) details about grants made, including shelter-linked youth mental health grants under section 256K.46; (3) the distribution of funds throughout the state based on population need; (4) follow-up information, if available, on the status of homeless youth and whether they have stable housing two years after services are provided; and (5) any other outcomes for populations served to determine the effectiveness of the programs and use of funding.\n(b) This subdivision expires December 31, 2034.\nYouth drop-in centers must provide walk-in access to crisis intervention and ongoing supportive services including one-to-one case management services on a self-referral basis. Street and community outreach programs must locate, contact, and provide information, referrals, and services to homeless youth, youth at risk of homelessness, and runaways. Information, referrals, and services provided may include, but are not limited to:\n(1) family reunification services;\n(2) conflict resolution or mediation counseling;\n(3) assistance in obtaining temporary emergency shelter;\n(4) assistance in obtaining food, clothing, medical care, or mental health counseling;\n(5) counseling regarding violence, sexual exploitation, substance abuse, sexually transmitted diseases, and pregnancy;\n(6) referrals to other agencies that provide support services to homeless youth, youth at risk of homelessness, and runaways;\n(7) assistance with education, employment, and independent living skills;\n(8) aftercare services;\n(9) specialized services for highly vulnerable runaways and homeless youth, including but not limited to youth at risk of discrimination based on sexual orientation or gender identity, young parents, emotionally disturbed and mentally ill youth, and sexually exploited youth; and\n(10) homelessness prevention.\n(a) Emergency shelter programs must provide homeless youth and runaways with referral and walk-in access to emergency, short-term residential care. The program shall provide homeless youth and runaways with safe, dignified shelter, including private shower facilities, beds, and at least one meal each day; and shall assist a runaway and homeless youth with reunification with the family or legal guardian when required or appropriate.\n(b) The services provided at emergency shelters may include, but are not limited to:\n(1) family reunification services;\n(2) individual, family, and group counseling;\n(3) assistance obtaining clothing;\n(4) access to medical and dental care and mental health counseling;\n(5) education and employment services;\n(6) recreational activities;\n(7) advocacy and referral services;\n(8) independent living skills training;\n(9) aftercare and follow-up services;\n(10) transportation; and\n(11) homelessness prevention.\nTransitional living programs must help homeless youth and youth at risk of homelessness to find and maintain safe, dignified housing. The program may also provide rental assistance and related supportive services, or refer youth to other organizations or agencies that provide such services. Services provided may include, but are not limited to:\n(1) educational assessment and referrals to educational programs;\n(2) career planning, employment, work skill training, and independent living skills training;\n(3) job placement;\n(4) budgeting and money management;\n(5) assistance in securing housing appropriate to needs and income;\n(6) counseling regarding violence, sexual exploitation, substance abuse, sexually transmitted diseases, and pregnancy;\n(7) referral for medical services or substance use disorder treatment;\n(8) parenting skills;\n(9) self-sufficiency support services or life skill training;\n(10) aftercare and follow-up services; and\n(11) homelessness prevention.\nFunds appropriated for this section may be expended on programs described under subdivisions 3 to 5 and 7, technical assistance, and capacity building to meet the greatest need on a statewide basis. The commissioner will provide outreach, technical assistance, and program development support to increase capacity to new and existing service providers to better meet needs statewide, particularly in areas where services for homeless youth have not been established, especially in greater Minnesota.\n(a) Providers that serve homeless youth may apply for a grant of up to $500,000 under this subdivision to make minor or mechanical repairs or improvements to a facility providing services to homeless youth or youth at risk of homelessness.\n(b) Grant applications under this subdivision must include a description of the repairs or improvements and the estimated cost of the repairs or improvements.\nFor grants awarded pursuant to a two-year grant contract, the commissioner shall permit grant recipients to carry over any unexpended amount from the first contract year to the second contract year.",
	"repealed": false
}