{
	"id": "325G.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.56",
	"title": "325G.56 DEFINITIONS.",
	"text": "For purposes of sections 325G.56 to 325G.62, the terms defined in this section have the meanings given them.\n\"Automatic renewal\" means a plan or arrangement in which a subscription or purchasing agreement is automatically renewed at the end of a definite term for a subsequent term.\n\"Clear and conspicuous\" means in larger type than the surrounding text, or in contrasting type, font, or color to the surrounding text of the same size, or set off from the surrounding text of the same size by symbols or other marks, in a manner that calls attention to the language. In the case of an audio disclosure, \"clear and conspicuous\" means in a volume and cadence sufficient to be readily audible and understandable.\n\"Consumer\" means any individual who seeks or acquires, by purchase or lease, any goods, services, money, or credit for personal, family, or household purposes. Consumer includes but is not limited to a member as defined in section 325G.23, unless the context clearly indicates otherwise.\n\"Continuous service\" means a plan or arrangement in which a subscription or purchasing agreement continues until the consumer terminates the agreement.\n\"Indefinite subscription agreement\" means a subscription or purchasing agreement:\n(1) between a seller and a consumer in Minnesota; and\n(2) subject to automatic renewal or continuous service.\nIndefinite subscription agreements include but are not limited to contracts, as defined in section 325G.23, subject to automatic renewal or continuous service.\n\"Offer terms\" means the following disclosures:\n(1) that the indefinite subscription agreement will continue until the consumer terminates the agreement;\n(2) the description of the cancellation policy that applies to the indefinite subscription agreement;\n(3) the recurring charges that will be charged to the consumer's credit or debit card or payment account with a third party as part of the plan or arrangement and that the amount of the charge may change, if that is the case, and the amount to which the charge will change, if known;\n(4) the length of the automatic renewal term or that the service is continuous, unless the length of the term is definite and chosen by the consumer; and\n(5) the minimum purchase obligation, if any.\n\"Seller\" means a seller, lessor, licensor, or professional who advertises, solicits, or engages in consumer transactions, or a manufacturer, distributor, or licensor who advertises and sells, leases, or licenses goods or services to be resold, leased, or sublicensed by other persons in consumer transactions. Seller includes but is not limited to a club as defined in section 325G.23, unless the context clearly indicates otherwise.",
	"repealed": false
}