{
	"id": "116C.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.97",
	"title": "116C.97 EXEMPTIONS.",
	"text": "The requirements of sections 116C.91 to 116C.96 and of the rules of the board adopted pursuant to section 116C.94 do not apply to genetic engineering of human germ cells and human somatic cells intended for use in human gene therapy.\n(a) If the board determines, upon its own volition or at the request of any person, that a federal program exists for regulating the release of certain genetically engineered organisms and the federal oversight under the program is adequate to protect human health or the environment, then any person may release such genetically engineered organisms after obtaining the necessary federal approval and without obtaining a state release permit or a significant environmental permit or complying with the other requirements of sections 116C.91 to 116C.96 and the rules of the board adopted pursuant to section 116C.94.\n(b) If the board determines the federal program is adequate to meet only certain requirements of sections 116C.91 to 116C.96 and the rules of the board adopted pursuant to section 116C.94, the board may exempt such releases from those requirements.\n(c) A person proposing a release for which a federal authorization is required may apply to the board for an exemption from the board's permit or to a state agency with a significant environmental permit for the proposed release for an exemption from the agency's permit. The proposer must file with the board or state agency a written request for exemption with a copy of the federal application and the information necessary to determine if there is a potential for significant environmental effects under chapter 116D and rules adopted under it. The board or state agency shall give public notice of the request in the first available issue of the EQB Monitor and shall provide an opportunity for public comment on the environmental review process consistent with chapter 116D and rules adopted under it. The board or state agency may grant the exemption if the board or state agency finds that the federal authorization issued is adequate to meet the requirements of chapter 116D and rules adopted under it and any other requirement of the board's or state agency's authority regarding the release of genetically engineered organisms. The board or state agency must grant or deny the exemption within 45 days after the receipt of the written request and the information required by the board or state agency.\n(d) This subdivision does not apply to genetically engineered organisms for which an environmental impact statement is required under sections 116C.91 to 116C.96.",
	"repealed": false
}