{
	"id": "469.006",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.006",
	"title": "469.006 APPOINTMENT, QUALIFICATIONS, TENURE OF COMMISSIONERS.",
	"text": "When the governing body of a county adopts a resolution under section 469.004, the governing body shall appoint five persons or the number of commissioners for the governing body, plus up to two additional commissioners, as commissioners of the county authority. If any additional commissioners are appointed, one of the commissioners must be appointed in accordance with the requirements of Code of Federal Regulations, title 24, part 964. The membership of the commission will reflect an areawide distribution on a representative basis. The commissioners who are first appointed shall be designated to serve for terms of one, two, three, four, and five years respectively, from the date of their appointment. Thereafter commissioners shall be appointed for a term of office of five years except that all vacancies shall be filled for the unexpired term. Persons may be appointed as commissioners if they reside within the boundaries or area, and are otherwise eligible for the appointments under sections 469.001 to 469.047.\nThe governing body in the case of a county, and the mayor with the approval of the governing body in the case of a city, of each political subdivision included in a multicounty authority shall appoint one person as a commissioner of the authority at or after the time of the adoption of the resolution establishing the authority.\nIn the case of a multicounty authority comprising only two or three political subdivisions, the appointing authorities of the participating political subdivisions shall each appoint one additional commissioner whose term of office shall be as provided for a commissioner of a multicounty authority. If any additional commissioners are appointed, one of the commissioners must be appointed in accordance with the requirements of Code of Federal Regulations, title 24, part 964.\nIn the case of a multicounty authority comprising more than three political subdivisions, the appointing authorities of the participating political subdivisions may each appoint one additional commissioner whose term of office shall be as provided for a commissioner of a multicounty authority. The housing and redevelopment authority board of commissioners of a multicounty authority may appoint one or two additional commissioners in order to comply with the requirements of Code of Federal Regulations, title 24, part 964. The appointment must be approved by a majority of the commissioners of each of the political subdivisions comprising the multicounty authority.\nWhen the area of operation of a multicounty authority is increased to include an additional political subdivision, the appointing authority of each additional political subdivision shall appoint one or, if appropriate, two commissioners of the multicounty authority.\nThe appointing authority of each political subdivision shall appoint the successors of the commissioner appointed by it. The commissioners of a multicounty authority shall be appointed for terms of five years except that all vacancies shall be filled for the unexpired terms.\nA certified copy of the certificate of appointment of each commissioner shall be filed with the commissioner of employment and economic development.",
	"repealed": false
}