{
	"id": "216B.685",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.685",
	"title": "216B.685 MERCURY EMISSIONS-REDUCTION PLAN APPROVAL.",
	"text": "The Public Utilities Commission shall review and evaluate a utility's mercury emissions-reduction plans and associated emissions-reduction riders submitted under section 216B.682 or pursuant to subdivision 2, paragraph (b). In its review, the commission shall consider the environmental and public health benefits, the agency's assessment of technical feasibility, competitiveness of customer rates, and cost-effectiveness of the utility's proposed mercury-control initiatives in light of the Pollution Control Agency's report under section 216B.684.\n(a) Within 180 days of receiving the agency's report on a utility's plan filed under section 216B.682, subdivision 1 or 2, the commission shall order the implementation of a utility's mercury emissions-reduction plan and associated emissions-reduction rider that complies with the requirements of the applicable subdivision of section 216B.682, unless the commission determines that the plan as proposed fails to provide for increased environmental and health benefits or would impose excessive costs on the utility's customers.\n(b) If the commission is unable to approve the utility's plan and associated emissions-reduction riders as proposed, it shall direct the utility to amend and resubmit its proposed plan in light of the record developed on the proposed plan or, at the utility's option, to file a new plan consistent with the requirements of the applicable subdivision of section 216B.682.\nThe commission shall give due consideration to the assessment of the Pollution Control Agency on compliance issues under sections 216B.68 to 216B.688, technical feasibility of emission-control technology, and environmental and public health benefits associated with emissions reductions.\n(a) Unless the utility proposes to do so, the commission may not require the replacement of existing pollution control equipment at a targeted or supplemental unit as a condition for approving a plan pursuant to this section or section 216B.6851.\n(b) The commission may allow a utility up to two extensions of any deadline established under sections 216B.68 to 216B.688 or commission order under those sections, if the utility demonstrates the unavailability of necessary equipment or other extraordinary circumstances. An extension under this paragraph may last no longer than 12 months. The commission may not extend a deadline for final installation of pollution control equipment for longer than 12 months.\nA commission order under this section must require the utility to optimize the operation of equipment installed under a plan approved under this section to obtain maximum mercury reductions and to report the utility's efforts and results annually to the Pollution Control Agency, until such time as the agency determines the reports to be no longer necessary.",
	"repealed": false
}