{
	"id": "394.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.361",
	"title": "394.361 OFFICIAL MAP.",
	"text": "Land that is needed for future street and highway purposes, or for aviation purposes, and as sites for other necessary public facilities and services is frequently diverted to nonpublic uses that could have been located on other lands without hardship or inconvenience to the owners. When this happens, public uses of land may be denied or may be obtained later only at prohibitive cost or at the expense of dislocating the owners and occupants of the land. Identification on official maps of land needed for future public uses permits both the public and private property owners to adjust their building plans equitably and conveniently before investments are made that will make adjustments difficult to accomplish.\nThe planning commission may develop and recommend for adoption by the board official maps and amendments thereto covering all or any portion of the unincorporated area of the county. Public hearings on proposed official maps and amendments thereto shall be held in accordance with section 394.26. The official map may be adopted and amended by ordinance by the board.\nAll official maps shall be prepared in sufficient detail to permit the establishment of future acquisition lines on the ground. In unplatted areas a minimum of a centerline survey shall have been made prior to the preparation of the final draft of the official map. The accuracy of the future acquisition lines shown on the official map shall be attested to by the county surveyor. Copies of official maps and amendments shall be filed in accordance with section 394.35. One copy of the official map shall be furnished to the town clerk of each affected town.\nAfter an official map has been adopted and filed, the issuance of land use or zoning permits or approvals by the county is subject to the provisions of this section. Whenever any street or highway is widened or improved or any new street is opened, or interests in lands for other public purposes, including aviation purposes, are acquired by the county, it is not required in such proceedings to pay for any building or structure placed without a permit or approval or in violation of conditions of a permit or approval within the limits of the mapped street or highway or outside of any building line that may have been established upon the existing street or within any area thus identified for public purposes, including aviation purposes. The adoption of official maps does not give the county any right, title, or interest in areas identified for public purposes thereon, but the adoption of a map does authorize the county to acquire these interests without paying compensation for buildings or structures erected in those areas without a permit or approval or in violation of the conditions of a permit or approval. This subdivision does not apply to buildings or structures in existence prior to the filing of the official map.\nIf a permit for a building in such location is denied, the board of adjustment shall have the power, upon appeal by the owner of the land to authorize the issuance of a permit for building in such location in any case in which the board finds, upon the evidence and the arguments presented to it, (a) that the entire property of the appellant of which such area identified for public purposes forms a part cannot be put to a reasonable use by the owner unless such a permit is granted, and (b) that balancing the interest of the county in preserving the integrity of the official map and the comprehensive plan and interest of the owner of the property in the use of the property and in the benefits of ownership, the issuance of such permit is required by considerations of justice and equity. Prior to reaching a decision upon the appeal, public hearings shall be held in accordance with section 394.26. If the board of adjustment authorizes the issuance of a permit the board shall have six months from the date of the decision of the board of adjustment to institute proceedings to acquire such land or interest therein, and if no such proceedings are started within that time, the officer responsible shall issue a permit in accordance with the conditions stated in the authorization specifying the exact location, ground area, height and other details as to the extent and character of the building for which the permit is granted.",
	"repealed": false
}