{
	"id": "115B.403",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.403",
	"title": "115B.403 ACCEPTING DUMP MATERIALS TO AUGMENT CLOSURE OR CLOSURE UPGRADE ACTIVITIES AT QUALIFIED FACILITIES.",
	"text": "(a) The commissioner may allow dump materials at qualified facilities from sites that have been in public ownership on or after January 1, 1998, provided that the commissioner finds that:\n(1) accepting the dump materials will not significantly increase the potential environmental impacts of the qualified facility;\n(2) accepting the dump materials will benefit the qualified facility by improving final slopes, or in some other tangible manner, and the materials will be provided to the qualified facility according to a schedule consistent with closure or closure upgrade activities at the qualified facility;\n(3) the owner of the site where the dump materials were disposed complies with the requirements of paragraph (b) and agrees to:\n(i) pay any costs of screening and inspection needed at point of excavation or point of deposit to ensure that unacceptable materials are not delivered to the qualified facility;\n(ii) secure any permissions necessary from the owner of the property containing the qualified facility;\n(iii) transport the dump materials to the qualified facility according to a process and schedule acceptable to the commissioner and, at owner's cost, pay all transportation costs related to the activity; and\n(iv) complete cleanup, final grading, seeding, and other related activities for the area where the dump existed.\n(b) In order to qualify for consideration for disposal of dump materials at qualified facilities, the owner of the site where the dump materials were disposed shall notify the commissioner, in writing, at least six months before closure activity at the qualified facility indicating the owner's desire to dispose of the dump material at the qualified facility in order to allow adequate time for construction planning and public information activities. The commissioner shall consider requests based on the schedule of closure and closure upgrade activities at qualified facilities. The commissioner shall require the owner of the site to submit, at the owner's expense, physical and chemical evaluation data regarding the dump material including any necessary coring, excavation, or other sampling data at least six months before closure construction to assist the commissioner in making the determination whether or not to accept the material.\n(c) The commissioner may reject any and all requests to dispose of dump materials at qualified facilities.\n(d) Nothing in this section shall be construed as allowing unpermitted disposal facilities to be included as qualified facilities in the closed landfill program.",
	"repealed": false
}