{
	"id": "148F.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.205",
	"title": "148F.205 COMPLAINTS TO BOARD.",
	"text": "A provider is required to file a complaint when the provider knows or has reason to believe that another provider:\n(1) is unable to practice with reasonable skill and safety as a result of a physical or mental illness or condition, including, but not limited to, substance abuse or dependence, except that this mandated reporting requirement is deemed fulfilled by a report made to the Health Professionals Services Program (HPSP) as provided by section 214.33, subdivision 1;\n(2) is engaging in or has engaged in sexual behavior with a client or former client in violation of section 148F.165, subdivision 6 or 7;\n(3) has failed to report abuse or neglect of children or vulnerable adults in violation of section 626.557 or chapter 260E; or\n(4) has employed fraud or deception in obtaining or renewing an alcohol and drug counseling license.\nOther than conduct listed in subdivision 1, a provider who has reason to believe that the conduct of another provider appears to be in violation of sections 148F.001 to 148F.205 may file a complaint with the board.\nA state agency, political subdivision, agency of a local unit of government, private agency, hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the agency, institution, or organization or any of its administrators or medical or other committees to revoke, suspend, restrict, or condition an alcohol and drug counselor's privilege to practice or treat patients or clients in the institution, or as part of the organization, any denial of privileges, or any other disciplinary action for conduct that might constitute grounds for disciplinary action by the board under sections 148F.001 to 148F.205. The institution, organization, or governmental entity shall also report the resignation of any alcohol and drug counselors before the conclusion of any disciplinary action proceeding for conduct that might constitute grounds for disciplinary action under this chapter, or before the commencement of formal charges but after the practitioner had knowledge that formal charges were contemplated or were being prepared.\nA state or local professional society for alcohol and drug counselors shall report to the board any termination, revocation, or suspension of membership or any other disciplinary action taken against an alcohol and drug counselor. If the society has received a complaint that might be grounds for discipline under this chapter against a member on which it has not taken any disciplinary action, the society shall report the complaint and the reason why it has not taken action on it or shall direct the complainant to the board.\nEach insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to alcohol and drug counselors or the Medical Joint Underwriting Association under chapter 62F, shall submit to the board quarterly reports concerning the alcohol and drug counselors against whom malpractice settlements and awards have been made. The report must contain at least the following information:\n(1) the total number of malpractice settlements or awards made;\n(2) the date the malpractice settlements or awards were made;\n(3) the allegations contained in the claim or complaint leading to the settlements or awards made;\n(4) the dollar amount of each settlement or award;\n(5) the address of the practice of the alcohol and drug counselor against whom an award was made or with whom a settlement was made; and\n(6) the name of the alcohol and drug counselor against whom an award was made or with whom a settlement was made.\nThe insurance company shall, in addition to the information in clauses (1) to (6), submit to the board any information, records, and files, including clients' charts and records, it possesses that tend to substantiate a charge that a licensed alcohol and drug counselor may have engaged in conduct violating this chapter.\nAn alcohol and drug counselor shall report to the board any personal action that would require that a report be filed with the board by any person, health care facility, business, or organization under subdivisions 1 and 3 to 5. The alcohol and drug counselor shall also report the revocation, suspension, restriction, limitation, or other disciplinary action in this state and report the filing of charges regarding the practitioner's license or right of practice in another state or jurisdiction.\nA person who has knowledge of any conduct constituting grounds for disciplinary action relating to the practice of alcohol and drug counseling under this chapter may report the violation to the board.\nA provider shall, upon request, provide information regarding the procedure for filing a complaint with the board and shall, upon request, assist with filing a complaint. A provider shall not attempt to dissuade a client from filing a complaint with the board, or require that the client waive the right to file a complaint with the board as a condition for providing services.\nReports required by subdivisions 1 and 3 to 6 must be submitted no later than 30 days after the reporter learns of the occurrence of the reportable event or transaction. The board may provide forms for the submission of the reports required by this section and may require that reports be submitted on the forms provided.",
	"repealed": false
}