{
	"id": "142C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.06",
	"title": "142C.06 CORRECTION ORDER.",
	"text": "(a) If the applicant or certification holder fails to comply with a law or rule, the commissioner may issue a correction order. The correction order must state:\n(1) the condition that constitutes a violation of the law or rule;\n(2) the specific law or rule violated; and\n(3) the time allowed to correct each violation.\n(b) If the applicant or certification holder fails to comply with a law or rule, the commissioner may issue a conditional certification. When issuing a conditional certification, the commissioner shall consider the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of persons served by the program. The conditional order must state:\n(1) the conditions that constitute a violation of the law or rule;\n(2) the specific law or rule violated;\n(3) the time allowed to correct each violation; and\n(4) the length and terms of the conditional certification, and the reasons for making the certification conditional.\n(c) Nothing in this section prohibits the commissioner from decertifying a center under section 142C.07 before issuing a correction order or conditional certification.\n(d) The commissioner may issue a correction order or conditional certification to the applicant or certification holder through the provider licensing and reporting hub.\n(a) If the applicant or certification holder believes that the commissioner's correction order or conditional certification is erroneous, the applicant or certification holder may ask the commissioner to reconsider the part of the correction order or conditional certification that is allegedly erroneous. A request for reconsideration must be made in writing and postmarked or submitted through the provider licensing and reporting hub and sent to the commissioner within 20 calendar days after the applicant or certification holder received the correction order or conditional certification, and must:\n(1) specify the part of the correction order or conditional certification that is allegedly erroneous;\n(2) explain why the specified part is erroneous; and\n(3) include documentation to support the allegation of error.\n(b) A request for reconsideration of a correction order does not stay any provision or requirement of the correction order. The commissioner's disposition of a request for reconsideration is final and not subject to appeal.\n(c) A timely request for reconsideration of a conditional certification shall stay imposition of the terms of the conditional certification until the commissioner issues a decision on the request for reconsideration.\n(d) Upon implementation of the provider licensing and reporting hub, the provider must use the hub to request reconsideration. If the order is issued through the provider hub, the request must be received by the commissioner within 20 calendar days from the date the commissioner issued the order through the hub.\n(a) If the commissioner finds that the applicant or certification holder failed to correct the violation specified in the correction order, the commissioner may decertify the license-exempt center pursuant to section 142C.07.\n(b) Nothing in this section prohibits the commissioner from decertifying a center according to section 142C.07.",
	"repealed": false
}