{
	"id": "325G.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.25",
	"title": "325G.25 CONTRACT REGULATION.",
	"text": "A copy of every contract shall be delivered to the member at the time the contract is signed. Every contract must be in writing, must be signed by the member, must designate the date on which the member signed the contract and must state, clearly and conspicuously in boldface type of a minimum size of 14 points, the following:\n\"MEMBERS' RIGHT TO CANCEL\"\n\"If you wish to cancel this contract, you may cancel in-person, over the telephone, by delivering or mailing a written notice to the club, via email or an online message through the club's website, through the \"termination election\" provided on the club's website (if applicable) and as described in Minnesota Statutes, section 325G.60, or in any other manner or medium by which you initially accepted membership to the club. The notice must be provided to the club before midnight of the third business day after you sign this contract. If you cancel, the club will return, within ten days of the date on which you give notice of cancellation, any payments you have made.\"\n\"MEMBERS' RIGHT TO UNILATERAL TERMINATION\"\n\"You may unilaterally terminate this contract in your exclusive discretion at any time. If you terminate, your membership will terminate at the end of the membership term in which you provided the club with notice of termination. If your membership is at-will without a defined membership term, then your membership will terminate immediately, unless you indicate a future effective date of termination. If you wish to terminate this contract, you may terminate in-person, over the telephone, by delivering or mailing a written notice to the club, via email or an online message through the club's website, through the \"termination election\" provided on the club's website (if applicable) and as described in Minnesota Statutes, section 325G.60, or in any other manner or medium by which you initially accepted membership to the club. The club may not impose a termination fee or any other liability on you for termination.\"\n\"NOTICE INFORMATION\"\n\"If you wish to provide notice of cancellation or notice of termination to the club:\nIn-person or by mail, the applicable address is: [Insert name and mailing address of club];\nOver the telephone, the applicable telephone number is: [Insert telephone number of club];\nVia email, the applicable email address is: [Insert email address of club];\nOn the club's website, the applicable website address is: [Insert address, if applicable].\"\nMS 2022 [Repealed, 2024 c 114 art 3 s 104]\nEvery contract which does not contain the notice specified in this section may be canceled by the member at any time by giving notice of cancellation by any means.",
	"repealed": false
}