{
	"id": "626.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.19",
	"title": "626.19 USE OF UNMANNED AERIAL VEHICLES.",
	"text": "(a) This section applies to unmanned aerial vehicle data collected, created, or maintained by a law enforcement agency and to law enforcement agencies that maintain, use, or plan to use an unmanned aerial vehicle in investigations, training, or in response to emergencies, incidents, and requests for service. Unmanned aerial vehicle data collected, created, or maintained by a government entity is classified under chapter 13.\n(b) For purposes of this section, the following terms have the meanings given:\n(1) \"government entity\" has the meaning given in section 13.02, subdivision 7a, except that it does not include a law enforcement agency;\n(2) \"law enforcement agency\" has the meaning given in section 626.84, subdivision 1;\n(3) \"unmanned aerial vehicle\" or \"UAV\" means an aircraft that is operated without the possibility of direct human intervention from within or on the aircraft; and\n(4) \"terrorist attack\" means a crime that furthers terrorism as defined in section 609.714, subdivision 1.\nExcept as provided in subdivision 3, a law enforcement agency must not use a UAV without a search warrant issued under this chapter.\nA law enforcement agency may use a UAV:\n(1) during or in the aftermath of an emergency situation that involves the risk of death or bodily harm to a person;\n(2) over a public event where there is a heightened risk to the safety of participants or bystanders;\n(3) to counter the risk of a terrorist attack by a specific individual or organization if the agency determines that credible intelligence indicates a risk;\n(4) to prevent the loss of life and property in natural or man-made disasters and to facilitate operational planning, rescue, and recovery operations in the aftermath of these disasters;\n(5) to conduct a threat assessment in anticipation of a specific event;\n(6) to collect information from a public area if there is reasonable suspicion of criminal activity;\n(7) to collect information for crash reconstruction purposes after a serious or deadly collision occurring on a public road;\n(8) over a public area for officer training or public relations purposes; and\n(9) for purposes unrelated to law enforcement at the request of a government entity provided that the government entity makes the request in writing to the law enforcement agency and specifies the reason for the request and proposed period of use.\n(a) A law enforcement agency using a UAV must comply with all Federal Aviation Administration requirements and guidelines.\n(b) A law enforcement agency must not deploy a UAV with facial recognition or other biometric-matching technology unless expressly authorized by a warrant.\n(c) A law enforcement agency must not equip a UAV with weapons.\n(d) A law enforcement agency must not use a UAV to collect data on public protests or demonstrations unless expressly authorized by a warrant or an exception applies under subdivision 3.\nA law enforcement agency must document each use of a UAV, connect each deployment to a unique case number, provide a factual basis for the use of a UAV, and identify the applicable exception under subdivision 3 unless a warrant was obtained.\n(a) Data collected by a UAV are private data on individuals or nonpublic data, subject to the following:\n(1) if the individual requests a copy of the recording, data on other individuals who do not consent to its release must be redacted from the copy;\n(2) UAV data may be disclosed as necessary in an emergency situation under subdivision 3, clause (1);\n(3) UAV data may be disclosed to the government entity making a request for UAV use under subdivision 3, clause (9);\n(4) UAV data that are criminal investigative data are governed by section 13.82, subdivision 7; and\n(5) UAV data that are not public data under other provisions of chapter 13 retain that classification.\n(b) Section 13.04, subdivision 2, does not apply to data collected by a UAV.\n(c) Notwithstanding section 138.17, a law enforcement agency must delete data collected by a UAV as soon as possible, and in no event later than seven days after collection unless the data is part of an active criminal investigation.\nInformation obtained or collected by a law enforcement agency in violation of this section is not admissible as evidence in a criminal, administrative, or civil proceeding against the data subject.\nIn addition to any other remedies provided by law, including remedies available under chapter 13, an aggrieved party may bring a civil action against a law enforcement agency to prevent or remedy a violation of this section.\nA law enforcement agency must provide an opportunity for public comment before it purchases or uses a UAV. At a minimum, the agency must accept public comments submitted electronically or by mail. The governing body with jurisdiction over the budget of a local law enforcement agency must provide an opportunity for public comment at a regularly scheduled meeting.\nPrior to the operation of a UAV, the chief officer of every state and local law enforcement agency that uses or proposes to use a UAV must establish and enforce a written policy governing its use, including requests for use from government entities. In developing and adopting the policy, the law enforcement agency must provide for public comment and input as described in subdivision 9. The written policy must be posted on the agency's website, if the agency has a website.\n(a) Within a reasonable time but not later than 90 days after the court unseals a warrant under this subdivision, the issuing or denying judge shall cause to be served on the persons named in the warrant and the application an inventory that shall include notice of:\n(1) the issuance of the warrant or application;\n(2) the date of issuance and the period of authorized, approved, or disapproved collection of information, or the denial of the application; and\n(3) whether information was or was not collected during the period.\n(b) A warrant authorizing collection of information with a UAV must direct that:\n(1) the warrant be sealed for a period of 90 days or until the objective of the warrant has been accomplished, whichever is shorter; and\n(2) the warrant be filed with the court administrator within ten days of the expiration of the warrant.\n(c) The prosecutor may request that the warrant, supporting affidavits, and any order granting the request not be filed. An order must be issued granting the request in whole or in part if, from affidavits, sworn testimony, or other evidence, the court finds reasonable grounds exist to believe that filing the warrant may cause the search or a related search to be unsuccessful, create a substantial risk of injury to an innocent person, or severely hamper an ongoing investigation.\n(d) The warrant must direct that, following the commencement of any criminal proceeding using evidence obtained in or as a result of the search, the supporting application or affidavit must be filed either immediately or at any other time as the court directs. Until the filing, the documents and materials ordered withheld from filing must be retained by the judge or the judge's designee.\n(a) By January 15 of each year, each law enforcement agency that maintains or uses a UAV shall report to the commissioner of public safety the following information for the preceding calendar year:\n(1) the number of times a UAV was deployed without a search warrant issued under this chapter, identifying the date of deployment and the authorized use of the UAV under subdivision 3; and\n(2) the total cost of the agency's UAV program.\n(b) By June 15 of each year, the commissioner of public safety shall compile the reports submitted to the commissioner under paragraph (a), organize the reports by law enforcement agency, submit the compiled report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over data practices and public safety, and make the compiled report public on the department's website.\n(c) By January 15 of each year, a judge who has issued or denied approval of a warrant under this section that expired during the preceding year shall report to the state court administrator:\n(1) that a warrant or extension was applied for;\n(2) the type of warrant or extension applied for;\n(3) whether the warrant or extension was granted as applied for, modified, or denied;\n(4) the period of UAV use authorized by the warrant and the number and duration of any extensions of the warrant;\n(5) the offense specified in the warrant or application or extension of a warrant; and\n(6) the identity of the law enforcement agency making the application and the person authorizing the application.\n(d) By June 15 of each year, the state court administrator shall submit to the chairs and ranking minority members of the senate and house of representatives committees or divisions having jurisdiction over data practices and public safety and post on the supreme court's website a full and complete report concerning the number of applications for warrants authorizing or approving use of UAVs or disclosure of information from the use of UAVs under this section and the number of warrants and extensions granted or denied under this section during the preceding calendar year. The report must include a summary and analysis of the data required to be filed with the state court administrator under paragraph (c).",
	"repealed": false
}