{
	"id": "469.309",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.309",
	"title": "469.309 RURAL JOB CREATION GRANTS.",
	"text": "The commissioner of employment and economic development may approve an incentive grant for an eligible business beginning with calendar year 1995. The maximum grant is $5,000 per eligible employee. The actual grant is based on the following schedule:\n$2,000 for each eligible employee with wages greater than or equal to 170 percent and less than 200 percent of the minimum wage;\n$3,000 for each eligible employee with wages greater than or equal to 200 percent and less than 250 percent of the minimum wage;\n$4,000 for each eligible employee with wages greater than or equal to 250 percent and less than 300 percent of the minimum wage; and\n$5,000 for each eligible employee with wages greater than or equal to 300 percent of the minimum wage.\nThe total grant for an employer is equal to the actual grant multiplied by the number of employees eligible for that grant. For purposes of this section \"minimum wage\" means the minimum wage that is required by federal law. An eligible business may apply for a rural job creation grant only once for each new job.\nAn employer eligible for a job creation incentive grant under this section must (1) be located outside the metropolitan area as defined under section 473.121, (2) create at least ten qualifying new jobs in a two-year period, and (3) consist of a for-profit business. For the purposes of this section, a \"qualifying new job\" is a job that did not exist in Minnesota before May 6, 1994.\nTo be eligible for a grant, the employee must be employed full time by an eligible business at a wage level of not less than 170 percent of the minimum wage at the time the eligible business applies for the grant and must have been employed there at that wage level for a minimum of 12 months. The grant applies only to new jobs created at the eligible business after May 6, 1994.\nThe incentive grants provided by this section do not apply to racetracks, financial institutions, gambling enterprises, public utilities, or sports, fitness, and health facilities. An employer is not eligible for an incentive grant if the commissioner determines that the position held by the employee for which the business is seeking a grant was transferred from an enterprise conducted by substantially the same business enterprise at another site in the state.",
	"repealed": false
}