{
	"id": "89.715",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.715",
	"title": "89.715 ALTERNATIVE RECORDING FOR STATE FOREST ROAD.",
	"text": "The commissioner may adopt a forest road map under this section to record the department's state forest road prescriptive easements. For purposes of this section, \"state forest road map\" means the official map of state forest roads adopted by the commissioner.\nThe state forest road map must:\n(1) show state forest roads at the time the map is adopted;\n(2) be prepared at a scale compliant with standards of the county recorder where the state forest roads are located;\n(3) include section numbers;\n(4) include a north point arrow;\n(5) include the name of the county and state;\n(6) include a blank and a description under the blank for the date of public hearing and date of adoption;\n(7) include blanks for signatures and dates of signatures for the commissioner; and\n(8) include a list of legal descriptions of all parcels crossed by state forest road prescriptive easements.\n(a) The commissioner must prepare an official map for each county or smaller geographic area as determined by the commissioner as provided in subdivision 2, and set a time, place, and date for a public hearing on adopting a forest road map to record roads.\n(b) The hearing notice must state that the roads to be recorded will be to the width of the actual use including ditches, backslopes, fills, and maintained rights-of-way, unless otherwise specified in a prior easement of record. The hearing notice must be published once a week for two successive weeks in a qualified newspaper of general circulation that serves the county or smaller geographic areas as determined by the commissioner, the last publication to be made at least ten days before the date of the public hearing. At least 30 days before the hearing, the hearing notice must be sent by certified mail to the property owners directly affected in the county or smaller geographic areas as determined by the commissioner at the addresses listed on the tax assessment notices at least seven days before appearing in the qualified newspaper. The hearing notice may be sent with the tax assessment, but all additional costs incurred shall be billed to the department.\n(c) After the public hearing is held, the commissioner may amend and adopt the forest road map. The state forest road map must be dated and signed by the commissioner and must be filed for recording with the county recorder within 90 days after the map is adopted. The map is effective when filed with the county recorder.\n(d) The state forest road map that is recorded with the county recorder must comply with the standards of the county recorder where the state forest roads are located.\n(e) A state forest road map that was prepared by using aerial photographs to establish road centerlines and that has been duly recorded with the county recorder is an adequate description for purposes of recording road easements and the map is the legally constituted description and prevails when a deed for a parcel abutting a road contains no reference to a road easement. Nothing prevents the commissioner from accepting a more definitive metes and bounds or survey description of a road easement for a road of record if the description of the easement is referenced to equal distance on both sides of the existing road centerline.\n(f) The commissioner shall consult with representatives of county land commissioners, county auditors, county recorders, and Torrens examiners in implementing this subdivision.\n(a) Appeals may be filed only by property owners who are directly affected by a proposed map designation and only for those portions of the map designation that directly affect them.\n(b) A property owner may appeal the map designation to the commissioner within 60 days of the map being recorded by filing a written request for review. The commissioner shall review the request and any supporting evidence and render a decision within 45 days of receipt of the request for review.\n(c) If a property owner wishes to appeal a decision of the commissioner after review under paragraph (b), the property owner must file an appeal with the district court within 60 days of the commissioner's decision.\n(d) If any portion of a map appealed under paragraph (b) is modified or found to be invalid by a court of competent jurisdiction under paragraph (c), the remainder of the map shall not be affected and its recording with the county recorder shall stand.\nThis section does not affect or diminish the legal status or state obligations of roads and trails not shown on the state forest road map.\nAdoption of a state forest road map under this section is exempt from the rulemaking requirements of chapter 14, and section 14.386 does not apply.",
	"repealed": false
}