{
	"id": "289A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.63",
	"title": "289A.63 CRIMINAL PENALTIES.",
	"text": "(a) A person required to file a return, report, or other document with the commissioner, who knowingly, rather than accidentally, inadvertently, or negligently, fails to file it when required, is guilty of a gross misdemeanor. A person required to file a return, report, or other document who willfully attempts in any manner to evade or defeat a tax by failing to file it when required, is guilty of a felony.\n(b) A person required to pay or to collect and remit a tax, who knowingly, rather than accidentally, inadvertently, or negligently, fails to do so when required, is guilty of a gross misdemeanor. A person required to pay or to collect and remit a tax, who willfully attempts to evade or defeat a tax law by failing to do so when required, is guilty of a felony.\n(a) A person who files with the commissioner a return, report, or other document, known by the person to be fraudulent or false concerning a material matter, is guilty of a felony.\n(b) A person who knowingly aids or assists in, or advises in the preparation or presentation of a return, report, or other document that is fraudulent or false concerning a material matter, whether or not the falsity or fraud committed is with the knowledge or consent of the person authorized or required to present the return, report, or other document, is guilty of a felony.\n(a) A person who engages in the business of making retail sales in Minnesota without the permit required under chapter 297A, or a responsible officer of a corporation who so engages in business, is guilty of a gross misdemeanor.\n(b) A person who engages in the business of making retail sales in Minnesota after revocation of a permit under section 270C.722, when the commissioner has not issued a new permit, is guilty of a felony.\nIt is a misdemeanor for a person to broadcast or publish, or arrange to have broadcast or published, an advertisement in a publication or broadcast media, printed, distributed, broadcast, or intended to be received in this state, that states that no sales or use tax is due, when the person knows the advertisement is false.\nAn employee required to supply information to an employer under section 290.92, subdivisions 4a and 5, who knowingly fails to supply information or who knowingly supplies false or fraudulent information to an employer, is guilty of a gross misdemeanor.\nAn agent, canvasser, or employee of a retailer, who is not authorized by permit from the commissioner, may not collect the sales tax as imposed by chapter 297A, nor sell, solicit orders for, nor deliver, any tangible personal property in this state. An agent, canvasser, or employee violating the provisions of section 297A.63; 297A.66 to 297A.71; 297A.75; 297A.76, subdivision 1; 297A.77; 297A.78; 297A.80; 297A.82, subdivision 4; 297A.83; 297A.89; 297A.90; 297A.91; or 297A.96 is guilty of a misdemeanor.\n[Renumbered 270B.18, subd 4]\nCriminal penalties imposed by section 270B.18, subdivision 4, and this section are in addition to any civil penalties imposed by this chapter.\nNotwithstanding section 628.26, or any other provision of the criminal laws of this state, an indictment may be found and filed, or a complaint filed, upon a criminal offense named in section 270B.18, subdivision 4, and this section, in the proper court within six years after the offense is committed.\nThe term \"person\" as used in section 270B.18, subdivision 4, and this section includes any officer or employee of a corporation or a member or employee of a partnership who as an officer, member, or employee is under a duty to perform the act in respect to which the violation occurs.\nIf two or more offenses in section 270B.18, subdivision 4, and this section are committed by the same person in more than one county, the accused may be prosecuted for all the offenses in any county in which one of the offenses was committed.\n(a) A person who sells, purchases, installs, transfers, develops, manufactures, or uses an automated sales suppression device, zapper, phantom-ware, or similar device knowing that the device or phantom-ware is capable of being used to commit tax fraud or suppress sales is guilty of a felony and may be sentenced to imprisonment for not more than five years or to a payment of a fine of not more than $10,000, or both.\n(b) An automated sales suppression device, zapper, phantom-ware, and any other device containing an automated sales suppression, zapper, or phantom-ware device or software is contraband and subject to forfeiture under section 609.5316.\n(c) The definitions in section 289A.14 apply to this subdivision.\n(d) This subdivision does not apply to the commissioner, a person acting at the direction of the commissioner, an agent of the commissioner, law enforcement agencies, or postsecondary education institutions that possess an automated sales suppression device, zapper, or phantom-ware for study to combat the evasion of taxes by use of the automated sales suppression devices, zappers, or phantom-ware.",
	"repealed": false
}