{
	"id": "203B.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.065",
	"title": "203B.065 USING THE REGISTRATION SYSTEM.",
	"text": "Upon accepting an application for a state primary or state general election, the county auditor or municipal clerk shall record in the statewide voter registration system the voter's name, date of birth, address of residence in Minnesota, mailing address, Minnesota driver's license or state identification number, or the last four digits of the voter's Social Security number, if provided by the voter. Upon acceptance of an absentee ballot application of a voter who is registered to vote at an address different from the residential address certified on the absentee ballot application, the voter registration record with the previous address shall be challenged. Once the absentee ballot has been transmitted to the voter, the method of transmission and the date of transmission must be recorded.\nUpon receipt of a returned absentee ballot for a state primary or state general election, the county auditor or municipal clerk shall record in the statewide voter registration system that the voter has returned the ballot.\nUpon receipt of notice that the ballot board has accepted or rejected the absentee ballot for a state primary or state general election, the county auditor or municipal clerk shall record in the statewide voter registration system whether the ballot was accepted or rejected, and if rejected, the reason for rejection. If a replacement ballot is transmitted to the voter, the county auditor or municipal clerk shall record this in the statewide voter registration system.\nThe labels provided for envelopes used for transmitting an absentee ballot to and from an applicant for an absentee ballot for a state primary or state general election must contain bar codes generated by the statewide voter registration system to facilitate the recording required under this section. A county auditor or municipal clerk entering information into the statewide voter registration system under this section must include the information provided on the bar code label whenever information is entered into the system.",
	"repealed": false
}