{
	"id": "12A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/12A.03",
	"title": "12A.03 STATE ASSISTANCE.",
	"text": "Appropriations for programs and projects under this chapter must be made in law. Appropriations from the bond proceeds fund must be spent to acquire and to better publicly owned land and buildings and other public improvements of a capital nature. All appropriations must be used to assist communities within the disaster area to recover.\nState assistance under this chapter may be made available for relief in a disaster area for costs that are not eligible for assistance through the FEMA Public Assistance Program or the FEMA Individual Assistance Program, and may not duplicate or replace assistance available from other federal government agencies, including the Small Business Administration, private insurance, or flood insurance.\nState assistance may not duplicate or supplement eligible FEMA Public Assistance Program assistance. For eligible Public Assistance Program costs, any state cost-share money made available for that assistance must be disbursed by the Department of Public Safety to a state agency, local government, or other applicant. State assistance distributed by a state agency, other than the Department of Public Safety, to a local government or other applicant for disaster costs that are eligible for FEMA Public Assistance Program assistance constitutes an advance of funds. Such advances must be repaid to the applicable state agency when the applicant has received the FEMA Public Assistance Program assistance, and whatever state cost-share money may be made available for that assistance, from the Department of Public Safety.\nA commissioner who provides non-FEMA Public Assistance Program grants or other assistance under this chapter to local government units or eligible entities must report to the appropriate finance chairs in the house of representatives and the senate on the criteria and requirements used by local government units or their agencies in the grants, loans, or assistance programs.\nUnused general fund money appropriated for a project or program in this chapter may be transferred, for assistance in the disaster area, to another program or project funded in this chapter. Appropriation transfers must be used to cover unmet needs in a program or project under this chapter. The commissioner of management and budget must approve all transfers under this section and must report each transfer to the chairs of the senate Finance Committee and house of representatives Ways and Means Committee.",
	"repealed": false
}