{
	"id": "268.184",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.184",
	"title": "268.184 EMPLOYER MISREPRESENTATION AND MISREPORTING; ADMINISTRATIVE PENALTIES.",
	"text": "(a) The commissioner must penalize an employer if that employer or any employee, officer, or agent of that employer made a false statement or representation without a good faith belief as to correctness of the statement or representation or knowingly failed to disclose a material fact in order to:\n(1) assist an applicant to receive unemployment benefits to which the applicant is not entitled;\n(2) prevent or reduce the payment of unemployment benefits to an applicant; or\n(3) avoid or reduce any payment required from an employer under this chapter or section 116L.20.\nThe penalty is the greater of $500 or 50 percent of the following resulting from the employer's action:\n(i) the amount of any overpaid unemployment benefits to an applicant;\n(ii) the amount of unemployment benefits not paid to an applicant that would otherwise have been paid; or\n(iii) the amount of any payment required from the employer under this chapter or section 116L.20 that was not paid.\n(b) The commissioner must penalize an employer if that employer failed or refused to honor a subpoena issued under section 268.188. The penalty is $500 and any costs of enforcing the subpoena, including attorney fees.\n(c) Penalties under this subdivision and under section 268.047, subdivision 4, paragraph (b), are in addition to any other penalties and subject to the same collection procedures that apply to past due taxes. Penalties must be paid within 30 calendar days of issuance of the determination of penalty and credited to the trust fund.\n(d) The determination of penalty is final unless the employer files an appeal within 45 calendar days after the sending of the determination of penalty to the employer by mail or electronic transmission. Proceedings on the appeal are conducted in accordance with section 268.105.\n(a) If the commissioner finds that any employer or agent of an employer failed to meet the notification requirements of section 268.051, subdivision 4, the employer must be assessed a penalty of $5,000 or two percent of the first full quarterly payroll acquired, whichever is higher. Payroll is wages paid as defined in section 268.035, subdivision 30. The penalty under this paragraph must be canceled if the commissioner determines that the failure occurred because of ignorance or inadvertence.\n(b) If the commissioner finds that any individual advised an employer to violate the employer's notification requirements under section 268.051, subdivision 4, the individual, and that individual's employer, must each be assessed the penalty in paragraph (a).\n(c) If the commissioner finds that any person or agent of a person violated the reporting requirements of section 268.046, the person must be assessed a penalty of $5,000 or two percent of the quarterly payroll reported in violation of section 268.046, whichever is higher. Payroll is wages paid as defined in section 268.035, subdivision 30.\n(d) Penalties under this subdivision are in addition to any other penalties and subject to the same collection procedures that apply to past due amounts from an employer. Penalties must be paid within 30 calendar days after sending of the determination of penalty and credited to the trust fund.\n(e) The determination of penalty is final unless the person assessed files an appeal within 45 calendar days after sending of the determination of penalty by mail or electronic transmission. Proceedings on the appeal are conducted in accordance with section 268.105.",
	"repealed": false
}