{
	"id": "62Q.184",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.184",
	"title": "62Q.184 STEP THERAPY OVERRIDE.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Clinical practice guideline\" means a systematically developed statement to assist health care providers and enrollees in making decisions about appropriate health care services for specific clinical circumstances and conditions developed independently of a health plan company, pharmaceutical manufacturer, or any entity with a conflict of interest. A clinical practice guideline also includes a preferred drug list developed in accordance with section 256B.0625.\n(c) \"Clinical review criteria\" means the written screening procedures, decision abstracts, clinical protocols, and clinical practice guidelines used by a health plan company to determine the medical necessity and appropriateness of health care services.\n(d) \"Health plan company\" has the meaning given in section 62Q.01, subdivision 4, but also includes a county-based purchasing plan participating in a public program under chapter 256B or 256L and an integrated health partnership under section 256B.0755.\n(e) \"Step therapy protocol\" means a protocol or program that establishes the specific sequence in which prescription drugs for a specified medical condition, including self-administered drugs and drugs that are administered by a physician, advanced practice registered nurse, or physician assistant, are medically appropriate for a particular enrollee and are covered under a health plan.\n(f) \"Step therapy override\" means that the step therapy protocol is overridden in favor of coverage of the selected prescription drug of the prescribing health care provider because at least one of the conditions of subdivision 3, paragraph (a), exists.\nA health plan company shall consider available recognized evidence-based and peer-reviewed clinical practice guidelines when establishing a step therapy protocol. Upon written request of an enrollee, a health plan company shall provide any clinical review criteria applicable to a specific prescription drug covered by the health plan.\n(a) When coverage of a prescription drug for the treatment of a medical condition is restricted for use by a health plan company through the use of a step therapy protocol, enrollees and prescribing health care providers shall have access to a clear, readily accessible, and convenient process to request a step therapy override. The process shall be made easily accessible on the health plan company's website. A health plan company may use its existing medical exceptions process to satisfy this requirement. A health plan company shall grant an override to the step therapy protocol if at least one of the following conditions exist:\n(1) the prescription drug required under the step therapy protocol is contraindicated pursuant to the pharmaceutical manufacturer's prescribing information for the drug or, due to a documented adverse event with a previous use or a documented medical condition, including a comorbid condition, is likely to do any of the following:\n(i) cause an adverse reaction to the enrollee;\n(ii) decrease the ability of the enrollee to achieve or maintain reasonable functional ability in performing daily activities; or\n(iii) cause physical or mental harm to the enrollee;\n(2) the enrollee has had a trial of the required prescription drug covered by their current or previous health plan, or another prescription drug in the same pharmacologic class or with the same mechanism of action, and was adherent during such trial for a period of time sufficient to allow for a positive treatment outcome, and the prescription drug was discontinued by the enrollee's health care provider due to lack of effectiveness, or an adverse event. This clause does not prohibit a health plan company from requiring an enrollee to try another drug in the same pharmacologic class or with the same mechanism of action if that therapy sequence is supported by the evidence-based and peer-reviewed clinical practice guideline, Food and Drug Administration label, or pharmaceutical manufacturer's prescribing information. This clause does not apply to the commissioner of human services or a managed care plan, county-based purchasing plan, or integrated health partnership administering a pharmacy benefit under chapter 256B or 256L;\n(3) for the fee-for-service system administered by the commissioner of human services, or a managed care plan, county-based purchasing plan, or integrated health partnership administering a pharmacy benefit under chapter 256B or 256L, the enrollee has had a trial of the required prescription drug covered by their current or previous health plan, or a drug in the same pharmacological class with the same mechanism of action, and was adherent during such trial for a period of time sufficient to allow for a positive treatment outcome, and the prescription drug was discontinued by the enrollee's health care provider due to lack of effectiveness, or an adverse event, or the prescriber submits an evidence-based and peer-reviewed clinical practice guideline supporting the use of the requested drug over the required prescription drug. This clause does not prohibit a managed care plan, county-based purchasing plan, or integrated health partnership from requiring an enrollee to try another drug in the same pharmacologic class with the same mechanism of action if that therapy sequence is supported by the evidence-based and peer-reviewed clinical practice guideline, Food and Drug Administration label, or pharmaceutical manufacturer's prescribing information; or\n(4) the enrollee is currently receiving a positive therapeutic outcome on a prescription drug for the medical condition under consideration if, while on their current health plan or the immediately preceding health plan, the enrollee received coverage for the prescription drug and the enrollee's prescribing health care provider gives documentation to the health plan company that the change in prescription drug required by the step therapy protocol is expected to be ineffective or cause harm to the enrollee based on the known characteristics of the specific enrollee and the known characteristics of the required prescription drug.\n(b) Upon granting a step therapy override, a health plan company shall authorize coverage for the prescription drug if the prescription drug is a covered prescription drug under the enrollee's health plan.\n(c) The enrollee, or the prescribing health care provider if designated by the enrollee, may appeal the denial of a step therapy override by a health plan company using the complaint procedure under sections 62Q.68 to 62Q.73 or 256.045.\n(d) In a denial of an override request and any subsequent appeal, a health plan company's decision must specifically state why the step therapy override request did not meet the condition under paragraph (a) cited by the prescribing health care provider in requesting the step therapy override and information regarding the procedure to request external review of the denial pursuant to section 62Q.73. A denial of a request for a step therapy override that is upheld on appeal is a final adverse determination for purposes of section 62Q.73 and is eligible for a request for external review by an enrollee pursuant to section 62Q.73.\n(e) A health plan company shall respond to a step therapy override request or an appeal within five days of receipt of a complete request. In cases where exigent circumstances exist, a health plan company shall respond within 72 hours of receipt of a complete request. If a health plan company does not send a response to the enrollee or prescribing health care provider if designated by the enrollee within the time allotted, the override request or appeal is granted and binding on the health plan company.\n(f) Step therapy override requests must be accessible to and submitted by health care providers, and accepted by group purchasers electronically through secure electronic transmission, as described under section 62J.497, subdivision 5.\n(g) Nothing in this section prohibits a health plan company from:\n(1) requesting relevant documentation from an enrollee's medical record in support of a step therapy override request; or\n(2) requiring an enrollee to try a generic equivalent drug pursuant to section 151.21, or a biosimilar, as defined under United States Code, chapter 42, section 262(i)(2), prior to providing coverage for the equivalent branded prescription drug.\n(h) This section shall not be construed to allow the use of a pharmaceutical sample for the primary purpose of meeting the requirements for a step therapy override.",
	"repealed": false
}