{
	"id": "97A.056",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.056",
	"title": "97A.056 OUTDOOR HERITAGE FUND; LESSARD-SAMS OUTDOOR HERITAGE COUNCIL.",
	"text": "An outdoor heritage fund, under article XI, section 15, of the Minnesota Constitution, is established as an account in the state treasury. All money earned by the outdoor heritage fund must be credited to the fund. At least 99 percent of the money appropriated from the fund must be expended to restore, protect, and enhance wetlands, prairies, forests, and habitat for fish, game, and wildlife. Money appropriated from the outdoor heritage fund shall not be spent to acquire property by eminent domain unless the owner requests that the owner's property be acquired by eminent domain.\nFor the purpose of appropriations from the outdoor heritage fund, \"recipient\" means the entity responsible for deliverables financed by the outdoor heritage fund.\n(a) The Lessard-Sams Outdoor Heritage Council of 12 members is created in the legislative branch, consisting of:\n(1) two public members appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration;\n(2) two public members appointed by the speaker of the house;\n(3) four public members appointed by the governor;\n(4) two members of the senate appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration; and\n(5) two members of the house of representatives appointed by the speaker of the house.\n(b) Members appointed under paragraph (a) must not be registered lobbyists. In making appointments, the governor, senate Subcommittee on Committees of the Committee on Rules and Administration, and the speaker of the house shall consider geographic balance, gender, age, ethnicity, and varying interests including hunting and fishing. The governor's appointments to the council are subject to the advice and consent of the senate.\n(c) Public members appointed under paragraph (a) shall have practical experience or expertise or demonstrated knowledge in the science, policy, or practice of restoring, protecting, and enhancing wetlands, prairies, forests, and habitat for fish, game, and wildlife.\n(d) Legislative members appointed under paragraph (a) shall include the chairs of the legislative committees with jurisdiction over environment and natural resources finance or their designee, one member from the minority party of the senate, and one member from the minority party of the house of representatives.\n(e) Public members serve four-year terms. Appointed legislative members serve at the pleasure of the appointing authority. Public and legislative members continue to serve until their successors are appointed. Public members shall be initially appointed according to the following schedule of terms:\n(1) two public members appointed by the governor for a term ending the first Monday in January 2011;\n(2) one public member appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration for a term ending the first Monday in January 2011;\n(3) one public member appointed by the speaker of the house for a term ending the first Monday in January 2011;\n(4) two public members appointed by the governor for a term ending the first Monday in January 2013;\n(5) one public member appointed by the senate Subcommittee on Committees of the Committee on Rules and Administration for a term ending the first Monday in January 2013; and\n(6) one public member appointed by the speaker of the house for a term ending the first Monday in January 2013.\n(f) Terms, compensation, and removal of public members are as provided in section 15.0575, except that a public member may be compensated at the rate of up to $125 a day. A vacancy on the council may be filled by the appointing authority for the remainder of the unexpired term.\n(g) Members shall elect a chair, vice-chair, secretary, and other officers as determined by the council. The chair may convene meetings as necessary to conduct the duties prescribed by this section.\n(h) The Legislative Coordinating Commission may appoint nonpartisan staff and contract with consultants as necessary to support the functions of the council. The council has final approval authority for the hiring of a candidate for executive director. Up to one percent of the money appropriated from the fund may be used to pay for administrative expenses of the council and for compensation and expense reimbursement of council members.\n(a) The council shall make recommendations to the legislature on appropriations of money from the outdoor heritage fund that are consistent with the constitution and state law and that will achieve the outcomes of existing natural resource plans, including, but not limited to, the Minnesota Statewide Conservation and Preservation Plan, that directly relate to the restoration, protection, and enhancement of wetlands, prairies, forests, and habitat for fish, game, and wildlife, and that prevent forest fragmentation, encourage forest consolidation, and expand restored native prairie. In making recommendations, the council shall consider a range of options that would best restore, protect, and enhance wetlands, prairies, forests, and habitat for fish, game, and wildlife. The council's recommendations shall be submitted no later than January 15 each year. The council shall present its recommendations to the senate and house of representatives committees with jurisdiction over the environment and natural resources budget by February 15 in odd-numbered years, and within the first four weeks of the legislative session in even-numbered years. The council's budget recommendations to the legislature shall be separate from the Department of Natural Resource's budget recommendations.\n(b) To encourage and support local conservation efforts, the council shall establish a conservation partners program. Local, regional, state, or national organizations may apply for matching grants for restoration, protection, and enhancement of wetlands, prairies, forests, and habitat for fish, game, and wildlife, prevention of forest fragmentation, encouragement of forest consolidation, and expansion of restored native prairie.\n(c) The council may work with the Clean Water Council to identify projects that are consistent with both the purpose of the outdoor heritage fund and the purpose of the clean water fund.\n(d) The council may make recommendations to the Legislative-Citizen Commission on Minnesota Resources on scientific research that will assist in restoring, protecting, and enhancing wetlands, prairies, forests, and habitat for fish, game, and wildlife, preventing forest fragmentation, encouraging forest consolidation, and expanding restored native prairie.\n(e) Recommendations of the council, including approval of recommendations for the outdoor heritage fund, require an affirmative vote of at least nine members of the council.\n(f) The council may work with the Clean Water Council, the Legislative-Citizen Commission on Minnesota Resources, the Board of Water and Soil Resources, soil and water conservation districts, and experts from Minnesota State Colleges and Universities and the University of Minnesota in developing the council's recommendations.\n(g) The council shall develop and implement a process that ensures that citizens and potential recipients of funds are included throughout the process, including the development and finalization of the council's recommendations. The process must include a fair, equitable, and thorough process for reviewing requests for funding and a clear and easily understood process for ranking projects.\n(h) The council shall use the regions of the state based upon the ecological sections and subsections developed by the Department of Natural Resources and establish objectives for each region and subregion to achieve the purposes of the fund outlined in the state constitution.\n(i) The council shall develop and submit to the Legislative Coordinating Commission plans for the first ten years of funding, and a framework for 25 years of funding, consistent with statutory and constitutional requirements. The council may use existing plans from other legislative, state, and federal sources, as applicable.\n(j) By July 1 each year, the council shall provide counties with a list of project proposals that include potential fee title land acquisitions in the county that is based on that year's funding requests received by the council from nongovernmental organizations.\n(a) A council member may not be an advocate for or against a council action or vote on any action that may be a conflict of interest. A conflict of interest must be disclosed as soon as it is discovered. The council shall follow the policies and requirements related to conflicts of interest developed by the Office of Grants Management under section 16B.98.\n(b) For the purposes of this section, a \"conflict of interest\" exists when a person has an organizational conflict of interest or direct financial interests and those interests present the appearance that it will be difficult for the person to impartially fulfill the person's duty. An \"organizational conflict of interest\" exists when a person has an affiliation with an organization that is subject to council activities, which presents the appearance of a conflict between organizational interests and council member duties. An \"organizational conflict of interest\" does not exist if the person's only affiliation with an organization is being a member of the organization.\n(a) Meetings of the council and other groups the council may establish are subject to chapter 13D. Except where prohibited by law, the council shall establish additional processes to broaden public involvement in all aspects of its deliberations, including recording meetings, video conferencing, and publishing minutes. For the purposes of this subdivision, a meeting occurs when a quorum is present and the members receive information or take action on any matter relating to the duties of the council. The quorum requirement for the council shall be seven members.\n(b) Travel to and from scheduled and publicly noticed site visits by council members for the purposes of receiving information is not a violation of paragraph (a). Any decision or agreement to make a decision during the travel is a violation of paragraph (a).\n(c) For legislative members of the council, enforcement of this subdivision is governed by section 3.055, subdivision 2. For nonlegislative members of the council, enforcement of this subdivision is governed by section 13D.06, subdivisions 1 and 2.\n(d) Unless held at a location outside the Capitol complex, meetings of the council must be made available on a website for live video streaming and be archived on a website for playback at a later time. For meetings of the council held at a location outside the Capitol complex, the council must make meetings available via live video stream and archive the video to the extent practicable.\nThe legislative auditor shall audit the outdoor heritage fund expenditures, including administrative and staffing expenditures, to ensure that the money is spent in compliance with all applicable law and the constitution.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]\n[Repealed, 2017 c 91 art 1 s 11]\n(a) Money appropriated from the outdoor heritage fund shall not be used to purchase any land in fee title or a permanent conservation easement if the state of Minnesota or a political subdivision of the state owns the land in fee or if the land is wholly or partially subject to a conservation easement.\n(b) Paragraph (a) does not apply if:\n(1) the purchase creates additional direct benefit to protect, restore, or enhance the state's wetlands, prairies, forests, or habitat for fish, game, and wildlife, and the purchase is approved by an affirmative vote of at least nine members of the council; or\n(2) the purchase is for land that is partially subject to a conservation easement and no money appropriated from the outdoor heritage fund is used to pay the purchase price for the portion of land that is subject to the easement. Nothing in this clause prohibits the use of money appropriated from the outdoor heritage fund to pay for costs and other expenses associated with the acquisition of the land as part of the larger acquisition.\n(c) For purposes of this subdivision, \"conservation easement\" means a conservation easement as defined in section 84C.01.\n(a) The commissioner of natural resources and the Board of Water and Soil Resources must convene a technical evaluation panel comprised of five members, including one technical representative from the Board of Water and Soil Resources, one technical representative from the Department of Natural Resources, one technical expert from the University of Minnesota or the Minnesota State Colleges and Universities, and two representatives with expertise in the project being evaluated. The board and the commissioner may add a technical representative from a unit of federal or local government.\n(b) The members of the technical evaluation panel may not be associated with the restoration or enhancement, may vary depending upon the projects being reviewed, and shall avoid any potential conflicts of interest.\n(c) Each year, the board and the commissioner may assign a coordinator to identify habitat restoration or enhancement projects completed with outdoor heritage funding. The coordinator shall secure the plans for the projects specified and direct the technical evaluation panel to evaluate the restorations and enhancements relative to the law, current science, and the stated goals and standards in the project plan and, when applicable, to the Board of Water and Soil Resources' Native Vegetation Establishment and Enhancement Guidelines.\n(d) The coordinator shall summarize the findings of the panel and provide a report to the chair of the Lessard-Sams Outdoor Heritage Council and the chairs of the respective house of representatives and senate policy and finance committees with jurisdiction over natural resources and spending from the outdoor heritage fund. The report shall determine if the restorations and enhancements are meeting planned goals, any problems with the implementation of restorations and enhancements, and, if necessary, recommendations on improving restorations and enhancements. The report shall be focused on improving future restorations and enhancements.\n(e) At least one-tenth of one percent of forecasted receipts from the outdoor heritage fund must be used for restoration and enhancements evaluations under this section.\n(a) A state agency or other recipient of a direct appropriation from the outdoor heritage fund must compile and submit all information for funded projects or programs, including the proposed measurable outcomes and all other items required under section 3.303, subdivision 10, to the Legislative Coordinating Commission as soon as practicable or by January 15 of the applicable fiscal year, whichever comes first. The Legislative Coordinating Commission must post submitted information on the website required under section 3.303, subdivision 10, as soon as it becomes available.\n(b) When practicable, a direct recipient of an appropriation from the outdoor heritage fund shall prominently display on the recipient's website home page the legacy logo required under Laws 2009, chapter 172, article 5, section 10, as amended by Laws 2010, chapter 361, article 3, section 5, accompanied by the phrase \"Click here for more information.\" When a person clicks on the legacy logo image, the website must direct the person to a web page that includes both the contact information that a person may use to obtain additional information, as well as a link to the Legislative Coordinating Commission website required under section 3.303, subdivision 10.\n(c) Future eligibility for money from the outdoor heritage fund is contingent upon a state agency or other recipient satisfying all applicable requirements in this section, as well as any additional requirements contained in applicable session law. If the Office of the Legislative Auditor, in the course of an audit or investigation, publicly reports that a recipient of money from the outdoor heritage fund has not complied with the laws, rules, or regulations in this section or other laws applicable to the recipient, the recipient must be listed in an annual report to the legislative committees with jurisdiction over the legacy funds. The list must be publicly available. The legislative auditor shall remove a recipient from the list upon determination that the recipient is in compliance. A recipient on the list is not eligible for future funding from the outdoor heritage fund until the recipient demonstrates compliance to the legislative auditor.\n(d) A project or program receiving funding from the outdoor heritage fund must include an assessment of whether the funding celebrates cultural diversity or reaches diverse communities in Minnesota, including reaching low- and moderate-income households.\nIt is a condition of acceptance of money appropriated from the outdoor heritage fund that the agency or entity using the appropriation submits an accomplishment plan and periodic accomplishment reports to the Lessard-Sams Outdoor Heritage Council in the form determined by the council. The accomplishment plan must identify the project manager responsible for expending the appropriation and the final product. The accomplishment plan must account for the use of the appropriation and outcomes of the expenditure in measures of wetlands, prairies, forests, and fish, game, and wildlife habitat restored, protected, and enhanced. The plan must include an evaluation of results. If lands are acquired by fee with money from the outdoor heritage fund, the accomplishment plan must include a hunting and fishing management plan for the lands acquired by fee. No money appropriated from the outdoor heritage fund may be expended unless the council has approved the pertinent accomplishment plan.\n(a) As a condition of accepting money appropriated from the outdoor heritage fund, an agency or entity receiving money from an appropriation must comply with this subdivision for any project funded in whole or in part with funds from the appropriation.\n(b) All conservation easements acquired with money appropriated from the outdoor heritage fund must:\n(1) be permanent;\n(2) specify the parties to the easement;\n(3) specify all of the provisions of an agreement that are permanent;\n(4) specify the habitat types and location being protected;\n(5) where appropriate for conservation or water protection outcomes, require the grantor to employ practices retaining water on the eased land as long as practicable;\n(6) specify the responsibilities of the parties for habitat enhancement and restoration and the associated costs of these activities;\n(7) be sent to the office of the Lessard-Sams Outdoor Heritage Council;\n(8) include a long-term stewardship plan and identify the sources and amount of funding for monitoring and enforcing the easement agreement; and\n(9) identify the parties responsible for monitoring and enforcing the easement agreement.\n(c) For all restorations, a recipient must prepare and retain an ecological restoration and management plan that, to the degree practicable, is consistent with current conservation science and ecological goals for the restoration site. Consideration should be given to soil, geology, topography, and other relevant factors that would provide the best chance for long-term success and durability of the restoration. The plan must include the proposed timetable for implementing the restoration, including, but not limited to, site preparation, establishment of diverse plant species, maintenance, and additional enhancement to establish the restoration; identify long-term maintenance and management needs of the restoration and how the maintenance, management, and enhancement will be financed; and use current conservation science to achieve the best restoration.\n(d) For new lands acquired, a recipient must prepare a restoration and management plan in compliance with paragraph (c), including identification of sufficient funding for implementation.\n(e) To ensure public accountability for the use of public funds, a recipient must provide to the Lessard-Sams Outdoor Heritage Council documentation of the process used to select parcels acquired in fee or as permanent conservation easements and must provide the council with documentation of all related transaction costs, including, but not limited to, appraisals, legal fees, recording fees, commissions, other similar costs, and donations. This information must be provided for all parties involved in the transaction. The recipient must also report to the Lessard-Sams Outdoor Heritage Council any difference between the acquisition amount paid to the seller and the state-certified or state-reviewed appraisal, if a state-certified or state-reviewed appraisal was conducted. The commissioner of natural resources may conduct or require additional appraisals of parcels to be acquired in fee title or as conservation easements. Acquisition data such as appraisals may remain private during negotiations but must ultimately be made public according to chapter 13.\n(f) Except as otherwise provided in the appropriation, all restoration and enhancement projects funded with money appropriated from the outdoor heritage fund must be on land permanently protected by a conservation easement or public ownership or in public waters as defined in section 103G.005, subdivision 15.\n(g) To the extent an appropriation is used to acquire an interest in real property, a recipient of an appropriation from the outdoor heritage fund must provide to the Lessard-Sams Outdoor Heritage Council and the commissioner of management and budget an analysis of increased operation and maintenance costs likely to be incurred by public entities as a result of the acquisition and of how the costs are to be paid.\n(h) A recipient of money appropriated from the outdoor heritage fund must give consideration to and make timely written contact with Conservation Corps Minnesota for possible use of the corps' services to contract for restoration and enhancement services. A copy of the written contact must be filed with the Lessard-Sams Outdoor Heritage Council within 15 days of execution.\n(i) A recipient of money appropriated from the outdoor heritage fund must erect signage according to Laws 2009, chapter 172, article 5, section 10.\n(j) At least 30 days before closing on an acquisition of land in fee title with money in whole or in part from the outdoor heritage fund, a nongovernmental organization must notify in writing the county board and town board where the land is located and furnish them a description of the land to be acquired.\nA political subdivision, public or private corporation, or other entity that receives money appropriated from the outdoor heritage fund must use the money in compliance with sections 16C.0725, regarding purchase of recycled, repairable, and durable materials, and 16C.073, regarding purchase and use of paper stock and printing.\n(a) An interest in real property, including, but not limited to, an easement or fee title, that is acquired with money appropriated from the outdoor heritage fund must be used in perpetuity or for the specific term of an easement interest for the purpose for which the appropriation was made. The ownership of the interest in real property transfers to the state if:\n(1) the holder of the interest in real property fails to comply with the terms and conditions of the grant agreement or accomplishment plan; or\n(2) restrictions are placed on the land that preclude its use for the intended purpose as specified in the appropriation.\n(b) A recipient of funding that acquires an interest in real property subject to this subdivision may not alter the intended use of the interest in real property or convey any interest in the real property acquired with the appropriation without the prior review and approval of the Lessard-Sams Outdoor Heritage Council or its successor. The council shall notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the outdoor heritage fund at least 15 business days before approval under this paragraph. The council shall establish procedures to review requests from recipients to alter the use of or convey an interest in real property. These procedures shall allow for the replacement of the interest in real property with another interest in real property meeting the following criteria:\n(1) the interest must be at least equal in fair market value, as certified by the commissioner of natural resources, to the interest being replaced; and\n(2) the interest must be in a reasonably equivalent location and have a reasonably equivalent useful conservation purpose compared to the interest being replaced, taking into consideration all effects from fragmentation of the whole habitat.\n(c) A recipient of funding who acquires an interest in real property under paragraph (a) must separately record a notice of funding restrictions in the appropriate local government office where the conveyance of the interest in real property is filed. The notice of funding agreement must contain:\n(1) a legal description of the interest in real property covered by the funding agreement;\n(2) a reference to the underlying funding agreement;\n(3) a reference to this section; and\n(4) the following statement: \"This interest in real property shall be administered in accordance with the terms, conditions, and purposes of the grant agreement controlling the acquisition of the property. The interest in real property, or any portion of the interest in real property, shall not be sold, transferred, pledged, or otherwise disposed of or further encumbered without obtaining the prior written approval of the Lessard-Sams Outdoor Heritage Council or its successor. The ownership of the interest in real property transfers to the state if: (1) the holder of the interest in real property fails to comply with the terms and conditions of the grant agreement or accomplishment plan; or (2) restrictions are placed on the land that preclude its use for the intended purpose as specified in the appropriation.\"\n(a) By December 1 each year, a recipient of money appropriated from the outdoor heritage fund that is used for the acquisition of an interest in real property, including, but not limited to, an easement or fee title, must submit annual reports on the status of the real property to the Lessard-Sams Outdoor Heritage Council or its successor in a form determined by the council. If lands are acquired by fee with money from the outdoor heritage fund, the real property interest report must include a verification of the status of the hunting and fishing management plan for the lands acquired by fee. The responsibility for reporting under this subdivision may be transferred by the recipient of the appropriation to another person or entity that holds the interest in the real property. To complete the transfer of reporting responsibility, the recipient of the appropriation must:\n(1) inform the person to whom the responsibility is transferred of that person's reporting responsibility;\n(2) inform the person to whom the responsibility is transferred of the property restrictions under subdivision 15; and\n(3) provide written notice to the council of the transfer of reporting responsibility, including contact information for the person to whom the responsibility is transferred.\n(b) After the transfer, the person or entity that holds the interest in the real property is responsible for reporting requirements under this subdivision.\nMoney appropriated from the outdoor heritage fund for easement monitoring and enforcement may be spent only on activities included in an easement monitoring and enforcement plan contained within the accomplishment plan. Money received for monitoring and enforcement, including earnings on the money received, shall be kept in a monitoring and enforcement fund held by the organization and is appropriated for monitoring and enforcing conservation easements in the state. Within 120 days after the close of the entity's fiscal year, an entity receiving appropriations for easement monitoring and enforcement must provide an annual financial report to the Lessard-Sams Outdoor Heritage Council on the easement monitoring and enforcement fund as specified in the accomplishment plan. Money appropriated from the outdoor heritage fund for monitoring and enforcement of easements and earnings on the money appropriated shall revert to the state if:\n(1) the easement transfers to the state under subdivision 15;\n(2) the holder of the easement fails to file an annual report and then fails to cure that default within 30 days of notification of the default by the state; or\n(3) the holder of the easement fails to comply with the terms of the monitoring and enforcement plan contained within the accomplishment plan and fails to cure that default within 90 days of notification of the default by the state.\nThe Lessard-Sams Outdoor Heritage Council may approve the continuation of a project with an organization that has adopted a new name. Continuation of a project with an organization that has undergone a significant change in mission, structure, or purpose requires:\n(1) notice to the chairs of the legislative committees and divisions with jurisdiction over the outdoor heritage fund; and\n(2) presentation by the council of proposed legislation either ratifying or rejecting continued involvement with the new organization.\n(a) Lands acquired by fee with money appropriated from the outdoor heritage fund that are held by the state must be open to the public taking of fish and game during the open season, unless otherwise provided by state law.\n(b) Lands acquired by fee with money appropriated from the outdoor heritage fund that are held by the United States Fish and Wildlife Service must be open to the public taking of fish and game during the open season according to the National Wildlife Refuge System Improvement Act, United States Code, title 16, section 668dd, et seq.\n(c) Except as provided in paragraph (b), lands acquired by fee with money appropriated from the outdoor heritage fund that are held by a nonstate entity must be open to the public taking of fish and game during the open season, unless otherwise prescribed by the commissioner of natural resources.\nA recipient shall not accept a monetary donation or payment from an owner of land that is acquired in fee in whole or in part with an appropriation from the outdoor heritage fund that exceeds the documented expenses that are directly related to and necessary for activities specified in the accomplishment plan approved by the Lessard-Sams Outdoor Heritage Council, unless expressly approved by the Lessard-Sams Outdoor Heritage Council in the accomplishment plan. This subdivision does not apply to donations that are not connected with the acquisition transaction or bargain sales, as defined by Code of Federal Regulations, title 26, section 1.1011-2, provided that the purchase price reimbursed by the state does not exceed the purchase price paid by the recipient.\nLands acquired with money appropriated from the outdoor heritage fund may not be used for emergency haying and grazing in response to federal or state disaster declarations. Conservation grazing under a management plan that is being implemented prior to the emergency declaration may continue.\n(a) A recipient must disclose to the Lessard-Sams Outdoor Heritage Council and the commissioner all revenues that are received by the recipient before the availability of the appropriation ends and that are generated from activities on land acquired in fee title or easement, restored, or enhanced with money from the outdoor heritage fund. The revenues must be disclosed to the council and commissioner no later than 90 days after the availability of the appropriation ends.\n(b) For all revenues disclosed under paragraph (a), a recipient must:\n(1) use the revenues to protect, restore, or enhance wetlands, prairies, forests, or habitat for fish, game, or wildlife according to the appropriation purposes and the approved accomplishment plan;\n(2) use the revenues for other purposes as approved in the accomplishment plan by the Lessard-Sams Outdoor Heritage Council; or\n(3) transfer the revenues to the outdoor heritage fund no later than 90 days after the availability of the appropriation ends, unless otherwise approved by the council.\n(c) Paragraph (b), clause (3), does not apply to the state and its departments and agencies.\nIn any fiscal year, at least five percent of that year's projected tax receipts determined by the most recent forecast for the outdoor heritage fund must not be appropriated.\nAny state agency or organization requesting a direct appropriation from the outdoor heritage fund must inform the Lessard-Sams Outdoor Heritage Council and the house of representatives and senate committees having jurisdiction over the outdoor heritage fund, at the time the request for funding is made, whether the request is supplanting or is a substitution for any previous funding that was not from a legacy fund and was used for the same purpose.",
	"repealed": false
}