{
	"id": "155A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.29",
	"title": "155A.29 SALONS.",
	"text": "A person must not offer cosmetology services for compensation unless the services are provided by a licensee in a licensed salon or as otherwise provided in this section.\nThe conditions and process by which a salon is licensed shall be established by the board by rule. In addition to those requirements, no license shall be issued unless the board first determines that the conditions in clauses (1) to (4) have been satisfied:\n(1) compliance with all local and state laws, particularly relating to matters of infection control, health, and safety;\n(2) the employment of a manager, as defined in section 155A.23, subdivision 8;\n(3) if applicable, evidence of compliance with workers' compensation section 176.182; and\n(4) evidence of continued professional liability insurance coverage of at least $25,000 for each claim and $50,000 total coverage for each policy year for each operator.\nIn addition to complying with the requirements for a salon in subdivision 2, the holder of a salon license for a mobile salon must:\n(1) maintain a permanent business address; and\n(2) notify the board of the locations and schedule of operation of a mobile salon.\nMinimum infection control standards for the operation of a salon shall be established by rule. The salon may be inspected as often as the board considers necessary to affirm compliance.\nA salon shall not be located in a room used for residential purposes. If a salon is in the residence of a person practicing cosmetology, the rooms used for the practice of cosmetology shall be completely partitioned off from the living quarters.\nLicenses shall be renewed every three years by a process established by rule.\nThe licensing and inspection fees are as specified in section 155A.25.\nThe facility in which a person provides threading and no other services requiring licensure by this chapter is exempt from the requirement for a salon license under this section.\nThe facility in which all persons provide hairstyling and makeup services exempted under section 155A.27, subdivision 9, paragraph (c), and no other services requiring licensure by this chapter, is exempt from the requirement for a salon license under this section.",
	"repealed": false
}