{
	"id": "103E.701",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.701",
	"title": "103E.701 REPAIRS.",
	"text": "The term \"repair,\" as used in this section, means to restore all or a part of a drainage system as nearly as practicable to the same hydraulic capacity as originally constructed and subsequently improved, including resloping of ditches and leveling of spoil banks if necessary to prevent further deterioration, realignment to original construction if necessary to restore the effectiveness of the drainage system, and routine operations that may be required to remove obstructions and maintain the efficiency of the drainage system. \"Repair\" also includes:\n(1) incidental straightening of a tile system resulting from the tile-laying technology used to replace tiles; and\n(2) replacement of tiles with the next larger size that is readily available, if the original size is not readily available.\nBefore a repair is ordered, the drainage authority must notify the commissioner if the repair may affect public waters. If the commissioner disagrees with the repair depth, the engineer, a representative appointed by the director, and a soil and water conservation district technician must jointly determine the repair depth using soil borings, field surveys, and other available data or appropriate methods. Costs for determining the repair depth beyond the initial meeting must be shared equally by the drainage system and the commissioner. The determined repair depth must be recommended to the drainage authority. The drainage authority may accept the joint recommendation and proceed with the repair.\nThe town board has the power of a drainage authority to repair a town drainage system located within the town.\n(a) Highway bridges and culverts constructed on a drainage system established on or after March 25, 1947, must be maintained by the road authority charged with the duty of maintenance under section 103E.525.\n(b) Private bridges or culverts constructed as a part of a drainage system established by proceedings that began on or after March 25, 1947, must be maintained by the drainage authority as part of the drainage system. Private bridges or culverts constructed as a part of a drainage system established by proceedings that began before March 25, 1947, may be maintained, repaired, or rebuilt and any portion paid for as part of the drainage system by the drainage authority.\n(c) For a repair of a drainage system that has had redetermination of benefits under section 103E.351, the drainage authority may repair or rebuild existing bridges or culverts on town and home rule charter and statutory city roads constructed as part of the drainage system and any portion of the cost may be paid by the drainage system.\nIn a repair proceeding under sections 103E.701 to 103E.745, if the drainage authority finds that constructing a private road is more cost-effective or practical than constructing a bridge or culvert, a drainage authority may order a private road to be constructed under section 103E.526, instead of a bridge or culvert.\nIn a repair proceeding under sections 103E.701 to 103E.745, if the drainage authority finds that repairs to a private bridge or culvert are more expensive than compensation to landowners for permanent removal of the bridge or culvert, the drainage authority may order an amount of compensation to be paid to all landowners directly benefiting from the bridge or culvert, provided that:\n(1) all landowners directly benefiting from the bridge or culvert provide written consent for permanent removal of the bridge or culvert;\n(2) all landowners directly benefiting from the bridge or culvert agree in writing to permanently waive any right to repair or reconstruction of the bridge or culvert; and\n(3) the compensation and cost of removing the bridge or culvert is less than the cost of repair of the bridge or culvert.\nRepair of a drainage system may include the preservation, restoration, or enhancement of wetlands; wetland replacement under section 103G.222; the realignment of a drainage system to prevent drainage of a wetland; and the incorporation of measures to reduce channel erosion and otherwise protect or improve water quality.\nIf a drainage system repair disturbs or destroys a perennial vegetative cover or structural practice existing under a federal or state conservation program adjacent to the permanent drainage system right-of-way, the practice must be restored according to the applicable practice plan or as determined by the drainage authority, if a practice plan is not available. Restoration costs shall be paid by the drainage system.",
	"repealed": false
}