{
	"id": "360.063",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.063",
	"title": "360.063 AIRPORT ZONING; AUTHORITY, PROCEDURE.",
	"text": "(a) In order to prevent the creation or establishment of airport hazards, every municipality having an airport hazard area within its territorial limits may, unless a joint airport zoning board is permitted under subdivision 3, adopt, amend from time to time, administer, and enforce, under the police power and in the manner and upon the conditions hereinafter prescribed, airport zoning regulations for such airport hazard area, which regulations may divide such area into zones, and, within such zones, specify the land uses permitted and regulate and restrict the height to which structures and trees may be erected or allowed to grow.\n(b) In order to promote health, safety, order, convenience, prosperity, and general welfare and to conserve property values and encourage the most appropriate use of land, the municipality may regulate in airport hazard areas: (1) land use; (2) height restrictions; (3) the location, size, and use of buildings; and (4) the density of population.\n(c) The powers granted by this subdivision may be exercised by metropolitan airports commissions in contiguous cities of the first class in and for which they have been created.\n(d) In the case of airports owned or operated by the state of Minnesota such powers shall be exercised by the state airport zoning boards or by the commissioner of transportation as authorized herein.\nMS 1974 [Repealed, 1976 c 255 s 6]\n(a) Where an airport is owned or controlled by a municipality and an airport hazard area appertaining to the airport is located within the territorial limits of another county or municipality, the municipality owning or controlling the airport may request a county or municipality in which an airport hazard area is located:\n(1) to adopt and enforce airport zoning regulations for the area in question under sections 360.0655 and 360.0656; or\n(2) to join in creating a joint airport zoning board pursuant to paragraph (b). The owning or controlling municipality shall determine which of these actions it shall request, except as provided in paragraph (e) for the Metropolitan Airports Commission. The request shall be made by certified mail to the governing body of each county and municipality in which an airport hazard area is located.\n(b) Where an airport is owned or controlled by a municipality and an airport hazard area appertaining to the airport is located within the territorial limits of another county or municipality, the municipality owning or controlling the airport and the county or other municipality within which the airport hazard area is located may, by ordinance or resolution duly adopted, create a joint airport zoning board, which board shall have the same power to adopt, administer, and enforce airport zoning regulations applicable to the airport hazard area in question as that vested by subdivision 1 in the municipality within which the area is located. A joint board shall have as members two representatives appointed by the municipality owning or controlling the airport and two from the county or municipality, or in case more than one county or municipality is involved two from each county or municipality, in which the airport hazard is located, and in addition a chair elected by a majority of the members so appointed. All members shall serve at the pleasure of their respective appointing authority. Notwithstanding any other provision of law to the contrary, if the owning and controlling municipality is a city of the first class it shall appoint four members to the board, and the chair of the board shall be elected from the membership of the board.\n(c) If a county or municipality, within 60 days of receiving a request from an owning or controlling municipality pursuant to paragraph (a), fails to adopt, or thereafter fails to enforce, the zoning regulations or fails to join in creating a joint airport zoning board, the owning or controlling municipality, or a joint airport zoning board created without participation by the subdivisions which fail to join the board, may itself adopt, administer, and enforce airport zoning regulations for the airport hazard area in question. In the event of conflict between the regulations and airport zoning regulations adopted by the county or municipality within which the airport hazard area is located, section 360.064, subdivision 2, applies.\n(d) \"Owning or controlling municipality,\" as used in this subdivision, includes:\n(1) a joint airport operating board created pursuant to section 360.042 that has been granted all the powers of a municipality in zoning matters under the agreement creating the board;\n(2) a joint airport operating board created pursuant to section 360.042 that has not been granted zoning powers under the agreement creating the board; provided that the board shall not itself adopt zoning regulations nor shall a joint airport zoning board created at its request adopt zoning regulations unless all municipalities that created the joint operating board join to create the joint zoning board; and\n(3) the Metropolitan Airports Commission established and operated pursuant to chapter 473.\n(e) The Metropolitan Airports Commission shall request creation of one joint airport zoning board for each airport operated under its authority.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 140]\nMS 1974 [Repealed, 1976 c 255 s 6]\nIf a municipality, county, or joint airport zoning board fails to adopt within a reasonable time airport zoning regulations in accordance with the provisions of sections 360.011 to 360.076, or adopts regulations or amendments which do not conform to the standard prescribed by the commissioner, the commissioner may, for the protection of the public safety, adopt or supplement and from time to time as may be necessary amend, supplement, or repeal the regulations for the municipality or county until airport zoning rules provided for in sections 360.011 to 360.076, are adopted by the municipality, county, or joint airport zoning board. The commissioner shall have the same powers with reference to the airport zoning regulations as are granted in sections 360.011 to 360.076, to municipalities, administrative boards, and boards of adjustment. An action of the commissioner taken under this subdivision is subject to review by the courts as provided in section 360.072.\nOn receiving notice that an airport zoning variance has been granted by reason of the failure of a board of adjustment to act on the variance as provided in section 360.067, subdivision 2, the commissioner shall review the application and may amend or rescind the variance on finding that this action is required to protect the public safety. No action of the commissioner pursuant to this subdivision shall be effective unless the commissioner notifies the applicant of that action within 60 days after receiving notice that the variance was granted. Any action taken by the commissioner pursuant to this subdivision shall be subject to review by the courts as provided in section 360.072.\n(a) Where an airport is owned or operated by the state of Minnesota, a state airport zoning board shall be created for each airport, which board shall have the same power to adopt, administer, and enforce airport zoning rules applicable to the airport hazard area of such airport as that vested by subdivision 1 in the municipality. Each board shall consist of the commissioner of transportation, or a member of staff appointed by the commissioner, who shall be chair; one member appointed by the county board who may be a member of the county board, of each county in which an airport hazard area is located; and one member appointed by the governing body of each municipality located within the area to be zoned. If the area to be zoned is located entirely within one county and no municipality is located within the area to be zoned, then the duly designated members shall select a third member who shall be a resident of the county. The members of such board shall serve for a period of three years beginning January 1 following their appointment and until their successors are appointed and qualified.\n(b) The zoning rules shall be adopted by an order of the board signed by a majority of its members. Such order shall be published once in a legal newspaper in the county in which the airport is located and shall become effective ten days following the date of its publication. A copy of such order shall be filed in the office of the commissioner of transportation and with the county recorder in each county in which a zoned area is located.\n(c) Any person appointed to serve on a state airport zoning board shall be entitled to reimbursement for travel and other necessary expenses incurred in performance of duties on such board which shall be paid from the appropriations made to the Department of Transportation.\nIf any county board or municipality fails to appoint the member to be appointed by it in the creation of a state airport zoning board within 30 days after requested to do so by the commissioner of transportation, the state airport zoning board, consisting of the remaining members in case more than one county is involved, or the commissioner of transportation in case no board is created, shall have the same power to adopt, administer, and enforce airport zoning rules applicable to an airport hazard area in such county as that conferred upon the commissioner in subdivision 6.",
	"repealed": false
}