{
	"id": "270B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.01",
	"title": "270B.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Return\" means a tax or information return, declaration of estimated tax, or claim for refund under Minnesota tax laws that is filed with the commissioner. \"Return\" includes any amendment or supplement to those documents, including supporting schedules, attachments, or lists that are supplemental to, or part of, the return. \"Return\" also includes any report, application, or other form required to be filed with the commissioner under Minnesota tax laws.\n\"Return information\" means a taxpayer's identity, the nature, source, or amount of the taxpayer's income, payments, receipts, deductions, exemptions, credits, assets, liabilities, net worth, tax liability, tax withheld, deficiencies, overassessments, or tax payments, whether the taxpayer's return was, is being, or will be examined or subject to other investigation or processing, or any other data, received by, recorded by, prepared by, given to, or collected by the commissioner with respect to the determination of the existence, possible existence, or amount of liability of any person under Minnesota tax laws for any tax, penalty, interest, fine, forfeiture, or other imposition, or offense. \"Return information\" includes the failure to file any return required to be filed with the commissioner under Minnesota tax laws. The term does not include data in a form that cannot be associated with, or otherwise identify, directly or indirectly, a particular taxpayer.\n\"Tax administration\" means:\n(1) the administration, management, conduct, direction, and supervision of the execution and application of Minnesota tax laws; and\n(2) the development and formulation of state tax policy relating to the existing or proposed tax laws and related statutes.\n\"Tax administration\" includes assessment, collection, enforcement, litigation, publication, and statistical gathering functions under existing or proposed tax laws and related statutes.\n\"Taxpayer identity\" means the name of a person with respect to whom a return is filed, or the person's mailing address, or the person's taxpayer identifying number. \"Taxpayer identity\" does not include the state taxpayer identifying number of a business entity, which is classified as public data.\n\"Inspected\" and \"inspection\" mean any examination of a return or return information.\n\"Disclosure\" means the making known to any person in any manner whatever a return or return information.\nFor purposes of this chapter only, unless expressly stated otherwise, \"Minnesota tax laws\" means:\n(1) the taxes, refunds, and fees administered by or paid to the commissioner under chapters 115B, 289A (except taxes imposed under sections 298.01, 298.015, and 298.24), 290, 290A, 291, 295, 297A, 297B, 297H, and 403, or any similar Indian tribal tax administered by the commissioner pursuant to any tax agreement between the state and the Indian tribal government, and includes any laws for the assessment, collection, and enforcement of those taxes, refunds, and fees; and\n(2) section 273.1315.\n\"Commissioner\" means the commissioner of revenue.\n\"Person\" includes individuals, fiduciaries, estates, trusts, partnerships, and corporations.\n\"Taxpayer\" means a person required to file, or who files, a return with the commissioner under Minnesota tax laws.\n\"Department of Revenue data\" means data regarding tax administration collected, created, or maintained by the Department of Revenue.",
	"repealed": false
}