{
	"id": "270C.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.32",
	"title": "270C.32 SUBPOENAS.",
	"text": "In addition to the authority to examine and investigate granted under section 270C.31, and to carry out that authority, the commissioner may issue subpoenas to compel a person, at a time and place reasonable under the circumstances, to appear and give testimony, and to produce relevant books, records, papers, documents, and other data, in whatever form, for inspection and copying.\nWhen the commissioner has the authority to issue a subpoena, the commissioner shall honor a reasonable request by a taxpayer to issue a subpoena.\n(a) An examination or investigation may extend to a person that the commissioner determines has access to information that may be relevant to the examination or investigation. When a subpoena requiring the production of records as described in subdivision 1 is served on a third-party record keeper, written notice of the subpoena must be mailed to the taxpayer and to any other person who is identified in the subpoena. The notices must be given within three days of the day on which the subpoena is served. The notice required by this subdivision is sufficient if it is mailed to the last known address of the addressee.\n(b) The provisions of this subdivision regarding notice to the taxpayer or other parties identified in the subpoena do not apply if there is reasonable cause to believe that the giving of notice may lead to attempts to conceal, destroy, or alter records or assets relevant to the examination, to prevent the communication of information from other persons through intimidation, bribery, or collusion, or to flee to avoid prosecution, testifying, or production of records. Notice is not required under this subdivision or under another law if the taxpayer or other parties identified in the subpoena are under criminal investigation, and the subpoena has been issued as part of the criminal investigation.\n(c) A third-party record keeper who is advised that a subpoena has been issued as part of a criminal investigation is prohibited from informing by any means the taxpayer or other parties identified in the subpoena of the receipt of the subpoena, the contents of the subpoena, or the fact that the taxpayer or other parties identified may be or are under criminal investigation.\n(a) The commissioner may issue a subpoena that does not identify the person or persons with respect to whose liability the subpoena is issued, but only if:\n(1) the subpoena relates to the investigation of a particular person or ascertainable group or class of persons;\n(2) there is a reasonable basis to believe that the person or group or class of persons may fail or may have failed to comply with a state revenue law;\n(3) the information sought to be obtained from the examination of the records, and the identity of the person or persons with respect to whose liability the subpoena is issued, is not readily available from other sources;\n(4) the subpoena is clear and specific as to the information sought to be obtained; and\n(5) the information sought to be obtained is limited solely to the scope of the investigation.\n(b) The party served with a subpoena that does not identify the person or persons with respect to whose tax liability the subpoena is issued shall, within 20 days after service of the subpoena, petition the district court for the judicial district of the county in which that party is located for a determination as to whether the commissioner has complied with all the requirements in paragraph (a), clauses (1) to (5), and thus, whether the subpoena is enforceable. If no petition is made by the party served within the time prescribed, the subpoena shall have the force and effect of a court order.\n(a) In order to determine whether a business located outside the state of Minnesota is required to file a return under a law administered by the commissioner, the commissioner may examine the relevant records and files of the business. To the full extent permitted by the Minnesota and United States Constitutions, the commissioner may compel production of those relevant records and files by subpoena. The subpoena may be served on the secretary of state along with the address to which service of the subpoena is to be sent and a fee of $50. The secretary of state shall forward a copy of the subpoena to the business using the procedures for service of process in section 5.25, subdivision 6.\n(b) The commissioner shall pay the reasonable cost of producing records subject to subpoena under this subdivision if:\n(1) the subpoenaed party cannot produce the records without undue burden; and\n(2) the examination made pursuant to paragraph (a) shows that the subpoenaed party is not required to file a return under a law administered by the commissioner.\nIn addition to administrative subpoenas of the commissioner, upon demand of the commissioner or an agent of the commissioner, the court administrator of any district court shall issue a subpoena for a witness to appear before the agent, or for the production of relevant books, records, papers, documents, and other data, in whatever form, to the agent for inspection and copying.\nFailure to comply with a subpoena shall be punished in the same manner as contempt of the district court in the following venues:\n(1) the district court of the district in which a court administrator's subpoena is issued under subdivision 6;\n(2) the district court of the district in which the party served with a subpoena is located, when the subpoena is issued by the commissioner or the commissioner's agent; and\n(3) the District Court for Ramsey County, when a subpoena is issued under subdivision 5. In addition to contempt remedies, the court may issue any order it deems reasonable to enforce compliance with a subpoena issued under subdivision 5.\nIn addition to sanctions imposed under subdivision 7, a penalty of $250 per day is imposed on any business that is in violation of a court order to comply with a subpoena that is seeking information necessary for the commissioner to be able to determine whether the business is required to file a return or pay a tax. The maximum penalty is $25,000. Upon the request of the commissioner, the court shall determine the amount of the penalty and enter it as a judgment in favor of the commissioner. The penalty is not payable until the judgment is entered.\nThe cost of producing records of a third party required by a subpoena must be paid by the taxpayer, if the taxpayer requests the subpoena to be issued, or if the taxpayer has the records available but has refused to provide them to the commissioner. In other cases where the taxpayer cannot produce records and the commissioner then issues a subpoena for third-party records, the commissioner shall pay the reasonable cost of producing the records. The commissioner may later assess the reasonable costs against the taxpayer if the records contribute to the determination of an assessment of tax against the taxpayer.\nThe authority granted in this section to the commissioner and the commissioner's agents does not apply to a matter that has been appealed to Tax Court.",
	"repealed": false
}