{
	"id": "46.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.09",
	"title": "46.09 DEPARTMENT OF COMMERCE EXAMINERS OR EMPLOYEES NOT TO MAINTAIN INTEREST IN SUPERVISED INSTITUTIONS.",
	"text": "No person who is an examiner of financial institutions or other officer of the Department of Commerce directly responsible for the supervision of financial institutions shall be interested, either directly or indirectly, as a stockholder, director, officer, trustee, assignee, employee, or otherwise, in a bank, savings bank, trust company, financial institution, or corporation holding the stock of any such corporation within this state, or which carries on a banking business within this state, either directly or indirectly, or through an affiliated group or chain bank operating within this state. The provisions of this subdivision do not apply to the commissioner of commerce.\nOfficers and examiners of the Department of Commerce referred to in subdivision 1 may:\n(1) maintain a demand or trust account in any financial institution;\n(2) maintain a savings, time or share account in any financial institution;\n(3) transact business with any national bank, federally chartered savings association or federally chartered credit union;\n(4) transact business with any financial institution or licensee subject to the examination by the commissioner of commerce to the extent the transaction is on the same terms, conditions and to the same extent available to all other customers of the financial institution or licensee.\nThe exceptions created in subdivision 2 do not include a loan or advance of credit from a financial institution or licensee subject to examination by the commissioner of commerce. A transaction not specifically exempt by subdivision 2, clauses (1) to (3), is subject to disclosure to the commissioner of commerce upon request to determine if a conflict of interest exists or interest contemplated by subdivision 1.\nThis section applies to those employees, examiners, and officers of the Department of Commerce who are directly responsible for the examination and supervision of financial institutions or licensees.",
	"repealed": false
}