{
	"id": "245.4863",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4863",
	"title": "245.4863 INTEGRATED CO-OCCURRING DISORDER TREATMENT.",
	"text": "(a) The commissioner shall require individuals who perform substance use disorder assessments to screen clients for co-occurring mental health disorders, and staff who perform mental health diagnostic assessments to screen for co-occurring substance use disorders. Screening tools must be approved by the commissioner. If a client screens positive for a co-occurring mental health or substance use disorder, the individual performing the screening must document what actions will be taken in response to the results and whether further assessments must be performed.\n(b) Notwithstanding paragraph (a), screening is not required when:\n(1) the presence of co-occurring disorders was documented for the client in the past 12 months;\n(2) the client is currently receiving co-occurring disorders treatment;\n(3) the client is being referred for co-occurring disorders treatment; or\n(4) a mental health professional who is competent to perform diagnostic assessments of co-occurring disorders is performing a diagnostic assessment to identify whether the client may have co-occurring mental health and substance use disorders. If an individual is identified to have co-occurring mental health and substance use disorders, the assessing mental health professional must document what actions will be taken to address the client's co-occurring disorders.\n(c) The commissioner shall adopt rules as necessary to implement this section. The commissioner shall ensure that the rules are effective on July 1, 2013, thereby establishing a certification process for integrated dual disorder treatment providers and a system through which individuals receive integrated dual diagnosis treatment if assessed as having both a substance use disorder and either a serious mental illness or emotional disturbance.\n(d) The commissioner shall apply for any federal waivers necessary to secure, to the extent allowed by law, federal financial participation for the provision of integrated dual diagnosis treatment to persons with co-occurring disorders.",
	"repealed": false
}