{
	"id": "60A.9579",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.9579",
	"title": "60A.9579 GENERAL RULES.",
	"text": "(a) A viatical settlement provider entering into a viatical settlement contract shall first obtain:\n(1) if the viator is the insured, a written statement from a licensed attending physician that the viator is of sound mind and under no constraint or undue influence to enter into a viatical settlement contract; and\n(2) a document in which the insured consents to the release of the insured's medical records to a licensed viatical settlement provider, viatical settlement broker, and the insurance company that issued the life insurance policy covering the life of the insured.\n(b) Within 20 days after a viator executes documents necessary to transfer any rights under an insurance policy or within 20 days of entering any agreement, option, promise, or any other form of understanding, expressed or implied, to viaticate the policy, the viatical settlement provider shall give written notice to the insurer that issued that insurance policy that the policy has or will become a viaticated policy. The notice shall be accompanied by the documents required by paragraph (c).\n(c) The viatical provider shall deliver a copy of the medical release required under paragraph (a), clause (2), a copy of the viator's application for the viatical settlement contract, the notice required under paragraph (b), and a request for verification of coverage to the insurer that issued the life insurance policy that is the subject of the viatical transaction. The National Association of Insurance Commissioners form for verification of coverage shall be used unless another form is developed or approved by the commissioner.\n(d) The insurer shall respond to a request for verification of coverage submitted on an approved form by a viatical settlement provider or viatical settlement broker within 30 calendar days of the date the request is received and shall indicate whether, based on the medical evidence and documents provided, the insurer intends to pursue an investigation at this time regarding the validity of the insurance contract or possible fraud. The insurer shall accept a request for verification of coverage made on a National Association of Insurance Commissioners form or any other form approved by the commissioner. The insurer shall accept an original or facsimile or electronic copy of a request and any accompanying authorization signed by the viator. Failure by the insurer to meet its obligations under this subdivision is a violation of sections 60A.9581, subdivision 3, and 60A.9585.\n(e) Prior to or at the time of execution of the viatical settlement contract, the viatical settlement provider shall obtain a witnessed document in which the viator consents to the viatical settlement contract, represents that the viator has a full and complete understanding of the viatical settlement contract, that the viator has a full and complete understanding of the benefits of the life insurance policy, acknowledges that the viator is entering into the viatical settlement contract freely and voluntarily and, for persons with a terminal or chronic illness or condition, acknowledges that the insured has a terminal or chronic illness and that the terminal or chronic illness or condition was diagnosed after the life insurance policy was issued.\n(f) If a viatical settlement broker performs any of these activities required of the viatical settlement provider, the provider is deemed to have fulfilled the requirements of this section.\nAll personal information solicited or obtained by any licensee shall be subject to sections 72A.49 to 72A.505.\nA viatical settlement contract entered into in this state shall provide the viator with an absolute right to rescind the contract before the earlier of 30 calendar days after the date upon which the viatical settlement contract is executed by all parties or 15 calendar days after the viatical settlement proceeds have been sent to the viator as provided in subdivision 6. Rescission by the viator may be conditioned upon the viator both giving notice and repaying to the viatical settlement provider within the rescission period all proceeds of the settlement and any premiums, loans, and loan interest paid by or on behalf of the viatical settlement provider in connection with or as a consequence of the viatical settlement. If the insured dies during the rescission period, the viatical settlement contract is deemed to have been rescinded, subject to repayment to the viatical settlement provider or purchaser of all viatical settlement proceeds, and any premiums, loans, and loan interest that have been paid by the viatical settlement provider or purchaser, which shall be paid within 60 calendar days of the death of the insured. In the event of any rescission, if the viatical settlement provider has paid commissions or other compensation to a viatical settlement broker in connection with the rescinded transaction, the viatical settlement broker shall refund all commissions and compensation to the viatical settlement provider within five business days following receipt of written demand from the viatical settlement provider, which demand shall be accompanied by either the viator's notice of rescission if rescinded at the election of the viator, or notice of the death of the insured if rescinded by reason of the death of the insured within the applicable rescission period.\nThe purchaser shall have the right to rescind a viatical settlement contract within three days after the disclosures mandated by section 60A.9577, subdivisions 5 and 6, are received by the purchaser.\nThe viatical settlement provider shall instruct the viator to send the executed documents required to effect the change in ownership, assignment, or change in beneficiary directly to the independent escrow agent. Within three business days after the date the escrow agent receives the document, or from the date the viatical settlement provider receives the documents, if the viator erroneously provides the documents directly to the provider, the provider shall pay or transfer the proceeds of the viatical settlement into an escrow or trust account maintained in a state- or federally chartered financial institution whose deposits are insured by the Federal Deposit Insurance Corporation (FDIC). Upon payment of the settlement proceeds into the escrow account, the escrow agent shall deliver the original change in ownership, assignment, or change in beneficiary forms to the viatical settlement provider or related provider trust or other designated representative of the viatical settlement provider. Upon the escrow agent's receipt of the acknowledgment of the properly completed transfer of ownership, assignment, or designation of beneficiary from the insurance company, the escrow agent shall pay the settlement proceeds to the viator.\nFailure to tender consideration to the viator for the viatical settlement contract within the time set forth in the disclosure pursuant to section 60A.9577, subdivision 1, clause (6), renders the viatical settlement contract voidable by the viator for lack of consideration until the time consideration is tendered to and accepted by the viator. Funds shall be deemed sent by a viatical settlement provider to a viator as of the date that the escrow agent either releases funds for wire transfer to the viator or places a check for delivery to the viator by United States mail or other nationally recognized delivery service.\nContacts with the insured for the purpose of determining the health status of the insured by the viatical settlement provider or viatical settlement broker after the viatical settlement has occurred shall only be made by the viatical settlement provider or broker licensed in this state or its authorized representatives and shall be limited to once every three months for insureds with a life expectancy of more than one year, and to no more than once per month for insureds with a life expectancy of one year or less. The provider or broker shall explain the procedure for these contacts at the time the viatical settlement contract is entered into. The limitations in this subdivision shall not apply to any contacts with an insured for reasons other than determining the insured's health status. Viatical settlement providers and viatical settlement brokers shall be responsible for the actions of their authorized representatives.",
	"repealed": false
}