{
	"id": "205.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.075",
	"title": "205.075 TOWN GENERAL ELECTION.",
	"text": "The general election in a town must be held on the second Tuesday in March, except as provided in subdivision 2 or when moved for bad weather as provided in section 365.51, subdivision 1.\nA town may, by resolution or ordinance, designate the first Tuesday after the first Monday in November of either the even-numbered or the odd-numbered year as the date of the town general election. Town supervisors elected at a November town general election shall serve four-year terms.\nThe ordinance or resolution changing the date of the town general election must include a plan to shorten or lengthen the terms of office to provide an orderly transition to the November election schedule.\nThe ordinance or resolution changing the date of the town general election may be proposed by the town board or by a resolution of the electors adopted at the annual town meeting and is effective upon an affirmative vote of the electors at the next town general election.\nThe town board of a town that has adopted the alternative November election date under subdivision 2 may, after having conducted at least two elections on the alternative date, adopt a resolution designating the second Tuesday in March as the date of the town general election. The resolution must be adopted by a unanimous vote of the town supervisors and must include a plan to shorten or lengthen the terms of office to provide an orderly transition to the March election schedule. The resolution becomes effective upon an affirmative vote of the electors at the next town general election.\nA candidate filing for town supervisor when more than one seat is to be filled at an election held under subdivision 2 must designate when filing the specific seat which the candidate is seeking.\nThe provisions of sections 204B.19, subdivision 5; 204B.21, subdivision 2; 204C.15; 204C.19; 206.83; and 206.86, subdivision 2, relating to party balance in the appointment of judges and to duties to be performed by judges of different major political parties do not apply to a town election not held in conjunction with a statewide election.",
	"repealed": false
}