{
	"id": "469.040",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.040",
	"title": "469.040 TAX STATUS.",
	"text": "The property of an authority is public property used for essential public and governmental purposes. The property and the authority shall be exempt from all real and personal property taxes of the city, the county, the state, or any political subdivision thereof. \"Taxes\" does not include charges for special assessments or for utilities and special services, such as heat, water, electricity, gas, sewage disposal, or garbage removal. For purposes of this subdivision, \"special services\" means those physical services provided to a project for which the actual cost of the governing body providing the service can be calculated. When the obligations issued by an authority to assist in financing the development of a project have been retired and federal contributions have been discontinued, or the authority is no longer obligated by contracts with the federal government to maintain a project as a low-income housing project, whichever is later, then the exemptions from taxes for that project shall terminate.\nNotwithstanding the provisions of subdivision 1, any property other than property to be operated as a parking facility that the authority leases to private individuals or corporations for development in connection with a redevelopment project shall have the same tax status as if the leased property were owned by the private individuals or corporations. This subdivision does not apply to leases by the authority to individuals or families for residential use.\nNotwithstanding the provisions of subdivision 1, after a housing project or a housing development project carried on under sections 469.016 to 469.026 has become occupied, in whole or in part, an authority shall file with the assessor, on or before April 15 of each year, a statement of the aggregate shelter rentals of that project collected during the preceding calendar year. Unless a greater amount has been agreed upon between the authority and the governing body or bodies for which the authority was created, in whose jurisdiction the project is located, five percent of the aggregate shelter rentals shall be charged to the authority as a service charge for the services and facilities to be furnished with respect to that project. The service charge shall be collected from the authority in the manner provided by law for the assessment and collection of taxes. The amount so collected shall be distributed to the several taxing bodies in the same proportion as the tax rate of each bears to the total tax rate of those taxing bodies. The governing body or bodies for which the authority has been created, in whose jurisdiction the project is located, may agree with the authority for the payment of a service charge for a housing project or a housing development project in an amount greater than five percent of the aggregate annual shelter rentals of any project, upon the basis of shelter rentals or upon another basis agreed upon. The service charge may not exceed the amount which would be payable in taxes were the property not exempt. If such an agreement is made, the service charge so agreed upon shall be collected and distributed in the manner above provided. If the project has become occupied, or if the land upon which the project is to be constructed has been acquired, the agreement shall specify the location of the project for which the agreement is made. \"Shelter rental\" means the total rentals of a housing project exclusive of any charge for utilities and special services such as heat, water, electricity, gas, sewage disposal, or garbage removal. \"Service charge\" means payment in lieu of taxes. The records of each project shall be open to inspection by the proper assessing officer.\nIn the metropolitan area, as defined in section 473.121, subdivision 2, the tax treatment provided in subdivision 3 applies to that portion of any multifamily rental housing facility represented by the ratio of (1) the number of units in the facility that are constructed with funds provided under Section 5 of the United States Housing Act of 1937, and are receiving operating subsidy under Section 9 or rental assistance under Section 8 of the United States Housing Act of 1937 as the result of the implementation of a federal court order or consent decree to (2) the total number of units within the facility.\nThe housing and redevelopment authority for the city in which the facility is located, any public entity exercising the powers of such housing and redevelopment authority, or the county housing and redevelopment authority for the county in which the facility is located, shall annually certify to the assessor responsible for assessing the facility, at the time and in the manner required by the assessor, the number of units in the facility that are constructed with funds provided under Section 5 of the United States Housing Act of 1937, and are receiving operating subsidy under Section 9 or rental assistance under Section 8 of the United States Housing Act of 1937.\nNothing in this subdivision shall prevent that portion of the facility not subject to this subdivision from meeting the requirements of section 273.128, and for that purpose the total number of units in the facility must be taken into account.\n(a) To the extent not exempt from taxation under section 272.01, subdivision 1, property located within the exterior boundaries of an Indian reservation in the state that is owned by the tribe's designated housing entity as defined in United States Code, title 25, section 4103(21), and that is a housing project or a housing development project, as defined in section 469.002, subdivisions 13 and 15, is exempt from all real and personal property taxes of the city, the county, the state, or any political subdivision thereof.\n(b) Property exempt from taxation under paragraph (a) is subject to subdivision 3. A copy of those portions of the annual reports submitted on behalf of the housing entity to the Secretary of the United States Department of Housing and Urban Development for the project that contain information sufficient to determine the amount due under subdivision 3 satisfies the reporting requirements of subdivision 3 for the project.",
	"repealed": false
}