{
	"id": "260.758",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.758",
	"title": "260.758 EMERGENCY REMOVAL OR PLACEMENT OF INDIAN CHILD; TERMINATION; APPROPRIATE ACTION.",
	"text": "Nothing in sections 260.751 to 260.835 shall be construed to prevent the emergency removal of an Indian child from the Indian child's parent or Indian custodian, including an Indian child who is a resident of or is domiciled on a reservation but temporarily located off the reservation, or the emergency placement of the Indian child in a foster home or institution under sections 260.751 to 260.835, in order to prevent imminent physical damage or harm to the Indian child.\n(a) The child-placing agency, petitioner, or court shall ensure that the emergency removal or placement terminates immediately when removal or placement is no longer necessary to prevent imminent physical damage or harm to the Indian child. The child-placing agency, petitioner, or court shall expeditiously initiate a child placement proceeding subject to the provisions of sections 260.751 to 260.835, transfer the Indian child to the jurisdiction of the appropriate Indian Tribe, or return the Indian child to the Indian child's parent or Indian custodian as may be appropriate.\n(b) If the Indian child is a resident of or is domiciled on a reservation but temporarily located off the reservation, a court of this state has only temporary emergency jurisdiction until the Indian child is transferred to the jurisdiction of the appropriate Indian Tribe unless the Indian child's Tribe has expressly declined to exercise its jurisdiction, or the Indian child is returned to the Indian child's parent or Indian custodian.\nA petition for a court order authorizing the emergency removal or continued emergency placement of an Indian child, or the petition's accompanying documents, must contain a statement of the risk of imminent physical damage or harm to the Indian child and any evidence that the emergency removal or placement continues to be necessary to prevent imminent physical damage or harm to the Indian child. The petition or its accompanying documents must also contain the following information:\n(1) the name, age, and last known address of the Indian child;\n(2) the name and address of the Indian child's parents and Indian custodians, if any;\n(3) the steps taken to provide notice to the Indian child's parents, Indian custodians, and Tribe about the emergency proceeding;\n(4) if the Indian child's parents and Indian custodians are unknown, a detailed explanation of what efforts have been made to locate and contact them;\n(5) the residence and domicile of the Indian child;\n(6) if either the residence or domicile of the Indian child is believed to be on a reservation or in an Alaska Native village, the name of the Tribe affiliated with that reservation or village;\n(7) the Tribal affiliation of the Indian child and of the Indian child's parents or Indian custodians;\n(8) a specific and detailed account of the circumstances that led the agency responsible for the emergency removal of the Indian child to take that action;\n(9) if the child is believed to reside or be domiciled on a reservation where the Tribe exercises exclusive jurisdiction over Indian child custody matters, a statement of the efforts that have been made and are being made to contact the Tribe and transfer the Indian child to the Tribe's jurisdiction; and\n(10) a statement of the efforts that have been taken to assist the Indian child's parents or Indian custodians so that the Indian child may safely be returned to their custody.\n(a) The court shall hold a hearing no later than 72 hours, excluding weekends and holidays, after the emergency removal of the Indian child. The court shall determine whether the emergency removal continues to be necessary to prevent imminent physical damage or harm to the Indian child.\n(b) The court shall hold additional hearings whenever new information indicates that the emergency situation has ended and must determine at any court hearing during the emergency proceeding whether the emergency removal or placement is no longer necessary to prevent imminent physical damage or harm to the Indian child.\n(a) An emergency removal or placement of an Indian child must immediately terminate once the child-placing agency or court possesses sufficient evidence to determine that the emergency removal or placement is no longer necessary to prevent imminent physical damage or harm to the Indian child and the Indian child shall be immediately returned to the custody of the Indian child's parent or Indian custodian.\n(b) An emergency removal or placement ends when the Indian child is transferred to the jurisdiction of the Indian child's Tribe, or when the court orders, after service upon the Indian child's parents, Indian custodian, and Indian child's Tribe, placement of the Indian child upon a determination supported by clear and convincing evidence, including testimony by a qualified expert witness, that custody of the Indian child by the Indian child's parent or Indian custodian is likely to result in serious emotional or physical damage to the Indian child.\n(c) In no instance shall emergency removal or emergency placement of an Indian child extend beyond 30 days unless the court finds by a showing of clear and convincing evidence that: (1) continued emergency removal or placement is necessary to prevent imminent physical damage or harm to the Indian child; (2) the court has been unable to transfer the proceeding to the jurisdiction of the Indian child's Tribal court; and (3) it has not been possible to initiate a child placement proceeding with all of the protections under sections 260.751 to 260.835, including obtaining the testimony of a qualified expert witness.",
	"repealed": false
}