{
	"id": "326B.701",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.701",
	"title": "326B.701 CONSTRUCTION CONTRACTOR REGISTRATION.",
	"text": "The following definitions apply to this section:\n(a) \"Building construction or improvement services\" means public or private sector commercial or residential building construction or improvement services.\n(b) \"Business entity\" means a person as that term is defined in paragraph (h), except the term does not include an individual.\n(c) \"Commissioner\" means the commissioner of labor and industry or a duly designated representative of the commissioner who is either an employee of the Department of Labor and Industry or person working under contract with the Department of Labor and Industry.\n(d) \"Day\" means calendar day unless otherwise provided.\n(e) \"Department\" means the Department of Labor and Industry.\n(f) \"Document\" or \"documents\" includes papers; books; records; memoranda; data; contracts; drawings; graphs; charts; photographs; digital, video, and audio recordings; records; accounts; files; statements; letters; emails; invoices; bills; notes; and calendars maintained in any form or manner.\n(g) \"Individual\" means a human being.\n(h) \"Person\" means any individual, sole proprietor, limited liability company, limited liability partnership, corporation, partnership, incorporated or unincorporated association, joint stock company, or any other legal or commercial entity.\n(a) Except as provided in paragraph (b), any person who provides or performs building construction or improvement services in the state of Minnesota must register with the commissioner as provided in this section before providing or performing building construction or improvement services. The requirements for registration under this section are not a substitute for, and do not relieve a person from complying with, any other law requiring that the person be licensed, registered, or certified.\n(b) The registration requirements in this section do not apply to:\n(1) a person who, at the time the person is providing or performing the building construction or improvement services, holds a current license, certificate, or registration under chapter 299M or 326B;\n(2) a person who has given a bond to the state under section 326B.197 or 326B.46;\n(3) an employee of the person providing or performing the building construction or improvement services;\n(4) an architect or professional engineer engaging in professional practice as defined in section 326.02, subdivisions 2 and 3;\n(5) a school district or technical college governed under chapter 136F;\n(6) a person providing or performing building construction or improvement services on a volunteer basis, including but not limited to Habitat for Humanity and Builders Outreach Foundation, and their individual volunteers when engaged in activities on their behalf; or\n(7) a person exempt from licensing under section 326B.805, subdivision 6, clause (4).\n(a) Persons required to register under this section must submit electronically, in the manner prescribed by the commissioner, a complete application according to this subdivision.\n(b) A complete application must include all of the following information and documentation about the person who is applying for a registration:\n(1) the person's legal name;\n(2) the person's assumed names filed with the secretary of state, if applicable;\n(3) the person's telephone number;\n(4) the person's email address;\n(5) the person's business address;\n(6) the person's physical address, if different from the business address;\n(7) the legal name, telephone number, and email address of the person's registered agent, if applicable, and the registered agent's business address and physical address, if different from the business address;\n(8) the jurisdiction in which the person is organized, if that jurisdiction is not in Minnesota, as applicable;\n(9) the legal name of the person in the jurisdiction in which it is organized, if the legal name is different than the legal name provided in clause (1), as applicable;\n(10) all of the following identification numbers, if all of these identification numbers have been issued to the person. A complete application must include at least one of the following identification numbers:\n(i) the person's Social Security number;\n(ii) the person's Minnesota tax identification number; or\n(iii) the person's federal employer identification number;\n(11) evidence of the active status of the person's business filings with the secretary of state, if applicable;\n(12) whether the person has any employees at the time the application is filed, and if so, how many employees the person employs;\n(13) the legal names of all persons with an ownership interest in the business entity, if applicable, and the percentage of the interest owned by each person, except that the names of shareholders with less than ten percent ownership in a publicly traded corporation need not be provided;\n(14) information documenting the person's compliance with workers' compensation and unemployment insurance laws for the person's employees, if applicable;\n(15) whether the person or any persons with an ownership interest in the business entity as disclosed under clause (13) have been issued a notice of violation, administrative order, licensing order, or order to comply by the Department of Labor and Industry in the last ten years;\n(16) a certification that the individual signing the application has: reviewed it; asserts that the information and documentation provided is true and accurate; and that the individual is authorized to sign and file the application as an agent or authorized representative of the person. The name of the individual signing, entered on an electronic application, shall constitute a valid signature of the agent or authorized representative on behalf of the person; and\n(17) a signed authorization for the Department of Labor and Industry to verify the information and documentation provided on or with the application.\n(c) A registered person must notify the commissioner within 15 days after there is a change in any of the information on the application as approved. This notification must be provided electronically in the manner prescribed by the commissioner. However, if the structure or legal form of the business entity has changed, the person must submit a new registration application.\n(d) A person must maintain a current and up-to-date registration while providing or performing building construction or improvement services. The provisions of sections 326B.091, 326B.094, 326B.095, and 326B.097 apply to this section. Registration application and expiration time frames are as follows:\n(1) all registrations issued after December 31, 2015, expire on the following December 31 of each odd-numbered year; and\n(2) a person may submit a renewal application starting October 1 of the year the registration expires. If a renewal application is submitted later than December 1 of the expiration year, the registration may expire before the department has issued or denied the renewal.\n(a) The commissioner shall develop and maintain a website on which persons can submit a registration or renewal application. The website shall be designed to receive and process applications and promptly issue registration certificates electronically to successful applicants.\n(b) The commissioner shall maintain the following information on the department's official public website:\n(1) the registered person's legal name, including any assumed name filed with the secretary of state;\n(2) the legal names of the persons with an ownership interest in the business entity;\n(3) the registered person's business address and physical address, if different from the business address, provided on the application; and\n(4) the effective date of the registration and the expiration date.\n(a) The prohibited activities in this subdivision are in addition to those prohibited in section 326B.082, subdivision 11.\n(b) A person who provides or performs building construction or improvement services shall not:\n(1) provide or perform building construction or improvement services without being registered, if required to be registered under this section;\n(2) require an individual who is the person's employee to register; or\n(3) engage another person to provide or perform building construction or improvement services if the other person is required to be registered under this section and is not registered. It is not a violation of this clause:\n(i) for a person to have engaged an unregistered person if the unregistered person held a current registration on the date they began providing or performing the building construction or improvement services; or\n(ii) for a homeowner or business to engage an unregistered person if the homeowner or business is not in the trade, business, profession, or occupation of performing building construction or improvement services.\n(c) Each day a person who is required to be registered provides or performs building construction or improvement services while unregistered shall be considered a separate violation.\nThe commissioner may investigate and enforce this section under the authority in chapters 177 and 326B.\nMS 2022 [Repealed by amendment, 2024 c 127 art 10 s 25]\nData in applications and any required documentation submitted to the commissioner under this section are private data on individuals or nonpublic data as defined in section 13.02 except for the registration information published on the department's website. Data that document a suspension, revocation, or cancellation of a registration are public data. Notwithstanding its classification as private data on individuals or nonpublic data, data in applications and any required documentation submitted to the commissioner under this section may be used by the commissioner to investigate and take enforcement action related to laws for which the commissioner has enforcement responsibility and the commissioner may share data and documentation with the Department of Revenue, the Department of Commerce, the Department of Human Rights, or the Department of Employment and Economic Development. The commissioner may release to the departments data classified as private or nonpublic under this subdivision or investigative data that are not public under section 13.39 that relate to prohibited activities under this section and section 181.723.",
	"repealed": false
}