{
	"id": "332.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.70",
	"title": "332.70 BUSINESS SCREENING SERVICES; DATA PRACTICES.",
	"text": "For purposes of this section:\n(a) \"Business screening service\" means a person regularly engaged in the business of collecting, assembling, evaluating, or disseminating criminal records on individuals for a fee. Business screening service does not include a government entity, as defined in section 13.02, or the news media.\n(b) \"Conviction\" has the meaning given in section 609.02, subdivision 5.\n(c) \"Criminal record\" means a record of an arrest, citation, prosecution, criminal proceeding, or conviction.\nA business screening service must only disseminate a criminal record that reflects the complete and accurate record provided by the source of the data. A complete and accurate record is a record that has:\n(1) been updated within 30 days of its receipt; or\n(2) been verified with the source of the data within the previous 90 days as being up-to-date.\n(a) If the completeness or accuracy of a criminal record maintained by a business screening service is disputed by the individual who is the subject of the record, the screening service shall, without charge, investigate the disputed record. In conducting an investigation, the business screening service shall review and consider all relevant information submitted by the subject of the record with respect to the disputed record to determine whether the record maintained by the screening service accurately reflects the content of the official record, as maintained by the official government custodian.\n(b) If, upon investigation, the screening service determines that the record does not accurately reflect the content of the official record, the screening service shall correct the disputed record so as to accurately reflect the content of the official record. If the disputed record is found to be sealed, expunged, or the subject of a pardon, the business screening service shall promptly delete the record. A business screening service that complies with this subdivision is not in violation of this section.\n(c) A business screening service may terminate an investigation of a disputed record if the business screening agency reasonably determines that the dispute is frivolous, which may be based on the failure of the subject of the record to provide sufficient information to investigate the disputed record. Upon making a determination that the dispute is frivolous, the business screening service shall inform the subject of the record of the specific reasons why it has determined that the dispute is frivolous and provide a description of any information required to investigate the disputed record.\n(d) The business screening service shall notify the subject of the disputed record of the correction or deletion of the record or of the termination or completion of the investigation related to the record within 30 days of the date when the agency receives notice of the dispute from the subject of the record.\nIf a business screening service knows that a criminal record has been sealed, expunged, or is the subject of a pardon, the screening service shall promptly delete the record.\nA business screening service that disseminates a criminal record that was collected on or after July 1, 2010, must include the date when the record was collected by the business screening service and a notice that the information may include criminal records that have been expunged, sealed, or otherwise have become inaccessible to the public since that date.\n(a) A business screening service that violates this section is liable to the individual who is the subject of the record for a penalty of $1,000 or actual damages caused by the violation, whichever is greater, plus costs and disbursements and reasonable attorney fees.\n(b) A business screening service in compliance with the applicable provisions of the Fair Credit Reporting Act, United States Code, title 15, section 1681, et seq., is considered to be in compliance with this section. Those entities are subject to the state remedies under this subdivision when their actions would violate this section and federal law.\nA business screening service that disseminates criminal record information in this state or that obtains a criminal record from a government entity, as defined in section 13.02, or a court in this state is deemed to have consented to service of process in this state for purposes of section 5.25, subdivision 4, or other applicable law and to the jurisdiction of courts in this state for actions involving a violation of this section or for the recovery of remedies under this section.",
	"repealed": false
}