{
	"id": "519.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/519.11",
	"title": "519.11 ANTENUPTIAL AND POSTNUPTIAL AGREEMENTS.",
	"text": "(a) Two individuals of legal age may enter into an antenuptial agreement prior to the solemnization of marriage which shall be valid and enforceable if the agreement meets the procedural and substantive fairness requirements under subdivisions 1b and 1c.\n(b) An antenuptial agreement made in conformity with this section may:\n(1) determine what rights each party has in the marital and nonmarital property, as those terms are defined in section 518.003, subdivision 3b, upon a dissolution of marriage or legal separation;\n(2) provide for spousal maintenance, as defined in section 518.003, subdivision 3a;\n(3) determine the rights that each party has in the estate of the other as otherwise conferred upon them by chapter 524; and\n(4) may bar each other of all rights in the respective estates not so secured to them by their agreement.\n(c) The marriage itself is adequate consideration for an agreement made in conformity with this section.\n(d) An agreement duly acknowledged and attested is prima facie proof of the matters acknowledged in the agreement.\n(e) If an antenuptial agreement unambiguously permits severability, the court may sever any unenforceable provision and enforce the remaining provisions of the agreement.\nMS 2022 [Repealed by amendment, 2024 c 101 art 3 s 1]\n(a) For purposes of this subdivision, \"full and fair disclosure\" means that each party has provided a reasonably accurate description of all material facts of their income and good faith estimates of the value of their property and discloses the basis for these disclosures. A party must not waive the full and fair disclosure requirement under paragraph (b), clause (1).\n(b) An antenuptial agreement is procedurally fair if:\n(1) there is full and fair disclosure of the current income and property of each party;\n(2) each party has had a meaningful opportunity to consult with independent legal counsel of the party's choosing;\n(3) the agreement is in writing, executed in the presence of two witnesses, and acknowledged by the parties before a person authorized to administer an oath under the laws of this state;\n(4) the agreement is entered into voluntarily and free of duress; and\n(5) the agreement is entered into and executed no less than seven days before the marriage.\n(c) An agreement entered into and executed at least seven days before the date of marriage is presumed enforceable and the burden of proof is on the party seeking to set aside the agreement. An agreement that is entered into and executed less than seven days before the marriage is not presumed enforceable, and the proponent of the agreement has the burden of proof.\n(d) A power of attorney does not satisfy the requirements of paragraph (b), clause (3).\n(a) In determining if an agreement under this section is substantively fair, the court shall consider whether all or part of the agreement is substantively unfair as to be unconscionable to a party either by the agreement's terms or as the result of drastically changed circumstances originally not foreseen when the agreement was created, such that enforcement would no longer comport with the reasonable expectations of the parties at the time that the parties executed the agreement.\n(b) The agreement need not approximate a division of marital or nonmarital property, or an award of spousal maintenance, consistent with statutory law regarding property division or spousal maintenance. A deviation from statutory standards does not in itself make an agreement unconscionable.\n(a) Spouses who are legally married under the laws of this state may enter into a postnuptial agreement, which is valid and enforceable if the agreement:\n(1) complies with the requirements for antenuptial agreements in this section and in the laws of this state, including but not limited to the requirement that the agreement be procedurally and substantively fair except that subdivision 1b, paragraph (b), clause (5), does not apply; and\n(2) complies with the requirements for postnuptial agreements in this section.\n(b) A postnuptial agreement that conforms with this section may determine all matters that may be determined by an antenuptial agreement under the law of this state.\n(c) A postnuptial agreement is valid and enforceable only if at the time of its execution each spouse is represented by separate legal counsel.\n(d) A postnuptial agreement is presumed to be unenforceable if either party commences an action for a legal separation or dissolution within two years of the date of the agreement's execution, unless the spouse seeking to enforce the postnuptial agreement can establish that the postnuptial agreement is fair and equitable.\n(e) Nothing in this section impairs the validity or enforceability of a contract, an agreement, or a waiver that is entered into after marriage and that is described in sections 524.2-201 to 524.2-215. Further, a conveyance permitted by section 500.19 is not a postnuptial agreement under this section.\nMS 2022 [Repealed by amendment, 2024 c 101 art 3 s 1]\nAn antenuptial agreement may be amended or revoked after the marriage of the parties only by a valid postnuptial agreement that complies with this section and with the laws of this state. A postnuptial agreement may be amended or revoked only by a later, valid postnuptial agreement that complies with this section and with the laws of this state.\nMS 2022 [Repealed by amendment, 2024 c 101 art 3 s 1]\nMS 2022 [Repealed by amendment, 2024 c 101 art 3 s 1]\nMS 2022 [Repealed by amendment, 2024 c 101 art 3 s 1]\nThis section applies to all antenuptial and postnuptial agreements executed on or after August 1, 2024. An antenuptial agreement entered into before August 1, 2024, shall not be invalidated based on the same sex of the parties to the agreement.\nNothing in sections 519.01 to 519.101, shall be construed to affect antenuptial or postnuptial agreements.",
	"repealed": false
}