{
	"id": "16C.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.137",
	"title": "16C.137 MINIMIZING ENERGY USE; RENEWABLE FUELS.",
	"text": "Each state department must, whenever legally, technically, and economically feasible, subject to the specific needs of the department and responsible management of agency finances:\n(1) ensure that all new on-road vehicles, excluding emergency and law enforcement vehicles, are purchased in conformity with the vehicle preference order established in section 16C.135, subdivision 3;\n(2) increase its use of renewable transportation fuels, including ethanol, biodiesel, and hydrogen from agricultural products; and\n(3) increase its use of web-based Internet applications and other electronic information technologies to enhance the access to and delivery of government information and services to the public, and reduce the reliance on the department's fleet for the delivery of such information and services.\n(a) The commissioner of administration, in collaboration with the commissioners of the Pollution Control Agency, the Departments of Agriculture, Commerce, Natural Resources, and Transportation, and other state departments, must evaluate the goals and directives established in this section and report their findings to the governor and the appropriate committees of the legislature by February 1 of each odd-numbered year. In the report, the commissioner must make recommendations for new or adjusted goals, directives, or legislative initiatives, in light of the progress the state has made implementing this section and the availability of new or improved technologies.\n(b) The Department of Administration shall implement a fleet reporting and information management system. Each department will use this management system to demonstrate its progress in complying with this section.\nPetroleum-based diesel fuel used in a vehicle which a department has retrofit to use ultra low sulfur diesel fuel and to add additional emissions control technologies is excluded when evaluating progress toward the reduction goals established in subdivision 1. This exclusion applies only to vehicles purchased before the model year in which the federal Environmental Protection Agency's new clean diesel emission reduction rules take effect.",
	"repealed": false
}