{
	"id": "245F.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.13",
	"title": "245F.13 MEDICATIONS.",
	"text": "A license holder must employ or contract with a registered nurse to develop the policies and procedures for medication administration. A registered nurse must provide supervision as defined in section 148.171, subdivision 23, for the administration of medications. For clinically managed programs, the registered nurse supervision must include on-site supervision at least monthly or more often as warranted by the health needs of the patient. The medication administration policies and procedures must include:\n(1) a provision that patients may carry emergency medication such as nitroglycerin as instructed by their prescriber;\n(2) requirements for recording the patient's use of medication, including staff signatures with date and time;\n(3) guidelines regarding when to inform a licensed practitioner or a registered nurse of problems with medication administration, including failure to administer, patient refusal of a medication, adverse reactions, or errors; and\n(4) procedures for acceptance, documentation, and implementation of prescriptions, whether written, oral, telephonic, or electronic.\nA license holder must have in place and implement written policies and procedures relating to control of drugs. The policies and procedures must be developed by a registered nurse and must contain the following provisions:\n(1) a requirement that all drugs must be stored in a locked compartment. Schedule II drugs, as defined in section 152.02, subdivision 3, must be stored in a separately locked compartment that is permanently affixed to the physical plant or a medication cart;\n(2) a system for accounting for all scheduled drugs each shift;\n(3) a procedure for recording a patient's use of medication, including staff signatures with time and date;\n(4) a procedure for destruction of discontinued, outdated, or deteriorated medications;\n(5) a statement that only authorized personnel are permitted to have access to the keys to the locked drug compartments; and\n(6) a statement that no legend drug supply for one patient may be given to another patient.",
	"repealed": false
}