{
	"id": "84.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.65",
	"title": "84.65 CONSERVATION RESTRICTIONS; EFFECT OF RECORDING; RELEASE OF RESTRICTIONS; ENFORCEMENT.",
	"text": "No conservation restriction defined in section 84.64 and acquired pursuant to section 84.64, subdivision 1, shall be unenforceable on account of lack of privity of estate or contract or lack of benefit to particular land. Nonprofit charitable corporations or home rule charter or statutory cities acquiring such conservation restrictions shall file a notice of each such acquisition with the Department of Natural Resources within 90 days. All restrictions shall be duly recorded and indexed in the office of the county recorder or the registrar of titles for the county where the land lies so as to affect its title, in the manner of other conveyances of interests in land, and shall describe the land subject to the restrictions by adequate legal description or by reference to a recorded plat showing its boundaries.\nThe restriction may be enforced by injunction and shall entitle representatives of the holder of it to enter the land in a reasonable manner and at reasonable times to assure compliance.\nThe restriction may be conveyed in the same manner as any other interest in land. Notwithstanding any other provision to the contrary, a restriction may be released by the holder of the restriction or the dominant interest to the holder of the fee title or the servient interest. In the event a corporation, defined in section 84.64, subdivision 1, clause (2), no longer holds a license to do business in Minnesota, and said corporation has made no provision for the disposition of a conservation restriction held by it by transfer to another nonprofit corporation, the conservation restriction shall revert to and vest in the state of Minnesota and be administered by the commissioner of natural resources.\nThis section shall not be construed to imply that any restriction, easement, covenant or condition which does not have the benefit of this section shall, on account of any provision hereof, be unenforceable. Nothing in this section or section 84.64 shall diminish the powers granted by law to the commissioner of natural resources or to any other state agency or political subdivision to acquire by purchase, gift, eminent domain or otherwise and to use land for public purposes.",
	"repealed": false
}