{
	"id": "611A.0315",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.0315",
	"title": "611A.0315 VICTIM NOTIFICATION; DOMESTIC ASSAULT; CRIMINAL SEXUAL CONDUCT; HARASSMENT; STALKING.",
	"text": "(a) A prosecutor shall make every reasonable effort to notify a victim of domestic assault, a criminal sexual conduct offense, or harassment or stalking that the prosecutor has decided to decline prosecution of the case or to dismiss the criminal charges filed against the defendant. Efforts to notify the victim should include, in order of priority: (1) contacting the victim or a person designated by the victim by telephone; and (2) contacting the victim by mail. If a suspect is still in custody, the notification attempt shall be made before the suspect is released from custody.\n(b) Whenever a prosecutor dismisses criminal charges against a person accused of domestic assault, a criminal sexual conduct offense, or harassment or stalking, a record shall be made of the specific reasons for the dismissal. If the dismissal is due to the unavailability of the witness, the prosecutor shall indicate the specific reason that the witness is unavailable.\n(c) Whenever a prosecutor notifies a victim of domestic assault, criminal sexual conduct, or harassment or stalking under this section, the prosecutor shall also inform the victim of the method and benefits of seeking an order for protection under section 518B.01 or a restraining order under section 609.748 and that the victim may seek an order without paying a fee.\nFor the purposes of this section, the following terms have the meanings given them.\n(a) \"Assault\" has the meaning given it in section 609.02, subdivision 10.\n(b) \"Domestic assault\" means an assault committed by the actor against a family or household member.\n(c) \"Family or household member\" has the meaning given it in section 518B.01, subdivision 2.\n(d) \"Harassment\" or \"stalking\" means a violation of section 609.749.\n(e) \"Criminal sexual conduct offense\" means a violation of sections 609.342 to 609.3453.",
	"repealed": false
}