{
	"id": "216B.686",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.686",
	"title": "216B.686 OTHER ENVIRONMENTAL IMPROVEMENT PLANS.",
	"text": "(a) In order to encourage a utility to address multiple pollutants, a utility required to submit mercury-reduction plans under sections 216B.68 to 216B.688 may also propose plans for investments and related expenses in pollution control equipment to be installed at facilities in Minnesota needed to comply with state or federal emission-control statutes or regulations that became effective after December 31, 2004.\n(b) For each plan, the utility must show that the investments in pollution control equipment to be installed at facilities in Minnesota under the plan will provide for increased environmental and public health benefits, do not impose excessive costs on the utility's customers, and will achieve at least the pollution control required by applicable state or federal regulations.\nA public utility that files a plan under this section may also file for approval of an emissions-reduction rate rider under section 216B.683, subdivision 1.\n(a) The Pollution Control Agency shall evaluate a utility's plans filed under this section and, within 180 days of receiving the filing, provide the commission with:\n(1) verification that the emissions-reduction project qualifies under subdivision 1;\n(2) a description of the projected environmental benefits of the proposed project; and\n(3) its assessment of the appropriateness of the proposed plans.\n(b) In preparing its review under this subdivision, the agency may request additional information from the utility, especially with regard to alternative technologies or configurations applicable to a specific unit, and the estimated costs of those alternatives.\nThe commission shall review and evaluate a utility's plans and associated emissions-reduction riders for other environmental improvement initiatives submitted under this section. The commission shall consider the overall environmental and public health benefits, total costs, and competitiveness of customer rates. Within 180 days of receiving the agency's report prepared under subdivision 3, the commission shall approve the plan and associated emissions-reduction rider if the commission finds that it meets the requirements of subdivision 1, paragraph (b).",
	"repealed": false
}