{
	"id": "103I.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.601",
	"title": "103I.601 EXPLORATORY BORING PROCEDURES.",
	"text": "(a) For the purposes of this section, the following words have the meanings given them.\n(b) \"Data\" includes samples and factual noninterpreted data obtained from exploratory borings and samples including analytical results.\n(c) \"Parcel\" means a government section, fractional section, or government lot.\n(d) \"Samples\" means at least a one-quarter portion of all samples from exploratory borings that are customarily collected by the explorer. When the exploratory borings are being done to explore or prospect for kaolin clay, \"samples\" means a representative sample of at least two cubic inches of material per foot from exploratory borings of the material that is customarily collected by the explorer.\n(a) Except as provided in paragraph (d), a person must not make an exploratory boring without an explorer's license. The fee for an explorer's license is $75. The explorer's license is valid until the date prescribed in the license by the commissioner.\n(b) A person must file an application and renewal application fee to renew the explorer's license by the date stated in the license. The renewal application fee is $75.\n(c) If the licensee submits an application fee after the required renewal date, the licensee:\n(1) must include a late fee of $75; and\n(2) may not conduct activities authorized by an explorer's license until the renewal application, renewal application fee, late fee, and sealing reports required in subdivision 9 are submitted.\n(d) An explorer must designate a responsible individual to supervise and oversee the making of exploratory borings.\n(1) Before an individual supervises or oversees an exploratory boring, the individual must file an application and application fee of $75 to qualify as a certified responsible individual.\n(2) The individual must take and pass an examination relating to construction, location, and sealing of exploratory borings. A professional engineer or geoscientist licensed under sections 326.02 to 326.15 or a professional geologist certified by the American Institute of Professional Geologists is not required to take the examination required in this subdivision, but must be certified as a responsible individual to supervise an exploratory boring.\n(3) The individual must file an application and a renewal fee of $75 to renew the responsible individual's certification by the date stated in the certification. If the certified responsible individual submits an application fee after the renewal date, the certified responsible individual must include a late fee of $75 and may not supervise or oversee exploratory borings until the renewal application, application fee, and late fee are submitted.\n(a) By 30 days before making an exploratory boring, an explorer must register with the commissioner of natural resources and provide a copy of the registration to the commissioner of health. The registration must include:\n(1) the identity of the firm, association, or company engaged in exploratory boring; and\n(2) the identification of an agent, including the agent's business address.\n(b) The commissioner of natural resources may require a bond, security, or other assurance from an explorer if the commissioner of natural resources has reasonable doubts about the explorer's financial ability to comply with requirements of law relating to exploratory boring. The commissioner's determination to require assurance is exempt from the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(c) An explorer shall annually register with the commissioner of natural resources while conducting exploratory boring.\n(a) By ten days before beginning exploratory boring, an explorer must submit to the commissioner of health a notification of the proposed boring map and a fee of $275.\n(b) By ten days before beginning exploratory boring, an explorer must submit to the commissioners of health and natural resources a county road map on a single sheet of paper that is 8-1/2 by 11 inches in size and having a scale of one-half inch equal to one mile, as prepared by the Department of Transportation, or a 7.5 minute series topographic map (1:24,000 scale), as prepared by the United States Geological Survey, showing the location of each proposed exploratory boring to the nearest estimated 40 acre parcel. Exploratory boring that is proposed on the map may not be commenced later than 180 days after submission of the map, unless a new map is submitted.\nThe commissioners of health, natural resources, and the Pollution Control Agency, the community health board as authorized under section 145A.04, and their officers and employees shall have access to exploratory boring sites to inspect the drill holes, drilling, and sealing of the borings, and to sample ambient air and drilling waters, and to measure the radioactivity of the waste drill cuttings at the drilling site at the time of observation.\nThe explorer must promptly notify the commissioners of health, natural resources, and the Pollution Control Agency, and the authorized agent of the commissioner of health of an occurrence during exploratory boring that has a potential for significant adverse health or environmental effects. The explorer must take reasonable action to minimize the adverse effects.\nThe commissioner of health may, if necessary, inspect data before its submission under section 103I.605. The data examined by the commissioner is not public data before it is submitted under section 103I.605.\nExploratory borings must be temporarily or permanently sealed according to rules adopted by the commissioner.\n(a) By 30 days after permanent or temporary sealing of an exploratory boring, the explorer must submit a report to the commissioners of health and natural resources.\n(b) The report must be on forms provided by the commissioner of health and include:\n(1) the location of each drill hole in as large a scale as possible, which is normally prepared as part of the explorer's record;\n(2) the type and thickness of overburden and rock encountered;\n(3) identification of water bearing formations encountered;\n(4) identification of hydrologic conditions encountered;\n(5) method of sealing used;\n(6) methods of construction and drilling used; and\n(7) average scintillometer reading of waste drill cuttings from uranium or other radioactive mineral exploratory borings before backfilling of the recirculation pits.",
	"repealed": false
}