{
	"id": "176.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.291",
	"title": "176.291 DISPUTES; PETITIONS; PROCEDURE.",
	"text": "(a) Where there is a dispute as to a question of law or fact in connection with a claim for compensation, a party may serve on all other parties and file a petition with the office stating the matter in dispute. The petition shall be on a form prescribed by the commissioner and shall be signed by the petitioner.\n(b) The petition shall also state and include, where applicable:\n(1) names and residence or business address of parties;\n(2) facts relating to the employment at the time of injury, including amount of wages received;\n(3) extent and character of each injury;\n(4) notice to or knowledge by employer of injury;\n(5) copies of written medical reports or medical records supporting each claim asserted;\n(6) copies of other information in support of the claim;\n(7) names and addresses of all known witnesses intended to be called in support of each injury and claim;\n(8) the desired location of any hearing and estimated time needed to present evidence at the hearing;\n(9) any requests for a prehearing or settlement conference;\n(10) a list of all known third parties, including the Departments of Human Services and Employment and Economic Development, who may have paid any medical bills or other benefits to the employee for the injuries or disease alleged in the petition or for the time the employee was unable to work due to the injuries or disease, together with a listing of the amounts paid by each;\n(11) the nature and extent of each claim; and\n(12) a request for an expedited hearing which must include an attached affidavit of significant financial hardship which complies with the requirements of section 176.341, subdivision 6.\n(c) Incomplete petitions may be stricken or dismissed from the calendar as provided by section 176.305, subdivision 4. Within 14 days of a request by a party, an employee who has filed a claim petition pursuant to section 176.271 or this section shall furnish a list of physicians and health care providers from whom the employee has received treatment for the same or a similar condition as well as authorizations to release relevant information, data, and records to the requester. The petition may be stricken from the calendar upon motion of a party for failure to timely provide the required list of health care providers or authorizations.",
	"repealed": false
}