{
	"id": "142C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142C.12",
	"title": "142C.12 TRAINING REQUIREMENTS.",
	"text": "(a) Before having unsupervised direct contact with a child, but within 90 days after the first date of direct contact with a child, the director, all staff persons, substitutes, and unsupervised volunteers must successfully complete pediatric first aid and pediatric cardiopulmonary resuscitation (CPR) training, unless the training has been completed within the previous two calendar years. Staff must complete the pediatric first aid and pediatric CPR training at least every other calendar year and the center must document the training in the staff person's personnel record.\n(b) Training completed under this subdivision may be used to meet the in-service training requirements under subdivision 6.\nA certified center that cares for an infant who is younger than one year of age must ensure that the director, all staff persons, including substitutes, unsupervised volunteers, and any other volunteers receive training according to section 142B.46 on reducing the risk of sudden unexpected infant death before assisting in the care of an infant.\nA certified center that cares for a child under school age must ensure that the director and all staff persons, including substitutes and unsupervised volunteers, receive training on abusive head trauma before assisting in the care of a child under school age.\nBefore having unsupervised direct contact with a child, but within 90 days after the first date of direct contact with a child, the director, all staff persons, substitutes, and unsupervised volunteers must complete child development and learning training. Child development and learning training must be repeated every second calendar year thereafter. The director and staff persons not including substitutes must complete at least two hours of training on child development. The training for substitutes and unsupervised volunteers is not required to be of a minimum length. For purposes of this subdivision, \"child development and learning training\" means how a child develops physically, cognitively, emotionally, and socially and learns as part of the child's family, culture, and community.\nThe certified center must ensure the director and all staff persons, substitutes, and unsupervised volunteers are trained at orientation on health and safety requirements in this section and sections 142C.10, 142C.11, and 142C.13. The certified center must provide orientation within 14 days after the first date of direct contact with a child. Before the completion of orientation, these individuals must be supervised while providing direct care to a child.\n(a) The certified center must ensure that the director and all staff persons, including substitutes and unsupervised volunteers, are trained at least once each calendar year on health and safety requirements in this section and sections 142C.10, 142C.11, and 142C.13.\n(b) The director and each staff person, not including substitutes, must complete at least six hours of training each calendar year. Training required under paragraph (a) may be used toward the hourly training requirements of this subdivision.\nA certified center must document the date of a completed training required by this section in the personnel record of each staff person.",
	"repealed": false
}