{
	"id": "268.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.065",
	"title": "268.065 LIABILITY OF AMOUNTS DUE FROM SUBCONTRACTORS AND EMPLOYEE LEASING FIRMS.",
	"text": "A contractor who contracts with any subcontractor must guarantee the payment of all amounts that are due or become due from the subcontractor with respect to taxable wages paid on the contract by:\n(1) withholding sufficient money on the contract; or\n(2) requiring the subcontractor to provide a sufficient bond guaranteeing the payment of all amounts that may become due.\nThe contractor may make a request for verification that the subcontractor has paid the taxes due 60 calendar days after the due date for filing the wage detail report that includes the final wages paid for employment performed under the contract. If the subcontractor has paid the amounts due for the period covered by the contract, the commissioner may release the contractor from its liability.\nThe words \"contractor\" and \"subcontractor\" include individuals, partnerships, firms, or corporations, or other association of persons engaged in the construction industry.\n(a) A person whose work force consists of 50 percent or more of workers provided by an employee leasing company, professional employer organization, or similar person for a fee, is jointly and severally liable for the unpaid amounts that are due under this chapter or section 116L.20 on the wages paid on the contract with the employee leasing company, professional employer organization, or similar person.\n(b) An exemption from registration under section 79.255, subdivision 9, does not determine the application of this section.\nThe commissioner must make a determination as to the liability under this section. The determination is final unless the contractor or person found to be liable files an appeal within 45 calendar days after being sent the determination by mail or electronic transmission. Proceedings on the appeal are conducted in accordance with section 268.105.",
	"repealed": false
}