{
	"id": "410.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/410.05",
	"title": "410.05 CHARTER COMMISSION.",
	"text": "When the district court of the judicial district in which a city is situated, deems it for the best interest of the city so to do, the court, acting through its chief judge, may appoint a charter commission to frame and amend a charter. Upon presentation of a petition requesting such action, signed by at least ten percent of the number of voters of the city, as shown by the returns of the last regular city election, or upon resolution of the governing body of the city requesting such action, the court shall appoint a charter commission. The commission shall be composed of not less than seven nor more than 15 members, each of whom shall be a qualified voter of the city. The size of the commission shall be determined within the above limits by the court, except that where the commission is appointed pursuant to a petition of the voters or resolution of the governing body of the city, the size of the commission shall be as specified in such petition or resolution. Any city may by charter provision fix the size of the charter commission at a figure which shall not be less than seven nor more than 15 members, and such charter provision shall prevail over any inconsistent provisions of this subdivision. Except as otherwise provided in the charter, no person shall be disqualified from serving on a charter commission by reason of holding any other elective or appointive office other than judicial. The charter may provide that members of the governing body of the city cannot serve on the charter commission.\nCharter commission members shall hold office for the term of four years, and until their successors are appointed and qualify, except that of members initially appointed after July 1, 1967, eight shall be appointed for two-year terms and seven for four-year terms. Vacancies in the commission shall be filled by appointment of the chief judge for the unexpired terms. Upon the expiration of each term, the chief judge shall appoint new or reappoint existing commission members within 60 days. Appointments shall be made by order filed with the court administrator of the district court. An appointee who neglects to file with the court administrator within 30 days a written acceptance and oath of office shall be deemed to have declined the appointment and the place shall be filled as though the appointee had resigned. The charter commission, within 30 days after the initial appointment of the commission, shall make rules, including quorum requirements, with reference to its operations and procedures. The commission shall submit to the chief judge of the district court, on or before December 31 of each year, an annual report outlining its activities and accomplishments for the preceding calendar year. The commission shall forward a copy of the report to the clerk of the city. Any member may be removed at any time from office, by written order of the district court, the reason for such removal being stated in the order. When any member has failed to perform the duties of office and has failed to attend four consecutive meetings without being excused by the commission, the secretary of the charter commission shall file a certificate with the court setting forth those facts and the district court shall thereupon make its order of removal and the chief judge shall fill the vacancy created thereby.\nA city council, a charter commission, or the petitioners requesting the appointment of a charter commission may submit to the court the names of eligible nominees which the district court may consider in making appointments to the charter commission.\nThe charter commission shall meet at least once during each calendar year, and upon presentation of a petition signed by at least ten percent of the number of voters of the municipality, as shown by the returns of the last annual municipal election, or upon resolution approved by a majority of the governing body of the city requesting the commission to convene, the commission shall meet to consider the proposals set forth in such petition or resolution.\n(a) A charter commission in a statutory city may be discharged as follows:\n(1) if the charter commission of a statutory city determines that a charter is not necessary or desirable, the commission may be discharged by a vote of three-fourths of its members; or\n(2) if a petition signed by registered voters equal in number to at least five percent of the registered voters in the city requesting a referendum to discharge the charter commission is filed with the city clerk, an election must be held on the issue at a general election or a special election pursuant to section 205.10. If a majority of the votes cast support the referendum, the charter commission shall be discharged.\n(b) Another commission may not be formed sooner than one year from the date of discharge.",
	"repealed": false
}