{
	"id": "475.553",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.553",
	"title": "475.553 PAYING AGENT; DESTRUCTION OF OBLIGATIONS AND COUPONS.",
	"text": "The governing body may appoint as paying agent for an issue of obligations one or more national banks, or banks incorporated under the laws of any state, provided that no bank shall be appointed as paying agent for obligations of any issuer except one within whose corporate limits the principal office of the bank is situated, unless it is authorized to execute corporate trust powers pursuant to the laws under which it is organized; and the governing body may direct the treasurer to remit funds for payment of both principal and interest to such paying agent although such paying agent has not complied with statutes relating to public depositories. It may also direct the county treasurer to remit any proceeds from assessments or taxes levied for payment of obligations directly to such paying agent. In such case, the county treasurer shall furnish a duplicate statement of each remittance to the treasurer of the municipality who shall enter the amount on the treasury's books.\nThe governing body may by resolution direct that all bonds, obligations, coupons appertaining thereto, or any specified obligations or coupons, when paid, shall be canceled by the paying agent and destroyed as herein provided. Before such authority is granted, the municipality shall enter into an agreement with a bank or banking association incorporated under the laws of the United States or of any state and authorized by such laws to exercise corporate trust powers, specifying (a) the obligations and coupons to be destroyed, (b) the method of destruction, (c) the information to be recorded in a certificate of destruction to be delivered to the municipality and the paying agent, (d) the indemnification of the municipality in the event of duplicate payment, wrongful and improper payment to unauthorized persons and nonpayment to authorized persons occurring as a result of any destruction of bonds, obligations, or coupons, and (e) such other terms and conditions as may be determined by the governing body of such municipality. Obligations and coupons may be destroyed by cremation, shredding, or any other effective means.\nCertificates provided under subdivision 2 shall be retained in the official records of the municipality and the paying agent. Such certificates may subsequently be destroyed at the times and upon the conditions otherwise permitted by law, but no earlier than the time of final payment and redemption of all obligations of the respective issues to which they pertain.\nMS 1974 [Repealed, 1976 c 324 s 27]\nAny obligation, as defined in section 475.51, issued or to be issued by the state or any agency, instrumentality, or subdivision thereof, by written order and agreement executed by the officer or officers authorized by law to issue such obligations, may be destroyed as provided herein, and for this purpose such officers shall have all the powers granted herein to governing bodies of municipalities. The state auditor, pursuant to the Administrative Procedure Act, may formulate and prescribe requirements for resolutions, orders, agreements, and certificates relating to the destruction of public obligations and coupons. The provisions of any other law relating to the destruction of public records shall not apply to the destruction of obligations and coupons.",
	"repealed": false
}