{
	"id": "325K.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/325K.11",
	"title": "325K.11 WARRANTIES AND OBLIGATIONS UPON ISSUANCE OF CERTIFICATE.",
	"text": "By issuing a certificate, a licensed certification authority warrants to the subscriber named in the certificate that:\n(1) the certificate contains no information known to the certification authority to be false;\n(2) the certificate satisfies all material requirements of this chapter; and\n(3) the certification authority has not exceeded any limits of its license in issuing the certificate.\nThe certification authority may not disclaim or limit the warranties of this subdivision.\nUnless the subscriber and certification authority otherwise agree, a certification authority, by issuing a certificate, promises to the subscriber:\n(1) to act promptly to suspend or revoke a certificate in accordance with section 325K.14 or 325K.15; and\n(2) to notify the subscriber within a reasonable time of any facts known to the certification authority that significantly affect the validity or reliability of the certificate once it is issued.\nBy issuing a certificate, a licensed certification authority certifies to all who reasonably rely on the information contained in the certificate that:\n(1) the information in the certificate and listed as confirmed by the certification authority is accurate;\n(2) all information foreseeably material to the reliability of the certificate is stated or incorporated by reference within the certificate;\n(3) the subscriber has accepted the certificate; and\n(4) the licensed certification authority has complied with all applicable laws of this state governing issuance of the certificate.\nBy publishing a certificate, a licensed certification authority certifies to the repository in which the certificate is published and to all who reasonably rely on the information contained in the certificate that the certification authority has issued the certificate to the subscriber.",
	"repealed": false
}