{
	"id": "356.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.87",
	"title": "356.87 HEALTH INSURANCE WITHHOLDING.",
	"text": "(a) Upon authorization of a person entitled to receive a retirement annuity, disability benefit or survivor benefit, the executive director of a public pension fund enumerated in section 356.20, subdivision 2, shall withhold health insurance premium amounts from the retirement annuity, disability benefit or survivor benefit, and shall pay the premium amounts to the public employees insurance program.\n(b) The public employees insurance program shall reimburse a public pension fund for the administrative expense of withholding the premium amounts and shall assume liability for the failure of a public pension fund to properly withhold the premium amounts.\n(a) For purposes of this subdivision, \"governing board\" means the governing board or body that has been assigned the chief policy-making powers and management duties of the applicable pension plan.\n(b) For a pension plan covered under section 356.20, subdivision 2, that provides monthly annuity payments, the governing board may direct the plan's chief administrative officer to withhold health, accident, and long-term care insurance premiums from the retirement annuity or disability benefit and to transmit the amount to an approved insurance provider specified by the eligible person. A governing board which agrees to participate may revise or revoke that decision at a later date if the board provides reasonable notice to the applicable parties.\n(c) An eligible person is a person who:\n(1) is a retiree or disabilitant from a participating plan;\n(2) was a public safety officer as defined in United States Code, title 42, section 3796b;\n(3) terminated service as a public safety officer due to disability or attainment of normal retirement age and commences receipt of an annuity without any period of deferral; and\n(4) satisfies any other requirements to have all or a portion of the health, accident, or long-term care insurance premiums excluded from income for taxation purposes, as specified in section 845 of Public Law 109-280, the Pension Protection Act of 2006.\n(d) An approved insurance provider is:\n(1) any regulated, licensed insurance company;\n(2) a fraternal or any other organization sponsoring a regulated, licensed insurance program; or\n(3) an employer-sponsored insurance program, whether directly through the employer or a third-party administrator.\n(e) An eligible person may elect to have the applicable plan administrator withhold and transmit the insurance amounts described in paragraph (b). The eligible person must make this election on a form prescribed by the chief administrative officer of the applicable plan.\n(f) A pension fund and the plan fiduciaries which authorize or administer withholding of insurance premiums under this subdivision is not liable for failure to properly withhold or transmit the premium amounts.",
	"repealed": false
}