{
	"id": "62D.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.124",
	"title": "62D.124 GEOGRAPHIC ACCESSIBILITY.",
	"text": "Within the health maintenance organization's service area, the maximum travel distance or time shall be the lesser of 30 miles or 30 minutes to the nearest provider of each of the following services: primary care services, mental health services, and general hospital services. The health maintenance organization must designate which method is used.\nWithin a health maintenance organization's service area, the maximum travel distance or time shall be the lesser of 60 miles or 60 minutes to the nearest provider of specialty physician services, ancillary services, specialized hospital services, and all other health services not listed in subdivision 1. The health maintenance organization must designate which method is used.\n(a) A health maintenance organization may apply to the commissioner of health for a waiver of the requirements in subdivision 1 or 2 if it is unable to meet those requirements. A waiver application must be submitted on a form provided by the commissioner, must be accompanied by an application fee of $500 per county per year, for each application to waive the requirements in subdivision 1 or 2 for one or more provider types in that county, and must:\n(1) demonstrate with specific data that the requirements of subdivision 1 or 2 are not feasible in a particular service area or part of a service area; and\n(2) include specific information as to the steps that were and will be taken to address network inadequacy, and, for steps that will be taken prospectively to address network inadequacy, the time frame within which those steps will be taken.\n(b) Using the guidelines and standards established under section 62K.10, subdivision 5, paragraph (b), the commissioner shall review each waiver request and shall approve a waiver only if:\n(1) the standards for approval established by the commissioner are satisfied; and\n(2) the steps that were and will be taken to address the network inadequacy and the time frame for implementing these steps satisfy the standards established by the commissioner.\n(c) If, in its waiver application, a health maintenance organization demonstrates to the commissioner that there are no providers of a specific type or specialty in a county, the commissioner may approve a waiver in which the health maintenance organization is allowed to address network inadequacy in that county by providing for patient access to providers of that type or specialty via telehealth, as defined in section 62A.673, subdivision 2.\n(d) A waiver shall automatically expire after three years. Upon or prior to expiration of a waiver, a health maintenance organization unable to meet the requirements in subdivision 1 or 2 must submit a new waiver application under paragraph (a) and must also submit evidence of steps the organization took to address the network inadequacy. When the commissioner reviews a waiver application for a network adequacy requirement which has been waived for the organization for the most recent three-year period, the commissioner shall also examine the steps the organization took during that three-year period to address network inadequacy, and shall only approve a subsequent waiver application if it satisfies the requirements in paragraph (b), demonstrates that the organization took the steps it proposed to address network inadequacy, and explains why the organization continues to be unable to satisfy the requirements in subdivision 1 or 2.\n(e) Application fees collected under this subdivision shall be deposited in the state government special revenue fund in the state treasury.\n(a) Subdivisions 1 and 2 do not apply if an enrollee is referred to a referral center for health care services.\n(b) Subdivision 1 does not apply:\n(1) if an enrollee has chosen a health plan with full knowledge that the health plan has no participating providers within 30 miles or 30 minutes of the enrollee's place of residence; or\n(2) to service areas approved before May 24, 1993.\n(c) Beginning for coverage effective on or after January 1, 2015, subdivisions 1 to 4 shall only apply to individual or small group health plans that are grandfathered plans, as defined under section 62A.011, subdivision 1c.\nThe commissioner of health, the commissioner of commerce, and the commissioner of human services shall merge reporting requirements for health maintenance organizations and county-based purchasing plans related to Minnesota Department of Health oversight of network adequacy under this section and the provider network list reported to the Department of Human Services under Minnesota Rules, part 4685.2100. The commissioners shall work with health maintenance organizations and county-based purchasing plans to ensure that the report merger is done in a manner that simplifies health maintenance organization and county-based purchasing plan reporting processes.\nA health maintenance organization must provide on the organization's website the provider network for each product offered by the organization, and must update the organization's website at least once a month with any changes to the organization's provider network, including provider changes from in-network status to out-of-network status. A health maintenance organization must also provide on the organization's website, for each product offered by the organization, a list of the current waivers of the requirements in subdivision 1 or 2, in a format that is easily accessed and searchable by enrollees and prospective enrollees.",
	"repealed": false
}