{
	"id": "151.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.06",
	"title": "151.06 POWERS AND DUTIES.",
	"text": "(a) The Board of Pharmacy shall have the power and it shall be its duty:\n(1) to regulate the practice of pharmacy;\n(2) to regulate the manufacture, wholesale, and retail sale of drugs within this state;\n(3) to regulate the identity, labeling, purity, and quality of all drugs and medicines dispensed in this state, using the United States Pharmacopeia and the National Formulary, or any revisions thereof, or standards adopted under the federal act as the standard;\n(4) to enter and inspect by its authorized representative any and all places where drugs, medicines, medical gases, or veterinary drugs or devices are sold, vended, given away, compounded, dispensed, manufactured, wholesaled, or held; it may secure samples or specimens of any drugs, medicines, medical gases, or veterinary drugs or devices after paying or offering to pay for such sample; it shall be entitled to inspect and make copies of any and all records of shipment, purchase, manufacture, quality control, and sale of these items provided, however, that such inspection shall not extend to financial data, sales data, or pricing data;\n(5) to examine and license as pharmacists all applicants whom it shall deem qualified to be such;\n(6) to license wholesale drug distributors;\n(7) to take disciplinary action against any registration or license required under this chapter upon any of the grounds listed in section 151.071, and in accordance with the provisions of section 151.071;\n(8) to employ necessary assistants and adopt rules for the conduct of its business;\n(9) to register as pharmacy technicians all applicants who the board determines are qualified to carry out the duties of a pharmacy technician;\n(10) to perform such other duties and exercise such other powers as the provisions of the act may require; and\n(11) to enter and inspect any business to which it issues a license or registration.\n(b) For the purposes aforesaid, it shall be the duty of the board to make and publish uniform rules not inconsistent herewith for carrying out and enforcing the provisions of this chapter. The board shall adopt rules regarding prospective drug utilization review and patient counseling by pharmacists. A pharmacist in the exercise of the pharmacist's professional judgment, upon the presentation of a prescription by a patient or the patient's caregiver or agent, shall perform the prospective drug utilization review required by rules issued under this subdivision.\n(c) If the United States Food and Drug Administration (FDA) determines that the substitution of drugs used for the treatment of epilepsy or seizures poses a health risk to patients, the board shall adopt rules in accordance with accompanying FDA interchangeability standards regarding the use of substitution for these drugs. If the board adopts a rule regarding the substitution of drugs used for the treatment of epilepsy or seizures that conflicts with the substitution requirements of section 151.21, subdivision 3, the rule shall supersede the conflicting statute. If the rule proposed by the board would increase state costs for state public health care programs, the board shall report to the chairs and ranking minority members of the senate Health and Human Services Budget Division and the house of representatives Health Care and Human Services Finance Division the proposed rule and the increased cost associated with the proposed rule before the board may adopt the rule.\n(a) Whenever it appears to the board that a person has engaged in an act or practice constituting a violation of a law, rule, or other order related to the duties and responsibilities entrusted to the board, the board may issue and cause to be served upon the person an order requiring the person to cease and desist from violations.\n(b) The cease and desist order must state the reasons for the issuance of the order and must give reasonable notice of the rights of the person to request a hearing before an administrative law judge. A hearing must be held not later than ten days after the request for the hearing is received by the board. After the completion of the hearing, the administrative law judge shall issue a report within ten days. Within 15 days after receiving the report of the administrative law judge, the board shall issue a further order vacating or making permanent the cease and desist order. The time periods provided in this provision may be waived by agreement of the executive director of the board and the person against whom the cease and desist order was issued. If the person to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person is in default, and the proceeding may be determined against that person upon consideration of the cease and desist order, the allegations of which may be considered to be true. Unless otherwise provided, all hearings must be conducted according to chapter 14. The board may adopt rules of procedure concerning all proceedings conducted under this subdivision.\n(c) If no hearing is requested within 30 days of service of the order, the cease and desist order will become permanent.\n(d) A cease and desist order issued under this subdivision remains in effect until it is modified or vacated by the board. The administrative proceeding provided by this subdivision, and subsequent appellate judicial review of that administrative proceeding, constitutes the exclusive remedy for determining whether the board properly issued the cease and desist order and whether the cease and desist order should be vacated or made permanent.\n(a) Whenever the board under subdivision 1a seeks to enforce compliance with a cease and desist order that has been made permanent, the allegations of the cease and desist order are considered conclusively established for purposes of proceeding under subdivision 1a for permanent or temporary relief to enforce the cease and desist order. Whenever the board under subdivision 1a seeks to enforce compliance with a cease and desist order when a hearing or hearing request on the cease and desist order is pending, or the time has not yet expired to request a hearing on whether a cease and desist order should be vacated or made permanent, the allegations in the cease and desist order are considered conclusively established for the purposes of proceeding under subdivision 1a for temporary relief to enforce the cease and desist order.\n(b) Notwithstanding this subdivision or subdivision 1a, the person against whom the cease and desist order is issued and who has requested a hearing under subdivision 1a may, within 15 days after service of the cease and desist order, bring an action in Ramsey County District Court for issuance of an injunction to suspend enforcement of the cease and desist order pending a final decision of the board under subdivision 1a to vacate or make permanent the cease and desist order. The court shall determine whether to issue such an injunction based on traditional principles of temporary relief.\nIn the case of a facility licensed or registered by the board, the provisions of subdivision 1 shall apply to an individual owner or sole proprietor and shall also apply to the following:\n(1) in the case of a partnership, each partner thereof;\n(2) in the case of an association, each member thereof;\n(3) in the case of a corporation, each officer or director thereof and each shareholder owning 30 percent or more of the voting stock of such corporation.\n[Repealed, 1988 c 550 s 20]\n[Repealed by amendment, 2014 c 291 art 5 s 2]\n[Repealed by amendment, 2014 c 291 art 5 s 2]\n[Repealed by amendment, 2014 c 291 art 5 s 2]\n(a) The board shall publish a page on its website that provides regularly updated information concerning:\n(1) patient assistance programs offered by drug manufacturers, including information on how to access the programs;\n(2) the insulin safety net program established in section 151.74, including information on how to access the program;\n(3) the prescription drug assistance program established by the Minnesota Board of Aging under section 256.975, subdivision 9;\n(4) the websites through which individuals can access information concerning eligibility for and enrollment in Medicare, medical assistance, MinnesotaCare, and other government-funded programs that help pay for the cost of health care;\n(5) availability of providers that are authorized to participate under section 340b of the federal Public Health Services Act, United States Code, title 42, section 256b;\n(6) having a discussion with the pharmacist or the consumer's health care provider about alternatives to a prescribed drug, including a lower cost or generic drug if the drug prescribed is too costly for the consumer; and\n(7) any other resource that the board deems useful to individuals who are attempting to purchase prescription drugs at lower costs.\n(b) The board must prepare educational materials, including brochures and posters, based on the information it provides on its website under paragraph (a). The materials must be in a form that can be downloaded from the board's website and used for patient education by pharmacists and by health care practitioners who are licensed to prescribe. The board is not required to provide printed copies of these materials.\n(c) The board shall require pharmacists and pharmacies to make available to patients information on sources of lower cost prescription drugs, including information on the availability of the website established under paragraph (a).",
	"repealed": false
}