{
	"id": "62J.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.51",
	"title": "62J.51 DEFINITIONS.",
	"text": "For purposes of sections 62J.50 to 62J.61, the following definitions apply.\n\"ANSI\" means the American National Standards Institute.\n\"ASC X12\" means the American National Standards Institute committee X12.\n\"Card issuer\" means the group purchaser who is responsible for printing and distributing identification cards to members or insureds.\n[Repealed by amendment, 2014 c 192 art 1 s 3]\n[Repealed by amendment, 2014 c 192 art 1 s 3]\n\"Claim payment/advice transaction set (ANSI ASC X12 835)\" means the electronic transaction format used for electronic remittance advice and electronic funds transfer as adopted under Code of Federal Regulations, title 45, part 162, subpart P, and any future revisions of the subpart.\n\"Claim status transaction set (ANSI ASC X12 276/277)\" means the electronic transaction format used by providers to request and receive information on the status of a health care claim or encounter that has been submitted to a group purchaser as adopted under Code of Federal Regulations, title 45, part 162, subpart N, and any future revisions of the subpart.\n\"Claim submission address\" means the address to which the group purchaser requires health care providers, members, or insureds to send health care claims for processing.\n\"Claim submission number\" means the unique identification number to identify group purchasers as described in section 62J.54, with its suffix identifying the claim submission address.\n\"Claim submission transaction set (ANSI ASC X12 837)\" means the electronic transaction format used to submit all health care claims information as adopted under Code of Federal Regulations, title 45, part 162, subpart K, and any future revisions of the subpart.\n\"EDI\" or \"electronic data interchange\" means the computer application to computer application exchange of information using nationally accepted standard formats.\n\"Eligibility transaction set (ANSI ASC X12 270/271)\" means the electronic transaction format used by providers to request and receive coverage information on the member or insured as adopted under Code of Federal Regulations, title 45, part 162, subpart L, and any future revisions of the subpart.\n\"Enrollment transaction set (ANSI ASC X12 834)\" means the electronic transaction format used to transmit enrollment and benefit information from the employer to the payer for the purpose of enrolling in a benefit plan as adopted under Code of Federal Regulations, title 45, part 162, subpart O, and any future revisions of the subpart.\n\"Group purchaser\" has the meaning given in section 62J.03, subdivision 6.\n\"Health care clearinghouse\" means a public or private entity, including a billing service, repricing company, community health management information system or community health information system, and \"value-added\" networks and switches that does any of the following functions:\n(1) processes or facilitates the processing of health information received from another entity in a nonstandard format or containing nonstandard data content into standard data elements or a standard transaction;\n(2) receives a standard transaction from another entity and processes or facilitates the processing of health information into nonstandard format or nonstandard data content for the receiving entity;\n(3) acts on behalf of a group purchaser in sending and receiving standard transactions to assist the group purchaser in fulfilling its responsibilities under section 62J.536;\n(4) acts on behalf of a health care provider in sending and receiving standard transactions to assist the health care provider in fulfilling its responsibilities under section 62J.536; and\n(5) other activities including but not limited to training, testing, editing, formatting, or consolidation transactions.\nA health care clearinghouse acts as an agent of a health care provider or group purchaser only if it enters into an explicit, mutually agreed upon arrangement or contract with the provider or group purchaser to perform specific clearinghouse functions.\n\"ISO\" means the International Standardization Organization.\n\"NCPDP\" means the National Council for Prescription Drug Programs, Inc.\n[Repealed by amendment, 2014 c 192 art 1 s 3]\n[Repealed by amendment, 2014 c 192 art 1 s 3]\n\"Provider\" or \"health care provider\" has the meaning given in section 62J.03, subdivision 8.\n\"Standard transaction\" means a transaction that is defined in Code of Federal Regulations, title 45, part 162.103, and that meets the requirements of the single, uniform companion guides described in section 62J.536.\n\"Uniform billing form CMS 1450\" means the most current version of the uniform billing form known as the CMS 1450 developed by the National Uniform Billing Committee.\n\"Uniform billing form CMS 1500\" means the most current version of the health insurance claim form, CMS 1500, developed by the National Uniform Claim Committee.\n\"Uniform dental billing form\" means the most current version of the uniform dental claim form developed by the American Dental Association.\n\"Uniform explanation of benefits document\" means the document associated with and explaining the details of a group purchaser's claim adjudication for services rendered, which is sent to a patient.\n[Repealed by amendment, 2014 c 192 art 1 s 3]\n\"Uniform pharmacy billing form\" means the National Council for Prescription Drug Programs/universal claim form (NCPDP/UCF).\n\"WEDI\" means the national Workgroup for Electronic Data Interchange.",
	"repealed": false
}