{
	"id": "268.136",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.136",
	"title": "268.136 SHARED WORK.",
	"text": "An employer may submit a proposed shared work plan for an employee group to the commissioner for approval in a manner and format set by the commissioner. The proposed shared work plan must include:\n(1) a certified statement that the normal weekly hours of work of all of the proposed participating employees were full time or regular part time but are now reduced, or will be reduced, with a corresponding reduction in pay, in order to prevent layoffs;\n(2) the name and Social Security number of each participating employee;\n(3) the number of layoffs that would have occurred absent the employer's ability to participate in a shared work plan;\n(4) a certified statement that each participating employee was first hired by the employer at least three months before the proposed shared work plan is submitted and is not a seasonal, temporary, or intermittent worker;\n(5) the hours of work each participating employee will work each week for the duration of the shared work plan, which must be at least 50 percent of the normal weekly hours but no more than 80 percent of the normal weekly hours, except that the plan may provide for a uniform vacation shutdown of up to two weeks;\n(6) a certified statement that any health benefits and pension benefits provided by the employer to participating employees will continue to be provided under the same terms and conditions as though the participating employees' hours of work each week had not been reduced;\n(7) a certified statement that the terms and implementation of the shared work plan is consistent with the employer's obligations under state and federal law;\n(8) an acknowledgment that the employer understands that unemployment benefits paid under a shared work plan will be used in computing the future tax rate of a taxpaying employer or charged to the reimbursable account of a nonprofit or government employer;\n(9) the proposed duration of the shared work plan, which must be at least two months and not more than one year, although a plan may be extended for up to an additional year upon approval of the commissioner;\n(10) a starting date beginning on a Sunday at least 15 calendar days after the date the proposed shared work plan is submitted; and\n(11) a signature of an owner or officer of the employer who is listed as an owner or officer on the employer's account under section 268.045.\n(a) The commissioner must promptly review a proposed shared work plan and notify the employer, by mail or electronic transmission, within 15 days of receipt, whether the proposal satisfies the requirements of this section and has been approved. If the proposal does not comply with this section, the commissioner must specifically state why the proposal is not in compliance. If a proposed shared work plan has been approved, it must be implemented according to its terms.\n(b) The commissioner may not approve a proposed shared work plan if the commissioner has cause to believe the proposal was submitted for a purpose other than preventing layoffs due to lack of work.\n(c) The commissioner may not approve a proposed shared work plan if the employer has any unemployment tax or reimbursements, including any interest, fees, or penalties, due but unpaid.\n(d) A shared work plan that has been approved by the commissioner is considered a contract that is binding on the employer and the department. This contract may be canceled or modified under subdivision 5.\nThe employer must provide written notification to each participating employee that the employer has submitted a proposed shared work plan. The notification must be provided to the employee no later than the time the commissioner notifies the employer that a proposed shared work plan has been approved. The notification must inform the employee of the proposed terms of the shared work plan along with notice to the employee of the employee's right to apply for unemployment benefits.\n(a) An applicant, in order to be paid unemployment benefits under this section, must meet all of the requirements under section 268.069, subdivision 1. The following provisions of section 268.085 do not apply to an applicant in an approved shared work plan:\n(1) deductible earnings under subdivision 5;\n(2) the restriction under subdivision 2, clause (5), if the applicant works exactly 32 hours in a week;\n(3) the requirement of being available for suitable employment under subdivision 1, clause (4), but only if the applicant is (i) available for the normal hours of work per week with the shared work employer, or (ii) is in a training program when not working; and\n(4) the requirement of actively seeking suitable employment under subdivision 1, clause (5).\n(b) An applicant is ineligible for unemployment benefits under this section for any week, if the applicant works more than 32 hours in a week in employment with one or more employer.\n(a) The weekly benefit amount and maximum amount of unemployment benefits available are computed according to section 268.07, except that the amount of benefits available is a reduced amount in direct proportion to the reduction in hours set out in the shared work plan from the lesser of (1) 40 hours per week; or (2) the normal weekly hours.\n(b) Regardless of paragraph (a), if the applicant works more hours or less hours in a week for the shared work employer than provided for in the shared work plan, the amount of unemployment benefits available is in direct proportion to the reduction in hours actually worked from the lesser of (1) 40 hours per week; or (2) the normal weekly hours.\n(a) An employer may cancel a shared work plan at any time upon seven calendar days' notice to the commissioner in a manner and format prescribed by the commissioner. The cancellation must be signed by an owner or officer of the employer.\n(b) An employer may request that the commissioner allow modification of the shared work plan as to the hours of work each participating employee will work each week. The request must be sent in a manner and form prescribed by the commissioner. The request must be signed by an owner or officer of the employer. The commissioner must notify the employer as soon as possible if the modification is allowed.\n(c) An employer that cancels or requests modification of a shared work plan must provide written notice to each participating employee of the cancellation or requested modification at the time notice is sent to the commissioner.\n(d) If an employer cancels a shared work plan before the expiration date provided for in subdivision 1, a new shared work plan may not be approved for that employer under this section for at least 60 calendar days.\n(e) The commissioner may immediately cancel any shared work plan if the commissioner determines the plan was based upon false information or the employer has failed to adhere to the terms of the shared work plan. The commissioner must immediately send written notice of cancellation to the employer. An employer that receives notice of cancellation must provide written notice to each participating employee of the cancellation.",
	"repealed": false
}