{
	"id": "272.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.025",
	"title": "272.025 FILING REQUIREMENT.",
	"text": "(a) Except in the case of property owned by the state of Minnesota or any political subdivision thereof, a taxpayer claiming an exemption from taxation on property described in section 272.02 must file a statement of exemption with the assessor of the assessment district in which the property is located. By January 2, 2018, and each third year thereafter, the commissioner of revenue shall publish on its website a list of the exemptions for which a taxpayer claiming an exemption must file a statement of exemption. The commissioner's requirement that a taxpayer file a statement of exemption pursuant to this subdivision shall not be considered a rule and is not subject to the Administrative Procedure Act, chapter 14.\n(b) A taxpayer claiming an exemption from taxation on property described in section 272.02, subdivision 10, must file a statement of exemption with the commissioner of revenue, on or before February 15 of each year for which the taxpayer claims an exemption.\n(c) In case of sickness, absence or other disability or for good cause, the assessor or the commissioner may extend the time for filing the statement of exemption for a period not to exceed 60 days.\n(d) The commissioner of revenue shall prescribe the content, format, and manner of the statement of exemption pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws.\n(e) If a statement is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws.\nUpon the written request of the assessor, the taxpayer filing a statement of exemption shall make available to the assessor all books and records relating to the ownership or use of property which are reasonably necessary to verify that the property qualifies for exemption.\n(a) The statement required by subdivision 1, paragraph (a), must be filed with the assessor by February 1 of the assessment year, however, any taxpayer who has filed the statement required by subdivision 1 more than 12 months prior to February 1, 1983, or February 1 of each third year after 1983, shall file a statement by February 1, 1983, and by February 1 of each third year thereafter.\n(b) For churches and houses of worship, and property solely used for educational purposes by academies, colleges, universities, or seminaries of learning, no statement is required after the statement filed for the assessment year in which the exemption began.\n(c) This section does not apply to existing churches and houses of worship, and property solely used for educational purposes by academies, colleges, universities, or seminaries of learning that were exempt for taxes payable in 2011.\nNo property subject to the requirements of this section shall be exempt from taxation under section 272.02 if the taxpayer claiming the exemption knowingly violates any of the provisions of this section.",
	"repealed": false
}