{
	"id": "375.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.195",
	"title": "375.195 SALE OF BUILDINGS ON PUBLIC PROPERTY.",
	"text": "Upon resolution of the county board, the county auditor may sell at public auction for cash at not less than the value appraised by the county board, buildings or improvements upon lands held by the state in trust for the taxing districts. If the buildings are not sold at the public auction, they may, at any time within one year from the date of the auction, be sold at private sale by the county auditor at not less than the appraised value.\nThe county auditor may sell at public auction any buildings or improvements upon state lands or platted lots under the control of the commissioner of natural resources not held in trust for the taxing districts, at not less than the value appraised by the county board and approved by the commissioner of natural resources, if requested to do so by the commissioner of natural resources. If the buildings or improvements are not sold when offered at the public sale, they may within one year from the date of the auction be sold at private sale by the county auditor at not less than their appraised value.\nThe buildings or improvements shall not be offered for sale or sold until the county board has, by resolution, found that they constitute a fire hazard, an inducement to trespass, or a public nuisance. At least two weeks before the sale, the county auditor shall publish in a legal newspaper in the county and post on the bulletin board in the auditor's office and at least one other prominent place in the courthouse, a notice of the sale, which shall include the date of the sale, a description of the buildings and improvements and the lands upon which they are situated and their appraised value.\nAll sales under subdivisions 1 or 2 shall be conditioned upon the removal from the land by the purchaser of all buildings and improvements within 90 days of the date of purchase. Upon failure to so remove them, the buildings shall revert to the state and may be resold as provided in subdivision 1 or 2.\nThe proceeds from the sale of buildings or improvements located on lands held by the state in trust for the taxing districts, shall be deposited in the forfeited tax fund of the county and distributed in the same manner as if the parcel of land on which the buildings or improvements were situated had been sold. The proceeds from the sale of buildings or improvements on lands held by the state free of any trust for the taxing districts shall be remitted by the county auditor to the commissioner of natural resources to be deposited in the state treasury in the fund to which the proceeds from the sale of the lands from which the buildings are removed would properly be credited.",
	"repealed": false
}