{
	"id": "332A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/332A.02",
	"title": "332A.02 DEFINITIONS.",
	"text": "Unless a different meaning is clearly indicated by the context, for the purposes of this chapter the terms defined in this section have the meanings given them.\n\"Accreditation\" means certification as an accredited credit counseling provider by the Council on Accreditation, the Bureau Veritas Certification North America, Inc., or BSI Management Systems America, Inc.\n\"Advertise\" means to solicit business through any means or medium.\n\"Attorney general\" means the attorney general of the state of Minnesota.\n\"Commissioner\" means commissioner of commerce.\n\"Controlling or affiliated party\" means any person or entity that controls or is controlled, directly or indirectly, or is under common control with another person. Controlling or affiliated party includes, but is not limited to, employees, officers, independent contractors, corporations, partnerships, and limited liability corporations.\n\"Creditor\" means any party:\n(1) named by the debtor as a creditor in the debt management services plan or debt management services agreement;\n(2) that acquires or holds the debt; or\n(3) to whom interactions with the debt management services is assigned in relation to the debt listed in the debt management services plan or debt management services agreement.\n\"Debt management services agreement\" means the written contract between the debt management services provider and the debtor.\n\"Debt management services plan\" means the debtor's individualized package of debt management services set forth in the debt management services agreement.\n\"Debt management services provider\" means any person offering or providing debt management services to a debtor domiciled in this state, regardless of whether or not a fee is charged for the services and regardless of whether the person maintains a physical presence in the state. This term includes any person to whom debt management services are delegated, and does not include services performed by the following when engaged in the regular course of their respective businesses and professions:\n(1) exempt attorneys at law, escrow agents, and broker-dealers in securities;\n(2) certified public accountants and CPA firms licensed under chapter 326A;\n(3) state or national banks, credit unions, trust companies, savings associations, title insurers, insurance companies, and all other lending institutions duly authorized to transact business in Minnesota;\n(4) persons who, as employees on a regular salary or wage of an employer not engaged in the business of debt management, perform credit services for their employer;\n(5) public officers acting in their official capacities and persons acting as a debt management services provider pursuant to court order;\n(6) any person while performing services incidental to the dissolution, winding up, or liquidation of a partnership, corporation, or other business enterprise;\n(7) the federal government, the state, their political subdivisions, public agencies, and employees;\n(8) collection agencies, provided that the services are provided to a creditor;\n(9) \"qualified organizations\" designated as representative payees for purposes of the Social Security and Supplemental Security Income Representative Payee System and the federal Omnibus Budget Reconciliation Act of 1990, Public Law 101-508;\n(10) accelerated mortgage payment providers. \"Accelerated mortgage payment providers\" are persons who, after satisfying the requirements of sections 332.30 to 332.303, receive funds to make mortgage payments to a lender or lenders, on behalf of mortgagors, in order to exceed regularly scheduled minimum payment obligations under the terms of the indebtedness. The term does not include: (i) persons or entities described in clauses (1) to (9); (ii) mortgage lenders or servicers, industrial loan and thrift companies, or regulated lenders under chapter 56; or (iii) persons authorized to make loans under section 47.20, subdivision 1. For purposes of this clause and sections 332.30 to 332.303, \"lender\" means the original lender or that lender's assignee, whichever is the current mortgage holder;\n(11) trustees, guardians, and conservators;\n(12) an enrolled agent or enrolled agent firm; and\n(13) debt settlement services providers.\n\"Debt management services\" means the provision of any services whereby a debt management services provider assists in managing the financial affairs of a debtor by distributing periodic payments to the debtor's creditors from funds that the debt management services provider receives from the debtor and where the primary purpose of the services is to effect full repayment of debt incurred primarily for personal, family, or household services.\nAny person so engaged or holding out as so engaged is deemed to be engaged in the provision of debt management services regardless of whether or not a fee is charged for such services.\n\"Debtor\" means the person for whom the debt management services are performed.\n\"Exempt attorney at law\" means an attorney licensed or otherwise authorized to practice law in this state:\n(1) whose exclusive or principal practice does not involve the provision of debt management services; and\n(2) who does not have a business relationship with a debt management services provider that involves the provision of debt management services.\n\"Enrolled agent\" means a person defined under Code of Federal Regulations, title 26, section 601.502, and who is authorized to practice before the Internal Revenue Service pursuant to Code of Federal Regulations, title 31, section 10.3.\n\"Enrolled agent firm\" means an association, corporation, partnership, or sole proprietorship:\n(1) that is owned by or employs enrolled agents;\n(2) whose practice, in whole or in part, involves, for a fee, assisting debtors to delay payment of delinquent taxes owed, establish a payment plan for delinquent taxes owed, or obtain a settlement for less than the full amount of delinquent taxes owed; and\n(3) where:\n(i) all contracts with debtors are reviewed and signed by an enrolled agent employed by the firm;\n(ii) an enrolled agent is responsible for all work performed under the contract and the responsible agent obtains a power of attorney or a disclosure authorization from the debtor; and\n(iii) an enrolled agent files the power of attorney or disclosure authorization according to all procedural requirements under the Internal Revenue Code.\n\"Person\" means any individual, firm, partnership, association, or corporation.\n\"Registrant\" means any person registered by the commissioner pursuant to this chapter and, where used in conjunction with an act or omission required or prohibited by this chapter, shall mean any person performing debt management services.\n\"Debt settlement services provider\" has the meaning given in section 332B.02, subdivision 13.",
	"repealed": false
}