{
	"id": "353.014",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.014",
	"title": "353.014 FEDERALLY PROTECTED MILITARY LEAVE.",
	"text": "(a) Unless prohibited under paragraph (b), a member is eligible to purchase allowable service credit for one or more periods of service during which a member is absent from employment by a governmental subdivision by reason of service in the uniformed services, as defined in United States Code, title 38, section 4303(13), if the member returns to public service with the same governmental subdivision upon discharge from service in the uniformed services within the time frames required under United States Code, title 38, section 4312(e).\n(b) The purchase of allowable service credit is prohibited if the member separated from uniformed service with a dishonorable or bad conduct discharge or under other than honorable conditions.\n(a) If the payments required by this section are made, a member shall be granted allowable service credit for one or more periods of military service as described in subdivision 1. The payments required by this section are equivalent employee contributions as described in paragraph (b), equivalent employer contributions or additional employer contributions as described in paragraph (c), and interest as described in paragraph (d).\n(b) A member eligible under subdivision 1 electing to purchase allowable service credit shall pay into the fund within the time period described in subdivision 4 equivalent employee contributions based upon the contribution rate or rates in effect at the time that the uniformed service was performed multiplied by the full and fractional years being purchased and applied to the annual salary rate as defined in subdivision 3.\n(c) If the member makes the payment under paragraph (b), the governmental subdivision employing the member shall pay the equivalent employer contribution and, if applicable, the equivalent additional employer contribution. The employer payments must be made from funds available to the employing unit, using the employer and additional employer contribution rate or rates in effect at the time that the uniformed service was performed, applied to the same annual salary rate or rates used to compute the equivalent employee contribution. The governmental subdivision involved may appropriate money for those payments.\n(d) The employing unit shall pay interest on all equivalent employee and employer contribution amounts payable under this subdivision. Interest must be computed at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually, from the end of each fiscal year during the leave to the end of the month in which the payment is received.\nThe annual salary rate is the average annual salary during the purchase period that the member would have received if the member had continued to be employed in covered employment rather than take the uniformed services leave, or, if the determination of that rate is not reasonably certain, the annual salary rate is the member's average salary rate during the 12-month period of covered employment rendered immediately preceding the period of the uniformed service.\nPayment of the employee equivalent contributions must be made during a period that begins with the date on which the member returns to public employment and that is three times the length of the military leave period, or within five years of the date on which the member returns to public employment, whichever is less. If the payment period is less than three years, payment of the employee equivalent contributions may be made within three years of the date of the member's discharge from service in the uniformed services. Payment may not be accepted after six months following termination of public service under section 353.01, subdivision 11a.\nThe employer shall notify the executive director, on a form prescribed by the executive director, of the reemployment of a member who is returning from service in the uniformed services as described in subdivision 1 and is eligible to purchase service credit under this section. The employer must provide the notice within 14 days of the member's reemployment. The employer shall maintain a copy of the notice in the member's employment file.\nWithin 30 days of receipt of notification from the employer under subdivision 5, the executive director shall notify the reemployed member in writing of the right to purchase service credit. The notification shall be mailed to the member's last known address.\n(a) The maximum amount of service credit that may be purchased under this section is five years unless a longer purchase period is required to be offered under United States Code, title 38, section 4312.\n(b) If the employee equivalent contributions under subdivision 2 are not paid in full, the member's allowable service credit must be prorated by multiplying the full and fractional number of years of uniformed service eligible for purchase by the ratio obtained by dividing the total employee contributions received by the total employee contributions otherwise required under this section.",
	"repealed": false
}