{
	"id": "501C.1013",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1013",
	"title": "501C.1013 CERTIFICATE OF TRUST.",
	"text": "The settlor or a trustee of a trust, at any time after execution or creation of a trust, may execute a certificate of trust that sets forth fewer than all of the provisions of a trust instrument and any amendments to the instrument. The certificate of trust must include:\n(1) the name of the trust, if one is given;\n(2) the date of the trust instrument;\n(3) the name and address of each trustee empowered to act under the trust instrument at the time of execution of the certificate;\n(4) either (i) the following statement: \"The trustees are authorized by the trust instrument to sell, convey, pledge, mortgage, lease, or transfer title to any interest in real or personal property, except as limited by the following: (if none, so indicate)\" or (ii) information as to the powers of the trustee relating to the purposes for which the certificate is being offered;\n(5) the number of trustees required to act; and\n(6) a statement as to whether the trust has terminated or the trust instrument has been revoked.\nThe certificate of trust must be upon the representation of the settlor or trustee that the statements contained in the certificate of trust are true and correct and that there are no other provisions in the trust instrument or amendments to it that limit (i) the powers of the trustees to sell, convey, pledge, mortgage, lease, or transfer title to interests in real or personal property or (ii) the authority of the trustees to exercise any other power identified in the certificate of trust. The signature of the settlor or trustee must be under oath before a notary public or other official authorized to administer oaths.\nThe certificate of trust may be used for purposes of selling, conveying, pledging, mortgaging, leasing, or transferring title to any interest in real property. If so used, the certificate of trust shall identify the name of each settlor and the name of each original trustee and shall contain the following statement: \"The trustees are authorized by the instrument to sell, convey, pledge, mortgage, lease, or transfer title to any interest in real property, except as limited by the following: (if none, so indicate).\"\nA certificate of trust executed under subdivision 2 may be recorded in the office of the county recorder for any county or in the office of the registrar of titles with respect to registered land described in the certificate of trust or any attachment to it.\nWhen a certificate of trust is recorded in a county where real property is situated, or in the case of personal property, when it is presented to a third party, the certificate of trust serves to document the existence of the trust, the identity of the trustees, the powers of the trustees and any limitations on those powers, and other matters the certificate of trust sets out, as though the full trust instrument had been recorded or presented. Until amended or revoked under subdivision 5, or until the full trust instrument is recorded or presented, a certificate of trust is prima facie proof as to matters contained in it and any party may rely upon the continued effectiveness of the certificate.\nAmendment or revocation of a certificate of trust may be made only by a written instrument executed by the settlor or a trustee of a trust. Amendment or revocation of a certificate of trust is not effective as to a party unless that party has actual notice of the amendment or revocation.\nFor purposes of this subdivision, \"actual notice\" means that a written instrument of amendment or revocation has been received by the party or, in the case of real property, that either a written instrument of amendment or revocation has been received by the party or that a written instrument of amendment or revocation containing the legal description of the real property has been recorded in the office of the county recorder or in the office of the registrar of titles where the real property is situated.\nA third party may rely upon a certificate of trust signed by any settlor or trustee.",
	"repealed": false
}