{
	"id": "67A.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/67A.241",
	"title": "67A.241 RECORD KEEPING; EXAMINATION; REMEDIES.",
	"text": "The commissioner may prescribe a basis upon which a township mutual insurance company shall maintain its records which shall reflect the true financial condition of the company.\n(a) The board of directors of every township mutual insurance company shall, at least once every three years, cause the records and accounts of the company to be examined by an independent public accountant, auditor, or person who has been certified by the society of financial examiners. The examination shall cover the financial and business affairs including the treatment of members and claimants of the company during the previous three years ending December 31.\n(b) A written summary report of the pertinent results of the examination shall immediately be filed with each member of the board of directors following completion of the examination. A complete examination report shall be filed with the board of directors and the commissioner within 60 days following completion of the examination.\n(c) The accountant, auditor, or certified financial examiner conducting or supervising the examination must have a minimum of five years' experience in public accounting or examining the financial records or statements of financial institutions and shall not be an officer or employee of the company being examined. The examiner must not be directly involved in maintaining the records being examined, but may advise or counsel management in record keeping, accounting, or management procedures.\nThe commissioner, with due cause based upon information disclosed in any statement or report or upon information from any examination conducted under this section or when requested by five or more members, shall make an examination of the financial and business affairs of any township mutual fire insurance company doing business within this state. The company examined shall pay the actual expenses of the person or persons making the examination and the fees prescribed in section 60A.03, subdivision 5.\nWhen, after examination by the commissioner or independent public accountant, auditor, or certified financial examiner, the commissioner is satisfied that a township mutual insurance company has failed to comply with provisions of sections 67A.01 to 67A.26; is exceeding its power; is not carrying out its contracts in good faith; is transacting business fraudulently; or is in such condition as to render further proceedings hazardous to the public or to its policyholders, the commissioner may take action deemed necessary or proceed under the provisions of chapter 60B.",
	"repealed": false
}