{
	"id": "125A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.50",
	"title": "125A.50 ALTERNATIVE DELIVERY OF SPECIALIZED INSTRUCTIONAL SERVICES.",
	"text": "The commissioner may approve applications from districts initiating or significantly changing a program to provide prevention services as an alternative to special education and other compensatory programs. A district with an approved program may provide instruction and services in a regular education classroom, or an area learning center, to eligible pupils. Pupils eligible to participate in the program are pupils who need additional academic or behavioral support to succeed in the general education environment and who may eventually qualify for special education instruction or related services under sections 125A.03 to 125A.24 and 125A.65 if the intervention services authorized by this section were unavailable. A pupil with a disability as defined under sections 125A.03 to 125A.24 and 125A.65, whose individualized education program team has determined that the pupil does not require special education services in the area of the district's approved program, may participate in the approved program as long as participation does not result in an increase in costs for the program or displace a pupil who does not currently have a disability. Pupils may be provided services during extended school days and throughout the entire year and through the assurance of mastery program under sections 125A.03 to 125A.24 and 125A.65.\nThe application must set forth:\n(1) instructional services available to eligible pupils under section 124D.66, subdivision 2, and pupils with a disability under section 125A.02;\n(2) criteria to select pupils for the program and the assessment procedures to determine eligibility;\n(3) involvement in the program of parents of pupils in the program, parent advocates, and community special education advocates;\n(4) accounting procedures to document that federal special education money is used to supplement or increase the level of special education instruction and related services provided with state and local revenue, but in no case to supplant the state and local revenue, and that districts are expending at least the amount for special education instruction and related services required by federal law;\n(5) the role of general and special education teachers in planning, implementing, and evaluating the program;\n(6) an annual budget detailing program expenditures; and\n(7) other information requested by the commissioner.\nThe application must also set forth the review and evaluation procedures to be used by the district addressing at least the following:\n(1) the number of pupils with and without a disability served;\n(2) the impact of the program on the academic and behavioral progress of the pupils;\n(3) the level of satisfaction teachers, parents, and pupils have with the program;\n(4) the effect of the program on the number of referrals for special education, federal Title 1, and other programs; and\n(5) cost implications.\n(a) Each year before a district receives aid under section 125A.78, the district must submit to the commissioner for review and approval a budget detailing program expenditures for the fiscal year. The commissioner must determine whether the personnel, equipment, supplies, and extended school year are necessary to meet the district's obligation to provide special instruction and services to children with a disability according to sections 125A.03 to 125A.24 and 125A.65. The commissioner may not approve revenue for any expenditures determined to be unnecessary.\n(b) The commissioner must not approve budget increases under this section that would cause the state to fail to meet maintenance of effort requirements under federal special education law. The commissioner must establish criteria for prioritizing and approving budget increases, which may include criteria such as maintaining current programs, locating programs throughout the state, and developing innovative programs.\nEach year the district must submit to the commissioner a report containing the information described in subdivision 3.\nA pupil participating in the program must be individually evaluated according to the pupil's actual abilities and needs. A pupil who is eligible for services under sections 125A.03 to 125A.24 and 125A.65 is entitled to procedural protections provided under United States Code, title 20, section 33, in any matter that affects the identification, evaluation, placement, or change in placement of a pupil. The district must ensure the protection of a pupil's civil rights, provide equal educational opportunities, and prohibit discrimination. Failure to comply with this subdivision will at least cause a district to become ineligible to participate in the program. Notwithstanding rules of the Department of Education, the commissioner cannot waive a pupil's rights under this section.",
	"repealed": false
}