{
	"id": "125B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/125B.07",
	"title": "125B.07 DEPARTMENT DUTIES.",
	"text": "The Department of Education shall maintain a current annual data acquisition calendar specifying the reports which districts are required to provide to the department and the dates these reports are due.\nThe annual data acquisition calendar and the essential data elements are exempt from the Administrative Procedure Act.\nThe department shall develop and operate a computerized data system. The system shall include: (1) information required by federal or state law or rule; and (2) information needed by the divisions of the department in order to disburse funds, to implement research or special projects approved by the commissioner, and to meet goals or provide information required by the commissioner, the governor, the legislature or the federal government.\nThe commissioner shall maintain a list of certified service providers for administrative data processing software and support. To be certified, a service provider must provide the commissioner with a written statement identifying software products and support functions that will be provided to school districts and stating its intent to meet state standards for software, data elements, edits, and support services. The standards must ensure the quality of the data reported to the state. The commissioner must conduct regular training sessions for service providers on the standards. If a service provider fails to meet the standards, the commissioner must notify the service provider of areas of noncompliance and assist the service provider in correcting the problem. If the provider fails to comply with standards within two months of being notified of noncompliance, the commissioner may remove the service provider from the list of certified providers. The commissioner may recertify a service provider when the commissioner determines that the areas of noncompliance have been corrected.\nThe commissioner must include the list of certified service providers in the annual data acquisition calendar. The commissioner must notify school districts if a service provider is removed from the list and of the areas of noncompliance.\nThe department shall maintain a list of essential data elements which must be recorded and stored about each pupil, licensed and nonlicensed staff member, and educational program. Each school district must provide the essential data to the department in the form and format prescribed by the department.\nThe department may provide by contract for the technical support of and the development of applications software by a regional management information center or by any other appropriate provider.",
	"repealed": false
}