{
	"id": "253B.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.051",
	"title": "253B.051 EMERGENCY ADMISSION.",
	"text": "(a) If a peace officer or health officer has reason to believe, either through direct observation of the person's behavior or upon reliable information of the person's recent behavior and, if available, knowledge or reliable information concerning the person's past behavior or treatment that the person:\n(1) has a mental illness or developmental disability and is in danger of harming self or others if the officer does not immediately detain the patient, the peace officer or health officer may take the person into custody and transport the person to an examiner or a treatment facility, state-operated treatment program, or community-based treatment program;\n(2) is chemically dependent or intoxicated in public and in danger of harming self or others if the officer does not immediately detain the patient, the peace officer or health officer may take the person into custody and transport the person to a treatment facility, state-operated treatment program, or community-based treatment program; or\n(3) is chemically dependent or intoxicated in public and not in danger of harming self, others, or property, the peace officer or health officer may take the person into custody and transport the person to the person's home.\n(b) An examiner's written statement or a health officer's written statement in compliance with the requirements of subdivision 2 is sufficient authority for a peace officer or health officer to take the person into custody and transport the person to a treatment facility, state-operated treatment program, or community-based treatment program.\n(c) A peace officer or health officer who takes a person into custody and transports the person to a treatment facility, state-operated treatment program, or community-based treatment program under this subdivision shall make written application for admission of the person containing:\n(1) the officer's statement specifying the reasons and circumstances under which the person was taken into custody;\n(2) identifying information on specific individuals to the extent practicable, if danger to those individuals is a basis for the emergency hold; and\n(3) the officer's name, the agency that employs the officer, and the telephone number or other contact information for purposes of receiving notice under subdivision 3.\n(d) A copy of the examiner's written statement and officer's application shall be made available to the person taken into custody.\n(e) The officer may provide the transportation personally or may arrange to have the person transported by a suitable medical or mental health transportation provider. As far as practicable, a peace officer who provides transportation for a person placed in a treatment facility, state-operated treatment program, or community-based treatment program under this subdivision must not be in uniform and must not use a vehicle visibly marked as a law enforcement vehicle.\n(a) A treatment facility, state-operated treatment program, or community-based treatment program, other than a facility operated by the Minnesota Sex Offender Program, may admit or hold a patient, including a patient transported under subdivision 1, for emergency care and treatment if the head of the facility or program consents to holding the patient and an examiner provides a written statement in support of holding the patient.\n(b) The written statement must indicate that:\n(1) the examiner examined the patient not more than 15 days prior to admission;\n(2) the examiner interviewed the patient, or if not, the specific reasons why the examiner did not interview the patient;\n(3) the examiner has the opinion that the patient has a mental illness or developmental disability, or is chemically dependent and is in danger of causing harm to self or others if a facility or program does not immediately detain the patient. The statement must include observations of the patient's behavior and avoid conclusory language. The statement must be specific enough to provide an adequate record for review. If danger to specific individuals is a basis for the emergency hold, the statement must identify those individuals to the extent practicable; and\n(4) the facility or program cannot obtain a court order in time to prevent the anticipated injury.\n(c) Prior to an examiner writing a statement, if another person brought the patient to the treatment facility, state-operated treatment program, or community-based treatment program, the examiner shall make a good-faith effort to obtain information from that person, which the examiner must consider in deciding whether to place the patient on an emergency hold. To the extent available, the statement must include direct observations of the patient's behaviors, reliable knowledge of the patient's recent and past behavior, and information regarding the patient's psychiatric history, past treatment, and current mental health providers. The examiner shall also inquire about health care directives under chapter 145C and advance psychiatric directives under section 253B.03, subdivision 6d.\n(d) The facility or program must give a copy of the examiner's written statement to the patient immediately upon initiating the emergency hold. The treatment facility, state-operated treatment program, or community-based treatment program shall maintain a copy of the examiner's written statement. The program or facility must inform the patient in writing of the right to (1) leave after 72 hours, (2) have a medical examination within 48 hours, and (3) request a change to voluntary status. The facility or program shall assist the patient in exercising the rights granted in this subdivision.\n(e) The facility or program must not allow the patient nor require the patient's consent to participate in a clinical drug trial during an emergency admission or hold under this subdivision. If a patient gives consent to participate in a drug trial during a period of an emergency admission or hold, it is void and unenforceable. This paragraph does not prohibit a patient from continuing participation in a clinical drug trial if the patient was participating in the clinical drug trial at the time of the emergency admission or hold.\n(a) If a peace officer or health officer transports a person to a treatment facility, state-operated treatment program, or community-based treatment program under subdivision 1, an examiner at the facility or program must examine the patient and make a determination about the need for an emergency hold as soon as possible and within 12 hours of the person's arrival. The peace officer or health officer hold ends upon whichever occurs first: (1) initiation of an emergency hold on the person under subdivision 2; (2) the person's voluntary admission; (3) the examiner's decision not to admit the person; or (4) 12 hours after the person's arrival.\n(b) Under this section, the facility or program may hold a patient up to 72 hours, exclusive of Saturdays, Sundays, and legal holidays, after the examiner signs the written statement for an emergency hold of the patient. The facility or program must release a patient when the emergency hold expires unless the facility or program obtains a court order to hold the patient. The facility or program may not place the patient on a consecutive emergency hold under this section.\n(c) If the interested person files a petition to civilly commit the patient, the court may issue a judicial hold order pursuant to section 253B.07, subdivision 2b.\n(d) During the 72-hour hold, a court must not release a patient under this section unless the court received a written petition for the patient's release and the court has held a summary hearing regarding the patient's release.\n(e) The written petition for the patient's release must include the patient's name, the basis for the hold, the location of the hold, and a statement explaining why the hold is improper. The petition must also include copies of any written documentation under subdivision 1 or 2 that support the hold, unless the facility or program holding the patient refuses to supply the documentation. Upon receipt of a petition, the court must comply with the following:\n(1) the court must hold the hearing as soon as practicable and the court may conduct the hearing by telephone conference call, interactive video conference, or similar method by which the participants are able to simultaneously hear each other;\n(2) before deciding to release the patient, the court shall make every reasonable effort to provide notice of the proposed release and reasonable opportunity to be heard to:\n(i) any specific individuals identified in a statement under subdivision 1 or 2 or individuals identified in the record who might be endangered if the person is not held;\n(ii) the examiner whose written statement was the basis for the hold under subdivision 2; and\n(iii) the peace officer or health officer who applied for a hold under subdivision 1; and\n(3) if the court decides to release the patient, the court shall direct the patient's release and shall issue written findings supporting the decision. The facility or program must not delay the patient's release pending the written order.\n(f) Notwithstanding section 144.293, subdivisions 2 and 4, if a treatment facility, state-operated treatment program, or community-based treatment program releases or discharges a patient during the 72-hour hold; the examiner refuses to admit the patient; or the patient leaves without the consent of the treating health care provider, the head of the treatment facility, state-operated treatment program, or community-based treatment program shall immediately notify the agency that employs the peace officer or health officer who initiated the transport hold. This paragraph does not apply to the extent that the notice would violate federal law governing the confidentiality of alcohol and drug abuse patient records under Code of Federal Regulations, title 42, part 2.\n(g) If a patient is intoxicated in public and a facility or program holds the patient under this section for detoxification, a treatment facility, state-operated treatment program, or community-based treatment program may release the patient without providing notice under paragraph (f) as soon as the treatment facility, state-operated treatment program, or community-based treatment program determines that the person is no longer in danger of causing harm to self or others. The facility or program must provide notice to the peace officer or health officer who transported the person, or to the appropriate law enforcement agency, if the officer or agency requests notification.\n(h) A treatment facility or state-operated treatment program must change a patient's status to voluntary status as provided in section 253B.04 upon the patient's request in writing if the head of the facility or program consents to the change.",
	"repealed": false
}