{
	"id": "103E.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.645",
	"title": "103E.645 ALLOWANCE AND PAYMENT OF FEES AND EXPENSES.",
	"text": "The fees and expenses in this section are allowed and must be paid for services provided under this chapter.\nThe compensation of the engineer, the engineer's assistants, and other employees is on a per diem basis and must be set by order of the drainage authority. The order setting compensation must provide for payment of the actual and necessary expenses of the engineer, the engineer's assistants, and other employees, including the cost of the engineer's bond.\nEach viewer may be paid for every necessary day the viewer is engaged on a per diem basis and for the viewer's actual and necessary expenses. The compensation must be set by the drainage authority.\nEach member of the board may be paid a per diem under section 375.055, subdivision 1, and actual and necessary expenses incurred while actually employed in drainage proceedings or construction, or in the inspection of any drainage system if the board member is appointed to a committee for that purpose.\nThe county auditor and the attorney for the petitioners must each be paid reasonable compensation for services actually provided as determined by the drainage authority. The fees and compensation of all county officials in drainage proceedings and construction are in addition to other fees and compensation allowed by law.\nThe cost of the petitioners' bond must be allowed and paid.\nThe fees and expenses provided for in this chapter for a drainage project or system in one county must be audited, allowed, and paid by order of the board or for a drainage project or system in more than one county must be audited, allowed, and paid by order of the drainage authority after ten days' written notice to each affected county. The notice must be given by the auditor to the auditors of affected counties. The notice must state the time and location of the hearing and that all bills on file with the auditor at the date of the notice must be presented for hearing and allowance.",
	"repealed": false
}