{
	"id": "216C.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.18",
	"title": "216C.18 STATE ENERGY POLICY AND CONSERVATION REPORT.",
	"text": "By July 1 of 1988 and every four years thereafter, the commissioner shall issue a comprehensive report designed to identify major emerging trends and issues in energy supply, consumption, conservation, and costs. The report shall include the following:\n(1) projections of the level and composition of statewide energy consumption under current government policies and an evaluation of the ability of existing and anticipated facilities to supply the necessary energy for that consumption;\n(2) projections of how the level and the composition of energy consumption would be affected by new programs or new policies;\n(3) projections of energy costs to consumers, businesses, and government;\n(4) identification and discussion of key social, economic, and environmental issues in energy;\n(5) explanations of the department's current energy programs and studies; and\n(6) recommendations.\nThe energy policy and conservation report shall include a section prepared by the Public Utilities Commission. The commission's section shall be prepared in consultation with the commissioner and shall include, but not be limited to, all of the following:\n(1) a description and analysis of the commission's rate design policy as it pertains to the goals stated in sections 216B.164, 216B.241, and 216C.05, including a description of all energy conservation improvements ordered by the commission; and\n(2) recommendations to the governor and the legislature for administrative and legislative actions to accomplish the purposes of sections 216B.164, 216B.241, and 216C.05.\nPrior to the preparation of a final report, the commissioner shall issue a draft report to the Environmental Quality Board and any person, upon request, and shall hold a public meeting. Notice of the public meeting shall be provided to each regional development commission.\nThe commissioner shall distribute the final report to any person upon request.",
	"repealed": false
}