{
	"id": "469.1811",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1811",
	"title": "469.1811 PROPERTY TAX EXEMPT; AGRICULTURAL PROCESSING FACILITY.",
	"text": "For purposes of this section:\n(1) \"Agricultural processing facility\" means land, buildings, structures, fixtures, and improvements used or operated primarily for the processing or production of marketable products from agricultural crops, including waste and residues from agricultural crops, but not including livestock or livestock products, poultry or poultry products, or wood or wood products. As used in this subdivision, land is limited to land on which the buildings, structures, fixtures, and improvements are situated and the immediately surrounding land used for storage or other functions directly related to the processing or production, not including land used for the growing of agricultural crops.\n(2) \"Qualifying property\" means taxable property: (i) that consists of an agricultural processing facility; and (ii) for which the agricultural processing facility project costs exceed $100,000,000.\nThe governing body of a home rule or statutory city may by resolution exempt qualifying property from property taxation. The exemption may include the entire market value of the qualifying property as determined by the assessor, including the land and any improvements existing at the time the exemption is granted, any increases in the value of the land and improvements during the duration of the exemption, and the value of any improvements constructed or attached during the exemption period. The property tax exemption granted by the city may not exceed a ten-year period beginning with taxes payable the year following the year the exemption is granted. At the expiration of the exemption period, the facility shall be assessed and pay property taxes as otherwise provided by law.\nA person proposing to construct an agricultural processing facility may apply for a property tax exemption to the city clerk of the city where the facility is proposed to be located. The application must contain a plan that includes a legal description of the real estate on which the exemption is sought, a description of the proposed facility, a detailed estimate of acquisition and construction costs, a construction time schedule, and any other information required by the city.\nBefore approving a tax exemption pursuant to this section, the governing body of the city must hold a public hearing. The municipal clerk or auditor shall publish a notice in the official newspaper of the time and place of a hearing to be held by the governing body on the application, not less than 30 days after the notice is published. The notice shall state that the applicant, local government officials, and any taxpayer of the municipality may be heard or may present their views in writing at or before the hearing. The hearing may be adjourned from time to time, but the governing body shall take action on the application by resolution within 30 days after the hearing ends. If disapproved, the reasons shall be set forth in the resolution. If the application for a tax exemption is approved, the city clerk shall forward a copy of the resolution approving the tax exemption to the county assessor who shall exempt the property from taxation under the terms of and for the period contained in the resolution.\n(a) The governing body of the city may set conditions to its approval or continuation of a tax exemption under this section. The conditions may include construction specifications; time limits for construction; traffic, parking, safety, or environmental requirements; requirements as to the type and number of jobs to be created; valuation or assessment requirements after the exemption expires; or any other conditions reasonably required by the city to safeguard the public welfare.\n(b) If the city proposes to revoke its approval of a tax exemption granted under this section, it must notify the owner of the property and give the person an opportunity to be heard. The city must give the person 30 days' notice before holding the hearing. A revocation by the city must be made by resolution and must state the findings on which the revocation is based.",
	"repealed": false
}