{
	"id": "116C.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.94",
	"title": "116C.94 RULES.",
	"text": "(a) Except as provided in paragraph (b), the board shall adopt rules consistent with sections 116C.91 to 116C.96 that require an environmental assessment worksheet and otherwise comply with chapter 116D and rules adopted under it for a proposed release and a permit for a release. The board may place conditions on a permit and may deny, modify, suspend, or revoke a permit.\n(b) The board shall adopt rules that require an environmental impact statement and otherwise comply with chapter 116D and rules adopted under it for a proposed release and a permit for a release of genetically engineered wild rice. The board may place conditions on the permit and may deny, modify, suspend, or revoke the permit.\nThe rules shall provide that the board shall authorize an agency with a significant environmental permit to administer the regulatory oversight for the release of certain genetically engineered organisms.\nThe board may adopt rules providing exemptions to the requirements to prepare an environmental assessment worksheet and obtain a permit for releases of genetically engineered organisms for which substantial evidence from past releases has shown to the board's satisfaction that the organism can be released without jeopardizing public health or the environment.\nThe board may adopt rules providing alternative regulatory oversight to the requirements to prepare an environmental assessment worksheet and obtain a permit for releases of genetically engineered organisms for which substantial evidence from past experience, including releases and laboratory data, has shown to the board's satisfaction that the alternative oversight will protect public health and the environment.\nThe board may adopt rules to implement the authorities granted to it in section 116C.97, subdivision 2.\nThe board shall consult with local units of government and with private citizens before adopting any rules.",
	"repealed": false
}