{
	"id": "609.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.02",
	"title": "609.02 DEFINITIONS.",
	"text": "\"Crime\" means conduct which is prohibited by statute and for which the actor may be sentenced to imprisonment, with or without a fine.\n\"Felony\" means a crime for which a sentence of imprisonment for one year or more may be imposed.\n[Repealed, 1999 c 194 s 11]\n\"Misdemeanor\" means a crime for which a sentence of not more than 90 days or a fine of not more than $1,000, or both, may be imposed.\n\"Gross misdemeanor\" means any crime which is not a felony or misdemeanor. The maximum fine which may be imposed for a gross misdemeanor is $3,000.\n\"Petty misdemeanor\" means a petty offense which is prohibited by statute, which does not constitute a crime and for which a sentence of a fine of not more than $300 may be imposed.\n\"Conviction\" means any of the following accepted and recorded by the court:\n(1) a plea of guilty; or\n(2) a verdict of guilty by a jury or a finding of guilty by the court.\n\"Dangerous weapon\" means any firearm, whether loaded or unloaded, or any device designed as a weapon and capable of producing death or great bodily harm, any combustible or flammable liquid or other device or instrumentality that, in the manner it is used or intended to be used, is calculated or likely to produce death or great bodily harm, or any fire that is used to produce death or great bodily harm.\nAs used in this subdivision, \"flammable liquid\" means any liquid having a flash point below 100 degrees Fahrenheit and having a vapor pressure not exceeding 40 pounds per square inch (absolute) at 100 degrees Fahrenheit but does not include intoxicating liquor as defined in section 340A.101. As used in this subdivision, \"combustible liquid\" is a liquid having a flash point at or above 100 degrees Fahrenheit.\n\"Bodily harm\" means physical pain or injury, illness, or any impairment of physical condition.\n\"Substantial bodily harm\" means bodily injury which involves a temporary but substantial disfigurement, or which causes a temporary but substantial loss or impairment of the function of any bodily member or organ, or which causes a fracture of any bodily member.\n\"Great bodily harm\" means bodily injury which creates a high probability of death, or which causes serious permanent disfigurement, or which causes a permanent or protracted loss or impairment of the function of any bodily member or organ or other serious bodily harm.\n(1) When criminal intent is an element of a crime in this chapter, such intent is indicated by the term \"intentionally,\" the phrase \"with intent to,\" the phrase \"with intent that,\" or some form of the verbs \"know\" or \"believe.\"\n(2) \"Know\" requires only that the actor believes that the specified fact exists.\n(3) \"Intentionally\" means that the actor either has a purpose to do the thing or cause the result specified or believes that the act performed by the actor, if successful, will cause that result. In addition, except as provided in clause (6), the actor must have knowledge of those facts which are necessary to make the actor's conduct criminal and which are set forth after the word \"intentionally.\"\n(4) \"With intent to\" or \"with intent that\" means that the actor either has a purpose to do the thing or cause the result specified or believes that the act, if successful, will cause that result.\n(5) Criminal intent does not require proof of knowledge of the existence or constitutionality of the statute under which the actor is prosecuted or the scope or meaning of the terms used in that statute.\n(6) Criminal intent does not require proof of knowledge of the age of a minor even though age is a material element in the crime in question.\n\"Assault\" is:\n(1) an act done with intent to cause fear in another of immediate bodily harm or death; or\n(2) the intentional infliction of or attempt to inflict bodily harm upon another.\n\"Second or subsequent violation\" or \"second or subsequent offense\" means that prior to the commission of the violation or offense, the actor has been adjudicated guilty of a specified similar violation or offense.\n[Repealed, 1993 c 326 art 2 s 34]\n[Repealed, 1993 c 326 art 2 s 34]\n[Repealed, 2014 c 263 s 4]\n\"Probation\" means a court-ordered sanction imposed upon an offender for a period of supervision no greater than that set by statute. It is imposed as an alternative to confinement or in conjunction with confinement or intermediate sanctions. The purpose of probation is to deter further criminal behavior, punish the offender, help provide reparation to crime victims and their communities, and provide offenders with opportunities for rehabilitation.\n\"Qualified domestic violence-related offense\" includes a violation of or an attempt to violate sections 518B.01, subdivision 14 (violation of domestic abuse order for protection); 609.185 (first-degree murder); 609.19 (second-degree murder); 609.195, paragraph (a) (third-degree murder); 609.20, clauses (1), (2), and (5) (first-degree manslaughter); 609.205, clauses (1) and (5) (second-degree manslaughter); 609.221 (first-degree assault); 609.222 (second-degree assault); 609.223 (third-degree assault); 609.2231 (fourth-degree assault); 609.224 (fifth-degree assault); 609.2242 (domestic assault); 609.2245 (female genital mutilation); 609.2247 (domestic assault by strangulation); 609.25 (kidnapping); 609.255 (false imprisonment); 609.342 (first-degree criminal sexual conduct); 609.343 (second-degree criminal sexual conduct); 609.344 (third-degree criminal sexual conduct); 609.345 (fourth-degree criminal sexual conduct); 609.3458 (sexual extortion); 609.377 (malicious punishment of a child); 609.582, subdivision 1, clause (c) (burglary in the first degree); 609.713 (terroristic threats); 609.748, subdivision 6 (violation of harassment restraining order); 609.749 (harassment or stalking); 609.78, subdivision 2 (interference with an emergency call); 617.261 (nonconsensual dissemination of private sexual images); and 629.75 (violation of domestic abuse no contact order); and similar laws of other states, the United States, the District of Columbia, tribal lands, and United States territories.\n\"Ammunition\" means ammunition or cartridge cases, primers, bullets, or propellent powder designed for use in any firearm. Ammunition does not include ornaments, curiosities, or souvenirs constructed from or resembling ammunition or ammunition components that are not operable as ammunition.\n\"Conditional release\" means a court-ordered mandatory term of community supervision as prescribed by sections 169A.276, subdivision 1, paragraph (d) (first-degree DWI); 243.166, subdivision 5a (violating predatory offender registration requirements); 609.2231, subdivision 3a, paragraph (d) (assault on secure treatment facility staff); 609.3455, subdivisions 6 and 7 (criminal sexual conduct); 617.246, subdivision 7 (use of minors in sexual performances); and 617.247, subdivision 9 (possession of child pornography). Conditional release is in addition to any applicable supervised release term.",
	"repealed": false
}