{
	"id": "297E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.04",
	"title": "297E.04 MANUFACTURER'S REPORTS AND RECORDS.",
	"text": "A manufacturer who sells gambling product for use or resale in this state, or for receipt by a person or entity in this state, shall file with the commissioner, on a form prescribed by the commissioner, a report of gambling product sold to any person in the state, including the established governing body of an Indian tribe recognized by the United States Department of the Interior. The report must be filed monthly on or before the 20th day of the month succeeding the month in which the sale was made. The commissioner shall prescribe the content, format, and manner of returns or other documents pursuant to section 270C.30. The commissioner may inspect the premises, books, records, and inventory of a manufacturer without notice during the normal business hours of the manufacturer. A person violating this section is guilty of a misdemeanor.\nThe flare of each pull-tab and tipboard game must be imprinted by the manufacturer with a bar code that provides all information prescribed by the commissioner. The commissioner must require that the bar code include the serial number of the game. A manufacturer must also affix to the outside of the box containing these games a bar code providing all information prescribed by the commissioner. The commissioner may also prescribe additional bar coding requirements.\nNo person may alter the bar code that appears on the outside of a box containing a deal of pull-tabs and tipboards. Possession of a box containing a deal of pull-tabs and tipboards that has a bar code different from the bar code of the deal inside the box is prima facie evidence that the possessor has altered the bar code on the box.\nEach sealed grouping of 100 or fewer paddle ticket cards must have its own individual master flare. The manufacturer of the paddle ticket cards must affix to or imprint at the bottom of each master flare a bar code that provides:\n(1) the name of the manufacturer;\n(2) the first paddle ticket card number in the group;\n(3) the number of paddle tickets attached to each paddle ticket card in the group; and\n(4) all other information required by the commissioner.",
	"repealed": false
}