{
	"id": "515B.1-107",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.1-107",
	"title": "515B.1-107 EMINENT DOMAIN.",
	"text": "(a) If a unit is acquired by eminent domain, or if part of a unit is acquired by eminent domain leaving the unit owner with a remnant which may not practically or lawfully be used for any material purpose permitted by the declaration, the award shall compensate the unit owner and secured party in the unit as their interests may appear, whether or not any common element interest is acquired. Upon acquisition, unless the order or final certificate otherwise provides, that unit's allocated interests are automatically reallocated among the remaining units in proportion to their respective allocated interests prior to the taking, and the association shall promptly prepare, execute, and record an amendment to the declaration reflecting the reallocations. Any remnant of a unit remaining after part of a unit is taken under this subsection is thereafter a common element.\n(b) Except as provided in subsection (a), if part of a unit is acquired by eminent domain, the award shall compensate the unit owner and secured party for the reduction in value of the unit and its interest in the common elements, whether or not any common elements are acquired. Upon acquisition, unless the order or final certificate otherwise provides, (i) that unit's allocated interests are reduced in proportion to the reduction in the size of the unit, or on any other basis specified in the declaration and (ii) the portion of the allocated interests divested from the partially acquired unit are automatically reallocated to that unit and to the remaining units in proportion to the respective allocated interests of those units before the taking, with the partially acquired unit participating in the reallocation on the basis of its reduced allocated interests.\n(c) If part of the common elements is acquired by eminent domain, the portion of the award attributable to the common elements taken shall be paid to the association. In an eminent domain proceeding which seeks to acquire a part of the common elements, jurisdiction may be acquired by service of process upon the association. Unless the declaration provides otherwise, any portion of the award attributable to the acquisition of a limited common element shall be equally divided among the owners of the units to which that limited common element was allocated at the time of acquisition and their secured parties, as their interests may appear or as provided by the declaration.\n(d) In any eminent domain proceeding the units shall be treated as separate parcels of real estate for valuation purposes, regardless of the number of units subject to the proceeding.\n(e) Any distribution to a unit owner from the proceeds of an eminent domain award shall be subject to any limitations imposed by the declaration or bylaws.\n(f) The court order or final certificate containing the final awards shall be recorded in every county in which any portion of the common interest community is located.",
	"repealed": false
}