{
	"id": "469.100",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.100",
	"title": "469.100 OBLIGATIONS.",
	"text": "An authority must not levy a tax or special assessment, except as otherwise provided in sections 469.090 to 469.108, pledge the credit of the state or the state's municipal corporations or other subdivisions, or incur an obligation enforceable on property not owned by the authority.\nAnnually, at a time fixed by charter, resolution, or ordinance of the city, an authority shall send its budget to its city's council. The budget must include a detailed written estimate of the amount of money that the authority expects to need from the city to do authority business during the next fiscal year. The needed amount is what is needed in excess of any expected receipts from other sources.\nThe fiscal year of the authority must be the same as the fiscal year of its city.\nAnnually, at a time and in a form fixed by the city council, the authority shall make a written report to the council giving a detailed account of its activities and of its receipts and expenditures during the preceding calendar year, together with additional matters and recommendations it deems advisable for the economic development of the city.\nThe financial statements of the authority must be prepared, audited, filed, and published or posted in the manner required for the financial statements of the city that established the authority. The financial statements must permit comparison and reconciliation with the city's accounts and financial reports. The report must be filed with the state auditor by June 30 of each year. The auditor shall review the report and may accept it or, in the public interest, audit the books of the authority.\nAt the request of the city or upon the auditor's initiative, the state auditor may make a legal compliance examination of the authority for that city. Each authority examined must pay the total cost of the examination, including the salaries paid to the examiners while actually engaged in making the examination. The state auditor may bill monthly or at the completion of the audit. All collections received must be deposited in the general fund.",
	"repealed": false
}