{
	"id": "501C.1202",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.1202",
	"title": "501C.1202 SUSPENSION OF THE POWER OF ALIENATION.",
	"text": "(a) The power of alienation is suspended if there are no persons in being who, alone or in conjunction with others, can convey an absolute fee in possession or absolute ownership of real property or absolute ownership of personal property.\n(b) There is no suspension of the power of alienation by the terms of a trust or by interests in property held in trust if there is an unlimited power in one or more persons then in being to terminate the trust, by revocation or otherwise, and to acquire an absolute fee in possession or absolute ownership of the trust property.\n(c) There is no suspension of the power of alienation by the terms of a trust or by interests in property held in trust if the trustee has power to sell an absolute fee in possession or absolute ownership of the trust property.\nThe power of alienation of property held in trust may be suspended, by the terms of the trust, for a period of not more than 21 years. During any period of suspension of the power of alienation of real property, sections 501C.0201 to 501C.0208 apply. Notwithstanding any contrary term of a trust, suspension of the power of alienation by the terms of a trust ceases after a period of 21 years, after which the trustee has the power to convey an absolute fee in possession or absolute ownership of the trust property, and to mortgage, pledge, and lease the same. A provision in the terms of a trust for forfeiture of the interest of a trustee or beneficiary if the trustee or beneficiary participates in or seeks to convey, mortgage, pledge, or lease trust property after the expiration of a 21-year period of suspension is void.\nSubdivision 2 does not apply to a trust if the beneficial interests in the trust are evidenced by or constitute securities within the meaning of section 2(1) of the Securities Act of 1933, title 15, United States Code, section 77(b)(1).\nEvery future interest in real or personal property not held in trust is void in its creation if it might suspend the power of alienation for a period longer than a life or lives in being plus 21 years.",
	"repealed": false
}