{
	"id": "270B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/270B.03",
	"title": "270B.03 DISCLOSURE TO DATA SUBJECT.",
	"text": "Returns and return information must, on request, be made open to inspection by or disclosure to the data subject. The request must be made in writing or in accordance with written procedures of the chief disclosure officer of the department that have been approved by the commissioner to establish the identification of the person making the request as the data subject. For purposes of this chapter, the following are the data subject:\n(1) in the case of an individual return, that individual;\n(2) in the case of an income tax return filed jointly, either of the individuals with respect to whom the return is filed;\n(3) in the case of a return filed by a business entity, an officer of a corporation, a shareholder owning more than one percent of the stock, or any shareholder of an S corporation; a general partner in a partnership; the owner of a sole proprietorship; a member or manager of a limited liability company; a participant in a joint venture; the individual who signed the return on behalf of the business entity; or an employee who is responsible for handling the tax matters of the business entity, such as the tax manager, bookkeeper, or managing agent;\n(4) in the case of an estate return:\n(i) the personal representative or trustee of the estate; and\n(ii) any beneficiary of the estate as shown on the federal estate tax return;\n(5) in the case of a trust return:\n(i) the trustee or trustees, jointly or separately; and\n(ii) any beneficiary of the trust as shown in the trust instrument;\n(6) if liability has been assessed to a transferee under section 270C.58, subdivision 1, the transferee is the data subject with regard to the returns and return information relating to the assessed liability;\n(7) in the case of an Indian tribal government or an Indian tribal government-owned entity:\n(i) the chair of the tribal government; or\n(ii) any person authorized by the tribal government; and\n(8) in the case of a successor as defined in section 270C.57, subdivision 1, paragraph (b), the successor is the data subject and information may be disclosed as provided by section 270C.57, subdivision 4.\nIf an individual is legally subject to guardianship or conservatorship under sections 524.5-101 to 524.5-502, or similar laws of another state, that individual's return and return information is, upon written request, open to inspection by or disclosure to the guardian or conservator appointed for the individual or the individual's estate.\nNotwithstanding section 13.10, a return filed by or on behalf of a decedent is open to inspection by or disclosure to:\n(1) the personal representative of the decedent's estate or trustee appointed under section 573.02, subdivision 3, or a similar law of another state; and\n(2) a claimant under section 290A.18, subdivision 1.\n(a) A return is open to inspection by or disclosure to the trustee or receiver if:\n(1) there is a trustee in a title 11 (United States Bankruptcy Code) case in which the debtor is the person with respect to whom the return is filed; or\n(2) substantially all of the property of the person with respect to whom the return is filed is in the hands of a receiver.\n(b) In an involuntary bankruptcy case of an individual, no disclosure may be made under paragraph (a) until the order for relief has been entered by the court having jurisdiction of the case, unless the court finds that disclosure is appropriate for purposes of determining whether an order for relief should be entered.\nAny return or return information to which this section applies is open to inspection by or disclosure to the attorney in fact duly authorized in a writing signed by the data subject or to the person or persons designated by the data subject in a request for or consent to the disclosure. The request must be made in writing or in accordance with written procedures of the chief disclosure officer of the department that have been approved by the commissioner to establish the identification of the person making the request as the data subject.\nFor purposes of any law administered by the Department of Revenue, including laws not listed in section 270B.01, subdivision 8, investigative data collected or created by the Department of Revenue in order to prepare a case against a person, whether known or unknown, for the commission of a crime is confidential data on individuals or protected nonpublic data, as defined in section 13.02, subdivisions 3 and 13, during an investigation. When the investigation becomes inactive, as defined in section 13.82, subdivision 7, the data is private data on individuals or nonpublic data, as defined in section 13.02, subdivisions 9 and 12.\nThe commissioner may prescribe a form to be completed by the data subject requesting or authorizing inspection or disclosure of returns and return information.\n[Repealed, 1Sp2003 c 8 art 2 s 20]",
	"repealed": false
}