{
	"id": "79A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.21",
	"title": "79A.21 COMMERCIAL SELF-INSURANCE GROUP APPLICATION.",
	"text": "(a) Groups proposing to become licensed as commercial self-insurance groups must complete and submit an application on a form or forms prescribed by the commissioner.\n(b) The commissioner shall grant or deny the group's application to self-insure within 60 days after a complete application has been filed, provided that the time may be extended for an additional 30 days upon 15 days' prior notice to the applicant.\nAll first-year applications must be accompanied by the following:\n(a) A detailed business plan including the risk profile of the proposed membership, underwriting guidelines, marketing plan, minimum financial criteria for each member, and financial projections for the first year of operation.\n(b) A plan describing the method in which premiums are to be charged to the employer members. The plan shall be accompanied by copies of the member's workers' compensation insurance policies in force at the time of application. In developing the premium for the group, the commercial self-insurance group shall base its premium on the Minnesota Workers' Compensation Insurers Association's manual of rules, loss costs, and classifications approved for use in Minnesota by the commissioner. Each member applicant shall, on a form approved by the commissioner, complete estimated payrolls for the first 12-month period that the applicant will be self-insured. Premium volume discounts per the plan will be permitted if they can be shown to be consistent with actuarial standards.\n(c) A schedule indicating actual or anticipated operational expenses of the commercial self-insurance group. No authority to self-insure will be granted unless, over the term of the policy year, at least 65 percent of total revenues from all sources for the year are available for the payment of its claim and assessment obligations. For purposes of this calculation, claim and assessment obligations include the cost of allocated loss expenses as well as special compensation fund and commercial self-insurance group security fund assessments but exclude the cost of unallocated loss expenses.\n(d) An indemnity agreement from each member who will participate in the commercial self-insurance group, signed by an officer of each member, providing for joint and several liability for all claims and expenses of all of the members of the commercial self-insurance group arising in any fund year in which the member was a participant on a form approved by the commissioner. The indemnity agreement shall provide for assessments according to the group's bylaws on an individual and proportionate basis.\n(e) A copy of the commercial self-insurance group bylaws.\n(f) Evidence of the security deposit required under section 79A.24, accompanied by the actuarial certification study for the minimum security deposit as required under section 79A.24.\n(g) Each initial member of the commercial self-insurance group shall submit to the commercial self-insurance group accountant its most recent annual financial statement. Financial statements for a period ending more than six months prior to the date of the application must be accompanied by an affidavit, signed by a company officer under oath, stating that there has been no material lessening of the net worth nor other adverse changes in its financial condition since the end of the period. Individual group members constituting at least 50 percent of the group's annual premium shall submit reviewed or audited financial statements. The remaining members must submit compilation level statements. Statements for a period ending more than 12 months prior to the date of application cannot be accepted.\n(h) A compiled combined financial statement of all group members prepared by the commercial self-insurance group's accountant and a list of members included in such statements. An \"Agreed-Upon Procedures\" report, as determined by the commissioner, indicating combined net worth, total assets, cash flow, and net income of the group members may be filed in lieu of the compiled combined financial statement.\n(i) A copy of each member's accountant's report letter from the reports used in compiling the combined financial statements.\n(j) A list of all members and the percentage of premium each represents to the total group's annual premium for the policy year.\nThe commissioner shall approve an application for self-insurance upon a determination that all of the following conditions are met:\n(1) a completed application and all required documents have been submitted to the commissioner;\n(2) the financial ability of the commercial self-insurance group is sufficient to fulfill all obligations that may arise under this chapter or chapter 176;\n(3) the annual premium of the commercial self-insurance group to be charged to initial members is at least 150 percent of the WCRA minimum retention in effect at the time of the application;\n(4) the commercial self-insurance group has contracted with a service company to administer its program; and\n(5) the required securities or surety bond shall be on deposit prior to the effective date of coverage for the commercial self-insurance group.",
	"repealed": false
}