{
	"id": "146B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.01",
	"title": "146B.01 DEFINITIONS.",
	"text": "The terms defined in this section apply to this chapter.\n\"Aftercare\" means written instructions given to a client, specific to the procedure rendered, on caring for the body art and surrounding area. These instructions must include information on when to seek medical treatment.\n\"Antiseptic\" means an agent that destroys disease-causing microorganisms on human skin or mucosa.\n\"Body art\" or \"body art procedures\" means physical body adornment using, but not limited to, tattooing and body piercing. Body art does not include practices and procedures that are performed by a licensed medical or dental professional if the procedure is within the professional's scope of practice.\n\"Body art establishment\" or \"establishment\" means any structure or venue, whether permanent, temporary, or mobile, where body art is performed. Mobile establishments include vehicle-mounted units, either motorized or trailered, and readily movable without dissembling and where body art procedures are regularly performed in more than one geographic location.\n\"Body piercing\" means the penetration or puncturing of the skin by any method for the purpose of inserting jewelry or other objects in or through the body. Body piercing also includes branding, scarification, suspension, subdermal implantation, microdermal, and tongue bifurcation. Body piercing does not include the piercing of the outer perimeter or the lobe of the ear using a presterilized single-use stud-and-clasp ear-piercing system.\n\"Branding\" means an indelible mark burned into the skin using instruments of thermal cautery, radio hyfrecation, and strike branding.\n\"Commissioner\" means the commissioner of health.\n\"Contaminated waste\" means any liquid or semiliquid blood or other potentially infectious materials; contaminated items that would release blood or other potentially infectious materials in a liquid or semiliquid state if compressed; items that are caked with dried blood or other potentially infectious materials and are capable of releasing these materials during handling; and sharps and any wastes containing blood and other potentially infectious materials, as defined in Code of Federal Regulations, title 29, section 1910.1030, known as \"Occupational Exposure to Bloodborne Pathogens.\"\n\"Department\" means the Department of Health.\n\"Equipment\" means all machinery, including fixtures, containers, vessels, tools, devices, implements, furniture, display and storage areas, sinks, and all other apparatus and appurtenances used in the operation of a body art establishment.\n\"Guest artist\" means an individual who performs body art procedures according to the requirements under section 146B.04.\n\"Hand sink\" means a sink equipped with potable hot and cold water held under pressure, used for washing hands, wrists, arms, or other portions of the body.\n\"Hot water\" means water at a temperature of at least 110 degrees Fahrenheit.\n\"Jewelry\" means any ornament inserted into a pierced area.\n\"Liquid chemical germicide\" means a tuberculocidal disinfectant or sanitizer registered with the Environmental Protection Agency.\n\"Microdermal\" means a single-point perforation of any body part other than an earlobe for the purpose of inserting an anchor with a step either protruding from or flush with the skin.\n\"Micropigmentation or cosmetic tattooing\" means the use of tattoos for permanent makeup or to hide or neutralize skin discolorations.\n\"Operator\" means any person who controls, operates, or manages body art activities at a body art establishment and who is responsible for the establishment's compliance with these regulations, whether or not the person actually performs body art activities.\n\"Procedure area\" means the physical space or room used for conducting body art procedures.\n\"Procedure surface\" means the surface area of furniture or accessories that may come into contact with the client's clothed or unclothed body during a body art procedure and the area of the client's skin where the body art procedure is to be performed and the surrounding area, or any other associated work area requiring sanitizing.\n\"Scarification\" means an indelible mark fixed on the body by the production of scars.\n\"Sharps\" means any object, sterile or contaminated, that may purposefully or accidentally cut or penetrate the skin or mucosa including, but not limited to, presterilized single-use needles, scalpel blades, and razor blades.\n\"Sharps container\" means a closed, puncture-resistant, leak-proof container, labeled with the international biohazard symbol, that is used for handling, storage, transportation, and disposal.\n\"Single use\" means products or items intended for onetime use which are disposed of after use on a client. This definition includes, but is not limited to, cotton swabs or balls, tissues or paper products, paper or plastic cups, gauze and sanitary coverings, disposable razors, piercing needles, tattoo needles, scalpel blades, stencils, ink cups, and protective gloves.\n\"Sterilization\" means a process resulting in the destruction of all forms of microbial life, including highly resistant bacterial spores.\n\"Subdermal implantation\" means the implantation of an object entirely below the dermis.\n\"Supervision\" means the physical presence of a technician licensed under this chapter while a body art procedure is being performed and includes:\n(1) \"direct supervision\" where a licensed technician is physically present in the establishment, and is within five feet and is in the line of sight of the temporary licensee who is performing a body art procedure while the procedure is being performed; and\n(2) \"indirect supervision\" where a licensed technician is physically present in the establishment while a body art procedure is being performed by the temporary licensee.\n\"Suspension\" means the suspension of the body from affixed hooks placed through temporary piercings.\n\"Tattooing\" means any method of placing indelible ink or other pigments into or under the skin or mucosa with needles or any other instruments used to puncture the skin, resulting in permanent coloration of the skin or mucosa. Tattooing also includes micropigmentation and cosmetic tattooing.\n\"Technician\" or \"body art technician\" means any individual who is licensed under this chapter as a tattoo technician or as a body piercing technician or as both.\n\"Temporary body art establishment\" means any place or premise operating at a fixed location where an operator performs body art procedures for no more than 21 days in conjunction with a single event or celebration.\n\"Tongue bifurcation\" means the cutting of the tongue from the tip to the base, forking at the end.",
	"repealed": false
}