{
	"id": "144E.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.101",
	"title": "144E.101 AMBULANCE SERVICE REQUIREMENTS.",
	"text": "(a) No publicly or privately owned ambulance service shall be operated in the state unless its ambulance service personnel are certified, appropriate to the type of ambulance service being provided, according to section 144E.28 or meet the staffing criteria specific to the type of ambulance service.\n(b) An ambulance service shall have a medical director as provided under section 144E.265.\nWhen a patient is being transported, at least one of the ambulance service personnel must be in the patient compartment. If advanced life-support procedures are required, a paramedic, a registered nurse qualified under section 144E.001, subdivision 3a, clause (2), item (i), or a physician assistant qualified under section 144E.001, subdivision 3a, clause (3), item (i), shall be in the patient compartment.\nAn ambulance service shall offer service 24 hours per day every day of the year, unless otherwise authorized under subdivisions 8 and 9.\nAn ambulance service shall not deny prehospital care to a person needing emergency ambulance service because of inability to pay or because of the source of payment for services if the need develops within the licensee's primary service area or when responding to a mutual aid call. Transport for the patient may be limited to the closest appropriate emergency medical facility.\nThe director shall regulate the following types of ambulance service:\n(1) basic life support;\n(2) advanced life support;\n(3) part-time advanced life support; and\n(4) specialized life support.\n(a) Except as provided in subdivision 6a, a basic life-support ambulance shall be staffed by at least:\n(1) one individual who is:\n(i) certified as an EMT;\n(ii) a Minnesota registered nurse who meets the qualification requirements in section 144E.001, subdivision 3a, clause (2); or\n(iii) a Minnesota licensed physician assistant who meets the qualification requirements in section 144E.001, subdivision 3a, clause (3); and\n(2) one individual to drive the ambulance who:\n(i) either meets one of the qualification requirements in clause (1) or is a registered emergency medical responder driver; and\n(ii) satisfies the requirements in subdivision 10.\n(b) An individual who meets one of the qualification requirements in paragraph (a), clause (1), must accompany the patient and provide a level of care so as to ensure that:\n(1) life-threatening situations and potentially serious injuries are recognized;\n(2) patients are protected from additional hazards;\n(3) basic treatment to reduce the seriousness of emergency situations is administered; and\n(4) patients are transported to an appropriate medical facility for treatment.\n(c) A basic life-support service shall provide basic airway management.\n(d) A basic life-support service shall provide automatic defibrillation.\n(e) A basic life-support service shall administer opiate antagonists consistent with protocols established by the service's medical director.\n(f) A basic life-support service licensee's medical director may authorize ambulance service personnel to perform intravenous infusion and use equipment that is within the licensure level of the ambulance service. Ambulance service personnel must be properly trained. Documentation of authorization for use, guidelines for use, continuing education, and skill verification must be maintained in the licensee's files.\n(a) Upon application from an ambulance service that includes evidence demonstrating hardship, the director may grant a variance from the staff requirements in subdivision 6, paragraph (a), and may authorize a basic life-support ambulance to be staffed, for all emergency calls and interfacility transfers, with one individual who meets the qualification requirements in paragraph (b) to drive the ambulance and one individual who meets one of the qualification requirements in subdivision 6, paragraph (a), clause (1), and who must accompany the patient. The variance applies to basic life-support ambulances until the ambulance service renews its license. When the variance expires, the ambulance service may apply for a new variance under this subdivision.\n(b) In order to drive an ambulance under a variance granted under this subdivision, an individual must:\n(1) hold a valid driver's license from any state;\n(2) have attended an emergency vehicle driving course approved by the ambulance service;\n(3) have completed a course on cardiopulmonary resuscitation approved by the ambulance service; and\n(4) register with the director according to a process established by the director.\n(c) If an individual serving as a driver under this subdivision commits or has a record of committing an act listed in section 144E.27, subdivision 5, paragraph (a), the director may temporarily suspend or prohibit the individual from driving an ambulance or place conditions on the individual's ability to drive an ambulance using the procedures and authority in section 144E.27, subdivisions 5 and 6.\n(a) Except as provided in paragraphs (f) and (g), an advanced life-support ambulance shall be staffed by at least:\n(1) one EMT or one AEMT and one paramedic;\n(2) one EMT or one AEMT and one registered nurse who: (i) is an EMT or an AEMT, is currently practicing nursing, and has been approved by the ambulance service medical director; or (ii) is certified as a certified flight registered nurse or certified emergency nurse; or\n(3) one EMT or one AEMT and one physician assistant who is an EMT or an AEMT, is currently practicing as a physician assistant, and has been approved by the ambulance service medical director.\n(b) An advanced life-support service shall provide basic life support, as specified under subdivision 6, paragraph (b), advanced airway management, manual defibrillation, administration of intravenous fluids and pharmaceuticals, and administration of opiate antagonists.\n(c) In addition to providing advanced life support, an advanced life-support service may staff additional ambulances to provide basic life support according to subdivision 6 and section 144E.103, subdivision 1.\n(d) An ambulance service providing advanced life support shall have a written agreement with its medical director to ensure medical control for patient care 24 hours a day, seven days a week. The terms of the agreement shall include a written policy on the administration of medical control for the service. The policy shall address the following issues:\n(1) two-way communication for physician direction of ambulance service personnel;\n(2) patient triage, treatment, and transport;\n(3) use of standing orders; and\n(4) the means by which medical control will be provided 24 hours a day.\nThe agreement shall be signed by the licensee's medical director and the licensee or the licensee's designee and maintained in the files of the licensee.\n(e) When an ambulance service provides advanced life support, the authority of a paramedic, Minnesota registered nurse-EMT, or Minnesota registered physician assistant-EMT to determine the delivery of patient care prevails over the authority of an EMT.\n(f) Upon application from an ambulance service that includes evidence demonstrating hardship, the director may grant a variance from the staff requirements in paragraph (a), clause (1), and may authorize an advanced life-support ambulance to be staffed by a registered emergency medical responder driver with a paramedic for all emergency calls and interfacility transfers. The variance shall apply to advanced life-support ambulance services until the ambulance service renews its license. When the variance expires, an ambulance service may apply for a new variance under this paragraph.\n(g) After an initial emergency ambulance call, each subsequent emergency ambulance response, until the initial ambulance is again available, and interfacility transfers, may be staffed by one registered emergency medical responder driver and an EMT or paramedic.\n(h) An individual who staffs an advanced life-support ambulance as a driver must also meet the requirements in subdivision 10.\n(a) A part-time advanced life-support service shall meet the staffing requirements under subdivision 7, paragraph (a); provide service as required under subdivision 7, paragraph (b), for less than 24 hours every day; and meet the equipment requirements specified in section 144E.103.\n(b) A part-time advanced life-support service shall have a written agreement with its medical director to ensure medical control for patient care during the time the service offers advanced life support. The terms of the agreement shall include a written policy on the administration of medical control for the service and address the issues specified in subdivision 7, paragraph (d).\nA specialized ground life-support service providing advanced life support shall be staffed by at least one EMT and one paramedic, registered nurse-EMT, or physician assistant-EMT. A specialized life-support service shall provide basic or advanced life support as designated by the director, and shall be restricted by the director to:\n(1) operation less than 24 hours of every day;\n(2) designated segments of the population;\n(3) certain types of medical conditions; or\n(4) air ambulance service that includes fixed-wing or rotor-wing.\nA driver of an ambulance must possess a valid driver's license issued by any state and must have attended an emergency vehicle driving course approved by the licensee. The emergency vehicle driving course must include actual driving experience.\n(a) An ambulance service shall maintain:\n(1) at least two ambulance service personnel on a written on-call schedule;\n(2) a current roster of its ambulance service personnel, including the name, address, and qualifications of its ambulance service personnel; and\n(3) files documenting personnel qualifications.\n(b) A licensee shall maintain in its files the name and address of its medical director and a written statement signed by the medical director indicating acceptance of the responsibilities specified in section 144E.265, subdivision 2.\n(a) A licensee shall have a written agreement with at least one neighboring licensed ambulance service for the preplanned and organized response of emergency medical services, and other emergency personnel and equipment, to a request for assistance in an emergency when local ambulance transport resources have been expended. The response is predicated upon formal agreements among participating ambulance services. A copy of each mutual aid agreement shall be maintained in the files of the licensee and shall be filed with the director for informational purposes only.\n(b) A licensee may have a written agreement with a neighboring licensed ambulance service, including a licensed ambulance service from a neighboring state if that service is currently and remains in compliance with its home state licensing requirements, to provide support to the primary service area of the licensee upon the licensee's request. The agreement may allow the licensee to suspend ambulance services in its primary service area during the times the neighboring licensed ambulance service has agreed to provide all emergency services to the licensee's primary service area. The agreement may permit the neighboring licensed ambulance service to serve the licensee's primary service area for up to 24 hours per day, provided service by the neighboring licensed ambulance service does not exceed 108 hours per calendar week. This paragraph applies only to an ambulance service whose primary service area is mainly located outside the metropolitan counties listed in section 473.121, subdivision 4, and outside the cities of Duluth, Mankato, Moorhead, Rochester, and St. Cloud, or an ambulance service based in a community with a population of less than 2,500 persons.\nA licensee may provide its services outside of its primary service area only if requested by a transferring physician or ambulance service licensed to provide service in the primary service area when it can reasonably be expected that:\n(1) the response is required by the immediate medical need of an individual; and\n(2) the ambulance service licensed to provide service in the primary service area is unavailable for appropriate response.\nBy July 1, 2010, a licensee shall have written age appropriate trauma triage and transport guidelines consistent with the criteria issued by the Trauma Advisory Council established under section 144.608 and approved by the director. The director may approve a licensee's requested deviations to the guidelines due to the availability of local or regional trauma resources if the changes are in the best interest of the patient's health.",
	"repealed": false
}