{
	"id": "176.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.105",
	"title": "176.105 COMMISSIONER TO ESTABLISH DISABILITY SCHEDULES.",
	"text": "(a) The commissioner of labor and industry shall by rule establish a schedule of degrees of disability resulting from different kinds of injuries. Disability ratings under the schedule for permanent partial disability must be based on objective medical evidence. The commissioner, in consultation with the Medical Services Review Board, shall periodically review the rules adopted under this paragraph to determine whether any injuries omitted from the schedule should be included and amend the rules accordingly.\n(b) No permanent partial disability compensation shall be payable except in accordance with the disability ratings established under this subdivision, except as provided in paragraph (c). The schedule may provide that minor impairments receive a zero rating.\n(c) If an injury for which there is objective medical evidence is not rated by the permanent partial disability schedule, the unrated injury must be assigned and compensated for at the rating for the most similar condition that is rated.\nThe commissioner shall by rule establish a schedule of internal organs that are compensable and indicate in the schedule to what extent the organs are compensable under section 176.101, subdivision 2a.\nIn order to accomplish the purposes of this section, the commissioner shall study disability or permanent impairment schedules set up by other states, the American Medical Association and other organizations.\n(a) For the purpose of establishing a disability schedule, the legislature declares its intent that the commissioner establish a disability schedule which shall be determined by sound actuarial evaluation and shall be based on the benefit level which exists on January 1, 1983.\n(b) The commissioner shall by rulemaking adopt procedures setting forth rules for the evaluation and rating of functional disability and the schedule for permanent partial disability and to determine the percentage of loss of function of a part of the body based on the body as a whole, including internal organs and any other body part which the commissioner deems appropriate.\n(c) The rules shall promote objectivity and consistency in the evaluation of permanent functional impairment due to personal injury and in the assignment of a numerical rating to the functional impairment.\n(d) Prior to adoption of rules the commissioner shall conduct an analysis of the current permanent partial disability schedule for the purpose of determining the number and distribution of permanent partial disabilities and the average compensation for various permanent partial disabilities. The commissioner shall consider setting the compensation under the proposed schedule for the most serious conditions higher in comparison to the current schedule and shall consider decreasing awards for minor conditions in comparison to the current schedule.\n(e) The commissioner may consider, among other factors, and shall not be limited to the following factors in developing rules for the evaluation and rating of functional disability and the schedule for permanent partial disability benefits:\n(1) the workability and simplicity of the procedures with respect to the evaluation of functional disability;\n(2) the consistency of the procedures with accepted medical standards;\n(3) rules, guidelines, and schedules that exist in other states that are related to the evaluation of permanent partial disability or to a schedule of benefits for functional disability provided that the commissioner is not bound by the degree of disability in these sources but shall adjust the relative degree of disability to conform to the expressed intent of this section;\n(4) rules, guidelines, and schedules that have been developed by associations of health care providers or organizations provided that the commissioner is not bound by the degree of disability in these sources but shall adjust the relative degree of disability to conform to the expressed intent of this section;\n(5) the effect the rules may have on reducing litigation;\n(6) the treatment of preexisting disabilities with respect to the evaluation of permanent functional disability provided that any preexisting disabilities must be objectively determined by medical evidence; and\n(7) symptomatology and loss of function and use of the injured member.\nThe factors in clauses (1) to (7) shall not be used in any individual or specific workers' compensation claim under this chapter but shall be used only in the adoption of rules pursuant to this section.\nNothing listed in clauses (1) to (7) shall be used to dispute or challenge a disability rating given to a part of the body so long as the whole schedule conforms with the expressed intent of this section.\n(f) If an employee suffers a permanent functional disability of more than one body part due to a personal injury incurred in a single occurrence, the percent of the whole body which is permanently partially disabled shall be determined by the following formula so as to ensure that the percentage for all functional disability combined does not exceed the total for the whole body:\nA + B (1 - A)\nwhere: A is the greater percentage whole body loss of the first body part; and B is the lesser percentage whole body loss otherwise payable for the second body part. A + B (1-A) is equivalent to A + B - AB.\nFor permanent partial disabilities to three body parts due to a single occurrence or as the result of an occupational disease, the above formula shall be applied, providing that A equals the result obtained from application of the formula to the first two body parts and B equals the percentage for the third body part. For permanent partial disability to four or more body parts incurred as described above, A equals the result obtained from the prior application of the formula, and B equals the percentage for the fourth body part or more in arithmetic progressions.",
	"repealed": false
}