{
	"id": "18C.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.005",
	"title": "18C.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n[Repealed, 2005 c 136 art 7 s 22]\n\"Ammonia\" and \"anhydrous ammonia\" are used interchangeably and mean a compound formed by the chemical combinations of the elements nitrogen and hydrogen in the molar proportion of one part nitrogen to three parts hydrogen. This relationship is shown by the chemical formula, NH3. On a weight basis, the ratio is 14 parts nitrogen to three parts hydrogen or approximately 82 percent nitrogen to 18 percent hydrogen. Ammonia may exist in either a gaseous or a liquid state. Ammonia or anhydrous ammonia does not include aqua ammonia or ammonium hydroxide, which are solutions of ammonia in water and are sometimes called ammonia.\n\"Beneficial substance\" means any substance or compound other than a primary, secondary, and micro plant nutrient, and excluding pesticides, that can be demonstrated by scientific research to be beneficial to one or more species of plants, soil, or media.\n\"Best management practices\" means practices, techniques, and measures developed under section 103H.151, subdivision 2.\n\"Brand\" means a term, design, or trademark used in connection with one or several grades of fertilizers or soil and plant amendment materials.\n\"Chemigation\" means a process of applying fertilizers to land or crops including agricultural, nursery, turf, golf course, or greenhouse sites in or with irrigation water during the irrigation process.\n\"Commissioner\" means the commissioner of agriculture.\n\"Compost\" is a biologically stable material derived from the composting process.\n\"Composting\" is the biological decomposition of organic matter. It is accomplished by mixing and piling in such a way as to promote aerobic or anaerobic decay or both. The process inhibits pathogens, viable weed seeds, and odors.\n\"Currently unavoidable use\" means a use of PFAS that is essential for the health, safety, or functioning of society and for which alternatives are not reasonably available.\n\"Custom apply\" means to apply a fertilizer, soil amendment, or plant amendment product for compensation.\n\"Custom blend fertilizer\" means a fertilizer blended according to the specifications that are furnished to a distributor by a consumer prior to blending.\n\"Deficiency\" means that amount of nutrient found by analysis is less than the amount guaranteed resulting from a lack of nutrient ingredients or from lack of uniformity.\n\"Distributor\" means a person who imports, consigns, manufactures, produces, compounds, mixes, or blends fertilizer, or who offers for sale, sells, barters, or otherwise supplies fertilizer or soil and plant amendments in this state.\n\"Environment\" means surface water, groundwater, air, land, plants, humans, and animals and their interrelationships.\n\"Fertilizer\" means a substance containing one or more recognized plant nutrients that is used for its plant nutrient content and designed for use or claimed to have value in promoting plant growth. Fertilizer does not include animal and vegetable manures that are not manipulated, marl, lime, limestone, and other products exempted by rule by the commissioner.\n\"Fixed location\" means all stationary fertilizer facility operations, owned or operated by a person, located in the same plant location or locality.\n\"Genetic engineering\" means the modification of the genetic composition of an organism using molecular techniques. This does not include selective breeding, hybridization, or nondirected mutagenesis.\n\"Genetically engineered fertilizer\" means an organism that has been modified through the use of genetic engineering, containing one or more recognized plant nutrients that is used for its plant nutrient content and designed for use or claimed to have value in promoting plant growth. Genetically engineered fertilizer does not include animal and vegetable manures that are not manipulated, marl, lime, limestone, and other products exempted by rule by the commissioner.\n\"Genetically engineered plant amendment\" means an organism that has been modified through the use of genetic engineering, and that when applied to plants or seeds is intended to improve germination, growth, yield, product quality, reproduction, flavor, or other desirable characteristics of plants except fertilizers, soil amendments, agricultural liming materials, pesticides, and other materials that are exempted by rule.\n\"Genetically engineered soil amendment\" means an organism that has been modified directly or indirectly using genetic engineering, intended to improve the physical characteristics of the soil for agricultural production, except fertilizers, agricultural liming materials, pesticides, and other materials exempted by rule.\n\"Grade\" means the percentage of total nitrogen (N), available phosphate (P2O5), and soluble potash (K2O) stated in whole numbers in the same terms, order, and percentages as in the guaranteed analysis except the grade of custom blends and their raw materials, bone meals, manures, and similar raw materials may be stated in fractional units, and specialty fertilizers may be stated in fractional units of less than one percent of total nitrogen, available phosphate, and soluble potash.\n\"Guarantor\" means the person who is guaranteeing the material to be as stated in the guaranteed analysis.\n\"Incident\" means a flood, fire, tornado, transportation accident, storage container rupture, portable container rupture, leak, spill, emission, discharge, escape, disposal, or other event that releases or immediately threatens to release a fertilizer, soil amendment, or plant amendment accidentally or otherwise into the environment, and may cause unreasonable adverse effects on the environment. Incident does not include a release resulting from the normal use of a product or practice in accordance with law.\n\"Intentionally added\" has the meaning given in section 18B.01, subdivision 12a.\n\"Investigational allowance\" means an allowance for variations inherent in the taking, preparation, and analysis of an official sample of fertilizer.\n\"Label\" means the display of all written, printed or graphic matter upon the immediate container or the statement accompanying a fertilizer, soil amendment, or plant amendment.\n\"Labeling\" means all written, printed or graphic matter on or accompanying a fertilizer, soil amendment, or plant amendment or advertisements, brochures, posters, television, radio or other announcements used in promoting the sale of fertilizers, soil amendments, or plant amendments.\n\"Local unit of government\" has the meaning given in section 18B.01, subdivision 14a.\n\"Manipulated\" means fertilizers that are manufactured, blended, or mixed, or animal or vegetable manures that have been treated in any manner, including mechanical drying, grinding, pelleting, and other means, or by adding other chemicals or substances.\n\"Manufacturer\" means a guarantor, registrant, distributor, producer, or other person that creates or produces a product or whose brand name is affixed to the product. In the case of a product imported into the United States, manufacturer includes the importer or first domestic distributor of the product if the person that manufactured or assembled the product or whose brand name is affixed to the product does not have a presence in the United States.\n\"Mobile mechanical unit\" means a portable machine or apparatus used to manufacture fertilizers.\n\"Official sample\" means a sample of fertilizer, soil amendment, or plant amendment taken by the commissioner according to methods prescribed by this chapter or by rule.\n\"Organic fertilizer\" means a material containing carbon and one or more elements other than hydrogen and oxygen essential for plant growth.\n\"Organism\" means an animal, plant, bacterium, cyanobacterium, fungus, protist, or virus.\n\"Percent\" or \"percentage\" means the percentage by weight.\n\"Perfluoroalkyl and polyfluoroalkyl substances\" or \"PFAS\" has the meaning given in section 18B.01, subdivision 15c.\n\"Person\" means an individual, firm, corporation, partnership, association, trust, joint stock company, or unincorporated organization, the state, a state agency, or a political subdivision.\n\"Plant amendment\" means a substance applied to plants or seeds that is intended to improve germination, growth, yield, product quality, reproduction, flavor, or other desirable characteristics of plants except fertilizers, soil amendments, agricultural liming materials, pesticides, and other materials that are exempted by rule.\n\"Plant food\" means a plant nutrient generally recognized as beneficial for plant growth, including nitrogen, phosphorus, potassium, calcium, magnesium, sulfur, boron, chlorine, cobalt, copper, iron, manganese, molybdenum, sodium, and zinc.\n\"Product\" means a fertilizer, specialty fertilizer, soil amendment, plant amendment, agricultural liming material, or other material that is manufactured, assembled, packaged, or otherwise prepared for sale to consumers, including its product components, sold or distributed for agricultural, personal, residential, commercial, or industrial use, including for use in making other products, and that is regulated under this chapter.\n\"Registrant\" means the person who registers fertilizer, soil amendment, or plant amendment under this chapter.\n\"Release\" means the placement or use of a genetically engineered organism outside a contained laboratory, greenhouse, building, structure, or other similar facility or under other conditions not specifically determined by the commissioner to be adequately contained.\n\"Rinsate\" means a dilute mixture of a fertilizer or fertilizer with water, solvents, oils, commercial rinsing agents, or other substances.\n\"Safeguard\" means a facility, equipment, device, or system, individually or in combination, designed to prevent an incident as required by rule.\n\"Sell,\" in reference to the sale of fertilizer, soil amendment, or plant amendment, includes:\n(1) the act of selling, transferring ownership;\n(2) the offering and exposing for sale, exchange, distribution, giving away, and transportation in, and into, this state;\n(3) the possession with intent to sell, exchange, distribute, give away or transport in, and into, this state;\n(4) the storing, carrying, and handling in aid of trafficking fertilizers, plant amendments, or soil amendments, whether done in person or through an agent, employee or others; and\n(5) receiving, accepting, and holding of consignment for sale.\n\"Sewage sludge\" means the solids and associated liquids in municipal wastewater that are encountered and concentrated by a municipal wastewater treatment plant. Sewage sludge does not include incinerator residues and grit, scum, or screenings removed from other solids during treatment.\n\"Site\" includes land and water areas, air space, and plants, animals, structures, buildings, contrivances, and machinery, whether fixed or mobile, including anything used for transportation.\n\"Soil amendment\" means a substance intended to improve the structural, physical, chemical, biochemical, or biological characteristics of the soil or modify organic matter at or near the soil surface, except fertilizers, agricultural liming materials, pesticides, and other materials exempted by the commissioner's rules.\n\"Specialty fertilizer\" means a fertilizer labeled and distributed for, but not limited to, the following uses: greenhouses, nurseries, home gardens, house plants, lawn fertilizer, shrubs, golf courses, municipal parks, and cemeteries.\n\"Substantially altering,\" \"substantially alter,\" or \"substantial alteration\" means modifying a bulk agricultural chemical storage facility by:\n(1) changing the capacity of a safeguard;\n(2) adding storage containers in excess of the capacity of a safeguard as required by rule;\n(3) increasing the size of the largest storage container in a safeguard as approved or permitted by the commissioner of agriculture; or\n(4) adding or changing anhydrous ammonia storage containers or adding ammonia loading or unloading stations. This does not include routine maintenance of safeguards, storage containers, appurtenances, piping, or existing mixing, blending, weighing, or handling equipment. For dry bulk fertilizer, a person may decrease storage capacity without a substantial alteration permit and may increase storage capacity up to 150 tons per location annually without a substantial alteration permit.\n[Repealed, 2005 c 136 art 7 s 22]\n\"Ton\" means a net ton of 2,000 pounds avoirdupois.\n\"Unreasonable adverse effects on the environment\" means an unreasonable risk to humans or the environment, taking into account the economic, social, and environmental costs and benefits of the use of a fertilizer.\n\"Wildlife\" means living things that are not human, domesticated, or pests.",
	"repealed": false
}