{
	"id": "268A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/268A.15",
	"title": "268A.15 EXTENDED EMPLOYMENT PROGRAM.",
	"text": "The Department of Employment and Economic Development shall administer this section through rehabilitation services. The department may employ staff as required to administer this section and may accept and receive funds from nonstate sources for the purpose of implementing this section.\nFor the purpose of this section, \"severe impairment to employment\" means profound limitations that dramatically restrict an individual's ability to seek, secure, and maintain employment due to an extended history of little or no employment, limited education, training, or job skills, and physical, intellectual, or emotional characteristics seriously impairing future ability to obtain and retain permanent employment.\nThe extended employment program shall have two categories of clients consisting of those with severe disabilities and those with severe impairment to employment. The purpose of the extended employment program for persons with severe disabilities is to provide the ongoing services necessary to maintain and advance the employment of persons with severe disabilities. The purpose of the extended employment program for persons with severe impairment to employment is to provide the ongoing support services necessary to secure, maintain, and advance in employment. Employment must encompass the broad range of employment choices available to all persons and promote an individual's self-sufficiency and financial independence.\nThe commissioner shall adopt rules on an individual's eligibility for the extended employment program, the certification of rehabilitation facilities, and the methods, criteria, and units of distribution for the allocation of state grant funds to certified rehabilitation facilities. In determining the allocation, the commissioner must consider the economic conditions of the community and the performance of rehabilitation facilities relative to their impact on the economic status of workers in the extended employment program.\nThe allocation of funds, eligibility criteria, and funding criteria for extended employment program funds for persons with severe disabilities shall be separate from the allocation of funds, eligibility criteria, and funding criteria for extended employment program funds for persons with severe impairment to employment. Extended employment program services for persons with severe disabilities shall be modified to the extent necessary to provide services to persons with severe impairment to employment.\nThe county agency must consider placing an individual who is on welfare and who has a severe impairment to employment, as defined in subdivision 1a, into an extended employment program under this section for job skills training or a job, or both, as part of the effort to move people from welfare to work as required under federal welfare reform.\nThe commissioner of employment and economic development shall evaluate the extended employment program to determine whether the purpose of extended employment as defined in subdivision 2 is being achieved. The evaluation must include information for the preceding funding year derived from the independent compliance audits of extended employment service providers submitted to the department on or before October 31 of each year. The evaluation must include an assessment of whether workers in the extended employment program are satisfied with their employment. A written report of this evaluation must be prepared at least every two years and made available to the public.\nThe commissioner of employment and economic development shall provide technical assistance within available resources to rehabilitation facilities.\nThe commissioner may provide innovation and expansion grants to rehabilitation facilities to encourage the development, demonstration, or dissemination of innovative business practices, training programs, and service delivery methods that:\n(1) expand and improve employment opportunities for persons with severe disabilities or severe impairment to employment who are unserved or underserved by the extended employment program; and\n(2) increase the ability of persons with severe disabilities or severe impairment to employment to use new and emerging technologies in employment settings, and foster the capacity of rehabilitation facilities and employers to promote the integration of individuals with severe disabilities and severe impairment to employment into the workplace and the mainstream of community life.\nThe grants must require collaboration at the local level among vocational rehabilitation field offices, county social service and planning agencies, rehabilitation facilities, and employers.\nThe commissioner may withdraw funds from a rehabilitation facility that is not being administered in accordance with its approved plan and budget unless a modified plan and budget is submitted to and approved by the commissioner, and implemented within a reasonable time. The commissioner may withdraw funds from a rehabilitation facility not being administered according to department rules, or not meeting mandatory standards for certification, unless a plan bringing the rehabilitation facility into compliance with the rules and standards is submitted to and approved by the commissioner, and implemented within a reasonable time. Funds withdrawn shall, after reasonable notice and opportunity for hearing, be reallocated by the commissioner to other rehabilitation facilities.\nState grant funds under this section and section 268A.13 shall be available for 24 months following the end of a fiscal year to allow for the submission of final grant data reports, the completion of audit adjustments of payments to grantees including grantee appeals of final audit adjustments, and the redistribution of remaining balances in grant accounts to other grantees who meet or exceed their contracts with the department for that fiscal year.\nAt the commissioner's discretion, paid work on the premises of a rehabilitation facility may be certified as an integrated setting after a site review by the department.",
	"repealed": false
}