{
	"id": "89A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/89A.08",
	"title": "89A.08 RESEARCH ADVISORY COMMITTEE.",
	"text": "The council chair shall appoint a Forest Resources Research Advisory Committee and a chair of that committee. The committee must consist of representatives of:\n(1) the College of Food, Agricultural and Natural Resource Sciences, University of Minnesota;\n(2) the Natural Resources Research Institute, University of Minnesota, Duluth;\n(3) the department;\n(4) the Northern Research Station, United States Department of Agriculture Forest Service; and\n(5) other organizations as deemed appropriate by the council.\nThe purpose of the advisory committee is to identify and initiate priority forest resources research activities by encouraging:\n(1) collaboration between organizations with responsibilities for conducting forest resources research;\n(2) linkages between researchers in different disciplines in conducting forest resources research;\n(3) interaction and communication between researchers and practitioners in the development and use of forest resources research; and\n(4) communication with the legislature on funding the council's priority forest resources research activities.\nThe advisory committee shall periodically undertake an assessment of strategic directions in forest resources research. The assessment must be based on input provided by administrators, researchers, practitioners, and the general public, and include:\n(1) an assessment of the current status of forest resources research in the state;\n(2) an identification of important forest resource issues in need of research;\n(3) an identification of priority forest research activities whose results will enable a better understanding of site-level and landscape-level impacts resulting from timber harvesting and forest management activities; and\n(4) an assessment of the progress toward addressing the priority forest resources research needs identified.\nThe forest resources research assessment must be made widely available to the research community, forest managers and users, and the public.\nBased on the priority forest resources research activities identified in subdivision 3, the advisory committee shall promote these research needs and the dissemination of findings to the research community, forest managers and users, and the public.\nThe advisory committee shall periodically facilitate forums to increase communications between the individuals and organizations conducting forest resources research and the users of the research.\nThe advisory committee shall report to the council its accomplishments in fulfilling the responsibilities identified in this section.",
	"repealed": false
}