{
	"id": "352D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/352D.04",
	"title": "352D.04 INVESTMENT OPTIONS.",
	"text": "[Repealed, 2014 c 296 art 13 s 28]\nAs specified in section 356.645, the State Board of Investment shall select investment products to be available to participants in the retirement program provided by this chapter.\n(a) A program participant may elect to participate in one or more of the investment products made available under the program by specifying the percentage of the participant's contributions under subdivision 2 to be used to purchase shares in the applicable products.\n(b) Before making an allocation election, or if the participant fails to specify an allocation, the executive director shall, on behalf of that participant, purchase shares in a default investment alternative. The investment alternative must be specified by the Minnesota State Retirement System Board from the available investment options authorized under subdivision 1a.\n(c) A participant may revise the investment allocation for subsequent purchase of shares, and a participant or former participant may also change the investment options selected for all or a portion of shares previously purchased.\n(d) Any investment allocation selection authorized under this subdivision, whether relating to subsequent purchases of new shares or reallocating the existing portfolio, must be conducted at times and under procedures prescribed by the executive director. Any allocation or allocation revisions are effective at the end of the most recent United States investment market day, unless subject to trading restrictions imposed on certain investment options.\n(a) The money used to purchase shares under this section is the employee and employer contributions provided in this subdivision.\n(b) The employee contribution is an amount equal to the percent of salary specified in section 352.04, subdivision 2.\n(c) The employer contribution is an amount equal to the following percentage of salary:\n(d) For members of the legislature, the contributions under this subdivision also must be made on per diem payments received during a regular or special legislative session, but may not be made on per diem payments received outside of a regular or special legislative session, on the additional compensation attributable to a leadership position under section 3.099, subdivision 3, living expense payments under section 3.101, or special session living expense payments under section 3.103.\n(e) For a judge who is a member of the unclassified plan under section 352D.02, subdivision 1, paragraph (c), clause (15), the employee contribution rate is eight percent of salary, and there is no employer contribution.\n(f) These contributions must be made in the manner provided in section 352.04, subdivisions 4, 5, and 6.",
	"repealed": false
}