{
	"id": "116.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.78",
	"title": "116.78 WASTE MANAGEMENT.",
	"text": "All untreated infectious waste must be segregated from other waste material at its point of generation and maintained in separate packaging throughout collection, storage, and transport. Infectious waste must be packaged, contained, and transported in a manner that prevents release of the waste material.\nAll bags, boxes, and other containers used to collect, transport, or store infectious waste must be clearly labeled with a biohazard symbol or with the words \"infectious waste\" written in letters no less than one inch in height.\nContainers which have been in direct contact with infectious waste must be disinfected prior to reuse.\nNoninfectious mixed municipal solid waste generated by a facility must be placed for containment, collection, and processing or disposal in containers that are sufficiently transparent that the contents of the containers may be viewed from the exterior of the containers. The operator of a mixed municipal solid waste facility may not refuse to accept mixed municipal solid waste generated by a facility that complies with this subdivision, unless the operator observes that the waste contains sharps or other infectious waste.\n(a) A person shall not place sharps with recyclable materials, as defined in section 115A.03.\n(b) Sharps, except those generated from a household or from a farm operation or agricultural business:\n(1) must be placed in puncture-resistant containers;\n(2) may not be compacted or mixed with other waste material whether or not the sharps are decontaminated unless it is part of an infectious waste decontamination process approved by the commissioner of the Pollution Control Agency that will prevent exposure during transportation and disposal; and\n(3) may not be disposed of at refuse-derived fuel facilities or at other facilities where waste is hand sorted.\nPathological waste must be managed according to sanitary standards established by state and federal laws or regulations for the disposal of the waste.\nInfectious and pathological waste must be stored in a specially designated area that is designed to prevent the entry of vermin and that prevents access by unauthorized persons.\nInfectious waste may not be compacted or mixed with other waste materials prior to incineration or disposal. Compaction is acceptable if it is part of an infectious waste system, approved by the commissioner of the Pollution Control Agency, that is designed to prevent exposure during storage, transportation, and disposal.\nExcept for disposal procedures specifically prescribed, this section and section 116.81 do not limit disposal methods for infectious and pathological waste.\nAny infectious waste, as defined in section 116.76, subdivision 12, produced by an ambulance service in the transport or care of a patient must be properly packaged and disposed of at the destination hospital or at the nearest hospital if the patient is not transported. A hospital must accept the infectious waste if it is properly packaged according to the standards the hospital uses for packaging its own infectious wastes. The hospital may charge the ambulance service a reasonable fee for disposal of the infectious waste. Nothing in this subdivision shall require a hospital to accept infectious waste if the waste is of a type not generated by the hospital or if the hospital cannot safely store the waste. A hospital that accepts infectious waste under this subdivision is not subject to those provisions of section 116.79, subdivision 4, paragraph (a), that apply to the storage or decontamination of infectious or pathological waste generated at a site other than the hospital.\nAny infectious waste, as defined in section 116.76, subdivision 12, produced by an eligible community health board, or public health nursing agency, or a program providing school health services under section 121A.21, must be properly packaged and may be disposed of at a hospital. For purposes of this subdivision, an \"eligible community health board or public health nursing agency\" is defined as a community health board or public health nursing agency located in a county with a population of less than 40,000. A hospital must accept the infectious waste if it is properly packaged according to the standards the hospital uses for packaging its own infectious wastes. The hospital may charge an eligible community health board or public health nursing agency or a program providing school health services a reasonable fee for disposal of the infectious waste. Nothing in this subdivision shall require a hospital to accept infectious waste if the waste is of a type not generated by the hospital or if the hospital cannot safely store the waste. A hospital that accepts infectious waste under this subdivision is not subject to those provisions of section 116.79, subdivision 4, paragraph (a), that apply to the storage or decontamination of infectious or pathological waste generated at a site other than the hospital.",
	"repealed": false
}