{
	"id": "103E.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.511",
	"title": "103E.511 CONTRACT NOT AWARDED; EXCESSIVE BIDS OR COSTS.",
	"text": "The procedure in this section may be used if, after a drainage system is established:\n(1) the only bids received are for more than 30 percent in excess of the engineer's estimated cost, or in excess of the benefits, less damages and other costs; or\n(2) a contract is awarded, but due to unavoidable delays not caused by the contractor, the contract cannot be completed for an amount equal to or less than the benefits, less damages and other costs.\nA person interested in the drainage project may petition the drainage authority if the person determines that the engineer made an error in the estimate of the drainage project cost or that the plans and specifications could be changed in a manner materially affecting the cost of the drainage system without interfering with efficiency. The petition must state the person's determinations and request that the detailed survey report and viewers' report be referred back to the engineer and to the viewers for additional consideration.\n(a) A person interested in the drainage project may petition the drainage authority for an order to reconsider the detailed survey report and viewers' report if the person determines:\n(1) that bids were received only for a price more than 30 percent in excess of the detailed survey report estimate because inflation increased the construction cost between the time of the detailed survey cost estimate and the time of awarding the contract; or\n(2) that after the contract was awarded there was unavoidable delay not caused by the contractor, and between the time of awarding the contract and completion of construction inflation increased construction costs resulting in the contract not being completed for an amount equal to or less than the assessed benefits.\n(b) The person may request in the petition that the drainage authority reconsider the original cost estimate in the detailed survey report and viewers' report and adjust the cost estimate consistent with the increased construction cost.\nAfter receiving a petition, the drainage authority shall order a hearing. The order must designate the time and place of the hearing and direct the auditor to give notice by publication.\n(a) At the hearing the drainage authority shall consider the petition and hear all interested parties.\n(b) The drainage authority may, by order, authorize the engineer to amend the detailed survey report, if the drainage authority determines that:\n(1) the detailed survey report cost estimate was erroneous and should be corrected;\n(2) the plans and specifications could be changed in a manner materially affecting the cost of the drainage project without interfering with efficiency; and\n(3) with the correction or modification a contract could be awarded within the 30 percent limitation and equal to or less than benefits.\n(c) If the drainage authority determines that the amended changes affect the amount of benefits or damages to any property or that the benefits should be reexamined because of inflated land values or inflated construction costs, it shall refer the viewers' report to the viewers to reexamine the benefits and damages.\n(d) The drainage authority may, by order, direct the engineer and viewers to amend their detailed survey report and viewers' report to consider the inflationary cost increases if the drainage authority determines that:\n(1) bids were not received; or\n(2) because of inflationary construction cost increases, construction under the awarded contract cannot be completed for 30 percent or less over the detailed survey cost estimate or in excess of the benefits, less damages and other costs.\n(e) The drainage authority may continue the hearing to give the engineer or viewers additional time to amend the reports. The jurisdiction of the drainage authority continues at the adjourned hearing.\n(f) The drainage authority has full authority to consider the amended reports and make findings and orders. A party may appeal to the district court under section 103E.091, subdivision 1.",
	"repealed": false
}