{
	"id": "181.725",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.725",
	"title": "181.725 INTERGOVERNMENTAL MISCLASSIFICATION ENFORCEMENT AND EDUCATION PARTNERSHIP.",
	"text": "The Intergovernmental Misclassification Enforcement and Education Partnership is composed of the following members or their designees, who shall serve on behalf of their respective partnership entities:\n(1) the commissioner of labor and industry;\n(2) the commissioner of revenue;\n(3) the commissioner of employment and economic development;\n(4) the commissioner of commerce; and\n(5) the attorney general.\nThe commissioner of labor and industry, in consultation with other members of the partnership, shall convene and lead meetings of the partnership to discuss issues related to the investigation of employee misclassification and public outreach. Members of the partnership may select a designee to attend any such meeting. Meetings must occur at least quarterly.\n(a) In addition to regular quarterly meetings under subdivision 2, the commissioner of labor and industry, in consultation with members of the partnership, may convene and lead additional meetings for the purpose of discussing and making recommendations under subdivision 4a.\n(b) This subdivision expires July 31, 2025, unless a different expiration date is specified in law.\nEach partnership entity may use the information received through its participation in the partnership to investigate employee misclassification within their relevant jurisdictions as follows:\n(1) the Department of Labor and Industry in its enforcement authority under chapters 176, 177, and 181;\n(2) the Department of Revenue in its enforcement authority under chapters 289A and 290;\n(3) the Department of Employment and Economic Development in its enforcement authority under chapters 268 and 268B;\n(4) the Department of Commerce in its enforcement authority under chapters 45, 60A, 60K, 79, and 79A; and\n(5) the attorney general in the attorney general's enforcement authority under sections 177.45 and 181.1721.\nAt the request of the chairs, the Intergovernmental Misclassification Enforcement and Education Partnership shall present annually to members of the house of representatives and senate committees with jurisdiction over labor. The presentation shall include information about how the partnership carried out its duties during the preceding calendar year.\n(a) By March 1, 2025, the Intergovernmental Misclassification Enforcement and Education Partnership shall make its first presentation to members of the house of representatives and senate committees with jurisdiction over labor. The first presentation may be made in a form and manner determined by the partnership. In addition to providing information about how the partnership carried out its duties in its first year, the presentation shall include the following information and recommendations, including any budget requests to carry out the recommendations:\n(1) consider any staffing recommendations for the partnership and each partnership entity to carry out the duties and responsibilities under this section;\n(2) provide a summary of the industries, areas, and employers with high numbers of misclassification violations and recommendations for proactive review and enforcement efforts;\n(3) propose a system for making cross referrals between partnership entities;\n(4) identify cross-training needs and a proposed cross-training plan; and\n(5) propose a metric or plan for monitoring and assessing:\n(i) the number and severity of employee misclassification violations; and\n(ii) the adequacy and effectiveness of the partnership's duties related to employee misclassification, including but not limited to the partnership's efforts on education, outreach, detection, investigation, deterrence, and enforcement of employee misclassification.\n(b) This subdivision expires July 31, 2025, unless a different expiration date is specified in law.\nThe Intergovernmental Misclassification Enforcement and Education Partnership is not a separate agency or board and is not subject to chapter 13D. Data shared or created by the partnership entities under this section or section 181.724 are subject to chapter 13 and hold the data classification prescribed by law.\nThe Intergovernmental Misclassification Enforcement and Education Partnership shall:\n(1) set goals to maximize Minnesota's efforts to detect, investigate, and deter employee misclassification;\n(2) share information to facilitate the detection and investigation of employee misclassification;\n(3) develop a process or procedure that provides a person with relevant information and connects them with relevant partnership entities, regardless of which partnership entity that person contacts for assistance;\n(4) identify best practices in investigating employee misclassification;\n(5) identify resources needed for better enforcement of employee misclassification;\n(6) inform and educate stakeholders on rights and responsibilities related to employee misclassification;\n(7) serve as a unified point of contact for workers, businesses, and the public impacted by misclassification;\n(8) inform the public on enforcement actions taken by the partnership entities; and\n(9) perform other duties as necessary to:\n(i) increase the effectiveness of detection, investigation, enforcement, and deterrence of employee misclassification; and\n(ii) carry out the purposes of the partnership.\n(a) The commissioner of labor and industry shall maintain on the department's website information about the Intergovernmental Misclassification Enforcement and Education Partnership, including information about how to file a complaint related to employee misclassification.\n(b) Each partnership entity shall maintain on its website information about worker classification laws, including requirements for employers and employees, consequences for misclassifying workers, and contact information for other partnership entities.\nThis section does not limit the duties or authorities of a partnership entity, or any other government entity, under state law.",
	"repealed": false
}