{
	"id": "260.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.92",
	"title": "260.92 PLACEMENT PROCEDURES.",
	"text": "The state must have procedures for the orderly and timely interstate placement of children that are implemented in accordance with an interstate compact. Within 60 days after the state receives from another state a request to conduct a study of a home environment for purposes of assessing the safety and suitability of placing a child in the home, the state shall, directly or by contract, conduct and complete a home study and return to the other state a report on the results of the study, which shall address the extent to which placement in the home would meet the needs of the child. If the state fails to comply with conducting and completing the home study within the 60-day period and this is as a result of circumstances beyond the control of the state, the state has 75 days to comply if the state documents the circumstances involved and certifies that completing the home study is in the best interests of the child.\nThis subdivision does not require the completion within the applicable period of the parts of the home study involving the education and training of the prospective foster or adoptive parents.\nThe state shall treat any report described in subdivision 1 that is received from another state, an Indian tribe, or a private agency under contract with another state or Indian tribe as meeting any requirements imposed by the state for the completion of a home study before placing a child in the home, unless, within 14 days after receipt of the report, the state determines, based on grounds that are specific to the content of the report, that making a decision in reliance on the report would be contrary to the welfare of the child.\nThe state shall make effective use of cross-jurisdictional resources, including through contract for the purchase of services, and shall eliminate legal barriers to facilitate timely adoptive or permanent placements for waiting children. The state shall not impose any restriction on the use of private agencies for the purpose of conducting a home study to meet the 60-day requirement.\nMinnesota is an incentive-eligible state and must:\n(1) have an approved plan as required by the United States Secretary of Health and Human Services;\n(2) be in compliance with the data requirements of the United States Department of Health and Human Services; and\n(3) have data that verify that a home study is completed within 30 days.\nThe state shall provide to the United States Secretary of Health and Human Services a written report, covering the preceding fiscal year, that specifies:\n(1) the total number of interstate home studies requested by the state with respect to children in foster care under the responsibility of the state, and with respect to each study, the identity of the other state involved;\n(2) the total number of timely interstate home studies completed by the state with respect to children in foster care under the responsibility of other states and, with respect to each study, the identity of the other state involved; and\n(3) other information the United States Secretary of Health and Human Services requires in order to determine whether Minnesota is a home study incentive-eligible state.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Home study\" means an evaluation of a home environment conducted in accordance with applicable requirements of the state in which the home is located, to determine whether a proposed placement of a child would meet the individual needs of the child, including the child's safety; permanency; health; well-being; and mental, emotional, and physical development.\n(c) \"Interstate home study\" means a home study conducted by a state at the request of another state to facilitate an adoptive or foster placement in the state of a child in foster care under the responsibility of the state.\n(d) \"Timely interstate home study\" means an interstate home study completed by a state if the state provides to the state that requested the study, within 30 days after receipt of the request, a report on the results of the study, except that there is no requirement for completion within the 30-day period of the parts of the home study involving the education and training of the prospective foster or adoptive parents.\n(a) Background study requirements for an adoption home study must be completed consistent with section 259.41, subdivisions 1, 2, and 3.\n(b) Background study requirements for a foster care license must be completed consistent with section 245C.08.\nIf a child has been placed in foster care outside the state in which the home of the parents of the child is located, periodically, but at least every six months, a caseworker on the staff of the agency of the state in which the home of the parents of the child is located or the state in which the child has been placed, or a private agency under contract with either state, must visit the child in the home or institution and submit a report on each visit to the agency of the state in which the home of the parents of the child is located.",
	"repealed": false
}