{
	"id": "270C.7101",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.7101",
	"title": "270C.7101 SALE OF SEIZED PROPERTY.",
	"text": "As soon as practicable after seizure of property, notice in writing shall be given by the commissioner to the owner of the property (or, in the case of personal property, the possessor thereof), and shall be served in like manner as a summons in a civil action in the district court. If the owner cannot be readily located, or has no dwelling or place of business within this state, the notice may be mailed to the last known address. The notice shall specify the sum demanded and shall contain, in the case of personal property, an account of the property seized and, in the case of real property, a description with reasonable certainty of the property seized.\nThe commissioner shall as soon as practicable after the seizure of the property give notice of sale of the property to the owner, in the manner of service prescribed in subdivision 1. In the case of personal property, the notice shall be served at least ten days prior to the sale. In the case of real property, the notice shall be served at least four weeks prior to the sale. The commissioner shall also cause public notice of each sale to be made. In the case of personal property, notice shall be posted at least ten days prior to the sale at the county courthouse for the county where the seizure is made, and in not less than two other public places. For purposes of this requirement, the Internet is a public place for posting the information. In the case of real property, six weeks' published notice shall be given prior to the sale, in a newspaper published or generally circulated in the county. The notice of sale provided in this subdivision shall specify the property to be sold, and the time, place, manner, and conditions of the sale. Whenever levy is made without regard to the 30-day period provided in section 270C.67, subdivision 3, public notice of sale of the property seized shall not be made within the 30-day period unless section 270C.7102 (relating to sale of perishable goods) is applicable.\nIf any property liable to levy is not divisible, so as to enable the commissioner by sale of a part thereof to raise the whole amount of the tax and expenses, the whole of the property shall be sold.\nThe time of sale shall be after the expiration of the notice periods prescribed in subdivision 2. The place of sale shall be within the county in which the property is seized, except by special order of the commissioner.\n(a) Before the sale the commissioner shall determine a minimum price for which the property shall be sold, and if no person offers for the property at the sale the amount of the minimum price, the property shall be declared to be purchased at the minimum price for the state of Minnesota; otherwise the property shall be declared to be sold to the highest bidder. In determining the minimum price, the commissioner shall take into account the expense of making the levy and sale. The announcement of the minimum price determined by the commissioner may be delayed until the receipt of the highest bid.\n(b) The sale shall not be conducted in any manner other than:\n(1) by public auction;\n(2) by public sale under sealed bids; or\n(3) in the case of items which individually or in usually marketable units have a value of $50 or less, by public or private proceedings as a unit or in parcels at any time and place and on any terms, but every aspect of the disposition including the method, manner, time, place, and terms must be commercially reasonable.\n(c) In the case of seizure of several items of property, the items may be offered separately, in groups, or in the aggregate, and shall be sold under whichever method produces the highest aggregate amount, except that sales under paragraph (b), clause (3), must produce a reasonable amount under the circumstances.\n(d) Payment in full shall be required at the time of acceptance of a bid, except that a part of the payment may be deferred by the commissioner for a period not to exceed 30 days.\n(e) Other methods (including advertising) in addition to those prescribed in subdivision 2 may be used in giving notice of the sale.\n(f) The commissioner may adjourn the sale from time to time for a period not to exceed 30 days.\n(g) If payment in full is required at the time of acceptance of a bid and is not then and there paid, the commissioner shall forthwith proceed to again sell the property in the manner provided in this section. If the conditions of the sale permit part of the payment to be deferred, and if the part is not paid within the prescribed period, suit may be instituted against the purchaser for the purchase price or that part thereof as has not been paid, together with interest at the rate specified in section 549.09 from the date of the sale; or, in the discretion of the commissioner, the sale may be declared by the commissioner to be null and void for failure to make full payment of the purchase price and the property may again be advertised and sold as provided in this section. In the event of a readvertisement and sale, any new purchaser shall receive the property or rights to property free and clear of any claim or right of the former defaulting purchaser, of any nature whatsoever, and the amount paid upon the bid price by the defaulting purchaser shall be forfeited.\nThe owner of property seized by levy may request that the commissioner offer to sell the property within 60 days after the request, or within a longer period requested by the owner. The request must be complied with unless the commissioner determines and notifies the owner within that period that compliance is not in the best interests of the state of Minnesota. A determination by the commissioner not to comply with the request is appealable to the Tax Court in the manner provided by law.\n(a) At the time of levy on securities, the commissioner shall provide notice to the taxpayer that the securities may be sold after ten days from the date of seizure.\n(b) If the commissioner levies upon nonexempt publicly traded securities and the value of the securities is less than or equal to the total obligation for which the levy is done, after ten days the person who possesses or controls the securities shall liquidate the securities in a commercially reasonable manner. After liquidation, the person shall transfer the proceeds to the commissioner, less any applicable commissions or fees, or both, which are charged in the normal course of business.\n(c) If the commissioner levies upon nonexempt publicly traded securities and the value of the securities exceeds the total amount of the levy, the owner of the securities may, within seven days after receipt of the commissioner's notice of levy given pursuant to subdivision 1, instruct the person who possesses or controls the securities which securities are to be sold to satisfy the obligation. If the owner does not provide instructions for liquidation, the person who possesses or controls the securities shall liquidate the securities in an amount sufficient to pay the obligation, plus any applicable commissions or fees, or both, which are charged in the normal course of business, beginning with the nonexempt securities purchased most recently. After liquidation, the person who possesses or controls the securities shall transfer to the commissioner the amount of money needed to satisfy the levy.",
	"repealed": false
}