{
	"id": "62D.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.123",
	"title": "62D.123 PROVIDER CONTRACTS.",
	"text": "Except for an employment agreement between a provider and health maintenance organization, an agreement to provide health care services between a provider and a health maintenance organization entered into or renewed after April 25, 1988, must contain the following provision:\nPROVIDER AGREES NOT TO BILL, CHARGE, COLLECT A DEPOSIT FROM, SEEK REMUNERATION FROM, OR HAVE ANY RECOURSE AGAINST AN ENROLLEE OR PERSONS ACTING ON THEIR BEHALF FOR SERVICES PROVIDED UNDER THIS AGREEMENT. THIS PROVISION APPLIES TO BUT IS NOT LIMITED TO THE FOLLOWING EVENTS: (1) NONPAYMENT BY THE HEALTH MAINTENANCE ORGANIZATION OR (2) BREACH OF THIS AGREEMENT. THIS PROVISION DOES NOT PROHIBIT THE PROVIDER FROM COLLECTING CO-PAYMENTS OR FEES FOR UNCOVERED SERVICES.\nTHIS PROVISION SURVIVES THE TERMINATION OF THIS AGREEMENT FOR AUTHORIZED SERVICES PROVIDED BEFORE THIS AGREEMENT TERMINATES, REGARDLESS OF THE REASON FOR TERMINATION. THIS PROVISION IS FOR THE BENEFIT OF THE HEALTH MAINTENANCE ORGANIZATION ENROLLEES. THIS PROVISION DOES NOT APPLY TO SERVICES PROVIDED AFTER THIS AGREEMENT TERMINATES.\nTHIS PROVISION SUPERSEDES ANY CONTRARY ORAL OR WRITTEN AGREEMENT EXISTING NOW OR ENTERED INTO IN THE FUTURE BETWEEN THE PROVIDER AND THE ENROLLEE OR PERSONS ACTING ON THEIR BEHALF REGARDING LIABILITY FOR PAYMENT FOR SERVICES PROVIDED UNDER THIS AGREEMENT.\nAn agreement to provide health care services between a provider and a health maintenance organization must require the provider to cooperate with and participate in the health maintenance organization's quality assurance program, dispute resolution procedure, and utilization review program.\nAn agreement to provide health care services between a provider and a health maintenance organization must require that if the provider terminates the agreement, without cause, the provider shall give the organization 120 days' advance notice of termination.\nIf a health maintenance organization's payments to a provider are delayed beyond the payment date in the contract, the provider may notify the commissioner who shall consider that information in assessing the financial solvency of the health maintenance organization.",
	"repealed": false
}