{
	"id": "290.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.01",
	"title": "290.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of this chapter, shall be given the meanings subjoined to them.\nThe definitions set forth in section 524.1-201, wherever appropriate to the administration of the provisions of this chapter, are incorporated by reference herein.\nThe term \"person\" includes individuals, fiduciaries, estates, trusts, and partnerships and may, where the context requires, include corporations as herein defined.\nThe terms \"partnership\" and \"partner\" have the meanings given in section 7701(a)(2) of the Internal Revenue Code.\nThe term \"trust\" has the meaning provided under the Internal Revenue Code, and also means designated settlement fund as defined in and taxed federally under section 468B of the Internal Revenue Code.\nFor purposes of this chapter and chapter 289A, a limited liability company that is formed under either the laws of this state or under similar laws of another state, will be treated as an entity similar to its treatment for federal income tax purposes.\nThe determination of marital status is made by section 7703 of the Internal Revenue Code.\nThe term \"corporation\" shall include every entity which is a corporation under section 7701(a)(3) or is treated as a corporation under section 851(g) or 7704 of the Internal Revenue Code and financial institutions. A corporation's franchise is its authorization to exist and conduct business, whether created by legislation, by executive order, by a governmental agency, by contract or other private action, or by some combination thereof. Every corporation is deemed to have a corporate franchise. An entity described in section 646(b) of the Tax Reform Act of 1986, Public Law 99-514, as amended by section 1006(k) of the Technical and Miscellaneous Revenue Act of 1988, Public Law 100-647, shall be classified in the same manner for purposes of this chapter as it is for federal income tax purposes.\n(a) \"Financial institution\" means:\n(1) any corporation or other business entity registered (i) under state law as a bank holding company; (ii) under the federal Bank Holding Company Act of 1956, as amended; or (iii) as a savings and loan holding company under the federal National Housing Act, as amended;\n(2) a national bank organized and existing as a national bank association pursuant to the provisions of United States Code, title 12, chapter 2;\n(3) a savings association or federal savings bank as defined in United States Code, title 12, section 1813(b)(1);\n(4) any bank or thrift institution incorporated or organized under the laws of any state;\n(5) any corporation organized under United States Code, title 12, sections 611 to 631;\n(6) any agency or branch of a foreign depository as defined under United States Code, title 12, section 3101;\n(7) any corporation or other business entity that is more than 50 percent owned, directly or indirectly, by any person or business entity described in clauses (1) to (6), other than an insurance company taxable under chapter 297I;\n(8) a corporation or other business entity that derives more than 50 percent of its total gross income for financial accounting purposes from finance leases. For the purposes of this clause, \"gross income\" means the average from the current tax year and immediately preceding two years and excludes gross income from incidental or occasional transactions. For purposes of this clause, \"finance lease\" means any lease transaction that is the functional equivalent of an extension of credit and that transfers substantially all the benefits and risks incident to the ownership of property, including any direct financing lease or leverage lease that meets the criteria of Financial Accounting Standards Board Statement No. 13, accounting for leases, or any other lease that is accounted for as financing by a lessor under generally accepted accounting principles; or\n(9) any other person or business entity, other than an insurance company, that derives more than 50 percent of its gross income from activities that an entity described in clauses (2) to (6) or (8) is authorized to transact. For the purposes of this clause, gross income does not include income from nonrecurring, extraordinary items.\n(b) The commissioner is authorized to exclude any person from the application of paragraph (a), clause (9), if the person proves by clear and convincing evidence that the person's income-producing activity is not in substantial competition with any person described in paragraph (a), clauses (2) to (6) or (8).\n[Repealed, 2014 c 308 art 9 s 94]\nA \"mutual insurance holding company\" is not an insurance company for purposes of this chapter.\nThe term \"domestic\" when applied to a corporation means a corporation:\n(1) created or organized in the United States, or under the laws of the United States or of any state, the District of Columbia, or any political subdivision of any of the foregoing but not including the Commonwealth of Puerto Rico, or any possession of the United States; or\n(2) which qualifies as a DISC, as defined in section 992(a) of the Internal Revenue Code.\nThe term \"foreign,\" when applied to a corporation, means a corporation other than a domestic corporation.\nThe terms \"insurance company,\" \"life insurance company,\" and \"insurance company other than life,\" have the meanings given in the Internal Revenue Code.\n(a) \"Captive insurance company\" means a company that:\n(1) is licensed as a captive insurance company under the laws of any state or foreign country; or\n(2) derives less than 50 percent of its total premiums for the taxable year from sources outside of the unitary business, as that term is used in section 290.17.\n(b) A captive insurance company is a \"disqualified captive insurance company\" if the company:\n(1) pays less than 0.5 percent of its total premiums for the taxable year in tax under chapter 297I or a comparable tax of another state; or\n(2) receives less than 50 percent of its gross receipts for the taxable year from premiums.\n(c) For purposes of this subdivision, \"premiums\" means amounts paid for arrangements that constitute insurance for federal income tax purposes, but excludes return premiums, premiums for reinsurance assumed from other insurance companies, and any other premiums that are or would be exempt from taxation under section 297I.05 as a result of their type or character, if the insurance was for business in Minnesota.\nThe term \"taxpayer\" means any person or corporation subject to a tax imposed by this chapter. For purposes of section 290.06, subdivision 23, the term \"taxpayer\" means an individual eligible to vote in Minnesota under section 201.014.\n[Repealed, 1989 c 28 s 26]\n[Repealed, 2013 c 143 art 6 s 34]\n(a) The term \"resident\" means any individual domiciled in Minnesota, except that an individual is not a \"resident\" for the period of time that the individual is a \"qualified individual\" as defined in section 911(d)(1) of the Internal Revenue Code, if the qualified individual notifies the county within three months of moving out of the country that homestead status be revoked for the Minnesota residence of the qualified individual, and the property is not classified as a homestead while the individual remains a qualified individual.\n(b) \"Resident\" also means any individual domiciled outside the state who maintains a place of abode in the state and spends in the aggregate more than one-half of the tax year in Minnesota, unless:\n(1) the individual or the spouse of the individual is in the armed forces of the United States; or\n(2) the individual is covered under the reciprocity provisions in section 290.081.\nFor purposes of this subdivision, presence within the state for any part of a calendar day constitutes a day spent in the state. Individuals shall keep adequate records to substantiate the days spent outside the state.\nThe term \"abode\" means a dwelling maintained by an individual, whether or not owned by the individual and whether or not occupied by the individual, and includes a dwelling place owned or leased by the individual's spouse.\n(c) In determining where an individual is domiciled, neither the commissioner nor any court shall consider:\n(1) charitable contributions made by the individual within or without the state;\n(2) the location of the individual's attorney, certified public accountant, or financial adviser; or\n(3) the place of business of a financial institution at which the individual applies for any new type of credit or at which the individual opens or maintains any type of account.\n(d) For purposes of this subdivision, the following terms have the meanings given them:\n(1) \"financial adviser\" means:\n(i) an individual or business entity engaged in business as a certified financial planner, registered investment adviser, licensed insurance producer or agent, or registered securities broker-dealer representative; or\n(ii) a financial institution providing services related to trust or estate administration, investment management, or financial planning; and\n(2) \"financial institution\" means a financial institution as defined in section 47.015, subdivision 1; a state or nationally chartered credit union; or a registered broker-dealer under the Securities and Exchange Act of 1934.\nResident estate means the estate of a deceased person where (1) the decedent was domiciled in Minnesota at the date of death, or (2) the personal representative or fiduciary was appointed by a Minnesota court in a proceeding other than an ancillary proceeding, or (3) the administration of the estate is carried on in Minnesota in a proceeding other than an ancillary proceeding.\n(a) Resident trust means a trust, except a grantor type trust, which either (1) was created by a will of a decedent who at death was domiciled in this state or (2) is an irrevocable trust, the grantor of which was domiciled in this state at the time the trust became irrevocable. For the purpose of this subdivision, a trust is considered irrevocable to the extent the grantor is not treated as the owner thereof under sections 671 to 678 of the Internal Revenue Code. The term \"grantor type trust\" means a trust where the income or gains of the trust are taxable to the grantor or others treated as substantial owners under sections 671 to 678 of the Internal Revenue Code. This paragraph applies to trusts, except grantor type trusts, that became irrevocable after December 31, 1995, or are first administered in Minnesota after December 31, 1995.\n(b) This paragraph applies to trusts, except grantor type trusts, that are not governed under paragraph (a). A trust, except a grantor type trust, is a resident trust only if two or more of the following conditions are satisfied:\n(1) a majority of the discretionary decisions of the trustees relative to the investment of trust assets are made in Minnesota;\n(2) a majority of the discretionary decisions of the trustees relative to the distributions of trust income and principal are made in Minnesota;\n(3) the official books and records of the trust, consisting of the original minutes of trustee meetings and the original trust instruments, are located in Minnesota.\n(c) For purposes of paragraph (b), if the trustees delegate decisions and actions to an agent or custodian, the actions and decisions of the agent or custodian must not be taken into account in determining whether the trust is administered in Minnesota, if:\n(1) the delegation was permitted under the trust agreement;\n(2) the trustees retain the power to revoke the delegation on reasonable notice; and\n(3) the trustees monitor and evaluate the performance of the agent or custodian on a regular basis as is reasonably determined by the trustees.\nThe term \"fiduciary\" means a guardian, trustee, receiver, conservator, personal representative, or any person acting in any fiduciary capacity for any person or corporation.\nThe term \"personal representative\" includes executor, administrator, successor personal representative, special administrator, and persons who perform substantially the same function under the law governing their status.\nThe term \"taxable year\" means the period for which the taxes levied by this chapter are imposed. It shall be a calendar year, a fiscal year, or, in cases where returns for a fractional part of a year are permitted or required, the period for which such return is made.\nThe term \"fiscal year\" means an accounting period of 12 months ending on the last day of any month other than December. In the case of any taxpayer who has made the election provided by section 289A.08, subdivision 5, the term means the annual period (varying from 52 to 53 weeks) so elected.\nThe terms \"paid or incurred\" and \"paid or accrued\" shall be construed according to the method of accounting upon the basis of which net income is computed for the purposes of the taxes imposed by this chapter; and the terms \"received\" and \"received or accrued\" shall be similarly construed.\nThe term \"stock\" or \"share\" means the interest of a member in a corporation however evidenced.\nThe term \"stockholder\" or \"shareholder\" means the owner of any such \"stock\" or \"share.\"\nThe term \"state\" or \"this state\" means the state of Minnesota.\nThe term \"surviving spouse\" means an individual who is a surviving spouse under section 2(a) of the Internal Revenue Code for the taxable year.\nThe term \"includes\" and its derivatives, when used in a definition contained in this chapter, shall not exclude other things otherwise within the meaning of the term defined.\nThe term \"commissioner\" means the commissioner of revenue of the state of Minnesota.\nThe term \"property\" includes every form of property, real, personal, or mixed, tangible or intangible, and every interest therein, legal or equitable, irrespective of how created or arising. Property pledged or mortgaged shall be treated as owned by the pledgor or mortgagor.\nWhen, in this chapter, the estate of a decedent or a trust is referred to as a taxable person, or a duty is imposed on such estate or trust, the reference may be construed as meaning the fiduciary in charge of the property of such estate or trust, and the duty shall be treated as imposed on such fiduciary.\n(a) For a trust or estate taxable under section 290.03, and a corporation taxable under section 290.02, the term \"net income\" means the federal taxable income, as defined in section 63 of the Internal Revenue Code of 1986, as amended through the date named in this subdivision, incorporating the federal effective dates of changes to the Internal Revenue Code and any elections made by the taxpayer in accordance with the Internal Revenue Code in determining federal taxable income for federal income tax purposes, and with the modifications provided in sections 290.0131 to 290.0136.\n(b) For an individual, the term \"net income\" means federal adjusted gross income with the modifications provided in sections 290.0131, 290.0132, and 290.0135 to 290.0137.\n(c) In the case of a regulated investment company or a fund thereof, as defined in section 851(a) or 851(g) of the Internal Revenue Code, federal taxable income means investment company taxable income as defined in section 852(b)(2) of the Internal Revenue Code, except that:\n(1) the exclusion of net capital gain provided in section 852(b)(2)(A) of the Internal Revenue Code does not apply;\n(2) the deduction for dividends paid under section 852(b)(2)(D) of the Internal Revenue Code must be applied by allowing a deduction for capital gain dividends and exempt-interest dividends as defined in sections 852(b)(3)(C) and 852(b)(5) of the Internal Revenue Code; and\n(3) the deduction for dividends paid must also be applied in the amount of any undistributed capital gains which the regulated investment company elects to have treated as provided in section 852(b)(3)(D) of the Internal Revenue Code.\n(d) The net income of a real estate investment trust as defined and limited by section 856(a), (b), and (c) of the Internal Revenue Code means the real estate investment trust taxable income as defined in section 857(b)(2) of the Internal Revenue Code.\n(e) The net income of a designated settlement fund as defined in section 468B(d) of the Internal Revenue Code means the gross income as defined in section 468B(b) of the Internal Revenue Code.\n(f) The Internal Revenue Code of 1986, as amended through May 1, 2023, applies for taxable years beginning after December 31, 1996.\n(g) Except as otherwise provided, references to the Internal Revenue Code in this subdivision and sections 290.0131 to 290.0136 mean the code in effect for purposes of determining net income for the applicable year.\n(h) In the case of a partnership electing to file a composite return under section 289A.08, subdivision 7, \"net income\" means the partner's share of federal adjusted gross income from the partnership modified by the additions provided in section 290.0131, subdivisions 8 to 10, 16, and 17, and the subtractions provided in: (1) section 290.0132, subdivisions 9, 27, and 28, to the extent the amount is assignable or allocable to Minnesota under section 290.17; and (2) section 290.0132, subdivision 14. The subtraction allowed under section 290.0132, subdivision 9, is only allowed on the composite tax computation to the extent the electing partner would have been allowed the subtraction.\n(i) In the case of a qualifying entity electing to pay the pass-through entity tax under section 289A.08, subdivision 7a, \"net income\" means the qualifying owner's share of federal adjusted gross income from the qualifying entity modified by the additions provided in section 290.0131, subdivisions 5, 8 to 10, 16, and 17, and the subtractions provided in: (1) section 290.0132, subdivisions 3, 9, 27, and 28, to the extent the amount is assignable or allocable to Minnesota under section 290.17; and (2) section 290.0132, subdivision 14. The subtraction allowed under section 290.0132, subdivision 9, is only allowed on the pass-through entity tax computation to the extent the qualifying owners would have been allowed the subtraction. The income of both a resident and nonresident qualifying owner is allocated and assigned to this state as provided for nonresident partners and shareholders under sections 290.17, 290.191, and 290.20.\n[Repealed, 2016 c 158 art 3 s 32]\n[Repealed, 2016 c 158 art 3 s 32]\n[Repealed, 2016 c 158 art 3 s 32]\n[Repealed, 2016 c 158 art 3 s 32]\n[Repealed, 2014 c 308 art 9 s 94]\n[Renumbered 290.0135]\n[Repealed, 2002 c 377 art 10 s 32]\n[Renumbered 290.0136]\nMS 2022 [Repealed, 2023 c 64 art 1 s 53]\nThe term \"gross income\" means the gross income as defined in section 61 of the Internal Revenue Code of 1986, as amended through the date named in subdivision 19 for the applicable taxable year, plus any additional items of income taxable under this chapter but not taxable under the Internal Revenue Code, less any items included in federal gross income but of a character exempt from state income tax under the laws of the United States.\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1987 c 268 art 1 s 127]\n(a) The terms \"adjusted gross income\" and \"federal adjusted gross income\" mean adjusted gross income, as defined in section 62 of the Internal Revenue Code, as amended through the date named in subdivision 19, paragraph (f), incorporating the federal effective date of changes to the Internal Revenue Code and any elections made by the taxpayer under the Internal Revenue Code in determining federal adjusted gross income for federal income tax purposes.\n(b) When computing federal adjusted gross income for purposes of credits and deductions, a taxpayer must calculate their federal adjusted gross income without any deduction for the specified income tax payments as defined in Internal Revenue Code Notice 2020-75. The taxpayer must provide detailed substantiation to support the computation.\nFor tax years beginning after December 31, 1986, the term \"taxable net income\" means:\n(1) for resident individuals the same as net income;\n(2) for individuals who were not residents of Minnesota for the entire year, the same as net income except that the tax is imposed only on the Minnesota apportioned share of that income as determined pursuant to section 290.06, subdivision 2c, paragraph (e);\n(3) for all other taxpayers, the part of net income that is allocable to Minnesota by assignment or apportionment under one or more of sections 290.17, 290.191, 290.20, and 290.36.\n[Repealed, 1983 c 342 art 1 s 44]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1983 c 15 s 33]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1983 c 342 art 1 s 44]\n[Repealed, 1983 c 207 s 44; 1983 c 342 art 1 s 44]\nThe term \"taxable income\" means:\n(1) for individuals, estates, and trusts, the same as taxable net income;\n(2) for corporations, the taxable net income less\n(i) the net operating loss deduction under section 290.095;\n(ii) the dividends received deduction under section 290.21, subdivision 4; and\n(iii) the exemption for operating in a job opportunity building zone under section 469.317.\n\"State itemized deduction\" means the itemized deductions for individual income tax allowed under section 290.0122, subdivision 1, reduced by the limit under section 290.0122, subdivision 2.\nExcept when inappropriate, a reference in this chapter (1) to the Internal Revenue Code of 1954 includes a reference to the Internal Revenue Code of 1986, and (2) to the Internal Revenue Code of 1986 includes a reference to the provisions of law formerly known as the Internal Revenue Code of 1954.\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended through May 1, 2023. Internal Revenue Code also includes any uncodified provision in federal law that relates to provisions of the Internal Revenue Code that are incorporated into Minnesota law.\n[Repealed, 2002 c 377 art 10 s 32]\n\"Earned income\" has the meaning given in section 32(c) of the Internal Revenue Code, except a taxpayer must use earned income from the taxable year for which the taxpayer filed a return.",
	"repealed": false
}