{
	"id": "260E.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.17",
	"title": "260E.17 RESPONSE PATH ASSIGNMENT.",
	"text": "(a) Upon receipt of a report, the local welfare agency shall determine whether to conduct a family assessment, an investigation, or a noncaregiver human trafficking assessment as appropriate to prevent or provide a remedy for maltreatment.\n(b) The local welfare agency shall conduct an investigation when the report involves sexual abuse, except as indicated in paragraph (f), or substantial child endangerment.\n(c) The local welfare agency shall begin an immediate investigation at any time when the local welfare agency is responding with a family assessment and the local welfare agency determines that there is reason to believe that sexual abuse, substantial child endangerment, or a serious threat to the child's safety exists.\n(d) The local welfare agency may conduct a family assessment for reports that do not allege sexual abuse, except as indicated in paragraph (f), or substantial child endangerment. In determining that a family assessment is appropriate, the local welfare agency may consider issues of child safety, parental cooperation, and the need for an immediate response.\n(e) The local welfare agency may conduct a family assessment for a report that was initially screened and assigned for an investigation. In determining that a complete investigation is not required, the local welfare agency must document the reason for terminating the investigation and notify the local law enforcement agency if the local law enforcement agency is conducting a joint investigation.\n(f) The local welfare agency shall conduct a noncaregiver human trafficking assessment when a maltreatment report alleges sex or labor trafficking of a child and the alleged offender is a noncaregiver human trafficker as defined by section 260E.03, subdivision 15a.\n(g) During a noncaregiver human trafficking assessment, the local welfare agency shall initiate an immediate investigation if there is reason to believe that a child's parent, caregiver, or household member allegedly engaged in the act of sex or labor trafficking a child or was alleged to have engaged in any conduct requiring the agency to conduct an investigation.\n[See Note.]\nThe responsible agency shall conduct an investigation when the report alleges maltreatment in a facility required to be licensed or certified under chapter 144H, 245A, 245D, or 245H; under sections 144.50 to 144.58 and 241.021; in a school as defined in section 120A.05, subdivisions 9, 11, and 13, and chapter 124E; or in a nonlicensed personal care provider association as defined in section 256B.0625, subdivision 19a.",
	"repealed": false
}