{
	"id": "65B.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.51",
	"title": "65B.51 DEDUCTION OF COLLATERAL BENEFITS FROM TORT RECOVERY; LIMITATION ON RIGHT TO RECOVER DAMAGES.",
	"text": "With respect to a cause of action in negligence accruing as a result of injury arising out of the operation, ownership, maintenance or use of a motor vehicle with respect to which security has been provided as required by sections 65B.41 to 65B.71, the court shall deduct from any recovery the value of basic or optional economic loss benefits paid or payable, or which would be payable but for any applicable deductible. In any case where the claimant is found to be at fault under section 604.01, the deduction for basic economic loss benefits must be made before the claimant's damages are reduced under section 604.01, subdivision 1.\nA person may bring a negligence action for economic loss not paid or payable by a reparation obligor or through the assigned claims plan because of any lack of insurance coverage for the economic loss described in section 65B.44, daily or weekly dollar limitations of section 65B.44, the seven-day services exclusion of section 65B.44, the limitations of benefits contained in section 65B.44, subdivision 1, or an exclusion from coverage by sections 65B.58 to 65B.60.\nIn an action described in subdivision 1, no person shall recover damages for noneconomic detriment unless:\n(a) The sum of the following exceeds $4,000:\n(1) reasonable medical expense benefits paid, payable or payable but for any applicable deductible, plus\n(2) the value of free medical or surgical care or ordinary and necessary nursing services performed by a relative of the injured person or a member of the injured person's household, plus\n(3) the amount by which the value of reimbursable medical services or products exceeds the amount of benefit paid, payable, or payable but for an applicable deductible for those services or products if the injured person was charged less than the average reasonable amount charged in this state for similar services or products, minus\n(4) the amount of medical expense benefits paid, payable, or payable but for an applicable deductible for diagnostic x-rays and for a procedure or treatment for rehabilitation and not for remedial purposes or a course of rehabilitative occupational training; or\n(b) the injury results in:\n(1) permanent disfigurement;\n(2) permanent injury;\n(3) death; or\n(4) disability for 60 days or more.\n(c) For the purposes of clause (a) evidence of the reasonable value of medical services and products shall be admissible in any action brought in this state.\nFor the purposes of this subdivision disability means the inability to engage in substantially all of the injured person's usual and customary daily activities.\nNothing in this section shall impair or limit the liability of a person in the business of manufacturing, distributing, retailing, repairing, servicing or maintaining motor vehicles arising from a defect in a motor vehicle caused or not corrected by an act or omission in manufacture, inspection, repair, servicing or maintenance of a vehicle in the course of the business.\nNothing in this section shall impair or limit tort liability or limit the damages recoverable from any person for negligent acts or omissions other than those committed in the operation, ownership, maintenance, or use of a motor vehicle.",
	"repealed": false
}