{
	"id": "480.2415",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.2415",
	"title": "480.2415 STATE BOARD OF CIVIL LEGAL AID.",
	"text": "(a) The State Board of Civil Legal Aid is a part of but is not subject to the administrative control of the judicial branch of government.\n(b) The board shall consist of 11 members as follows:\n(1) six members appointed by the supreme court; and\n(2) five members appointed by the governor.\n(c) All candidates shall have demonstrated a commitment in maintaining high-quality civil legal services to people of low or moderate means. The appointing entities shall seek board members who reflect the diverse populations served by civil legal aid through attorney and nonattorney members.\n(d) The appointing entities may not appoint an active judge to be a member of the board, but may appoint a retired judge. The appointing entities may not appoint a person who is closely affiliated with any entity awarded funding pursuant to section 480.242 or any entity seeking funding pursuant to section 480.242. The board may set term limits for board members. An appointing authority may not make an appointment that exceeds the term limits established by the board.\n(e) The terms, compensation, and removal of board members shall be as provided in section 15.0575, except that the board may establish a per diem in excess of the amount provided in law. The members shall elect the chair from among the membership for a term of two years.\n(a) The State Board of Civil Legal Aid shall work to ensure access to high-quality civil legal services in every Minnesota county.\n(b) The board shall:\n(1) approve and recommend to the legislature a budget for the board and the civil legal services grants distributed subject to section 480.242;\n(2) establish procedures for distribution of funding under section 480.242; and\n(3) establish civil program standards, administrative policies, or procedures necessary to ensure quality advocacy for persons unable to afford private counsel.\n(c) The board may propose statutory changes to the legislature and rule changes to the supreme court that are in the best interests of persons unable to afford private counsel.\n(d) The board shall not interfere with the discretion or judgment of civil legal services programs in their advocacy.\nThe State Board of Civil Legal Aid shall appoint a program administrator who serves at the pleasure of the board. The program administrator is not required to be licensed to practice law. The program administrator shall attend all meetings of the board, but may not vote, and shall:\n(1) carry out all administrative functions necessary for the efficient and effective operation of the board and the civil legal aid delivery system, including but not limited to hiring, supervising, and disciplining program staff;\n(2) implement, as necessary, resolutions, standards, rules, regulations, and policies of the board;\n(3) keep the board fully advised as to its financial condition, and prepare and submit to the board the annual program and State Board of Civil Legal Aid budget and other financial information as requested by the board;\n(4) recommend to the board the adoption of rules and regulations necessary for the efficient operation of the board and the civil legal aid program; and\n(5) perform other duties prescribed by the board.\nThe board may contract for administrative support services.\nAccess to records of the State Board of Civil Legal Aid is subject to the Rules of Public Access for Records of the Judicial Branch, excluding the appeals process in rule 9. Pursuant to section 13.90, the board is not subject to chapter 13.",
	"repealed": false
}