{
	"id": "72B.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.091",
	"title": "72B.091 DAMAGE APPRAISALS; ADJUSTMENTS; DUTIES OF APPRAISERS, ADJUSTERS, AND INSURERS.",
	"text": "Each appraiser while engaged in appraisal duties shall carry appraiser identification and shall display it upon request to an owner whose vehicle is being inspected, to the repair shop representative involved, or to any commissioner of commerce's representative.\nThe appraiser shall provide one legible copy of the appraisal to the vehicle owner and one legible copy of the appraisal to the repair shop designated by the owner if requested by the repair shop. The motor vehicle repair shop shall provide the vehicle owner and the insurance company or companies involved in the loss one legible copy of the appraisal. This appraisal shall include an itemized listing of those parts to be repaired and those parts to be replaced by new, used, rebuilt, reconditioned or replated parts. The appraisal shall contain the name of the insurance company ordering it, if any, the insurance company's address and telephone number, its file number, the appraiser's name, telephone number, and the proper identification of the vehicle being inspected. The appraisal shall indicate all significant old and unrelated damages and shall include an itemized listing of all damages, specifying those parts to be repaired and those parts to be replaced by new, used, rebuilt, reconditioned, or replated parts. The appraisal must disclose to the vehicle owner any parts to be used, other than window glass, which are not original equipment parts or which are not covered by the manufacturer's warranty on such parts.\nNo appraiser, adjuster, or that person's employer shall require that repairs be made in any specified repair facility.\nEach appraiser shall promptly reinspect damaged vehicles when supplementary allowances are requested by the repair shop or when the amount or extent of damages is in dispute. Reinspection of any damage on a damaged vehicle may be waived if authorized by the insurer by any oral or written communication.\nNo appraiser or adjuster for personal gain shall receive or trade in auto salvage if the salvage is obtained as a result of that person's appraisals.",
	"repealed": false
}