{
	"id": "62L.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.03",
	"title": "62L.03 AVAILABILITY OF COVERAGE.",
	"text": "(a) Every health carrier shall, as a condition of authority to transact business in this state in the small employer market, affirmatively market, offer, sell, issue, and renew any of its health benefit plans, on a guaranteed issue basis, to any small employer, including a small employer covered by paragraph (b), that meets the participation and contribution requirements of subdivision 3, as provided in this chapter.\n(b) A small employer that no longer meets the definition of small employer because of a reduction in workforce may continue coverage as a small employer for 12 months from the date the group is reduced to one employee.\n(c) Notwithstanding paragraph (a), a health carrier may, at the time of coverage renewal, modify the health coverage for a product offered in the small employer market if the modification is consistent with state law, approved by the commissioner, and effective on a uniform basis for all small employers purchasing that product other than through a qualified association in compliance with section 62L.045, subdivision 2.\n(d) A health carrier may cease to transact business in the small employer market as provided under section 62L.09.\n(a) No health maintenance organization is required to offer coverage or accept applications under subdivision 1 in the case of the following:\n(1) with respect to a small employer, where the small employer does not have eligible employees who work or reside in the health maintenance organization's approved service areas; or\n(2) with respect to an employee, when the employee does not work or reside within the health maintenance organization's approved service areas.\n(b) A health carrier participating in the small employer market shall not be required to offer coverage or accept applications pursuant to subdivision 1 where the commissioner finds that the acceptance of an application or applications would place the health carrier participating in the small employer market in a financially impaired condition, provided, however, that a health carrier participating in the small employer market that has not offered coverage or accepted applications pursuant to this paragraph shall not offer coverage or accept applications for any health benefit plan until 180 days following a determination by the commissioner that the health carrier is not financially impaired and that offering coverage or accepting applications under subdivision 1 would not cause the health carrier to become financially impaired.\n(a) A small employer that has at least 75 percent of its eligible employees who have not waived coverage participating in a health benefit plan and that contributes at least 50 percent toward the cost of coverage of each eligible employee must be guaranteed coverage on a guaranteed issue basis from any health carrier participating in the small employer market. The participation level of eligible employees must be determined at the initial offering of coverage and at the renewal date of coverage. A health carrier must not increase the participation requirements applicable to a small employer at any time after the small employer has been accepted for coverage. For the purposes of this subdivision, waiver of coverage includes only waivers due to: (1) coverage under another group health plan; (2) coverage under Medicare Parts A and B; or (3) coverage under medical assistance under chapter 256B.\n(b) If a small employer does not satisfy the contribution or participation requirements under this subdivision, a health carrier may voluntarily issue or renew individual health plans, or a health benefit plan which must fully comply with this chapter. A health carrier that provides a health benefit plan to a small employer that does not meet the contribution or participation requirements of this subdivision must maintain this information in its files for audit by the commissioner. A health carrier may not offer an individual health plan, purchased through an arrangement between the employer and the health carrier, to any employee unless the health carrier also offers the individual health plan, on a guaranteed issue basis, to all other employees of the same employer. An arrangement permitted under section 62L.12, subdivision 2, paragraph (l), is not an arrangement between the employer and the health carrier for purposes of this paragraph.\n(c) Nothing in this section obligates a health carrier to issue coverage to a small employer that currently offers coverage through a health benefit plan from another health carrier, unless the new coverage will replace the existing coverage and not serve as one of two or more health benefit plans offered by the employer. This paragraph does not apply if the small employer will meet the required participation level with respect to the new coverage.\n(d) If a small employer cannot meet either the participation or contribution requirement, the small employer may purchase coverage only during an open enrollment period each year between November 15 and December 15.\nHealth carriers may collect information relating to the case characteristics and demographic composition of small employers, as well as health status and health history information about employees, and dependents of employees, of small employers.\n(a) No health carrier shall cancel, decline to issue, or fail to renew a health benefit plan as a result of the claim experience or health status of the persons covered or to be covered by the health benefit plan. For purposes of this subdivision, a failure to renew does not include a uniform modification of coverage at time of renewal, as described in subdivision 1.\n(b) A health carrier may cancel or fail to renew a health benefit plan:\n(1) for nonpayment of the required premium;\n(2) for fraud or misrepresentation by the small employer with respect to eligibility for coverage or any other material fact;\n(3) if the employer fails to comply with the minimum contribution percentage required under subdivision 3; or\n(4) for any other reasons or grounds expressly permitted by the respective licensing laws and regulations governing a health carrier, including, but not limited to, service area restrictions imposed on health maintenance organizations under section 62D.03, subdivision 4, paragraph (m), to the extent that these grounds are not expressly inconsistent with this chapter.\n(c) A health carrier may fail to renew a health benefit plan:\n(1) if eligible employee participation during the preceding calendar year declines to less than 75 percent, subject to the waiver of coverage provision in subdivision 3;\n(2) if the health carrier ceases to do business in the small employer market under section 62L.09; or\n(3) if a failure to renew is based upon the health carrier's decision to discontinue the health benefit plan form previously issued to the small employer, but only if the health carrier permits each small employer covered under the prior form to switch to its choice of any other health benefit plan offered by the health carrier, without any underwriting restrictions that would not have been permitted for renewal purposes.\n(d) A health carrier need not renew a health benefit plan, and shall not renew a small employer plan, if an employer ceases to qualify as a small employer as defined in section 62L.02, except as provided in subdivision 1, paragraph (b). If a health benefit plan, other than a small employer plan, provides terms of renewal that do not exclude an employer that is no longer a small employer, the health benefit plan may be renewed according to its own terms. If a health carrier issues or renews a health plan to an employer that is no longer a small employer, without interruption of coverage, the health plan is subject to section 60A.082.\n(e) A health carrier may cancel or fail to renew the coverage of an individual employee or dependent under a health benefit plan for fraud or misrepresentation by the eligible employee or dependent with respect to eligibility for coverage or any other material fact.\nHealth carriers shall offer coverage to any eligible employee or dependent enrolled in MCHA at the time of the health carrier's issuance or renewal of a health benefit plan to a small employer. The health benefit plan must require that the employer permit MCHA enrollees to enroll in the small employer's health benefit plan as of the first date of renewal of a health benefit plan occurring on or after July 1, 1993, and as of each date of renewal after that, or, in the case of a new group, as of the initial effective date of the health benefit plan and as of each date of renewal after that. Health carriers must not impose any underwriting restrictions, including any preexisting condition limitations or exclusions, on any eligible employee or dependent previously enrolled in MCHA and transferred to a health benefit plan.",
	"repealed": false
}