{
	"id": "260E.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.055",
	"title": "260E.055 DUTY TO REPORT; PRIVATE OR PUBLIC YOUTH RECREATION PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Abuse\" means egregious harm, physical abuse, sexual abuse, substantial child endangerment, or threatened injury as these terms are defined under section 260E.03.\n(c) \"Adverse action\" includes but is not limited to:\n(1) discharge, suspension, termination, or transfer from the private or public youth recreation program;\n(2) discharge from or termination of employment;\n(3) demotion or reduction in remuneration for services; or\n(4) restriction or prohibition of access to the private or public youth recreation program or persons affiliated with it.\n(d) \"Employee\" means a person who is 18 years of age or older who performs services for hire for an employer and has full-time, part-time, or short-term responsibilities for the care of the child including but not limited to day care, counseling, teaching, and coaching. An employee does not include an independent contractor or volunteer.\n(e) \"Municipality\" has the meaning given in section 466.01, subdivision 1.\n(f) \"Private or public youth recreation program\" includes but is not limited to day camps or programs involving athletics, theater, arts, religious education, outdoor education, youth empowerment, or socialization.\n(a) An employee or supervisor of a private or public youth recreation program shall immediately report information to the local welfare agency, agency responsible for assessing or investigating the report, police department, county sheriff, Tribal social services agency, or Tribal police department if:\n(1) the employee or supervisor knows or has reason to believe that another employee or supervisor is abusing or has abused a child within the preceding three years; or\n(2) a child discloses to the employee or supervisor that the child is being abused or has been abused within the preceding three years.\n(b) An oral report shall be made immediately by telephone or otherwise. An oral report shall be followed within 72 hours, exclusive of weekends and holidays, by a report in writing. Any report shall be of sufficient content to identify the child, any person believed to be responsible for the abuse of the child, the nature and extent of the abuse, and the name and address of the reporter. The agency receiving the report shall accept a report notwithstanding refusal by a reporter to provide the reporter's name or address if the report is otherwise sufficient under this paragraph.\n(a) An employer of any person required to make a report under this section shall not retaliate against the person for reporting in good faith, or against a child with respect to whom a report is made, because of the report.\n(b) The employer of any person required to report under this section who retaliates against the person because of a report under this section is liable to that person for actual damages and, in addition, a penalty of up to $10,000.\n(c) There shall be a rebuttable presumption that any adverse action taken within 90 days of a report is retaliatory.\n(a) The following persons are immune from civil or criminal liability if the person is acting in good faith:\n(1) an employee or supervisor who reports pursuant to this section or, following the submission of a report, cooperates with an assessment or investigation under this chapter; and\n(2) a municipality or private entity providing a private or public youth recreation program that provides training on making a report under this section, assists in making a report under this section, or following the submission of a report, cooperates with an investigation or assessment under this chapter.\n(b) This subdivision does not provide immunity to any person for failure to make a required report or for committing abuse.\n(a) A person who is required to report under this section but fails to report is guilty of a petty misdemeanor.\n(b) Section 260E.08, paragraph (d), applies to reports made under this section.\nAs used in this section, \"reports\" does not include mandated or voluntary reports under section 260E.06 and nothing in this section shall govern reports made pursuant to section 260E.06.",
	"repealed": false
}