{
	"id": "169.686",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.686",
	"title": "169.686 SEAT BELT USE REQUIRED; PENALTY.",
	"text": "(a) Except as provided in section 169.685, a properly adjusted and fastened seat belt, including both the shoulder and lap belt when the vehicle is so equipped, shall be worn by the driver and passengers of a passenger vehicle, commercial motor vehicle, type III vehicle, and type III Head Start vehicle. Notwithstanding the equipment exemption in section 169.685, subdivision 1, this paragraph applies to the driver and passengers of an autocycle equipped with seat belts.\n(b) A person who is 15 years of age or older and who violates paragraph (a) is subject to a fine of $25. The driver of the vehicle in which a violation occurs is subject to a $25 fine for each violation of paragraph (a) by the driver or by a passenger under the age of 15, but the court may not impose more than one surcharge under section 357.021, subdivision 6, on the driver. The Department of Public Safety shall not record a violation of this subdivision on a person's driving record.\n(c) The driver of a bus is not subject to the fine under paragraph (b) for a violation of paragraph (a) by a passenger under the age of 15. This paragraph does not apply to (1) a school bus, including a type III vehicle; and (2) a Head Start bus, including a type III Head Start vehicle.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Passenger vehicle\" means:\n(1) a passenger automobile defined in section 168.002, subdivision 24;\n(2) a pickup truck;\n(3) a van;\n(4) a commuter van, as defined in section 168.126; and\n(5) a recreational vehicle, as defined in section 168.002, subdivision 27.\n(c) \"Passenger vehicle\" does not include a motorcycle, motorized bicycle, bus, school bus, a vehicle designed to operate exclusively on railroad tracks, a farm truck as defined in section 168.002, subdivision 8, or special mobile equipment as defined in section 168.002, subdivision 31.\n(d) \"Pickup truck\" means a truck, regardless of manufacturer's nominal rated carrying capacity, that is commonly known as a pickup truck.\n(e) \"Van\" means a vehicle, regardless of the manufacturer's nominal rated carrying capacity, of a box-like design that (1) has no barrier or separation between the operator's area and the remainder of the cargo-carrying area, or (2) is designed to carry 15 or fewer passengers, including the driver.\nThis section shall not apply to:\n(1) a person driving a passenger vehicle in reverse;\n(2) a person riding in a vehicle in which all the seating positions equipped with safety belts are occupied by other persons in safety belts;\n(3) a person who is in possession of a written certificate from a licensed physician verifying that because of medical unfitness or physical disability the person is unable to wear a seat belt;\n(4) a person who is actually engaged in work that requires the person to alight from and reenter a motor vehicle at frequent intervals and who, while engaged in that work, does not drive or travel in that vehicle at a speed exceeding 25 miles per hour;\n(5) a rural mail carrier of the United States Postal Service or a newspaper delivery person while in the performance of duties;\n(6) a person driving or riding in a passenger vehicle manufactured before January 1, 1965; and\n(7) a person driving or riding in a pickup truck while engaged in normal farming work or activity.\nThe fines collected for a violation of subdivision 1 must be deposited in the state treasury and credited to a special account to be known as the emergency medical services relief account. Ninety percent of the money in the account shall be distributed to the eight regional emergency medical services systems designated by the director of the Office of Emergency Medical Services under section 144E.50, for personnel education and training, equipment and vehicle purchases, and operational expenses of emergency life support transportation services. The board of directors of each emergency medical services region shall establish criteria for funding. Ten percent of the money in the account shall be distributed to the commissioner of public safety for the expenses of traffic safety educational programs conducted by State Patrol troopers.",
	"repealed": false
}