{
	"id": "302A.413",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.413",
	"title": "302A.413 PREEMPTIVE RIGHTS.",
	"text": "Unless denied or limited in the articles or by the board pursuant to section 302A.401, subdivision 2, clause (b), a shareholder of a corporation has the preemptive rights provided in this section.\nA preemptive right is the right of a shareholder to acquire a certain fraction of the unissued securities or rights to purchase securities of a corporation before the corporation may offer them to other persons.\nA shareholder has a preemptive right whenever the corporation proposes to issue new or additional shares or rights to purchase shares of the same series as the series held by the shareholder or, if a class of shares has no series, the same class as the class held by the shareholder, or new or additional securities other than shares, or rights to purchase securities other than shares, that are exchangeable for, convertible into, or carry a right to acquire new or additional shares of the same series as the series held by the shareholder or, if a class of shares has no series, the same class as the class held by the shareholder.\nUnless otherwise provided in the articles, a shareholder does not have a preemptive right pursuant to this section to acquire securities or rights to purchase securities that are:\n(a) issued for a consideration other than money;\n(b) issued pursuant to a plan of merger or exchange;\n(c) issued pursuant to an employee or incentive benefit plan approved at a meeting by the affirmative vote of the holders of a majority of the voting power of all shares entitled to vote;\n(d) issued upon exercise of previously issued rights to purchase securities of the corporation;\n(e) issued pursuant to a public offering of the corporation's securities or rights to purchase securities. For purposes of this clause, \"public offering\" means an offering of the corporation's securities or rights to purchase securities if the resale or other distribution of those securities or rights to purchase securities is not restricted by either state or federal securities laws; or\n(f) issued pursuant to a plan of reorganization approved by a court of competent jurisdiction pursuant to a statute of this state or of the United States.\nThe fraction of the new issue that each shareholder may acquire by exercise of a preemptive right is the ratio that the number of shares of that class or series owned by the shareholder before the new issue bears to the total number of shares of that class or series issued and outstanding before the new issue.\nA shareholder may waive a preemptive right in writing. The waiver is binding upon the shareholder whether or not consideration has been given for the waiver. Unless otherwise provided in the waiver, a waiver of preemptive rights is effective only for the proposed issuance described in the waiver.\nWhen proposing the issuance of securities with respect to which shareholders have preemptive rights under this section, the board shall cause notice to be given to each shareholder entitled to preemptive rights. The notice shall be given at least ten days before the date by which the shareholder must exercise a preemptive right and shall contain:\n(a) the number or amount of securities with respect to which the shareholder has a preemptive right, and the method used to determine that number or amount;\n(b) the price and other terms and conditions upon which the shareholder may purchase them; and\n(c) the time within which and the method by which the shareholder must exercise the right.\nSecurities that are subject to preemptive rights but not acquired by shareholders in the exercise of those rights may, for a period not exceeding one year after the date fixed by the board for the exercise of those preemptive rights, be issued to persons the board determines, at a price not less than, and on terms no more favorable to the purchaser than, those offered to the shareholders. Securities that are not issued during that one year period shall, at the expiration of the period, again become subject to preemptive rights of shareholders.\nIf the shareholders of a corporation are entitled to cumulative voting in the election of directors, no amendment to the articles which has the effect of denying, limiting, or modifying the preemptive rights provided in this section shall be adopted if the votes of a proportion of the voting power sufficient to elect a director at an election of the entire board under cumulative voting are cast against the amendment.\nA denial or limitation of preemptive rights otherwise provided in this section does not limit the power of a corporation to grant first refusal rights or other rights to purchase from the corporation shares or other securities of the corporation to shareholders, subscribers, or other persons before they are offered to, or acquired by, any other person.",
	"repealed": false
}