{
	"id": "450.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/450.20",
	"title": "450.20 ART COMMISSION; WORK OF ART.",
	"text": "The council of any city of the first class may establish by ordinance a city art commission of five resident members to be appointed by the mayor, one each from lists of three persons each presented to the mayor as follows: One by the oldest incorporated society of fine arts or other similar body of the city, one by the library board thereof, and one by the park board. The other two shall be selected, one from the resident painters, sculptors, and architects, and one from the citizens generally. If any list be not submitted within 30 days after request so to do, the mayor shall appoint without the recommendation. The terms of members shall begin January 1 next after appointment. The first board shall serve for one, two, three, four, and five years, respectively, as designated by the mayor, and thereafter the term of each shall be five years, and until a successor qualifies. Vacancies shall be filled for the unexpired terms by like appointments. After the commission is established, the city shall acquire no work of art, nor shall any such work be placed in any public place therein, unless the design and location thereof be approved by such commission; neither shall any work of art possessed by the city be removed, replaced, or altered without the approval of the commission. The mayor or council may request the commission to pass upon the design of any municipal building, bridge, approach, gate, fence, lamp, or other structure to be erected upon any public ground of the city, and upon any proposed grading, platting, or laying out of public grounds or ways; and in these cases the decisions of the commission shall be binding, and shall be obeyed. If the commission shall fail to decide upon any matter within 60 days after such request, its decision may be dispensed with and in cases of emergency the mayor or council may prescribe a shorter time. The term \"work of art,\" as used herein, shall embrace all paintings, mural decorations, stained glass, statues, bas-reliefs or other sculptures, monuments, fountains, arches, gates, and other permanent structures for ornament or commemoration. Nothing herein shall apply to any building or grounds owned by the state or require any library or park board to accept any work of art to be displayed upon property under its control.",
	"repealed": false
}