{
	"id": "62J.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.60",
	"title": "62J.60 MINNESOTA UNIFORM HEALTH CARE IDENTIFICATION CARD.",
	"text": "All individuals with health care coverage shall be issued Minnesota uniform health care identification cards by group purchasers as of January 1, 1998, unless the requirements of section 62A.01, subdivisions 2 and 3, are met. If a health benefit plan issued by a group purchaser provides coverage for prescription drugs, the group purchaser shall include uniform prescription drug information on the uniform health care identification card issued to its enrollees on or after July 1, 2003. Nothing in this section requires a group purchaser to issue a separate card containing uniform prescription drug information, provided that the Minnesota uniform health care identification card can accommodate the information necessary to process prescription drug claims as required by this section. The Minnesota uniform health care identification cards shall comply with the standards prescribed in this section.\nFor purposes of this section, \"health benefit plan\" means a policy, contract, or certificate offered, sold, issued, or renewed by a group purchaser for the coverage of medical and hospital benefits. A health benefit plan does not include coverage that is:\n(1) limited to disability or income protection coverage;\n(2) automobile or homeowners medical payment coverage;\n(3) liability insurance or supplemental to liability insurance;\n(4) accident-only coverage;\n(5) credit accident and health insurance issued under chapter 62B;\n(6) designed solely to provide dental or vision care;\n(7) designed solely to provide coverage for a specified disease or illness;\n(8) coverage under which benefits are payable with or without regard to fault and that is statutorily required to be contained in any liability insurance policy or equivalent self-insurance; or\n(9) hospital income or indemnity.\n(a) The Minnesota uniform health care identification card must be a preprinted card constructed of plastic, paper, or any other medium that conforms with ANSI and ISO 7810 physical characteristics standards. The card dimensions must also conform to ANSI and ISO 7810 physical characteristics standard. The use of a signature panel is optional. The uniform prescription drug information contained on the card must conform with the format adopted by the NCPDP and, except as provided in subdivision 3, paragraph (a), clause (2), must include all of the fields required to submit a claim in conformance with the most recent pharmacy identification card implementation guide produced by the NCPDP. All information required to submit a prescription drug claim, exclusive of information provided on a prescription that is required by law, must be included on the card in a clear, readable, and understandable manner. If a health benefit plan requires a conditional or situational field, as defined by the NCPDP, the conditional or situational field must conform to the most recent pharmacy information card implementation guide produced by the NCPDP.\n(b) The Minnesota uniform health care identification card must have an essential information window on the front side with the following data elements: card issuer name, electronic transaction routing information, card issuer identification number, cardholder (insured) identification number, and cardholder (insured) identification name. No optional data may be interspersed between these data elements.\n(c) Standardized labels are required next to human readable data elements and must come before the human data elements.\nA new Minnesota uniform health care identification card must be issued to individuals upon enrollment. Except for the medical assistance and MinnesotaCare programs, a new card must be issued upon any change in an individual's health care coverage that impacts the content or format of the data included on the card or no later than 24 months after adoption of any change in the NCPDP implementation guide or successor document that affects the content or format of the data included on the card. Anytime that a card is issued upon enrollment or replaced by the medical assistance or MinnesotaCare program, the card must conform to the adopted NCPDP standards in effect and to the implementation guide in use at the time of issuance. Newly issued cards must conform to the adopted NCPDP standards in effect at the time of issuance and to the implementation guide in use at the time of issuance. Stickers or other methodologies may be used to update cards temporarily.\n(a) The following are the minimum human readable data elements that must be present on the front side of the Minnesota uniform health care identification card:\n(1) card issuer name or logo, which is the name or logo that identifies the card issuer. The card issuer name or logo may be located at the top of the card. No standard label is required for this data element;\n(2) complete electronic transaction routing information including, at a minimum, the international identification number. The standardized label of this data element is \"RxBIN.\" Processor control numbers and group numbers are required if needed to electronically process a prescription drug claim. The standardized label for the process control numbers data element is \"RxPCN\" and the standardized label for the group numbers data element is \"RxGrp,\" except that if the group number data element is a universal element to be used by all health care providers, the standardized label may be \"Grp.\" To conserve vertical space on the card, the international identification number and the processor control number may be printed on the same line;\n(3) cardholder (insured) identification number, which is the unique identification number of the individual cardholder established and defined under this section. The standardized label for the data element is \"ID\";\n(4) cardholder (insured) identification name, which is the name of the individual cardholder. The identification name must be formatted as follows: first name, space, optional middle initial, space, last name, optional space and name suffix. The standardized label for this data element is \"Name\";\n(5) care type, which is the description of the group purchaser's plan product under which the beneficiary is covered. The description shall include the health plan company name and the plan or product name. The standardized label for this data element is \"Care Type\";\n(6) service type, which is the description of coverage provided such as hospital, dental, vision, prescription, or mental health. The standard label for this data element is \"Svc Type\"; and\n(7) provider/clinic name, which is the name of the primary care clinic the cardholder is assigned to by the health plan company. The standard label for this field is \"PCP.\" This information is mandatory only if the health plan company assigns a specific primary care provider to the cardholder.\n(b) The following human readable data elements shall be present on the back side of the Minnesota uniform health care identification card. These elements must be left justified, and no optional data elements may be interspersed between them:\n(1) claims submission names and addresses, which are the names and addresses of the entity or entities to which claims should be submitted. If different destinations are required for different types of claims, this must be labeled;\n(2) telephone numbers and names that pharmacies and other health care providers may call for assistance. These telephone numbers and names are required on the back side of the card only if one of the contacts listed in clause (3) cannot provide pharmacies or other providers with assistance or with the telephone numbers and names of contacts for assistance; and\n(3) telephone numbers and names; which are the telephone numbers and names of the following contacts with a standardized label describing the service function as applicable:\n(i) eligibility and benefit information;\n(ii) utilization review;\n(iii) precertification; or\n(iv) customer services.\n(c) The following human readable data elements are mandatory on the back side of the Minnesota uniform health care identification card for health maintenance organizations:\n(1) emergency care authorization telephone number or instruction on how to receive authorization for emergency care. There is no standard label required for this information; and\n(2) one of the following:\n(i) telephone number to call to appeal to or file a complaint with the commissioner of health; or\n(ii) for persons enrolled under section 256B.69 or 256L.12, the telephone number to call to file a complaint with the ombudsperson designated by the commissioner of human services under section 256B.69 and the address to appeal to the commissioner of human services. There is no standard label required for this information.\n(d) All human readable data elements not required under paragraphs (a) to (c) are optional and may be used at the issuer's discretion.\nThe Minnesota uniform health care identification card may be machine readable or nonmachine readable. If the card is machine readable, the card must contain a magnetic stripe that conforms to ANSI and ISO standards for Tracks 1.\nAs part of an annual filing made with the commissioner of health or commerce on or after January 1, 2003, a group purchaser shall certify compliance with this section and shall submit to the commissioner of health or commerce a copy of the Minnesota uniform health care identification card used by the group purchaser.",
	"repealed": false
}