{
	"id": "60A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.02",
	"title": "60A.02 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms shall, for the purposes of chapters 60A to 72A, 69, 70A and 299F, have the meanings ascribed to them.\n(a) \"Association\" or \"associations\" means an organized body of people who have some interest in common and that has at the onset a minimum of 100 persons; is organized and maintained in good faith for purposes other than that of obtaining insurance; and has a constitution and bylaws which provide that: (1) the association or associations hold regular meetings not less frequently than annually to further purposes of the members; (2) except for credit unions, the association or associations collect dues or solicit contributions from members; (3) the members have voting privileges and representation on the governing board and committees, which provide the members with control of the association including the purchase and administration of insurance products offered to members; and (4) the members are not, within the first 30 days of membership, directly solicited, offered, or sold an insurance policy if the policy is available as an association benefit.\n(b) An association may apply to the commissioner for a waiver of the 30-day waiting period to that association. The commissioner may grant the waiver upon a finding of at least three of the following: (1) the association is in full compliance with this subdivision; (2) sanctions have not been imposed against the association as a result of significant disciplinary action by the commissioner; (3) at least 80 percent of the association's income comes from dues, contributions, or sources other than income from the sale of insurance; or (4) the association has been organized and maintained for at least ten years.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota and, in the commissioner's absence or disability, a deputy or other person duly designated to act in the commissioner's place.\nAn insurance policy that is issued for a term in excess of one year or that has no specified term or that is designated as being continuous is \"continued\" each year on the anniversary date of the issuance of the policy.\nIn cases where a law requires documents to be filed with the commissioner, the documents will be considered filed when they are received by the Department of Commerce.\n(a) \"Insurance\" is any agreement whereby one party, for a consideration, undertakes to indemnify another to a specified amount against loss or damage from specified causes, or to do some act of value to the assured in case of such loss or damage. A program of self-insurance, self-insurance revolving fund or pool established under section 471.981 is not insurance for purposes of this subdivision.\n(b) [Expired]\n\"Company\" or \"insurance company\" includes every insurer, corporation, business trust, or association engaged in insurance as principal, but for purposes of this subdivision does not include a political subdivision providing self-insurance or establishing a pool under section 471.981, subdivision 3.\n\"Mutual property and casualty insurance company\" includes a property and casualty insurance company that was converted to a stock company after December 31, 1987, and before January 1, 1994, if the company was controlled on the date of conversion by a mutual life insurance company and so long as the company continues to be controlled by a mutual life insurance company.\n\"Domestic\" shall designate those companies incorporated or organized in this state.\n\"Foreign,\" when used without limitations, shall designate those companies incorporated or organized in any other state or country.\nAn \"insurance agent\" or \"insurance agency\" is an insurance producer licensed under sections 60K.30 to 60K.56 acting under express authority from, and an appointment by, an insurer and on its behalf to solicit insurance, or to appoint other insurance producers to solicit insurance, or to write and countersign policies of insurance, or to collect premiums therefor within this state, or to exercise any or all these powers when so authorized by the insurer. The term \"person\" includes a natural person, a partnership, a corporation, or other entity, including an insurance agency.\n[Repealed, 1981 c 307 s 22]\n\"Net assets\" means that portion of the excess of the entire assets of an insurance company over its entire liabilities, exclusive of capital, and inclusive of policy liability, available for the payment of its obligations, including capital stock in this state and including as assets deferred premiums on policies written within three months and actually in force; and, in the case of a mutual marine or fire and marine company, its subscription funds and premium notes not more than 30 days past due and uncollected. In the case of a mutual fire insurance company, there shall be included as assets premium notes absolutely payable within six months from date and given for policies actually in force, when such notes are not more than 30 days overdue. Unpaid guaranty fund subscriptions shall not be included as assets, and guaranty fund certificates upon which there is no liability of the company until all of its other obligations and liabilities are paid shall not be included as a liability.\n\"Earned premiums\" includes gross premiums charged on all policies written, including all determined excess and additional premiums, less return premiums, other than premiums returned to policyholders as dividends, and less reinsurance premiums and premiums on policies canceled, and less unearned premiums on policies in force. Any participating company which has charged in its premiums a loading solely for dividends shall not be required to include such loading in its earned premiums; provided, a statement of the amount of such loading has been filed and approved by the commissioner.\n\"Unearned premiums,\" \"insurance reserve,\" \"net value policies,\" and \"premium reserve\" severally refer to the liability of an insurance company upon its insurance contracts other than accrued claims computed by rules on valuation herein established.\n\"Profits\" of a mutual insurance company means that portion of its net earnings not required for payment of losses and expenses, nor set apart for any lawful purposes.\nThe terms \"loss payments\" and \"loss expense payments\" include all payments to claimants, including payments for medical and surgical attendance, legal expense, salaries and expenses of investigators, adjusters, and field representatives, rents, stationery, telegraph and telephone charges, postage, salaries and expenses of office employees, home office expenses, and all other payments made on account of claims, whether such payments shall be allocated to specific claims or unallocated.\nThe term \"compensation\" relates to all insurance effected by virtue of statutes providing compensation to employees for personal injuries irrespective of fault of the employer.\nThe term \"liability\" relates to all insurance, except compensation insurance, against loss or damage from accident to or injuries suffered by an employee or other person and for which the insured is liable.\n\"Department of Commerce\" of the state of Minnesota also means Department of Commerce or commissioner of commerce.\nThe term \"leasehold estate\" means an estate in land which includes the ground lease covering the land and any improvements thereon.\n\"State\" means any state of the United States of America, the District of Columbia, the Commonwealth of Puerto Rico and any other possessions of the United States.\n\"Alien\" means an insurer domiciled outside of the United States, but conducting business within the United States.\n\"Assume\" means to accept all or part of a ceding company's insurance or reinsurance on a risk or exposure.\n\"Cede\" means to pass on to another insurer all or part of the insurance written by an insurer for the purpose of reducing the possible liability of the insurer.\n\"Cession\" means the unit of insurance passed to a reinsurer by an insurer which issued a policy to the insured.\n\"Facultative reinsurance\" means the reinsurance of part or all of the insurance provided by a single policy, with separate negotiation for each cession.\n\"Reinsurer\" means an insurer which assumes the liability of another insurer through reinsurance.\n\"Retrocession\" means a transaction in which a reinsurer cedes to another reinsurer all or part of the reinsurance that the reinsurer had previously assumed.\n\"United States branch\" means the business unit through which business is transacted within the United States by an alien insurer.\n\"Admitted assets\" means the assets as shown by the company's annual statement on December 31 valued according to valuation regulations prescribed by the National Association of Insurance Commissioners and procedures adopted by the National Association of Insurance Commissioners' financial condition Ex 4 subcommittee if not addressed in another section, unless the commissioner requires or finds another method of valuation reasonable under the circumstances.\n\"Group insurance\" means that form of insurance coverage sponsored by:\n(1) an employer covering not less than two employees and which may include the employees' dependents, consisting of spouses, children, and actual dependents residing in the household, written under a master policy issued to any employer, or group of employers who have joined into an arrangement for the purposes of providing the employees insurance for their individual benefit. Employees' dependents, consisting of spouses, children, and actual dependents residing in the same household, are not employees for purposes of this definition except for a spouse employed on a regular full-time basis by the same employer. This clause does not apply to chapter 62L;\n(2) an association to provide insurance to its members; or\n(3) a creditor to provide life insurance to insure its debtors in connection with real estate mortgage loans, in an amount not to exceed the actual or scheduled amount of their indebtedness.\n\"Multiple employer trust\" means a trust organized for the benefit of two or more employers for the purpose of providing health insurance coverage to employees and dependents.",
	"repealed": false
}