{
	"id": "13.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.321",
	"title": "13.321 PREKINDERGARTEN TO GRADE 12 EDUCATIONAL DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 10 are codified outside this chapter. Those sections classify prekindergarten to grade 12 educational data as other than public, place restrictions on access to government data, or involve data sharing.\nData sharing involving the statewide testing and reporting system is governed by sections 120B.305, subdivision 3, and 120B.31, subdivision 4.\nCertain school accountability data are governed by sections 120B.35, subdivision 3, and 120B.36, subdivisions 1, paragraph (e), and 2.\nAccess to disposition orders received by schools is governed by section 121A.75.\n(a) Immunization data. Data sharing involving immunization records is governed by section 121A.15, subdivision 7.\n(b) Developmental screening. Data collected in early childhood developmental screening programs are classified under section 142D.092.\n(c) Exclusions and expulsions. Data sharing involving exclusions and expulsions is classified under section 121A.53.\nData on certain teacher discharges and resignations reported under section 122A.20 are classified under that section.\nData involving energy efficiency project contracts are governed by section 123B.65, subdivision 10.\nData sharing related to the performance tracking system is governed by section 124D.52.\n(a) Third-party payment. Disclosure of student data to health plan companies is governed by section 125A.21, subdivision 7.\n(b) Agency access. Agency access to data about a child with a disability is governed by section 125A.23.\n(c) Interagency early intervention committees. Data sharing involving interagency early intervention committees is governed by sections 125A.027, subdivision 1, and 125A.30.\nData collected on enrollment forms to allow students to self-identify as military-connected youth are governed by section 127A.852.\nData involving the High School League are governed by section 128C.17.\nData on individual teachers generated from a value-added assessment model are governed under section 120B.35.\nData practices governing comprehensive achievement and civic readiness under section 120B.11 and student progress data under section 120B.35 are governed by section 120B.36, subdivision 2.\nData involving the Department of Education's Office of the Inspector General are governed by section 127A.21.",
	"repealed": false
}