{
	"id": "14.386",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.386",
	"title": "14.386 PROCEDURE FOR ADOPTING EXEMPT RULES; DURATION.",
	"text": "(a) A rule adopted, amended, or repealed by an agency, under a statute enacted after January 1, 1997, authorizing or requiring rules to be adopted but excluded from the rulemaking provisions of chapter 14 or from the definition of a rule, has the force and effect of law only if:\n(1) the revisor of statutes approves the form of the rule by certificate;\n(2) the person authorized to adopt the rule on behalf of the agency signs an order adopting the rule;\n(3) the Office of Administrative Hearings approves the rule as to its legality within 14 days after the agency submits it for approval and files an electronic copy of the adopted rule with the revisor's certificate in the Office of the Secretary of State; and\n(4) a copy is published by the agency in the State Register.\nThe secretary of state shall forward one copy of the rule to the governor.\nA statute enacted after January 1, 1997, authorizing or requiring rules to be adopted but excluded from the rulemaking provisions of chapter 14 or from the definition of a rule does not excuse compliance with this section unless it makes specific reference to this section.\n(b) A rule adopted under this section is effective for a period of two years from the date of publication of the rule in the State Register. The authority for the rule expires at the end of this two-year period.\n(c) The chief administrative law judge shall adopt rules relating to the rule approval duties imposed by this section and section 14.388, including rules establishing standards for review.\n(d) This section does not apply to:\n(1) any group or rule listed in section 14.03, subdivisions 1 and 3, except as otherwise provided by law;\n(2) game and fish rules of the commissioner of natural resources adopted under section 84.027, subdivision 13, or sections 97A.0451 to 97A.0459;\n(3) experimental and special management waters designated by the commissioner of natural resources under sections 97C.001 and 97C.005;\n(4) game refuges designated by the commissioner of natural resources under section 97A.085; or\n(5) transaction fees established by the commissioner of natural resources for electronic or telephone sales of licenses, stamps, permits, registrations, or transfers under section 84.027, subdivision 15, paragraph (a), clause (2).\n(e) If a statute provides that a rule is exempt from chapter 14, and section 14.386 does not apply to the rule, the rule has the force of law unless the context of the statute delegating the rulemaking authority makes clear that the rule does not have force of law.",
	"repealed": false
}