{
	"id": "325E.319",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.319",
	"title": "325E.319 WIRELESS COMMUNICATIONS DEVICES; ACQUISITION FOR RESALE.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"CMRS provider\" means a provider of commercial radio service, as defined in United States Code, title 47, section 332, and includes its authorized dealers.\n(c) \"Internet marketplace\" or \"online platform\" means a digitally accessible platform that facilitates commercial transactions between buyers and community-rated sellers where the operator or the platform does not take possession of, or title to, the goods bought or sold.\n(d) \"Law enforcement agency\" or \"agency\" means a duly authorized municipal, county, campus, transit, park, state, or federal law enforcement agency.\n(e) \"Repair and refurbishment program\" means a program, offered by a CMRS provider, manufacturer, or retailer who is not primarily engaged in purchasing personal property of any type from a person who is not a wholesaler, through which used or previously owned wireless communications devices are restored to good working order.\n(f) \"Trade-in program\" means a program offered by a CMRS provider, manufacturer, or retailer who is not primarily engaged in purchasing personal property of any type from a person who is not a wholesaler, pursuant to which used wireless communications devices are accepted from customers in exchange for either (1) a noncash credit usable only for the purchase of goods or services from the CMRS provider, manufacturer, or retailer, or (2) a rebate from a manufacturer on the purchase of one of the manufacturer's wireless communications devices.\n(g) \"Wireless communications device dealer\" or \"dealer\" means an individual, partnership, limited partnership, limited liability company, corporation, or other entity engaged in the business of buying or selling used wireless communications devices.\n(h) \"Wireless communications device\" has the meaning given in section 169.011, subdivision 94.\n(i) \"Wireless communications device manufacturer\" or \"manufacturer\" means an individual, partnership, limited partnership, limited liability company, corporation, or other entity engaged in the business of manufacturing wireless communications devices.\n(a) Every wireless communications device dealer, including an agent, employee, or representative of the dealer, but not an Internet marketplace, shall keep a written record at the time of each purchase or acquisition of a used wireless communications device for resale. The record must include the following and may be kept in electronic form:\n(1) an accurate account or description of the wireless communications device purchased or acquired;\n(2) the date, time, and place or the online platform the wireless communications device was purchased or acquired;\n(3) the name and address of the person selling or delivering the wireless communications device;\n(4) the number of the check or electronic transfer used to purchase the wireless communications device;\n(5) the number of the seller's driver's license, Minnesota identification card number, or other identification number from an identification document issued by any state, federal, or foreign government if the document includes the person's photograph, full name, birth date, and signature; and\n(6) a statement signed by the seller, under penalty of perjury as provided in section 609.48, attesting that the wireless communications device is not stolen and is free of any liens or encumbrances and the seller has the right to sell it.\n(b) Records required to be maintained under this subdivision shall be retained by the wireless communications device dealer for a period of three years.\n(c) The record, as well as the wireless communications device purchased or received, shall at all reasonable times be available for inspection by any law enforcement agency.\n(d) No record is required for wireless communications devices purchased from merchants, manufacturers, or wholesale dealers having an established place of business, but a bill of sale or other evidence of open or legitimate purchase of the wireless communications device shall be obtained and kept by the wireless communications device dealer, which must be shown upon demand to any law enforcement agency.\n(e) Except as otherwise provided in this section, a wireless communications device dealer or the dealer's agent, employee, or representative may not disclose personal information received pursuant to paragraph (a) concerning a customer without the customer's consent unless the disclosure is made in response to a request from a law enforcement agency. A wireless communications device dealer must implement reasonable safeguards to protect the security of the personal information and prevent unauthorized access to or disclosure of the information. For purposes of this paragraph, \"personal information\" is any individually identifiable information gathered in connection with a record under paragraph (a).\nA wireless communications device dealer, including an agent, employee, or representative of the dealer, shall not:\n(1) make any false entry in the records of transactions involving a used wireless communications device;\n(2) falsify, obliterate, destroy, or remove from the place of business the records, books, or accounts relating to used wireless communications device transactions;\n(3) refuse to allow the appropriate law enforcement agency to inspect records or any used wireless communications device in the dealer's possession during the ordinary hours of business or other times acceptable to both parties;\n(4) fail to maintain a record of each used wireless communications device transaction for three years; or\n(5) purchase a used wireless communications device from a person under the age of 18 years.\n(a) A wireless communications device dealer shall pay for purchases of all used wireless communications devices by check mailed to a specific address or by electronic transfer.\n(b) The purchase price may be paid in cash if the wireless communications device dealer uses an automated kiosk that:\n(1) uses a live representative to remotely monitor the automated kiosk during all hours of operation;\n(2) in addition to the requirements of subdivision 6, captures and stores in a manner consistent with subdivision 6 images of (i) the identification required by this section, and (ii) the wireless communications device;\n(3) electronically reports all transactions to law enforcement;\n(4) is located within the physical store of a retailer partner;\n(5) otherwise complies with all requirements of this section; and\n(6) only buys wireless communications devices.\n(c) Local law enforcement may require an automated kiosk to close for repairs if for any reason the kiosk is unable to comply with the requirements of this section.\n(a) Whenever a law enforcement official from any agency has probable cause to believe that a wireless communications device in the possession of a wireless communications device dealer is stolen or is evidence of a crime and notifies the dealer not to sell the item, the dealer shall not (1) process or sell the item, or (2) remove or allow its removal from the premises. This investigative hold must be confirmed in writing by the originating agency within 72 hours and will remain in effect for 30 days from the date of initial notification, until the investigative hold is canceled or renewed, or until a law enforcement notification to confiscate or directive to release is issued, whichever comes first.\n(b) If a wireless communications device is identified as stolen or as evidence in a criminal case, a law enforcement official may:\n(1) physically confiscate and remove the wireless communications device from the wireless communications device dealer, pursuant to a written notification;\n(2) place the wireless communications device on hold or extend the hold under paragraph (a), and leave the device at the premises; or\n(3) direct its release to a registered owner or owner's agent.\n(c) When an item is confiscated, the law enforcement agency doing so shall provide identification upon request of the wireless communications device dealer, and shall provide the name and telephone number of the confiscating agency and investigator, and the case number related to the confiscation.\n(d) A wireless communications device dealer may request seized property be returned in accordance with section 626.04.\n(e) When an investigative hold or notification to confiscate is no longer necessary, the law enforcement official or designee shall notify the wireless communications device dealer.\n(f) A wireless communications device dealer may sell or otherwise dispose of the wireless communications device if:\n(1) a notification to confiscate is not issued during the investigative hold; or\n(2) a law enforcement official does not physically remove the wireless communications device from the premises within 15 calendar days from issuance of a notification to confiscate.\n(g) If a wireless communications device dealer is required to hold the wireless communications device at the direction of law enforcement for purposes of investigation or prosecution, or if the device is seized by law enforcement, the wireless communications device dealer and any other victim is entitled to seek restitution, including any out-of-pocket expenses for storage and lost profit, in any criminal case that may arise from the investigation against the individual who sold the wireless communications device to the wireless communications device dealer.\n(a) Each wireless communications device dealer shall install and maintain at each physical location video surveillance cameras, still digital cameras, or similar devices positioned to record or photograph a frontal view showing a readily identifiable image of the face of each seller of a wireless communications device who enters the physical location.\n(b) The video camera or still digital camera must be kept in operating condition and must be shown upon request to a properly identified law enforcement officer for inspection. The camera must record and display the accurate date and time. The video camera or still digital camera must be turned on at all times when the physical location is open for business and at any other time when wireless communications devices are purchased or sold.\n(c) Recordings and images required by paragraph (a) shall be retained by the wireless communications device dealer for a minimum period of 30 days and shall at all reasonable times be open to the inspection of any properly identified law enforcement officer.\nA wireless communications device dealer, or the agent, employee, or representative of the wireless communications device dealer, who intentionally violates a provision of this section is guilty of a misdemeanor.\n(a) This section does not apply with respect to a wireless communications device returned to the store where it was originally purchased pursuant to the return policies of the wireless communications device dealer, CMRS provider, manufacturer, or retailer.\n(b) This section does not apply with respect to wireless communications devices acquired by a: (1) CMRS provider as part of a trade-in program; (2) manufacturer as part of a trade-in or a repair and refurbishment program; or (3) retailer whose trade-in program: (i) reports records to the Minnesota Automated Property System in an interchange file specification format maintained by the system; (ii) reports to other national or regional transaction reporting database available to law enforcement; or (iii) reports as required by local ordinance.\n(c) This section does not apply to wireless communications device dealers regulated under chapter 325J.",
	"repealed": false
}