{
	"id": "216B.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.022",
	"title": "216B.022 SUBMETERING IN SHARED-METERED RESIDENTIAL BUILDINGS.",
	"text": "(a) For the purposes of this section and sections 216B.023 and 216B.024, the following terms have the meanings given.\n(b) \"Landlord\" has the meaning given in section 504B.001, subdivision 7. Landlord includes a third-party billing agent.\n(c) \"Nonresidential building\" means a building that is not a residential building.\n(d) \"Nonusage charges\" means the total of the charges on the utility bill from a utility provider that represent all nonconsumption-based charges and fees, including but not limited to fixed-meter or service charges, taxes, surcharges, and other fees.\n(e) \"Shared-metered residential building\" means a residential building with multiple separate residential dwelling units where the building's utility service is measured by fewer meters than the number of separate dwelling units in the building. Shared-metered residential building does not include a manufactured home park.\n(f) \"Submeter\" means a meter that (1) is owned or installed by the landlord or by a third-party billing agent or other agent of the landlord, and (2) measures utility service consumed solely within an individual dwelling unit in the shared-metered residential building.\n(g) \"Tenant\" means a person who is occupying a dwelling unit in a shared-metered residential building under a lease or contract, whether oral or written, that requires the payment of money or exchange of services. Tenant includes all other regular occupants of the subject dwelling unit.\n(h) \"Third-party billing agent\" means a person or entity, other than the property owner, that performs one or more utility management services at a shared-metered residential building on behalf of a landlord, including but not limited to installing submeters, reading submeters, or handling utility billing or collections, or both.\n(i) \"Utility provider\" means a public utility, a municipal utility, or a cooperative electric association providing utility service.\n(j) \"Utility service\" means natural gas and electricity.\n(a) A landlord of a shared-metered residential building with installed submeters is subject to the commission's authority under this chapter.\n(b) On or after January 1, 2025, all submeters installed by a landlord to measure utility service must meet standards established by the American National Standards Institute.\n(c) All submeters, regardless of when the submeter was installed, must accurately measure utility service.\nNothing in this chapter grants the commission or a public utility the authority to limit the availability of submetering to a nonresidential building occupant when the building is served by a public utility's master meter which measures the total electric energy delivered to the building.\n(a) If a tenant notifies the landlord in writing that the tenant suspects the submeter is incorrectly registering the tenant's utility service and includes an explanation for the suspicion, the landlord must promptly investigate to determine whether the submeter is inaccurate. If the submeter is inaccurate, the landlord must either repair or replace the submeter or inform the tenant in writing why no corrective action is believed necessary.\n(b) If the inaccurate submeter has resulted in an overcharge, the landlord must promptly refund the difference between what the tenant paid and what the tenant would have paid if the submeter had correctly registered the tenant's utility service.\n(c) If the inaccurate submeter has resulted in an undercharge, the landlord may bill the tenant the difference between what the tenant paid and what the tenant would have paid if the submeter had correctly registered the tenant's utility service for a period not exceeding the previous six months. Any undercharge the landlord seeks to collect must be recovered in accordance with section 216B.023, subdivision 8.\n(d) If a tenant has notified the landlord that the tenant suspects the tenant's submeter is incorrectly registering the tenant's utility service as provided in paragraph (a) and the landlord has failed within a reasonable time to check the submeter and provide the tenant with the results of a meter test demonstrating the submeter is accurate, the landlord is prohibited from recovering from the tenant any undercharge for the period between the date of the tenant's notification and the date the submeter was checked.\nA landlord is prohibited from charging to or collecting from tenants any administrative, capital, or any other expenses associated with the installation, maintenance, repair, replacement, or reading of submeters, unless the expense is due to the tenant's willful, malicious, or negligent conduct. Nothing in this subdivision prevents the landlord from imposing a late payment charge, as provided under section 216B.023, subdivision 6, or an administrative billing charge, as provided under section 216B.023, subdivision 4.",
	"repealed": false
}