{
	"id": "147D.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.29",
	"title": "147D.29 LICENSE RENEWAL CYCLE CONVERSION.",
	"text": "The license renewal cycle for traditional midwife licensees is converted to an annual cycle where renewal is due on the last day of the licensee's month of birth. Conversion pursuant to this section begins January 1, 2020. This section governs license renewal procedures for licensees who were licensed before December 31, 2019. The conversion renewal cycle is the renewal cycle following the first license renewal after January 1, 2020. The conversion license period is the license period for the conversion renewal cycle. The conversion license period is between six and 17 months and ends the last day of the licensee's month of birth in either 2020 or 2021, as described in subdivision 2.\nFor a licensee whose license is current as of December 31, 2019, the licensee's conversion license period begins on January 1, 2020, and ends on the last day of the licensee's month of birth in 2020, except that for licensees whose month of birth is January, February, March, April, May, or June, the licensee's renewal cycle ends on the last day of the licensee's month of birth in 2021.\nThis subdivision applies to an individual who was licensed before December 31, 2019, but whose license is not current as of December 31, 2019. When the individual first renews the license after January 1, 2020, the conversion renewal cycle begins on the date the individual applies for renewal and ends on the last day of the licensee's month of birth in the same year, except that if the last day of the individual's month of birth is less than six months after the date the individual applies for renewal, then the renewal period ends on the last day of the individual's month of birth in the following year.\nAfter the licensee's conversion renewal cycle under subdivision 2 or 3, subsequent renewal cycles are annual and begin on the last day of the month of the licensee's birth.\n(a) A licensee who holds a license issued before January 1, 2020, and who renews that license pursuant to subdivision 2 or 3, shall pay a renewal fee as required in this subdivision.\n(b) A licensee shall be charged the annual license fee listed in section 147D.27 for the conversion license period.\n(c) For a licensee whose conversion license period is six to 11 months, the first annual license fee charged after the conversion license period shall be adjusted to credit the excess fee payment made during the conversion license period. The credit is calculated by: (1) subtracting the number of months of the licensee's conversion license period from 12; and (2) multiplying the result of clause (1) by 1/12 of the annual fee rounded up to the next dollar.\n(d) For a licensee whose conversion license period is 12 months, the first annual license fee charged after the conversion license period shall not be adjusted.\n(e) For a licensee whose conversion license period is 13 to 17 months, the first annual license fee charged after the conversion license period shall be adjusted to add the annual license fee payment for the months that were not included in the annual license fee paid for the conversion license period. The added payment is calculated by: (1) subtracting 12 from the number of months of the licensee's conversion license period; and (2) multiplying the result of clause (1) by 1/12 of the annual fee rounded up to the next dollar.\n(f) For the second and all subsequent license renewals made after the conversion license period, the licensee's annual license fee is as listed in section 147D.27.\nThis section expires July 1, 2022.",
	"repealed": false
}