{
	"id": "326.3384",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.3384",
	"title": "326.3384 PROHIBITED ACTS.",
	"text": "No license holder or employee of a license holder shall, in a manner that implies that the person is an employee or agent of a governmental agency, display on a badge, identification card, emblem, vehicle, uniform, stationery, or in advertising for private detective or protective agent services:\n(1) the words \"public safety,\" \"police,\" \"highway patrol,\" \"state patrol,\" \"sheriff,\" \"trooper,\" or \"law enforcement\"; or\n(2) the name of a municipality, county, state, or of the United States, or any governmental subdivision thereof.\nNo license holder, in the course of providing protective agent services, may provide armed protective personnel to labor disputes or strike locations. This subdivision does not apply to the use of armed security personnel services utilized in the usual course of business for the protection of persons, property, and payroll.\n(a) This subdivision applies to (1) a license holder or an employee of a license holder who is primarily performing the duties of a protective agent; or (2) a security guard who is primarily performing the duties of a security guard.\n(b) A person described in paragraph (a) is prohibited from doing any of the activities described in clauses (1) to (5) during a labor dispute, strike, or lockout as defined in section 179.01, subdivisions 7, 8, and 9:\n(1) inciting, encouraging, or aiding in the incitement or encouragement of any participant to do unlawful acts against the person or property of anyone;\n(2) photographing a participant when neither that person nor the photographer is on the premises being protected by the persons described in paragraph (a);\n(3) stopping or detaining any vehicle unless the vehicle is on premises being protected by the persons described in paragraph (a);\n(4) conducting surveillance of participants, when neither the participant nor the person conducting the surveillance is on the premises being protected by the person described in paragraph (a), or of their businesses, or homes; or\n(5) any other activities that are outside of the scope of the duties described in sections 326.32, subdivision 13, and 326.338, subdivision 4, and have the purpose of intimidating or provoking a participant.\n(a) A person violating this section is guilty of a gross misdemeanor.\n(b) The board shall suspend the license of a license holder for the periods described in paragraph (c) if the license holder or an employee of the license holder is convicted of a violation of subdivision 1b. The board shall prohibit an employee of a license holder from working for any license holder for the periods described in paragraph (c) if the employee is convicted of a violation of subdivision 1b.\n(c) The periods described in paragraph (b) are as follows:\n(1) 60 days for the first violation;\n(2) six months for the second violation; and\n(3) one year for the third violation.",
	"repealed": false
}