{
	"id": "16A.671",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.671",
	"title": "16A.671 CERTIFICATES OF INDEBTEDNESS.",
	"text": "To ensure that cash is available when needed to make payments drawn on the general fund under appropriations and allotments, the commissioner may (1) issue certificates of indebtedness in anticipation of the collection of taxes levied for and other revenues appropriated to the general fund for expenditure during each biennium; and (2) issue additional certificates to refund outstanding certificates and interest on them, under the constitution, article XI, section 6.\nBefore certificates are initially sold by any of the methods authorized in subdivision 6, the commissioner shall seek the advisory recommendation of the Legislative Advisory Commission, or if there is no commission, the Executive Council, on (1) the necessity of issuing them, (2) the terms and conditions of the sale, and (3) the maximum amount to be issued and outstanding under the authorization. If the commission or council does not make a recommendation promptly, the recommendation is negative. An additional recommendation is not required for refunding outstanding certificates or for each issuance of certificates in accordance with an approved line of credit, underwriting, or placement agreement.\nAs used in this section, the terms defined in this subdivision have the meanings given them:\n(a) \"General fund\" means all cash and investments from time to time received and held in the treasury, except proceeds of state bonds and amounts received and held in special or dedicated funds created by the constitution, or by or pursuant to federal laws or regulations, or by bond or trust instruments, pension contracts, or other agreements of the state or its agencies with private persons, entered into under state law.\n(b) \"Maximum current cash flow requirement\" means the commissioner's written estimate of the largest of the amounts by which, on a particular designated date in each month of the term for which certificates are to be issued, the sum of (1) the warrants then outstanding against the general fund plus (2) an amount equal to five percent of the actual working capital expenditures from the general fund in the preceding fiscal year, will exceed the amount of cash or cash equivalent assets held in the general fund, excluding the proceeds of the certificates to be issued.\nThe principal amount of certificates to be issued at any time must not exceed the lesser of the following:\n(1) an amount which, with interest thereon to maturity, added to the then outstanding amount of certificates not simultaneously paid and retired, will equal the then unexpended balance of all money which will be credited to the general fund during the current biennium under existing laws, as estimated by the commissioner; or\n(2) the maximum current cash flow requirement.\nThe commissioner may establish by order with the approval of the attorney general, but not subject to chapter 14, including section 14.386, the terms of each series of certificates of indebtedness including:\n(1) the manner of sale under subdivision 6;\n(2) the price, principal amount, and date of issue;\n(3) the interest rate or rates and payment dates, or the basis of computation of a variable rate;\n(4) the maturity date or dates, within the current biennium except as provided in subdivision 10;\n(5) the terms, if any, of redemption before maturity;\n(6) the form and method of execution, delivery, payment, registration, conversion, and exchange, under section 16A.672.\n(a) Certificates of indebtedness may be sold in any of the ways listed in paragraphs (b) to (f).\n(b) The commissioner may advertise for competitive bids.\n(c) The commissioner may negotiate contracts with suitable banks in or out of state to establish lines of credit, for an agreed compensation. The contracts must provide that the commissioner may issue certificates of indebtedness up to a maximum outstanding amount within an agreed period, bearing interest at a fixed or variable rate. The certificates must be subject to redemption at par plus accrued interest at any time at the commissioner's option.\n(d) The commissioner may negotiate contracts with firms of underwriters that will purchase or act as agents in the placement of certificates of indebtedness issued within an agreed period, up to a maximum amount outstanding. The certificates may be sold to the underwriters or investors (1) at an agreed discount with the interest included in the face amount payable at maturity, or (2) bearing interest at a stated interest rate on the face amount, payable on one or more dates. For the further security of these certificates the commissioner may negotiate agreements for lines of credit under paragraph (c) to pay the certificates with interest to maturity, if necessary, by the issuance of new certificates under the lines of credit.\n(e) The commissioner may make contracts for agreed fees with suitable banks in or out of state to authenticate, issue, pay principal and interest on, cancel, and otherwise deal as fiscal agents of the state with certificates of indebtedness issued under paragraph (b), (c), or (d).\n(f) The commissioner may sell certificates of indebtedness to the State Board of Investment without advertising for bids. The board must determine that the terms are not less favorable than those available at the time for the purchase of direct obligations of the federal government or its agencies, of comparable maturities. The board may purchase the certificates with any money under its control except money in a pension fund.\nThe commissioner may enter into an agreement with a suitable bank or banks located within or outside the state to authenticate, issue, pay principal and interest on, cancel or otherwise deal with certificates of indebtedness issued pursuant to this section, for an agreed compensation.\nThe proceeds of all certificates of indebtedness must be deposited in the general fund, and shall be available for spending under any appropriation from that fund for any purpose, subject to subdivision 9.\nThe amounts needed for the purposes in this subdivision are appropriated and must be paid from the general fund. These appropriations are irrevocable and shall not be canceled. They must be included in the computation of current cash flow requirements and of amounts available for allotment. The purposes of the appropriations are:\n(1) payment of the principal of and interest and premium, if any, on all certificates when due;\n(2) actual and necessary travel and subsistence expenses of state officers and employees and other expenses incidental to the sale or placement, printing, execution, and delivery of certificates; and\n(3) costs of lines of credit.\n(a) The proceeds of certificates of indebtedness issued in whole or in part to refund outstanding certificates and interest as authorized in the constitution are available only for that purpose until the refunded certificates and interest are paid.\n(b) The commissioner may covenant by order, on behalf of the state, for the security of the holders of any certificates, to segregate cash and cash equivalent assets in a special account within the general fund in the amounts and at the times in advance of the due dates that the commissioner determines to be advisable for marketing the certificates, and to act under section 16A.152, subdivision 4, to perform the covenant. The amount in the account is available only to pay the principal of and interest and premium, if any, on the certificates referred to in the order.\nIf cash and cash equivalent assets in the general fund in excess of the amount of outstanding warrants is not sufficient to pay any certificates of indebtedness or interest when due, the commissioner may issue refunding certificates maturing not later than December 1 in the next calendar year to pay the deficiency. With the approval of the governor, the commissioner may covenant on behalf of the state, in the order issuing any certificates, to offer refunding certificates for sale if a deficiency is expected.\nIf cash and cash equivalent assets in the general fund in excess of the amount of outstanding warrants, on December 1 immediately following the close of a biennium, is not sufficient to pay:\n(1) all refunding certificates of indebtedness;\n(2) all other certificates outstanding at the end of the biennium and not refunded; and\n(3) all interest accrued on the certificates referred to in clauses (1) and (2);\nthe state auditor shall levy upon all taxable property in the state the tax required by the constitution, article XI, section 6, collectible in the next calendar year and sufficient to pay all amounts described in clauses (1), (2), and (3) on or before December 1 in the collection year with interest to the date or dates of payment.",
	"repealed": false
}