{
	"id": "256.9742",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9742",
	"title": "256.9742 DUTIES AND POWERS OF THE OFFICE.",
	"text": "The office shall:\n(1) gather information and evaluate any act, practice, policy, procedure, or administrative action of a long-term care facility, acute care facility, home care service provider, or government agency that may adversely affect the health, safety, welfare, or rights of any client;\n(2) mediate or advocate on behalf of clients;\n(3) monitor the development and implementation of federal, state, or local laws, rules, regulations, and policies affecting the rights and benefits of clients;\n(4) comment on and recommend to public and private agencies regarding laws, rules, regulations, and policies affecting clients;\n(5) inform public agencies about the problems of clients;\n(6) provide for training of volunteers and promote the development of citizen participation in the work of the office;\n(7) conduct public forums to obtain information about and publicize issues affecting clients;\n(8) provide public education regarding the health, safety, welfare, and rights of clients; and\n(9) collect and analyze data relating to complaints, conditions, and services.\n(a) In designating a representative of the office to perform duties under this section, the ombudsman must determine that the individual is qualified to perform the duties required by this section.\n(b) A representative of the office designated as a regional ombudsman must successfully complete an orientation training conducted under the direction of the ombudsman or approved by the ombudsman. Orientation training shall be at least 20 hours and will consist of training in: investigation, dispute resolution, health care regulation, confidentiality, resident and patients' rights, and health care reimbursement.\n(c) The ombudsman shall develop and implement a continuing education program for representatives of the office designated as regional ombudsmen under this section, who shall complete at least 60 hours annually.\n(d) A representative of the office designated as a certified ombudsman volunteer under this section must successfully complete an approved orientation training course with a minimum curriculum including federal and state bills of rights for long-term care residents, acute hospital patients and home care clients, the Vulnerable Adults Act, confidentiality, and the role of the ombudsman.\n(e) The ombudsman shall develop and implement a continuing education program for certified ombudsman volunteers, who shall complete a minimum of 12 hours of continuing education per year.\n(f) The ombudsman may withdraw a representative's designation if the representative fails to perform duties of this section or meet continuing education requirements. The representative may request a reconsideration of such action by the Board on Aging, but any further decision of the state ombudsman about designation shall be final.\nThe ombudsman and representatives of the office are immune from civil liability that otherwise might result from the person's actions or omissions if the person's actions are in good faith, are within the scope of the person's responsibilities as an ombudsman or designee, and do not constitute willful or reckless misconduct.\nEvery long-term care facility and acute care facility shall post in a conspicuous place the address and telephone number of the office. A home care service provider shall provide all recipients, including those in an assisted living facility under chapter 144G, with the address and telephone number of the office. Counties shall provide clients receiving long-term care consultation services under section 256B.0911 or home and community-based services through a state or federally funded program with the name, address, and telephone number of the office. The posting or notice is subject to approval by the ombudsman.\nThe ombudsman or designee may:\n(1) enter any long-term care facility without notice at any time;\n(2) enter any acute care facility without notice during normal business hours;\n(3) enter any acute care facility without notice at any time to interview a patient or observe services being provided to the patient as part of an investigation of a matter that is within the scope of the ombudsman's authority, but only if the ombudsman's or designee's presence does not intrude upon the privacy of another patient or interfere with routine hospital services provided to any patient in the facility;\n(4) communicate privately and without restriction with any client, as long as the ombudsman has the client's consent for such communication;\n(5) inspect records of a long-term care facility, home care service provider, or acute care facility that pertain to the care of the client according to sections 144.291 to 144.298; and\n(6) with the consent of a client or client's legal guardian, the ombudsman or designated staff shall have access to review records pertaining to the care of the client according to sections 144.291 to 144.298. If a client cannot consent and has no legal guardian, access to the records is authorized by this section.\nA person who denies access to the ombudsman or designee in violation of this subdivision or aids, abets, invites, compels, or coerces another to do so is guilty of a misdemeanor.\nThe ombudsman or designee, excluding volunteers, has access to data of a state agency necessary for the discharge of the ombudsman's duties, including records classified confidential or private under chapter 13, or any other law. The data requested must be related to a specific case and is subject to section 13.03, subdivision 4. If the data concerns an individual, the ombudsman or designee shall first obtain the individual's consent. If the individual cannot consent and has no legal guardian, then access to the data is authorized by this section.\nEach state agency responsible for licensing, regulating, and enforcing state and federal laws and regulations concerning long-term care, home care service providers, and acute care facilities shall forward to the ombudsman on a quarterly basis, copies of all correction orders, penalty assessments, and complaint investigation reports, for all long-term care facilities, acute care facilities, and home care service providers.\n(a) No entity shall take discriminatory, disciplinary, or retaliatory action against the ombudsman, representative of the office, or a client, or guardian or family member of a client, for filing in good faith a complaint with or providing information to the ombudsman or representative of the office. A person who violates this subdivision or who aids, abets, invites, compels, or coerces another to do so is guilty of a misdemeanor.\n(b) There shall be a rebuttable presumption that any adverse action, as defined below, within 90 days of report, is discriminatory, disciplinary, or retaliatory. For the purpose of this paragraph, the term \"adverse action\" refers to action taken by the entity involved in a report against the person making the report or the person with respect to whom the report was made because of the report, and includes, but is not limited to:\n(1) discharge or transfer from a facility;\n(2) termination of service;\n(3) restriction or prohibition of access to the facility or its residents;\n(4) discharge from or termination of employment;\n(5) demotion or reduction in remuneration for services; and\n(6) any restriction of rights set forth in section 144.651, 144A.44, or 144A.751.",
	"repealed": false
}