{
	"id": "169.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.06",
	"title": "169.06 SIGNS, SIGNALS, MARKINGS.",
	"text": "The commissioner shall adopt a manual and specifications for a uniform system of traffic-control devices consistent with the provisions of this chapter for use upon highways within this state. Such uniform system shall correlate with and so far as possible conform to the system then current as approved by the American Association of State Highway and Transportation Officials. The manual and specifications must include the design and wording of minimum-maintenance road signs. The adoption of the manual and specifications by the commissioner as herein provided is specifically exempted from chapter 14, including section 14.386.\n(a) The commissioner shall place and maintain such traffic-control devices, conforming to the manual and specifications, upon all state trunk highways as the commissioner shall deem necessary to indicate and to carry out the provisions of this chapter or to regulate, warn, or guide traffic. The commissioner may construct and maintain signs at the entrance of each city, which sign shall have placed thereon the name of the city and the population thereof. The commissioner may construct and maintain other directional signs upon the trunk highways and such signs shall be uniform. The commissioner may authorize variations from the manual and specifications for the purpose of investigation and research into the use and development of traffic-control devices. When such authorized variation pertains to the regulation of traffic, notice of the intended regulatory purpose shall be published in a qualified newspaper of general circulation in the area where the research is being conducted.\n(b) No other authority shall place or maintain any traffic-control device upon any highway under the jurisdiction of the commissioner except by the latter's permission.\nLocal authorities in their respective jurisdictions shall place and maintain such traffic-control devices upon highways under their jurisdiction as they may deem necessary to indicate and to carry out the provisions of this chapter or local traffic ordinances, or to regulate, warn, or guide traffic. All such traffic-control devices hereafter erected shall conform to the state manual and specifications.\n(a) The driver of any vehicle shall obey the instructions of any official traffic-control device applicable thereto placed in accordance with the provisions of this chapter, unless otherwise directed by a police officer or by a flagger authorized under this subdivision, subject to the exceptions granted the driver of an authorized emergency vehicle in this chapter.\n(b) No provision of this chapter for which official traffic-control devices are required shall be enforced against an alleged violator if at the time and place of the alleged violation an official device is not in proper position and sufficiently legible to be seen by an ordinarily observant person. Whenever a particular section does not state that official traffic-control devices are required, such section shall be effective even though no devices are erected or in place.\n(c) Whenever official traffic-control devices are placed in position approximately conforming to the requirements of this chapter, such devices shall be presumed to have been so placed by the official act or direction of lawful authority, unless the contrary shall be established by competent evidence.\n(d) Any official traffic-control device placed pursuant to the provisions of this chapter and purporting to conform to the lawful requirements pertaining to such devices shall be presumed to comply with the requirements of this chapter, unless the contrary shall be established by competent evidence.\n(e) An overdimensional load escort driver with a certificate issued under section 299D.085, while acting as a flagger escorting a legal overdimensional load, may stop vehicles and hold vehicles in place until it is safe for the vehicles to proceed. A person operating a motor vehicle that has been stopped by an escort driver acting as a flagger may proceed only on instruction by the flagger or a police officer.\n(f) A person may stop and hold vehicles in place until it is safe for the vehicles to proceed, if the person: (1) holds a motorcycle road guard certificate issued under section 171.60; (2) meets the safety and equipment standards for operating under the certificate; (3) is acting as a flagger escorting a motorcycle group ride; (4) has notified each statutory or home rule charter city through which the motorcycle group is proceeding; and (5) has obtained consent from the chief of police, or the chief's designee, of any city of the first class through which the group is proceeding. A flagger operating as provided under this paragraph may direct operators of motorcycles within a motorcycle group ride or other vehicle traffic, notwithstanding any contrary indication of a traffic-control device, including stop signs or traffic-control signals. A person operating a vehicle that has been stopped by a flagger under this paragraph may proceed only on instruction by the flagger or a police officer.\n(a) A flagger in a work zone may stop vehicles, hold vehicles in place, and direct vehicles to proceed when it is safe.\n(b) A person convicted of operating a motor vehicle in violation of a speed limit in a work zone, or any other provision of this section while in a work zone, shall be required to pay a fine of $300. This fine is in addition to the surcharge under section 357.021, subdivision 6.\n(c) If a motor vehicle is operated in violation of paragraph (a), the owner of the vehicle, or for a leased motor vehicle the lessee of the vehicle, is guilty of a petty misdemeanor and is subject to a fine as provided in paragraph (b). The owner or lessee may not be fined under this paragraph if (1) another person is convicted for that violation, or (2) the motor vehicle was stolen at the time of the violation. This paragraph does not apply to a lessor of a motor vehicle if the lessor keeps a record of the name and address of the lessee.\n(d) Paragraph (c) does not prohibit or limit the prosecution of a motor vehicle operator who violates paragraph (a).\n(e) A violation under paragraph (c) does not constitute grounds for revocation or suspension of a driver's license.\n(f) A peace officer may issue a citation to the operator of a motor vehicle if the peace officer has probable cause to believe that the person has operated the vehicle in violation of paragraph (a). A citation may be issued even though the violation did not occur in the officer's presence. In addition to other evidentiary elements or factors, a peace officer has probable cause under this subdivision if:\n(1) a qualified work zone flagger has provided a report of a violation of paragraph (a) that includes a description and the license plate number of the vehicle used to commit the offense, and the time of the incident;\n(2) the person is operating the vehicle described in the report; and\n(3) it is within the four-hour period following the time of the incident, as specified in the report.\n(g) A work zone flagger is qualified to provide a report under paragraph (f) if each flagger involved in the reporting has completed training that includes information on flagging operations, equipment, traffic laws, observation and accurate identification of motor vehicles, and delegation of duties involving a report under paragraph (f).\n(a) A person may stop and hold vehicles in place at a location on a street or highway having a speed limit of 35 miles per hour or less until it is safe for the vehicles to proceed, if the person:\n(1) is designated by the school district's transportation safety director to act as a school bus flagger;\n(2) controls traffic in order to enable one or more school buses to safely leave school property and enter the adjacent street or highway, or to safely enter school property from the adjacent street or highway; and\n(3) meets the safety and equipment standards for an adult crossing guard provided in the manual and specifications adopted under subdivision 1.\n(b) A person operating a motor vehicle that has been stopped by a school bus flagger may proceed after stopping only on instruction by the school bus flagger or a police officer.\n(c) The authority under paragraph (a) does not apply in a school zone established under section 169.14, subdivision 5a, in which the speed limit of that street or highway outside the school zone is greater than 35 miles per hour.\n(a) Whenever traffic is controlled by traffic-control signals exhibiting different colored lights, or colored lighted arrows, successively one at a time or in combination, only the colors Green, Red, and Yellow shall be used, except for special pedestrian signals carrying a word or legend. The traffic-control signal lights or colored lighted arrows indicate and apply to drivers of vehicles and pedestrians as follows:\n(1) Green indication:\n(i) Vehicular traffic facing a circular green signal may proceed straight through or turn right or left unless a sign prohibits either turn. But vehicular traffic, including vehicles turning right or left, shall yield the right-of-way to other vehicles and to pedestrians lawfully within the intersection or adjacent crosswalk at the time this signal is exhibited. Vehicular traffic turning left or making a U-turn to the left shall yield the right-of-way to other vehicles approaching from the opposite direction so closely as to constitute an immediate hazard.\n(ii) Vehicular traffic facing a green arrow signal, shown alone or in combination with another indication, may cautiously enter the intersection only to make the movement indicated by the arrow, or other movement as permitted by other indications shown at the same time. Vehicular traffic shall yield the right-of-way to pedestrians lawfully within an adjacent crosswalk and to other traffic lawfully using the intersection.\n(iii) Unless otherwise directed by a pedestrian-control signal as provided in subdivision 6, pedestrians facing any green signal, except when the sole green signal is a turn arrow, may proceed across the roadway within any marked or unmarked crosswalk. Every driver of a vehicle shall yield the right-of-way to such pedestrian, except that the pedestrian shall yield the right-of-way to vehicles lawfully within the intersection at the time that the green signal indication is first shown.\n(2) Steady yellow indication:\n(i) Vehicular traffic facing a steady circular yellow or yellow arrow signal is thereby warned that the related green movement is being terminated or that a red indication will be exhibited immediately thereafter when vehicular traffic must not enter the intersection, except for the continued movement allowed by any green arrow indication simultaneously exhibited.\n(ii) Pedestrians facing a circular yellow signal, unless otherwise directed by a pedestrian-control signal as provided in subdivision 6, are thereby advised that there is insufficient time to cross the roadway before a red indication is shown and no pedestrian shall then start to cross the roadway.\n(3) Steady red indication:\n(i) Vehicular traffic facing a circular red signal alone must stop at a clearly marked stop line but, if none, before entering the crosswalk on the near side of the intersection or, if none, then before entering the intersection and shall remain standing until a green indication is shown, except as follows: (A) the driver of a vehicle stopped as close as practicable at the entrance to the crosswalk on the near side of the intersection or, if none, then at the entrance to the intersection in obedience to a red or stop signal, and with the intention of making a right turn may make the right turn, after stopping, unless an official sign has been erected prohibiting such movement, but shall yield the right-of-way to pedestrians and other traffic lawfully proceeding as directed by the signal at that intersection; or (B) the driver of a vehicle on a one-way street intersecting another one-way street on which traffic moves to the left shall stop in obedience to a red or stop signal and may then make a left turn into the one-way street, unless an official sign has been erected prohibiting the movement, but shall yield the right-of-way to pedestrians and other traffic lawfully proceeding as directed by the signal at that intersection.\n(ii) Unless otherwise directed by a pedestrian-control signal as provided in subdivision 6, pedestrians facing a steady red signal alone shall not enter the roadway.\n(iii) Vehicular traffic facing a steady red arrow signal, with the intention of making a movement indicated by the arrow, must stop at a clearly marked stop line but, if none, before entering the crosswalk on the near side of the intersection or, if none, then before entering the intersection and must remain standing until a permissive signal indication permitting the movement indicated by the red arrow is displayed, except as follows: when an official sign has been erected permitting a turn on a red arrow signal, the vehicular traffic facing a red arrow signal indication is permitted to enter the intersection to turn right, or to turn left from a one-way street into a one-way street on which traffic moves to the left, after stopping, but must yield the right-of-way to pedestrians and other traffic lawfully proceeding as directed by the signal at that intersection.\n(b) In the event an official traffic-control signal is erected and maintained at a place other than an intersection, the provisions of this section are applicable except those which can have no application. Any stop required must be made at a sign or marking on the pavement indicating where the stop must be made, but in the absence of any such sign or marking the stop must be made at the signal.\n(c) When a traffic-control signal indication or indications placed to control a certain movement or lane are so identified by placing a sign near the indication or indications, no other traffic-control signal indication or indications within the intersection controls vehicular traffic for that movement or lane.\nAll electronic traffic-control signals installed by a road authority on and after January 1, 1995, must be prewired to facilitate a later addition of a system that allows the operator of an authorized emergency vehicle to activate a green traffic signal for the vehicle.\n(a) For purposes of this subdivision, \"traffic signal-override device\" means a device located in a motor vehicle that permits activation of a traffic signal-override system described in subdivision 5a.\n(b) No person may operate a motor vehicle that contains a traffic signal-override device, other than:\n(1) an authorized emergency vehicle described in section 169.011, subdivision 3, clause (1), (2), or (3);\n(2) a vehicle, including a rail vehicle, engaged in providing bus rapid transit service or light rail transit service;\n(3) a signal maintenance vehicle of a road authority; or\n(4) a vehicle authorized to contain such a device by order of the commissioner of public safety.\n(c) No person may possess a traffic signal-override device, other than:\n(1) a person authorized to operate a vehicle described in paragraph (b), clauses (1) and (2), but only for use in that vehicle;\n(2) a person authorized by a road authority to perform signal maintenance, while engaged in such maintenance; or\n(3) a person authorized by order of the commissioner of public safety to possess a traffic signal-override device, but only to the extent authorized in the order.\n(d) A violation of this subdivision is a misdemeanor.\n(a) Whenever special pedestrian-control signals exhibiting the words \"Walk\" or \"Don't Walk\" or symbols of a \"walking person\" or \"upraised hand\" are in place, the signals or symbols indicate as follows:\n(1) A steady \"Walk\" signal or the symbol of a \"walking person\" indicates that a pedestrian facing either of these signals may proceed across the roadway in the direction of the signal, possibly in conflict with turning vehicles. Every driver of a vehicle shall yield the right-of-way to such pedestrian except that the pedestrian shall yield the right-of-way to vehicles lawfully within the intersection at the time that either signal indication is first shown.\n(2) A \"Don't Walk\" signal or the symbol of an \"upraised hand,\" flashing or steady, indicates that a pedestrian shall not start to cross the roadway in the direction of either signal, but any pedestrian who has partially crossed on the \"Walk\" or \"walking person\" signal indication shall proceed to a sidewalk or safety island while the signal is showing.\n(b) A pedestrian crossing a roadway in conformity with this section is lawfully within the intersection and, when in a crosswalk, is lawfully within the crosswalk.\nWhen flashing red or yellow signals are used they shall require obedience by vehicular traffic as follows:\n(a) When a circular red lens is illuminated with rapid intermittent flashes, drivers of vehicles shall stop at a clearly marked stop line, but if none, before entering the crosswalk on the near side of the intersection, or if none, then at the point nearest the intersecting roadway where the driver has a view of approaching traffic on the intersecting roadway before entering the intersection, and the right to proceed shall be subject to the rules applicable after making a stop at a stop sign.\n(b) When a red arrow lens is illuminated with rapid intermittent flashes drivers of vehicles with the intention of making a movement indicated by the arrow shall stop at a clearly marked stop line, but if none, before entering the crosswalk on the near side of the intersection, or if none, then at the point nearest the intersecting roadway where the driver has a view of approaching traffic on the intersecting roadway before entering the intersection, and the right to proceed shall be subject to the rules applicable after making a stop at a stop sign.\n(c) When a circular yellow lens is illuminated with rapid intermittent flashes, drivers of vehicles may proceed through the intersection or past the signals only with caution. Vehicular traffic, including vehicles turning right or left, shall yield the right-of-way to other vehicles and to pedestrians lawfully within the intersection or adjacent crosswalk at the time this signal is exhibited. Vehicular traffic turning left or making a U-turn to the left shall yield the right-of-way to other vehicles approaching from the opposite direction so closely as to constitute an immediate hazard.\n(d) When a yellow arrow indication is illuminated with rapid intermittent flashes, drivers of vehicles with the intention of making a movement indicated by the arrow may proceed through the intersection or past the signals only with caution, but shall yield the right-of-way to other vehicles and to pedestrians lawfully within the intersection or adjacent crosswalk at the time this signal is exhibited. Vehicular traffic turning left or making a U-turn to the left shall yield the right-of-way to other vehicles approaching from the opposite direction so closely as to constitute an immediate hazard.\nWhen lane-direction-control signals are placed over individual lanes of a street or highway, vehicular traffic may travel in lanes as follows:\n(a) Vehicular traffic facing a green arrow indication is permitted to drive in the lane over which the arrow signal is located.\n(b) Vehicular traffic facing a red \"X\" indication shall not drive in the lane over which the signal is located.\n(c) Vehicular traffic facing a steady yellow \"X\" indication is thereby warned that use of the lane over which the signal is located is being terminated, or that a red \"X\" indication will be exhibited immediately thereafter when vehicular traffic shall not drive in the lane.\n(d) Vehicular traffic facing a yellow \"X\" indication illuminated with rapid intermittent flashes is permitted to use a lane over which the signal is located for a left turn or for a passing maneuver, using proper caution.\n(a) A person operating a bicycle or motorcycle who violates subdivision 4 by entering or crossing an intersection controlled by a traffic-control signal against a red light has an affirmative defense to that charge if the person establishes all of the following conditions:\n(1) the bicycle or motorcycle has been brought to a complete stop;\n(2) the traffic-control signal continues to show a red light for an unreasonable time;\n(3) the traffic-control signal is apparently malfunctioning or, if programmed or engineered to change to a green light only after detecting the approach of a motor vehicle, the signal has apparently failed to detect the arrival of the bicycle or motorcycle; and\n(4) no motor vehicle or person is approaching on the street or highway to be crossed or entered or is so far away from the intersection that it does not constitute an immediate hazard.\n(b) The affirmative defense in this subdivision applies only to a violation for entering or crossing an intersection controlled by a traffic-control signal against a red light and does not provide a defense to any other civil or criminal action.\n(a) Subject to subdivision 11, if a motor vehicle is operated in violation of a traffic-control signal and the violation is identified through the use of a red light camera system implemented under section 169.147, the owner of the vehicle or the lessee of the vehicle is guilty of a petty misdemeanor and must pay a fine of $40.\n(b) A person who commits a first offense under paragraph (a) must be given a warning and is not subject to a fine or conviction under paragraph (a). A person who commits a second offense under paragraph (a) is eligible for diversion, which must include a traffic safety course established under section 169.147, subdivision 11. A person who enters diversion and completes the traffic safety course is not subject to a fine or conviction under paragraph (a).\n(c) Paragraph (b) does not apply to:\n(1) a violation that occurs in a commercial motor vehicle; or\n(2) a violation committed by a holder of a class A, B, or C commercial driver's license or commercial driver learner's permit, without regard to whether the violation was committed in a commercial motor vehicle or another vehicle.\n(d) This subdivision applies to violations committed on or after August 1, 2025, and before August 1, 2029.\n(a) An owner or lessee of a motor vehicle is not subject to a fine or conviction under subdivision 10 if any of the conditions under section 169.14, subdivision 14, paragraph (a), clauses (1) to (7), are met.\n(b) The owner or lessee of a motor vehicle may not be issued a citation under subdivision 10 and under another subdivision in this section for the same conduct.\n(c) A fine or conviction under subdivision 10 does not constitute grounds for revocation or suspension of a person's driver's license.\n(d) Except as provided in subdivision 10, paragraph (c), this subdivision applies to violations committed on or after August 1, 2025, and before August 1, 2029.",
	"repealed": false
}