{
	"id": "144G.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.72",
	"title": "144G.72 TREATMENT AND THERAPY MANAGEMENT SERVICES.",
	"text": "This section applies only to assisted living facilities that provide treatment and therapy management services.\n(a) An assisted living facility that provides treatment and therapy management services must develop, implement, and maintain up-to-date written treatment or therapy management policies and procedures. The policies and procedures must be developed under the supervision and direction of a registered nurse or appropriate licensed health professional consistent with current practice standards and guidelines.\n(b) The written policies and procedures must address requesting and receiving orders or prescriptions for treatments or therapies, providing the treatment or therapy, documenting treatment or therapy activities, educating and communicating with residents about treatments or therapies they are receiving, monitoring and evaluating the treatment or therapy, and communicating with the prescriber.\nFor each resident receiving management of ordered or prescribed treatments or therapy services, the assisted living facility must prepare and include in the service plan a written statement of the treatment or therapy services that will be provided to the resident. The facility must also develop and maintain a current individualized treatment and therapy management record for each resident which must contain at least the following:\n(1) a statement of the type of services that will be provided;\n(2) documentation of specific resident instructions relating to the treatments or therapy administration;\n(3) identification of treatment or therapy tasks that will be delegated to unlicensed personnel;\n(4) procedures for notifying a registered nurse or appropriate licensed health professional when a problem arises with treatments or therapy services; and\n(5) any resident-specific requirements relating to documentation of treatment and therapy received, verification that all treatment and therapy was administered as prescribed, and monitoring of treatment or therapy to prevent possible complications or adverse reactions. The treatment or therapy management record must be current and updated when there are any changes.\nOrdered or prescribed treatments or therapies must be administered by a nurse, physician, or other licensed health professional authorized to perform the treatment or therapy, or may be delegated or assigned to unlicensed personnel by the licensed health professional according to the appropriate practice standards for delegation or assignment. When administration of a treatment or therapy is delegated or assigned to unlicensed personnel, the facility must ensure that the registered nurse or authorized licensed health professional has:\n(1) instructed the unlicensed personnel in the proper methods with respect to each resident and the unlicensed personnel has demonstrated the ability to competently follow the procedures;\n(2) specified, in writing, specific instructions for each resident and documented those instructions in the resident's record; and\n(3) communicated with the unlicensed personnel about the individual needs of the resident.\nEach treatment or therapy administered by an assisted living facility must be in the resident record. The documentation must include the signature and title of the person who administered the treatment or therapy and must include the date and time of administration. When treatment or therapies are not administered as ordered or prescribed, the provider must document the reason why it was not administered and any follow-up procedures that were provided to meet the resident's needs.\nThere must be an up-to-date written or electronically recorded order from an authorized prescriber for all treatments and therapies. The order must contain the name of the resident, a description of the treatment or therapy to be provided, and the frequency, duration, and other information needed to administer the treatment or therapy. Treatment and therapy orders must be renewed at least every 12 months.\nUnder section 144G.91, a resident is free to retain therapy and treatment services from an off-site service provider. Assisted living facilities must make every effort to assist residents in obtaining information regarding whether the Medicare program, the medical assistance program under chapter 256B, or another public program will pay for any or all of the services.",
	"repealed": false
}