{
	"id": "62E.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.21",
	"title": "62E.21 DEFINITIONS.",
	"text": "For the purposes of sections 62E.21 to 62E.25, the terms defined in this section have the meanings given them.\n\"Affordable Care Act\" means the federal act as defined in section 62A.011, subdivision 1a.\n\"Attachment point\" means an amount as provided in section 62E.23, subdivision 2, paragraph (b).\n\"Benefit year\" means the calendar year for which an eligible health carrier provides coverage through an individual health plan.\n\"Board\" means the board of directors of the Minnesota Comprehensive Health Association created under section 62E.10.\n\"Coinsurance rate\" means the rate as provided in section 62E.23, subdivision 2, paragraph (c).\n\"Commissioner\" means the commissioner of commerce.\n\"Eligible health carrier\" means all of the following that offer individual health plans and incur claims costs for an individual enrollee's covered benefits in the applicable benefit year:\n(1) an insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01;\n(2) a nonprofit health service plan corporation operating under chapter 62C; or\n(3) a health maintenance organization operating under chapter 62D.\n\"Individual health plan\" means a health plan as defined in section 62A.011, subdivision 4, that is not a grandfathered plan as defined in section 62A.011, subdivision 1b.\n\"Individual market\" has the meaning given in section 62A.011, subdivision 5.\n\"Minnesota Comprehensive Health Association\" or \"association\" has the meaning given in section 62E.02, subdivision 14.\n\"Minnesota premium security plan\" or \"plan\" means the state-based reinsurance program authorized under section 62E.23.\n\"Payment parameters\" means the attachment point, reinsurance cap, and coinsurance rate for the plan.\n\"Reinsurance cap\" means the threshold amount as provided in section 62E.23, subdivision 2, paragraph (d).\n\"Reinsurance payments\" means an amount paid by the association to an eligible health carrier under the plan.",
	"repealed": false
}