{
	"id": "256.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.041",
	"title": "256.041 CULTURAL AND ETHNIC COMMUNITIES LEADERSHIP COUNCIL.",
	"text": "There is hereby established the Cultural and Ethnic Communities Leadership Council for the Department of Human Services. The purpose of the council is to advise the commissioner of human services on implementing strategies to reduce inequities and disparities that particularly affect racial and ethnic groups in Minnesota.\n(a) The council must consist of:\n(1) the chairs and ranking minority members of the committees in the house of representatives and the senate with jurisdiction over human services; and\n(2) no fewer than 15 and no more than 25 members appointed by and serving at the pleasure of the commissioner of human services, in consultation with county, tribal, cultural, and ethnic communities; diverse program participants; parent representatives from these communities; and cultural and ethnic communities leadership council members.\n(b) In making appointments under this section, the commissioner shall give priority consideration to public members of the legislative councils of color established under section 15.0145.\n(c) Members must be appointed to allow for representation of the following groups:\n(1) racial and ethnic minority groups;\n(2) the American Indian community, which must be represented by two members;\n(3) culturally and linguistically specific advocacy groups and service providers;\n(4) human services program participants;\n(5) public and private institutions;\n(6) parents of human services program participants;\n(7) members of the faith community;\n(8) Department of Human Services employees; and\n(9) any other group the commissioner deems appropriate to facilitate the goals and duties of the council.\nThe commissioner shall direct the development of guidelines defining the membership of the council; setting out definitions; and developing duties of the commissioner, the council, and council members regarding racial and ethnic disparities reduction. The guidelines must be developed in consultation with:\n(1) the chairs of relevant committees; and\n(2) county, tribal, and cultural communities and program participants from these communities.\nThe commissioner shall accept recommendations from the council to appoint a chair or chairs.\nMS 2020 [Repealed by amendment, 1Sp2021 c 7 art 14 s 7]\nA term shall be for two years and appointees may be reappointed to serve two additional terms. The commissioner shall make appointments to replace members vacating their positions in a timely manner, no more than three months after the council reviews panel recommendations.\n(a) The commissioner of human services or the commissioner's designee shall:\n(1) maintain and actively engage with the council established in this section;\n(2) supervise and coordinate policies for persons from racial, ethnic, cultural, linguistic, and tribal communities who experience disparities in access and outcomes;\n(3) identify human services rules or statutes affecting persons from racial, ethnic, cultural, linguistic, and tribal communities that may need to be revised;\n(4) investigate and implement cost-effective, equitable, and culturally responsive models of service delivery including careful adoption of proven services to increase the number of culturally relevant services available to currently underserved populations;\n(5) based on recommendations of the council, review identified department policies that maintain racial, ethnic, cultural, linguistic, and tribal disparities; make adjustments to ensure those disparities are not perpetuated; and advise the department on progress and accountability measures for addressing inequities;\n(6) in partnership with the council, renew and implement equity policy with action plans and resources necessary to implement the action plans;\n(7) support interagency collaboration to advance equity;\n(8) address the council at least twice annually on the state of equity within the department; and\n(9) support member participation in the council, including participation in educational and community engagement events across Minnesota that address equity in human services.\n(b) The commissioner of human services or the commissioner's designee shall consult with the council and receive recommendations from the council when meeting the requirements in this subdivision.\nThe council shall:\n(1) recommend to the commissioner for review Department of Human Services policy, budgetary, and operational decisions and practices that impact racial, ethnic, cultural, linguistic, and tribal disparities;\n(2) with community input, advance legislative proposals to improve racial and health equity outcomes;\n(3) identify issues regarding inequities and disparities by engaging diverse populations in human services programs;\n(4) engage in mutual learning essential for achieving human services parity and optimal wellness for service recipients;\n(5) raise awareness about human services disparities to the legislature and media;\n(6) provide technical assistance and consultation support to counties, private nonprofit agencies, and other service providers to build their capacity to provide equitable human services for persons from racial, ethnic, cultural, linguistic, and tribal communities who experience disparities in access and outcomes;\n(7) provide technical assistance to promote statewide development of culturally and linguistically appropriate, accessible, and cost-effective human services and related policies;\n(8) recommend and monitor training and outreach to facilitate access to culturally and linguistically appropriate, accessible, and cost-effective human services to prevent disparities;\n(9) form work groups to help carry out the duties of the council that include, but are not limited to, persons who provide and receive services and representatives of advocacy groups, and provide the work groups with clear guidelines, standardized parameters, and tasks for the work groups to accomplish;\n(10) promote information sharing in the human services community and statewide; and\n(11) by February 15 in the second year of the biennium, prepare and submit to the chairs and ranking minority members of the committees in the house of representatives and the senate with jurisdiction over human services a report that summarizes the activities of the council, identifies the major problems and issues confronting racial and ethnic groups in accessing human services, makes recommendations to address issues, and lists the specific objectives that the council seeks to attain during the next biennium, and recommendations to strengthen equity, diversity, and inclusion within the department. The report must identify racial and ethnic groups' difficulty in accessing human services and make recommendations to address the issues. The report must include any updated Department of Human Services equity policy, implementation plans, equity initiatives, and the council's progress.\nThe members of the council shall:\n(1) attend scheduled meetings with no more than three absences per year, participate in scheduled meetings, and be prepared by reviewing meeting notes;\n(2) maintain open communication channels with respective constituencies;\n(3) identify and communicate issues and risks that could impact the timely completion of tasks;\n(4) collaborate on inequity and disparity reduction efforts;\n(5) communicate updates of the council's work progress and status on the Department of Human Services website;\n(6) participate in any activities the council or chair deems appropriate and necessary to facilitate the goals and duties of the council; and\n(7) participate in work groups to carry out council duties.\nMS 2022 [Repealed, 2023 c 50 art 1 s 38]\nCompensation for members of the council is governed by section 15.059, subdivision 3.",
	"repealed": false
}