{
	"id": "256B.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.69",
	"title": "256B.69 PREPAID HEALTH PLANS.",
	"text": "The commissioner of human services shall establish a medical assistance demonstration project to determine whether prepayment combined with better management of health care services is an effective mechanism to ensure that all eligible individuals receive necessary health care in a coordinated fashion while containing costs. For the purposes of this project, waiver of certain statutory provisions is necessary in accordance with this section.\nFor the purposes of this section, the following terms have the meanings given.\n(a) \"Commissioner\" means the commissioner of human services. For the remainder of this section, the commissioner's responsibilities for methods and policies for implementing the project will be proposed by the project advisory committees and approved by the commissioner.\n(b) \"Demonstration provider\" means a nonprofit health maintenance organization, community integrated service network, or accountable provider network authorized and operating under chapter 62D, 62N, or 62T that participates in the demonstration project according to criteria, standards, methods, and other requirements established for the project and approved by the commissioner. For purposes of this section, a county board, or group of county boards operating under a joint powers agreement, is considered a demonstration provider if the county or group of county boards meets the requirements of section 256B.692.\n(c) \"Eligible individuals\" means those persons eligible for medical assistance benefits as defined in sections 256B.055, 256B.056, and 256B.06.\n(d) \"Limitation of choice\" means suspending freedom of choice while allowing eligible individuals to choose among the demonstration providers.\nThe commissioner shall designate the geographic areas in which eligible individuals may be included in the medical assistance prepayment programs.\n(a) The commissioner, when implementing the medical assistance prepayment program within a county, must include the county board in the process of development, approval, and issuance of the request for proposals to provide services to eligible individuals within the proposed county. County boards must be given reasonable opportunity to make recommendations regarding the development, issuance, review of responses, and changes needed in the request for proposals. The commissioner must provide county boards the opportunity to review each proposal based on the identification of community needs under chapters 142F and 145A and county advocacy activities. If a county board finds that a proposal does not address certain community needs, the county board and commissioner shall continue efforts for improving the proposal and network prior to the approval of the contract. The county board shall make recommendations regarding the approval of local networks and their operations to ensure adequate availability and access to covered services. The provider or health plan must respond directly to county advocates and the state prepaid medical assistance ombudsperson regarding service delivery and must be accountable to the state regarding contracts with medical assistance funds. The county board may recommend a maximum number of participating health plans after considering the size of the enrolling population; ensuring adequate access and capacity; considering the client and county administrative complexity; and considering the need to promote the viability of locally developed health plans. The county board or a single entity representing a group of county boards and the commissioner shall mutually select health plans for participation at the time of initial implementation of the prepaid medical assistance program in that county or group of counties and at the time of contract renewal. The commissioner shall also seek input for contract requirements from the county or single entity representing a group of county boards at each contract renewal and incorporate those recommendations into the contract negotiation process.\n(b) At the option of the county board, the board may develop contract requirements related to the achievement of local public health goals to meet the health needs of medical assistance enrollees. These requirements must be reasonably related to the performance of health plan functions and within the scope of the medical assistance benefit set. If the county board and the commissioner mutually agree to such requirements, the department shall include such requirements in all health plan contracts governing the prepaid medical assistance program in that county at initial implementation of the program in that county and at the time of contract renewal. The county board may participate in the enforcement of the contract provisions related to local public health goals.\n(c) For counties in which a prepaid medical assistance program has not been established, the commissioner shall not implement that program if a county board submits an acceptable and timely preliminary and final proposal under section 256B.692, until county-based purchasing is no longer operational in that county. For counties in which a prepaid medical assistance program is in existence on or after September 1, 1997, the commissioner must terminate contracts with health plans according to section 256B.692, subdivision 5, if the county board submits and the commissioner accepts a preliminary and final proposal according to that subdivision. The commissioner is not required to terminate contracts that begin on or after September 1, 1997, according to section 256B.692 until two years have elapsed from the date of initial enrollment.\n(d) In the event that a county board or a single entity representing a group of county boards and the commissioner cannot reach agreement regarding: (i) the selection of participating health plans in that county; (ii) contract requirements; or (iii) implementation and enforcement of county requirements including provisions regarding local public health goals, the commissioner shall resolve all disputes after taking into account the recommendations of a three-person mediation panel. The panel shall be composed of one designee of the president of the association of Minnesota counties, one designee of the commissioner of human services, and one person selected jointly by the designee of the commissioner of human services and the designee of the Association of Minnesota Counties. Within a reasonable period of time before the hearing, the panelists must be provided all documents and information relevant to the mediation. The parties to the mediation must be given 30 days' notice of a hearing before the mediation panel.\n(e) If a county which elects to implement county-based purchasing ceases to implement county-based purchasing, it is prohibited from assuming the responsibility of county-based purchasing for a period of five years from the date it discontinues purchasing.\n(f) The commissioner shall not require that contractual disputes between county-based purchasing entities and the commissioner be mediated by a panel that includes a representative of the Minnesota Council of Health Plans.\n(g) At the request of a county-purchasing entity, the commissioner shall adopt a contract reprocurement or renewal schedule under which all counties included in the entity's service area are reprocured or renewed at the same time.\n(h) The commissioner shall provide a written report under section 3.195 to the chairs of the legislative committees having jurisdiction over human services in the senate and the house of representatives describing in detail the activities undertaken by the commissioner to ensure full compliance with this section. The report must also provide an explanation for any decisions of the commissioner not to accept the recommendations of a county or group of counties required to be consulted under this section. The report must be provided at least 30 days prior to the effective date of a new or renewed prepaid or managed care contract in a county.\nThe commissioner, in consultation with representatives of county boards of commissioners shall identify program information and data necessary on an ongoing basis for county boards to: (1) make recommendations to the commissioner related to state purchasing under the prepaid medical assistance program; and (2) effectively administer county-based purchasing. This information and data must include, but is not limited to, county-specific, individual-level fee-for-service and prepaid health plan claims information.\n(a) The commissioner shall develop criteria to determine when limitation of choice may be implemented in the experimental counties. The criteria shall ensure that all eligible individuals in the county have continuing access to the full range of medical assistance services as specified in subdivision 6.\n(b) The commissioner shall exempt the following persons from participation in the project, in addition to those who do not meet the criteria for limitation of choice:\n(1) persons eligible for medical assistance according to section 256B.055, subdivision 1;\n(2) persons eligible for medical assistance due to blindness or disability as determined by the Social Security Administration or the state medical review team, unless:\n(i) they are 65 years of age or older; or\n(ii) they reside in Itasca County or they reside in a county in which the commissioner conducts a pilot project under a waiver granted pursuant to section 1115 of the Social Security Act;\n(3) recipients who currently have private coverage through a health maintenance organization;\n(4) recipients who are eligible for medical assistance by spending down excess income for medical expenses other than the nursing facility per diem expense;\n(5) recipients who receive benefits under the Refugee Assistance Program, established under United States Code, title 8, section 1522(e);\n(6) children who are both determined to be severely emotionally disturbed and receiving case management services according to section 256B.0625, subdivision 20, except children who are eligible for and who decline enrollment in an approved preferred integrated network under section 245.4682;\n(7) adults who are both determined to be seriously and persistently mentally ill and received case management services according to section 256B.0625, subdivision 20;\n(8) persons eligible for medical assistance according to section 256B.057, subdivision 10;\n(9) persons with access to cost-effective employer-sponsored private health insurance or persons enrolled in a non-Medicare individual health plan determined to be cost-effective according to section 256B.0625, subdivision 15;\n(10) persons who are absent from the state for more than 30 consecutive days but still deemed a resident of Minnesota, identified in accordance with section 256B.056, subdivision 1, paragraph (b); and\n(11) persons who are enrolled in the reentry demonstration waiver under section 256B.0761.\nChildren under age 21 who are in foster placement may enroll in the project on an elective basis. Individuals excluded under clauses (1), (6), and (7) may choose to enroll on an elective basis. The commissioner may enroll recipients in the prepaid medical assistance program for seniors who are (1) age 65 and over, and (2) eligible for medical assistance by spending down excess income.\n(c) The commissioner may allow persons with a one-month spenddown who are otherwise eligible to enroll to voluntarily enroll or remain enrolled, if they elect to prepay their monthly spenddown to the state.\n(d) The commissioner may require those individuals to enroll in the prepaid medical assistance program who otherwise would have been excluded under paragraph (b), clauses (1), (3), and (8), and under Minnesota Rules, part 9500.1452, subpart 2, items H, K, and L.\n(e) Before limitation of choice is implemented, eligible individuals shall be notified and after notification, shall be allowed to choose only among demonstration providers. The commissioner may assign an individual with private coverage through a health maintenance organization, to the same health maintenance organization for medical assistance coverage, if the health maintenance organization is under contract for medical assistance in the individual's county of residence. After initially choosing a provider, the recipient is allowed to change that choice only at specified times as allowed by the commissioner. If a demonstration provider ends participation in the project for any reason, a recipient enrolled with that provider must select a new provider but may change providers without cause once more within the first 60 days after enrollment with the second provider.\n(f) An infant born to a woman who is eligible for and receiving medical assistance and who is enrolled in the prepaid medical assistance program shall be retroactively enrolled to the month of birth in the same managed care plan as the mother once the child is enrolled in medical assistance unless the child is determined to be excluded from enrollment in a prepaid plan under this section.\n[See Note.]\n[Repealed, 1996 c 451 art 5 s 39]\nThe commissioner shall amend the federal waiver allowing the state to separate out individualized education program and individualized family service plan services for children enrolled in the prepaid medical assistance program and the MinnesotaCare program. Medical assistance coverage of eligible individualized education program and individualized family service plan services shall not be included in the capitated services for children enrolled in health plans through the prepaid medical assistance program and the MinnesotaCare program. Local school districts shall bill the commissioner for these services, and claims shall be paid on a fee-for-service basis.\nThe commissioner shall establish the method and amount of payments for services. The commissioner shall annually contract with demonstration providers to provide services consistent with these established methods and amounts for payment.\nIf allowed by the commissioner, a demonstration provider may contract with an insurer, health care provider, nonprofit health service plan corporation, or the commissioner, to provide insurance or similar protection against the cost of care provided by the demonstration provider or to provide coverage against the risks incurred by demonstration providers under this section. The recipients enrolled with a demonstration provider are a permissible group under group insurance laws and chapter 62C, the Nonprofit Health Service Plan Corporations Act. Under this type of contract, the insurer or corporation may make benefit payments to a demonstration provider for services rendered or to be rendered to a recipient. Any insurer or nonprofit health service plan corporation licensed to do business in this state is authorized to provide this insurance or similar protection.\nThe commissioner shall complete development of capitation rates for payments before delivery of services under this section is begun. The commissioner shall contract with an independent actuary to establish prepayment rates.\nBeginning July 1, 2004, the commissioner may include payments for elderly waiver services and 180 days of nursing home care in capitation payments for the prepaid medical assistance program for recipients age 65 and older.\n(a) Managed care contracts under this section and section 256L.12 shall be entered into or renewed on a calendar year basis. The commissioner may issue separate contracts with requirements specific to services to medical assistance recipients age 65 and older.\n(b) A prepaid health plan providing covered health services for eligible persons pursuant to chapters 256B and 256L is responsible for complying with the terms of its contract with the commissioner. Requirements applicable to managed care programs under chapters 256B and 256L established after the effective date of a contract with the commissioner take effect when the contract is next issued or renewed.\n(c) The commissioner shall withhold five percent of managed care plan payments under this section and county-based purchasing plan payments under section 256B.692 for the prepaid medical assistance program pending completion of performance targets. Each performance target must be quantifiable, objective, measurable, and reasonably attainable, except in the case of a performance target based on a federal or state law or rule. Criteria for assessment of each performance target must be outlined in writing prior to the contract effective date. Clinical or utilization performance targets and their related criteria must consider evidence-based research and reasonable interventions when available or applicable to the populations served, and must be developed with input from external clinical experts and stakeholders, including managed care plans, county-based purchasing plans, and providers. The managed care or county-based purchasing plan must demonstrate, to the commissioner's satisfaction, that the data submitted regarding attainment of the performance target is accurate. The commissioner shall periodically change the administrative measures used as performance targets in order to improve plan performance across a broader range of administrative services. The performance targets must include measurement of plan efforts to contain spending on health care services and administrative activities. The commissioner may adopt plan-specific performance targets that take into account factors affecting only one plan, including characteristics of the plan's enrollee population. The withheld funds must be returned no sooner than July of the following year if performance targets in the contract are achieved. The commissioner may exclude special demonstration projects under subdivision 23.\n(d) The commissioner shall require that managed care plans:\n(1) use the assessment and authorization processes, forms, timelines, standards, documentation, and data reporting requirements, protocols, billing processes, and policies consistent with medical assistance fee-for-service or the Department of Human Services contract requirements for all personal care assistance services under section 256B.0659 and community first services and supports under section 256B.85;\n(2) by January 30 of each year that follows a rate increase for any aspect of services under section 256B.0659 or 256B.85, inform the commissioner and the chairs and ranking minority members of the legislative committees with jurisdiction over rates determined under section 256B.851 of the amount of the rate increase that is paid to each personal care assistance provider agency with which the plan has a contract; and\n(3) use a six-month timely filing standard and provide an exemption to the timely filing timeliness for the resubmission of claims where there has been a denial, request for more information, or system issue.\n(e) Effective for services rendered on or after January 1, 2013, through December 31, 2013, the commissioner shall withhold 4.5 percent of managed care plan payments under this section and county-based purchasing plan payments under section 256B.692 for the prepaid medical assistance program. The withheld funds must be returned no sooner than July 1 and no later than July 31 of the following year. The commissioner may exclude special demonstration projects under subdivision 23.\n(f) Effective for services rendered on or after January 1, 2014, the commissioner shall withhold three percent of managed care plan payments under this section and county-based purchasing plan payments under section 256B.692 for the prepaid medical assistance program. The withheld funds must be returned no sooner than July 1 and no later than July 31 of the following year. The commissioner may exclude special demonstration projects under subdivision 23.\n(g) A managed care plan or a county-based purchasing plan under section 256B.692 may include as admitted assets under section 62D.044 any amount withheld under this section that is reasonably expected to be returned.\n(h) Contracts between the commissioner and a prepaid health plan are exempt from the set-aside and preference provisions of section 16C.16, subdivisions 6, paragraph (a), and 7.\n(i) The return of the withhold under paragraphs (e) and (f) is not subject to the requirements of paragraph (c).\n(j) Managed care plans and county-based purchasing plans shall maintain current and fully executed agreements for all subcontractors, including bargaining groups, for administrative services that are expensed to the state's public health care programs. Subcontractor agreements determined to be material, as defined by the commissioner after taking into account state contracting and relevant statutory requirements, must be in the form of a written instrument or electronic document containing the elements of offer, acceptance, consideration, payment terms, scope, duration of the contract, and how the subcontractor services relate to state public health care programs. Upon request, the commissioner shall have access to all subcontractor documentation under this paragraph. Nothing in this paragraph shall allow release of information that is nonpublic data pursuant to section 13.02.\n(a) For prepaid medical assistance program contract rates set by the commissioner under subdivision 5, capitation rates for nonmetropolitan counties shall on a weighted average be no less than 87 percent of the capitation rates for metropolitan counties, excluding Hennepin County. The commissioner shall make a pro rata adjustment in capitation rates paid to counties other than nonmetropolitan counties in order to make this provision budget neutral. The commissioner, in consultation with a health care actuary, shall evaluate the regional rate relationships based on actual health plan costs for Minnesota health care programs. The commissioner may establish, based on the actuary's recommendation, new rate regions that recognize metropolitan areas outside of the seven-county metropolitan area.\n(b) This subdivision shall not affect the nongeographically based risk adjusted rates established under section 62Q.03, subdivision 5a.\nMS 2022 [Repealed, 2023 c 70 art 5 s 16]\nEffective for services rendered on or after January 1, 2001, capitation payments under this section for services provided in the month of June shall be made no earlier than the first day after the month of service.\n[Repealed, 2014 c 262 art 2 s 18]\n(a) Beginning July 1, 2002, the capitation rates paid under this section are increased by $12,700,000 per year. Beginning July 1, 2003, the capitation rates paid under this section are increased by $4,700,000 per year.\n(b) Beginning July 1, 2009, the capitation rates paid under this section are increased each year by the lesser of $21,714,000 or an amount equal to the difference between the estimated value of the reductions described in subdivision 5c, paragraph (a), clause (1), and the amount of the limit described in subdivision 5c, paragraph (b).\nFor services rendered on or after January 1, 2003, the total payment made to managed care plans for providing covered services under the medical assistance program is reduced by .5 percent from their current statutory rates. This provision excludes payments for nursing home services, home and community-based waivers, payments to demonstration projects for persons with disabilities, and mental health services added as covered benefits after December 31, 2007.\nIn addition to the reduction in subdivision 5g, the total payment made to managed care plans under the medical assistance program is reduced 1.0 percent for services provided on or after October 1, 2003, and an additional 1.0 percent for services provided on or after January 1, 2004. This provision excludes payments for nursing home services, home and community-based waivers, payments to demonstration projects for persons with disabilities, and mental health services added as covered benefits after December 31, 2007.\n(a) Administrative costs paid to managed care plans and county-based purchasing plans under this section, section 256B.692, and section 256L.12 must not exceed 6.6 percent of total payments made to all managed care plans and county-based purchasing plans in aggregate across all state public health care programs, based on payments expected to be made at the beginning of each calendar year. The commissioner may reduce or eliminate administrative requirements to meet the administrative cost limit. For purposes of this paragraph, administrative costs do not include premium taxes paid under section 297I.05, subdivision 5, provider surcharges paid under section 256.9657, subdivision 3, and health insurance fees under section 9010 of the Affordable Care Act.\n(b) The following expenses are not allowable administrative expenses for rate-setting purposes under this section:\n(1) charitable contributions made by the managed care plan or the county-based purchasing plan;\n(2) compensation of individuals within the organization in excess of $200,000 such that the allocation of compensation for an individual across all state public health care programs in total cannot exceed $200,000;\n(3) any penalties or fines assessed against the managed care plan or county-based purchasing plan;\n(4) any indirect marketing or advertising expenses of the managed care plan or county-based purchasing plan, including but not limited to costs to promote the managed care or county-based purchasing plan, costs of facilities used for special events, and costs of displays, demonstrations, donations, and promotional items such as memorabilia, models, gifts, and souvenirs. The commissioner may classify an item listed in this clause as an allowable administrative expense for rate-setting purposes, if the commissioner determines that the expense is incidental to an activity related to state public health care programs that is an allowable cost for purposes of rate setting;\n(5) any lobbying and political activities, events, or contributions;\n(6) administrative expenses related to the provision of services not covered under the state plan or waiver;\n(7) alcoholic beverages and related costs;\n(8) membership in any social, dining, or country club or organization; and\n(9) entertainment, including amusement, diversion, and social activities, and any costs directly associated with these costs, including but not limited to tickets to shows or sporting events, meals, lodging, rentals, transportation, and gratuities.\nFor the purposes of this subdivision, compensation includes salaries, bonuses and incentives, other reportable compensation on an IRS 990 form, retirement and other deferred compensation, and nontaxable benefits. Charitable contributions under clause (1) include payments for or to any organization or entity selected by the managed care plan or county-based purchasing plan that is operated for charitable, educational, political, religious, or scientific purposes, that are not related to medical and administrative services covered under state public health care programs.\n(c) Payments to a quality improvement organization are an allowable administrative expense for rate-setting purposes under this section, to the extent they are allocated to a state public health care program and approved by the commissioner.\n(d) Where reasonably possible, expenses for an administrative item shall be directly allocated so as to assign costs for an item to an individual state public health care program when the cost can be specifically identified with and benefits the individual state public health care program. For administrative services expensed to the state's public health care programs, managed care plans and county-based purchasing plans must clearly identify and separately record expense items listed under paragraph (b) in their accounting systems in a manner that allows for independent verification of unallowable expenses for purposes of determining payment rates for state public health care programs.\n(e) Notwithstanding paragraph (a), the commissioner shall reduce administrative expenses paid to managed care plans and county-based purchasing plans by .50 of a percentage point for contracts beginning January 1, 2016, and ending December 31, 2017. To meet the administrative reductions under this paragraph, the commissioner may reduce or eliminate administrative requirements, exclude additional unallowable administrative expenses identified under this section and resulting from the financial audits conducted under subdivision 9d, and utilize competitive bidding to gain efficiencies through economies of scale from increased enrollment. If the total reduction cannot be achieved through administrative reduction, the commissioner may limit total rate increases on payments to managed care plans and county-based purchasing plans.\nCapitation rates shall treat investment income and interest earnings as income to the same extent that investment-related expenses are treated as administrative expenditures.\nRates paid to managed care plans and county-based purchasing plans shall satisfy requirements for actuarial soundness. In order to comply with this subdivision, the rates must:\n(1) be neither inadequate nor excessive;\n(2) satisfy federal requirements;\n(3) in the case of contracts with incentive arrangements, not exceed 105 percent of the approved capitation payments attributable to the enrollees or services covered by the incentive arrangement;\n(4) be developed in accordance with generally accepted actuarial principles and practices;\n(5) be appropriate for the populations to be covered and the services to be furnished under the contract; and\n(6) be certified as meeting the requirements of federal regulations by actuaries who meet the qualification standards established by the American Academy of Actuaries and follow the practice standards established by the Actuarial Standards Board.\n(a) Each demonstration provider shall be responsible for the health care coordination for eligible individuals. Demonstration providers:\n(1) shall authorize and arrange for the provision of all needed health services including but not limited to the full range of services listed in sections 256B.02, subdivision 8, and 256B.0625 in order to ensure appropriate health care is delivered to enrollees. Notwithstanding section 256B.0621, demonstration providers that provide nursing home and community-based services under this section shall provide relocation service coordination to enrolled persons age 65 and over;\n(2) shall accept the prospective, per capita payment from the commissioner in return for the provision of comprehensive and coordinated health care services for eligible individuals enrolled in the program;\n(3) may contract with other health care and social service practitioners to provide services to enrollees; and\n(4) shall institute recipient grievance procedures according to the method established by the project, utilizing applicable requirements of chapter 62D. Disputes not resolved through this process shall be appealable to the commissioner as provided in subdivision 11.\n(b) Demonstration providers must comply with the standards for claims settlement under section 72A.201, subdivisions 4, 5, 7, and 8, when contracting with other health care and social service practitioners to provide services to enrollees. A demonstration provider must pay a clean claim, as defined in Code of Federal Regulations, title 42, section 447.45(b), within 30 business days of the date of acceptance of the claim.\n(a) Notwithstanding Minnesota Rules, part 9500.1457, subpart 1, item B, up to 180 days of nursing facility services as defined in section 256B.0625, subdivision 2, which are provided in a nursing facility certified by the Minnesota Department of Health for services provided and eligible for payment under Medicaid, shall be covered under the prepaid medical assistance program for individuals who are not residing in a nursing facility at the time of enrollment in the prepaid medical assistance program. The commissioner may develop a schedule to phase in implementation of the 180-day provision.\n(b) For individuals enrolled in the Minnesota senior health options project or in other demonstrations authorized under subdivision 23, nursing facility services shall be covered according to the terms and conditions of the federal agreement governing that demonstration project.\n(c) For individuals enrolled in demonstrations authorized under subdivision 23, services in an intermediate care facility for persons with developmental disabilities shall be covered according to the terms and conditions of the federal agreement governing the demonstration project.\n(a) For individuals enrolled in the Minnesota senior health options project authorized under subdivision 23, elderly waiver services shall be covered according to the terms and conditions of the federal agreement governing that demonstration project.\n(b) For individuals under age 65 enrolled in demonstrations authorized under subdivision 23, home and community-based waiver services shall be covered according to the terms and conditions of the federal agreement governing that demonstration project.\n(c) The commissioner of human services shall issue requests for proposals for collaborative service models between counties and managed care organizations to integrate the home and community-based elderly waiver services and additional nursing home services into the prepaid medical assistance program.\n(d) Notwithstanding Minnesota Rules, part 9500.1457, subpart 1, item C, elderly waiver services shall be covered statewide under the prepaid medical assistance program for all individuals who are eligible according to chapter 256S. The commissioner may develop a schedule to phase in implementation of these waiver services, including collaborative service models under paragraph (c). The commissioner shall phase in implementation beginning with those counties participating under section 256B.692, and those counties where a viable collaborative service model has been developed. In consultation with counties and all managed care organizations that have expressed an interest in participating in collaborative service models, the commissioner shall evaluate the models. The commissioner shall consider the evaluation in selecting the most appropriate models for statewide implementation.\n[Repealed, 2014 c 262 art 2 s 18]\nThe commissioner may exclude or modify coverage for prescription drugs from the prepaid managed care contracts entered into under this section in order to increase savings to the state by collecting additional prescription drug rebates. The contracts must maintain incentives for the managed care plan to manage drug costs and utilization and may require that the managed care plans maintain an open drug formulary. In order to manage drug costs and utilization, the contracts may authorize the managed care plans to use preferred drug lists and prior authorization. This subdivision is contingent on federal approval of the managed care contract changes and the collection of additional prescription drug rebates.\n(a) If a dental provider is providing services to an enrollee of a managed care plan or county-based purchasing plan based on a treatment plan that requires more than one visit, the managed care plan or county-based purchasing plan or the plan's subcontractor, if the plan subcontracts with a third party to administer dental services to the plan's enrollees, must not require the completion of the treatment plan as a condition of payment to the dental provider for services performed as part of the treatment plan. The health plan or subcontractor must reimburse the dental provider for all services performed by the provider regardless of whether the treatment plan is completed, as long as the enrollee was covered under the plan at the time the service was performed.\n(b) Nothing in paragraph (a) prevents a health plan or its subcontractor from paying for services using a bundled payment method. If a bundled payment method is used and the treatment plan covered by the payment is not completed for any reason, the health plan or its subcontractor must reimburse the dental provider for the services performed, as long as the enrollee was covered under the plan at the time the service was performed.\n(a) A managed care plan, county-based purchasing plan, or dental benefits administrator must provide individual dental providers, upon request, the applicable fee schedules for covered dental services provided under the contract between the dental provider and the managed care plan, county-based purchasing plan, or dental benefits administrator.\n(b) A managed care plan, county-based purchasing plan, or dental benefits administrator may fulfill this requirement by making the applicable fee schedules available through a secure web portal for the contracted dental provider to access.\n(c) For purposes of this subdivision, \"dental benefits administrator\" means an organization licensed under chapter 62C or 62D that contracts with a managed care plan or county-based purchasing plan to provide covered dental care services to enrollees of the plan.\n(a) By January 1, 2022, the managed care plans, county-based purchasing plans, and dental benefit administrators that contract with the commissioner or subcontract with plans to provide dental services to medical assistance or MinnesotaCare enrollees shall develop a uniform credentialing process for dental providers.\n(b) The process developed in this subdivision must include a uniform credentialing application that must be available in electronic format and accessible on each plan or dental benefits administrator's website. The process developed under this subdivision must include an option to electronically submit a completed application. The uniform credentialing application must be available for free to providers.\n(c) If applicable, a managed care plan, county-based purchasing plan, dental benefits administrator, contractor, or vendor that reviews and approves a credentialing application must notify a provider regarding a deficiency on a submitted credentialing application form no later than 30 business days after receiving the application form from the provider.\n(d) For purposes of this subdivision, \"dental benefits administrator\" means an organization, including an organization licensed under chapter 62C or 62D, that contracts with a managed care plan or county-based purchasing plan to provide covered dental care services to enrollees of the plan.\n(e) This subdivision must be in compliance with the federal requirements for Medicaid and Basic Health Program provider enrollment.\n(a) If an individual 65 years of age or older is receiving personal assistance from the same agency continuously during the six months prior to being newly enrolled with any managed care or county-based purchasing plan, the managed care or county-based purchasing plan with which the individual is newly enrolled must offer the agency a contract for the purposes of allowing the enrollee to receive any personal assistance covered under the terms of the plan from the enrollee's current agency, provided the enrollee continues to live in the service area of the enrollee's current agency.\n(b) For the purposes of this subdivision, the following terms have the meanings given:\n(1) \"agency\" means any of the following:\n(i) a personal care assistance provider agency as defined under section 256B.0659, subdivision 1, paragraph (l);\n(ii) an agency provider as described in section 256B.85, subdivision 2, paragraph (c); or\n(iii) a financial management services provider for an enrollee who directly employs direct care staff through the community first services and supports budget model or through the consumer-directed community supports option available under the elderly waiver; and\n(2) \"personal assistance\" means any of the following:\n(i) personal care assistance services, extended personal care assistance services, or enhanced rate personal care assistance services under section 256B.0659;\n(ii) community first services and supports, extended community first services and supports, or enhanced rate community first services and supports under section 256B.85; or\n(iii) personal assistance provided through the consumer-directed community supports option available under the elderly waiver.\n(c) This subdivision applies only if the enrollee's current agency agrees to accept as payment in full the managed care plan's or county-based purchasing plan's in-network reimbursement rate for the same covered service at the time the service is provided, and agrees to enter into a managed care plan's or county-based purchasing plan's contract for services of like kind.\nAll eligible individuals enrolled by demonstration providers shall receive all needed health care services as defined in subdivision 6.\nAll enrolled individuals have the right to appeal if necessary services are not being authorized as defined in subdivision 11.\nExcept as applicable to the project's operation, the provisions of sections 256.975 and 256B.0911 are waived for the purposes of this section for recipients enrolled with demonstration providers or in the prepaid medical assistance program for seniors.\n(a) Each demonstration provider shall submit information as required by the commissioner, including data required for assessing client satisfaction, quality of care, cost, and utilization of services for purposes of project evaluation. The commissioner shall also develop methods of data reporting and collection in order to provide aggregate enrollee information on encounters and outcomes to determine access and quality assurance. Required information shall be specified before the commissioner contracts with a demonstration provider.\n(b) Aggregate nonpersonally identifiable health plan encounter data, aggregate spending data for major categories of service as reported to the commissioners of health and commerce under section 62D.08, subdivision 3, clause (a), and criteria for service authorization and service use are public data that the commissioner shall make available and use in public reports. The commissioner shall require each health plan and county-based purchasing plan to provide:\n(1) encounter data for each service provided, using standard codes and unit of service definitions set by the commissioner, in a form that the commissioner can report by age, eligibility groups, and health plan; and\n(2) criteria, written policies, and procedures required to be disclosed under section 62M.10, subdivision 7, and Code of Federal Regulations, title 42, part 438.210 (b)(1), used for each type of service for which authorization is required.\n(c) Each demonstration provider shall report to the commissioner on the extent to which providers employed by or under contract with the demonstration provider use patient-centered decision-making tools or procedures designed to engage patients early in the decision-making process and the steps taken by the demonstration provider to encourage their use.\nWithin the limit of available appropriations, the commissioner shall work with the commissioner of health to identify and collect data on administrative spending for state health care programs reported to the commissioner of health by managed care plans under section 62D.08 and county-based purchasing plans under section 256B.692, provided that such data are consistent with guidelines and standards for administrative spending that are developed by the commissioner of health, and reported to the legislature under Laws 2008, chapter 364, section 12. Data provided to the commissioner under this subdivision are nonpublic data as defined under section 13.02.\n[Repealed, 1Sp2011 c 9 art 6 s 97]\n(a) The commissioner shall collect detailed data regarding financials, provider payments, provider rate methodologies, and other data as determined by the commissioner. The commissioner, in consultation with the commissioners of health and commerce, and in consultation with managed care plans and county-based purchasing plans, shall set uniform criteria, definitions, and standards for the data to be submitted, and shall require managed care and county-based purchasing plans to comply with these criteria, definitions, and standards when submitting data under this section. In carrying out the responsibilities of this subdivision, the commissioner shall ensure that the data collection is implemented in an integrated and coordinated manner that avoids unnecessary duplication of effort. To the extent possible, the commissioner shall use existing data sources and streamline data collection in order to reduce public and private sector administrative costs. Nothing in this subdivision shall allow release of information that is nonpublic data pursuant to section 13.02.\n(b) Effective January 1, 2014, each managed care and county-based purchasing plan must quarterly provide to the commissioner the following information on state public programs, in the form and manner specified by the commissioner, according to guidelines developed by the commissioner in consultation with managed care plans and county-based purchasing plans under contract:\n(1) an income statement by program;\n(2) financial statement footnotes;\n(3) quarterly profitability by program and population group;\n(4) a medical liability summary by program and population group;\n(5) received but unpaid claims report by program;\n(6) services versus payment lags by program for hospital services, outpatient services, physician services, other medical services, and pharmaceutical benefits;\n(7) utilization reports that summarize utilization and unit cost information by program for hospitalization services, outpatient services, physician services, and other medical services;\n(8) pharmaceutical statistics by program and population group for measures of price and utilization of pharmaceutical services;\n(9) subcapitation expenses by population group;\n(10) third-party payments by program;\n(11) all new, active, and closed subrogation cases by program;\n(12) all new, active, and closed fraud and abuse cases by program;\n(13) medical loss ratios by program;\n(14) administrative expenses by category and subcategory by program that reconcile to other state and federal regulatory agencies, including Minnesota Supplement Report #1A;\n(15) revenues by program, including investment income;\n(16) nonadministrative service payments, provider payments, and reimbursement rates by provider type or service category, by program, paid by the managed care plan under this section or the county-based purchasing plan under section 256B.692 to providers and vendors for administrative services under contract with the plan, including but not limited to:\n(i) individual-level provider payment and reimbursement rate data;\n(ii) provider reimbursement rate methodologies by provider type, by program, including a description of alternative payment arrangements and payments outside the claims process;\n(iii) data on implementation of legislatively mandated provider rate changes; and\n(iv) individual-level provider payment and reimbursement rate data and plan-specific provider reimbursement rate methodologies by provider type, by program, including alternative payment arrangements and payments outside the claims process, provided to the commissioner under this subdivision are nonpublic data as defined in section 13.02;\n(17) data on the amount of reinsurance or transfer of risk by program; and\n(18) contribution to reserve, by program.\n(c) In the event a report is published or released based on data provided under this subdivision, the commissioner shall provide the report to managed care plans and county-based purchasing plans 15 days prior to the publication or release of the report. Managed care plans and county-based purchasing plans shall have 15 days to review the report and provide comment to the commissioner.\nThe quarterly reports shall be submitted to the commissioner no later than 60 days after the end of the previous quarter, except the fourth-quarter report, which shall be submitted by April 1 of each year. The fourth-quarter report shall include audited financial statements, parent company audited financial statements, an income statement reconciliation report, and any other documentation necessary to reconcile the detailed reports to the audited financial statements.\n(d) Managed care plans and county-based purchasing plans shall certify to the commissioner for the purpose of financial reporting for state public health care programs under this subdivision that costs reported for state public health care programs include:\n(1) only services covered under the state plan and waivers, and related allowable administrative expenses; and\n(2) the dollar value of unallowable and nonstate plan services, including both medical and administrative expenditures, that have been excluded.\n(a) The commissioner shall require, in the request for bids and resulting contracts with managed care plans and county-based purchasing plans under this section and section 256B.692, that each managed care plan and county-based purchasing plan submit to and fully cooperate with the independent third-party financial audits by the legislative auditor under subdivision 9e of the information required under subdivision 9c, paragraph (b). Each contract with a managed care plan or county-based purchasing plan under this section or section 256B.692 must provide the commissioner, the legislative auditor, and vendors contracting with the legislative auditor, access to all data required to complete audits under subdivision 9e.\n(b) Each managed care plan and county-based purchasing plan providing services under this section shall provide to the commissioner biweekly encounter data and claims data for state public health care programs and shall participate in a quality assurance program that verifies the timeliness, completeness, accuracy, and consistency of the data provided. The commissioner shall develop written protocols for the quality assurance program and shall make the protocols publicly available. The commissioner shall contract for an independent third-party audit to evaluate the quality assurance protocols as to the capacity of the protocols to ensure complete and accurate data and to evaluate the commissioner's implementation of the protocols.\n(c) Upon completion of the evaluation under paragraph (b), the commissioner shall provide copies of the report to the legislative auditor.\n(d) Any actuary under contract with the commissioner to provide actuarial services must meet the independence requirements under the professional code for fellows in the Society of Actuaries and must not have provided actuarial services to a managed care plan or county-based purchasing plan that is under contract with the commissioner pursuant to this section and section 256B.692 during the period in which the actuarial services are being provided. An actuary or actuarial firm meeting the requirements of this paragraph must certify and attest to the rates paid to the managed care plans and county-based purchasing plans under this section and section 256B.692, and the certification and attestation must be auditable.\n(e) The commissioner, to the extent of available funding, shall conduct ad hoc audits of state public health care program administrative and medical expenses reported by managed care plans and county-based purchasing plans. This includes: financial and encounter data reported to the commissioner under subdivision 9c, including payments to providers and subcontractors; supporting documentation for expenditures; categorization of administrative and medical expenses; and allocation methods used to attribute administrative expenses to state public health care programs. These audits also must monitor compliance with data and financial report certification requirements established by the commissioner for the purposes of managed care capitation payment rate-setting. The managed care plans and county-based purchasing plans shall fully cooperate with the audits in this subdivision.\n(f) Nothing in this subdivision shall allow the release of information that is nonpublic data pursuant to section 13.02.\nThe legislative auditor shall audit managed care plans and county-based purchasing plans to determine if a managed care plan or county-based purchasing plan used public money in compliance with federal and state laws, rules, and in accordance with provisions in the plan's contract with the commissioner. The legislative auditor shall conduct the audits in accordance with section 3.972, subdivision 2b.\n(a) The commissioner, by December 15 of each year, shall submit to the chairs and ranking minority members of the legislative committees with jurisdiction over health care policy and finance a report on managed care and county-based purchasing plan provider reimbursement rates.\n(b) The report must include, for each managed care and county-based purchasing plan, the mean and median provider reimbursement rates by county for the calendar year preceding the reporting year, for the five most common billing codes statewide across all plans, in each of the following provider service categories if within the county there are more than three medical assistance enrolled providers providing the specific service within the specific category:\n(1) physician prenatal services;\n(2) physician preventive services;\n(3) physician services other than prenatal or preventive;\n(4) dental services;\n(5) inpatient hospital services;\n(6) outpatient hospital services;\n(7) mental health services; and\n(8) substance use disorder services.\n(c) The commissioner shall also include in the report:\n(1) the mean and median reimbursement rates across all plans by county for the calendar year preceding the reporting year for the billing codes and provider service categories described in paragraph (b); and\n(2) the mean and median fee-for-service reimbursement rates by county for the calendar year preceding the reporting year for the billing codes and provider service categories described in paragraph (b).\nNotwithstanding any law or rule to the contrary, the commissioner may allow disclosure of the recipient's identity solely for the purposes of (a) allowing demonstration providers to provide the information to the recipient regarding services, access to services, and other provider characteristics, and (b) facilitating monitoring of recipient satisfaction and quality of care. The commissioner shall develop and implement measures to protect recipients from invasions of privacy and from harassment.\nA recipient may appeal to the commissioner a demonstration provider's delay or refusal to provide services, according to section 256.045.\n[Repealed, 1989 c 282 art 3 s 98]\n[Repealed, 1989 c 282 art 3 s 98]\n[Repealed, 1989 c 282 art 3 s 98]\n[Repealed, 1989 c 282 art 3 s 98]\nMinnesota Rules, parts 9500.1450; 9500.1451; 9500.1452; 9500.1453; 9500.1454; 9500.1455; 9500.1457; 9500.1458; 9500.1459; 9500.1460; 9500.1461; 9500.1462; 9500.1463; and 9500.1464, are extended.\nThe commissioner may continue the provisions of this section in any or all of the participating counties if necessary federal authority is granted. The commissioner may adopt permanent rules to continue prepaid medical assistance in these areas.\nIf the recipient appeals in writing to the state agency on or before the tenth day after the decision of the prepaid health plan to reduce, suspend, or terminate services which the recipient had been receiving, and the treating physician or another plan physician orders the services to be continued at the previous level, the prepaid health plan must continue to provide services at a level equal to the level ordered by the plan's physician until the state agency renders its decision.\nA prepaid health plan may limit any reimbursement it may be required to pay to providers not employed by or under contract with the prepaid health plan to the medical assistance rates for medical assistance enrollees paid by the commissioner of human services to providers for services to recipients not enrolled in a prepaid health plan.\n(a) If a managed care or county-based purchasing plan has an established contractual payment under medical assistance with an out-of-network provider for a service provided in Minnesota related to the diagnosis, monitoring, and treatment of a rare disease or condition, the provider must accept the established contractual payment for that service as payment in full.\n(b) If a plan does not have an established contractual payment under medical assistance with an out-of-network provider for a service provided in Minnesota related to the diagnosis, monitoring, and treatment of a rare disease or condition, the provider must accept the provider's established rate for uninsured patients for that service as payment in full. If the provider does not have an established rate for uninsured patients for that service, the provider must accept the fee-for-service rate.\n(a) If a managed care or county-based purchasing plan has an established contractual payment under medical assistance with an out-of-network provider for a service provided in another state related to diagnosis, monitoring, and treatment of a rare disease or condition, the plan must pay the established contractual payment for that service.\n(b) If a plan does not have an established contractual payment under medical assistance with an out-of-network provider for a service provided in another state related to diagnosis, monitoring, and treatment of a rare disease or condition, the plan must pay the provider's established rate for uninsured patients for that service. If the provider does not have an established rate for uninsured patients for that service, the plan must pay the provider the fee-for-service rate in that state.\nMS 2020 [Repealed, 2022 c 98 art 2 s 16]\nThe county board shall designate a prepayment coordinator to assist the state agency in implementing this section. Assistance must include educating recipients about available health care options, enrolling recipients under subdivision 5, providing necessary eligibility and enrollment information to health plans and the state agency, and coordinating complaints and appeals with the ombudsperson established in section 256B.6903.\n(a) Before implementing prepaid programs in counties with a county operated or affiliated public teaching hospital or a hospital or clinic operated by the University of Minnesota, the commissioner shall consider the risks the prepaid program creates for the hospital and allow the county or hospital the opportunity to participate in the program, provided the terms of participation in the program are competitive with the terms of other participants.\n(b) Prepaid health plans serving counties with a nonprofit community clinic or community health services agency must contract with the clinic or agency to provide services to clients who choose to receive services from the clinic or agency, if the clinic or agency agrees to payment rates that are competitive with rates paid to other health plan providers for the same or similar services.\n(c) For purposes of this subdivision, \"nonprofit community clinic\" includes, but is not limited to, a community mental health center as defined in sections 245.62 and 256B.0625, subdivision 5.\n(a) The commissioner may implement demonstration projects to create alternative integrated delivery systems for acute and long-term care services to elderly persons and persons with disabilities as defined in section 256B.77, subdivision 7a, that provide increased coordination, improve access to quality services, and mitigate future cost increases. The commissioner may seek federal authority to combine Medicare and Medicaid capitation payments for the purpose of such demonstrations and may contract with Medicare-approved special needs plans that are offered by a demonstration provider or by an entity that is directly or indirectly wholly owned or controlled by a demonstration provider to provide Medicaid services. Medicare funds and services shall be administered according to the terms and conditions of the federal contract and demonstration provisions. For the purpose of administering medical assistance funds, demonstrations under this subdivision are subject to subdivisions 1 to 22. The provisions of Minnesota Rules, parts 9500.1450 to 9500.1464, apply to these demonstrations, with the exceptions of parts 9500.1452, subpart 2, item B; and 9500.1457, subpart 1, items B and C, which do not apply to persons enrolling in demonstrations under this section. All enforcement and rulemaking powers available under chapters 62D, 62M, and 62Q are hereby granted to the commissioner of health with respect to Medicare-approved special needs plans with which the commissioner contracts to provide Medicaid services under this section. An initial open enrollment period may be provided. Persons who disenroll from demonstrations under this subdivision remain subject to Minnesota Rules, parts 9500.1450 to 9500.1464. When a person is enrolled in a health plan under these demonstrations and the health plan's participation is subsequently terminated for any reason, the person shall be provided an opportunity to select a new health plan and shall have the right to change health plans within the first 60 days of enrollment in the second health plan. Persons required to participate in health plans under this section who fail to make a choice of health plan shall not be randomly assigned to health plans under these demonstrations. Notwithstanding section 256L.12, subdivision 5, and Minnesota Rules, part 9505.5220, subpart 1, item A, if adopted, for the purpose of demonstrations under this subdivision, the commissioner may contract with managed care organizations, including counties, to serve only elderly persons eligible for medical assistance, elderly persons with a disability, or persons with a disability only. For persons with a primary diagnosis of developmental disability, serious and persistent mental illness, or serious emotional disturbance, the commissioner must ensure that the county authority has approved the demonstration and contracting design. Enrollment in these projects for persons with disabilities shall be voluntary. The commissioner shall not implement any demonstration project under this subdivision for persons with a primary diagnosis of developmental disabilities, serious and persistent mental illness, or serious emotional disturbance, without approval of the county board of the county in which the demonstration is being implemented.\n(b) MS 2009 Supplement [Expired, 2003 c 47 s 4; 2007 c 147 art 7 s 60]\n(c) Before implementation of a demonstration project for persons with a disability, the commissioner must provide information to appropriate committees of the house of representatives and senate and must involve representatives of affected disability groups in the design of the demonstration projects.\n(d) A nursing facility reimbursed under the alternative reimbursement methodology in section 256B.434 may, in collaboration with a hospital, clinic, or other health care entity provide services under paragraph (a). The commissioner shall amend the state plan and seek any federal waivers necessary to implement this paragraph.\n(e) The commissioner, in consultation with the commissioners of commerce and health, may approve and implement programs for all-inclusive care for the elderly (PACE) according to federal laws and regulations governing that program and state laws or rules applicable to participating providers. A PACE provider is not required to be licensed or certified as a health plan company as defined in section 62Q.01, subdivision 4. Persons age 55 and older who have been screened by the county and found to be eligible for services under the elderly waiver or community access for disability inclusion or who are already eligible for Medicaid but meet level of care criteria for receipt of waiver services may choose to enroll in the PACE program. Medicare and Medicaid services will be provided according to this subdivision and federal Medicare and Medicaid requirements governing PACE providers and programs. PACE enrollees will receive Medicaid home and community-based services through the PACE provider as an alternative to services for which they would otherwise be eligible through home and community-based waiver programs and Medicaid State Plan Services. The commissioner shall establish Medicaid rates for PACE providers that do not exceed costs that would have been incurred under fee-for-service or other relevant managed care programs operated by the state.\n(f) The commissioner shall seek federal approval to expand the Minnesota disability health options (MnDHO) program established under this subdivision in stages, first to regional population centers outside the seven-county metro area and then to all areas of the state. Until July 1, 2009, expansion for MnDHO projects that include home and community-based services is limited to the two projects and service areas in effect on March 1, 2006. Enrollment in integrated MnDHO programs that include home and community-based services shall remain voluntary. Costs for home and community-based services included under MnDHO must not exceed costs that would have been incurred under the fee-for-service program. Notwithstanding whether expansion occurs under this paragraph, in determining MnDHO payment rates and risk adjustment methods, the commissioner must consider the methods used to determine county allocations for home and community-based program participants. If necessary to reduce MnDHO rates to comply with the provision regarding MnDHO costs for home and community-based services, the commissioner shall achieve the reduction by maintaining the base rate for contract year 2010 for services provided under the community access for disability inclusion waiver at the same level as for contract year 2009. The commissioner may apply other reductions to MnDHO rates to implement decreases in provider payment rates required by state law. Effective January 1, 2011, enrollment and operation of the MnDHO program in effect during 2010 shall cease. The commissioner may reopen the program provided all applicable conditions of this section are met. In developing program specifications for expansion of integrated programs, the commissioner shall involve and consult the state-level stakeholder group established in subdivision 28, paragraph (d), including consultation on whether and how to include home and community-based waiver programs. Plans to reopen MnDHO projects shall be presented to the chairs of the house of representatives and senate committees with jurisdiction over health and human services policy and finance prior to implementation.\n(g) Notwithstanding section 256B.0621, health plans providing services under this section are responsible for home care targeted case management and relocation targeted case management. Services must be provided according to the terms of the waivers and contracts approved by the federal government.\n[Repealed, 1999 c 245 art 3 s 51]\n[Repealed, 2014 c 262 art 2 s 18]\nIn the event a medical assistance recipient or beneficiary enrolled in a health plan under this section is denied nursing facility services after residing in the facility for more than 180 days, any denial of medical assistance payment to a provider under this section shall be prospective only and payments to the provider shall continue until the resident is discharged or 30 days after the effective date of the service denial, whichever is sooner.\n(a) For American Indian recipients of medical assistance who are required to enroll with a demonstration provider under subdivision 4 or in a county-based purchasing entity, if applicable, under section 256B.692, medical assistance shall cover health care services provided at Indian health services facilities and facilities operated by a tribe or tribal organization under funding authorized by United States Code, title 25, sections 450f to 450n, or title III of the Indian Self-Determination and Education Assistance Act, Public Law 93-638, if those services would otherwise be covered under section 256B.0625. Payments for services provided under this subdivision shall be made on a fee-for-service basis, and may, at the option of the tribe or tribal organization, be made according to rates authorized under sections 256.969, subdivision 16, and 256B.0625, subdivision 34. Implementation of this purchasing model is contingent on federal approval.\n(b) The commissioner of human services, in consultation with the tribal governments, shall develop a plan for tribes to assist in the enrollment process for American Indian recipients enrolled in the prepaid medical assistance program under this section. This plan also shall address how tribes will be included in ensuring the coordination of care for American Indian recipients between Indian health service or tribal providers and other providers.\n(c) For purposes of this subdivision, \"American Indian\" has the meaning given to persons to whom services will be provided for in Code of Federal Regulations, title 42, section 36.12.\nManaged care contracts entered into under this section and section 256L.12 must require demonstration providers to provide language assistance to enrollees that ensures meaningful access to its programs and services according to Title VI of the Civil Rights Act and federal regulations adopted under that law or any guidance from the United States Department of Health and Human Services.\n(a) The commissioner may contract with demonstration providers and current or former sponsors of qualified Medicare-approved special needs plans, to provide medical assistance basic health care services to persons with disabilities, including those with developmental disabilities. Basic health care services include:\n(1) those services covered by the medical assistance state plan except for ICF/DD services, home and community-based waiver services, case management for persons with developmental disabilities under section 256B.0625, subdivision 20a, and personal care and certain home care services defined by the commissioner in consultation with the stakeholder group established under paragraph (d); and\n(2) basic health care services may also include risk for up to 100 days of nursing facility services for persons who reside in a noninstitutional setting and home health services related to rehabilitation as defined by the commissioner after consultation with the stakeholder group.\nThe commissioner may exclude other medical assistance services from the basic health care benefit set. Enrollees in these plans can access any excluded services on the same basis as other medical assistance recipients who have not enrolled.\n(b) The commissioner may contract with demonstration providers and current and former sponsors of qualified Medicare special needs plans, to provide basic health care services under medical assistance to persons who are dually eligible for both Medicare and Medicaid and those Social Security beneficiaries eligible for Medicaid but in the waiting period for Medicare. The commissioner shall consult with the stakeholder group under paragraph (d) in developing program specifications for these services. Payment for Medicaid services provided under this subdivision for the months of May and June will be made no earlier than July 1 of the same calendar year.\n(c) Notwithstanding subdivision 4, beginning January 1, 2012, the commissioner shall enroll persons with disabilities in managed care under this section, unless the individual chooses to opt out of enrollment. The commissioner shall establish enrollment and opt out procedures consistent with applicable enrollment procedures under this section.\n(d) The commissioner shall establish a state-level stakeholder group to provide advice on managed care programs for persons with disabilities, including both MnDHO and contracts with special needs plans that provide basic health care services as described in paragraphs (a) and (b). The stakeholder group shall provide advice on program expansions under this subdivision and subdivision 23, including:\n(1) implementation efforts;\n(2) consumer protections; and\n(3) program specifications such as quality assurance measures, data collection and reporting, and evaluation of costs, quality, and results.\n(e) Each plan under contract to provide medical assistance basic health care services shall establish a local or regional stakeholder group, including representatives of the counties covered by the plan, members, consumer advocates, and providers, for advice on issues that arise in the local or regional area.\n(f) The commissioner is prohibited from providing the names of potential enrollees to health plans for marketing purposes. The commissioner shall mail no more than two sets of marketing materials per contract year to potential enrollees on behalf of health plans, at the health plan's request. The marketing materials shall be mailed by the commissioner within 30 days of receipt of these materials from the health plan. The health plans shall cover any costs incurred by the commissioner for mailing marketing materials.\nIn negotiating prepaid health plan contract rates, the commissioner of human services shall take into consideration, and the rates shall reflect, the anticipated savings in the medical assistance program due to extending medical assistance coverage to services provided in licensed birth centers, the anticipated use of these services within the medical assistance population, and the reduced medical assistance costs associated with the use of birth centers for normal, low-risk deliveries.\n(a) For the purposes of this subdivision, \"alternative format\" means a medium other than paper and \"prepaid health plan\" means managed care plans and county-based purchasing plans.\n(b) A prepaid health plan may provide in an alternative format a provider directory and certificate of coverage, or materials otherwise required to be available in writing under Code of Federal Regulations, title 42, section 438.10, or under the commissioner's contract with the prepaid health plan, if the following conditions are met:\n(1) the prepaid health plan, local agency, or commissioner, as applicable, informs the enrollee that:\n(i) an alternative format is available and the enrollee affirmatively requests of the prepaid health plan that the provider directory, certificate of coverage, or materials otherwise required under Code of Federal Regulations, title 42, section 438.10, or under the commissioner's contract with the prepaid health plan be provided in an alternative format; and\n(ii) a record of the enrollee request is retained by the prepaid health plan in the form of written direction from the enrollee or a documented telephone call followed by a confirmation letter to the enrollee from the prepaid health plan that explains that the enrollee may change the request at any time;\n(2) the materials are sent to a secure electronic mailbox and are made available at a password-protected secure electronic website or on a data storage device if the materials contain enrollee data that is individually identifiable;\n(3) the enrollee is provided a customer service number on the enrollee's membership card that may be called to request a paper version of the materials provided in an alternative format; and\n(4) the materials provided in an alternative format meets all other requirements of the commissioner regarding content, size of the typeface, and any required time frames for distribution. \"Required time frames for distribution\" must permit sufficient time for prepaid health plans to distribute materials in alternative formats upon receipt of enrollees' requests for the materials.\n(c) A prepaid health plan may provide in an alternative format its primary care network list to the commissioner and to local agencies within its service area. The commissioner or local agency, as applicable, shall inform a potential enrollee of the availability of a prepaid health plan's primary care network list in an alternative format. If the potential enrollee requests an alternative format of the prepaid health plan's primary care network list, a record of that request shall be retained by the commissioner or local agency. The potential enrollee is permitted to withdraw the request at any time.\nThe prepaid health plan shall submit sufficient paper versions of the primary care network list to the commissioner and to local agencies within its service area to accommodate potential enrollee requests for paper versions of the primary care network list.\n(d) A prepaid health plan may provide in an alternative format materials otherwise required to be available in writing under Code of Federal Regulations, title 42, section 438.10, or under the commissioner's contract with the prepaid health plan, if the conditions of paragraphs (b) and (c) are met for persons who are eligible for enrollment in managed care.\n(e) The commissioner shall consult with managed care plans, county-based purchasing plans, counties, and other interested parties to determine how materials required to be made available to enrollees under Code of Federal Regulations, title 42, section 438.10, or under the commissioner's contract with a prepaid health plan may be provided in an alternative format on the basis that the enrollee has not opted in to receive the alternative format. The commissioner shall consult with managed care plans, county-based purchasing plans, counties, and other interested parties to develop recommendations relating to the conditions that must be met for an opt-out process to be granted.\n(a) Beginning September 1, 2011, the commissioner shall reduce payments and limit future rate increases paid to managed care plans and county-based purchasing plans. The limits in paragraphs (a) to (f) shall be achieved on a statewide aggregate basis by program. The commissioner may use competitive bidding, payment reductions, or other reductions to achieve the reductions and limits in this subdivision.\n(b) Beginning September 1, 2011, the commissioner shall reduce payments to managed care plans and county-based purchasing plans as follows:\n(1) 2.0 percent for medical assistance elderly basic care. This shall not apply to Medicare cost-sharing, nursing facility, personal care assistance, and elderly waiver services;\n(2) 2.82 percent for medical assistance families and children;\n(3) 10.1 percent for medical assistance adults without children; and\n(4) 6.0 percent for MinnesotaCare families and children.\n(c) Beginning January 1, 2012, the commissioner shall limit rates paid to managed care plans and county-based purchasing plans for calendar year 2012 to a percentage of the rates in effect on August 31, 2011, as follows:\n(1) 98 percent for medical assistance elderly basic care. This shall not apply to Medicare cost-sharing, nursing facility, personal care assistance, and elderly waiver services;\n(2) 97.18 percent for medical assistance families and children;\n(3) 89.9 percent for medical assistance adults without children; and\n(4) 94 percent for MinnesotaCare families and children.\n(d) Beginning January 1, 2013, to December 31, 2013, the commissioner shall limit the maximum annual trend increases to rates paid to managed care plans and county-based purchasing plans as follows:\n(1) 7.5 percent for medical assistance elderly basic care. This shall not apply to Medicare cost-sharing, nursing facility, personal care assistance, and elderly waiver services;\n(2) 5.0 percent for medical assistance special needs basic care;\n(3) 2.0 percent for medical assistance families and children;\n(4) 3.0 percent for medical assistance adults without children;\n(5) 3.0 percent for MinnesotaCare families and children; and\n(6) 3.0 percent for MinnesotaCare adults without children.\n(e) The commissioner may limit trend increases to less than the maximum. Beginning July 1, 2014, the commissioner shall limit the maximum annual trend increases to rates paid to managed care plans and county-based purchasing plans as follows for calendar years 2014 and 2015:\n(1) 7.5 percent for medical assistance elderly basic care. This shall not apply to Medicare cost-sharing, nursing facility, personal care assistance, and elderly waiver services;\n(2) 5.0 percent for medical assistance special needs basic care;\n(3) 2.0 percent for medical assistance families and children;\n(4) 3.0 percent for medical assistance adults without children;\n(5) 3.0 percent for MinnesotaCare families and children; and\n(6) 4.0 percent for MinnesotaCare adults without children.\nThe commissioner may limit trend increases to less than the maximum. For calendar year 2014, the commissioner shall reduce the maximum aggregate trend increases by $47,000,000 in state and federal funds to account for the reductions in administrative expenses in subdivision 5i.\n(a) Beginning January 1, 2020, and ending June 30, 2024, the commissioner of human services may, to the extent practicable, limit the year over year increase in rates paid to managed care plans and county-based purchasing plans under this section and section 256B.692 by an amount equal to the value of a 0.8 percent reduction in rates in medical assistance across all products. Managed care rates must meet actuarial soundness and rate development requirements under Code of Federal Regulations, title 42, part 438, subpart A. Forecast expenditure growth assumptions cannot be part of the rate-setting process.\n(b) In the November 2019 forecast, the commissioner of human services, in consultation with the commissioner of management and budget, shall determine the extent to which the year over year change in managed care and county-based purchasing plan rates are forecasted to reduce medical assistance expenditures in fiscal years 2020 through 2024, relative to projected expenditures from the end of the 2019 legislative session that establish a budget for the Department of Human Services. To the extent the total value of the reduction is less than $145,150,000, the commissioner of management and budget shall transfer the difference from the premium security account established in section 62E.25, subdivision 1, to the general fund.\n[Repealed, 2015 c 71 art 11 s 65]\n(a) The commissioner shall require managed care plans and county-based purchasing plans, as a condition of contract, to implement strategies that facilitate access for young children between the ages of one and three years to periodic developmental and social-emotional screenings, as recommended by the Minnesota Interagency Developmental Screening Task Force, and that those children who do not meet milestones are provided access to appropriate evaluation and assessment, including treatment recommendations, expected to improve the child's functioning, with the goal of meeting milestones by age five.\n(b) The following information from encounter data provided to the commissioner shall be reported on the department's public website for each managed care plan and county-based purchasing plan annually by July 31 of each year beginning in 2014:\n(1) the number of children who received a diagnostic assessment;\n(2) the total number of children ages one to six with a diagnosis of autism spectrum disorder who received treatments;\n(3) the number of children identified under clause (2) reported by each 12-month age group beginning with age one and ending with age six; and\n(4) the types of treatments provided to children identified under clause (2) listed by billing code, including the number of units billed for each child.\n(c) The managed care plans and county-based purchasing plans shall also report on any barriers to providing screening, diagnosis, and treatment of young children between the ages of one and three years, any strategies implemented to address those barriers, and make recommendations on how to measure and report on the effectiveness of the strategies implemented to facilitate access for young children to provide developmental and social-emotional screening, diagnosis, and treatment as described in paragraph (a).\n(a) For managed care contracts effective on or after January 1, 2014, the commissioner may utilize a competitive price bidding program for nonelderly, nondisabled adults and children in medical assistance and MinnesotaCare in the seven-county metropolitan area. The program must allow a minimum of two managed care plans to serve the metropolitan area.\n(b) In designing the competitive bid program, the commissioner shall consider, and incorporate where appropriate, the procedures and criteria used in the competitive bidding pilot authorized under Laws 2011, First Special Session chapter 9, article 6, section 96. The pilot program operating in Hennepin County under the authority of section 256B.0756 shall continue to be exempt from competitive bid.\n(c) The commissioner shall use past performance data as a factor in selecting vendors and shall consider this information, along with competitive bid and other information, in determining whether to contract with a managed care plan under this subdivision. Where possible, the assessment of past performance in serving persons on public programs shall be based on encounter data submitted to the commissioner. The commissioner shall evaluate past performance based on both the health outcomes of care and success rates in securing participation in recommended preventive and early diagnostic care. Data provided by managed care plans must be provided in a uniform manner as specified by the commissioner and must include only data on medical assistance and MinnesotaCare enrollees. The data submitted must include health outcome measures on reducing the incidence of low birth weight established by the managed care plan under subdivision 32.\nThe commissioner shall conduct a supplemental recovery program for third-party liabilities identified through coordination of benefits not recovered by managed care plans and county-based purchasing plans for state public health programs. Any third-party liability identified through coordination of benefits and recovered by the commissioner more than eight months after the date a managed care plan or county-based purchasing plan adjudicates a health care claim shall be retained by the commissioner and deposited in the general fund. The commissioner shall establish a mechanism, including a reconciliation process, for managed care plans and county-based purchasing plans to coordinate third-party liability collections efforts resulting from coordination of benefits under this subdivision with the commissioner to ensure there is no duplication of efforts. The coordination mechanism must be consistent with the reporting requirements in subdivision 9c. The commissioner shall share accurate and timely third-party liability data with managed care plans and county-based purchasing plans.\n(a) For calendar year 2015, the commissioner may extend a demonstration provider's contract under this section for a sixth year after the most recent procurement. For calendar year 2015, section 16B.98, subdivision 5, paragraph (b), and section 16C.05, subdivision 2, paragraph (b), shall not apply to contracts under this section.\n(b) For calendar year 2016 contracts under this section, the commissioner shall procure through a statewide procurement, which includes all 87 counties, demonstration providers, and participating entities as defined in section 256L.01, subdivision 7. The commissioner shall publish a request for proposals by January 5, 2015. As part of the procurement process, the commissioner shall:\n(1) seek each individual county's input;\n(2) organize counties into regional groups, and consider single counties for the largest and most diverse counties; and\n(3) seek regional and county input regarding the respondent's ability to fully and adequately deliver required health care services, offer an adequate provider network, provide care coordination with county services, and serve special populations, including enrollees with language and cultural needs.\n(a) The commissioner shall establish an enrollee support system that provides support to an enrollee before and during enrollment in a managed care plan.\n(b) The enrollee support system must:\n(1) provide access to counseling for each potential enrollee on choosing a managed care plan;\n(2) assist an enrollee in understanding enrollment in a managed care plan;\n(3) provide an access point for complaints regarding enrollment, covered services, and other related matters;\n(4) provide information on an enrollee's grievance and appeal rights within the managed care organization and the state's fair hearing process, including an enrollee's rights and responsibilities; and\n(5) provide assistance to an enrollee, upon request, in navigating the grievance and appeals process within the managed care organization and in appealing adverse benefit determinations made by the managed care organization to the state's fair hearing process after the managed care organization's internal appeals process has been exhausted. Assistance does not include providing representation to an enrollee at the state's fair hearing, but may include a referral to appropriate legal representation sources.\n(c) Outreach to enrollees through the support system must be accessible to an enrollee through multiple formats, including telephone, Internet, in-person, and, if requested, through auxiliary aids and services.\n(d) The commissioner may designate enrollment brokers to assist enrollees on selecting a managed care organization and providing necessary enrollment information. For purposes of this subdivision, \"enrollment broker\" means an individual or entity that performs choice counseling or enrollment activities in accordance with Code of Federal Regulations, part 42, section 438.810, or both.\n(a) The commissioner shall ensure that a managed care organization's network providers are enrolled with the commissioner as medical assistance providers, and that the providers comply with the provider disclosure, screening, and enrollment requirements in Code of Federal Regulations, part 42, section 455. A provider that has a network provider contract with the managed care organization is not required to provide services to a medical assistance or MinnesotaCare recipient who is receiving services through the fee-for-service system.\n(b) A managed care organization may enter into a network provider contract with a provider that is not a medical assistance provider for a period of up to 120 days pending the outcome of the medical assistance provider enrollment process. A managed care organization must terminate the contract upon notification that the provider cannot be enrolled as a medical assistance provider or upon expiration of the 120-day period if notification has not been received within that period. The managed care organization must notify each affected enrollee of the provider contract termination.\n(c) For purposes of this subdivision, \"network provider\" means any provider, group of providers, entity with a network provider agreement with the managed care organization, or subcontractor that receives payments from the managed care organization either directly or indirectly to provide services under a managed care contract between the commissioner and the managed care organization.",
	"repealed": false
}