{
	"id": "148.754",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.754",
	"title": "148.754 EXAMINATION; ACCESS TO MEDICAL DATA.",
	"text": "(a) If the board has probable cause to believe that a licensee comes under section 148.75, paragraph (a), clause (2), it may direct the licensee to submit to a mental or physical examination. For the purpose of this paragraph, every licensee is deemed to have consented to submit to a mental or physical examination when directed in writing by the board and further to have waived all objections to the admissibility of the examining physicians' testimony or examination reports on the ground that they constitute a privileged communication. Failure of the licensee to submit to an examination when directed constitutes an admission of the allegations against the person, unless the failure was due to circumstances beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A licensee affected under this paragraph shall, at reasonable intervals, be given an opportunity to demonstrate that the person can resume the competent practice of physical therapy with reasonable skill and safety to the public.\n(b) In any proceeding under paragraph (a), neither the record of proceedings nor the orders entered by the board shall be used against a licensee in any other proceeding.\n(c) In addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384, 144.651, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the person's or applicant's consent if the board has probable cause to believe that the person comes under paragraph (a). The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this paragraph and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this paragraph, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this paragraph is classified as private under sections 13.01 to 13.87.",
	"repealed": false
}