{
	"id": "62J.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.92",
	"title": "62J.92 DETERMINATIONS; COMPLIANCE; REMEDIES.",
	"text": "(a) In the event the board finds that the spending on a prescription drug product reviewed under section 62J.91 creates an affordability challenge for the state health care system or for patients, the board shall establish an upper payment limit after considering:\n(1) extraordinary supply costs, if applicable;\n(2) the range of prices at which the drug is sold in the United States according to one or more pricing files accessed under section 62J.90, subdivision 1, and the range at which pharmacies are reimbursed in Canada; and\n(3) any other relevant pricing and administrative cost information for the drug.\n(b) An upper payment limit applies to all purchases of, and payer reimbursements for, a prescription drug that is dispensed or administered to individuals in the state in person, by mail, or by other means, and for which an upper payment limit has been established.\n(c) In determining whether a drug creates an affordability challenge or determining an upper payment limit amount, the board may not use cost-effectiveness analyses that include the cost-per-quality adjusted life year or similar measure to identify subpopulations for which a treatment would be less cost-effective due to severity of illness, age, or pre-existing disability. For any treatment that extends life, if the board uses cost-effectiveness results, it must use results that weigh the value of all additional lifetime gained equally for all patients no matter their severity of illness, age, or pre-existing disability.\n(a) An upper payment limit may take effect no sooner than 120 days following the date of its public release by the board.\n(b) When setting an upper payment limit for a drug subject to the Medicare maximum fair price under United States Code, title 42, section 1191(c), the board shall set the upper payment limit at the Medicare maximum fair price.\n(c) Health plan companies and pharmacy benefit managers shall report annually to the board, in the form and manner specified by the board, on how cost savings resulting from the establishment of an upper payment limit have been used by the health plan company or pharmacy benefit manager to benefit enrollees, including but not limited to reducing enrollee cost-sharing.\n(a) The board shall, and other persons may, notify the Office of the Attorney General of a potential failure by an entity subject to an upper payment limit to comply with that limit.\n(b) If the Office of the Attorney General finds that an entity was noncompliant with the upper payment limit requirements, the attorney general may pursue remedies consistent with chapter 8 or appropriate criminal charges if there is evidence of intentional profiteering.\n(c) An entity who obtains price concessions from a drug manufacturer that result in a lower net cost to the stakeholder than the upper payment limit established by the board is not considered noncompliant.\n(d) The Office of the Attorney General may provide guidance to stakeholders concerning activities that could be considered noncompliant.\n(a) Persons affected by a decision of the board may request an appeal of the board's decision within 30 days of the date of the decision. The board shall hear the appeal and render a decision within 60 days of the hearing.\n(b) All appeal decisions are subject to judicial review in accordance with chapter 14.",
	"repealed": false
}