{
	"id": "48.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.39",
	"title": "48.39 TRUST ACCOUNTS RECORDED.",
	"text": "Besides its general books of account, it shall keep separate books of account for all fiduciary accounts. All funds and property held by it in a fiduciary capacity shall at all times be kept separate from its own funds and property, and all fiduciary funds deposited or held as fiduciary by the bank awaiting investment shall be carried in a separate account, and shall not be used by the bank in the conduct of its business, unless the bank, under authorization by its board of directors, first delivers to the commissioner of commerce, as collateral security: (1) bonds, notes, bills, certificates of indebtedness or other direct obligations of the United States or its instrumentalities, or obligations fully guaranteed by the United States as to principal and interest; or (2) other readily marketable securities of the classes in which said trust companies or state banks exercising trust powers are authorized or permitted to invest trust funds under the laws of this state. The securities so deposited as collateral shall be owned by the bank and shall at all times be at least equal in market value to the amount of the trust funds so used in the conduct of the bank's business, and all deposits made by it of such funds in any other banking institutions shall be deposited as fiduciary funds, to its credit as fiduciary, and not otherwise. Every security or property in which the funds held by it as trustee, personal representative, guardian, conservator, receiver, or assignee, or in any other fiduciary capacity are invested, shall at once upon receipt thereof be immediately entered in the proper books as belonging to the particular fiduciary account whose funds have been invested therein. Any change in such investment shall be fully specified in and under the account of the particular fiduciary account to which it belongs so that all fiduciary funds and property can be readily identified at any time by any person. It shall be unlawful for any bank to lend any officer, director or employee any funds held as fiduciary under the powers conferred by section 48.37. Any officer, director or employee to whom such a loan is made shall be guilty of theft of the amount of such loan from the time of the making thereof. Any state bank, when acting in a fiduciary capacity, either alone or jointly with an individual or individuals, may, with the consent of such individual fiduciary or fiduciaries, who are hereby authorized to give such consent, cause any stocks, securities, or other property now held or hereafter acquired in such capacity to be registered and held in the name of a nominee or nominees of such state bank without mention of the fiduciary relationship. Any such state bank shall be liable for any loss occasioned by the acts of any of its nominees with respect to such stocks, securities or other property so registered.",
	"repealed": false
}