{
	"id": "174.595",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.595",
	"title": "174.595 TRANSPORTATION FACILITIES CAPITAL PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Capital building asset\" includes but is not limited to district headquarters buildings, truck stations, salt storage or other unheated storage buildings, deicing and anti-icing facilities, fuel dispensing facilities, highway rest areas, and vehicle weigh and inspection stations.\n(c) \"Commissioner\" means the commissioner of transportation.\n(d) \"Department\" means the Department of Transportation.\n(e) \"Program\" means the transportation facilities capital program established in this section.\nThe commissioner must establish a transportation facilities capital program in conformance with this section to provide for capital building asset projects related to buildings and other capital facilities of the department.\n(a) A transportation facilities capital account is established in the trunk highway fund. The account consists of money appropriated from the trunk highway fund for the purposes of the program and any other money donated, allotted, transferred, or otherwise provided to the account by law.\n(b) A transportation facilities capital subaccount is established in the bond proceeds account in the trunk highway fund. The subaccount consists of trunk highway bond proceeds appropriated to the commissioner for the purposes of the program. Money in the subaccount may only be expended on trunk highway purposes, including the purposes specified in this section.\nThe commissioner must establish a process to implement the program that includes allocation of funding based on review of eligible projects as provided under subdivision 5 and prioritization as provided under subdivision 6. The process must be in conformance with trunk highway fund uses for the purposes of constructing, improving, and maintaining the trunk highway system in the state pursuant to the Minnesota Constitution, article XIV.\nA project is eligible under this section only if the project:\n(1) involves the construction, improvement, or maintenance of a capital building asset that is part of the trunk highway system;\n(2) accomplishes at least one of the following:\n(i) supports the programmatic mission of the department;\n(ii) extends the useful life of existing buildings; or\n(iii) renovates or constructs facilities to meet the department's current and future operational needs; and\n(3) complies with the sustainable building guidelines provided in section 16B.325.\nIn prioritizing funding allocation among projects under the program, the commissioner must consider:\n(1) whether a project ensures the effective and efficient condition and operation of the facility;\n(2) the urgency in ensuring the safe use of existing buildings;\n(3) the project's total life-cycle cost;\n(4) additional criteria for priorities otherwise specified in law that apply to a category listed in the act making an appropriation for the program; and\n(5) any other criteria the commissioner deems necessary.",
	"repealed": false
}