{
	"id": "60A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.11",
	"title": "60A.11 INVESTMENTS PERMITTED FOR DOMESTIC COMPANIES.",
	"text": "The capital of every stock company shall be paid in full, in cash, within six months from the date of its certificate of incorporation, and thereupon a majority of the directors shall certify, under oath, to the commissioner that such payment, in cash, has been made by the stockholders for their respective shares, and is held as the capital of the company, and until then no policy shall be issued.\n[Repealed, 1981 c 211 s 42]\n[Repealed, 1981 c 211 s 42]\n[Repealed, 1981 c 211 s 42]\n[Repealed, 1981 c 211 s 42]\n[Repealed, 1982 c 424 s 9]\n[Repealed, 1982 c 424 s 9]\n[Repealed, 1981 c 211 s 42]\nNo officer, director, or member of any committee passing on investments shall borrow any of such funds, or become, directly or indirectly, liable as a surety or endorser for or on account of loans thereof to others, or receive for personal use any fee, brokerage, commission, gift, or other consideration for, or on account of, any loan made by or on behalf of the company.\n[Repealed, 1981 c 211 s 42]\nThe following considerations apply in the interpretation of this section:\n(a) this section applies to the investments of insurance companies other than life and health insurance companies;\n(b) the purpose of this section is to protect and further the interests of policyholders, claimants, creditors and the public by providing standards for the development and administration of programs for the investment of the assets of domestic companies. These standards and the investment programs developed by companies must take into account the safety of company's principal, investment yield and growth, stability in the value of the investment, the liquidity necessary to meet the company's expected business needs, and investment diversification;\n(c) all financial terms relating to insurance companies have the meanings assigned to them under statutory accounting methods. All financial terms relating to noninsurance companies have the meanings assigned to them under generally accepted accounting principles;\n(d) investments must be valued in accordance with the valuation procedures established by the National Association of Insurance Commissioners, unless the commissioner requires or finds another method of valuation reasonable under the circumstances. Another method of valuation permitted by the commissioner must be at least as conservative as those prescribed in the association's manual. Other invested assets must be valued according to the procedures promulgated by the National Association of Insurance Commissioners, if not addressed in another section, unless the commissioner requires or finds another method of valuation reasonable under the circumstances;\n(e) a company may elect to hold an investment which qualifies under more than one subdivision, under the subdivision of its choice. Nothing herein prevents a company from electing to hold an investment under a subdivision different from the one in which it previously held the investment; and\n(f) an investment which qualifies under any provision of the law governing investments of insurance companies when acquired will continue to be a qualified investment for as long as it is held by the insurance company.\nThe following terms have the meanings assigned in this subdivision for purposes of this section:\n(a) \"adequate evidence\" means a written confirmation, advice, or other verification issued by a depository, issuer, or custodian bank which shows that the investment is held for the company;\n(b) \"adequate security\" means a letter of credit qualifying under subdivision 11, paragraph (f), cash, or the pledge of an investment authorized by any subdivision of this section;\n(c) \"admitted assets,\" for purposes of computing percentage limitations on particular types of investments, means the assets as shown by the company's annual statement, required by section 60A.13, as of the December 31 immediately preceding the date the company acquires the investment;\n(d) \"clearing corporation\" means The Depository Trust Company or any other clearing agency registered with the Securities and Exchange Commission pursuant to the Securities Exchange Act of 1934, section 17A, Euro-clear Clearance System Limited and CEDEL S.A., and, with the approval of the commissioner, any other clearing corporation as defined in section 336.8-102;\n(e) \"control\" has the meaning assigned to that term in, and must be determined in accordance with, section 60D.15, subdivision 4;\n(f) \"custodian bank\" means a bank or trust company or a branch of a bank or trust company that is acting as custodian and is supervised and examined by state or federal authority having supervision over the bank or trust company or with respect to a company's foreign investments only by the regulatory authority having supervision over banks or trust companies in the jurisdiction in which the bank, trust company, or branch is located, and any banking institutions qualifying as an \"Eligible Foreign Custodian\" under the Code of Federal Regulations, section 270.17f-5, adopted under section 17(f) of the Investment Company Act of 1940, and specifically including Euro-clear Clearance System Limited and CEDEL S.A., acting as custodians;\n(g) \"evergreen clause\" means a provision that automatically renews a letter of credit for a time certain if the issuer of the letter of credit fails to affirmatively signify its intention to nonrenew upon expiration;\n(h) \"government obligations\" means direct obligations for the payment of money, or obligations for the payment of money to the extent guaranteed as to the payment of principal and interest by any governmental issuer where the obligations are payable from ad valorem taxes or guaranteed by the full faith, credit, and taxing power of the issuer and are not secured solely by special assessments for local improvements;\n(i) \"noninvestment grade obligations\" means obligations which, at the time of acquisition, were rated below Baa/BBB or the equivalent by a securities rating agency or which, at the time of acquisition, were not in one of the two highest categories established by the Securities Valuation Office of the National Association of Insurance Commissioners;\n(j) \"issuer\" means the corporation, business trust, governmental unit, partnership, association, individual, or other entity which issues or on behalf of which is issued any form of obligation;\n(k) \"licensed real estate appraiser\" means a person who develops and communicates real estate appraisals and who holds a current, valid license under chapter 82B or a substantially similar licensing requirement in another jurisdiction;\n(l) \"member bank\" means a national bank, state bank or trust company which is a member of the Federal Reserve System;\n(m) \"national securities exchange\" means an exchange registered under section 6 of the Securities Exchange Act of 1934 or an exchange regulated under the laws of the Dominion of Canada;\n(n) \"NASDAQ\" means the reporting system for securities meeting the definition of National Market System security as provided under Part I to Schedule D of the National Association of Securities Dealers Incorporated bylaws;\n(o) \"obligations\" include bonds, notes, debentures, transportation equipment certificates, repurchase agreements, bank certificates of deposit, time deposits, bankers' acceptances, and other obligations for the payment of money not in default as to payments of principal and interest on the date of investment, whether constituting general obligations of the issuer or payable only out of certain revenues or certain funds pledged or otherwise dedicated for payment. Leases are considered obligations if the lease is assigned for the benefit of the company and is nonterminable by the lessee or lessees thereunder upon foreclosure of any lien upon the leased property, and rental payments are sufficient to amortize the investment over the primary lease term;\n(p) \"qualified assets\" means the sum of (1) all investments qualified in accordance with this section other than investments in affiliates and subsidiaries, (2) investments in obligations of affiliates as defined in section 60D.15, subdivision 2, secured by real or personal property sufficient to qualify the investment under subdivision 19 or 23, (3) qualified investments in subsidiaries, as defined in section 60D.15, subdivision 9, on a consolidated basis with the insurance company without allowance for goodwill or other intangible value, and (4) cash on hand and on deposit, agent's balances or uncollected premiums not due more than 90 days, investment income due and accrued, funds due or on deposit or recoverable on loss payments under contracts of reinsurance entered into pursuant to section 60A.09, premium bills and notes receivable, federal income taxes recoverable, and equities and deposits in pools and associations;\n(q) \"qualified net earnings\" means that the net earnings of the issuer after elimination of extraordinary nonrecurring items of income and expense and before income taxes and fixed charges over the five immediately preceding completed fiscal years, or its period of existence if less than five years, has averaged not less than 1-1/4 times its average annual fixed charges applicable to the period;\n(r) \"replicated investment position\" means the statement value of the position reported under the heading \"Replicated (Synthetic) Asset\" on Schedule DB, Part F, of the annual statement of the insurer, or any successor provision;\n(s) \"replication transaction\" means a derivative transaction that is intended to replicate the performance of one or more assets that an insurer is authorized to acquire under this section. A derivative transaction that either is authorized by subdivision 18, clause (5), or by subdivision 24, or is entered into as a hedging transaction shall not be considered a replication transaction;\n(t) \"required liabilities\" means the sum of (1) total liabilities as required to be reported in the company's most recent annual report to the commissioner of commerce of this state, (2) for companies operating under the stock plan, the minimum paid-up capital and surplus required to be maintained pursuant to section 60A.07, subdivision 5a, (3) for companies operating under the mutual or reciprocal plan, the minimum amount of surplus required to be maintained pursuant to section 60A.07, subdivision 5b, and (4) the amount, if any, by which the company's loss and loss adjustment expense reserves exceed 350 percent of its surplus as it pertains to policyholders as of the same date. The commissioner may waive the requirement in clause (4) unless the company's written premiums exceed 300 percent of its surplus as it pertains to policyholders as of the same date. In addition to the required amounts pursuant to clauses (1) to (4), the commissioner may require that the amount of any apparent reserve deficiency that may be revealed by one-to-five-year loss and loss adjustment expense development analysis for the five years reported in the company's most recent annual statement to the commissioner be added to required liabilities;\n(u) \"revenue obligations\" means obligations for the payment of money by a governmental issuer where the obligations are payable from revenues, earnings, or special assessments on properties benefited by local improvements of the issuer which are specifically pledged therefor;\n(v) \"security\" has the meaning given in section 5 of the Security Act of 1933 and specifically includes, but is not limited to, stocks, stock equivalents, warrants, rights, options, obligations, American Depository Receipts (ADRs), repurchase agreements, and reverse repurchase agreements; and\n(w) \"unrestricted surplus\" means the amount by which qualified assets exceed 110 percent of required liabilities.\nA company's investments shall be held in its own name or the name of its nominee, except that:\n(a) Investments may be held in the name of a clearing corporation or of a custodian bank or in the name of the nominee of either on the following conditions:\n(1) the clearing corporation, custodian bank, or nominee must be legally authorized to hold the particular investment for the account of others;\n(2) where the investment is evidenced by a certificate and held in the name of a custodian bank or the nominee by a custodian bank, a written agreement shall provide that certificates so deposited shall at all times be kept separate and apart from other deposits with the depository, so that at all times they may be identified as belonging solely to the company making the deposit;\n(3) where a clearing corporation is to act as depository, the investment may be merged or held in bulk in the clearing corporation's or its nominee name with other investments deposited with the clearing corporation by any other person, if a written agreement provides that adequate evidence of the deposit is to be obtained and retained by the company or a custodian bank; and\n(4) the company shall monitor current publicly available financial information and other pertinent data with respect to the custodian banks.\n(b) A company may loan securities held by it under this chapter to a broker-dealer registered under the Securities and Exchange Act of 1934 or a member bank. The loan must be evidenced by a written agreement which provides:\n(1) that the loan will be fully collateralized by cash or obligations issued or guaranteed by the United States or an agency or an instrumentality thereof, and that the collateral will be adjusted each business day during the term of the loan to maintain the required collateralization in the event of market value changes in the loaned securities or collateral;\n(2) that the loan may be terminated by the company at any time, and that the borrower will return the loaned securities or their equivalent within five business days after termination;\n(3) that the company has the right to retain the collateral or use the collateral to purchase investments equivalent to the loaned securities if the borrower defaults under the terms of the agreement and that the borrower remains liable for any losses and expenses incurred by the company due to default that are not covered by the collateral.\n(c) A company may participate through a member bank in the Federal Reserve book-entry system, and the records of the member bank shall at all times show that the investments are held for the company or for specific accounts of the company.\n(d) An investment may consist of an individual interest in a pool of obligations or a fractional interest in a single obligation if the certificate of participation or interest or the confirmation of participation or interest in the investment shall be issued in the name of the company or the name of the custodian bank or the nominee of either and if the certificate or confirmation must, if held by a custodian bank, be kept separate and apart from the investments of others so that at all times the participation may be identified as belonging solely to the company making the investment.\n(e) Except as provided in paragraph (c), where an investment is not evidenced by a certificate, adequate evidence of the company's investment shall be obtained from the issuer or its transfer or recording agent and retained by the company, a custodian bank, or clearing corporation. Transfers of ownership of investments held as described in paragraphs (a), clause (3), (c) and (d) may be evidenced by bookkeeping entry on the books of the issuer of the investment or its transfer or recording agent or the clearing corporation without physical delivery of certificates, if any, evidencing the company's investment.\n(f) A letter of credit may be accepted as a guaranty of other investments, as collateral to secure loans, or in lieu of cash to secure loans of securities, if it is issued by a member bank or any of the 100 largest banks in the world ranked by deposits in dollars or converted into dollar equivalents, as compiled annually by the American Bankers Association or listed in the annual publication of Moody's Bank & Finance Manual and meets the following requirements:\n(1) has a long-term deposit rating or a long-term debt rating of at least Aa2 as found in the current monthly publication of Moody's Credit Opinions or its equivalent; and\n(2) qualifies under the guidelines of the National Association of Insurance Commissioners as a clean, irrevocable letter of credit containing an evergreen clause or having a maturity date subsequent to the maturity date of the underlying investment or loan. The company shall monitor current publicly available financial information and other pertinent data with respect to the banks issuing the letters of credit.\nUnder the standards and procedures in sections 60G.20 to 60G.22 for individual insurers, the commissioner may impose additional limitations on all insurers on the types and percentages of investments as the commissioner determines necessary to protect and ensure the safety of the general public.\n(a) A company must comply with section 60A.112.\n(b) A company's investments must be so diversified that the securities of a single issuer, other than the United States of America or any agency or instrumentality of the United States of America backed by the full faith and credit of the issuer, shall comprise no more than five percent of the company's admitted assets, except where otherwise specified under this chapter. In the case of insurance companies which are subsidiaries of a company, this diversification test must be applied to the assets of the insurance company subsidiary in determining the company's compliance.\n(c) The investments authorized under subdivisions 12 to 26 shall constitute admitted assets for a company.\n(a) Obligations issued or guaranteed by the United States of America or any agency or instrumentality of the United States of America backed by the full faith and credit of the issuer. Pursuant to section 106 of title I of the Secondary Mortgage Market Enhancement Act of 1984, United States Code, title 15, section 77r-1, included under this paragraph are obligations issued or guaranteed by the Federal Home Loan Mortgage Corporation and the Federal National Mortgage Association.\n(b) Obligations issued or guaranteed by an agency or instrumentality of the United States of America other than those backed by the full faith and credit thereof, including rights to purchase or sell these obligations if those rights are traded upon a contract market designated and regulated by a federal agency. The securities of a single issuer under this paragraph shall comprise no more than 20 percent of the company's admitted assets.\n(a) Certificates of deposits, time deposits, and bankers' acceptances issued by and other obligations guaranteed by: (i) any bank organized under the laws of the United States or any state, commonwealth, or territory thereof, including the District of Columbia, or of the Dominion of Canada or any province thereof or (ii) any of the 100 largest banks, not a subsidiary or a holding company thereof, in the world ranked by deposits in dollars or converted into dollar equivalents, as compiled annually by the American Bankers Association or listed in the annual publication of Moody's Bank & Finance Manual, which also has a long-term deposit rating or a long-term debt rating of at least Aa2 as found in the current monthly publication of Moody's Credit Opinions or its equivalent. A company may not invest more than five percent of its admitted assets in the obligations of any one bank and may not hold at any time more than ten percent of the outstanding obligations of any one bank.\n(b) Obligations issued or guaranteed by the International Bank for Reconstruction and Development, the Asian Development Bank, the Inter-American Development Bank, the African Development Bank, the Export-Import Bank, the World Bank or any United States government sponsored organization of which the United States is a member, if the principal and interest is payable in United States dollars. A company may not invest more than five percent of its total admitted assets in the obligations of any one of these banks or organizations, and may not invest more than a total of 15 percent of its total admitted assets in the obligations of all these banks and organizations.\n(a) Government obligations issued or guaranteed by any state, commonwealth, or territory of the United States of America or by any political subdivision thereof, including the District of Columbia, or by any instrumentality of any state, commonwealth, territory, or political subdivision thereof. The diversification requirement of subdivision 12, paragraph (b), does not apply to government obligations under this paragraph.\n(b) Revenue obligations issued by any state, commonwealth, or territory of the United States of America or by any political subdivision thereof, including the District of Columbia, or by any instrumentality of any state, commonwealth, territory, or political subdivision thereof. The diversification requirement of subdivision 12, paragraph (b), is applicable to revenue obligations under this paragraph.\n(a) Obligations issued or guaranteed by the Dominion of Canada or by any agency or instrumentality of the Dominion of Canada backed by the full faith and credit of the issuer. The diversification requirement of subdivision 12, paragraph (b), does not apply to government obligations under this paragraph.\n(b) Obligations issued or guaranteed by an agency or instrumentality of the Dominion of Canada other than those backed by the full faith and credit of the issuer. The securities of a single issuer under this paragraph shall comprise no more than 20 percent of the company's admitted assets.\n(c) Government obligations issued or guaranteed by a province or territory of the Dominion of Canada or by a political subdivision thereof, or by an instrumentality of a province, territory, or political subdivision thereof. The diversification requirement of subdivision 12, paragraph (b), does not apply to government obligations under this paragraph.\n(d) Revenue obligations issued by a province or territory of the Dominion of Canada or by a political subdivision thereof, or by an instrumentality of a province, territory, or political subdivision thereof. The diversification requirement of subdivision 12, paragraph (b), is applicable to revenue obligations under this paragraph.\nObligations issued, assumed or guaranteed by a corporation or business trust organized under the laws of the United States of America or any state, commonwealth, or territory of the United States, including the District of Columbia, or the laws of the Dominion of Canada or any province or territory of the Dominion of Canada, or obligations traded on a national securities exchange on the following conditions:\n(a) a company may invest in any obligations traded on a national securities exchange;\n(b) a company may also invest in any obligations which are secured by adequate security located in the United States or Canada;\n(c) a company may also invest in previously outstanding or newly issued obligations not qualifying for investment under paragraph (a) or (b) if the corporation or business trust has qualified net earnings. If the obligations are not newly issued, neither principal nor interest payments on the obligations shall have been in arrears (1) for an aggregate of 90 days during the three-year period preceding the date of investment, or (2) where the obligations have been outstanding for less than 90 days, during the period the obligations have been outstanding;\n(d) a company may invest no more than 15 percent of its total admitted assets in noninvestment grade obligations;\n(e) a company may invest in federal farm loan bonds and may invest up to 20 percent of its total admitted assets in the obligations of farm mortgage debenture companies; and\n(f) a company may not invest more than five percent of its admitted assets in the obligations of any one corporation or business trust; provided, however, that a company may invest in the obligations of a corporation without regard to this paragraph or the subdivision 12, paragraph (b), diversification requirement if: (1) the company is wholly owned by the issuer and affiliates of the issuer of the obligations; (2) the company insures solely the issuer of the obligations and its affiliates; (3) the issuer has a net worth, determined on a consolidated basis, which equals or exceeds $100,000,000; and (4) the issuer and its affiliates forgo any and all claims they may have against the Minnesota Insurance Guaranty Association pursuant to chapter 60C in the event of the insolvency of the company. This does not affect the rights of any unaffiliated third-party claimant under section 60C.09, subdivision 1.\n(a) Stocks issued or guaranteed by any corporation incorporated under the laws of the United States of America or any state, commonwealth, or territory of the United States, including the District of Columbia, or the laws of the Dominion of Canada or any province or territory of Canada, or stocks or stock equivalents, including American Depository Receipts or unit investment trusts, listed or regularly traded on a national securities exchange on the following conditions:\n(1) a company may not invest more than a total of 25 percent of its total admitted assets in stocks, stock equivalents, and convertible issues. Not more than ten percent of a company's total admitted assets may be invested in stocks, stock equivalents, and convertible issues not traded or listed on a national securities exchange or designated or approved for designation upon notice of issuance on the NASDAQ/National Market System. This limitation does not apply to investments under clause (4);\n(2) a company may not invest in more than two percent of its total admitted assets in preferred stocks of any corporation which are traded on a national securities exchange and may also invest in other preferred stocks if the issuer has qualified net earnings and if current or cumulative dividends are not then in arrears;\n(3) a company may not invest in more than two percent of its total admitted assets in common stocks, common stock equivalents, or securities convertible into common stock or common stock equivalents of any corporation or business trust which are traded on a national securities exchange or designated or approved for designation upon notice of issuance on the NASDAQ/National Market System, and may also invest in other common stocks, stock equivalents, and convertible issues subject to the limitations specified in clause (1);\n(4) a company may organize or acquire and hold voting control of a corporation or business trust through its ownership of common stock, common stock equivalents, or other securities, provided the corporation or business trust is: (i) a corporation providing investment advisory, banking, management or sale services to an investment company or to an insurance company, (ii) a data processing or computer service company, (iii) a mortgage loan corporation engaged in the business of making, originating, purchasing or otherwise acquiring or investing in, and servicing or selling or otherwise disposing of loans secured by mortgages on real property, (iv) a corporation if its business is owning and managing or leasing personal property, (v) a corporation providing securities underwriting services or acting as a securities broker or dealer, (vi) a real property holding, developing, managing, brokerage or leasing corporation, (vii) any domestic or foreign insurance company, (viii) any alien insurance company, if the organization or acquisition and the holding of the company is subject to the prior approval of the commissioner of commerce, which approval must be given upon good cause shown and is deemed to have been given if the commissioner does not disapprove of the organization or acquisition within 30 days after notification by the company, (ix) an investment subsidiary to acquire and hold investments which the company could acquire and hold directly, if the investments of the subsidiary are considered direct investments for purposes of this chapter and are subject to the same percentage limitations, requirements and restrictions as are contained herein, or (x) any corporation whose business has been approved by the commissioner as complementary or supplementary to the business of the company. A company may invest up to an aggregate of ten percent of its total admitted assets under items (i) to (v) of this clause. The diversification requirement of subdivision 12, paragraph (b), does not apply to this clause;\n(5) a company may invest in warrants and rights granted by an issuer to purchase securities of the issuer if that security of the issuer, at the time of the acquisition of the warrant or right to purchase, would qualify as an investment under paragraph (a), clause (2) or (3), whichever is applicable, provided that security meets the standards prescribed in the clause at the time of acquisition of the securities; and\n(6)(i) a company may invest in the securities of any face amount certificate company, unit investment trust, or management type investment company, registered or in the process of registration under the Investment Company Act of 1940 as from time to time amended, provided that the aggregate of all these investments other than in securities of money market mutual funds or mutual funds investing primarily in United States government securities, determined at cost, shall not exceed five percent of its total admitted assets; investments may be made under this clause without regard to the percentage limitations applicable to investments in voting securities;\n(ii) a company may invest in any proportion of the shares or investment units of an investment company or investment trust, whether or not registered under the Investment Company Act of 1940, which is managed by an insurance company, member bank, trust company regulated by state or federal authority or an investment manager or adviser registered under the Investment Advisers Act of 1940 or qualified to manage the investments of an investment company registered under the Investment Company Act of 1940, provided that the investments of the investment company or investment trust are qualified investments made under this section and that the articles of incorporation, bylaws, trust agreement, investment management agreement, or some other governing instrument limits its investments to investments qualified under this section.\n(b) A company may invest in or otherwise acquire and hold a limited partnership interest in any limited partnership formed under the laws of any state, commonwealth, or territory of the United States or under the laws of the United States of America. A company may invest in or otherwise acquire and hold a member interest in any limited liability company formed under the laws of any state, commonwealth, or territory of the United States or under the laws of the United States. No limited partnership or limited liability company member interest shall be acquired if the investment, valued at cost, exceeds two percent of the admitted assets of the company or if the investment, plus the book value on the date of the investment of all limited partnership and limited liability company interests then held by the company and held under the authority of this subdivision, exceeds ten percent of the company's admitted assets. Limited partnership and limited liability company interests traded on a national securities exchange must be classified as stock equivalents and are not subject to the percentage limitations contained in this paragraph.\nUp to 25 percent of a company's total admitted assets may be invested in loans or obligations secured by a mortgage or a trust deed on real estate located in any state, commonwealth, or territory of the United States, including the District of Columbia, or in any province or territory of the Dominion of Canada, on the following conditions:\n(a) a leasehold estate constitutes real estate under this section if its unexpired term on the date of investment is at least five years longer than the term of the obligation secured by it. The obligation must be repayable within the leasehold term in annual or more frequent installments, except that obligations for commercial purposes may begin up to five years after the date of the obligations. The mortgage must entitle the company upon default to be subrogated to all rights of the lessor under the leasehold;\n(b) the real estate to which the mortgage applies must be (1) improved with permanent buildings, or (2) used for agriculture or pasture, or (3) income-producing, including but not limited to parking lots and leases, royalty or other mineral interests in properties producing oil, gas or other minerals and interests in properties for the harvesting of forest products, or (4) subject to a definite plan for the commencement of development within five years;\n(c) the real estate to which the mortgage applies must be otherwise unencumbered when the mortgage loan is funded except as provided in paragraph (d) and except for encumbrances which do not unreasonably interfere with the intended use of the real estate as security;\n(d) the real estate to which the mortgage applies may be subject to a prior mortgage or trust deed if (1) the amount of the obligation is equal to the sum of the company's loan and the other outstanding indebtedness and (2) the company has control over the payments under the prior mortgage or trust deed;\n(e) the amount of the obligation may not exceed 80 percent of the real estate. If the amount of the obligation exceeds 66-2/3 percent of the market value of the real estate, principal payments must commence within five years after the date of the mortgage loan and principal and interest on the loan shall be fully amortized by regular installments payable during the term of the loan without irregular or balloon payments, unless the schedule of irregular or balloon payments is more favorable to the insurer than regular installments of equal amount would be. The market value shall be established by the written certification of a licensed real estate appraiser qualified to appraise the particular type of real estate involved. The appraisal must be required at the time the loan is made;\n(f) the maximum term of any obligation shall be 40 years, except as provided in paragraph (g) and except for obligations secured by a mortgage or trust deed which are or are to be insured by a private mortgage insurance company approved by the commissioner;\n(g) the 25 percent of total admitted asset limitation in the preamble of this subdivision and the maximum amount and term limitations in paragraphs (e) and (f) shall not apply to obligations secured by mortgage or trust deed which are insured or guaranteed by the United States of America or any agency or instrumentality of the United States;\n(h) a company may invest in collateralized mortgage obligations, mortgage participation certificates and pools issued or administered by a bank or banks and secured by first mortgages or trust deeds on improved real estate located in the United States provided the private placement memorandum, prospectus or other offering circular, or a written agreement with the issuer of the collateralized mortgage obligations, certificate or other pool interest provides that each loan meets the requirements of this subdivision;\n(i) notwithstanding the restrictions in paragraph (e), if a company disposes of real estate acquired by it under subdivision 20, it may take back a purchase money mortgage from its purchaser in an amount up to 90 percent of the appraised value; and\n(j) the vendor's equity in a contract for deed shall be treated as a mortgage for purposes of this subdivision.\n(a) Except as provided in paragraphs (b) to (d), a company may only acquire, hold, and convey real estate which:\n(1) has been mortgaged to it in good faith by way of security for loans previously contracted, or for money due;\n(2) has been conveyed to it in satisfaction of debts previously contracted in the course of its dealings;\n(3) has been purchased at sales on judgments, decrees or mortgages obtained or made for the debts; and\n(4) is subject to a contract for deed under which the company holds the vendor's interest to secure the payments the vendee is required to make thereunder.\nAll the real estate specified in clauses (1) to (3) must be sold and disposed of within five years after the company has acquired title to it, or within five years after it has ceased to be necessary for the accommodation of the company's business, and the company must not hold this property for a longer period unless the company elects to hold the real estate under another section, or unless it procures a certificate from the commissioner of commerce that its interest will suffer materially by the forced sale thereof, in which event the time for the sale may be extended to the time the commissioner directs in the certificate. The market value of real estate specified in clauses (1) to (3) must be established by the written certification of a licensed real estate appraiser. The appraisal is required at the time the company elects to hold the real estate under clauses (1) to (3).\n(b) A company may acquire and hold real estate for the convenient accommodation of its business.\n(c) A company may acquire real estate or any interest in real estate, including oil and gas and other mineral interests, as an investment for the production of income, and may hold, improve or otherwise develop, subdivide, lease, sell and convey real estate so acquired directly or as a joint venture or through a limited, limited liability, or general partnership in which the company is a partner or through a limited liability company in which the company is a member.\n(d) A company may also hold real estate (1) if the purpose of the acquisition is to enhance the sale value of real estate previously acquired and held by the company under this section, and (2) if the company expects the real estate so acquired to qualify under paragraph (b) or (c) above within five years after acquisition.\n(e) A company may, after securing the approval of the commissioner, acquire and hold real estate for the purpose of providing necessary living quarters for its employees. The company must dispose of the real estate within five years after it has ceased to be necessary for that purpose unless the commissioner agrees to extend the holding period upon application by the company.\n(f) A company may not invest more than 25 percent of its total admitted assets in real estate. The cost of any parcel of real estate held for both the accommodation of business and for the production of income must be allocated between the two uses annually. No more than ten percent of a company's total admitted assets may be invested in real estate held under paragraph (b). No more than 15 percent of a company's total admitted assets may be invested in real estate held under paragraph (c). No more than three percent of its total admitted assets may be invested in real estate held under paragraph (e). Upon application by a company, the commissioner of commerce may increase any of these limits up to an additional five percent.\nObligations of and investments in foreign countries, on the following conditions:\n(a) a company may acquire and hold any foreign investments which are required as a condition of doing business in the foreign country or necessary for the convenient accommodation of its foreign business. An investment is considered necessary for the convenient accommodation of the insurance company's foreign business only if it is demonstrably and directly related in size and purpose to the company's foreign insurance operations; and\n(b) a company may also invest not more than five percent of its total admitted assets in any combination of:\n(1) the obligations of foreign governments, corporations, or business trusts;\n(2) obligations of federal, provincial, or other political subdivisions backed by the full faith and credit of the foreign governmental unit;\n(3) or in the stocks or stock equivalents or obligations of foreign corporations or business trusts not qualifying for investment under subdivision 12, if the obligations, stocks or stock equivalents are listed or regularly traded on the London, Paris, Zurich, or Tokyo stock exchange or any similar regular securities exchange not disapproved by the commissioner within 30 days' following notice from the company of its intention to invest in these securities.\nPersonal property for intended lease or rental in the United States or Canada. A company may not invest more than five percent of its total admitted assets under this subdivision. In cases where the asset leased would otherwise be nonadmitted, the asset or associated lease is nonadmitted.\nObligations having adequate security if:\n(a) the collateral is legally assigned or delivered to the company;\n(b) the company has the right to declare the obligation immediately due and payable if the security thereafter depreciates to the point where the investment would not qualify under paragraph (c); provided, that additional qualifying security may be pledged to allow the investment to remain qualified at its face value;\n(c) the collateral must at the time of delivery or assignment have a market value of at least, in the case of cash, or a letter of credit meeting the requirements of subdivision 11, paragraph (f), equal to and, in all other cases, 1-1/4 times the amount of the unpaid balance of the obligations.\nA collateral loan made by a company to its parent corporation or an affiliated party must be secured by collateral: (i) with a market value equal to the amount of the unpaid balance of the obligations, and (ii) which is issued or guaranteed by the United States of America or an agency or an instrumentality thereof, or any state or territory thereof, and is secured by the full faith and credit of the United States of America or any state or territory thereof. A company may not invest more than five percent of its total admitted assets under this subdivision.\n(a) A company may sell exchange-traded call options against stocks or other securities owned by the company and may purchase exchange-traded call options in a closing transaction against a call option previously written by the company.\n(b) A company may purchase or sell other exchange-traded call options and may sell or purchase exchange-traded put options only if, to the extent and on terms and conditions the commissioner determines to be consistent with the purposes of this section.\n[Repealed, 1999 c 177 s 88]\nA company may invest its unrestricted surplus, in securities or property of any kind, without restriction or limitation except as may be imposed on business corporations in general.\nAn insurer engaging in replication transactions shall include all replicated investment positions in calculating compliance with the limitations on investments applicable to the insurer. Replication transactions are permitted only under the authority of subdivision 25. An insurer may invest its unrestricted surplus in a replication transaction only to the extent that the replicated investment position does not cause the total positions represented by the unrestricted surplus to be greater than the total positions represented by the unrestricted surplus as would be permitted in the absence of the replicated investment position.\n(a) The commissioner may adopt appropriate rules to carry out the purpose and provisions of this section.\n(b) A company may make qualified investments in any other type of investment or exceeding any limitations of quality, quantity, or percentage of admitted assets contained in this section with the written order of the commissioner. This approval is at the discretion of the commissioner, provided that the additional investments allowed by the commissioner's written order may not exceed five percent of the company's admitted assets.\n(c) Nothing authorized in this subdivision negates or reduces the investment authority granted in subdivisions 1 to 25.",
	"repealed": false
}