{
	"id": "160.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.80",
	"title": "160.80 SIGN FRANCHISE PROGRAM.",
	"text": "(a) The commissioner of transportation may establish a sign franchise program for the purpose of providing on the right-of-way of interstate and controlled-access trunk highways specific information on gas, food, camping, lodging, attractions, and 24-hour pharmacies for the benefit of the motoring public.\n(b) The sign franchise program must include urban interstate highways.\n(a) To be eligible for a business panel on a logo sign panel, a business establishment must:\n(1) be open for business;\n(2) have a sign on site that both identifies the business and is visible to motorists;\n(3) be open to everyone, regardless of race, religion, color, age, sex, national origin, creed, marital status, sexual orientation, or disability; and\n(4) meet the appropriate criteria in paragraphs (b) to (k).\n(b) Gas businesses must provide vehicle services including gas or alternative fuels and oil; restroom facilities and drinking water; continuous, staffed operation at least 12 hours a day, seven days a week; and public access to a telephone.\n(c) Food businesses must serve at least two meals a day during normal mealtimes of breakfast, lunch, and dinner; provide a continuous, staffed food service operation at least six days per week except holidays as defined in section 645.44, subdivision 5, and except as provided for seasonal food service businesses; provide seating capacity for at least 20 people; provide restroom facilities; provide public access to a telephone; and possess any required state or local licensing or approval. Seasonal food service businesses must provide a continuous, staffed food service operation serving at least two meals per day six days per week, during their months of operation.\n(d) Lodging businesses must include sleeping accommodations, provide public access to a telephone, provide restroom facilities, and possess any required state or local licensing or approval.\n(e) Camping businesses must include sites for camping, include parking accommodations for each campsite, provide sanitary facilities and drinking water, and possess any required state or local licensing or approval.\n(f) 24-hour pharmacy businesses must be continuously operated 24 hours per day, seven days per week, and must have a state-licensed pharmacist present and on duty at all times.\n(g) Attractions businesses must have regional significance with the primary purpose of providing amusement, historical, cultural, or leisure activities to the public; provide restroom facilities and drinking water; possess any required state or local licensing approval; and provide adequate bus and vehicle parking accommodations for normal attendance.\n(h) Seasonal businesses must indicate to motorists when they are open for business by putting the months of operation directly on the business panel.\n(i) The maximum distance that an eligible business in an urban area can be located from the interchange is: for gas, food, lodging, attractions, and 24-hour pharmacy businesses, three miles; and for camping businesses, ten miles.\n(j) The maximum distance that an eligible business in a rural area can be located from the interchange shall not exceed 15 miles in either direction, except the maximum distance that an eligible 24-hour pharmacy business can be located from the interchange shall not exceed three miles in either direction.\n(k) If there is available space on a logo sign panel and no application has been received by the franchise from a fully eligible business, a substantially eligible business may be allowed the space.\nThe commissioner may, by public negotiation or bid, grant one or more franchises to qualified persons to erect and maintain, on the right-of-way of interstate and controlled-access trunk highways, signs informing the motoring public of gas, food, lodging, camping facilities, attractions, and 24-hour pharmacies. A franchisee shall furnish, install, maintain, and replace signs for the benefit of advertisers who provide gas, food, lodging, camping facilities, attractions, and 24-hour pharmacies for the general public, and lease advertising space on the signs to operators of these facilities.\nAll costs incurred under the program established by this section must be paid under agreements negotiated between a franchisee and an advertiser or advertisers, unless otherwise provided in the contract between the commissioner and the franchisee.\n(a) All contracts made by the commissioner with a franchisee must provide for:\n(1) a requirement that the franchisee obtain liability insurance in an amount the commissioner determines, jointly insuring the state and the franchisee against all liability for claims for damages occurring wholly or in part because of the franchise; and\n(2) reasonable standards for the size, design, erection, and maintenance of service information signs and the advertising logos thereon.\n(b) The commissioner may require additional terms and conditions, including but not limited to provisions on the renewal and termination of the agreement, and in the event of termination the rights of the state and franchisee relative to the franchisee's advertising contracts.\nThe commissioner shall take no action under this section which will result in the loss to the state of any federal highway construction funds.\nMS 1986 [Repealed, 1988 c 629 s 64]",
	"repealed": false
}