{
	"id": "144.4195",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4195",
	"title": "144.4195 DUE PROCESS FOR ISOLATION OR QUARANTINE OF PERSONS.",
	"text": "(a) Before isolating or quarantining a person or group of persons, the commissioner of health shall obtain a written, ex parte order authorizing the isolation or quarantine from the District Court of Ramsey County, the county where the person or group of persons is located, or a county adjoining the county where the person or group of persons is located. The evidence or testimony in support of an application may be made or taken by telephone, facsimile transmission, video equipment, or other electronic communication. The court shall grant the order upon a finding that probable cause exists to believe isolation or quarantine is warranted to protect the public health.\n(b) The order must state the specific facts justifying isolation or quarantine, must state that the person being isolated or quarantined has a right to a court hearing under this section and a right to be represented by counsel during any proceeding under this section, and must be provided immediately to each person isolated or quarantined. The commissioner of health shall provide a copy of the authorizing order to the commissioner of public safety and other peace officers known to the commissioner to have jurisdiction over the site of the isolation or quarantine. If feasible, the commissioner of health shall give each person being isolated or quarantined an estimate of the expected period of the person's isolation or quarantine.\n(c) If it is impracticable to provide individual orders to a group of persons isolated or quarantined, one order shall suffice to isolate or quarantine a group of persons believed to have been commonly infected with or exposed to a communicable disease. A copy of the order and notice shall be posted in a conspicuous place:\n(1) in the isolation or quarantine premises, but only if the persons to be isolated or quarantined are already at the isolation or quarantine premises and have adequate access to the order posted there; or\n(2) in another location where the group of persons to be isolated or quarantined is located, such that the persons have adequate access to the order posted there.\nIf the court determines that posting the order according to clause (1) or (2) is impractical due to the number of persons to be isolated or quarantined or the geographical area affected, the court must use the best means available to ensure that the affected persons are fully informed of the order and notice.\n(d) Any peace officer, as defined in section 144.4803, subdivision 16, may apprehend, hold, transport, quarantine, or isolate a person subject to the order. This subdivision is authority to carry out enforcement duties under this section. The commissioner or an agent of a community health board authorized under section 145A.04 shall advise the peace officer on request of protective measures recommended to protect the officer from possible transmission of the communicable disease. The peace officer may act upon telephone, facsimile, or other electronic notification of the order from the court, commissioner of health, agent of a community health board, or commissioner of public safety.\n(e) No person may be isolated or quarantined pursuant to an order issued under this subdivision for longer than 21 days without a court hearing under subdivision 3 to determine whether isolation or quarantine should continue. A person who is isolated or quarantined may request a court hearing under subdivision 3 at any time before the expiration of the order.\n(a) Notwithstanding subdivision 1, the commissioner of health may by directive isolate or quarantine a person or group of persons without first obtaining a written, ex parte order from the court if a delay in isolating or quarantining the person or group of persons would significantly jeopardize the commissioner of health's ability to prevent or limit the transmission of a communicable or potentially communicable life-threatening disease to others. The directive shall specify the known period of incubation or communicability or the estimated period under the commissioner's best medical judgment when the disease is unknown. The directive remains in effect for the period specified unless amended by the commissioner or superseded by a court order. The commissioner must provide the person or group of persons subject to the temporary hold with notice that the person has a right to request a court hearing under this section and a right to be represented by counsel during a proceeding under this section. If it is impracticable to provide individual notice to each person subject to the temporary hold, notice of these rights may be posted in the same manner as the posting of orders under subdivision 1, paragraph (c). Immediately upon executing the directive and initiating notice of the parties subject to it, the commissioner shall initiate the process to apply for a written, ex parte order pursuant to subdivision 1 authorizing the isolation or quarantine. The court must rule within 24 hours of receipt of the application or sooner if practicable or necessary. If the person is under a temporary hold, the person may not be held in isolation or quarantine after the temporary hold expires unless the court issues an ex parte order under subdivision 1. If the court does not rule within 36 hours after the execution of the directive, the directive shall expire.\n(b) At the same time the commissioner initiates the process to apply for a written, ex parte order under paragraph (a), the commissioner shall notify the governor, the majority and minority leaders of the senate, the speaker and majority and minority leaders of the house of representatives, and the chairs and the ranking minority members of the senate and house of representatives committees having jurisdiction over health policy that a directive for a temporary hold has been issued under this subdivision. Notice under this paragraph is governed by the data privacy provisions of subdivision 6.\n(c) Any peace officer, as defined in section 144.4803, subdivision 16, may assist a public health official to apprehend, hold, transport, quarantine, or isolate a person subject to the commissioner's directive. This subdivision is authority to carry out enforcement duties under this section. The commissioner or an agent of a community health board authorized under section 145A.04 shall advise the peace officer on request of protective measures recommended to protect the officer from possible transmission of the communicable disease. The peace officer may act upon telephone, facsimile, or other electronic notification of the commissioner's directive or upon the request of an agent of a community health board.\n(d) If a person subject to a commissioner's directive under paragraph (a) is already institutionalized in an appropriate health care facility, the commissioner of health may direct the facility to continue to hold the person. The facility shall take all reasonable measures to prevent the person from exposing others to the communicable disease.\n(a) A person isolated or quarantined under an order issued pursuant to subdivision 1 or a temporary hold under subdivision 2 or the person's representative may petition the court to contest the court order or temporary hold at any time prior to the expiration of the order or temporary hold. If a petition is filed, the court must hold a hearing within 72 hours from the date of the filing. A petition for a hearing does not stay the order of isolation or quarantine. At the hearing, the commissioner of health must show by clear and convincing evidence that the isolation or quarantine is warranted to protect the public health.\n(b) If the commissioner of health wishes to extend the order for isolation or quarantine past the period of time stated in subdivision 1, paragraph (e), the commissioner must request the court to do so. Notice of the hearing must be served upon the person or persons who are being isolated or quarantined at least three days before the hearing. If it is impracticable to provide individual notice to large groups who are isolated or quarantined, a copy of the notice may be posted in the same manner as described under subdivision 1, paragraph (c).\n(c) The notice must contain the following information:\n(1) the time, date, and place of the hearing;\n(2) the grounds and underlying facts upon which continued isolation or quarantine is sought;\n(3) the person's right to appear at the hearing; and\n(4) the person's right to counsel, including the right to be represented by counsel designated by the court.\n(d) The court may order the continued isolation or quarantine of the person or group of persons if it finds by clear and convincing evidence that the person or persons would pose an imminent health threat to others if isolation or quarantine was lifted. In no case may the isolation or quarantine continue longer than 30 days from the date of the court order issued under this subdivision unless the commissioner petitions the court for an extension. Any hearing to extend an order is governed by this subdivision.\nA person isolated or quarantined may request a hearing in district court for remedies regarding the treatment during and the terms and conditions of isolation or quarantine. Upon receiving a request for a hearing under this subdivision, the court shall fix a date for a hearing that is within seven days of the receipt of the request by the court. The request for a hearing does not alter the order for isolation or quarantine. If the court finds that the isolation or quarantine of the individual is not in compliance with section 144.419, the court may fashion remedies appropriate to the circumstances of the emergency and in keeping with this chapter.\n(a) Court orders issued pursuant to subdivision 3 or 4 shall be based upon clear and convincing evidence and a written record of the disposition of the case shall be made and retained.\n(b) Any person subject to isolation or quarantine has the right to be represented by counsel. Persons not otherwise represented may request the court to appoint counsel at the expense of the Department of Health or of a community health board that has entered into a written delegation agreement with the commissioner under subdivision 7. The court shall appoint counsel when so requested and may have one counsel represent a group of persons similarly situated. The appointments shall be only for representation under subdivisions 3 and 4 and for appeals of orders under subdivisions 3 and 4. On counsel's request, the commissioner or an agent of a community health board authorized under section 145A.04 shall advise counsel of protective measures recommended to protect counsel from possible transmission of the communicable disease. Appointments shall be made and counsel compensated according to procedures developed by the supreme court. The supreme court shall also develop procedures for compensating language interpreters and medical experts reasonably necessary to defense preparations. The procedures shall provide standards for determining indigency for purposes of appeal. Upon motion by the commissioner of health or community health board, the court may order a person who is not indigent to reimburse the Department of Health or community health board for the attorney fees and costs paid on behalf of the person in the person's appeal. Counsel appointed for a respondent must be allowed to withdraw from representation and is not required to pursue an appeal if, in the opinion of counsel, there is insufficient basis for proceeding.\n(c) The court may choose to conduct a hearing under subdivision 3 or 4 by telephonic, interactive video, or other electronic means to maintain isolation or quarantine precautions and reduce the risk of spread of a communicable disease. Otherwise, the manner in which the request for a hearing is filed and acted upon shall be in accordance with the existing laws and rules of the courts of this state or, if the isolation or quarantine occurs during a national security or peacetime emergency, any rules that are developed by the courts for use during a national security or peacetime emergency.\nData on individuals contained in the commissioner's directive under subdivision 2 are health data under section 13.3805, subdivision 1.\nThe commissioner may delegate any authority prescribed in subdivision 1 or 3 to the community health board, according to chapter 145A.",
	"repealed": false
}