{
	"id": "356.219",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.219",
	"title": "356.219 DISCLOSURE OF PUBLIC PENSION PLAN INVESTMENT PORTFOLIO AND PERFORMANCE INFORMATION.",
	"text": "(a) The Bloomington Fire Department Relief Association, volunteer firefighters relief associations governed by sections 424A.091 to 424A.095, the St. Paul Teachers Retirement Fund Association, and any Minnesota public pension plan that is not fully invested through the State Board of Investment, must report the information specified in subdivision 3 to the state auditor. The state auditor may prescribe a form or forms for the purposes of the reporting requirements contained in this section.\n(b) For purposes of this section, a pension plan is fully invested through the State Board of Investment during a given calendar year if all assets of the pension plan beyond sufficient cash equivalent investments to cover six months of expected expenses are invested under section 11A.17.\n(c) A public pension plan to which subdivision 3, paragraph (b) or (c), applies is not required to file the report required by this subdivision for a given calendar year if the pension plan's most recent annual financial audit was conducted by the state auditor.\n(d) This section does not apply to the following plans:\n(1) the Minnesota unclassified employees retirement program under chapter 352D;\n(2) the public employees defined contribution plan under chapter 353D;\n(3) the individual retirement account plans under chapters 354B and 354D;\n(4) the higher education supplemental retirement plan under chapter 354C;\n(5) any alternative retirement benefit plan established under section 383B.914;\n(6) the University of Minnesota faculty retirement plan and supplemental plan; and\n(7) any other statewide plan required to be invested by the State Board of Investment under section 11A.23.\n(a) For purposes of this section, \"asset class\" means any of the following asset groupings as authorized in applicable law, bylaws, or articles of incorporation:\n(1) cash and any cash equivalent investments with maturities of one year or less when issued;\n(2) debt securities with maturities greater than one year when issued, including but not limited to mortgage participation certificates and pools, asset backed securities, guaranteed investment contracts, and authorized government and corporate obligations of corporations organized under laws of the United States or any state, or the Dominion of Canada or its provinces;\n(3) stocks or convertible issues of any corporation organized under laws of the United States or any state, or the Dominion of Canada or its provinces, or any corporation listed on the New York Stock Exchange or the American Stock Exchange;\n(4) international stocks or convertible issues;\n(5) international debt securities; and\n(6) real estate and venture capital.\n(b) If the pension plan is investing in open-end investment companies registered under the federal Investment Company Act of 1940, or in the Minnesota supplemental investment fund under section 11A.17, this investment must be included under an asset class indicated in paragraph (a), clauses (1) through (6), as appropriate. If the investment vehicle includes underlying securities from more than one asset class as indicated by paragraph (a), clauses (1) through (6), the investment may be treated as a separate asset class.\n(a) The report required by subdivision 1 must include a written statement of the investment policy. Following that initial report, subsequent reports must include investment policy changes and the effective date of each policy change rather than a complete statement of investment policy, unless the state auditor requests submission of a complete current statement. The report must also include the information required by the following paragraphs, as applicable.\n(b) For public pension plans not fully invested through the State Board of Investment with assets having a market value of $50,000,000 or more as of the beginning of the calendar year, or that had a market value of $50,000,000 or more in a prior calendar year, the report required by subdivision 1 must include the following:\n(1) the market value of the total portfolio and the market value of each investment account, investment portfolio, or asset class included in the pension fund for each month;\n(2) the amount and date of each injection and withdrawal to the total portfolio and to each investment account, investment portfolio, or asset class;\n(3) a calculation of the total time-weighted rate of return available from index-matching investments, assuming the asset class performance targets and target asset mix indicated in the written statement of investment policy;\n(4) a description of indices used in the analyses and an explanation of why those indices are appropriate;\n(5) computed time-weighted rates of return; and\n(6) any other information required by the state auditor.\n(c) For public pension plans fully invested through the State Board of Investment with assets having a market value of $50,000,000 or more as of the beginning of the calendar year, or that had a market value of $50,000,000 or more in a prior calendar year, the report required by subdivision 1 must be in the form required by the state auditor and include the information needed by the state auditor to supplement the reporting available from the State Board of Investment.\n(d) If a public pension plan has assets with a total market value of less than $50,000,000 as of the beginning of the calendar year and was never required to file under paragraph (b) or (c), the report required by subdivision 1 must include the following:\n(1) unless paragraph (f) applies, the amount and date of each total portfolio injection and withdrawal; and\n(2) the market value of the total portfolio as of the beginning of the calendar year and for each quarter.\n(e) For public pension plans reporting under paragraph (d), the public pension plan must retain supporting information specifying the date and amount of each injection and withdrawal to each investment account and investment portfolio. The public pension plan must also retain the market value of each investment account and investment portfolio at the beginning of the calendar year and for each quarter. Information that is required to be collected and retained for any given year or years under this paragraph must be submitted to the state auditor if the state auditor requests in writing that the information be submitted by the public pension plan. If the state auditor requests information under this subdivision, and the pension plan fails to comply, the pension plan is subject to penalties under subdivision 5, unless penalties are waived by the state auditor under that subdivision.\n(f) A public pension plan reporting under paragraph (d) that is fully invested through the State Board of Investment for the given calendar year is required to report the market value of the total portfolio as of the beginning of the calendar year and for each quarter, but need not report the amount and date of each total portfolio injection and withdrawal.\n[Repealed, 2012 c 286 art 10 s 13]\nFailure to comply with the reporting requirements of this section must result in a withholding of all state aid or state appropriation to which the pension plan may otherwise be directly or indirectly entitled until the pension plan has complied with the reporting requirements. The state auditor shall instruct the commissioners of revenue and management and budget to withhold any state aid or state appropriation from any pension plan that fails to comply with the reporting requirements contained in this section, until the pension plan has complied with the reporting requirements. The state auditor may waive the withholding of state aid or state appropriations if the state auditor determines in writing that compliance would create an excessive hardship for the pension plan.\n(a) The state auditor shall prepare an annual report to the legislature on the investment performance of the public pension plans subject to this section. The content of the report is specified in paragraphs (b) to (d).\n(b) For each public pension plan reporting under subdivision 3, paragraph (b), the state auditor shall compute and report total portfolio and asset class time-weighted rates of return, net of all investment-related costs and fees. The report by the state auditor must also include the information submitted by the pension plans under subdivision 3 or a summary of that information.\n(c) For each public pension plan reporting under subdivision 3, paragraph (d), the state auditor shall compute and report total portfolio time-weighted rates of return, net of all costs and fees.\n(d) The report by the state auditor may also include a presentation of multiyear performance and any other information or analysis deemed appropriate by the state auditor.\nAll administrative expenses incurred relating to the investment report by the state auditor described in subdivision 6 must be borne by the state auditor and may not be charged back to the entities described in subdivisions 1 or 4.\n(a) For the Bloomington Fire Department Relief Association and the volunteer firefighters relief associations, the information required under this section must be submitted by the due date for reports required under section 424A.014, subdivision 1 or 2, as applicable.\n(b) For the St. Paul Teachers Retirement Fund Association, the information required under this section must be submitted to the state auditor by June 1 of each year.\n(c) Any public pension plan required to submit information under this section that is not identified in paragraph (a) or (b) must submit the information to the state auditor by June 1 of each year.\nAny information received by the state auditor under this section, if the data are public, must be made available to individuals or organizations which request that information. The state auditor is authorized to charge fees sufficient to cover the cost of providing the requested information in usable formats.\nIn addition to report presentations that the state auditor is required to provide elsewhere in this section, the state auditor shall provide an analysis comparing the one-year and the five-year rate of return for each pension fund and the benchmark rate of return for each fund. The state auditor shall select the benchmark rate of return based on the best practice in the industry.",
	"repealed": false
}