{
	"id": "58.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.137",
	"title": "58.137 INTEREST, POINTS, FINANCE CHARGES, FEES, AND OTHER CHARGES.",
	"text": "A residential mortgage originator making or modifying a residential mortgage loan to a borrower located in this state must not include in the principal amount of any residential mortgage loan all or any portion of any lender fee in an aggregate amount exceeding five percent of the loan amount. This subdivision shall not apply to residential mortgage loans which are insured or guaranteed by the secretary of housing and urban development or the administrator of veterans affairs or the administrator of the Farmers Home Administration or any successor.\n\"Lender fee\" means interest, points, finance charges, fees, and other charges payable in connection with the residential mortgage loan: (1) by the borrower to any residential mortgage originator or to any assignee of any residential mortgage originator; or (2) by the lender to a mortgage broker. Lender fee does not include recording fees, mortgage registration taxes, pass-throughs, or other amounts that are paid by any person to any government entity, filing office, or other third party that is not a residential mortgage originator or an assignee of a residential mortgage originator. Lender fee also does not include any amount that is set aside to pay taxes or insurance on any property securing the residential mortgage loan.\n\"Loan amount\" means: (1) for a line of credit, the maximum principal amount of the line of credit; and (2) for any other residential mortgage loan, the principal amount of the residential mortgage loan excluding all interest, points, finance charges, fees, and other charges. A residential mortgage originator shall not charge, receive, or collect any excess financed interest, points, finance charges, fees, or other charges described in this subdivision, or any interest, points, finance charges, fees, or other charges with respect to this excess.\n(a) A residential mortgage originator making a residential mortgage loan that is a prime loan to a borrower located in this state shall not charge, receive, or collect any prepayment penalty, fee, premium, or other charge:\n(1) for any partial prepayment of the residential mortgage loan; or\n(2) for any prepayment of the residential mortgage loan upon the sale of any residential real property, or the sale of any stock, interest, or lease relating to cooperative ownership of residential real property, securing the loan; or\n(3) for any prepayment of the residential mortgage loan if the prepayment is made more than 42 months after the date of the note or other agreement for the residential mortgage loan; or\n(4) for any prepayment of the residential mortgage loan if the aggregate amount of all prepayment penalties, fees, premiums, and other charges exceeds the lesser of (i) an amount equal to two percent of the unpaid principal balance of the residential mortgage loan at the time of prepayment, or (ii) an amount equal to 60 days' interest, at the interest rate in effect on the residential mortgage loan at the time of prepayment, on the unpaid principal balance of the residential mortgage loan at the time of prepayment.\n(b) If a residential mortgage originator offers or makes residential mortgage loans to any borrowers located in this state with prepayment penalties, fees, premiums, or other charges exceeding the maximum amount under paragraph (a), clause (4), then the residential mortgage originator shall provide the following disclosure to each prospective borrower located in this state that requests a residential mortgage loan from the residential mortgage originator, whether or not the prospective borrower receives a residential mortgage loan:\nTHIS IS VERY IMPORTANT\nTHIS LENDER CHARGES YOU A SUBSTANTIAL PENALTY IF YOU PAY OFF OR REFINANCE YOUR LOAN BEFORE MATURITY. ASK THE LENDER HOW MUCH THE PENALTY WILL BE FOR YOUR LOAN.\nThe residential mortgage originator shall read the disclosure to the prospective borrower when the prospective borrower requests a residential mortgage loan, and again within three days before the borrower signs the note or other agreement for the residential mortgage loan. The residential mortgage originator also shall provide the disclosure to the prospective borrower in writing so that it is received by the prospective borrower within five days after the residential mortgage originator receives the prospective borrower's request for a residential mortgage loan, and again within three days before the prospective borrower signs the note or other agreement for the residential mortgage loan. The written disclosure must be stated in at least 16-point capitalized boldface type on a single sheet of paper that contains only the disclosure, the date on which the disclosure form is sent or provided, the name, address, and telephone number of the residential mortgage originator, the name and address of the prospective borrower, and, at the option of the residential mortgage originator, the prospective borrower's dated and signed acknowledgment of receipt of the disclosure form. The provisions of the disclosure form, other than the disclosure in this subdivision, are not required to be in at least 16-point capitalized boldface type. The prospective borrower shall be permitted to keep a copy of each written disclosure form. When a prospective borrower asks a residential mortgage originator for information about a prepayment penalty, the residential mortgage originator shall give the prospective borrower the requested information, and shall tell the borrower the highest aggregate amount of the prepayment penalties, fees, premiums, and other charges that the residential mortgage originator would charge to the prospective borrower for prepayment of the residential mortgage loan one year after it is funded, based on a hypothetical unpaid principal balance of $100,000 and also based on the highest interest rate that the residential mortgage originator would charge to the prospective borrower. A mortgage originator responding to requests for residential mortgage loans via the Internet may make the disclosure in a manner acceptable to the commissioner.\n(c) A residential mortgage originator shall not enter into a loan that contains a provision requiring or permitting the imposition of a penalty, fee, premium, or other charge in the event the residential mortgage loan is prepaid in whole or in part if the loan also contains an annual percentage rate that:\n(1) for an adjustable rate loan secured by a first lien on a dwelling that can increase in interest rate but not decrease in interest rate below the fully indexed rate at the time of origination, is more than two percentage points above the yield on United States Treasury securities having comparable periods of maturity as of (i) the 15th day of the preceding month if the rate is set between the first and the 14th day of the month, or (ii) the 15th day of the current month if the rate is set on or after the 15th day;\n(2) for all other loans secured by a first lien on a dwelling, is more than three percentage points above the yield on United States Treasury securities having comparable periods of maturity as of (i) the 15th day of the preceding month if the rate is set between the first and the 14th day of the month, or (ii) the 15th day of the current month if the rate is set on or after the 15th day; and\n(3) for loans secured by a subordinate lien on a dwelling, is more than five percentage points above the yield on United States Treasury securities having comparable periods of maturity as of (i) the 15th day of the preceding month if the rate is set between the first and the 14th day of the month, or (ii) the 15th day of the current month if the rate is set on or after the 15th day.\n(d) The prohibitions in this subdivision do not apply to any loan with a principal amount that, or, in the case of an open-end credit plan, in which the borrower's initial maximum credit limit, exceeds the conforming loan size limit for a single-family dwelling as established from time to time by the Federal Housing Finance Administration or its successor.\n(e) For purposes of this section, \"annual percentage rate\" has the meaning given in Code of Federal Regulations, title 12, part 226.\nThis section applies to residential mortgage originators located in this state and residential mortgage originators located outside this state.",
	"repealed": false
}