{
	"id": "62S.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.02",
	"title": "62S.02 QUALIFIED LONG-TERM CARE INSURANCE POLICY.",
	"text": "A qualified long-term care insurance policy may not be offered, issued, delivered, or renewed in this state unless the policy satisfies the requirements of this chapter and the filing provisions of section 62A.02. A qualified long-term care insurance policy must cover qualified long-term care services.\nAn insurer shall offer a nonforfeiture provision available in the event of default in the payment of any premiums. The amount of the benefit may be adjusted after being initially granted, if necessary, to reflect changes in claims, persistency, and interest as reflected in changes in rates for premium paying contracts. The nonforfeiture provision must provide at least one of the following:\n(1) reduced paid-up insurance;\n(2) extended term insurance; or\n(3) shortened benefit period.\nA qualified long-term care insurance policy shall not provide for a cash surrender value or other money that can be paid, assigned, pledged as collateral for a loan, or borrowed. The aggregate premium paid under the policy may be refunded in the event of death of the insured or a complete surrender or cancellation of the policy.\nA qualified long-term care insurance policy shall not pay or reimburse expenses incurred for services or items if the expenses are reimbursable under Medicare or would be reimbursable if a deductible or coinsurance amount was not applied. This subdivision does not apply to expenses which are reimbursable under Medicare only as a secondary payor and does not prohibit the offering of a qualified long-term care insurance policy on the basis that the policy coordinates its benefits with those provided under Medicare. Notwithstanding this subdivision, payments may be made under a long-term care insurance policy on a per diem or other periodic basis without regard to the expenses incurred during the period to which the payments relate.\nA qualified long-term care insurance policy shall take into account at least five of the activities of daily living in making the determination of whether an individual is chronically ill. Assessments of activities of daily living and cognitive impairment must be performed by a licensed or certified professional, such as a physician, physician assistant, nurse, or social worker.\nA qualified long-term care insurance policy must include a clear description of the process for appealing and resolving benefit determinations.",
	"repealed": false
}