{
	"id": "609.895",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.895",
	"title": "609.895 COUNTERFEITED INTELLECTUAL PROPERTY; PENALTIES.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Counterfeit mark\" means:\n(1) any unauthorized reproduction or copy of intellectual property; or\n(2) intellectual property affixed to any item without the authority of the owner of the intellectual property.\n(c) \"Counterfeited item or service\" means an item or service bearing or identified by a counterfeit mark.\n(d) \"Intellectual property\" means any trademark, service mark, or trade name.\n(e) \"Retail value\" means:\n(1) the usual selling price of the article or service bearing or identified by the counterfeit mark; or\n(2) the usual selling price of a finished product on or in which components bearing or identified by a counterfeit mark are used.\n(f) \"Service mark\" means a mark used by a person to identify services and to distinguish them from the services of others.\n(g) \"Trademark\" means a mark used by a person to identify goods and to distinguish them from the goods of others.\n(h) \"Trade name\" means a word, name, symbol, device, or any combination of the foregoing in any form or arrangement, used by a person to identify the person's business, vocation, or occupation and to distinguish it from the business, vocation, or occupation of others.\nA person who intentionally manufactures, produces, distributes, offers for sale, sells, or possesses with intent to sell or distribute any counterfeited item or service, knowing or having reason to know that the item or service is counterfeit, is guilty of counterfeiting intellectual property and may be punished as provided in subdivision 3.\n(a) A person who is convicted of violating subdivision 2 may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $100,000, or both, if:\n(1) the violation involves the manufacture or production of a counterfeited item or items;\n(2) the violation involves the distribution, offer for sale, sale, or possession with intent to sell or distribute 1,000 or more counterfeited items;\n(3) the violation involves the distribution, offer for sale, sale, or possession with intent to sell or distribute counterfeited items or services having a retail value of more than $10,000; or\n(4) the defendant has two or more prior convictions for violating this section or a law of another state or the United States that provides criminal penalties for counterfeiting intellectual property.\n(b) Except as otherwise provided in paragraph (a), a person who is convicted of violating subdivision 2 may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $50,000, or both, if:\n(1) the violation involves more than 100 but fewer than 1,000 counterfeited items;\n(2) the violation involves counterfeited items or services having a retail value of more than $1,000 but not more than $10,000; or\n(3) the defendant has one prior conviction for violating this section or a law of another state or the United States that provides criminal penalties for counterfeiting intellectual property.\n(c) A person may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both, if the person is convicted of violating subdivision 2, under circumstances not described in paragraph (a) or (b).\n(d) If the defendant distributes, sells, offers for sale, or possesses with intent to sell or distribute more than one item or service bearing or identified by more than one counterfeit mark, the quantity or retail value of these items and services may be aggregated for purposes of determining penalties under this subdivision.\nIn lieu of the fine authorized by subdivision 3, a person convicted of violating this section who received economic gain from the act or caused economic loss during the act may be sentenced to pay a fine calculated in the manner provided in section 609.904, subdivision 2.\nProperty used to commit or facilitate the commission of a violation of this section, and all money and property representing proceeds of a violation of this section, shall be forfeited in accordance with sections 609.531 to 609.5316. Notwithstanding any provision of section 609.5315 to the contrary, forfeited items bearing or identified by a counterfeit mark must be destroyed unless the intellectual property owner consents to another disposition.\nA Minnesota or federal certificate of registration of an intellectual property is prima facie evidence of the registrant's ownership and exclusive right to use the intellectual property in connection with the goods or services described in the certificate.",
	"repealed": false
}