{
	"id": "221.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.036",
	"title": "221.036 ADMINISTRATIVE ORDERS; ENFORCEMENT, REMEDIES.",
	"text": "The commissioner may issue an order requiring violations to be corrected and administratively assessing monetary penalties for a violation of (1) section 221.021; (2) section 221.033, subdivision 2b; (3) section 221.171; (4) section 221.141; (5) a federal, state, or local law, regulation, rule, or ordinance pertaining to railroad-highway grade crossings; or (6) rules of the commissioner relating to the transportation of hazardous waste, motor carrier operations, or insurance. An order must be issued as provided in this section.\nThe commissioner may not both assess an administrative penalty under this section and seek a criminal sanction under section 221.291, subdivision 3, for violations arising out of the same inspection or audit.\n(a) The commissioner may issue an order assessing a penalty of up to $5,000 for all violations identified during a single audit or investigation of (1) section 221.021, 221.141, or 221.171, or (2) rules of the commissioner relating to motor carrier operations or insurance.\n(b) The commissioner may issue an order assessing a penalty up to a maximum of $10,000 for all violations of section 221.033, subdivision 2b, identified during a single inspection or audit.\n(c) In determining the amount of a penalty, the commissioner shall consider:\n(1) the willfulness of the violation;\n(2) the gravity of the violation, including damage to humans, animals, air, water, land, or other natural resources of the state;\n(3) the history of past violations, including the similarity of the most recent violation and the violation to be penalized, the time elapsed since the last violation, the number of previous violations, and the response of the person to the most recent violation identified;\n(4) the economic benefit gained by the person by allowing or committing the violation; and\n(5) other factors as justice may require, if the commissioner specifically identifies the additional factors in the commissioner's order.\n(d) The commissioner shall assess a penalty in accordance with Code of Federal Regulations, title 49, section 383.53, against:\n(1) a driver who is convicted of a violation of an out-of-service order;\n(2) an employer who knowingly allows or requires an employee to operate a commercial motor vehicle in violation of an out-of-service order; or\n(3) an employer who knowingly allows or requires an employee to operate a commercial motor vehicle in violation of a federal, state, or local law or regulation pertaining to railroad-highway grade crossings.\nAn order assessing an administrative penalty under this section must include:\n(1) a concise statement of the facts alleged to constitute a violation;\n(2) a reference to the section of the statute, rule, order, or material term or condition of a license that has been violated;\n(3) a statement of the amount of the administrative penalty to be imposed and the factors upon which the penalty is based; and\n(4) a statement of the person's right to review of the order.\n(a) The commissioner may issue an order assessing a penalty and requiring the violations cited in the order to be corrected within 30 calendar days from the date the order was received.\n(b) The person to whom the order was issued shall provide information to the commissioner before the 31st day after the order was received demonstrating that the violation has been corrected or that appropriate steps toward correcting the violation have been taken. The commissioner shall determine whether the violation has been corrected and notify the person subject to the order of the commissioner's determination.\n(a) Except as provided in paragraph (b), if the commissioner determines that the violation has been corrected or appropriate steps have been taken to correct the action, the penalty must be forgiven. Unless the person requests review of the order under subdivision 7, 8, or 9 before the penalty is due, the penalty in the order is due and payable:\n(1) on the 31st day after the order was received, if the person subject to the order fails to provide information to the commissioner showing that the violation has been corrected or that appropriate steps have been taken toward correcting the violation; or\n(2) on the 20th day after the receipt of a notice by the person subject to the order of the commissioner's determination under subdivision 5, paragraph (b), that information supplied to the commissioner is not sufficient to show that the violation has been corrected or that appropriate steps have been taken toward correcting the violation.\n(b) For a repeated or serious violation, the commissioner may issue an order with a penalty that will not be forgiven after the corrective action is taken. The penalty is due within 30 days after the order was received unless review of the order under subdivision 7, 8, or 9 has been sought.\n(c) Interest at the rate established in section 549.09 begins to accrue on penalties on the date that the penalty is due and payable if no request for review is filed under subdivision 7, 8, or 9.\n(a) Within 30 days after the date on which an order was received, or within 20 days after the receipt of a notice that the commissioner has determined that a violation has not been corrected or appropriate steps have not been taken, the person subject to an order under this section may request an expedited hearing. The person to whom the order is directed and the commissioner are the parties to the expedited hearing to review the order and the penalty. The commissioner must notify the person to whom the order is directed of the time and place of the hearing at least 20 days before the hearing. The expedited hearing must be held within 30 days after a request for hearing has been filed with the commissioner unless the parties agree to a later date.\n(b) All written arguments must be submitted within ten days following the close of the hearing. The hearing must be conducted under the conference contested case rules of the Office of Administrative Hearings, as modified by this subdivision. The Office of Administrative Hearings may, in consultation with the commissioner, adopt rules specifically applicable to cases under this section.\n(c) The administrative law judge shall issue a report making recommendations about the order to the commissioner within 30 days following the close of the record. The administrative law judge may not recommend a change in the amount of the proposed penalty unless the administrative law judge determines that, based on the factors in subdivision 3, the amount of the penalty is unreasonable.\n(d) If the administrative law judge makes a finding that the hearing was requested solely for purposes of delay or that the hearing request was frivolous, the commissioner may add to the amount of the penalty the costs charged to the commissioner by the Office of Administrative Hearings for the hearing.\n(e) If a hearing has been held, the commissioner may not issue a final order until at least five days after receipt of the report of the administrative law judge. The person subject to the order may, within those five days, comment to the commissioner on the recommendations and the commissioner shall consider the comments. The final order may be appealed in the manner provided in sections 14.63 to 14.69.\n(f) If a hearing has been held and a final order issued by the commissioner, the penalty must be paid by the 15th day after the final order was mailed, together with interest accruing at the rate established in section 549.09 from 31 days after the original order was received.\n(a) Within 30 days after the receipt of an order, or within 20 days after the receipt of a notice that the commissioner has determined that a violation has not been corrected or appropriate steps have not been taken, the person subject to an order under this section may file a petition in district court for review of the order. The petition must be filed with the court administrator with proof of service on the commissioner. The petition must be captioned in the name of the person making the petition as petitioner and the commissioner as respondent. The petition must state with specificity the grounds upon which the petitioner seeks rescission of the order, including the facts upon which each claim is based.\n(b) At trial, the commissioner must establish by a preponderance of the evidence that a violation subject to this section and for which the petitioner is responsible occurred, that the factors listed in subdivision 3 were considered when the penalty amount was determined, and that the penalty amount is justified by those factors. In addition, if the commissioner immediately assesses a penalty as provided for under subdivision 5, paragraph (a), the commissioner must establish by a preponderance of the evidence that the immediate imposition of the penalty was justified.\nIn addition to review under subdivision 6 or 7, the commissioner may enter into mediation concerning an order issued under this section if the commissioner and the person to whom the order is issued both agree to mediation.\nA person subject to a corrective order under this section may not seek review of the order under both subdivisions 7 and 8.\n(a) The attorney general may proceed on behalf of the state to enforce penalties that are due and payable under this section in any manner provided by law for the collection of debts.\n(b) The attorney general may petition the district court to file the administrative order as an order of the court. At a court hearing, the only issues parties may contest are procedural and notice issues. Once entered, the administrative order may be enforced in the same manner as a final judgment of the district court.\n(c) If a person fails to pay the penalty, the attorney general may bring a civil action in district court seeking payment of the penalties, injunctive, or other appropriate relief including monetary damages, attorney fees, costs, and interest.\nIf a person fails to pay a penalty owed under this section, the commissioner has grounds to revoke or refuse to reissue or renew a license, permit, or certificate issued by the commissioner.\nThe authority of the commissioner to issue a corrective order assessing penalties is in addition to other remedies available under statutory or common law. Except as provided in subdivision 2, the payment of a penalty does not preclude the use of other enforcement provisions in connection with the violation for which the penalty was assessed.\nPenalties collected under this section must be deposited in the state treasury and credited to the trunk highway fund.",
	"repealed": false
}