{
	"id": "162.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.181",
	"title": "162.181 BONDS; COUNTY.",
	"text": "Except as otherwise provided herein, any county may, in accordance with chapter 475, issue and sell its obligations, the total amount thereof not to exceed the total of the preceding two years state-aid allotments, for the purpose of establishing, locating, relocating, constructing, reconstructing, and improving county state-aid highways and constructing buildings and other facilities for maintaining county state-aid highways. In the resolution providing for the issuance of the obligations, the county board of the county shall irrevocably pledge and appropriate to the sinking fund from which the obligations are payable, an amount of the money allotted or to be allotted to the county from its account in the county state-aid highway fund sufficient to pay the principal of and the interest on the obligations as they respectively come due. The obligations shall be issued in the amounts and on terms such that the amount of principal and interest due in any calendar year on the obligations, including any similar obligations of the county which are outstanding, shall not exceed 90 percent of the amount of the last annual allotment preceding the bond issue received by the county from the construction account in the county state-aid highway fund. All interest on the obligations shall be paid out of the county's normal maintenance account in the county state-aid highway fund. The obligations may be made general obligations, but if money of the county other than money received from the county state-aid highway fund, is used for payment of the obligations, the money so used shall be restored to the appropriate fund from the money next received by the county from the construction or maintenance account in the county state-aid highway fund which is not required to be paid into a sinking fund for obligations.\nObligations issued hereunder may be authorized by resolution of the county board without authorization by the electors, and shall not be included in the net debt of the county for the purpose of any statutory limitation on indebtedness. Expenditures made from the proceeds of the obligations shall not be considered as part of the cost of government of the county within the meaning of any statutory limitation on expenditures.\nMoney received from the sale of the obligations and spent for the establishment, location, relocation, construction, reconstruction, and improvement of county state-aid highways within the county shall be spent only in accordance with other provisions of law and the rules of the transportation commissioner relating to those purposes.\nAny county issuing and selling bonds pursuant to this section shall certify to the commissioner the amount of money required annually for the payment of principal and interest on the obligation. Upon receipt thereof, the commissioner shall certify to the commissioner of management and budget the sum of money needed annually by the county for the principal and interest, provided that the amount certified by the commissioner shall not exceed the limit heretofore specified. The commissioner of management and budget shall thereafter, until said bonds are retired, issue a payment annually in the amount certified payable to the county treasurer of the county, and the amount thereof shall be deposited by the county treasurer in the sinking fund from which the obligations are payable.\nThe powers granted in this section are in addition to all powers granted by other laws.",
	"repealed": false
}