{
	"id": "122A.188",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.188",
	"title": "122A.188 LICENSURE DENIAL; APPEAL.",
	"text": "(a) The Professional Educator Licensing and Standards Board must inform an applicant within 30 days of receiving a completed application whether the applicant's application for an initial teaching license or renewal of license has been approved or denied. A completed application must include all supporting information and the results of the background check or conduct determination by the board. When an application is denied, the notification letter must inform the applicant of the process for seeking review of the denial and of the appeals process provided in this section, including all deadlines for seeking review of the denial decision and filing an appeal. The notification letter must identify each licensure requirement the applicant failed to meet.\n(b) For purposes of this section, \"denial\" means denial of an initial license or a denial of a renewal license. Denial of an initial license includes a grant of a license that is a lower tier than the applicant applied for and denial of application for an additional field of licensure.\nAn applicant whose license application is denied may seek review of the denial by submitting a letter to the Professional Educator Licensing and Standards Board within 30 calendar days of receipt of the denial letter. The applicant may include any documentation necessary to demonstrate that the applicant meets the licensure requirements. The board must review the denial within 60 calendar days of receipt of the letter seeking review. If the board affirms the denial, the board must send the applicant a letter identifying each licensure requirement the applicant failed to meet and informing the applicant of the appeal process provided under this section.\nAn applicant whose application for license or license renewal has been denied under subdivisions 1 and 2 may appeal the decision by filing a written request with the Professional Educator Licensing and Standards Board within 30 days of notice that the board has affirmed the denial of license. The board must then initiate a contested case under the Administrative Procedure Act, sections 14.001 to 14.69.",
	"repealed": false
}