{
	"id": "282.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.41",
	"title": "282.41 SALE OF TAX-FORFEITED LEASED LANDS; ST. LOUIS COUNTY.",
	"text": "Notwithstanding sections 92.45 and 282.018, subdivision 1, and the public sale provisions of this chapter, St. Louis County may in its sole discretion sell tax-forfeited lakeshore lots that are currently leased. St. Louis County may also sell other adjacent tax-forfeited lands under this section that are necessary for roadway access and for creating conforming lot sizes. This section applies only to St. Louis County.\n(a) The leaseholder of a leased parcel may purchase at private sale the leased parcel and any other lands allocated to the parcel by the county under subdivision 6 that is offered for sale under this section. The purchase price is the appraised value of the land under subdivision 3 exclusive of improvements on it. To purchase a parcel, a leaseholder must pay in cash to the county an amount equal to the appraised value of the land within 180 days from the date of mailing to or service of notice of appraised value to the leaseholder by the county. The 180-day period runs from the date the county mails a copy of the appraisal to the leaseholder at the address shown upon the most recent lease agreement between the parties, exclusive of the date of mailing or service. The county may use any alternative method of notice under the Minnesota Rules of Civil Procedure for the service of a summons and complaint.\n(b) If the leaseholder does not purchase the parcel so offered, the county may offer the lands for sale at public auction under section 282.01, subdivision 3. If a person other than the leaseholder purchases the parcel, the purchaser must make payment in full to the leaseholder in the manner provided in section 92.06, subdivision 4, for the value of any improvements as determined under subdivision 3.\n(c) Failure of a purchaser to comply with the terms of payment voids the sale, and the county may reoffer the property for sale.\n(a) An appraisal must be made in accordance with section 282.01, subdivision 3, except as modified by this subdivision. Improvements that are owned by the lessee must be appraised separately.\n(b) The county must select the appraiser. The appraiser selected must meet the minimal appraisal standards established by the federal Farmers Home Administration or the federal Veterans Administration and must be licensed under section 82B.03, to appraise the property to be sold.\n(c) The county must allocate the costs of appraisal to the lots offered for sale, and the successful purchaser on each lot must reimburse the county for the appraisal costs allocated to the lot purchased. If no one purchases a lot, the county is responsible for the appraisal cost.\n(d) If a leaseholder disagrees with the appraised value of the leasehold improvements, the leaseholder may select an appraiser that meets the qualifications in paragraph (b) to reappraise the improvements. The leaseholder must give notice of intent to object to the appraised value of the improvements within ten days of the date of the mailing or service of notice under subdivision 2, paragraph (a). The leaseholder must deliver the reappraisal to the county auditor within 60 days of the date of mailing or service of notice of appraised value under subdivision 2, paragraph (a). If the reappraisal is not delivered to the county auditor according to this paragraph, the initial appraisal is conclusive. The leaseholder is responsible for the costs of the reappraisal. If the parcel is reappraised within the time required in this paragraph and the county and the leaseholder fail to agree on the value of the improvements by a date set by the county, each of the appraisers must agree upon the selection of a third appraiser to conduct a third appraisal that is conclusive as to the value of the improvements. The cost of the third appraisal must be paid equally by the county and the leaseholder.\n(a) Except as provided in paragraph (b), the county must deposit the proceeds from the sale of land described in subdivision 1 into an environmental trust fund as provided in Laws 1998, chapter 389, article 16, section 31, subdivision 4, as amended.\n(b) The following amounts may be withheld by the county board and not deposited into an environmental trust fund:\n(1) the costs of appraisal, abstracts, and surveys;\n(2) money received from a sale that is attributable to land owned by the county in fee;\n(3) amounts the county paid to lessees for improvements; and\n(4) the costs of sale to lessees or other parties, including the costs of advertising, realtors, and closing services.\n(a) Before offering a lot for sale, St. Louis County must have each lot surveyed by a licensed surveyor.\n(b) The county must allocate the costs of the survey to the lots offered for sale, and the successful purchaser on each lot must reimburse the county for the survey costs allocated to the lot purchased. If no one purchases the lot, the county is responsible for the survey costs. All surveying must be conducted by a licensed surveyor.\nAny lands to be sold under this section must be considered lots of record for zoning purposes. Whenever possible, St. Louis County may add land to the lots offered for sale to permit conformance with zoning requirements. The added lands must be included in the appraised value of the lot.\nSt. Louis County may designate whether roads within minor subdivisions under the county platting and subdivision ordinance are public or private.\nThe leaseholder may elect not to purchase the leased parcel if offered for sale under this section and instead continue in the annual lease program with the county, not to exceed the lifetime of the leaseholder. The fee for a lease under this subdivision must include the amount of the estimated property tax on the parcel if it had been returned to private ownership.",
	"repealed": false
}