{
	"id": "279.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/279.06",
	"title": "279.06 COPY OF LIST AND NOTICE.",
	"text": "Within five days after the filing of such list, the court administrator shall return a copy thereof to the county auditor, with a notice prepared and signed by the court administrator, and attached thereto, which may be substantially in the following form:\nThe state of Minnesota, to all persons, companies, or corporations who have or claim any estate, right, title, or interest in, claim to, or lien upon, any of the several parcels of land described in the list hereto attached:\nThe list of taxes and penalties on real property for the county of ............................... remaining delinquent on the first Monday in January, ......., has been filed in the office of the court administrator of the district court of said county, of which that hereto attached is a copy. Therefore, you, and each of you, are hereby required to file in the office of said court administrator, on or before the 20th day after the publication of this notice and list, your answer, in writing, setting forth any objection or defense you may have to the taxes, or any part thereof, upon any parcel of land described in the list, in, to, or on which you have or claim any estate, right, title, interest, claim, or lien, and, in default thereof, judgment will be entered against such parcel of land for the taxes on such list appearing against it, and for all penalties, interest, and costs. Based upon said judgment, the land shall be sold to the state of Minnesota on the second Monday in May, .......\nInquiries as to the proceedings set forth above can be made to the county auditor of ..... county whose address is ......\nThe notice must contain a narrative description of the various periods to redeem, specified in sections 281.17, 281.173, and 281.174, information about property tax relief programs that the property owner may be eligible for, including the property tax refund program under chapter 290A and the senior citizens' property tax deferral program under chapter 290B, and where further information about unencumbered interest in the property may be obtained. The notice must be made in the manner prescribed by the commissioner of revenue under subdivision 2. The commissioner of revenue must make the form available in multiple languages on the Department of Revenue's website. Counties must post these forms on their county website.\nThe list referred to in the notice shall be substantially in the following form:\nList of real property for the county of ......................., on which taxes remain delinquent on the first Monday in January, .......\nTown of (Fairfield),\nTownship (40), Range (20),\nAs to platted property, the form of heading shall conform to circumstances and be substantially in the following form:\nCity of (Smithtown)\nBrown's Addition, or Subdivision\nThe names, descriptions, and figures employed in parentheses in the above forms are merely for purposes of illustration.\nThe name of the town, township, range or city, and addition or subdivision, as the case may be, shall be repeated at the head of each column of the printed lists as brought forward from the preceding column.\nErrors in the list shall not be deemed to be a material defect to affect the validity of the judgment and sale.\nNotwithstanding the provisions of subdivision 1, the commissioner of revenue shall prescribe the form of the list and notice required under subdivision 1. The form shall contain the information required under subdivision 1, but shall be organized and presented in a manner easily read and understood. The print must be easily read and contain standard use of capital and lowercase letters. The court administrator shall use the form prescribed by the commissioner for purposes of this section. The notices published and mailed by the county auditor must also be in the form prescribed by the commissioner.",
	"repealed": false
}