{
	"id": "18J.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/18J.05",
	"title": "18J.05 ENFORCEMENT.",
	"text": "(a) A violation of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or an associated rule is a violation of this chapter.\n(b) Upon the request of the commissioner, county attorneys, sheriffs, and other officers having authority in the enforcement of the general criminal laws must take action to the extent of their authority necessary or proper for the enforcement of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules or valid orders, standards, stipulations, and agreements of the commissioner.\nIf minor violations of chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules occur or the commissioner believes the public interest will be best served by a suitable notice of warning in writing, this section does not require the commissioner to:\n(1) report the violation for prosecution;\n(2) institute seizure proceedings; or\n(3) issue a withdrawal from distribution, stop-sale, or other order.\nCivil judicial enforcement actions may be brought by the attorney general in the name of the state on behalf of the commissioner. A county attorney may bring a civil judicial enforcement action upon the request of the commissioner and agreement by the attorney general.\nThe commissioner may apply to a court with jurisdiction for a temporary or permanent injunction to prevent, restrain, or enjoin violations of this chapter.\nFor a criminal action, the county attorney from the county where a criminal violation occurred is responsible for prosecuting a violation of this chapter. If the county attorney refuses to prosecute, the attorney general on request of the commissioner may prosecute.\nAll persons licensed, permitted, registered, or certified under chapter 18G, 18H, 18K, 27, 223, 231, or 232; sections 21.80 to 21.92; or associated rules must appoint the commissioner as the agent upon whom all legal process may be served and service upon the commissioner is deemed to be service on the licensee, permittee, registrant, or certified person.",
	"repealed": false
}