{
	"id": "216B.243",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.243",
	"title": "216B.243 CERTIFICATE OF NEED FOR LARGE ENERGY FACILITY.",
	"text": "The commission shall, pursuant to chapter 14 and sections 216C.05 to 216C.30 and this section, adopt assessment of need criteria to be used in the determination of need for large energy facilities pursuant to this section.\nNo large energy facility shall be sited or constructed in Minnesota without the issuance of a certificate of need by the commission pursuant to sections 216C.05 to 216C.30 and this section and consistent with the criteria for assessment of need.\nNo proposed large energy facility shall be certified for construction unless the applicant can show that demand for electricity cannot be met more cost effectively through energy conservation and load-management measures and unless the applicant has otherwise justified its need. In assessing need, the commission shall evaluate:\n(1) the accuracy of the long-range energy demand forecasts on which the necessity for the facility is based;\n(2) the effect of existing or possible energy conservation programs under sections 216C.05 to 216C.30 and this section or other federal or state legislation on long-term energy demand;\n(3) the relationship of the proposed facility to overall state energy needs, as described in the most recent state energy policy and conservation report prepared under section 216C.18, or, in the case of a high-voltage transmission line, the relationship of the proposed line to regional energy needs, as presented in the transmission plan submitted under section 216B.2425;\n(4) promotional activities that may have given rise to the demand for this facility;\n(5) benefits of this facility, including its uses to protect or enhance environmental quality, and to increase reliability of energy supply in Minnesota and the region;\n(6) possible alternatives for satisfying the energy demand or transmission needs including but not limited to potential for increased efficiency and upgrading of existing energy generation and transmission facilities, load-management programs, and distributed generation, except that the commission must not require evaluation of alternative end points for a high-voltage transmission line qualifying as a large energy facility unless the alternative end points are (i) consistent with end points identified in a federally registered planning authority transmission plan, or (ii) otherwise agreed to for further evaluation by the applicant;\n(7) the policies, rules, and regulations of other state and federal agencies and local governments;\n(8) any feasible combination of energy conservation improvements, required under section 216B.241, that can (i) replace part or all of the energy to be provided by the proposed facility, and (ii) compete with it economically;\n(9) with respect to a high-voltage transmission line, the benefits of enhanced regional reliability, access, or deliverability to the extent these factors improve the robustness of the transmission system or lower costs for electric consumers in Minnesota;\n(10) whether the applicant or applicants are in compliance with applicable provisions of sections 216B.1691 and 216B.2425, subdivision 7, and have filed or will file by a date certain an application for certificate of need under this section or for certification as a priority electric transmission project under section 216B.2425 for any transmission facilities or upgrades identified under section 216B.2425, subdivision 7;\n(11) whether the applicant has made the demonstrations required under subdivision 3a; and\n(12) if the applicant is proposing a nonrenewable generating plant, the applicant's assessment of the risk of environmental costs and regulation on that proposed facility over the expected useful life of the plant, including a proposed means of allocating costs associated with that risk.\nThe commission may not issue a certificate of need under this section for a large energy facility that generates electric power by means of a nonrenewable energy source, unless the applicant for the certificate has demonstrated to the commission's satisfaction that it has explored the possibility of generating power by means of renewable energy sources and has demonstrated that the alternative selected is less expensive, including environmental costs, than power generated by a renewable energy source. For purposes of this subdivision, \"renewable energy source\" includes hydro, wind, solar, and geothermal energy and the use of trees or other vegetation as fuel.\n(a) The commission may not issue a certificate of need for the construction of a new nuclear-powered electric generating plant.\n(b) Any certificate of need for additional storage of spent nuclear fuel for a facility seeking a license extension shall address the impacts of continued operations over the period for which approval is sought.\nAny person proposing to construct a large energy facility shall apply for a certificate of need and for a site or route permit under chapter 216I prior to construction of the facility. The application shall be on forms and in a manner established by the commission. In reviewing each application the commission shall hold at least one public hearing pursuant to chapter 14. The public hearing shall be held at a location and hour reasonably calculated to be convenient for the public. An objective of the public hearing shall be to obtain public opinion on the necessity of granting a certificate of need and, if a joint hearing is held, a site or route permit. The commission shall designate a commission employee whose duty shall be to facilitate citizen participation in the hearing process. Unless the commission determines that a joint hearing on siting and need under this subdivision and chapter 216I is not feasible or more efficient, or otherwise not in the public interest, a joint hearing under this subdivision and chapter 216I must be held.\n[See Note.]\nWithin 12 months of the submission of an application, the commission shall approve or deny a certificate of need for the facility. Approval or denial of the certificate shall be accompanied by a statement of the reasons for the decision. Issuance of the certificate may be made contingent upon modifications required by the commission. If the commission has not issued an order on the application within the 12 months provided, the commission may extend the time period upon receiving the consent of the parties or on its own motion, for good cause, by issuing an order explaining the good cause justification for extension.\nAny application for a certificate of need shall be accompanied by the application fee required pursuant to this subdivision. The application fee is to be applied toward the total costs reasonably necessary to complete the evaluation of need for the proposed facility. The maximum application fee shall be $50,000, except for an application for an electric power generating plant as defined in section 216B.2421, subdivision 2, clause (1), or a high-voltage transmission line as defined in section 216B.2421, subdivision 2, clause (2), for which the maximum application fee shall be $100,000. Costs exceeding the application fee and reasonably necessary to complete the evaluation of need for the proposed facility shall be recovered from the applicant. If the applicant is a public utility, a cooperative electric association, a generation and transmission cooperative electric association, a municipal power agency, a municipal electric utility, or a transmission company, the recovery shall be done pursuant to section 216B.62. The commission shall establish by rule pursuant to chapter 14 and sections 216C.05 to 216C.30 and this section, a schedule of fees based on the output or capacity of the facility and the difficulty of assessment of need. Money collected in this manner shall be credited to the general fund of the state treasury.\n(a) Other state agencies authorized to issue permits for siting, construction or operation of large energy facilities, and those state agencies authorized to participate in matters before the commission involving utility rates and adequacy of utility services, shall present their position regarding need and participate in the public hearing process prior to the issuance or denial of a certificate of need. Issuance or denial of certificates of need shall be the sole and exclusive prerogative of the commission and these determinations and certificates shall be binding upon other state departments and agencies, regional, county, and local governments and special purpose government districts except as provided in sections 116C.01 to 116C.08 and 116D.04, subdivision 9.\n(b) An applicant for a certificate of need shall notify the commissioner of agriculture if the proposed project will impact cultivated agricultural land, as that term is defined in section 216G.01, subdivision 4. The commissioner may participate in any proceeding on the application and advise the commission as to whether to grant the certificate of need, and the best options for mitigating adverse impacts to agricultural lands if the certificate is granted. The Department of Agriculture shall be the lead agency on the development of any agricultural mitigation plan required for the project.\n(a) This section does not apply to:\n(1) cogeneration or small power production facilities as defined in the Federal Power Act, United States Code, title 16, section 796, paragraph (17), subparagraph (A), and paragraph (18), subparagraph (A), and having a combined capacity at a single site of less than 80,000 kilowatts; plants or facilities for the production of ethanol or fuel alcohol; or any case where the commission has determined after being advised by the attorney general that its application has been preempted by federal law;\n(2) a high-voltage transmission line proposed primarily to distribute electricity to serve the demand of a single customer at a single location, unless the applicant opts to request that the commission determine need under this section or section 216B.2425;\n(3) the upgrade to a higher voltage of an existing transmission line that serves the demand of a single customer that primarily uses existing rights-of-way, unless the applicant opts to request that the commission determine need under this section or section 216B.2425;\n(4) a high-voltage transmission line of one mile or less required to connect a new or upgraded substation to an existing, new, or upgraded high-voltage transmission line;\n(5) conversion of the fuel source of an existing electric generating plant to using natural gas;\n(6) the modification of an existing electric generating plant to increase efficiency, as long as the capacity of the plant is not increased more than ten percent or more than 100 megawatts, whichever is greater;\n(7) a large wind energy conversion system, as defined in section 216I.02, subdivision 12, or a solar energy generating system, as defined in section 216I.02, subdivision 18, for which a site permit application is submitted by an independent power producer under chapter 216I;\n(8) a large wind energy conversion system, as defined in section 216I.02, subdivision 12, or a solar energy generating system, as defined in section 216I.02, subdivision 18, engaging in a repowering project that:\n(i) will not result in the system exceeding the nameplate capacity under its most recent interconnection agreement; or\n(ii) will result in the system exceeding the nameplate capacity under its most recent interconnection agreement, provided that the Midcontinent Independent System Operator has provided a signed generator interconnection agreement that reflects the expected net power increase;\n(9) energy storage systems, as defined in section 216I.02, subdivision 6;\n(10) transmission lines that directly interconnect large wind energy conversion systems, solar energy generating systems, or energy storage systems to the transmission system; or\n(11) relocation of an existing high voltage transmission line to new right-of-way, provided that any new structures that are installed are not designed for and capable of operation at higher voltage.\n(b) For the purpose of this subdivision, \"repowering project\" means:\n(1) modifying a large wind energy conversion system or a solar energy generating system that is a large energy facility to increase its efficiency without increasing its nameplate capacity;\n(2) replacing turbines in a large wind energy conversion system without increasing the nameplate capacity of the system; or\n(3) increasing the nameplate capacity of a large wind energy conversion system.\n[See Note.]\nThis section does not apply to a wind energy conversion system or a solar electric generation facility that is intended to be used to meet the obligations of section 216B.1691, subdivision 2a or 2g; provided that, after notice and comment, the commission determines that the facility is a reasonable and prudent approach to meeting a utility's obligations under that section. When making this determination, the commission must consider:\n(1) the size of the facility relative to a utility's total need for renewable resources;\n(2) alternative approaches for supplying the renewable energy to be supplied by the proposed facility;\n(3) the facility's ability to promote economic development, as required under section 216B.1691, subdivision 9;\n(4) the facility's ability to maintain electric system reliability;\n(5) impacts on ratepayers; and\n(6) other criteria as the commission may determine are relevant.",
	"repealed": false
}