{
	"id": "360.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.018",
	"title": "360.018 REGULATING AIRCRAFT, AIRMEN, AIRPORTS, INSTRUCTORS.",
	"text": "The general public interest and safety, the safety of persons receiving instruction concerning or operating, using, or traveling in aircraft and of persons and property on the ground, and the interest of aeronautical progress requiring that aircraft operated within this state should be airworthy, that airmen and those engaged in air instruction should be properly qualified, and that airports, restricted landing areas, and air navigation facilities should be suitable for the purposes for which they are designed; the purposes of sections 360.013 to 360.075, requiring that the commissioner should be enabled to exercise the powers of supervision therein granted; and the advantages of uniform regulation making it desirable that aircraft operated within this state should conform with respect to design, construction, and airworthiness to the standards prescribed by the United States government with respect to civil aircraft subject to its jurisdiction and that persons engaging in aeronautics within this state should have the qualifications necessary for obtaining and holding appropriate airman certificates of the United States, the commissioner is authorized:\n(1) To require the registration annually of federal licenses, permits, or certificates of civil aircraft engaged in air navigation within this state, and to issue certificates of such registration, which certificates may be the same as the certificates issued pursuant to section 360.59, subdivision 3. The application for registration made pursuant to sections 360.54 to 360.67 shall be considered as the application for registration required by this section. The certificates of registration of aircraft issued pursuant to this section shall constitute licenses of such aircraft for operations within this state to the extent permitted by the federal licenses, certificates, or permits so registered. The application for registration shall contain such information as the commissioner may by rule or order prescribe. The first application for registration made in this state shall be verified by the applicant. The second and succeeding applications for registration need not be verified. Each application for registration of aircraft shall be made as required by sections 360.54 to 360.67.\n(2) To license any person engaged in commercial operations in accordance with rules to be adopted by the commissioner and to annually renew such a license. The rules adopted hereunder shall provide for:\n(i) compliance with all requirements of the United States government relating to permits or certificates governing aircraft and airmen; and\n(ii) compliance with all laws of the state of Minnesota and rules of any state department or agency promulgated thereunder.\nThe fee for an original license or renewal license is $30.\n(3) To approve airport and restricted landing area sites and to license airports, restricted landing areas, or other air navigation facilities, in accordance with rules to be adopted by the commissioner, and to renew such licenses. Licenses granted under this subdivision or under any prior law shall be renewed annually or every three years upon payment of the fee therefor, and licenses shall be granted for airports and restricted landing areas which were being operated under a license on the 1st day of July 1943, without requirements of a certificate of approval, unless the commissioner shall reasonably determine, after a public hearing to be called by the commissioner and held in the same manner and upon the same notice as is provided for hearings upon certificates of approval or original licenses, that the operation of such airport or restricted landing area is hazardous to persons operating, using, or traveling in aircraft or to persons and property on the ground. The commissioner shall make no charge for approval certificates of proposed property acquisition for airport or restricted landing area purposes. The fee for the issuance of each original license for an airport or restricted landing area is $15 per year and $40 for three years.\n(4) To suspend or revoke any license or certificate of registration of an aircraft or licensee of commercial operations issued by the commissioner, or to refuse to issue any such license or certificate of registration, on reasonably determining that any aircraft is not airworthy or that any licensee of commercial operations is not qualified; has engaged in advertising by means of false or deceptive statements; has been found guilty of gross incompetency or gross negligence; has been found guilty of fraud, dishonesty, forgery, or theft; has willfully violated the provisions of sections 360.013 to 360.075, the rules prescribed pursuant thereto, or any other statute of this state relating to aeronautics, or any act of Congress or any rule or regulation promulgated pursuant thereto; is addicted to the use of narcotics or other habit-forming drug or to the excessive use of intoxicating liquor; has made any false statement in any application for registration of a federal license, certificate, or permit; or has been guilty of other conduct, acts, or practices dangerous to the public safety and the safety of those engaged in aeronautics.\nExcept as hereinafter provided, it shall be unlawful for any person to operate or cause or authorize to be operated any civil aircraft within this state unless such aircraft has an appropriate effective license, certificate, or permit issued by the United States government which has been registered with the commissioner and such registration with the commissioner is in full force and effect, and it shall be unlawful for any person to engage in aeronautics as an airman in this state without an appropriate effective airman's license, certificate, or permit issued by the United States government authorizing the person to engage in the particular class of aeronautics in which engaged.\nThe provisions of subdivision 1, paragraphs (1) and (2), and subdivision 2 shall not apply to:\n(1) an aircraft which has been licensed by a foreign country with which the United States has a reciprocal agreement covering the operations of such licensed aircraft;\n(2) an aircraft which is owned by a nonresident of this state who is lawfully entitled to operate such aircraft in the state of residence;\n(3) an aircraft engaged principally in commercial flying constituting an act of interstate or foreign commerce;\n(4) an aircraft owned by, and used exclusively in the service of, any government or any political subdivision thereof, including the government of the United States, any state, territory, or possession of the United States, or the District of Columbia, which is not engaged in carrying persons or property for commercial purposes;\n(5) an airman operating an aircraft owned by, and used exclusively in the service of, any government or any political subdivision thereof, including the government of the United States, any state, territory, or possession of the United States, or the District of Columbia, which is not engaged in carrying persons or property for commercial purposes;\n(6) an airman operating any aircraft licensed by a foreign country with which the United States has a reciprocal agreement covering the operation of such licensed aircraft;\n(7) persons operating model aircraft, nor to any person piloting an aircraft which is equipped with fully functioning dual controls when a licensed instructor is in full charge of one set of said controls and such flight is solely for instruction or for the demonstration of said aircraft to a bona fide prospective purchaser;\n(8) a nonresident operating aircraft in this state who is lawfully entitled to operate aircraft in the state of residence;\n(9) an airman while operating or taking part in the operation of an aircraft engaged principally in commercial flying constituting an act of interstate or foreign commerce.\nThe federal license, certificate, or permit, and the evidence of registration in this or another state, if any, required for an airman shall be kept in the personal possession of the airman when operating within this state and must be presented for inspection upon the demand of any passenger, any peace officer of this state, or the commissioner, the commissioner's assistant, or any employee of the department, or any official, manager, or person in charge of any airport in this state upon which the airman shall land, or upon the reasonable request of any other person. The federal aircraft license, certificate, or permit, and the evidence of registration in this or another state, if any, required for aircraft must be carried in every aircraft operating in this state at all times and must be conspicuously posted therein where it may readily be seen by passengers or inspectors and must be presented for inspection upon the demand of any passenger, any peace officer of this state, the commissioner, the commissioner's assistant, or any employee of the department, or any official, manager, or person in charge of any airport in this state upon which it shall land, or upon the reasonable request of any person.\nIt shall be unlawful for any person to engage in commercial operations or to act as an aeronautics instructor in this state without having all required licenses, certificates, or permits of the commissioner and of the United States government.\nAll proposed airports, restricted landing areas, and other air navigation facilities shall be first licensed by the commissioner before they, or any of them, shall be used or operated. Any municipality or person acquiring property for the purpose of constructing or establishing an airport or restricted landing area shall, prior to such acquisition, make application to the commissioner for a certificate of approval of the site selected and the general purpose or purposes for which the property is to be acquired, to insure that the property and its use shall conform to minimum standards of safety and shall serve public interest. It shall be unlawful for any municipality or officer or employee thereof, or for any person, to operate an airport, restricted landing area, or other air navigation facility for which the required annual license has not been issued by the commissioner. Notwithstanding the foregoing, a personal use airport that is more than five miles from a public airport, whether publicly or privately owned, need not obtain a license from the commissioner.\nWhenever the commissioner makes an order granting or denying a certificate of approval of an airport or a restricted landing area, or an original license to use or operate an airport, restricted landing area, or other air navigation facility, and the applicant or any interested municipality, within 15 days after notice of such order has been sent the applicant by certified mail, demands a public hearing, or whenever the commissioner desires to hold a public hearing before making an order, such a public hearing in relation thereto shall be held in the municipality applying for the certificate of approval or license or, in case the application was made by anyone other than a municipality, at the county seat of the county in which the proposed airport, restricted landing area, or other air navigation facility is proposed to be situated, at which hearing parties in interest and other persons shall have an opportunity to be heard. Notice of the hearing shall be published by the commissioner in a legal newspaper of general circulation in the county in which the hearing is to be held, at least 15 days prior to the date of hearing. After a proper and timely demand has been made, the order shall be stayed until after the hearing, when the commissioner may affirm, modify, or reverse it, or make a new order. If no hearing is demanded as herein provided, the order shall become effective upon the expiration of the time permitted for making a demand. Where a certificate of approval of an airport or restricted landing area has been issued by the commissioner, the commissioner may grant a license for operation and use, and no hearing may be demanded thereon; provided, however, and subject to the provisions of section 473.622, as amended, should the airport for which a license is applied lie within the area under the jurisdiction of any corporation organized and existing under sections 473.601 to 473.679, the commissioner, before issuing the first license for the operation of said airport, shall forthwith serve notice in writing of the application, together with a copy thereof to the said corporation. Within 15 days after service of such notice said corporation shall serve written notice upon the commissioner whether or not it regards the acquisition and/or operation of said airport as constituting a hazard to the safe operation of an airport or airports owned or operated by it. If in the opinion of the corporation it does not constitute such a hazard, the commissioner may thereafter proceed in the matter of granting or refusing to grant a license in accordance with and pursuant to the provisions of this chapter. If the corporation, however, be of the opinion that the acquisition and/or operation of such airport would create such a hazard, then the commissioner shall set a time and place for a joint hearing upon the application for license and for consent to or approval by the corporation of the acquisition and/or operation of said airport, which hearing shall be held within 45 days after the service of such notice upon the applicant, the corporation and other interested parties, unless such time shall be extended by consent of all interested parties. At said hearing the corporation shall offer such evidence as it deems material to sustain its contention that the acquisition and/or operation of said airport would create such a hazard. Thereafter other interested parties supporting the view of the corporation shall be heard; and thereafter the applicant and other interested parties supporting applicant's view or their independent views shall be heard, and shall offer such evidence as they deem material to sustain their respective views and contentions. Each party shall have an opportunity of offering rebuttal testimony or rebuttal evidence.\nWithin ten days after the close of the hearing the corporation shall make its order in writing approving or refusing to approve the acquisition and/or operation of said airport; provided that if the order is one disapproving, it must be based solely upon the grounds that the acquisition and/or operation of said airport would constitute a hazard to the safe operation of an airport or airports owned or operated by it or presently to be constructed or being constructed to be operated by it, and its order shall set forth its findings of fact and its reasons for the conclusion reached. The provisions of this proviso shall apply only to securing the first approval or disapproval of the establishment and operation of said airport or restricted landing area and once the same shall have been approved by the corporation renewal licenses may be issued therefor by the commissioner of transportation without notice to the corporation.\nIn determining whether to issue a certificate of approval or license for the use or operation of any proposed airport or restricted landing area, the commissioner shall take into consideration its proposed location, size, and layout, the relationship of the proposed airport or restricted landing area to a comprehensive plan for statewide and nationwide development, whether there are safe areas available for expansion purposes, whether the adjoining area is free from obstructions based on a proper glide ratio, the nature of the terrain, the nature of the uses to which the proposed airport or restricted landing area will be put, and the possibilities for future development.\nThe provisions of subdivisions 6, 7, and 8 shall not apply to any airport, restricted landing area, or other air navigation facility owned or operated by the federal government within this state, or by any public corporation created in and for contiguous cities of the first class of this state. No airport, restricted landing area, or other air navigation facility shall be acquired or operated within 25 miles of the city hall of either of two contiguous cities of the first class for which a public corporation is organized and existing under sections 473.601 to 473.679, without the consent of such corporation, as provided in and limited by section 473.622.\nThe commissioner is empowered to suspend or revoke any certificate of approval or license issued by the commissioner upon determining that an airport, restricted landing area, or other air navigation facility is not being maintained or used in accordance with the provisions of sections 360.011 to 360.076, and the rules lawfully promulgated pursuant thereto.\nTo carry out the provisions of sections 360.011 to 360.076, the commissioner, the commissioner's assistant, the employees of the department, and any officers, state or municipal, charged with the duty of enforcing sections 360.011 to 360.076, may inspect and examine at reasonable hours any premises, and the buildings and other structures thereon, where airports, restricted landing areas, air schools, flying clubs, or other air navigation facilities or aeronautical activities are operated or carried on.\nNo person shall operate a motor vehicle off a designated roadway on airport property without the authorization of the airport owner, or operate a motor vehicle anywhere on airport property in a careless or reckless manner with willful disregard for the safety of persons or property. A violation of this subdivision is a misdemeanor.",
	"repealed": false
}