{
	"id": "25.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/25.39",
	"title": "25.39 INSPECTION FEES AND REPORTS.",
	"text": "(a) An inspection fee at the rate of 16 cents per ton must be paid to the commissioner on commercial feeds distributed in this state by the person who first distributes the commercial feed, except that:\n(1) no fee need be paid on any feed ingredient in a customer formula feed that has been directly furnished by the customer; or\n(2) no fee need be paid on a first distribution if made to a qualified buyer who, with approval from the commissioner, is responsible for the fee. Such license-specific tonnage-fee-exemption permits shall be issued on a calendar year basis to commercial feed licensees who distribute feed or feed ingredients outside the state, and who submit a $100 nonrefundable application fee and comply with rules adopted by the commissioner relative to record keeping, tonnage of commercial feed distributed in Minnesota, total of all commercial feed tonnage distributed, and all other information which the commissioner may require so as to ensure that proper inspection fee payment has been made.\n(b) In the case of pet food or specialty pet food distributed in the state only in packages of ten pounds or less, a distributor must register each product annually on forms provided by the commissioner, accompanied by an annual application fee of $100 for each product in lieu of the inspection fee, and within five business days, submit a current label for each product upon the request of the commissioner. This annual fee must be received by the commissioner on or before June 30 or postmarked on or before June 30. The inspection fee required by paragraph (a) applies to pet food or specialty pet food distributed in packages exceeding ten pounds.\n(c) The minimum inspection fee is $75 per annual reporting period.\nA distributor who is subject to the annual fee specified in subdivision 1, paragraph (b), must do the following:\n(1) before beginning distribution, register with the commissioner the pet and specialty pet foods to be distributed in the state only in containers of ten pounds or less, on forms provided by the commissioner. The registration under this clause must be renewed annually on or before June 30 and is the basis for the payment of the annual fee. New products added during the year must be submitted to the commissioner as a supplement to the annual registration before distribution; and\n(2) if the annual renewal of the registration is not received or postmarked on or before June 30 or if an unregistered product is distributed, pay a late filing fee of $100 per product in addition to the normal charge for the registration. The late filing fee under this clause is in addition to any other penalty under this chapter.\nA person who is liable for the payment of a fee under this section must file with the commissioner on forms furnished by the commissioner an annual statement setting forth the number of net tons of commercial feeds distributed in this state during the calendar year. The report is due on or before the 31st of each January following the year of distribution. The inspection fee at the rate specified in subdivision 1 must accompany the statement. For each tonnage report not filed with the commissioner or payment of inspection fees not received by the commissioner on or before January 31 or postmarked on or before January 31, a penalty of ten percent of the amount due, with a minimum penalty of $10, must be assessed against the license holder, and the amount of fees due, plus penalty, is a debt and may be recovered in a civil action against the license holder. The assessment of this penalty does not prevent the department from taking other actions as provided in this chapter.\nEach person required to pay an inspection fee or to report in accordance with this section must keep records, as determined by the commissioner, accurately detailing the tonnage of commercial feed distributed in this state. Records upon which the tonnage is based must be maintained for six years and made available to the commissioner for inspection, copying, and audit. A person who is located outside of this state must maintain and make available records required by this section in this state or pay all costs incurred in auditing of the records at another location. Unless required for the enforcement of this chapter, the information in the records required by this subdivision is private or nonpublic.\nA commercial feed inspection account is established in the agricultural fund. Fees and penalties collected under this chapter and interest attributable to money in the account must be deposited in the agricultural fund and credited to the commercial feed inspection account. Money in the account, including interest earned, is appropriated to the commissioner for the administration and enforcement of this chapter.",
	"repealed": false
}