{
	"id": "51A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.46",
	"title": "51A.46 RECEIVERSHIP.",
	"text": "If the commissioner shall find that any association: (a) is in an impaired condition; (b) is engaging in practices which threaten to result in an impaired condition; or (c) is in violation of an order or injunction, as provided in section 51A.45, which has become final in that the time to appeal has expired without appeal or a final order entered from which there can be no appeal, the commissioner may appoint a receiver for such association, which may be the commissioner, a deputy or any other person, and upon such appointment shall apply immediately to a court of general jurisdiction in the county in which the principal office of the association is located for confirmation of such appointment, and such court shall have exclusive jurisdiction to determine the issues and all related matters. Such proceedings shall be given precedence over other cases pending in such court, and shall in every way be expedited. Such court shall confirm such appointment if it shall find that one or more such grounds exist, and a certified copy of the order of the court confirming such appointment shall be evidence thereof. In the case of an insured association, the appointment by the commissioner of a receiver under this section shall constitute an official determination of a public authority of this state pursuant to which a receiver is appointed for the purpose of liquidation as contemplated by and within the meaning of section 401(d) of the National Housing Act of 1934, as amended, if, within ten days after the date the application of the commissioner is filed, confirmation of such appointment or denial of confirmation has not been issued by the court. Such receiver shall have all the powers and authority of a conservator plus the power to liquidate, and shall have such other powers and authority as may be expressed in the order of the court. If the commissioner, or a deputy, or examiner is appointed receiver, then the compensation of the receiver, as determined by the court, shall be paid from the assets of the association.\nIf the association is an institution insured by the Federal Savings and Loan Insurance Corporation, the Federal Savings and Loan Insurance Corporation shall be tendered appointment as receiver or coreceiver. If it accepts such appointment, it may, nevertheless, make loans on the security of or purchase at public or private sale any part or all of the assets of the association of which it is receiver or coreceiver, provided such loan or purchase is approved by such court.\nThe procedure in such receivership action shall be in all other respects in accordance with the practice in such court, including all rights of appeal and review. The directors, officers, and attorneys of an association in office at the time of the initiation of any proceeding under this section or section 51A.45 may contest any such proceeding.",
	"repealed": false
}