{
	"id": "145.685",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.685",
	"title": "145.685 COMMUNICATION AND RESOLUTION AFTER A HEALTH CARE ADVERSE INCIDENT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Health care adverse incident\" means an objective and definable outcome arising from or related to patient care that results in the death or physical injury of a patient.\n(c) \"Health care provider\" means a person who is licensed, certified, or registered, or otherwise permitted by state law, to administer health care in the ordinary course of business or in the practice of a profession and practices at a health facility.\n(d) \"Health facility\" means a hospital or outpatient surgical center licensed under sections 144.50 to 144.56; a medical, dental, or health care clinic; a diagnostic laboratory; or a birthing center licensed under section 144.615. The definition of health facility includes any corporation, professional corporation, partnership, limited liability company, limited liability partnership, or other entity comprised of health facilities or health care providers.\n(e) \"Open discussion\" means all communications that are made during an open discussion process under this section and includes memoranda, work product, documents, and other materials that are prepared for or submitted in the course of or in connection with communications made under this section. Open discussion does not include any communication, memoranda, work product, or other materials that would otherwise be subject to discovery and were not prepared specifically for use in an open discussion pursuant to this section.\n(f) \"Patient\" means a person who receives health care from a health care provider. If the patient is under 18 years of age and is not an emancipated minor, the definition of patient includes the patient's legal guardian or parent. If the patient is deceased or incapacitated, the definition of patient includes the patient's legal representative.\n(a) If a health care adverse incident occurs, a health care provider involved in the health care adverse incident, the health facility involved in the health care adverse incident, or both jointly may provide the patient with written notice of their desire to enter into an open discussion with the patient to discuss potential outcomes following a health care adverse incident in accordance with this section. A health facility may designate a person or class of persons who has the authority to provide the notice on behalf of the health facility. The patient involved in the health care adverse incident may provide oral notice to the health care provider, the health facility involved in the health care adverse incident, or both, of the patient's desire to enter into an open discussion with either the health care provider, or the health care provider and health facility jointly, to discuss potential outcomes following a health care adverse incident in accordance with this section.\n(b) If a health care provider or health facility decides to enter into an open discussion as specified in this section, the written notice must be sent to the patient within 365 days from the date the health care provider or the health facility knew, or through the use of diligence should have known, of the health care adverse incident. The notice must include:\n(1) the health care provider, health facility, or both jointly desire to pursue an open discussion in accordance with this section;\n(2) the patient's right to receive a copy of the medical records related to the health care adverse incident and the patient's right to authorize the release of the patient's medical records related to the health care adverse incident to a third party;\n(3) the patient's right to seek legal counsel and to have legal counsel present throughout the open discussion process;\n(4) a copy of section 541.076 with notice that the time for a patient to bring a lawsuit is limited under section 541.076 and will not be extended by engaging in an open discussion under this section unless all parties agree in writing to an extension;\n(5) that if the patient chooses to engage in an open discussion with the health care provider, health facility, or jointly with both, all communications made during the course of the open discussion process, including communications regarding the initiation of an open discussion are:\n(i) privileged and confidential;\n(ii) not subject to discovery, subpoena, or other means of legal compulsion for release; and\n(iii) not admissible as evidence in a proceeding arising directly out of the health care adverse incident, including a judicial, administrative, or arbitration proceeding; and\n(6) that any communications, memoranda, work product, documents, or other material that are otherwise subject to discovery and not prepared specifically for use in an open discussion under this section are not confidential.\n(c) If the patient agrees to engage in an open discussion with a health care provider, health facility, or jointly with both, the agreement must be in writing and must state that the patient has received the notice described in paragraph (b).\n(d) Upon agreement to engage in an open discussion, the patient, health care provider, or health facility may include other persons in the open discussion process. All other persons included in the open discussion must be advised of the parameters of communications made during the open discussion process specified under paragraph (b), clauses (5) and (6).\n(e) If a health care provider or health facility decides to engage in an open discussion, the health care provider or health facility may:\n(1) investigate how the health care adverse incident occurred, including gathering information regarding the medical care or treatment and disclose the results of the investigation to the patient;\n(2) openly communicate to the patient the steps the health care provider or health facility will take to prevent future occurrences of the health care adverse incident; and\n(3) determine that no offer of compensation for the health care adverse incident is warranted or that an offer of compensation for the health care adverse incident is warranted.\n(f) If a health care provider or health facility determines that no offer of compensation is warranted, the health care provider or health facility shall orally communicate that decision to the patient.\n(g) If a health care provider or a health facility determines that an offer of compensation is warranted, the health care provider or health facility shall provide the patient with a written offer of compensation. If an offer of compensation is made under this paragraph, and the patient is not represented by legal counsel, the health care provider or health facility shall:\n(1) advise the patient of the patient's right to seek legal counsel regarding the offer of compensation and encourage the patient to seek legal counsel; and\n(2) provide notice to the patient that the patient may be legally required to repay medical and other expenses that were paid by a third party on the patient's behalf, including private health insurance, Medicaid, or Medicare, along with an itemized statement from the health provider showing all charges and third-party payments.\n(h) Except for an offer of compensation made under paragraph (g), open discussions between the health care provider or health facility and the patient about compensation shall not be in writing.\n(a) Open discussion communications made under this section, including offers of compensation made under subdivision 2:\n(1) do not constitute an admission of liability;\n(2) are privileged and confidential and shall not be disclosed;\n(3) are not admissible as evidence in any subsequent judicial, administrative, or arbitration proceeding arising directly out of the health care adverse incident, except as provided in paragraph (b);\n(4) are not subject to discovery, subpoena, or other means of legal compulsion for release; and\n(5) shall not be disclosed by any party in any subsequent judicial, administrative, or arbitration proceeding arising directly out of the health care adverse incident.\n(b) A party may move the court or other decision maker in a subsequent proceeding to adjudicate the matter to admit as evidence a communication made during an open discussion that contradicts a statement made during the proceeding. The court or other decision maker shall allow a communication made during an open discussion that contradicts a statement made at a subsequent proceeding to adjudicate the matter into evidence only if the communication made during an open discussion is material to the claims presented in the subsequent proceeding.\n(c) Communications, memoranda, work product, documents, and other materials that are otherwise subject to discovery and that were not prepared specifically for use in an open discussion under this section are not confidential.\n(d) The limitation on disclosure imposed by this subdivision includes disclosure during any discovery conducted as part of a subsequent adjudicatory proceeding, and a court or other adjudicatory body shall not compel any person who engages in an open discussion under this section to disclose confidential communications or agreements made under this section.\n(e) This subdivision does not affect any other law, rule, or requirement with respect to confidentiality.\n(a) If a patient accepts an offer of compensation made pursuant to this section, and payment of compensation is made to a patient as a result, the payment to the patient is not payment resulting from:\n(1) a written claim or demand for payment;\n(2) a final judgment, settlement, or arbitration award against a health care institution for medical malpractice purposes; or\n(3) a malpractice claim settled or in which judgment is rendered against a health care professional for purposes of reporting by malpractice insurance companies under sections 146A.03, 147.111, 147A.14, 148.102, 148.263, 148B.381, 148F.205, 150A.13, and 153.24.\n(b) A health care provider or health facility may require, as a condition of an offer of compensation made pursuant to this section, a patient to execute all documents and obtain any necessary court approval to resolve a health care adverse incident. The parties shall negotiate the form of the documents to be executed and obtain court approval as necessary.\nThis section sunsets on June 30, 2031.\nThis section applies only to health care adverse incidents that occur on or after August 1, 2023.",
	"repealed": false
}