{
	"id": "270C.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.19",
	"title": "270C.19 TAXES AND FEES; REFUND AND SHARING AGREEMENTS WITH INDIANS.",
	"text": "(a) Notwithstanding any other law which limits the refund of tax, the commissioner is authorized to enter into a tax refund agreement with the governing body of any federally recognized Indian Tribe in Minnesota.\n(b) The agreement may provide for:\n(1) a mutually agreed-upon amount as a refund to the governing body of an estimate of any sales or excise tax paid by Tribal members on transactions occurring on the reservation or on transactions that would occur on the reservation if there was no agreement; or\n(2) an amount which measures the economic value of an agreement by the Tribal government to pay the equivalent of the state sales tax on items included in the sales tax base but exempt on the reservation.\n(c) For purposes of this section, \"Tribal members\" means the number of enrolled members of the Tribe who live on or adjacent to the reservation as defined in the agreement.\n(d) In arriving at the refund amount, the commissioner must consider the number of Tribal members as most recently submitted by the Tribe to the commissioner, estimates contained in the tax incidence report under section 270C.13, and any other information available to the commissioner.\n(a) The commissioner is authorized to enter into a tax agreement with the governing body of any federally recognized Indian Tribe in Minnesota, that provides for the state and the Tribal government to share sales, use, and excise tax revenues generated from on-reservation activities of non-Tribal members and off-reservation activities of Tribal members. Every agreement entered into pursuant to this subdivision must require the commissioner to collect all state and Tribal taxes covered by the agreement.\n(b) The commissioner is authorized to collect any Tribal taxes imposed pursuant to any agreement entered into pursuant to this subdivision and to make payments authorized by the agreement to the Tribal government from the funds collected.\n(c) The commissioner shall pay to the Tribal government its share of the taxes collected pursuant to the agreement, as indicated in the agreement, and grant the taxpayer a credit for the taxpayer's share of the amount paid to the Tribal government against the taxpayer's Minnesota tax.\nThere is annually appropriated from the general fund to the commissioner the amounts necessary to make the refunds provided in this section.\n(a) The commissioner shall pay to a county in which an Indian gaming casino is located:\n(1) ten percent of the state share of all taxes generated from activities on reservations and collected under a tax agreement under this section with the tribal government for the reservation located in the county; or\n(2) five percent of excise taxes collected by the state that are determined by the department to have been generated from activities on a reservation located in the county, the tribal government of which does not have a tax agreement under this section and did not have a tax agreement on June 30, 2003.\nIf the tribe has casinos located in more than one county, the payment must be divided equally among the counties in which the casinos are located.\n(b) The commissioner shall make the payments required under this subdivision by February 28 of the year following the year the taxes are collected.\n(c) An amount sufficient to make the payments authorized by this subdivision is annually appropriated from the general fund to the commissioner.\n(a) The commissioner may enter into an agreement with the governing body of any federally recognized Indian reservation in Minnesota concerning fees administered by the commissioner that are paid by the tribe, members of the tribe, or persons who conduct business with the tribe, or otherwise imposed on on-reservation activities. The agreement may provide for the refund or sharing of the fee. The commissioner may make any payments required by the agreement from the fees collected.\n(b) Each head of an agency, board, or other governmental entity that administers a program that is funded by fees administered by the commissioner may sign an agreement entered into by the commissioner under this subdivision. An agreement is not valid until signed by the head of each agency, board, or other governmental entity that administers a program funded by the particular fee covered in an agreement and by the commissioner.\n(c) There is annually appropriated to the commissioner from the funds for which the fees are collected the amounts necessary to make payments as provided in this subdivision.\n(a) The commissioner is authorized to enter into a tax agreement with the governing body of any federally recognized Indian Tribe in Minnesota that provides for the state and the Tribal government to share state and local sales tax and gross receipts tax imposed on the sale of cannabis at retail by a Tribally owned business at a location off the reservation.\n(b) Any payment to the Tribe under this subdivision must be limited to an approximation of the expenses borne by the Tribe in regulating the production and supplying of cannabis products to the off-reservation retail business and to taxes paid by members of the Tribe at that business location.\n(c) Authority under this subdivision applies only to Tribal governments that have a compact under section 3.9228.\n(d) There is annually appropriated from the general fund to the commissioner the amount necessary to make the payments provided in this subdivision.",
	"repealed": false
}