{
	"id": "201.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.022",
	"title": "201.022 STATEWIDE REGISTRATION SYSTEM.",
	"text": "The secretary of state shall maintain a statewide voter registration system to facilitate voter registration and to provide a central database containing voter registration information from around the state. The system must be accessible to the county auditor of each county in the state. The system must also:\n(1) provide for voters to submit their voter registration applications to any county auditor, the secretary of state, or the Department of Public Safety;\n(2) provide for the definition, establishment, and maintenance of a central database for all voter registration information;\n(3) provide for entering data into the statewide registration system;\n(4) provide for electronic transfer of completed voter registration applications from the Department of Public Safety to the secretary of state or the county auditor;\n(5) assign a unique identifier to each legally registered voter in the state;\n(6) provide for the acceptance of the Minnesota driver's license number, Minnesota state identification number, and last four digits of the Social Security number for each voter record;\n(7) coordinate with other agency databases within the state;\n(8) allow county auditors and the secretary of state to add or modify information in the system to provide for accurate and up-to-date records;\n(9) allow county auditors, municipal and school district clerks, and the secretary of state to have electronic access to the statewide registration system for review and search capabilities;\n(10) provide security and protection of all information in the statewide registration system and ensure that unauthorized access is not allowed;\n(11) provide access to municipal clerks to use the system;\n(12) provide a system for each county to identify the precinct to which a voter should be assigned for voting purposes;\n(13) provide daily reports accessible by county auditors on the driver's license numbers, state identification numbers, or last four digits of the Social Security numbers submitted on voter registration applications that have been verified as accurate by the secretary of state;\n(14) provide reports on the number of absentee ballots transmitted to and returned and cast by voters under section 203B.16; and\n(15) provide reports necessary for early voting.\nThe appropriate state or local official shall provide security measures to prevent unauthorized access to the computerized list established under section 201.021.\n[See Note.]\nThe secretary of state shall make permanent rules necessary to administer the system required in subdivision 1.\nThe secretary of state must consult with representatives of local election officials in the development of the statewide voter registration system.",
	"repealed": false
}