{
	"id": "60A.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.121",
	"title": "60A.121 VALUATIONS; DEFINITIONS.",
	"text": "The definitions in this section apply to sections 60A.121 to 60A.127.\n\"Commercial mortgage loan\" means a loan by an insurer secured by a mortgage on commercial real estate. \"Commercial mortgage loan\" does not include loans secured by residential real estate containing four or fewer dwelling units or agricultural real estate.\n\"Contractual terms\" means the principal and interest payments of the commercial mortgage loan as scheduled in the mortgage agreement.\n\"Delinquent mortgage loan\" means a loan 90 days delinquent on a required payment of principal or interest.\n\"Distressed mortgage loan\" means a loan, other than a delinquent loan, that is determined by the management of the insurer, in the exercise of its prudent investment judgment, to involve circumstances that create a reasonable probability that the loan may become a delinquent mortgage loan or a mortgage loan in foreclosure.\n\"Independent appraiser\" means a person not employed by the insurer, by an affiliate of the insurer, or by an investment advisor to the insurer who develops and communicates real estate appraisals and holds a current, valid license issued under section 82B.08, or a similar law enacted by another state.\n\"Internal appraisal\" means an appraisal to determine current market value made by an internal appraiser and based upon an evaluation of:\n(1) the property based upon a physical inspection of the premises;\n(2) the current and expected stabilized cash flow generated by the property;\n(3) the current and expected stabilized market rents in the geographic market where the property is located; and\n(4) the current and stabilized occupancy rates for the geographic market where the property is located.\n\"Internal appraiser\" means an individual:\n(1) employed by an insurer, by an affiliate of the insurer, or by an investment advisor to an insurer;\n(2) who has training and experience qualifying the individual to appraise the value of commercial real estate;\n(3) whose direct or indirect compensation is not dependent upon the outcome of the appraisals performed under sections 60A.121 to 60A.126; and\n(4) who has direct reporting access to the chief investment officer of the insurer.\n\"Insurer\" means a domestic insurance company.\n\"Mortgage loan in foreclosure\" means (1) a loan in the process of foreclosure including the time required for expiration of any equitable or statutory redemption rights; (2) a loan to a mortgagor who is the subject of a bankruptcy petition and who is not making payments according to the contractual terms; or (3) a loan secured by a mortgage on real estate that is subject to a senior mortgage or other lien that is being foreclosed.\n\"Performing mortgage loan\" means a mortgage loan current in payment and not in distress.\nA commercial mortgage loan will be \"permanently impaired\" when, based on current information and events, it is probable that an insurer will be unable to collect all amounts due according to the contractual terms.\n\"Real estate owned\" means real property owned and acquired by an insurer through or in lieu of foreclosure and as to which all equitable or statutory rights of redemption have expired.\n\"Restructured mortgage loan\" means a loan where:\n(1) material delinquent payments or accrued interest are capitalized and added to the balance of an outstanding loan; or\n(2) the insurer has abated or reduced interest payments below market rates existing at the date of restructuring.",
	"repealed": false
}