{
	"id": "216H.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/216H.021",
	"title": "216H.021 GREENHOUSE GAS EMISSIONS REPORTING.",
	"text": "In order to measure the progress in meeting the goals of section 216H.02, subdivision 1, and to provide information to develop strategies to achieve those goals, the commissioner of the Pollution Control Agency shall establish a system for reporting and maintaining an inventory of greenhouse gas emissions. The commissioner must consult with the chief information officer of the Department of Information Technology Services about system design and operation. Greenhouse gas emissions include those emissions described in section 216H.01, subdivision 2.\n(a) The commissioner shall, to the extent practicable, design the system to coordinate with other regional or federal greenhouse gas emissions-reporting and inventory systems. The coordination may, without limitation, include the use of similar forms and reports, the sharing of information, and the use of common facilities, systems, and databases.\n(b) The reporting system need not include all sources of emissions nor all amounts of emissions but, at its outset, must include:\n(1) all stationary sources and other facilities required to obtain a permit under Title V of the federal Clean Air Act, United States Code, title 42, section 7401 et seq.; and\n(2) facilities whose annual carbon dioxide equivalent emissions, as defined in section 216H.10, subdivision 3, exceed a threshold set by the commissioner at between 10,000 tons and 25,000 tons. The reporting threshold set by the commissioner must be consistent with the goal of accurately tracking progress in attaining greenhouse gas emissions-reduction goals and the need for emissions data to assist in developing greenhouse gas emissions-reduction strategies.\n(c) In designing the greenhouse gas emissions-reporting system, the commissioner shall consider requiring the reporting of greenhouse gas emissions from transportation fuels and greenhouse gas emissions from natural gas combustion that are not included in reporting from stationary sources. In determining whether to include reporting of these emissions, the commissioner must consider both the goal of accurately tracking progress in attaining greenhouse gas emissions-reduction goals and the need for emissions data to assist in developing greenhouse gas emissions-reduction strategies recommended by the Minnesota Climate Change Advisory Group. If the commissioner decides that transportation fuels and portions of natural gas combustion should not be included in the initial emissions-reporting system, the commissioner must report to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over energy and environmental policy the reasons for that decision and suggestions for steps that should be taken to allow their inclusion in the emissions-reporting system in the future.\n(d) A facility reporting greenhouse gas emissions under this section must maintain the data used to create the reports for a minimum of five years.\nThe commissioner of the Pollution Control Agency may adopt rules for the purposes of this section.",
	"repealed": false
}