{
	"id": "60A.209",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.209",
	"title": "60A.209 INSURANCE PROCURED FROM INELIGIBLE INSURERS.",
	"text": "A resident of this state may obtain insurance from an ineligible surplus lines insurer in this state through a surplus lines broker. The broker shall first attempt to place the insurance with a licensed insurer, or if that is not possible, with an eligible surplus lines insurer. If coverage is not obtainable from a licensed insurer or an eligible surplus lines insurer, the broker shall certify to the commissioner, on a form prescribed by the commissioner, that these attempts were made. Upon obtaining coverage from an ineligible surplus lines insurer, the broker shall:\n(a) Have printed, typed, or stamped in red ink upon the face of the policy in not less than 10-point type the following notice: \"THIS INSURANCE IS ISSUED PURSUANT TO THE MINNESOTA SURPLUS LINES INSURANCE ACT. THIS INSURANCE IS PLACED WITH AN INSURER THAT IS NOT LICENSED BY THE STATE NOR RECOGNIZED BY THE COMMISSIONER OF COMMERCE AS AN ELIGIBLE SURPLUS LINES INSURER. IN CASE OF ANY DISPUTE RELATIVE TO THE TERMS OR CONDITIONS OF THE POLICY OR THE PRACTICES OF THE INSURER, THE COMMISSIONER OF COMMERCE WILL NOT BE ABLE TO ASSIST IN THE DISPUTE. IN CASE OF INSOLVENCY, PAYMENT OF CLAIMS IS NOT GUARANTEED.\" The notice may not be covered or concealed in any manner; and\n(b) Collect from the insured appropriate premium taxes, as provided under chapter 297I, and report the transaction to the commissioner of revenue on a form prescribed by the commissioner. If the insured fails to pay the taxes when due, the insured shall be subject to a civil fine of not more than $3,000, plus accrued interest from the inception of the insurance.\nExcept as provided in this section, a person who assists or in any manner aids directly or indirectly in the procurement of insurance from an ineligible surplus lines insurer in this state is guilty of a misdemeanor, punishable by imprisonment for not more than 364 days, or by a fine of not more than $1,000, or both.\nEach insured in this state who procures, causes to be procured, or continues or renews insurance with an ineligible surplus lines insurer or any self-insurer in this state who procures or continues excess of loss, catastrophe, or other insurance upon a subject of insurance resident, located, or to be performed within this state, other than insurance procured pursuant to section 60A.201 or subdivision 1 must file with the commissioner of revenue all returns and pay to the commissioner of revenue all amounts required under chapter 297I.\n[Repealed, 2000 c 394 art 2 s 28]\n[Repealed, 2000 c 394 art 2 s 28]\nExcept with respect to placement pursuant to section 60A.198, subdivision 4, if an ineligible insurer offering benefits under a written contract which constitutes the transaction of insurance or which offers benefits substantially similar to benefits under policies of insurance, whether or not the benefits are identified or described as insurance, fails to pay a claim or loss within the provision of the contract, any person who assisted or aided, directly or indirectly, in the procurement of the contract shall be liable to the person to whom the obligations are owed for the full amount of the claim or loss, in the manner provided by the contract.",
	"repealed": false
}