{
	"id": "196.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/196.08",
	"title": "196.08 FILES AND RECORDS CONFIDENTIAL.",
	"text": "(a) The contents of, and all files, records, reports, papers, and documents pertaining to, any claim for the benefits of Laws 1943, chapter 420, whether pending or adjudicated, shall be deemed confidential and privileged and no disclosure thereof shall be made, without the consent in writing of the claimant who has not been adjudicated incompetent, except as follows:\n(1) To said claimant personally, a duly appointed guardian, an attorney in fact, or a duly authorized representative, and as to personal matters, when, in the judgment of the commissioner, such disclosure would not be injurious to the physical or mental health of the claimant.\n(2) To the representatives of veterans' organizations recognized by the United States government, not exceeding five from each such veterans' organizations, and when such representatives have been duly certified as such by the state department of any such veterans' organizations in the state of Minnesota.\n(3) In any court in the state of Minnesota that has jurisdiction of the parties to, and subject matter of, an action or proceeding therein pending, as found by said court, when required to be produced by the process of such court, and then only in open court, as evidence, in such action or proceeding after a judge thereof shall have ruled the same to be relevant and competent evidence in such action or proceeding according to the laws and statutes of said state.\n(b) Notwithstanding section 382.16, and except as authorized in paragraph (c), no government entity may release the contents of, or any files, records, reports, papers, or documents pertaining to, United States government form DD214 or DD215 or any other certificate of discharge from military service to any person unless that person:\n(1) provides proof of identity;\n(2) demonstrates tangible interest; and\n(3) completes the required release form prepared by the government entity.\n(c) This section does not prohibit the release of forms DD214 and DD215 or other certificates of discharge from military service by an employee or official within a government entity to another employee or official within that government entity for purposes of performance of official duties, or to another government veteran service entity for purposes of locating records.\n(d) Forms DD214 and DD215 and certificates of discharge from military service filed with a government agency on or after January 1, 2004, are classified as private data on individuals under section 13.02, subdivision 12.\n(e) Notwithstanding section 386.015, subdivision 5, no fee may be charged by a government entity for the release of information to a qualified person under this section.\n(f) For purposes of paragraph (b), a person who has a tangible interest is:\n(1) the subject of the record, report, paper, or document;\n(2) the surviving spouse of the subject, if the subject is deceased;\n(3) a surviving child of the subject, if the subject is deceased and there is no surviving spouse;\n(4) a surviving parent of the subject, if the subject is deceased and there is no surviving spouse or surviving children; and\n(5) a duly appointed guardian, an attorney in fact, or a duly authorized representative.\n(g) For purposes of this section, the term \"government entity\" has the meaning given in section 13.02, subdivision 7a.",
	"repealed": false
}