{
	"id": "241.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.93",
	"title": "241.93 POWERS OF OMBUDSPERSON; INVESTIGATIONS; ACTION ON COMPLAINTS; RECOMMENDATIONS.",
	"text": "The ombudsperson may:\n(1) prescribe the methods by which complaints are to be made, reviewed, and acted upon; provided, however, that the ombudsperson may not levy a complaint fee;\n(2) determine the scope and manner of investigations to be made;\n(3) except as otherwise provided, determine the form, frequency, and distribution of conclusions, recommendations, and proposals; provided, however, that the governor or a representative may, at any time the governor deems necessary, request and receive information from the ombudsperson. Neither the ombudsperson nor any member of the ombudsperson's staff shall be compelled to testify or to produce evidence in any judicial or administrative proceeding with respect to any matter involving the exercise of the ombudsperson's official duties except as may be necessary to enforce the provisions of sections 241.90 to 241.95;\n(4) investigate, upon a complaint or upon personal initiative, any action of an administrative agency;\n(5) request and be given access to information in the possession of an administrative agency deemed necessary for the discharge of responsibilities;\n(6) examine the records and documents of an administrative agency;\n(7) enter and inspect, at any time, premises within the control of an administrative agency;\n(8) subpoena any person to appear, give testimony, or produce documentary or other evidence that the ombudsperson deems relevant to a matter under inquiry, and may petition the appropriate state court to seek enforcement with the subpoena; provided, however, that any witness at a hearing or before an investigation shall possess the same privileges reserved to a witness in the courts or under the laws of this state;\n(9) bring an action in an appropriate state court to provide the operation of the powers provided in this subdivision. The ombudsperson may use the services of legal assistance to Minnesota prisoners for legal counsel. The provisions of sections 241.90 to 241.95 are in addition to other provisions of law under which any remedy or right of appeal or objection is provided for any person, or any procedure provided for inquiry or investigation concerning any matter. Nothing in sections 241.90 to 241.95 shall be construed to limit or affect any other remedy or right of appeal or objection nor shall it be deemed part of an exclusionary process; and\n(10) be present at commissioner of corrections parole, supervised release, and parole revocation hearings and deliberations.\nNo proceeding or civil action except removal from office or a proceeding brought pursuant to chapter 13 shall be commenced against the ombudsperson for actions taken under the provisions of sections 241.90 to 241.95, unless the act or omission is actuated by malice or is grossly negligent.\n(a) In selecting matters for attention, the ombudsperson should particularly address actions of an administrative agency that may be:\n(1) contrary to law or rule;\n(2) unreasonable, unfair, oppressive, or inconsistent with any policy or judgment of an administrative agency;\n(3) mistaken in law or arbitrary in the ascertainment of facts;\n(4) unclear or inadequately explained when reasons should have been revealed; or\n(5) inefficiently performed.\n(b) The ombudsperson may also be concerned with strengthening procedures and practices that lessen the risk that objectionable actions of the administrative agency will occur.\n(a) The ombudsperson may receive a complaint from any source concerning an action of an administrative agency. The ombudsperson may, on personal motion or at the request of another, investigate any action of an administrative agency.\n(b) The ombudsperson may exercise powers without regard to the finality of any action of an administrative agency; however, the ombudsperson may require a complainant to pursue other remedies or channels of complaint open to the complainant before accepting or investigating the complaint.\n(c) After completing investigation of a complaint, the ombudsperson shall inform the complainant, the administrative agency, and the official or employee of the action taken.\n(d) A letter to the ombudsperson from a person in an institution under the control of an administrative agency shall be forwarded immediately and unopened to the ombudsperson's office. A reply from the ombudsperson to the person shall be promptly delivered unopened to the person after its receipt by the institution.\n(e) No complainant shall be punished nor shall the general condition of the complainant's confinement or treatment be unfavorably altered as a result of the complainant having made a complaint to the ombudsperson.\nEither the ombudsperson or the jail inspection unit of the Department of Corrections may investigate complaints involving local adult jails and detention facilities. The ombudsperson and Department of Corrections must enter into an arrangement with one another that ensures they are not duplicating services.\n(a) If, after duly considering a complaint and whatever material the ombudsperson deems pertinent, the ombudsperson is of the opinion that the complaint is valid, the ombudsperson may recommend that an administrative agency should:\n(1) consider the matter further;\n(2) modify or cancel its actions;\n(3) alter a ruling;\n(4) explain more fully the action in question; or\n(5) take any other step that the ombudsperson recommends to the administrative agency involved.\nIf the ombudsperson so requests, the agency shall, within the time the ombudsperson specifies, inform the ombudsperson about the action taken on the ombudsperson's recommendations or the reasons for not complying with it.\n(b) If the ombudsperson has reason to believe that any public official or employee has acted in a manner warranting criminal or disciplinary proceedings, the ombudsperson may refer the matter to the appropriate authorities.\n(c) If the ombudsperson believes that an action upon which a valid complaint is founded has been dictated by a statute, and that the statute produces results or effects that are unfair or otherwise objectionable, the ombudsperson shall bring to the attention of the governor and the legislature the ombudsperson's view concerning desirable statutory change.\nThe ombudsperson may apply for and receive grants from public and private entities for purposes of carrying out the ombudsperson's powers and duties under sections 241.90 to 241.95.",
	"repealed": false
}