{
	"id": "256.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.98",
	"title": "256.98 WRONGFULLY OBTAINING ASSISTANCE; THEFT.",
	"text": "(a) A person who commits any of the following acts or omissions with intent to defeat the purposes of sections 145.891 to 145.897, the MFIP program formerly codified in sections 256.031 to 256.0361, the AFDC program formerly codified in sections 256.72 to 256.871, chapter 142G, 256B, 256D, 256I, 256K, or 256L, child care assistance programs, and emergency assistance programs under section 256D.06, is guilty of theft and shall be sentenced under section 609.52, subdivision 3, clauses (1) to (5):\n(1) obtains or attempts to obtain, or aids or abets any person to obtain by means of a willfully false statement or representation, by intentional concealment of any material fact, or by impersonation or other fraudulent device, assistance or the continued receipt of assistance, to include child care assistance or food benefits produced according to sections 145.891 to 145.897 and MinnesotaCare services according to sections 256.9365, 256.94, and 256L.01 to 256L.15, to which the person is not entitled or assistance greater than that to which the person is entitled;\n(2) knowingly aids or abets in buying or in any way disposing of the property of a recipient or applicant of assistance without the consent of the county agency; or\n(3) obtains or attempts to obtain, alone or in collusion with others, the receipt of payments to which the individual is not entitled as a provider of subsidized child care, or by furnishing or concurring in a willfully false claim for child care assistance.\n(b) The continued receipt of assistance to which the person is not entitled or greater than that to which the person is entitled as a result of any of the acts, failure to act, or concealment described in this subdivision shall be deemed to be continuing offenses from the date that the first act or failure to act occurred.\nWhen two or more defendants are jointly charged with the same offense under subdivision 1, or are jointly charged with different offenses under subdivision 1 arising from the same course of conduct, they shall be tried jointly; however, if it appears to the court that a defendant or the state is substantially prejudiced by the joinder for trial, the court may order an election or separate trial of counts, grant a severance of defendants, or provide other relief.\nThe amount of the assistance incorrectly paid under this section is:\n(1) the difference between the amount of assistance actually received on the basis of misrepresented or concealed facts and the amount to which the recipient would have been entitled had the specific concealment or misrepresentation not occurred. Unless required by law, rule, or regulation, earned income disregards shall not be applied to earnings not reported by the recipient; or\n(2) equal to all payments for health care services, including capitation payments made to a health plan, made on behalf of a person enrolled in MinnesotaCare, medical assistance, or general assistance medical care formerly codified in chapter 256D, for which the person was not entitled due to the concealment or misrepresentation of facts.\nThe amount of assistance determined to have been incorrectly paid is recoverable from:\n(1) the recipient or the recipient's estate by the county or the state as a debt due the county or the state or both; and\n(2) any person found to have taken independent action to establish eligibility for, conspired with, or aided and abetted, any recipient of public assistance found to have been incorrectly paid.\nThe obligations established under this subdivision shall be joint and several and shall extend to all cases involving client error as well as cases involving wrongfully obtained assistance.\nMinnesotaCare participants who have been found to have wrongfully obtained assistance as described in subdivision 1, but who otherwise remain eligible for the program, may agree to have their MinnesotaCare premiums increased by an amount equal to ten percent of their premiums or $10 per month, whichever is greater, until the debt is satisfied.\nTo prosecute or to recover assistance wrongfully obtained under this section, the attorney general or the appropriate county attorney, acting independently or at the direction of the attorney general, may institute a criminal or civil action or both.\nRule 17.03, subdivision 2, of the Minnesota Rules of Criminal Procedure that relates to joint trials is superseded by this section to the extent that it conflicts with this section.\nExcept for recoveries under chapter 142E, if the state is responsible for the recovery, the amounts recovered shall be paid to the appropriate units of government. If the recovery is directly attributable to a county, the county may retain one-half of the nonfederal share of any recovery from a recipient or the recipient's estate.\nThis subdivision does not apply to recoveries from medical providers or to recoveries involving the department of human services, surveillance and utilization review division, state hospital collections unit, and the benefit recoveries division.\n(a) Any person found to be guilty of wrongfully obtaining assistance by a federal or state court or by an administrative hearing determination, or waiver thereof, through a disqualification consent agreement, or as part of any approved diversion plan under section 401.065, or any court-ordered stay which carries with it any probationary or other conditions, in the Minnesota family investment program and any affiliated program to include the work participation cash benefit program, the Supplemental Nutrition Assistance Program (SNAP), the general assistance program, housing support under chapter 256I, or the Minnesota supplemental aid program shall be disqualified from that program. In addition, any person disqualified from the Minnesota family investment program shall also be disqualified from SNAP. The needs of that individual shall not be taken into consideration in determining the grant level for that assistance unit:\n(1) for one year after the first offense;\n(2) for two years after the second offense; and\n(3) permanently after the third or subsequent offense.\nThe period of program disqualification shall begin on the date stipulated on the advance notice of disqualification without possibility of postponement for administrative stay or administrative hearing and shall continue through completion unless and until the findings upon which the sanctions were imposed are reversed by a court of competent jurisdiction. The period for which sanctions are imposed is not subject to review. The sanctions provided under this subdivision are in addition to, and not in substitution for, any other sanctions that may be provided for by law for the offense involved. A disqualification established through hearing or waiver shall result in the disqualification period beginning immediately unless the person has become otherwise ineligible for assistance. If the person is ineligible for assistance, the disqualification period begins when the person again meets the eligibility criteria of the program from which they were disqualified and makes application for that program.\n(b) A family receiving assistance through child care assistance programs under chapter 142E with a family member who is found to be guilty of wrongfully obtaining child care assistance by a federal court, state court, or an administrative hearing determination or waiver, through a disqualification consent agreement, as part of an approved diversion plan under section 401.065, or a court-ordered stay with probationary or other conditions, is disqualified from child care assistance programs. The disqualifications must be for periods of one year and two years for the first and second offenses, respectively. Subsequent violations must result in permanent disqualification. During the disqualification period, disqualification from any child care program must extend to all child care programs and must be immediately applied.\n(c) A provider caring for children receiving assistance through child care assistance programs under chapter 142E is disqualified from receiving payment for child care services from the child care assistance program under chapter 142E when the provider is found to have wrongfully obtained child care assistance by a federal court, state court, or an administrative hearing determination or waiver under section 142A.27; 142E.51, subdivision 5; or 256.046, through a disqualification consent agreement, as part of an approved diversion plan under section 401.065, or a court-ordered stay with probationary or other conditions. The disqualification must be for a period of three years for the first offense. Any subsequent violation must result in permanent disqualification. The disqualification period must be imposed immediately after a determination is made under this paragraph. During the disqualification period, the provider is disqualified from receiving payment from any child care program under chapter 142E.\n(d) Any person found to be guilty of wrongfully obtaining MinnesotaCare for adults without children and upon federal approval, all categories of medical assistance and remaining categories of MinnesotaCare, except for children through age 18, by a federal or state court or by an administrative hearing determination, or waiver thereof, through a disqualification consent agreement, or as part of any approved diversion plan under section 401.065, or any court-ordered stay which carries with it any probationary or other conditions, is disqualified from that program. The period of disqualification is one year after the first offense, two years after the second offense, and permanently after the third or subsequent offense. The period of program disqualification shall begin on the date stipulated on the advance notice of disqualification without possibility of postponement for administrative stay or administrative hearing and shall continue through completion unless and until the findings upon which the sanctions were imposed are reversed by a court of competent jurisdiction. The period for which sanctions are imposed is not subject to review. The sanctions provided under this subdivision are in addition to, and not in substitution for, any other sanctions that may be provided for by law for the offense involved.\n[See Note.]\nAll references to MFIP or Minnesota family investment program contained in sections 256.017, 256.019, 256.045, 256.046, and 256.98 to 256.9866 shall be construed to include all variations of the Minnesota family investment program including, but not limited to, chapter 142G, MFIP, MFIP-R, and chapter 256K.",
	"repealed": false
}