{
	"id": "342.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.01",
	"title": "342.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given them.\n\"Adult-use cannabis concentrate\" means cannabis concentrate that is approved for sale by the office or is substantially similar to a product approved by the office. Adult-use cannabis concentrate does not include any artificially derived cannabinoid.\n\"Adult-use cannabis flower\" means cannabis flower that is approved for sale by the office or is substantially similar to a product approved by the office. Adult-use cannabis flower does not include medical cannabis flower, hemp plant parts, or hemp-derived consumer products.\n\"Adult-use cannabis product\" means a cannabis product that is approved for sale by the office or is substantially similar to a product approved by the office. Adult-use cannabis product includes edible cannabis products but does not include medical cannabinoid products or lower-potency hemp edibles.\n\"Advertisement\" means any written or oral statement, illustration, or depiction that is intended to promote sales of cannabis flower, cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or sales at a specific cannabis business or hemp business and includes any newspaper, radio, Internet and electronic media, or television promotion; the distribution of fliers and circulars; and the display of window and interior signs in a cannabis business. Advertisement does not include a fixed outdoor sign that meets the requirements in section 342.64, subdivision 2, paragraph (b).\n\"Artificially derived cannabinoid\" means a cannabinoid extracted from a cannabis plant, cannabis flower, hemp plant, or hemp plant parts with a chemical makeup that is changed after extraction to create a different cannabinoid or other chemical compound by applying a catalyst other than heat or light. Artificially derived cannabinoid includes but is not limited to any tetrahydrocannabinol created from cannabidiol but does not include cannabis concentrate, cannabis products, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products.\n\"Batch\" means:\n(1) a specific quantity of cannabis plants that are cultivated from the same seed or plant stock, are cultivated together, are intended to be harvested together, and receive an identical propagation and cultivation treatment;\n(2) a specific quantity of cannabis flower that is harvested together; is uniform and intended to meet specifications for identity, strength, purity, and composition; and receives identical sorting, drying, curing, and storage treatment; or\n(3) a specific quantity of a specific cannabis product, lower-potency hemp edible, artificially derived cannabinoid, hemp-derived consumer product, or hemp-derived topical product that is manufactured at the same time and using the same methods, equipment, and ingredients that is uniform and intended to meet specifications for identity, strength, purity, and composition, and that is manufactured, packaged, and labeled according to a single batch production record executed and documented.\n\"Batch number\" means a unique numeric or alphanumeric identifier assigned to a batch of cannabis plants, cannabis flower, cannabis products, lower-potency hemp edibles, artificially derived cannabinoid, hemp-derived consumer products, or hemp-derived topical products.\n\"Bona fide labor organization\" means a labor union that represents or is actively seeking to represent cannabis workers.\n\"Cannabinoid\" means any of the chemical constituents of hemp plants or cannabis plants that are naturally occurring, biologically active, and act on the cannabinoid receptors of the brain. Cannabinoid includes but is not limited to tetrahydrocannabinol and cannabidiol.\n\"Cannabinoid extraction\" means the process of extracting cannabis concentrate from cannabis plants or cannabis flower using heat, pressure, water, lipids, gases, solvents, or other chemicals or chemical processes, but does not include the process of extracting concentrate from hemp plants or hemp plant parts or the process of creating any artificially derived cannabinoid.\n\"Cannabinoid product\" means a cannabis product, a hemp-derived consumer product, or a lower-potency hemp edible.\n\"Cannabinoid profile\" means the amounts of each cannabinoid that the office requires to be identified in testing and labeling, including but not limited to delta-9 tetrahydrocannabinol, tetrahydrocannabinolic acid, cannabidiol, and cannabidiolic acid in cannabis flower, a cannabis product, a batch of artificially derived cannabinoid, a lower-potency hemp edible, a hemp-derived consumer product, or a hemp-derived topical product expressed as percentages measured by weight and, in the case of cannabis products, lower-potency hemp edibles, and hemp-derived consumer products, expressed as milligrams in each serving and package.\n\"Cannabis business\" means any of the following licensed under this chapter:\n(1) cannabis microbusiness;\n(2) cannabis mezzobusiness;\n(3) cannabis cultivator;\n(4) cannabis manufacturer;\n(5) cannabis retailer;\n(6) cannabis wholesaler;\n(7) cannabis transporter;\n(8) cannabis testing facility;\n(9) cannabis event organizer;\n(10) cannabis delivery service; and\n(11) medical cannabis combination business.\n(a) \"Cannabis concentrate\" means:\n(1) the extracts and resins of a cannabis plant or cannabis flower;\n(2) the extracts or resins of a cannabis plant or cannabis flower that are refined to increase the presence of targeted cannabinoids; or\n(3) a product that is produced by refining extracts or resins of a cannabis plant or cannabis flower and is intended to be consumed by combustion or vaporization of the product and inhalation of smoke, aerosol, or vapor from the product.\n(b) Cannabis concentrate does not include hemp concentrate, artificially derived cannabinoid, or hemp-derived consumer products.\n\"Cannabis flower\" means the harvested flower, bud, leaves, and stems of a cannabis plant. Cannabis flower includes adult-use cannabis flower and medical cannabis flower. Cannabis flower does not include cannabis seed, hemp plant parts, or hemp-derived consumer products.\n\"Cannabis industry\" means every item, product, person, process, action, business, or other thing related to cannabis plants, cannabis flower, and cannabis products.\n\"Cannabis paraphernalia\" means all equipment, products, and materials of any kind that are knowingly or intentionally used primarily in:\n(1) manufacturing cannabis products;\n(2) ingesting, inhaling, or otherwise introducing cannabis flower or cannabis products into the human body; and\n(3) testing the strength, effectiveness, or purity of cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products.\n\"Cannabis plant\" means all parts of the plant of the genus Cannabis that is growing or has not been harvested, including but not limited to a mother plant; a mature, flowering plant; an immature plant; or a seedling. Cannabis plant does not include a hemp plant.\n(a) \"Cannabis product\" means any of the following:\n(1) cannabis concentrate;\n(2) a product infused with cannabinoids, including but not limited to tetrahydrocannabinol, extracted or derived from cannabis plants or cannabis flower; or\n(3) any other product that contains cannabis concentrate.\n(b) Cannabis product includes adult-use cannabis products, including but not limited to edible cannabis products and medical cannabinoid products. Cannabis product does not include cannabis flower, artificially derived cannabinoid, lower-potency hemp edibles, hemp-derived consumer products, or hemp-derived topical products.\n\"Cannabis prohibition\" means the system of state and federal laws that prevented establishment of a legal market and instead established petty offenses and criminal offenses punishable by fines, imprisonment, or both for the cultivation, possession, and sale of all parts of the plant of any species of the genus Cannabis, including all agronomical varieties, whether growing or not; the seeds thereof; the resin extracted from any part of such plant; and every compound, manufacture, salt, derivative, mixture, or preparation of such plant, its seeds, or resin.\n\"Cannabis seed\" means the viable seed of the plant of the genus Cannabis that is reasonably expected to grow into a cannabis plant. Cannabis seed does not include hemp seed.\n\"Cannabis worker\" means any individual employed by a cannabis business and any individual who is a contractor of a cannabis business whose scope of work involves the handling of cannabis plants, cannabis flower, or cannabis products.\n\"Child-resistant\" means packaging that meets the poison prevention packaging standards in Code of Federal Regulations, title 16, section 1700.15.\n\"Cooperative\" means an association conducting business on a cooperative plan that is organized or is subject to chapter 308A or 308B.\n\"Council\" means the Cannabis Advisory Council.\n\"Cultivation\" means any activity involving the planting, growing, harvesting, drying, curing, grading, or trimming of cannabis plants, cannabis flower, hemp plants, or hemp plant parts.\nMS 2023 Supp [Repealed, 2024 c 121 art 2 s 154]\n\"Division of Social Equity\" means a division housed in the Office of Cannabis Management that promotes development, stability, and safety in communities that have experienced a disproportionate, negative impact from cannabis prohibition and usage.\n\"Drug\" has the meaning given in section 151.01, subdivision 5.\n\"Edible cannabis product\" means any product that is intended to be eaten or consumed as a beverage by humans; contains a cannabinoid other than an artificially derived cannabinoid in combination with food ingredients; is not a drug; and is a type of product approved for sale by the office, or is substantially similar to a product approved by the office including but not limited to products that resemble nonalcoholic beverages, candy, and baked goods. Edible cannabis product does not include lower-potency hemp edibles.\n\"Endorsement\" means an authorization from the office to conduct a specified operation activity.\n\"Health care practitioner\" means a Minnesota-licensed doctor of medicine, a Minnesota-licensed physician assistant acting within the scope of authorized practice, or a Minnesota-licensed advanced practice registered nurse who has an active license in good standing and the primary responsibility for the care and treatment of the qualifying medical condition of an individual diagnosed with a qualifying medical condition.\n\"Health record\" has the meaning given in section 144.291, subdivision 2.\n(a) \"Hemp business\" means either of the following licensed under this chapter:\n(1) lower-potency hemp edible manufacturer; or\n(2) lower-potency hemp edible retailer.\n(b) Hemp business does not include a person or entity licensed under chapter 18K to grow industrial hemp for commercial or research purposes or to process industrial hemp for commercial purposes.\n(a) \"Hemp concentrate\" means:\n(1) the extracts and resins of a hemp plant or hemp plant parts;\n(2) the extracts or resins of a hemp plant or hemp plant parts that are refined to increase the presence of targeted cannabinoids; or\n(3) a product that is produced by refining extracts or resins of a hemp plant or hemp plant parts and is intended to be consumed by combustion or vaporization of the product and inhalation of smoke, aerosol, or vapor from the product.\n(b) Hemp concentrate does not include artificially derived cannabinoids, lower-potency hemp edibles, hemp-derived consumer products, or hemp-derived topical products.\n\"Hemp consumer industry\" means every item, product, person, process, action, business, or other thing related to artificially derived cannabinoids, lower-potency hemp edibles, and hemp-derived consumer products and subject to regulation under this chapter.\n(a) \"Hemp-derived consumer product\" means a product intended for human or animal consumption, does not contain cannabis flower or cannabis concentrate, and:\n(1) contains or consists of hemp plant parts; or\n(2) contains hemp concentrate or artificially derived cannabinoids in combination with other ingredients.\n(b) Hemp-derived consumer product does not include artificially derived cannabinoids, lower-potency hemp edibles, hemp-derived topical products, hemp fiber products, or hemp grain.\n\"Hemp-derived topical product\" means a product intended for human or animal consumption that contains hemp concentrate, is intended for application externally to a part of the body of a human or animal, and does not contain cannabis flower or cannabis concentrate.\n\"Hemp fiber product\" means an intermediate or finished product made from the fiber of hemp plant parts that is not intended for human or animal consumption. Hemp fiber product includes but is not limited to cordage, paper, fuel, textiles, bedding, insulation, construction materials, compost materials, and industrial materials.\n\"Hemp grain\" means the harvested seeds of the hemp plant intended for consumption as a food or part of a food product. Hemp grain includes oils pressed or extracted from harvested hemp seeds.\n\"Hemp plant\" means all parts of the plant of the genus Cannabis that is growing or has not been harvested and has a delta-9 tetrahydrocannabinol concentration of no more than 0.3 percent on a dry weight basis.\n\"Hemp plant parts\" means any part of the harvested hemp plant, including the flower, bud, leaves, stems, and stalk, but does not include derivatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers that are separated from the plant. Hemp plant parts does not include hemp fiber products, hemp grain, or hemp seed.\n\"Hemp seed\" means the viable seed of the plant of the genus Cannabis that is intended to be planted and is reasonably expected to grow into a hemp plant. Hemp seed does not include cannabis seed or hemp grain.\n\"Hemp worker\" means any individual employed by a hemp business and any individual who is a contractor of a hemp business whose scope of work involves the handling of artificially derived cannabinoids, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products.\n\"Industrial hemp\" has the meaning given in section 18K.02, subdivision 3.\n\"Intoxicating cannabinoid\" means a cannabinoid, including an artificially derived cannabinoid, that when introduced into the human body impairs the central nervous system or impairs the human audio, visual, or mental processes. Intoxicating cannabinoid includes but is not limited to any tetrahydrocannabinol.\n\"Labor peace agreement\" means an agreement between a cannabis business and a bona fide labor organization that protects the state's interests by, at minimum, prohibiting the labor organization from engaging in picketing, work stoppages, or boycotts against the cannabis business.\n\"License holder\" means a person, cooperative, or business that holds any of the following licenses:\n(1) cannabis microbusiness;\n(2) cannabis mezzobusiness;\n(3) cannabis cultivator;\n(4) cannabis manufacturer;\n(5) cannabis retailer;\n(6) cannabis wholesaler;\n(7) cannabis transporter;\n(8) cannabis testing facility;\n(9) cannabis event organizer;\n(10) cannabis delivery service;\n(11) lower-potency hemp edible manufacturer;\n(12) lower-potency hemp edible retailer; or\n(13) medical cannabis combination business.\n\"Local unit of government\" means a home rule charter or statutory city, county, town, or other political subdivision.\n(a) \"Lower-potency hemp edible\" means any product that:\n(1) is intended to be eaten or consumed as a beverage by humans;\n(2) contains hemp concentrate or an artificially derived cannabinoid, in combination with food ingredients;\n(3) is not a drug;\n(4) does not contain a cannabinoid derived from cannabis plants or cannabis flower;\n(5) is a type of product approved for sale by the office or is substantially similar to a product approved by the office, including but not limited to products that resemble nonalcoholic beverages, candy, and baked goods; and\n(6) meets either of the requirements in paragraph (b).\n(b) A lower-potency hemp edible includes:\n(1) a product that:\n(i) consists of servings that contain no more than five milligrams of delta-9 tetrahydrocannabinol; no more than 25 milligrams of cannabidiol, cannabigerol, cannabinol, or cannabichromene; any other cannabinoid authorized by the office; or any combination of those cannabinoids that does not exceed the identified amounts;\n(ii) does not contain more than a combined total of 0.5 milligrams of all other cannabinoids per serving; and\n(iii) does not contain an artificially derived cannabinoid other than delta-9 tetrahydrocannabinol, except that a product may include artificially derived cannabinoids created during the process of creating the delta-9 tetrahydrocannabinol that is added to the product, if no artificially derived cannabinoid is added to the ingredient containing delta-9 tetrahydrocannabinol and the ratio of delta-9 tetrahydrocannabinol to all other artificially derived cannabinoids is no less than 20 to one; or\n(2) a product that:\n(i) contains hemp concentrate processed or refined without increasing the percentage of targeted cannabinoids or altering the ratio of cannabinoids in the extracts or resins of a hemp plant or hemp plant parts beyond the variability generally recognized for the method used for processing or refining or by an amount needed to reduce the total THC in the hemp concentrate; and\n(ii) consists of servings that contain no more than five milligrams of total THC.\n\"Matrix barcode\" means a code that stores data in a two-dimensional array of geometrically shaped dark and light cells capable of being read by the camera on a smartphone or other mobile device.\n(a) \"Medical cannabinoid product\" means a product that:\n(1) consists of or contains cannabis concentrate or hemp concentrate or is infused with cannabinoids, including but not limited to artificially derived cannabinoids; and\n(2) is provided to a patient enrolled in the registry program; a registered designated caregiver; or a parent, legal guardian, or spouse of an enrolled patient, by a registered designated caregiver, cannabis retailer, or cannabis business with a medical cannabis retail endorsement to treat or alleviate the symptoms of a qualifying medical condition.\n(b) A medical cannabinoid product must be in the form of:\n(1) liquid, including but not limited to oil;\n(2) pill;\n(3) liquid or oil for use with a vaporized delivery method;\n(4) water-soluble cannabinoid multiparticulate, including granules, powder, and sprinkles;\n(5) orally dissolvable product, including lozenges, gum, mints, buccal tablets, and sublingual tablets;\n(6) edible products in the form of gummies and chews;\n(7) topical formulation; or\n(8) any allowable form or delivery method approved by the office.\n(c) Medical cannabinoid product does not include adult-use cannabis products or hemp-derived consumer products.\nMS 2023 Supp [Repealed, 2024 c 121 art 2 s 154]\n\"Medical cannabis flower\" means cannabis flower provided to a patient enrolled in the registry program or a visiting patient; a registered designated caregiver; or a parent, legal guardian, or spouse of an enrolled patient by a registered designated caregiver, cannabis retailer, or cannabis business with a medical cannabis retail endorsement to treat or alleviate the symptoms of a qualifying medical condition. Medical cannabis flower does not include adult-use cannabis flower.\nMS 2023 Supp [Repealed, 2024 c 121 art 2 s 154]\n\"Nonintoxicating cannabinoid\" means a cannabinoid that when introduced into the human body does not impair the central nervous system and does not impair the human audio, visual, or mental processes. Nonintoxicating cannabinoid includes but is not limited to cannabidiol and cannabigerol but does not include any artificially derived cannabinoid.\n\"Office\" means the director of the Office of Cannabis Management.\n\"Outdoor advertisement\" means an advertisement that is located outdoors or can be seen or heard by an individual who is outdoors and includes billboards; advertisements on benches; advertisements at transit stations or transit shelters; advertisements on the exterior or interior of buses, taxis, light rail transit, or business vehicles; and print signs that do not meet the requirements in section 342.64, subdivision 2, paragraph (b), but that are placed or located on the exterior property of a cannabis business.\n\"Patient\" means a Minnesota resident who has been diagnosed with a qualifying medical condition by a health care practitioner and who has met all other requirements for patients under this chapter to participate in the registry program.\n\"Patient registry number\" means a unique identification number assigned by the Division of Medical Cannabis to a patient enrolled in the registry program.\n\"Plant canopy\" means the surface area within a cultivation facility that is used at any time to cultivate mature, flowering cannabis plants. For multiple tier cultivation, each tier of cultivation surface area contributes to the total plant canopy calculation. Calculation of the area of the plant canopy does not include the surface area within the cultivation facility that is used to cultivate immature cannabis plants and seedlings.\n\"Propagule\" means seeds, clones, transplants, and any other propagative industrial hemp material.\n\"Qualifying medical condition\" means either a medical condition for which an individual's health care practitioner has recommended, approved, or authorized the use of cannabis by that individual to treat the condition, or a diagnosis of any of the following conditions:\n(1) Alzheimer's disease;\n(2) autism spectrum disorder that meets the requirements of the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association;\n(3) cancer, if the underlying condition or treatment produces one or more of the following:\n(i) severe or chronic pain;\n(ii) nausea or severe vomiting; or\n(iii) cachexia or severe wasting;\n(4) chronic motor or vocal tic disorder;\n(5) chronic pain;\n(6) glaucoma;\n(7) human immunodeficiency virus or acquired immune deficiency syndrome;\n(8) intractable pain as defined in section 152.125, subdivision 1, paragraph (c);\n(9) obstructive sleep apnea;\n(10) post-traumatic stress disorder;\n(11) Tourette's syndrome;\n(12) amyotrophic lateral sclerosis;\n(13) seizures, including those characteristic of epilepsy;\n(14) severe and persistent muscle spasms, including those characteristic of multiple sclerosis;\n(15) inflammatory bowel disease, including Crohn's disease;\n(16) irritable bowel syndrome;\n(17) obsessive-compulsive disorder;\n(18) sickle cell disease; or\n(19) terminal illness, with a probable life expectancy of under one year, if the illness or its treatment produces one or more of the following:\n(i) severe or chronic pain;\n(ii) nausea or severe vomiting; or\n(iii) cachexia or severe wasting.\n\"Registered designated caregiver\" means an individual who:\n(1) is at least 18 years old;\n(2) has been approved by the office to assist a patient with obtaining medical cannabis flower and medical cannabinoid products from a cannabis business with a medical cannabis retail endorsement and with administering medical cannabis flower and medical cannabinoid products; and\n(3) is authorized by the office to assist a patient with the use of medical cannabis flower and medical cannabinoid products.\n\"Registry\" or \"registry program\" means the patient registry established under this chapter listing patients; registered designated caregivers; and any parent, legal guardian, or spouse of a patient who is authorized to perform the following acts either as a patient or to assist a patient:\n(1) obtain medical cannabis flower, medical cannabinoid products, and medical cannabis paraphernalia from a cannabis business with a medical cannabis retail endorsement; and\n(2) administer medical cannabis flower and medical cannabinoid products.\n\"Registry verification\" means the verification provided by the office that a patient is enrolled in the registry program and that includes the patient's name, patient registry number, and, if applicable, the name of the patient's registered designated caregiver or parent, legal guardian, or spouse.\n\"Restricted area\" means an area where cannabis flower or cannabis products are cultivated, manufactured, or stored by a cannabis business.\n\"Statewide monitoring system\" means the system for integrated cannabis tracking, inventory, and verification established or adopted by the office.\n\"Synthetic cannabinoid\" means a substance with a similar chemical structure and pharmacological activity to a cannabinoid but is not extracted or derived from cannabis plants, cannabis flower, hemp plants, or hemp plant parts and is instead created or produced by chemical or biochemical synthesis.\n\"Total THC\" means the sum of the percentage by weight of tetrahydrocannabinolic acid multiplied by 0.877 plus the percentage by weight of all tetrahydrocannabinols.\n\"Veteran\" means an individual who satisfies the requirements in section 197.447.\n\"Visiting patient\" means an individual who is not a Minnesota resident and who possesses a valid registration verification card or its equivalent that is issued under the laws or regulations of another state, district, commonwealth, or territory of the United States verifying that the individual is enrolled in or authorized to participate in that jurisdiction's medical cannabis or medical marijuana program.\n\"Volatile solvent\" means any solvent that is or produces a flammable gas or vapor that, when present in the air in sufficient quantities, will create explosive or ignitable mixtures. Volatile solvent includes but is not limited to butane, hexane, and propane.",
	"repealed": false
}