{
	"id": "171.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.20",
	"title": "171.20 MINNESOTA LICENSE REQUIRED; CONDITIONS, FEES.",
	"text": "[Repealed, 1993 c 266 s 34]\n(a) A resident or nonresident whose driver's license or right or privilege to operate a motor vehicle in this state has been suspended, revoked, or canceled, shall not operate a motor vehicle in this state under license, permit, or registration certificate issued by any other jurisdiction or otherwise during the suspension, or after the revocation until Minnesota driving privileges are reinstated.\n(b) A resident or nonresident who has been disqualified from holding a commercial driver's license or been denied the privilege to operate a commercial motor vehicle in this state shall not operate a commercial motor vehicle in this state under license, permit, or registration certificate issued by any other jurisdiction or otherwise during the disqualification period until Minnesota commercial driving privileges are reinstated.\nThe commissioner may require, before reissuing a license which has been revoked or suspended, that the licensee complete a course of study at an approved driver improvement clinic or, in the case of a licensee who is age 18 or younger, a youth-oriented driver improvement clinic. The commissioner may not require the licensee to complete such a course unless an approved driver improvement clinic or youth-oriented driver improvement clinic is located within 35 miles of the licensee's residence. For purposes of this section \"an approved driver improvement clinic\" means a clinic whose curriculum and mode of instruction conform to standards promulgated by the commissioner.\n(a) Before the license is reinstated, a single $20 reinstatement fee is imposed for:\n(1) an individual whose driver's license has been suspended under section 171.16, subdivision 2; 171.175; 171.18; or 171.182, or who has been disqualified from holding a commercial driver's license under section 171.165;\n(2) an individual whose driver's license has been suspended under section 171.186 and who is not exempt from such a fee; and\n(3) an individual whose license has been suspended under sections 169.791 to 169.798.\n(b) An individual whose driver's license is subject to more than one suspension and who is otherwise eligible for reinstatement must pay a single reinstatement fee and a single filing fee. An individual whose driver's license has been suspended and revoked and who is otherwise eligible for reinstatement must pay a reinstatement fee as provided in section 171.29.\n(c) When fees are collected by a driver's license agent appointed under section 171.061, a filing fee is imposed in the amount specified under section 171.061, subdivision 4. The reinstatement fee and filing fee must be deposited in an approved state depository as directed under section 171.061, subdivision 4.\n(d) Reinstatement fees collected under paragraph (a) for suspensions under section 171.18, subdivision 1, paragraph (a), clause (10), must be deposited in the general fund.\n(e) A suspension may be rescinded without fee for good cause.",
	"repealed": false
}