{
	"id": "142G.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.50",
	"title": "142G.50 EMPLOYMENT AND TRAINING SERVICES; DEFINITIONS.",
	"text": "The terms used in sections 142G.25, 142G.27, 142G.37, 142G.42, 142G.50 to 142G.65, 142G.70, 142G.71, and 142G.75 to 142G.77 have the meanings given them in this section.\n\"Employment and training services\" means programs, activities and services that are designed to assist participants in obtaining and retaining employment.\n\"Employment and training service provider\" means:\n(1) a public, private, or nonprofit agency with which a county has contracted to provide employment and training services and which is included in the county's service agreement submitted under section 142G.76, subdivision 4;\n(2) a county agency, if the county has opted to provide employment and training services and the county has indicated that fact in the service agreement submitted under section 142G.76, subdivision 4; or\n(3) a local public health department under section 145A.17, subdivision 4a, that a county has designated to provide employment and training services and is included in the county's service agreement submitted under section 142G.76, subdivision 4.\nAn employment and training services provider meeting this definition may deliver employment and training services under this chapter.\n\"Employment plan\" means a plan developed by the job counselor and the participant which identifies the participant's most direct path to unsubsidized employment, lists the specific steps that the caregiver will take on that path, and includes a timetable for the completion of each step. The plan should also identify any subsequent steps that support long-term economic stability. For participants who request and qualify for a family violence waiver, an employment plan must be developed by the job counselor and the participant, and in consultation with a person trained in domestic violence and follow the employment plan provisions in section 142G.56, subdivision 3.\n\"Functional work literacy\" means an intensive English as a second language program that is work focused and offers at least 20 hours of class time per week.\n\"Job counselor\" means a staff person employed by or under contract with the employment and training services provider who delivers services as specified in sections 142G.51, 142G.53 to 142G.59, and 142G.65.\n\"Participant\" means a recipient of MFIP assistance who participates or is required to participate in employment and training services under sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71.\n[See Note.]\n\"Provider\" means an employment and training service provider.\n\"Suitable employment\" means employment that:\n(1) is within the participant's physical and mental abilities;\n(2) pays hourly gross wages of not less than the applicable state or federal minimum wage;\n(3) meets health and safety standards set by federal, state and county agencies; and\n(4) complies with federal, state, and local antidiscrimination laws.\n\"Supported work\" means a subsidized or unsubsidized work experience placement with a public or private sector employer, which may include services such as individualized supervision and job coaching to support the participant on the job.\n(a) \"Work activity\" means any activity in a participant's approved employment plan that leads to employment. For purposes of the MFIP program, this includes activities that meet the definition of work activity under the participation requirements of TANF. Work activity includes:\n(1) unsubsidized employment, including work study and paid apprenticeships or internships;\n(2) subsidized private sector or public sector employment, including grant diversion as specified in section 142G.64, on-the-job training as specified in section 142G.60, paid work experience, and supported work when a wage subsidy is provided;\n(3) uncompensated work experience, including community service, the community work experience program as specified in section 142G.61, unpaid apprenticeships or internships, and supported work when a wage subsidy is not provided. Uncompensated work experience is only an option if the participant has been unable to obtain or maintain paid employment in the competitive labor market, and no paid work experience programs are available to the participant. Prior to placing a participant in uncompensated work, the county must inform the participant that the participant will be notified if a paid work experience or supported work position becomes available. Unless a participant consents in writing to participate in uncompensated work experience, the participant's employment plan may only include uncompensated work experience if the following criteria are met:\n(i) the uncompensated work experience will provide the participant specific skills or experience that cannot be obtained through other work activity options where the participant resides or is willing to reside; and\n(ii) the skills or experience gained through the uncompensated work experience will result in higher wages for the participant than the participant could earn without the uncompensated work experience;\n(4) job search including job readiness assistance, job clubs, job placement, job-related counseling, and job retention services;\n(5) job readiness education, including English as a second language (ESL) or functional work literacy classes, commissioner of education-selected high school equivalency or adult high school diploma course work, high school completion, and adult basic education;\n(6) job skills training directly related to employment, including postsecondary education and training that can reasonably be expected to lead to employment;\n(7) providing child care services to a participant who is working in a community service program;\n(8) activities included in the employment plan that is developed under section 142G.56, subdivision 3; and\n(9) preemployment activities including chemical and mental health assessments, treatment, and services; learning disabilities services; child protective services; family stabilization services; or other programs designed to enhance employability.\n(b) \"Work activity\" does not include activities done for political purposes as defined in section 211B.01, subdivision 6.",
	"repealed": false
}