{
	"id": "5B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/5B.03",
	"title": "5B.03 ADDRESS CONFIDENTIALITY PROGRAM.",
	"text": "The secretary of state shall certify an eligible person as a program participant when the secretary receives an application that must contain:\n(1) the full legal name and date of birth of the eligible person;\n(2) a statement by the applicant that the applicant has good reason to believe (i) that the eligible person listed on the application is a victim of domestic violence, sexual assault, or harassment or stalking, or (ii) that the eligible person fears for the person's safety, the safety of another person who resides in the same household, or the safety of persons on whose behalf the application is made, and (iii) that the eligible person is not applying for certification as a program participant in order to avoid prosecution for a crime;\n(3) a designation of the secretary of state as agent for purposes of service of process and for the purpose of receipt of mail;\n(4) the phone number or numbers where the applicant or eligible person can be called by the secretary of state;\n(5) the physical residential address of the eligible person, disclosure of which will increase the risk of domestic violence, sexual assault, or harassment or stalking;\n(6) if mail cannot be delivered to the residential address of the eligible person, the address to which mail should be sent;\n(7) a statement whether the eligible person would like information on becoming an ongoing absentee ballot recipient pursuant to section 5B.06;\n(8) a statement from the eligible person that gives the secretary of state consent to confirm the eligible person's participation in Safe at Home to a third party who provides the program participant's first and last name and date of birth or Safe at Home lot number listed on the program participant's card;\n(9) the signature of the applicant, an indicator of the applicant's authority to act on behalf of the eligible person, if appropriate, the name and signature of any individual or representative of any person who assisted in the preparation of the application, and the date on which the application was signed; and\n(10) any other information as required by the secretary of state.\nApplications must be filed with the secretary of state and are subject to the provisions of section 5.15.\n(a) Upon filing a completed application, the secretary of state shall certify the eligible person as a program participant. Unless the program participant is not a Minnesota resident, program participants must be certified for four years following the date of filing unless the certification is canceled, withdrawn or invalidated before that date. Applicants from outside of Minnesota must be certified for 60 days. Upon receiving notice that the participant has moved to Minnesota, the participant must be certified for four years following the date of filing unless the certification is canceled, withdrawn, or invalidated before that date. The secretary of state shall by rule establish a renewal procedure.\n(b) Certification under this subdivision is for the purpose of participation in the confidentiality program established under this chapter only. Certification must not be used as evidence or be considered for any purpose in any civil, criminal, or administrative proceeding related to the behavior or actions giving rise to the application under subdivision 1.\nProgram participants or applicants must inform the secretary of state of a change of legal name, address, or telephone number.\nThe secretary of state must designate a mailing address to which all mail for program participants is to be sent. Each program participant may have only one designated address.\nAn individual who became a program participant as a minor assumes responsibility for changes in information and renewal when the individual reaches age 18.",
	"repealed": false
}