{
	"id": "54.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/54.27",
	"title": "54.27 COMMISSIONER'S EXAMINATION OF BOOKS AND ACCOUNTS.",
	"text": "The commissioner, with reference to face amount certificate investment companies, as defined in Minnesota Statutes 1974, section 54.26, shall have the supervisory power to make periodic examinations of the books and accounts of such companies for the purpose of determining:\n(a) that face amount certificate investment companies maintain certificate reserves and deposits of qualified assets in accordance with the requirements of the Federal Investment Company Act of 1940 and the rules and regulations thereunder, and that other investment companies described in Minnesota Statutes 1974, section 54.26 maintain certificate reserves and deposits of qualified assets as if they were subject to the Federal Investment Company Act of 1940 and rules and regulations thereunder so far as the same may be appropriate and except as hereinafter provided, and\n(b) that the accounting principles of all face amount certificate companies conform to generally accepted accounting principles for face amount certificate companies which are promulgated by the United States Securities and Exchange Commission. The accounting principles for investment companies shall include, where appropriate, any statements of investments or assets in a manner which relates historical cost of such investments or assets or other information required by the United States Securities and Exchange Commission. Assets maintained on deposit by companies not subject to section 28(c) of the Investment Company Act of 1940 shall consist of first mortgages and first deeds of trust on improved real estate, government bonds, state bonds, municipal bonds, obligations issued or guaranteed in whole or in part by the United States government or by a government chartered institution or agency, assets of the kind which life insurance companies were permitted, by the laws of the state of New York as of January 1, 1949, to acquire or hold, and such other assets as the commissioner may by rule or order approve for such purpose. The commissioner shall, in recognizing approved assets in rulemaking, give consideration to assets of the kind which life insurance companies were permitted to invest in or hold under the provisions of the code of the District of Columbia.\nInvestments required to be maintained on deposit by a company subject to section 54.26 shall be maintained within this state, provided, however, that where qualified investments are maintained on deposit by such company in respect of its liabilities under certificates issued to or held by residents of any state as required by the statutes of such state or any official or agency thereof, or are maintained outside of this state pursuant to any requirement of the federal government under the Investment Company Act of 1940, or otherwise, the amount so on deposit shall be deducted from the amount of qualified investments required to be maintained on deposit within this state.",
	"repealed": false
}