{
	"id": "145A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.04",
	"title": "145A.04 POWERS AND DUTIES OF COMMUNITY HEALTH BOARD.",
	"text": "(a) A community health board has the general responsibility for development and maintenance of a system of community health services under local administration and within a system of state guidelines and standards.\n(b) Under the general supervision of the commissioner, the community health board shall recommend the enforcement of laws, regulations, and ordinances pertaining to the powers and duties within its jurisdictional area. In the case of a multicounty or city community health board, the joint powers agreement under section 145A.03, subdivision 2, or delegation agreement under section 145A.07 shall clearly specify enforcement authorities.\n(c) A member of a community health board may not withdraw from a joint powers community health board during the first two calendar years following the effective date of the initial joint powers agreement. The withdrawing member must notify the commissioner and the other parties to the agreement at least one year before the beginning of the calendar year in which withdrawal takes effect.\n(d) The withdrawal of a county or city from a community health board does not affect the eligibility for the local public health grant of any remaining county or city for one calendar year following the effective date of withdrawal.\n(e) The local public health grant for a county or city that chooses to withdraw from a multicounty community health board shall be reduced by the amount of the local partnership incentive.\nConsistent with the guidelines and standards established under section 145A.06, the community health board shall:\n(1) identify local public health priorities and implement activities to address the priorities and the areas of public health responsibility, which include:\n(i) assuring an adequate local public health infrastructure by maintaining the basic foundational capacities to a well-functioning public health system that includes data analysis and utilization; health planning; partnership development and community mobilization; policy development, analysis, and decision support; communication; and public health research, evaluation, and quality improvement;\n(ii) promoting healthy communities and healthy behavior through activities that improve health in a population, such as investing in healthy families; engaging communities to change policies, systems, or environments to promote positive health or prevent adverse health; providing information and education about healthy communities or population health status; and addressing issues of health equity, health disparities, and the social determinants to health;\n(iii) preventing the spread of communicable disease by preventing diseases that are caused by infectious agents through detecting acute infectious diseases, ensuring the reporting of infectious diseases, preventing the transmission of infectious diseases, and implementing control measures during infectious disease outbreaks;\n(iv) protecting against environmental health hazards by addressing aspects of the environment that pose risks to human health, such as monitoring air and water quality; developing policies and programs to reduce exposure to environmental health risks and promote healthy environments; and identifying and mitigating environmental risks such as food and waterborne diseases, radiation, occupational health hazards, and public health nuisances;\n(v) preparing and responding to emergencies by engaging in activities that prepare public health departments to respond to events and incidents and assist communities in recovery, such as providing leadership for public health preparedness activities with a community; developing, exercising, and periodically reviewing response plans for public health threats; and developing and maintaining a system of public health workforce readiness, deployment, and response; and\n(vi) assuring health services by engaging in activities such as assessing the availability of health-related services and health care providers in local communities, identifying gaps and barriers in services; convening community partners to improve community health systems; and providing services identified as priorities by the local assessment and planning process; and\n(2) submit to the commissioner of health, at least every five years, a community health assessment and community health improvement plan, which shall be developed with input from the community and take into consideration the statewide outcomes, the areas of responsibility, and essential public health services;\n(3) implement a performance management process in order to achieve desired outcomes; and\n(4) annually report to the commissioner on a set of performance measures and be prepared to provide documentation of ability to meet the performance measures.\nA community health board must appoint, employ, or contract with a CHS administrator to act on its behalf. The board shall notify the commissioner of the CHS administrator's contact information and submit a copy of the resolution authorizing the CHS administrator to act as an agent on the board's behalf. The resolution must specify the types of action or actions that the CHS administrator is authorized to take on behalf of the board.\nThe community health board shall appoint, employ, or contract with a medical consultant to ensure appropriate medical advice and direction for the community health board and assist the board and its staff in the coordination of community health services with local medical care and other health services.\n(a) A community health board may employ persons as necessary to carry out its duties.\n(b) Except where prohibited by law, employees of the community health board may act as its agents.\n(c) Persons employed by a county, city, or the state whose functions and duties are assumed by a community health board shall become employees of the board without loss in benefits, salaries, or rights.\n(a) A community health board may acquire and hold in the name of the county or city the lands, buildings, and equipment necessary for the purposes of sections 145A.03 to 145A.131. It may do so by any lawful means, including gifts, purchase, lease, or transfer of custodial control.\n(b) A community health board may accept gifts, grants, and subsidies from any lawful source, apply for and accept state and federal funds, and request and accept local tax funds.\n(c) A community health board may establish and collect reasonable fees for performing its duties and providing community health services.\n(d) With the exception of licensing and inspection activities, access to community health services provided by or on contract with the community health board must not be denied to an individual or family because of inability to pay.\nTo improve efficiency, quality, and effectiveness, avoid unnecessary duplication, and gain cost advantages, a community health board may contract to provide, receive, or ensure provision of services.\nA community health board shall make investigations, or coordinate with any county board or city council within its jurisdiction to make investigations and reports and obey instructions on the control of communicable diseases as the commissioner may direct under section 144.12, 145A.06, subdivision 2, or 145A.07. Community health boards must cooperate so far as practicable to act together to prevent and control epidemic diseases.\nA community health board receiving funding for emergency preparedness or pandemic influenza planning from the state or from the United States Department of Health and Human Services shall participate in planning for emergency use of volunteer health professionals through the Minnesota Responds Medical Reserve Corps program of the Department of Health. A community health board shall collaborate on volunteer planning with other public and private partners, including but not limited to local or regional health care providers, emergency medical services, hospitals, tribal governments, state and local emergency management, and local disaster relief organizations.\nA community health board, county, or city participating in the Minnesota Responds Medical Reserve Corps program may enter into written mutual aid agreements for deployment of its paid employees and its Minnesota Responds Medical Reserve Corps volunteers with other community health boards, other political subdivisions within the state, or with tribal governments within the state. A community health board may also enter into agreements with the Indian Health Services of the United States Department of Health and Human Services, and with community health boards, political subdivisions, and tribal governments in bordering states and Canadian provinces.\nWhen a community health board, county, or city finds that the prevention, mitigation, response to, or recovery from an actual or threatened public health event or emergency exceeds its local capacity, it shall use available mutual aid agreements. If the event or emergency exceeds mutual aid capacities, a community health board, county, or city may request the commissioner of health to mobilize Minnesota Responds Medical Reserve Corps volunteers from outside the jurisdiction of the community health board, county, or city.\nA Minnesota Responds Medical Reserve Corps volunteer responding to a request for training or assistance at the call of a community health board, county, or city must be deemed an employee of the jurisdiction for purposes of workers' compensation, tort claim defense, and indemnification.\nTo enforce public health laws, ordinances or rules, a member or agent of a community health board, county, or city may enter a building, conveyance, or place where contagion, infection, filth, or other source or cause of preventable disease exists or is reasonably suspected.\n(a) If a threat to the public health such as a public health nuisance, source of filth, or cause of sickness is found on any property, the community health board, county, city, or its agent shall order the owner or occupant of the property to remove or abate the threat within a time specified in the notice but not longer than ten days. Action to recover costs of enforcement under this subdivision must be taken as prescribed in section 145A.08.\n(b) Notice for abatement or removal must be served on the owner, occupant, or agent of the property in one of the following ways:\n(1) by registered or certified mail;\n(2) by an officer authorized to serve a warrant; or\n(3) by a person aged 18 years or older who is not reasonably believed to be a party to any action arising from the notice.\n(c) If the owner of the property is unknown or absent and has no known representative upon whom notice can be served, the community health board, county, or city, or its agent, shall post a written or printed notice on the property stating that, unless the threat to the public health is abated or removed within a period not longer than ten days, the community health board, county, or city will have the threat abated or removed at the expense of the owner under section 145A.08 or other applicable state or local law.\n(d) If the owner, occupant, or agent fails or neglects to comply with the requirement of the notice provided under paragraphs (b) and (c), then the community health board, county, city, or a designated agent of the board, county, or city shall remove or abate the nuisance, source of filth, or cause of sickness described in the notice from the property.\nIn addition to any other remedy provided by law, the community health board, county, or city may bring an action in the court of appropriate jurisdiction to enjoin a violation of statute, rule, or ordinance that the board has power to enforce, or to enjoin as a public health nuisance any activity or failure to act that adversely affects the public health.\nIt is a misdemeanor to deliberately hinder a member of a community health board, county or city, or its agent from entering a building, conveyance, or place where contagion, infection, filth, or other source or cause of preventable disease exists or is reasonably suspected, or otherwise to interfere with the performance of the duties of the responsible jurisdiction.\nIt is a misdemeanor for a member or agent of a community health board, county, or city to refuse or neglect to perform a duty imposed on an applicable jurisdiction by statute or ordinance.\nThis section does not limit powers and duties of a community health board, county, or city prescribed in other sections.\nThe community health board may recommend local ordinances pertaining to community health services to any county board or city council within its jurisdiction and advise the commissioner on matters relating to public health that require assistance from the state, or that may be of more than local interest.\nThe community health board must ensure that community health services are accessible to all persons on the basis of need. No one shall be denied services because of race, color, sex, age, language, religion, nationality, inability to pay, political persuasion, or place of residence.\n(a) A state community health services advisory committee is established to advise, consult with, and make recommendations to the commissioner on the development, maintenance, funding, and evaluation of local public health services. Each community health board may appoint a member to serve on the committee. The committee must meet at least quarterly, and special meetings may be called by the committee chair or a majority of the members. Members or their alternates may be reimbursed for travel and other necessary expenses while engaged in their official duties.\n(b) Notwithstanding section 15.059, the State Community Health Services Advisory Committee does not expire.\n(c) The city boards or county boards that have established or are members of a community health board may appoint a community health advisory committee to advise, consult with, and make recommendations to the community health board on the duties under subdivision 1a.",
	"repealed": false
}