{
	"id": "145.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.471",
	"title": "145.471 PRENATAL TRISOMY DIAGNOSIS AWARENESS ACT.",
	"text": "This section shall be known and may be cited as the \"Prenatal Trisomy Diagnosis Awareness Act.\"\nFor purposes of this section, the following terms have the meanings given them:\n(1) \"commissioner\" means the commissioner of health;\n(2) \"deliver\" means providing information to an expectant parent and, if appropriate, other family members, in a written format;\n(3) \"health care practitioner\" means a medical professional that provides prenatal or postnatal care and administers or requests administration of a diagnostic or screening test to a pregnant woman that detects for trisomy conditions; and\n(4) \"trisomy conditions\" means trisomy 13, otherwise known as Patau syndrome; trisomy 18, otherwise known as Edwards syndrome; and trisomy 21, otherwise known as Down syndrome.\nA health care practitioner who orders tests for a pregnant woman to screen for trisomy conditions shall provide the information in subdivision 4 to the pregnant woman if the test reveals a positive result for any of the trisomy conditions.\n(a) The commissioner shall make the following information available to health care practitioners:\n(1) up-to-date and evidence-based information about the trisomy conditions that has been reviewed by medical experts and national trisomy organizations. The information must be provided in a written or an alternative format and must include the following:\n(i) expected physical, developmental, educational, and psychosocial outcomes;\n(ii) life expectancy;\n(iii) the clinical course description;\n(iv) expected intellectual and functional development; and\n(v) treatment options available for the particular syndrome for which the test was positive; and\n(2) contact information for nonprofit organizations that provide information and support services for trisomy conditions.\n(b) The commissioner shall post the information in paragraph (a) on the Department of Health website.\n(c) The commissioner shall follow existing department practice to ensure that the information is culturally and linguistically appropriate for all recipients.\n(d) Any local or national organization that provides education or services related to trisomy conditions may request that the commissioner include the organization's informational material and contact information on the Department of Health website. Once a request is made, the commissioner may add the information to the website.",
	"repealed": false
}