{
	"id": "62S.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.29",
	"title": "62S.29 STANDARDS FOR MARKETING.",
	"text": "An insurer or other entity marketing long-term care insurance coverage in this state, directly or through its producers, shall:\n(1) establish marketing procedures and agent training requirements to assure that any marketing activities, including any comparison of policies by its agents or other producers, are fair and accurate;\n(2) establish marketing procedures to assure excessive insurance is not sold or issued;\n(3) display prominently by type, stamp, or other appropriate means, on the first page of the outline of coverage and policy, the following:\n\"Notice to buyer: This policy may not cover all of the costs associated with long-term care incurred by the buyer during the period of coverage. The buyer is advised to review carefully all policy limitations.\";\n(4) provide copies of the disclosure forms required in section 62S.081, subdivision 4, to the applicant;\n(5) inquire and otherwise make every reasonable effort to identify whether a prospective applicant or enrollee for long-term care insurance already has long-term care insurance and the types and amounts of the insurance;\n(6) establish auditable procedures for verifying compliance with this subdivision;\n(7) if applicable, provide written notice to the prospective policyholder and certificate holder, at solicitation, that a senior insurance counseling program approved by the commissioner, the Senior LinkAge Line, is available and the name, address, and telephone number of the program;\n(8) use the terms \"noncancelable\" or \"level premium\" only when the policy or certificate conforms to section 62S.14; and\n(9) provide an explanation of contingent benefit upon lapse provided for in section 62S.266.\nIn addition to the practices prohibited in chapter 72A, the following acts and practices are prohibited:\n(1) knowingly making any misleading representation or incomplete or fraudulent comparison of any insurance policies or insurers for the purpose of inducing, or tending to induce, any person to lapse, forfeit, surrender, terminate, retain, pledge, assign, borrow on, or convert any insurance policy or to take out a policy of insurance with another insurer;\n(2) employing a method of marketing having the effect of or tending to induce the purchase of insurance through force, fright, threat, whether explicit or implied, or undue pressure to purchase or recommend the purchase of insurance;\n(3) making use directly or indirectly of a method of marketing which fails to disclose in a conspicuous manner that a purpose of the method of marketing is solicitation of insurance and that contact will be made by an insurance agent or insurance company; and\n(4) misrepresenting a material fact in selling or offering to sell a policy.\nWith respect to the obligations set forth in this section, the primary responsibility of an association, as defined in section 62S.01, subdivision 15, clause (2), when endorsing or selling long-term care insurance is to educate its members concerning long-term care issues in general so that its members can make informed decisions. Associations shall provide objective information regarding long-term care insurance policies or certificates endorsed or sold by the associations to ensure that members of such associations receive a balanced and complete explanation of the features in the policies or certificates that are being endorsed or sold.\nThe insurer shall file with the commissioner the following material:\n(1) the policy and certificate;\n(2) a corresponding outline of coverage; and\n(3) all advertisements requested by the commissioner.\nAn association shall disclose in a long-term care insurance solicitation:\n(1) the specific nature and amount of the compensation arrangements, including all fees, commissions, administrative fees, and other forms of financial support, that the association receives from endorsement or sale of the policy or certificate to its members; and\n(2) a brief description of the process under which the policies and the insurer issuing the policies were selected.\nIf the association and the insurer have interlocking directorates or trustee arrangements, the association shall disclose this fact to its members.\nThe board of directors of associations selling or endorsing long-term care insurance policies or certificates shall review and approve the insurance policies as well as the compensation arrangements made with the insurer.\nAn association shall also at the time of the association's decision to endorse, engage the services of a person with expertise in long-term care insurance not affiliated with the insurer to conduct an examination of the policies, including its benefits, features, and rates and update the examination thereafter in the event of material change; actively monitor the marketing efforts of the insurer and its agents; and review and approve all marketing materials or other insurance communications used to promote sales or sent to members regarding the policies or certificates. This subdivision does not apply to qualified long-term care insurance contracts.\nNo group long-term care insurance policy or certificate may be issued to an association unless the insurer files with the commissioner the information required in this section.\nThe insurer shall not issue a long-term care policy or certificate to an association or continue to market a policy or certificate unless the insurer certifies annually that the association has complied with the requirements specified in this section.\nFailure to comply with the filing and certification requirements of this section constitutes an unfair trade practice in violation of sections 72A.17 to 72A.32.",
	"repealed": false
}