{
	"id": "3C.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/3C.20",
	"title": "3C.20 IDENTIFICATION, COLLECTION, AND PUBLICATION OF LAWS REGARDING COLLATERAL CONSEQUENCES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Collateral consequence\" means a collateral sanction or a disqualification.\n(c) \"Collateral sanction\" means a penalty, disability, or disadvantage, however denominated, imposed on an individual as a result of the individual's conviction of an offense that applies by operation of law whether or not the penalty, disability, or disadvantage is included in the judgment or sentence. Collateral sanction does not include imprisonment, probation, parole, supervised release, forfeiture, restitution, fine, assessment, or costs of prosecution.\n(d) \"Conviction\" or \"convicted\" includes a child adjudicated delinquent.\n(e) \"Disqualification\" means a penalty, disability, or disadvantage, however denominated, that an administrative agency, governmental official, or court in a civil proceeding is authorized but not required to impose on an individual on grounds relating to the individual's conviction of an offense.\n(f) \"Offense\" means a felony, gross misdemeanor, misdemeanor, or adjudication as a delinquent under the laws of this state, another state, or the United States.\n(a) The revisor of statutes shall:\n(1) identify or cause to be identified any provision in this state's constitution, statutes, and administrative rules that imposes a collateral sanction or authorizes the imposition of a disqualification, and any provision of law that may afford relief from a collateral consequence;\n(2) in a timely manner after January 1, 2025, prepare a collection of citations to, and the text or short descriptions of, the provisions identified under clause (1); and\n(3) annually update the collection in a timely manner after the regular or last special session of the legislature in a calendar year.\nIn complying with clauses (1) and (2), the revisor may rely on the study of this state's collateral sanctions, disqualifications, and relief provisions prepared by the National Institute of Justice described in section 510 of the Court Security Improvement Act of 2007, Public Law 110-177.\n(b) The revisor of statutes shall include the following statements or substantially similar language in a prominent manner at the beginning of the collection required under paragraph (a):\n(1) This collection has not been enacted into law and does not have the force of law.\n(2) An error or omission in this collection or in any reference work cited in this collection is not a reason for invalidating a plea, conviction, or sentence or for not imposing a collateral sanction or authorizing a disqualification.\n(3) The laws of other jurisdictions and local governments that impose additional collateral sanctions and authorize additional disqualifications are not included in this collection.\n(4) This collection does not include any law or other provision regarding the imposition of or relief from a collateral sanction or a disqualification enacted or adopted after (date the collection was prepared or last updated).\n(c) The Office of the Revisor of Statutes shall publish the collection prepared and updated as required under paragraph (a). If available, the revisor of statutes shall publish as part of the collection the title and Internet address of the most recent collection of:\n(1) the collateral consequences imposed by federal law; and\n(2) any provision of federal law that may afford relief from a collateral consequence.\n(d) The collection described under paragraph (c) must be available to the public on the Internet without charge in a reasonable time after the collection is created or updated.",
	"repealed": false
}