{
	"id": "299A.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.85",
	"title": "299A.85 OFFICE FOR MISSING AND MURDERED INDIGENOUS RELATIVES.",
	"text": "As used in this section, the following terms have the meanings given.\n(a) \"Indigenous\" means descended from people who were living in North America at the time people from Europe began settling in North America.\n(b) \"Missing and murdered Indigenous relatives\" means missing and murdered Indigenous people.\n(c) \"Missing and Murdered Indigenous Women Task Force report\" means the report titled \"Missing and Murdered Indigenous Women Task Force: a Report to the Minnesota Legislature,\" published by the Wilder Research organization in December 2020.\nThe commissioner shall establish and maintain an office dedicated to preventing and ending the targeting of Indigenous women, children, and two-spirited people with the Minnesota Office of Justice Programs.\n(a) The commissioner must appoint a director who is a person closely connected to a Tribe or Indigenous community and who is highly knowledgeable about criminal investigations. The commissioner is encouraged to consider candidates for appointment who are recommended by Tribes and Indigenous communities.\n(b) The director may select, appoint, and compensate out of available funds assistants and employees as necessary to discharge the office's responsibilities.\n(c) The director and full-time staff shall be members of the Minnesota State Retirement System.\nThe office has the following duties:\n(1) advocate in the legislature for legislation that will facilitate the accomplishment of the mandates identified in the Missing and Murdered Indigenous Women Task Force report;\n(2) advocate for state agencies to take actions to facilitate the accomplishment of the mandates identified in the Missing and Murdered Indigenous Women Task Force report;\n(3) develop recommendations for legislative and agency actions to address injustice in the criminal justice system's response to the cases of missing and murdered Indigenous relatives;\n(4) facilitate research to refine the mandates in the Missing and Murdered Indigenous Women Task Force report and to assess the potential efficacy, feasibility, and impact of the recommendations;\n(5) develop tools and processes to evaluate the implementation and impact of the efforts of the office;\n(6) track and collect Minnesota data on missing and murdered indigenous women, children, and relatives, and provide statistics upon public or legislative inquiry;\n(7) facilitate technical assistance for local and Tribal law enforcement agencies during active missing and murdered Indigenous relatives cases;\n(8) conduct case reviews and report on the results of case reviews for the following types of missing and murdered Indigenous relatives cases: cold cases for missing Indigenous people and death investigation review for cases of Indigenous people ruled as suicide or overdose under suspicious circumstances;\n(9) conduct case reviews of the prosecution and sentencing for cases where a perpetrator committed a violent or exploitative crime against an Indigenous person. These case reviews should identify those cases where the perpetrator is a repeat offender;\n(10) prepare draft legislation as necessary to allow the office access to the data required for the office to conduct the reviews required in this section and advocate for passage of that legislation;\n(11) review sentencing guidelines for missing and murdered Indigenous women-related crimes, recommend changes if needed, and advocate for consistent implementation of the guidelines across Minnesota courts;\n(12) develop and maintain communication with relevant divisions in the Department of Public Safety regarding any cases involving missing and murdered Indigenous relatives and on procedures for investigating cases involving missing and murdered Indigenous relatives; and\n(13) coordinate, as relevant, with the Bureau of Indian Affairs' Cold Case Office through Operation Lady Justice and other federal efforts, as well as efforts in neighboring states and Canada. This recommendation pertains to state efforts. Tribes are sovereign nations that have the right to determine if and how they will coordinate with these other efforts.\nIn fulfilling its duties the office may coordinate, as useful, with stakeholder groups that were represented on the Missing and Murdered Indigenous Women Task Force and state agencies that are responsible for the systems that play a role in investigating, prosecuting, and adjudicating cases involving violence committed against Indigenous women, those who have a role in supporting or advocating for missing or murdered Indigenous women and the people who seek justice for them, and those who represent the interests of Indigenous people. This includes the following entities: Minnesota Chiefs of Police Association; Minnesota Sheriffs' Association; Bureau of Criminal Apprehension; Minnesota Police and Peace Officers Association; Tribal law enforcement; Minnesota County Attorneys Association; United States Attorney's Office; juvenile courts; Minnesota Coroners' and Medical Examiners' Association; United States Coast Guard; state agencies, including the Departments of Health, Human Services, Education, Corrections, and Public Safety; the Minnesota Indian Affairs Council; service providers who offer legal services, advocacy, and other services to Indigenous women and girls; the Minnesota Indian Women's Sexual Assault Coalition; Mending the Sacred Hoop; Indian health organizations; Indigenous women and girls who are survivors; the 11 Tribal nations that share geography with Minnesota; and organizations and leadership from urban and statewide American Indian communities.\nThe office must report on measurable outcomes achieved to meet its statutory duties, along with specific objectives and outcome measures proposed for the following year. The report must include data and statistics on missing and murdered Indigenous women, children, and Two-Spirit relatives in Minnesota, including names, dates of disappearance, and dates of death, to the extent the data is publicly available. The report must also identify and describe the work of any reward advisory group and itemize the expenditures of the Gaagige-Mikwendaagoziwag reward account, if any. The office must submit the report by January 15 each year to the chairs and ranking minority members of the legislative committees with primary jurisdiction over public safety.\nThe office may apply for and receive grants from public and private entities for purposes of carrying out the office's duties under this section.\nNotwithstanding section 13.384 or 13.85, the director has access to corrections and detention data and medical data maintained by an agency and classified as private data on individuals or confidential data on individuals to the extent the data is necessary for the office to perform its duties under this section.",
	"repealed": false
}