{
	"id": "469.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.201",
	"title": "469.201 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 469.201 to 469.207.\n\"City\" means a city of the first class as defined in section 410.01, a city of the second class that is designated as an economically depressed area by the United States Department of Commerce, and a statutory or home rule charter city, town, or township. For each city, a port authority, housing and redevelopment authority, or other agency or instrumentality, the jurisdiction of which is the territory of the city, is included within the meaning of city.\n\"City council\" means the city council of a city as defined in subdivision 2.\n(a) \"City matching money\" means the money of a city specified in a targeted revitalization program. The sources of city matching money may include:\n(1) money from the general fund or a special fund of a city used to implement a targeted revitalization program;\n(2) money paid or repaid to a city from the proceeds of a grant that a city has received from the federal government, a profit or nonprofit corporation, or another entity or individual, that is to be used to implement a targeted revitalization program;\n(3) tax increments received by a city under sections 469.174 to 469.179 or other law, if eligible, to be spent in the targeted community;\n(4) the greater of the fair market value or the cost to the city of acquiring land, buildings, equipment, or other real or personal property that a city contributes, grants, leases, or loans to a profit or nonprofit corporation or other entity or individual, in connection with the implementation of a targeted revitalization program;\n(5) city money to be used to acquire, install, reinstall, repair, or improve the infrastructure facilities of a targeted community;\n(6) money contributed by a city to pay issuance costs, fund bond reserves, or to otherwise provide financial support for revenue bonds or obligations issued by a city for a project or program related to the implementation of a targeted revitalization program;\n(7) money derived from fees received by a city in connection with its community development activities that are to be used in implementing a targeted revitalization program;\n(8) money derived from the apportionment to the city under section 162.14 or by special law, and expended in a targeted community for an activity related to the targeted revitalization program;\n(9) administrative expenses of the city that are incurred in connection with the planning, implementation, or reporting requirements of sections 469.201 to 469.207.\n(b) City matching money does not include:\n(1) city money used to provide a service or to exercise a function that is ordinarily provided throughout the city, unless an increased level of the service or function is to be provided in a targeted community in accordance with a targeted revitalization program;\n(2) the proceeds of bonds issued by the city under chapter 462C or 469 and payable solely from repayments made by one or more nongovernmental persons in consideration for the financing provided by the bonds; or\n(3) money given by the state to fund any part of the targeted revitalization program.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Housing activities\" include any work or undertaking to provide housing and related services and amenities primarily for persons and families of low or moderate income. This work or undertaking may include the planning of buildings and improvements; the acquisition of real property, which may be needed to address vacancies, foreclosures, and preservation of housing now or in the future; demolition; activities to address lead abatement, energy efficiencies, or other activities related to the health of a building; and the construction, reconstruction, alteration, and repair of new and existing buildings. Housing activities also include the provision of a housing rehabilitation and energy improvement loan and grant program with respect to any residential property located within the targeted community, the cost of relocation relating to acquiring property for housing activities, and programs authorized by chapter 462C.\n\"Lost unit\" means a rental housing unit that has been vacant for more than six months or has been condemned for code violations, that is lost as a result of revitalization activities because it is demolished, converted to an owner-occupied unit that is not a cooperative, or converted to a nonresidential use, or because the gross rent to be charged exceeds 125 percent of the gross rent charged for the unit six months before the start of rehabilitation.\n\"Persons and families of low income\" means persons and families of low income as defined in section 469.002, subdivision 17.\n\"Persons and families of moderate income\" means persons and families of moderate income as defined in section 469.002, subdivision 18.\n\"Targeted community\" means an area including one or more census tracts, as determined and measured by the Bureau of Census of the United States Department of Commerce, that a city council determines in a resolution adopted under section 469.202, subdivision 1, meets the criteria of section 469.202, subdivision 2, and any additional area designated under section 469.202, subdivision 3.\n\"Targeted community money\" means the money designated in the targeted revitalization program to be used to implement the targeted revitalization program.\n\"Targeted community revitalization and financing program,\" \"revitalization program,\" or \"program\" means the targeted community revitalization and financing program adopted in accordance with section 469.203.",
	"repealed": false
}