{
	"id": "171.186",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.186",
	"title": "171.186 SUSPENSION FOR NONPAYMENT OF SUPPORT; LIMITED LICENSE.",
	"text": "The commissioner shall suspend a person's driver's license or operating privileges without a hearing upon receipt of a court order or notice from a public authority responsible for child support enforcement that states that the driver is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments, and is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by a court, a child support magistrate, or the public authority responsible for child support enforcement, in accordance with section 518A.65.\nUpon suspending a driver's license or operating privileges under this section, the department shall immediately notify the licensee, in writing, by mailing a notice addressed to the licensee at the licensee's last known address.\nA license or operating privilege must remain suspended and may not be reinstated, nor may a license be subsequently issued to the person, until the commissioner receives notice from the court, a child support magistrate, or public authority responsible for child support enforcement that the person is in compliance with all current orders of support or written payment agreements pursuant to section 518A.69. A fee may not be assessed for reinstatement of a license under this section unless the person whose license was suspended under this section has obtained a limited license during the period of suspension.\n(a) Notwithstanding subdivision 3, the commissioner may issue a limited license to a person whose license has been suspended under this section if the person qualifies for a limited license under section 171.30.\n(b) A limited license issued to a person under this subdivision must expire 90 days after the date it is issued.",
	"repealed": false
}