{
	"id": "122A.2451",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.2451",
	"title": "122A.2451 ALTERNATIVE TEACHER PREPARATION PROVIDERS AND PROGRAMS.",
	"text": "(a) \"Provider\" or \"unit\" means an eligible entity that seeks or has obtained approval for an alternative teacher preparation program consistent with this section.\n(b) \"Program\" means content provided by a provider that leads toward licensure in a specific content area.\nTo provide alternative pathways towards Minnesota teacher licensure outside of the traditional means, improve ethnic and cultural diversity in the classroom, and to close the achievement gap, the Professional Educator Licensing and Standards Board must approve qualified teacher preparation providers and programs under this section that are a means to acquire a Tier 2 license under section 122A.182 and prepare for acquiring a Tier 3 license under section 122A.183.\nA school district, charter school, or nonprofit corporation organized under chapter 317A for an education-related purpose is eligible to participate under this section. An eligible entity may apply for provider and program approval simultaneously.\nAn eligible entity must be approved as a provider before being approved to provide programs towards licensure. The Professional Educator Licensing and Standards Board must approve eligible entities under subdivision 3 that meet the following requirements:\n(1) has evidence and history of fiscal solvency, capacity, and operation;\n(2) has evidence of necessary infrastructure to provide accurate, timely, and secure data for the purposes of admission, candidate monitoring, testing, background checks, and license recommendations;\n(3) has policies and procedures in place ensuring the security of candidate records under the federal Family Educational Rights and Privacy Act; and\n(4) has the instructional capacity or ability to obtain the instructional capacity to provide an adequate instructional phase under subdivision 5.\nThe board must approve programs offered by approved providers based on nontraditional criteria. An approved program must have the following characteristics:\n(1) an instructional phase that provides intensive preparation and classroom experience that is commensurate with the scope of licensure standards defined under rule, before the teacher candidate assumes classroom responsibilities;\n(2) a research-based and results-oriented approach focused on best teaching practices to increase student proficiency and growth measured against state academic standards;\n(3) a strategy to combine pedagogy and best teaching practices to better inform teacher candidates' classroom instruction;\n(4) provide assessment, supervision, and evaluation of teacher candidates to determine their specific needs throughout the program, and to support efforts to successfully complete the program;\n(5) provide intensive and ongoing professional learning opportunities that accelerate teacher candidates' professional growth, support student learning, and provide a workplace orientation, professional staff development, mentoring and peer review, focused on standards of professional practice and continuous professional growth; and\n(6) a process to review a candidate's final proficiency of required licensure content standards that leads to potential candidate recommendation by the provider to the board for a Tier 3 teaching license under subdivision 8.\n(a) The board must permit alternative teacher preparation providers and teacher candidates to demonstrate pedagogy and content standard proficiency in school-based programs and through other nontraditional means. Nontraditional means may include previous work experiences, teaching experiences, educator evaluations, industry-recognized certifications, and other essentially equivalent demonstrations.\n(b) The board must use nontraditional criteria to determine qualifications of program instructors, including permitting instructors to hold a baccalaureate degree only.\nIf the board determines that a teacher preparation provider or licensure program fails to meet or is deficient in any of the requirements of subdivision 5, it may suspend or revoke the approval of the provider or program after it notifies the provider of the deficiencies and gives the provider an opportunity to remedy the deficiencies.\n(a) A candidate that completes an approved program must apply for a license under the tiered licensure system according to sections 122A.181 to 122A.184.\n(b) A person who successfully completes another state's alternative teacher preparation licensure program may apply to the Professional Educator Licensing and Standards Board for a Tier 3 license under section 122A.183.\nMS 2022 [Repealed, 2024 c 109 art 3 s 20]",
	"repealed": false
}