{
	"id": "325F.6642",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.6642",
	"title": "325F.6642 TITLE BRANDING.",
	"text": "If the application for title and registration indicates that the vehicle has been classified as a total loss because of water or flood damage, or that the vehicle bears a \"flood damaged\" or similar brand, the registrar of motor vehicles must record the brand \"flood damaged\" on the certificate of title and all subsequent certificates of title issued for that vehicle.\n(a) Upon transfer and application for title to all vehicles for which the \"salvage\" brand is required under section 168A.151, subdivision 1, the registrar of motor vehicles must (1) record the brand \"salvage\" on the first certificate of title, and (2) subject to section 168A.152, record the brand \"prior salvage\" on all subsequent certificates of title issued for that vehicle.\n(b) Notwithstanding paragraph (a), a \"prior salvage\" brand is not required for a recovered intact vehicle, as defined in section 168A.01, subdivision 16b.\nUpon application for title to all vehicles for which the \"prior salvage\" brand is required under section 168A.151, subdivision 1, the registrar of motor vehicles must record the brand \"prior salvage\" on the certificate of title and all subsequent certificates of title issued for that vehicle.\nUpon transfer and application for title to a vehicle that is subject to section 325F.6641, subdivision 1, the registrar of motor vehicles must (1) record the brand \"salvage\" on the first certificate of title, and (2) subject to section 168A.152, record the brand \"prior salvage\" on all subsequent certificates of title issued for that vehicle.\nMS 2020 [Repealed by amendment, 2022 c 57 s 11]\nFor vehicles that are reconstructed within the meaning of section 168A.15, the registrar must record the brand \"reconstructed\" on the certificate of title and all subsequent certificates of title.\nEach brand designation under this section or section 168A.05, subdivision 3, 168A.151, or 325F.665, subdivision 14, required on a certificate of title must be made by the registrar of motor vehicles in a clear and conspicuous manner, in a format different from all other writing on the certificate of title.\nMS 2020 [Repealed by amendment, 2022 c 57 s 11]\nMS 2020 [Repealed by amendment, 2022 c 57 s 11]\nMS 2020 [Repealed by amendment, 2022 c 57 s 11]",
	"repealed": false
}