{
	"id": "15.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.16",
	"title": "15.16 TRANSFER OF LANDS BETWEEN DEPARTMENTS.",
	"text": "To facilitate the transfer of the control of state-owned lands between state departments and agencies of government and to avoid the necessity of condemning state lands by a department or agency of government of the state, a department or agency of the state government of Minnesota may acquire the control of state lands for public purposes from the department or agency of state government having those lands under its control and supervision, upon terms and conditions that are mutually agreed upon by the heads of the interested state departments or agencies.\nIf the heads of the departments or agencies acting under subdivision 1 are unable to agree on the terms and conditions of a transfer of control of state lands, the Executive Council, upon application of a state department or agency having the power to acquire lands for public purposes, shall determine the terms and conditions and may order the transfer of the control of state lands to the department or agency requesting the transfer.\nThe commissioner of management and budget is authorized and directed to transfer funds between state departments and agencies to effect the terms and conditions to transfer the control of real estate as provided in this section.\nThe transfer of control of real estate as provided under this section must be made on transfer documents prescribed by the attorney general, and the transfer documents must be permanently filed in the office of the commissioner of management and budget.\nNo control of state-owned lands may be transferred between state departments or agencies without the departments or agencies first consulting the chairs of the senate Finance Committee and house of representatives Ways and Means Committee and obtaining their recommendations. The recommendations are advisory only. Failure to obtain a prompt recommendation is deemed a negative recommendation.",
	"repealed": false
}