{
	"id": "237.762",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.762",
	"title": "237.762 ALTERNATIVE REGULATION PLAN RATE, PRICE.",
	"text": "An alternative regulation plan approved by the commission under this section must provide that the recurring and nonrecurring rates or prices that may be charged by a telephone company for price-regulated services are no higher than the approved rate or prices on file with the commission for those services on the date of the filing of the plan. Furthermore, no plan may in any way change the terms or conditions of any access charge settlements approved by the commission or exempt any company from compliance with any commission access charge order issued before the filing of a plan. The plan must address implementation of additional access charge reductions that may occur during that portion of the plan that extends beyond expiration of commission-approved settlements.\nFor services offered by the telephone company for the first time after August 1, 1995, the rates or prices must equal or exceed the total service long-run incremental cost of the service.\n(a) An alternative regulation plan must set forth the procedures under which the telephone company may reduce the rates or prices for price-regulated services below the initial rates or prices or thereafter increase the rates or prices during the term of the plan. The rates or prices may not be reduced below the total service long-run incremental cost of providing the service. Except as provided in paragraph (b), the rates or prices may not exceed the initial rates or prices for the service determined under subdivision 1 for the first three years of the plan. After a plan has been in effect for three years, price-regulated rates may be changed as appropriate under a procedure set forth in an approved plan. Rates for price-regulated services may not be increased unless the company has demonstrated substantial compliance with the quality of service standards set forth in the plan.\n(b) An approved plan may allow changes in rates for price-regulated services after two years to reflect:\n(1) changes in state and federal taxes;\n(2) changes in jurisdictional allocations from the Federal Communications Commission, the amount of which the telephone company cannot control and for which equal and opposite exogenous changes are made on the federal level; and\n(3) substantial financial impacts of investments in telecommunications infrastructure which are made: (i) if the investments, for any 12-month period, exceed 20 percent of the gross plant investment of the company; or (ii) are the result of government mandates to construct specific telephone infrastructure, the mandate applies to local telephone companies, and the company would not otherwise be compensated through some other manner under the plan.\nWhen the rates or prices for services are unbundled, the price for each basic network function must be set to equal or exceed its total service long-run incremental cost. Before August 1, 1997, if the rates or prices for price-regulated services are bundled, the bundled rate or price may not exceed the sum of the unbundled rates or prices for the individual service elements or services or the total initial bundled rate or price for those service elements or services.\nOther than as authorized in this subdivision, an initial alternative regulation plan must not permit income-neutral rate changes for price-regulated services during the plan except as is necessary to implement extended area service or any successor to that service. Any plan must provide that after the rules issued pursuant to section 237.16 are adopted, rates for price-regulated services may be increased, as approved by the commission, to the extent necessary to carry out the purpose of those rules. However, rate increases, if any, for those services must be incorporated with a universal service fund so that the effective rate for the customers of those services does not increase during the first three years of the plan.\nThe telephone company shall file price lists with the commission for all flexibly priced or non-price-regulated services. The rate or price for each flexibly priced and non-price-regulated service must be equal to or exceed the total service long-run incremental cost of providing that service. In any proceeding regarding the appropriateness of a rate or price for a flexibly priced or non-price-regulated service, the telephone company has the burden of proving that the rate or price is above the total service long-run incremental cost of providing that service.\nThis section does not prevent a telephone company from packaging any service classified as price regulated or flexibly priced pursuant to section 237.761, subdivisions 2 to 4, with any other service, or engaging in promotional activities concerning such services, so long as:\n(1) the company also continues to offer these price-regulated and flexibly priced services as separate stand-alone services at prices required by this section; and\n(2) at the time the packaged offering is introduced, or at the time the package price is subsequently changed, the packaged rate or price may not exceed the sum of the unpackaged rates or prices for the individual service elements or services.",
	"repealed": false
}