{
	"id": "103E.811",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.811",
	"title": "103E.811 ABANDONING DRAINAGE SYSTEM.",
	"text": "After the period originally fixed or subsequently extended to pay the assessment of the drainage liens expires, a drainage system may be abandoned as provided in this section.\nA petition must be signed by at least 51 percent of the property owners assessed for the construction of the drainage system or by the owners of not less than 51 percent of the area of the property assessed for the drainage system. For the purpose of the petition, the county is the resident owner of all tax-forfeited property held by the state and assessed benefits for the drainage system, and the board may execute the petition for the county as an owner.\nThe petition must designate the drainage system proposed to be abandoned and show that the drainage system is not of public benefit and utility because the agricultural property that used the drainage system has been generally abandoned or because the drainage system has ceased to function and its restoration is not practical.\nIf all property assessed for benefits in the drainage system is in one county, the petition must be filed with the auditor unless the petition is signed by the board, in which case the petition must be made to the district court of the county and filed with the court administrator. If property assessed for benefits is in two or more counties, the petition must be filed with the auditor. When the petition is filed, the drainage authority in consultation with the auditor, or the court administrator with the approval of the court, shall set a time and location for a hearing on the petition. The auditor or court administrator shall give notice by publication of the time and location of the abandonment hearing to all persons interested. The drainage authority or the district court where the petition is properly filed has jurisdiction of the petition.\n(a) At the hearing, the drainage authority or court shall examine the petition and determine whether it is sufficient and shall hear all interested parties.\n(b) If a property owner assessed benefits for the drainage system appears and makes a written objection to the abandonment of the drainage system, the drainage authority or court shall appoint three disinterested persons as viewers to examine the property and report to the drainage authority or court. The hearing must be adjourned to make the examination and report and a date must be set to reconvene. The viewers, if appointed, shall proceed to examine the property of the objecting owner and report as soon as possible to the drainage authority or court with the description and situation of the property and whether the drainage system drains or otherwise affects the property.\n(c) When the hearing is reconvened, the drainage authority or court shall consider the viewers' report and all evidence offered, and:\n(1) if the drainage authority determines that the drainage system serves any useful purpose to any property or the general public, the petition for abandonment must be denied; or\n(2) if the drainage authority determines that the drainage system does not serve any useful purpose to any affected property and is not of public benefit and utility, the drainage authority or court shall make findings and shall, by order, abandon the drainage system.\nAfter abandonment of a drainage system, a repair petition for the drainage system may not be accepted and the responsibility of the drainage authority for the maintenance of the drainage system ends.",
	"repealed": false
}