{
	"id": "169.866",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.866",
	"title": "169.866 SPECIAL CANOLA-HAULING VEHICLE PERMIT.",
	"text": "The commissioner may issue a permit for a vehicle that meets the following requirements:\n(1) is a combination of vehicles, including a truck-tractor and a semitrailer drawing one additional trailer or semitrailer, and no semitrailer used in the three-vehicle combination has an overall length in excess of 28-1/2 feet;\n(2) has a maximum gross vehicle weight of 105,500 pounds;\n(3) complies with the axle weight limits in section 169.824;\n(4) complies with the tire weight limits in section 169.823, or the tire manufacturers' recommended load, whichever is less;\n(5) is operated only in this state on marked Trunk Highway 175 from Hallock to the North Dakota border, on U.S. Highway 75 from Hallock to Donaldson, and on marked Trunk Highway 11 from Donaldson to the North Dakota border; and\n(6) the seasonal weight increases authorized under section 169.826, subdivision 1, do not apply.\nVehicles issued permits under subdivision 1 must comply with the following restrictions:\n(1) the vehicle must be operated in compliance with seasonal load restrictions under section 169.87;\n(2) the vehicle may not be operated on the interstate highway system or national network highways; and\n(3) the vehicle may be operated on streets or highways under the control of local authorities only upon the approval of the local authority; however, vehicles may have reasonable access to terminals and facilities for food, fuel, repairs, and rest, and for continuity of route within one mile of the national network as provided by section 169.81, subdivision 3, and by the Code of Federal Regulations, title 23, section 658.19.\nVehicle permits issued under subdivision 1 must be annual permits. The fee is $850 for each vehicle, or a proportional amount as provided in section 169.86, subdivision 5, and must be deposited in the trunk highway fund. An amount sufficient to administer the permit program is appropriated from the trunk highway fund to the commissioner for the costs of administering the permit program.\nUpon request of the permit applicant, the expiration date for a permit issued under this section must be the same as the expiration date of the permitted vehicle's registration.",
	"repealed": false
}