{
	"id": "504B.395",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.395",
	"title": "504B.395 PROCEDURE.",
	"text": "An action may be brought in district court by:\n(1) a residential tenant of a residential building in which a violation, as defined in section 504B.001, subdivision 14, is alleged to exist;\n(2) any housing-related neighborhood organization with the written permission of a residential tenant of a residential building in which a violation, as defined in section 504B.001, subdivision 14, clause (1) or (2), is alleged to exist;\n(3) a housing-related neighborhood organization that has within its geographical area an unoccupied residential building in which a violation, as defined in section 504B.001, subdivision 14, clause (1) or (2), is alleged to exist; or\n(4) a state, county, or local department or authority, charged with the enforcement of codes relating to health, housing, or building maintenance.\nThe venue of the action authorized by this section is the county where the residential building alleged to contain violations is located.\n(a) After a residential building inspection has been made under section 504B.185, an action may not be brought under sections 504B.381, 504B.385, or 504B.395 to 504B.451 until the time granted under section 504B.185, subdivision 2, has expired and satisfactory repairs to remove the code violations have not been made.\n(b) Notwithstanding paragraph (a), an action may be brought if the residential tenant, or neighborhood organization with the written permission of a tenant, alleges the time granted under section 504B.185, subdivision 2, is excessive.\nA landlord must be informed in writing of an alleged violation at least 14 days before an action is brought by:\n(1) a residential tenant of a residential building in which a violation as defined in section 504B.001, subdivision 14, clause (2) or (3), is alleged to exist; or\n(2) a housing-related neighborhood organization, with the written permission of a residential tenant of a residential building in which a violation, as defined in section 504B.001, subdivision 14, clause (2), is alleged to exist. The notice requirement may be waived if the court finds that the landlord cannot be located despite diligent efforts.\nThe action must be started by service of a complaint and summons. The summons may be issued only by a judge or court administrator.\n(a) The complaint must be verified and must:\n(1) allege material facts showing that a violation or violations exist in the residential building;\n(2) state the relief sought; and\n(3) list the rent due each month from each dwelling unit within the residential building, if known.\n(b) If the violation is a violation as defined in section 504B.001, subdivision 14, clause (1), the complaint must be accompanied by:\n(1) a copy of the official report of inspection by a department of health, housing, or buildings, certified by the custodian of records of that department stating:\n(i) when and by whom the residential building concerned was inspected;\n(ii) what code violations were recorded; and\n(iii) that notice of the code violations has been given to the landlord; or\n(2) a statement that a request for inspection was made to the appropriate state, county, or municipal department, that demand was made on the landlord to correct the alleged code violation, and that a reasonable period of time has elapsed since the demand or request was made.",
	"repealed": false
}