{
	"id": "182.659",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.659",
	"title": "182.659 INSPECTIONS.",
	"text": "In order to carry out the purposes of this chapter, the commissioner, upon presenting appropriate credentials to the owner, operator, or agent in charge, is authorized to enter without delay and at reasonable times any place of employment; and to inspect and investigate during regular working hours and at other reasonable times, and within reasonable limits and in a reasonable manner, any such place of employment and all pertinent conditions, structures, machines, apparatus, devices, equipment, and materials therein, and to question privately any such employer, owner, operator, agent or employee. An employer or its representatives, including but not limited to its management, attorneys, or consultants, may not be present for any employee interview.\nAn individual who is operating a crane on a worksite shall provide proof of certification required under section 182.6525 upon request by an investigator.\nIn making inspections and investigations under this chapter the commissioner shall have the power to administer oaths, certify as to official acts, take and cause to be taken depositions of witnesses, issue subpoenas, and compel the attendance of witnesses and production of papers, books, documents, records and testimony. In case of failure of any person to comply with any subpoena lawfully issued, or on the refusal of any witness to produce evidence or to testify to any matter regarding which the person may be lawfully interrogated, the district court shall, upon application of the commissioner, compel obedience proceedings for contempt, as in the case of disobedience of the requirements of a subpoena issued by the court or a refusal to testify therein.\nSubject to rules issued by the commissioner, a representative of the employer and a representative authorized by employees shall be given an opportunity to accompany the commissioner during the physical inspection of any workplace under subdivision 1 for the purpose of aiding such inspection. The authorized representative of employees shall also be given the opportunity to participate in any conference or discussion held prior to or during any such inspection. Where there is no authorized employee representative, the commissioner shall consult with a reasonable number of employees concerning matters of health and safety in the workplace. No employee as a consequence of aiding such inspection shall lose any privilege or payment that the employee would otherwise earn, such loss being a discriminatory act subject to the sanctions contained in section 182.669.\nAny employee or representative of employees who believes that a violation of a safety or health standard exists that threatens physical harm, or that an imminent danger exists, may request an inspection by giving notice to the commissioner of such violation or danger. Any such notice shall be reduced to writing, shall set forth with reasonable particularity the grounds for the notice, and shall be signed by the employee or representative of employees. A copy of the notice shall be provided the employer or agent no later than the time of the inspection, except that, upon the request of the person giving such notice, the employee's name and the names of individual employees referred to therein shall not appear in such copy or on any record published, released, or made available pursuant to section 182.663, subdivision 4. If upon receipt of such notification the commissioner determines that there are reasonable grounds to believe that such violation or danger exists, the commissioner shall make a special inspection in accordance with the provisions of this section as soon as practicable, to determine if such danger or violation exists. An inspection conducted pursuant to a complaint may cover all of the premises of the employer and shall not be limited to that portion of the premises specified in the notice. If the commissioner determines that there are no reasonable grounds to believe that such a violation or danger exists the commissioner shall notify the employee or representative of employees in writing of such determination. Upon such notification the employee or the employee representative may request the commissioner to reconsider the determination. Upon receiving such request the commissioner shall review the determination.\nPrior to or during any inspection of a workplace, any employee or representative of employees employed in such workplace may notify the commissioner, in writing, of any violation of this chapter which they have reason to believe exists in such workplace. The commissioner shall, by rule, establish procedures for informal review of any refusal by a representative of the commissioner to issue a citation with respect to any such alleged violation and shall furnish the employees or representative of employees requesting such review a written statement of the reasons for the commissioner's final disposition of the case.\nUpon the refusal or anticipated refusal, based on an employer's refusal to permit entrance on a prior occasion, of an owner, operator, or agent in charge to permit entry as specified in this chapter, the commissioner may apply for an order in the district court in the county in which a workplace is located, which compels the employer to permit the commissioner to enter and inspect the workplace.\n(a) Advance notice may not be authorized by the commissioner except:\n(1) in cases of apparent imminent danger to enable the employer to abate the danger as quickly as possible;\n(2) in circumstances where the inspection can most effectively be conducted after regular business hours or where special preparations are necessary for an inspection;\n(3) where necessary to assure the presence of representatives of the employer and employees or the appropriate personnel needed to aid in the inspection;\n(4) in other circumstances where the commissioner determines that the giving of advance notice would enhance the probability of an effective and thorough inspection; and\n(5) the reason for advance notice and the results will be recorded and retained on an appropriate form.\n(b) When advance notice is given to an employer, such notice shall also be given by the commissioner to the authorized representative of employees if the identity of such representative is known to the employer.\n(c) Violations of this subdivision are subject to the sanctions contained in section 182.667, subdivision 3.\nNeither the commissioner nor any current or former employee of the department is subject to subpoena for purposes of inquiry into any occupational safety and health inspection except in enforcement proceedings brought under this chapter. Data that identify individuals who provide data to the department as part of an investigation conducted under this chapter shall be private.",
	"repealed": false
}