{
	"id": "62W.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.09",
	"title": "62W.09 PHARMACY AUDITS.",
	"text": "(a) Unless otherwise prohibited by federal requirements or regulations, any entity conducting a pharmacy audit must follow the following procedures:\n(1) a pharmacy must be given notice 14 days before an initial on-site audit is conducted;\n(2) an audit that involves clinical or professional judgment must be conducted by or in consultation with a licensed pharmacist; and\n(3) each pharmacy shall be audited under the same standards and parameters as other similarly situated pharmacies.\n(b) Unless otherwise prohibited by federal requirements or regulations, for any entity conducting a pharmacy audit the following items apply:\n(1) the period covered by the audit may not exceed 24 months from the date that the claim was submitted to or adjudicated by the entity, unless a longer period is required under state or federal law;\n(2) if an entity uses random sampling as a method for selecting a set of claims for examination, the sample size must be appropriate for a statistically reliable sample. The auditing entity shall provide the pharmacy a masked list that provides a prescription number or date range that the auditing entity is seeking to audit;\n(3) an on-site audit may not take place during the first five business days of the month unless consented to by the pharmacy;\n(4) auditors may not enter the pharmacy area unless escorted where patient-specific information is available and to the extent possible must be out of sight and hearing range of the pharmacy customers;\n(5) any recoupment will not be deducted against future remittances until after the appeals process and both parties have received the results of the final audit;\n(6) a pharmacy benefit manager may not require information to be written on a prescription unless the information is required to be written on the prescription by state or federal law. Recoupment may be assessed for items not written on the prescription if:\n(i) additional information is required in the provider manual; or\n(ii) the information is required by the Food and Drug Administration (FDA); or\n(iii) the information is required by the drug manufacturer's product safety program; and\n(iv) the information in item (i), (ii), or (iii) is not readily available for the auditor at the time of the audit; and\n(7) the auditing company or agent may not receive payment based on a percentage of the amount recovered. This section does not prevent the entity conducting the audit from charging or assessing the responsible party, directly or indirectly, based on amounts recouped if both of the following conditions are met:\n(i) the plan sponsor and the entity conducting the audit have a contract that explicitly states the percentage charge or assessment to the plan sponsor; and\n(ii) a commission to an agent or employee of the entity conducting the audit is not based, directly or indirectly, on amounts recouped.\n(c) An amendment to pharmacy audit terms in a contract between a pharmacy benefit manager and a pharmacy must be disclosed to the pharmacy at least 60 days prior to the effective date of the proposed change.\nFor recoupment or chargeback, the following criteria apply:\n(1) audit parameters must consider consumer-oriented parameters based on manufacturer listings;\n(2) a pharmacy's usual and customary price for compounded medications is considered the reimbursable cost unless the pricing methodology is outlined in the pharmacy provider contract;\n(3) a finding of overpayment or underpayment must be based on the actual overpayment or underpayment and not a projection based on the number of patients served having a similar diagnosis or on the number of similar orders or refills for similar drugs;\n(4) the entity conducting the audit shall not use extrapolation in calculating the recoupment or penalties for audits unless required by state or federal law or regulations;\n(5) calculations of overpayments must not include dispensing fees unless a prescription was not actually dispensed, the prescriber denied authorization, the prescription dispensed was a medication error by the pharmacy, or the identified overpayment is solely based on an extra dispensing fee;\n(6) an entity may not consider any clerical or record-keeping error, such as a typographical error, scrivener's error, or computer error regarding a required document or record as fraud, however such errors may be subject to recoupment;\n(7) in the case of errors that have no actual financial harm to the patient or plan, the pharmacy benefit manager must not assess any chargebacks. Errors that are a result of the pharmacy failing to comply with a formal corrective action plan may be subject to recovery; and\n(8) interest may not accrue during the audit period for either party, beginning with the notice of the audit and ending with the final audit report.\n(a) To validate the pharmacy record and delivery, the pharmacy may use authentic and verifiable statements or records including medication administration records of a nursing home, assisted living facility, hospital, physician, or other authorized practitioner or additional audit documentation parameters located in the provider manual.\n(b) Any legal prescription that meets the requirements in this chapter may be used to validate claims in connection with prescriptions, refills, or changes in prescriptions, including medication administration records, faxes, e-prescriptions, or documented telephone calls from the prescriber or the prescriber's agents.\nThe entity conducting the audit must establish a written appeals process which must include appeals of preliminary reports and final reports.\n(a) A preliminary audit report must be delivered to the pharmacy within 60 days after the conclusion of the audit.\n(b) A pharmacy must be allowed at least 45 days following receipt of the preliminary audit to provide documentation to address any discrepancy found in the audit.\n(c) A final audit report must be delivered to the pharmacy within 120 days after receipt of the preliminary audit report or final appeal, whichever is later.\n(d) An entity shall remit any money due to a pharmacy or pharmacist as a result of an underpayment of a claim within 45 days after the appeals process has been exhausted and the final audit report has been issued.\nWhere contractually required, an auditing entity must provide a copy to the plan sponsor of its claims that were included in the audit, and any recouped money shall be returned to the plan sponsor.\nThis section does not apply to any investigative audit that involves suspected fraud, willful misrepresentation, abuse, or any audit completed by Minnesota health care programs.\nFor purposes of this section, \"entity\" means a pharmacy benefit manager or any person or organization that represents a pharmacy benefit manager.",
	"repealed": false
}