{
	"id": "260.692",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.692",
	"title": "260.692 AFRICAN AMERICAN CHILD WELL-BEING UNIT.",
	"text": "The African American Child Well-Being Unit, currently established by the commissioner, must:\n(1) assist with the development of African American cultural competency training and review child welfare curriculum in the Minnesota Child Welfare Training Academy to ensure that responsible social services agency staff and other child welfare professionals are appropriately prepared to engage with African American children and their families and to support family preservation and reunification;\n(2) provide technical assistance, including on-site technical assistance, and case consultation to responsible social services agencies to assist agencies with implementing and complying with the Minnesota African American Family Preservation and Child Welfare Disproportionality Act;\n(3) monitor individual county and statewide disaggregated and nondisaggregated data to identify trends and patterns in child welfare outcomes, including but not limited to reporting, maltreatment, out-of-home placement, and permanency of African American children and develop strategies to address disproportionality and disparities in the child welfare system;\n(4) develop and implement a system for conducting case reviews when the commissioner receives reports of noncompliance with the Minnesota African American Family Preservation and Child Welfare Disproportionality Act or when requested by the parent or custodian of an African American child. Case reviews may include but are not limited to a review of placement prevention efforts, safety planning, case planning and service provision by the responsible social services agency, relative placement consideration, and permanency planning;\n(5) establish and administer a request for proposals process for African American and disproportionately represented family preservation grants under section 260.693, monitor grant activities, and provide technical assistance to grantees;\n(6) in coordination with the African American Child Well-Being Advisory Council, coordinate services and create internal and external partnerships to support adequate access to services and resources for African American children and their families, including but not limited to housing assistance, employment assistance, food and nutrition support, health care, child care assistance, and educational support and training; and\n(7) develop public messaging and communication to inform the public about racial disparities in child welfare outcomes, current efforts and strategies to reduce racial disparities, and resources available to African American children and their families involved in the child welfare system.\n(a) The African American Child Well-Being Unit must conduct systemic case reviews to monitor targeted child welfare outcomes, including but not limited to maltreatment, out-of-home placement, and permanency of African American children.\n(b) The reviews under this subdivision must be conducted using a random sampling of representative child welfare cases stratified for certain case related factors, including but not limited to case type, maltreatment type, if the case involves out-of-home placement, and other demographic variables. In conducting the reviews, unit staff may use court records and documents, information from the social services information system, and other available case file information to complete the case reviews.\n(c) The frequency of the reviews and the number of cases, child welfare outcomes, and selected counties reviewed shall be determined by the unit in consultation with the African American Child Well-Being Advisory Council, with consideration given to the availability of unit resources needed to conduct the reviews.\n(d) The unit must monitor all case reviews and use the collective case review information and data to generate summary case review reports, ensure compliance with the Minnesota African American Family Preservation and Child Welfare Disproportionality Act, and identify trends or patterns in child welfare outcomes for African American children.\n(e) The unit must review information from members of the public received through the compliance and feedback portal, including policy and practice concerns related to individual child welfare cases. After assessing a case concern, the unit may determine if further necessary action should be taken, which may include coordinating case remediation with other relevant child welfare agencies in accordance with data privacy laws, including the African American Child Well-Being Advisory Council, and offering case consultation and technical assistance to the responsible local social services agency as needed or requested by the agency.\n(a) The African American Child Well-Being Unit must provide regular updates on unit activities, including summary reports of case reviews, to the African American Child Well-Being Advisory Council, and must publish an annual census of African American children in out-of-home placements statewide. The annual census must include data on the types of placements, age and sex of the children, how long the children have been in out-of-home placements, and other relevant demographic information.\n(b) The African American Child Well-Being Unit shall gather summary data about the practice and policy inquiries and individual case concerns received through the compliance and feedback portal under subdivision 2, paragraph (e). The unit shall provide regular reports of the nonidentifying compliance and feedback portal summary data to the African American Child Well-Being Advisory Council to identify child welfare trends and patterns to assist with developing policy and practice recommendations to support eliminating disparity and disproportionality for African American children.",
	"repealed": false
}