{
	"id": "80F.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/80F.01",
	"title": "80F.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given to them in this section.\n\"Affiliate\" means a person who controls, is controlled by, or is under common control with, any other person. Affiliate includes, without limitation, partners, business entities with common ownership, principals of any business entity, and subsidiaries, parent companies, or holding companies of any person.\n\"Dealer\" means a person permitted to market motor vehicle fuel pursuant to a marketing agreement.\n\"Facility\" means the premises which, under a marketing agreement, are to be used by a dealer in connection with the sale, consignment, and distribution of motor vehicle fuel to the public for ultimate consumption.\n\"Incentive\" or \"incentives\" means any rebates, volume credits, volume discounts, funds for construction, funds for reimaging, funds for equipment, funds for fixtures, funds for equipment or fixture upgrades, equipment, fixtures, or any other money or things of value provided by or passed through the supplier to a dealer and which are required by the terms of the agreement between the supplier and the dealer to be repaid by the dealer if the terms of the supply contract, whether oral or written, are not met.\n\"Motor vehicle fuel marketing agreement\" or \"marketing agreement\" means any contract, lease, or other agreement, whether that agreement is oral or written and whether it is express or implied, between a supplier or its affiliate and a dealer whereby a dealer is supplied motor vehicle fuel by a supplier or its affiliate for marketing from a facility under a brand name, trade name, service mark, logotype, or other commercial symbol or related characteristics owned or controlled by the supplier or its affiliate, or where the supplier or its affiliate authorizes or permits such use. The term includes any agreement between the supplier and its affiliate and the dealer to occupy or lease a facility, but does not include any agreement that meets the definition of a franchise under chapter 80C.\n\"Person\" means a natural person, corporation, partnership, trust, or other legal entity.\n\"Supplier\" means a person other than a refiner who supplies motor vehicle fuel to a dealer pursuant to a marketing agreement.",
	"repealed": false
}