{
	"id": "62W.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62W.03",
	"title": "62W.03 LICENSE TO DO BUSINESS.",
	"text": "(a) Beginning January 1, 2020, no person shall perform, act, or do business in this state as a pharmacy benefit manager unless the person has a valid license issued under this chapter by the commissioner of commerce.\n(b) A license issued in accordance with this chapter is nontransferable.\n(a) A pharmacy benefit manager seeking a license shall apply to the commissioner of commerce on a form prescribed by the commissioner. The application form must include at a minimum the following information:\n(1) the name, address, and telephone number of the pharmacy benefit manager;\n(2) the name and address of the pharmacy benefit manager agent for service of process in this state; and\n(3) the name, address, official position, and professional qualifications of each person responsible for the conduct of affairs of the pharmacy benefit manager, including all members of the board of directors, board of trustees, executive committee, or other governing board or committee; the principal officers in the case of a corporation; or the partners or members in the case of a partnership or association.\n(b) Each application for licensure must be accompanied by a nonrefundable fee of $8,500. The fees collected under this subdivision shall be deposited in the general fund.\n(c) Within 30 days of receiving an application, the commissioner may require additional information or submissions from an applicant and may obtain any document or information reasonably necessary to verify the information contained in the application. Within 90 days after receipt of a completed application, the network adequacy report required under section 62W.05, and the applicable license fee, the commissioner shall review the application and issue a license if the applicant is deemed qualified under this section. If the commissioner determines the applicant is not qualified, the commissioner shall notify the applicant and shall specify the reason or reasons for the denial.\n(a) A license issued under this chapter is valid for one year. To renew a license, an applicant must submit a completed renewal application on a form prescribed by the commissioner, the network adequacy report required under section 62W.05, and a renewal fee of $8,500. The fees collected under this paragraph shall be deposited in the general fund. The commissioner may request a renewal applicant to submit additional information to clarify any new information presented in the renewal application.\n(b) A renewal application submitted after the renewal deadline date must be accompanied by a nonrefundable late fee of $500. The fees collected under this paragraph shall be deposited in the general fund.\n(c) The commissioner may deny the renewal of a license for any of the following reasons:\n(1) the pharmacy benefit manager has been determined by the commissioner to be in violation or noncompliance with federal or state law; or\n(2) the pharmacy benefit manager has failed to timely submit a renewal application and the information required under paragraph (a).\nIn lieu of a denial of a renewal application, the commissioner may permit the pharmacy benefit manager to submit to the commissioner a corrective action plan to cure or correct deficiencies.\n(a) The commissioner may suspend, revoke, or place on probation a pharmacy benefit manager license issued under this chapter for any of the following circumstances:\n(1) the pharmacy benefit manager has engaged in fraudulent activity that constitutes a violation of state or federal law;\n(2) the commissioner has received consumer complaints that justify an action under this subdivision to protect the safety and interests of consumers;\n(3) the pharmacy benefit manager fails to pay an application license or renewal fee; and\n(4) the pharmacy benefit manager fails to comply with a requirement set forth in this chapter.\n(b) The commissioner may issue a license subject to restrictions or limitations, including the types of services that may be supplied or the activities in which the pharmacy benefit manager may be engaged.\nIf a pharmacy benefit manager acts without a license, the pharmacy benefit manager may be subject to a fine of $5,000 per day for the period the pharmacy benefit manager is found to be in violation. Any penalties collected under this subdivision shall be deposited in the general fund.\nThe commissioner shall enforce this chapter under the provisions of chapter 45.",
	"repealed": false
}