{
	"id": "383B.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.145",
	"title": "383B.145 COMPETITIVE BIDDING.",
	"text": "Competitive bidding for purchases under the provisions of sections 383B.141 to 383B.151 shall be performed in compliance with the uniform municipal contracting law, section 471.345, except as otherwise provided for herein.\nIn the case of an emergency arising from breakage, damage or decay or when the public interest would suffer by delay, purchases may be made without compliance with section 471.345, by the board or administrator if authority has been delegated to make purchases under sections 383B.141 to 383B.151. If the administrator makes the purchase, the board shall present the matter for ratification and record it in the official proceedings of the board at its next meeting.\nWhen, by reason of a copyright, patent or exclusive franchise, purchases can be made only at a standard, fixed or uniform price and no advantage can be secured by advertisement and competitive bidding because of the noncompetitive nature of the item to be purchased, section 471.345 shall not apply.\nContracts for professional, noncompetitive, unique, or shared medically related services provided for in the Hennepin County Hospital Act, Laws 1963, chapter 738, shall not be governed by the provisions of section 471.345.\n(a) Notwithstanding any other law to the contrary, the board may set aside an amount, for each fiscal year, for awarding contracts to businesses and social services organizations that employ persons who would be eligible for public assistance or who would require rehabilitative services in the absence of their employment. The set-aside amount may not exceed two percent of the amount appropriated by the board in the budget for the preceding fiscal year. Failure by the board to designate particular procurements for the set-aside program shall not prevent vendors from seeking the procurement award through the normal solicitation and bidding processes pursuant to the provisions of the Uniform Municipal Contracting Act, section 471.345.\n(b) The board may elect to use a negotiated price or bid contract procedure in the awarding of a procurement contract under the set-aside program. The amount of the award shall not exceed by more than five percent the estimated price for the goods or services, if they were to be purchased on the open market and not under the set-aside program.\n(c) Before contracting with a business or social service organization under the set-aside program, the board or authorized person shall conduct an investigation of the business or social service organization with whom it seeks to contract and shall make findings, to be contained in the provisions of the contract, that:\n(1) the vendor either:\n(i) has in its employ at least 50 percent of its employees who would be eligible to receive some form of public assistance or other rehabilitative services in the absence of the award of a contract to the vendor; or\n(ii) if the vendor is a business providing construction services, has in its employ to deliver the set-aside contract as many employees who would be eligible to receive some form of public assistance or other rehabilitative services in the absence of the award of a contract to the vendor as is practicable in consideration of industry safety standards, established supervisory ratios for apprentices, and requirements for licensed persons to perform certain work;\n(2) the vendor has elected to apply to the board for a contract under the set-aside provisions; and\n(3) the vendor is able to perform the set-aside contract.\n(d) The board shall publicize the provisions of the set-aside program, attempt to locate vendors able to perform set-aside procurement contracts and otherwise encourage participation therein.\nAll purchases of, and contracts for, goods, materials, supplies, equipment and services and all sales of personal property which has become obsolete and unusable, where the amount of the expenditure or sale is estimated to be $10,000 or more, shall be solicited by reasonable public notice under rules promulgated by the administrator with approval of the board. The administrator shall also solicit sealed bids by sending requests by mail to prospective vendors. Where by the provisions of sections 383B.141 to 383B.151, section 471.345 does not apply, the requirements of this subdivision shall not apply.\nAll bids estimated to cost $10,000 or more shall be sealed, in writing, accompanied by the required deposit and shall remain sealed until opened as provided by this subdivision. The bids shall be publicly opened by the administrator at a time and manner specified in the published advertisements for bids, shall be read aloud and tabulated by the administrator, or a designee. The administrator shall sign the tabulation immediately upon the close of the bid opening and retain a signed copy for public inspection.\nThe administrator shall award the contract to the lowest bid meeting specifications. On deeming that a bid other than the lowest bid is more advantageous to the county, the administrator shall recommend the award of the bid to the county board. The board may approve or disapprove the bid other than the lowest bid. On recommending a bid to the board other than the lowest bid, the administrator shall state the reasons therefor and provide documentation as the board may require. The documentation shall be available for public inspection.\nThe administrator shall have authority, upon approval by the county board, to transfer to or to accept personal property from any unit of government for no consideration or consideration as may be agreed upon without compliance with the uniform municipal contracting law or the advertising and bidding provisions in sections 383B.141 to 383B.151.\nAll bidders shall submit statements, on forms provided by the administrator, of noncollusion with all bids. Failure to provide the statement shall disqualify the bidder. Collusive bidding shall be punishable by a fine not to exceed $10,000 or imprisonment for a period up to five years, or both.\nNotwithstanding the contract threshold of section 471.345, subdivision 4, a contract, as defined in section 471.345, subdivision 2, estimated not to exceed $500,000 may be made pursuant to the provisions of section 471.345, subdivision 4, provided that a business that is directly solicited is certified as either: (1) a small business enterprise; or (2) a small business that is majority-owned and operated by a veteran or a service-disabled veteran.",
	"repealed": false
}