{
	"id": "203B.0815",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.0815",
	"title": "203B.0815 TEMPORARY LOCATIONS REIMBURSEMENTS; POSTSECONDARY INSTITUTIONS.",
	"text": "(a) The secretary of state must reimburse counties and cities that administer absentee voting for the actual costs of operating temporary polling locations on postsecondary institution campuses that provide on-campus student housing to 100 or more students. The reimbursement amount for an individual city or county must not exceed:\n(1) $5,000 for one polling location the first year it applies for a reimbursement under this section;\n(2) $3,000 for each additional polling location the first year it applies for a reimbursement under this section; and\n(3) $3,000 for each polling location in subsequent years.\nIf appropriations available to make reimbursements under this section are insufficient to fully make all reimbursements, the secretary must reduce all reimbursements proportionally. The unspent balance of an appropriation to make reimbursements under this section in the first fiscal year of a biennium may be carried forward into the second year of the biennium.\n(b) Expenses eligible for reimbursement under paragraph (a) include:\n(1) voting equipment purchasing and programming;\n(2) secure storage for voting equipment and supplies;\n(3) staff costs for election administrators, election judges, or other election officials;\n(4) ballot and voting materials printing;\n(5) set-up costs including transportation, parking, and office supplies;\n(6) voting booths; and\n(7) technology necessary to conduct voting at the polling location.\n(c) The secretary of state may make a reimbursement to a county or city only after receiving a completed application. The application must be submitted to the secretary of state on or before December 15 in the year in which the election was held. At a minimum, the application must contain the following information:\n(1) the name and title of the individual preparing the application;\n(2) the date the application is submitted;\n(3) the name of the county or city;\n(4) the following information about each temporary location:\n(i) the name of the postsecondary institution;\n(ii) the temporary location on campus;\n(iii) the date the polling location was open;\n(iv) the number of voters that cast ballots at the temporary location; and\n(v) whether the polling location was requested by the postsecondary institution or the student government organization or established by the county or city;\n(5) the total costs and itemized costs of establishing each temporary location; and\n(6) the total amount of the reimbursement requested.\n(d) By February 1 in the year following the election, the secretary of state must determine the amount of reimbursement to be made to each eligible county or city. The reimbursements must be distributed no later than February 15.\n(e) By February 1 each year, the secretary of state must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over elections policy on the reimbursements awarded under this section. The report must detail each reimbursement awarded, including the information in paragraph (c), clauses (2) to (6).\n(f) By June 30 in the second fiscal year of each biennium and after making all eligible reimbursements under paragraph (d), the secretary of state must transfer any remaining balance of appropriations for that purpose to the voting operations, technology, and election resources account established under section 5.305.",
	"repealed": false
}