{
	"id": "124E.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.22",
	"title": "124E.22 BUILDING LEASE AID.",
	"text": "(a) When a charter school finds it economically advantageous to rent or lease a building or land for any instructional purpose and it determines that the total operating capital revenue under section 126C.10, subdivision 13, is insufficient for this purpose, it may apply to the commissioner for building lease aid in the form and manner prescribed by the commissioner. The commissioner must review and either approve or deny a lease aid application using at least the following criteria:\n(1) the reasonableness of the price based on current market values;\n(2) the extent to which the lease conforms to applicable state laws and rules; and\n(3) the appropriateness of the proposed lease in the context of the space needs and financial circumstances of the charter school. The commissioner must approve aid only for a facility lease that has (i) a sum certain annual cost and (ii) a closure clause to relieve the charter school of its lease obligations at the time the charter contract is terminated or not renewed. The closure clause under item (ii) must not be constructed or construed to relieve the charter school of its lease obligations in effect before the charter contract is terminated or not renewed.\n(b) A charter school must not use the building lease aid it receives for custodial, maintenance service, utility, or other operating costs.\n(c) The amount of annual building lease aid for a charter school shall not exceed the lesser of (1) 90 percent of the approved cost or (2) the product of the charter school building lease aid pupil units served for the current school year times $1,314.\n(d) A charter school's building lease aid pupil units equals the sum of the charter school pupil units under section 126C.05 and the pupil units for the portion of the day that the charter school's enrolled students are participating in the Postsecondary Enrollment Options Act under section 124D.09 and not otherwise included in the pupil count under section 126C.05.",
	"repealed": false
}