{
	"id": "80A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.63",
	"title": "80A.63 SECTION 408; TERMINATION OF EMPLOYMENT OR ASSOCIATION OF AGENT AND TRANSFER OF EMPLOYMENT OR ASSOCIATION.",
	"text": "(a) Notice of termination. If an agent registered under this chapter terminates employment by or association with a broker-dealer or issuer, or terminates activities that require registration as an agent, the broker-dealer, or issuer shall promptly file a notice of termination. If the registrant learns that the broker-dealer or issuer has not filed the notice, the registrant may do so.\n(b) Transfer of employment or association. If an agent registered under this chapter terminates employment by or association with a broker-dealer registered under this chapter and begins employment by or association with another broker-dealer registered under this chapter, then upon the filing by or on behalf of the registrant, within 30 days after the termination, of an application for registration that complies with the requirement of section 80A.61(a) and payment of the filing fee required under section 80A.65, the registration of the agent is:\n(1) immediately effective as of the date of the completed filing, if the agent's Central Registration Depository record or successor record does not contain a new or amended disciplinary disclosure within the previous 12 months; or\n(2) temporarily effective as of the date of the completed filing, if the agent's Central Registration Depository record or successor record contains a new or amended disciplinary disclosure within the preceding 12 months.\n(c) Withdrawal of temporary registration. The administrator may withdraw a temporary registration if there are or were grounds for discipline as specified in section 80A.67 and the administrator does so within 30 days after the filing of the application. If the administrator does not withdraw the temporary registration within the 30-day period, registration becomes automatically effective on the 31st day after filing.\n(d) Power to prevent registration. The administrator may prevent the effectiveness of a transfer of an agent under subsection (b)(1) or (2) based on the public interest and the protection of investors.\n(e) Termination of registration or application for registration. If the administrator determines that a registrant or applicant for registration is no longer in existence or has ceased to act as a broker-dealer, agent, or investment adviser, or is the subject of an adjudication of incapacity or is subject to the control of a committee, conservator, or guardian, or cannot reasonably be located, a rule adopted or order issued under this chapter may require the registration be canceled or terminated or the application denied. The administrator may reinstate a canceled or terminated registration, with or without hearing, and may make the registration retroactive.",
	"repealed": false
}