{
	"id": "326B.89",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.89",
	"title": "326B.89 CONTRACTOR RECOVERY FUND.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Gross annual receipts\" means the total amount derived from residential contracting or residential remodeling activities, regardless of where the activities are performed, and must not be reduced by costs of goods sold, expenses, losses, or any other amount.\n(c) \"Licensee\" means a person licensed as a residential contractor or residential remodeler.\n(d) \"Residential real estate\" means a new or existing building constructed for habitation by one to four families, and includes detached garages intended for storage of vehicles associated with the residential real estate.\n(e) \"Fund\" means the contractor recovery fund.\n(f) \"Owner\" when used in connection with real property, means a person who has any legal or equitable interest in real property and includes a condominium or townhome association that owns common property located in a condominium building or townhome building or an associated detached garage. Owner does not include any real estate developer or any owner using, or intending to use, the property for a business purpose and not as owner-occupied residential real estate.\n(g) \"Cycle One\" means the time period between July 1 and December 31.\n(h) \"Cycle Two\" means the time period between January 1 and June 30.\nThe contractor recovery fund is created in the state treasury and shall be administered by the commissioner for the purposes described in this section. Any interest or profit accruing from investment of money in the fund shall be credited to the contractor recovery fund.\nIn addition to any other fees, a person who applies for or renews a license under sections 326B.802 to 326B.885 shall pay a fee to the fund. The person shall pay, in addition to the appropriate application or renewal fee, the following additional fee that shall be deposited in the fund. The amount of the fee shall be based on the person's gross annual receipts for the person's most recent fiscal year preceding the application or renewal, on the following scale:\n(a) The purpose of this fund is to:\n(1) compensate owners or lessees of residential real estate who meet the requirements of this section;\n(2) reimburse the department for all legal and administrative expenses, disbursements, and costs, including staffing costs, incurred in administering and defending the fund;\n(3) pay for educational or research projects in the field of residential contracting to further the purposes of sections 326B.801 to 326B.825; and\n(4) provide information to the public on residential contracting issues.\n(b) No money from this fund may be transferred or spent unless the commissioner determines that the money is being transferred or spent for one of the purposes in paragraph (a).\nThe commissioner shall not pay compensation from the fund to an owner or a lessee in an amount greater than $100,000 per licensee. The commissioner shall not pay compensation from the fund to owners and lessees in an amount that totals more than $550,000 per licensee. The commissioner shall only pay compensation from the fund for a final judgment that is based on a contract directly between the licensee and the homeowner or lessee that was entered into prior to the cause of action and that requires licensure as a residential building contractor or residential remodeler.\nTo be eligible for compensation from the fund, an owner or lessee shall serve on the commissioner a verified application for compensation on a form approved by the commissioner. The application shall verify the following information:\n(1) the specific grounds upon which the owner or lessee seeks to recover from the fund;\n(2) that the owner or the lessee has obtained a final judgment in a court of competent jurisdiction against a licensee licensed under section 326B.83;\n(3) that the final judgment was obtained against the licensee on the grounds of fraudulent, deceptive, or dishonest practices, conversion of funds, or failure of performance that arose directly out of a contract directly between the licensee and the homeowner or lessee that was entered into prior to the cause of action and that occurred when the licensee was licensed and performing any of the special skills enumerated under section 326B.802, subdivision 15;\n(4) the amount of the owner's or the lessee's actual and direct out-of-pocket loss on the owner's residential real estate, on residential real estate leased by the lessee, or on new residential real estate that has never been occupied or that was occupied by the licensee for less than one year prior to purchase by the owner;\n(5) that the residential real estate is located in Minnesota;\n(6) that the owner or the lessee is not the spouse of the licensee or the personal representative of the licensee;\n(7) the amount of the final judgment, any amount paid in satisfaction of the final judgment, and the amount owing on the final judgment as of the date of the verified application;\n(8) that the owner or lessee has diligently pursued remedies against all the judgment debtors and all other persons liable to the judgment debtor in the contract for which the owner or lessee seeks recovery from the fund; and\n(9) that the verified application is being served within two years after the judgment became final.\nThe verified application must include documents evidencing the amount of the owner's or the lessee's actual and direct out-of-pocket loss. The owner's and the lessee's actual and direct out-of-pocket loss shall not include any attorney fees, litigation costs or fees, interest on the loss, and interest on the final judgment obtained as a result of the loss or any costs not directly related to the value difference between what was contracted for and what was provided. Any amount paid in satisfaction of the final judgment shall be applied to the owner's or lessee's actual and direct out-of-pocket loss. An owner or lessee may serve a verified application regardless of whether the final judgment has been discharged by a bankruptcy court. A judgment issued by a court is final if all proceedings on the judgment have either been pursued and concluded or been forgone, including all reviews and appeals. For purposes of this section, owners who are joint tenants or tenants in common are deemed to be a single owner. For purposes of this section, owners and lessees eligible for payment of compensation from the fund shall not include government agencies, political subdivisions, financial institutions, and any other entity that purchases, guarantees, or insures a loan secured by real estate.\nThe commissioner shall within 120 days after receipt of the complete verified application:\n(1) enter into an agreement with an owner or a lessee that resolves the verified application for compensation from the fund; or\n(2) issue an order to the owner or the lessee accepting, modifying, or denying the verified application for compensation from the fund.\nUpon receipt of an order issued under clause (2), the owner or the lessee shall have 30 days to serve upon the commissioner a written request for a hearing. If the owner or the lessee does not serve upon the commissioner a timely written request for hearing, the order issued under clause (2) shall become a final order of the commissioner that may not be reviewed by any court or agency. The commissioner shall order compensation from the fund only if the owner or the lessee has filed a verified application that complies with subdivision 6 and if the commissioner determines based on review of the application that compensation should be paid from the fund. The commissioner shall not be bound by any prior settlement, compromise, or stipulation between the owner or the lessee and the licensee.\nIf an owner or a lessee timely serves a request for hearing under subdivision 7, the commissioner shall request that an administrative law judge be assigned and that a hearing be conducted under the contested case provisions of chapter 14 within 45 days after the commissioner received the request for hearing, unless the parties agree to a later date. The commissioner must notify the owner or lessee of the time and place of the hearing at least 15 days before the hearing. Upon petition of the commissioner, the administrative law judge shall continue the hearing up to 60 days and upon a showing of good cause may continue the hearing for such additional period as the administrative law judge deems appropriate.\nAt the hearing the owner or the lessee shall have the burden of proving by substantial evidence under subdivision 6, clauses (1) to (8). Whenever an applicant's judgment is by default, stipulation, or consent, or whenever the action against the licensee was defended by a trustee in bankruptcy, the applicant shall have the burden of proving the cause of action for fraudulent, deceptive, or dishonest practices, conversion of funds, or failure of performance. Otherwise, the judgment shall create a rebuttable presumption of the fraudulent, deceptive, or dishonest practices, conversion of funds, or failure of performance. This presumption affects the burden of producing evidence.\nThe administrative law judge shall issue findings of fact, conclusions of law, and order. If the administrative law judge finds that compensation should be paid to the owner or the lessee, the administrative law judge shall order the commissioner to make payment from the fund of the amount it finds to be payable pursuant to the provisions of and in accordance with the limitations contained in this section. The order of the administrative law judge shall constitute the final decision of the agency in the contested case. The commissioner or the owner or lessee may seek judicial review of the administrative law judge's findings of fact, conclusions of law, and order in accordance with sections 14.63 to 14.69.\nThe commissioner shall pay compensation from the fund to an owner or a lessee pursuant to the terms of an agreement that has been entered into under subdivision 7, clause (1), or pursuant to a final order that has been issued under subdivision 7, clause (2), or subdivision 8 by December 31 for applications submitted by July 1 or June 30 for applications submitted by January 1 of the fiscal year. The commissioner shall not pay compensation to owners or lessees that totals more than $275,000 per licensee during Cycle One of a fiscal year nor shall the commissioner pay out during Cycle One if the payout will result in the exhaustion of a licensee's fund. If compensation paid to owners or lessees in Cycle One would total more than $275,000 or would result in exhaustion of a licensee's fund in Cycle One, the commissioner shall not make a final determination of compensation for claims against the licensee until the completion of Cycle Two. If the claims against a licensee for the fiscal year result in the exhaustion of a licensee's fund or the fund as a whole, the commissioner must prorate the amount available among the owners and lessees based on the amount agreed to or ordered to be paid to each owner or lessee. The commissioner shall mail notice of the proration to all owners and lessees no later than March 31 of the current fiscal year. Any compensation paid by the commissioner in accordance with this subdivision shall be deemed to satisfy and extinguish any right to compensation from the fund based upon the verified application of the owner or lessee.\nNotwithstanding subdivisions 1 to 9 and 11 to 16, the commissioner shall not pay compensation from the fund to an owner or lessee unless and until the owner or lessee executes an assignment to the commissioner of all rights, title, and interest in the final judgment in the amount of the compensation to be paid under an agreement under subdivision 7, clause (1), or a final order issued under subdivision 7, clause (2), or subdivision 8. If the commissioner pays compensation from the fund to an owner or a lessee pursuant to an agreement under subdivision 7, clause (1), or a final order issued under subdivision 7, clause (2), or subdivision 8, then the commissioner shall be subrogated to all of the rights, title, and interest in the owner's or lessee's final judgment in the amount of compensation paid from the fund. The commissioner shall deposit in the fund money recovered under this subdivision.\nNothing contained in this section shall limit the authority of the commissioner to take disciplinary action against a licensee under the provisions of this chapter. A licensee's repayment in full of obligations to the fund shall not nullify or modify the effect of any other disciplinary proceeding brought under the provisions of this chapter.\nNotwithstanding subdivision 5, nothing may obligate the fund for claims brought by:\n(1) insurers or sureties under subrogation or similar theories; or\n(2) owners of residential property where the contracting activity complained of was the result of a contract entered into with a prior owner, unless the claim is brought and judgment is rendered for breach of the statutory warranty set forth in chapter 327A.\n(a) For purposes of this section, the terms \"owner\" and \"lessee\" of residential real estate include the following, regardless of the number of residential units per building:\n(1) an owner or lessee of an apartment as defined in and governed by chapter 515;\n(2) an owner or lessee of a unit in a common interest community created under or governed by chapter 515B;\n(3) an owner or lessee of a unit in a planned community or cooperative created prior to June 1, 1994, that has not elected to be governed by chapter 515B;\n(4) an association or master association, as defined in chapter 515B, that owns or leases the common elements of a common interest community; and\n(5) a homeowners association that owns or leases the common elements in a planned community or cooperative created prior to June 1, 1994, that has not elected to be governed by chapter 515B.\n(b) For purposes of this subdivision, \"common elements\" means common areas and facilities as defined in chapter 515 and common elements as defined in chapter 515B.\n[Repealed, 2017 c 94 art 2 s 19]\nMoney in the fund is appropriated to the commissioner for the purposes of this section.\nIf the balance in the fund is at any time less than the commissioner determines is necessary to carry out the purposes of this section, every licensee, when renewing a license, shall pay, in addition to the annual renewal fee and the fee set forth in subdivision 3, an assessment not to exceed $200. The commissioner shall set the amount of assessment based on a reasonable determination of the amount that is necessary to restore a balance in the fund adequate to carry out the purposes of this section.\nIf the commissioner pays compensation from the fund on the basis of any false or misleading information provided to the commissioner in connection with the application for compensation, then, upon the application of the commissioner, a district court shall order the owner or lessee to repay to the fund all such compensation paid from the fund. In addition, the state may be allowed an amount determined by the court to be the reasonable value of all or part of the litigation expenses, including attorney fees, incurred by the state. The commissioner shall deposit in the fund money recovered under this subdivision.\nIf an owner or lessee violates section 326B.084 in connection with an application for compensation from the fund, and if the commissioner issues to the owner or lessee an administrative order under section 326B.082, subdivision 7, for that violation of section 326B.084, then the commissioner shall deposit in the fund all penalties paid pursuant to the administrative order.",
	"repealed": false
}