{
	"id": "340A.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.405",
	"title": "340A.405 INTOXICATING LIQUOR; OFF-SALE LICENSES.",
	"text": "(a) A city other than a city of the first class may issue with the approval of the commissioner, an off-sale intoxicating liquor license to an exclusive liquor store, or to a drugstore to which an off-sale license had been issued on or prior to May 1, 1994.\n(b) A city of the first class may issue an off-sale license to an exclusive liquor store, a general food store to which an off-sale license had been issued on August 1, 1989, or a drugstore to which an off-sale license had been issued on or prior to May 1, 1994.\n(a) A county may issue an off-sale intoxicating license with the approval of the commissioner to exclusive liquor stores located within unorganized territory of the county.\n(b) A county board of any county except Ramsey County containing a town exercising powers under section 368.01, subdivision 1, may issue an off-sale license to an exclusive liquor store within that town with the approval of the commissioner. No license may be issued under this paragraph unless the town board adopts a resolution supporting the issuance of the license.\n(c) A county board of any county except Ramsey County containing a town that may not exercise powers under section 368.01, subdivision 1, may issue an off-sale license to an exclusive liquor store within that town, or a combination off-sale and on-sale license to a restaurant within that town, with the approval of the commissioner pursuant to section 340A.404, subdivision 6. No license may be issued under this paragraph unless the town board adopts a resolution supporting the issuance of the license.\n(d) No license may be issued under this subdivision unless a public hearing is held on the issuance of the license. Notice must be given to all interested parties and to any city located within three miles of the premises proposed to be licensed. At the hearing the county board shall consider testimony and exhibits presented by interested parties and may base its decision to issue or deny a license upon the nature of the business to be conducted and its impact upon any municipality, the character and reputation of the applicant, and the propriety of the location. Any hearing held under this paragraph is not subject to chapter 14.\n(e) A county board may not issue a license under this subdivision to a person for an establishment located less than one mile by the most direct route from the boundary of any statutory or home rule city that had established a municipal liquor store before August 1, 1991, provided, that a county board may not issue a new license under this subdivision to a person for an establishment located less than three miles by the most direct route from the boundary of a city that (1) is located outside the metropolitan area as defined in section 473.121, subdivision 2, (2) has a population over 5,000 according to the most recent federal decennial census, and (3) had established a municipal liquor store before August 1, 1991.\n(f) The town board may impose an additional license fee in an amount not to exceed 20 percent of the county license fee.\n(g) Notwithstanding any provision of this subdivision or Laws 1973, chapter 566, as amended by Laws 1974, chapter 200, a county board may transfer or renew a license that was issued by a town board under Minnesota Statutes 1984, section 340.11, subdivision 10b, prior to January 1, 1985.\nThe town board of a town within Ramsey County exercising powers under section 368.01, subdivision 1, within Ramsey County may issue an off-sale intoxicating liquor license with the approval of the commissioner to an exclusive liquor store located within the town.\n(a) The governing body of a city or county may issue a temporary license for the off-sale of wine at an auction with the approval of the commissioner. A license issued under this subdivision authorizes the sale of only vintage wine of a brand and vintage that is not commonly being offered for sale by any wholesaler in Minnesota. The license may authorize the off-sale of wine for not more than three consecutive days provided not more than 600 cases of wine are sold at any auction. The licenses are subject to the terms, including license fee, imposed by the issuing city or county. Licenses issued under this subdivision are subject to all laws and ordinances governing the sale of intoxicating liquor except section 340A.409 and those laws and ordinances which by their nature are not applicable.\n(b) As used in the subdivision, \"vintage wine\" means bottled wine which is at least five years old.\nMS 1988 [Repealed, 1990 c 554 s 22]\nThe Metropolitan Airports Commission may with the approval of the commissioner issue licenses for the off-sale of wine at the Minneapolis-St. Paul International Airport.",
	"repealed": false
}