{
	"id": "473.614",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.614",
	"title": "473.614 ENVIRONMENTAL REVIEW.",
	"text": "The commission shall prepare an assessment of the environmental effects of projects in the commission's seven-year capital improvement program and plan at each airport owned and operated by the commission. The assessment must examine the cumulative environmental effects at each airport of the projects at that airport, considered collectively. The commission need not prepare an assessment for an airport when the capital improvement program and plan for that airport has not changed from the one adopted the previous year or when the changes in the program and plan will have only trivial environmental effects.\n(a) The commission shall prepare environmental assessment worksheets under chapter 116D, and rules issued pursuant thereto, on the environmental effects of projects in the commission's capital improvement program at each airport owned and operated by the commission. The scope of the environmental assessment worksheets required by this section is limited to only those projects in the program for an airport that meet all of the following conditions:\n(1) The project is scheduled in the program for the succeeding calendar period.\n(2) The project is scheduled in the program for the expenditure of $5,000,000 or more at Minneapolis-St. Paul International Airport or $2,000,000 or more at any other airport.\n(3) The project involves: (i) the construction of a new or expanded structure for handling passengers, cargo, vehicles, or aircraft; or (ii) the construction of a new or the extension of an existing runway or taxiway.\nAfter adopting its capital program, the commission may amend the program by adding or changing a project without amending or redoing the worksheets required by this subdivision, if the project to be added or the change to be made is one that the commission could not reasonably have foreseen at the time that it completed the worksheets.\n(b) For the purpose of determining the need for an environmental impact statement, the commission shall consider the projects included in the scope of a worksheet as a single project and shall assess their environmental effects collectively and cumulatively. The commission's decision on whether an environmental impact statement is needed must be based on the worksheet and comments. The commission may not base a decision that an environmental impact statement is not needed on exemptions of projects in state or federal rules. The commission is not required to prepare an environmental impact statement on an individual project, or to include a project in the scope of an environmental impact statement that the commission determines is needed, if the project is shown in the worksheet to have trivial environmental effects or if an environmental impact statement on the project has been determined to be adequate under state law.\n(c) The commission may incorporate into worksheets information from the commission's long-range plans, environmental assessments prepared under subdivision 1, or other environmental documents prepared on projects under state or federal law.\nNotwithstanding the provisions of subdivision 2, the commission shall prepare a report documenting the environmental effects of projects included in the MSP 2010 long-term comprehensive plan. Environmental effects of and costs associated with, noise impacts, noise mitigation measures, and land use compatibility measures must be evaluated according to alternative assumptions of 600,000, 650,000, 700,000, and 750,000 aircraft operations at Minneapolis-St. Paul International Airport.\n(a) The environmental assessments required under subdivision 1 and the environmental assessment worksheets required under subdivision 2 must be prepared each year before the commission adopts its capital improvement plan and program.\n(b) The commission shall hold a public hearing on each environmental assessment and worksheet before adopting the capital improvement plan and program. The commission may consolidate hearings.\n(c) The initial environmental assessments and worksheets must be completed before the commission adopts its capital improvement plan and program for calendar years 1989 to 1995, but the initial assessments and worksheets must extend to and incorporate projects under construction in calendar year 1988. A project that is under construction in 1988 may proceed, but the project must be included in the environmental review required by this section as if the project were scheduled for the succeeding calendar year. The commission is not required to prepare an environmental impact statement on an individual project, or to include a project in the scope of an environmental impact statement that the commission determines is needed, if: (1) the project is under construction in 1988, or (2) on April 27, 1988, the project is included in the commission's capital program for 1988 and 1989 and an environmental review is under way on the project individually under state or federal law.\nNothing in this section limits the responsibility of the commission or any other governmental unit or agency, under any other law or regulation, to conduct environmental review of any project, decision, or recommendation, except that the environmental assessment worksheets prepared under subdivision 2 satisfy the requirements under state law or rule for environmental assessment worksheets on individual projects covered by the worksheets prepared under subdivision 2.",
	"repealed": false
}