{
	"id": "144A.474",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.474",
	"title": "144A.474 SURVEYS AND INVESTIGATIONS.",
	"text": "The commissioner shall conduct surveys of each home care provider. By June 30, 2016, the commissioner shall conduct a survey of home care providers on a frequency of at least once every three years. Survey frequency may be based on the license level, the provider's compliance history, the number of clients served, or other factors as determined by the department deemed necessary to ensure the health, safety, and welfare of clients and compliance with the law.\n(a) \"Initial full survey\" means the survey of a new temporary licensee conducted after the department is notified or has evidence that the temporary licensee is providing home care services to determine if the provider is in compliance with home care requirements. Initial full surveys must be completed within 14 months after the department's issuance of a temporary basic or comprehensive license.\n(b) \"Change in ownership survey\" means a full survey of a new licensee due to a change in ownership. Change in ownership surveys must be completed within six months after the department's issuance of a new license due to a change in ownership.\n(c) \"Core survey\" means periodic inspection of home care providers to determine ongoing compliance with the home care requirements, focusing on the essential health and safety requirements. Core surveys are available to licensed home care providers who have been licensed for three years and surveyed at least once in the past three years with the latest survey having no widespread violations beyond Level 1 as provided in subdivision 11. Providers must also not have had any substantiated licensing complaints, substantiated complaints against the agency under the Vulnerable Adults Act or Maltreatment of Minors Act, or an enforcement action as authorized in section 144A.475 in the past three years.\n(1) The core survey for basic home care providers must review compliance in the following areas:\n(i) reporting of maltreatment;\n(ii) orientation to and implementation of the home care bill of rights;\n(iii) statement of home care services;\n(iv) initial evaluation of clients and initiation of services;\n(v) client review and monitoring;\n(vi) service plan implementation and changes to the service plan;\n(vii) client complaint and investigative process;\n(viii) competency of unlicensed personnel; and\n(ix) infection control.\n(2) For comprehensive home care providers, the core survey must include everything in the basic core survey plus these areas:\n(i) delegation to unlicensed personnel;\n(ii) assessment, monitoring, and reassessment of clients; and\n(iii) medication, treatment, and therapy management.\n(d) \"Full survey\" means the periodic inspection of home care providers to determine ongoing compliance with the home care requirements that cover the core survey areas and all the legal requirements for home care providers. A full survey is conducted for all temporary licensees, for licensees that receive licenses due to an approved change in ownership, for providers who do not meet the requirements needed for a core survey, and when a surveyor identifies unacceptable client health or safety risks during a core survey. A full survey must include all the tasks identified as part of the core survey and any additional review deemed necessary by the department, including additional observation, interviewing, or records review of additional clients and staff.\n(e) \"Follow-up surveys\" means surveys conducted to determine if a home care provider has corrected deficient issues and systems identified during a core survey, full survey, or complaint investigation. Follow-up surveys may be conducted via phone, email, fax, mail, or on-site reviews. Follow-up surveys, other than complaint surveys, shall be concluded with an exit conference and written information provided on the process for requesting a reconsideration of the survey results.\n(f) Upon receiving information alleging that a home care provider has violated or is currently violating a requirement of sections 144A.43 to 144A.482, the commissioner shall investigate the complaint according to sections 144A.51 to 144A.54.\nThe survey process for core surveys shall include the following as applicable to the particular licensee and setting surveyed:\n(1) presurvey review of pertinent documents and notification to the ombudsman for long-term care;\n(2) an entrance conference with available staff;\n(3) communication with managerial officials or the registered nurse in charge, if available, and ongoing communication with key staff throughout the survey regarding information needed by the surveyor, clarifications regarding home care requirements, and applicable standards of practice;\n(4) presentation of written contact information to the provider about the survey staff conducting the survey, the supervisor, and the process for requesting a reconsideration of the survey results;\n(5) a brief tour of the establishment in which the provider is providing home care services;\n(6) a sample selection of home care clients;\n(7) information-gathering through client and staff observations, client and staff interviews, and reviews of records, policies, procedures, practices, and other agency information;\n(8) interviews of clients' family members, if available, with clients' consent when the client can legally give consent;\n(9) except for complaint surveys conducted by the Office of Health Facilities Complaints, an exit conference with preliminary findings discussed with the provider within one business day after completion of survey activities, and with written information provided on the process for requesting a reconsideration of the survey results; and\n(10) postsurvey analysis of findings and formulation of survey results, including correction orders when applicable.\nSurveys and investigations shall be conducted without advance notice to home care providers. Surveyors may contact the home care provider on the day of a survey to arrange for someone to be available at the survey site. The contact does not constitute advance notice.\nThe home care provider shall provide accurate and truthful information to the department during a survey, investigation, or other licensing activities.\nUpon request of a surveyor, home care providers shall provide a list of current and past clients or client representatives that includes addresses and telephone numbers and any other information requested about the services to clients within a reasonable period of time.\nSurveyors may contact or visit a home care provider's clients to gather information without notice to the home care provider. Before visiting a client, a surveyor shall obtain the client's or client's representative's permission by telephone, by mail, or in person. Surveyors shall inform all clients or client's representatives of their right to decline permission for a visit.\n(a) A correction order may be issued whenever the commissioner finds upon survey or during a complaint investigation that a home care provider, a managerial official, or an employee of the provider is not in compliance with sections 144A.43 to 144A.482. The correction order shall cite the specific statute and document areas of noncompliance and the time allowed for correction.\n(b) The commissioner shall mail copies of any correction order to the last known address of the home care provider, or electronically scan the correction order and email it to the last known home care provider email address, within 30 calendar days after the survey exit date. A copy of each correction order and copies of any documentation supplied to the commissioner shall be kept on file by the home care provider, and public documents shall be made available for viewing by any person upon request. Copies may be kept electronically.\n(c) By the correction order date, the home care provider must document in the provider's records any action taken to comply with the correction order. The commissioner may request a copy of this documentation and the home care provider's action to respond to the correction order in future surveys, upon a complaint investigation, and as otherwise needed.\nFor providers that have Level 3 or Level 4 violations under subdivision 11, the department shall conduct a follow-up survey within 90 calendar days of the survey. When conducting a follow-up survey, the surveyor will focus on whether the previous violations have been corrected and may also address any new violations that are observed while evaluating the corrections that have been made.\nA licensee is eligible for a performance incentive if there are no violations identified in a core or full survey. The performance incentive is a ten percent discount on the licensee's next home care renewal license fee.\n(a) Fines and enforcement actions under this subdivision may be assessed based on the level and scope of the violations described in paragraph (b) and imposed immediately with no opportunity to correct the violation first as follows:\n(1) Level 1, no fines or enforcement;\n(2) Level 2, a fine of $500 per violation, in addition to any of the enforcement mechanisms authorized in section 144A.475 for widespread violations;\n(3) Level 3, a fine of $3,000 per incident, in addition to any of the enforcement mechanisms authorized in section 144A.475;\n(4) Level 4, a fine of $5,000 per incident, in addition to any of the enforcement mechanisms authorized in section 144A.475;\n(5) for maltreatment violations for which the licensee was determined to be responsible for the maltreatment under section 626.557, subdivision 9c, paragraph (c), a fine of $1,000. A fine of $5,000 may be imposed if the commissioner determines the licensee is responsible for maltreatment consisting of sexual assault, death, or abuse resulting in serious injury; and\n(6) the fines in clauses (1) to (4) are increased and immediate fine imposition is authorized for both surveys and investigations conducted.\nWhen a fine is assessed against a facility for substantiated maltreatment, the commissioner shall not also impose an immediate fine under this chapter for the same circumstance.\n(b) Correction orders for violations are categorized by both level and scope and fines shall be assessed as follows:\n(1) level of violation:\n(i) Level 1 is a violation that has no potential to cause more than a minimal impact on the client and does not affect health or safety;\n(ii) Level 2 is a violation that did not harm a client's health or safety but had the potential to have harmed a client's health or safety, but was not likely to cause serious injury, impairment, or death;\n(iii) Level 3 is a violation that harmed a client's health or safety, not including serious injury, impairment, or death, or a violation that has the potential to lead to serious injury, impairment, or death; and\n(iv) Level 4 is a violation that results in serious injury, impairment, or death;\n(2) scope of violation:\n(i) isolated, when one or a limited number of clients are affected or one or a limited number of staff are involved or the situation has occurred only occasionally;\n(ii) pattern, when more than a limited number of clients are affected, more than a limited number of staff are involved, or the situation has occurred repeatedly but is not found to be pervasive; and\n(iii) widespread, when problems are pervasive or represent a systemic failure that has affected or has the potential to affect a large portion or all of the clients.\n(c) If the commissioner finds that the applicant or a home care provider has not corrected violations by the date specified in the correction order or conditional license resulting from a survey or complaint investigation, the commissioner shall provide a notice of noncompliance with a correction order by email to the applicant's or provider's last known email address. The noncompliance notice must list the violations not corrected.\n(d) For every violation identified by the commissioner, the commissioner shall issue an immediate fine pursuant to paragraph (a), clause (6). The license holder must still correct the violation in the time specified. The issuance of an immediate fine can occur in addition to any enforcement mechanism authorized under section 144A.475. The immediate fine may be appealed as allowed under this subdivision.\n(e) The license holder must pay the fines assessed on or before the payment date specified. If the license holder fails to fully comply with the order, the commissioner may issue a second fine or suspend the license until the license holder complies by paying the fine. A timely appeal shall stay payment of the fine until the commissioner issues a final order.\n(f) A license holder shall promptly notify the commissioner in writing when a violation specified in the order is corrected. If upon reinspection the commissioner determines that a violation has not been corrected as indicated by the order, the commissioner may issue a second fine. The commissioner shall notify the license holder by mail to the last known address in the licensing record that a second fine has been assessed. The license holder may appeal the second fine as provided under this subdivision.\n(g) A home care provider that has been assessed a fine under this subdivision has a right to a reconsideration or a hearing under this section and chapter 14.\n(h) When a fine has been assessed, the license holder may not avoid payment by closing, selling, or otherwise transferring the licensed program to a third party. In such an event, the license holder shall be liable for payment of the fine.\n(i) In addition to any fine imposed under this section, the commissioner may assess a penalty amount based on costs related to an investigation that results in a final order assessing a fine or other enforcement action authorized by this chapter.\n(j) Fines collected under paragraph (a), clauses (1) to (4), shall be deposited in a dedicated special revenue account. On an annual basis, the balance in the special revenue account shall be appropriated to the commissioner to implement the recommendations of the advisory council established in section 144A.4799.\n(k) Fines collected under paragraph (a), clause (5), shall be deposited in a dedicated special revenue account and appropriated to the commissioner to provide compensation according to subdivision 14 to clients subject to maltreatment. A client may choose to receive compensation from this fund, not to exceed $5,000 for each substantiated finding of maltreatment, or take civil action. This paragraph expires July 31, 2021.\n(a) The commissioner shall make available to home care providers a correction order reconsideration process. This process may be used to challenge the correction order issued, including the level and scope described in subdivision 11, and any fine assessed. During the correction order reconsideration request, the issuance for the correction orders under reconsideration are not stayed, but the department shall post information on the website with the correction order that the licensee has requested a reconsideration and that the review is pending.\n(b) A licensed home care provider may request from the commissioner, in writing, a correction order reconsideration regarding any correction order issued to the provider. The written request for reconsideration must be received by the commissioner within 15 business days of the correction order receipt date. The correction order reconsideration shall not be reviewed by any surveyor, investigator, or supervisor that participated in the writing or reviewing of the correction order being disputed. The correction order reconsiderations may be conducted in person, by telephone, by another electronic form, or in writing, as determined by the commissioner. The commissioner shall respond in writing to the request from a home care provider for a correction order reconsideration within 60 days of the date the provider requests a reconsideration. The commissioner's response shall identify the commissioner's decision regarding each citation challenged by the home care provider.\n(c) The findings of a correction order reconsideration process shall be one or more of the following:\n(1) supported in full, the correction order is supported in full, with no deletion of findings to the citation;\n(2) supported in substance, the correction order is supported, but one or more findings are deleted or modified without any change in the citation;\n(3) correction order cited an incorrect home care licensing requirement, the correction order is amended by changing the correction order to the appropriate statutory reference;\n(4) correction order was issued under an incorrect citation, the correction order is amended to be issued under the more appropriate correction order citation;\n(5) the correction order is rescinded;\n(6) fine is amended, it is determined that the fine assigned to the correction order was applied incorrectly; or\n(7) the level or scope of the citation is modified based on the reconsideration.\n(d) If the correction order findings are changed by the commissioner, the commissioner shall update the correction order website.\n(e) This subdivision does not apply to temporary licensees.\n(a) Before conducting a home care survey, each home care surveyor must receive training on the following topics:\n(1) Minnesota home care licensure requirements;\n(2) Minnesota home care bill of rights;\n(3) Minnesota Vulnerable Adults Act and reporting of maltreatment of minors;\n(4) principles of documentation;\n(5) survey protocol and processes;\n(6) Offices of the Ombudsman roles;\n(7) Office of Health Facility Complaints;\n(8) Minnesota landlord-tenant laws;\n(9) types of payors for home care services; and\n(10) Minnesota Nurse Practice Act for nurse surveyors.\n(b) Materials used for the training in paragraph (a) shall be posted on the department website. Requisite understanding of these topics will be reviewed as part of the quality improvement plan in section 144A.483.\nMS 2020 [Expired, 2019 c 60 art 4 s 22]",
	"repealed": false
}