{
	"id": "148.5161",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5161",
	"title": "148.5161 CLINICAL FELLOWSHIP LICENSURE OR DOCTORAL EXTERNSHIP LICENSURE.",
	"text": "Clinical fellowship and doctoral externship candidates must be licensed with a clinical fellowship or doctoral externship license. The commissioner shall issue clinical fellowship licensure or doctoral externship licensure as a speech-language pathologist or audiologist to an applicant who has applied for licensure under section 148.515, who is not the subject of a disciplinary action or past disciplinary action, and who has not violated a provision of section 148.5195, subdivision 3.\nTo be eligible for clinical fellowship licensure or doctoral externship licensure, an applicant must submit an application form provided by the commissioner, the fees required by section 148.5194, and evidence of successful completion of the requirements in section 148.515, subdivision 2 or 2a.\n(a) A clinical fellowship licensee or doctoral externship licensee must practice under the supervision of an individual who meets the requirements of section 148.512, subdivision 20. Supervision must conform to the requirements in paragraphs (b) to (e).\n(b) Supervision must include both on-site observation and other monitoring activities. On-site observation must involve the supervisor, the clinical fellowship licensee or doctoral externship licensee, and the client receiving speech-language pathology or audiology services and must include direct observation by the supervisor of treatment given by the clinical fellowship licensee or doctoral externship licensee. Other monitoring activities must involve direct or indirect evaluative contact by the supervisor of the clinical fellowship licensee or doctoral externship licensee, may be executed by correspondence, and may include, but are not limited to, conferences with the clinical fellowship licensee or doctoral externship licensee, evaluation of written reports, and evaluations by professional colleagues. Other monitoring activities do not include the client receiving speech-language pathology or audiology services.\n(c) The clinical fellowship licensee or doctoral externship licensee must be supervised by an individual who meets the definition of section 148.512, subdivision 20, and:\n(1) when the clinical fellowship licensee or doctoral externship licensee is a speech-language pathologist, is a licensed speech-language pathologist, or holds a current certificate of clinical competence in speech-language pathology from the American Speech-Language-Hearing Association; or\n(2) when the clinical fellowship licensee or doctoral externship licensee is an audiologist, is a licensed audiologist, or holds a current certificate of clinical competence in audiology from the American Speech-Language-Hearing Association or board certification in audiology by the American Board of Audiology.\n(d) Clinical fellowship licensure or doctoral externship licensure shall not be granted until the applicant has completed the academic coursework and clinical training in section 148.515, subdivision 2 or 2a. In addition to the transcript, the commissioner may require a letter from the academic department chair or program director documenting that the applicant has completed coursework equivalent to or exceeding a master's degree or that the applicant is eligible for enrollment in current doctoral externship credit.\n(e) The clinical fellowship licensee or doctoral externship licensee must provide verification of supervision on the application form provided by the commissioner.\nDoctoral candidates in audiology completing their final externship as part of their training program are eligible to receive a doctoral externship license in audiology and are not required to complete the postgraduate clinical fellowship year.\nA clinical fellowship license or doctoral externship license issued to a person pursuant to subdivision 2 expires 18 months after issuance or on the date the commissioner grants or denies licensure, whichever occurs first. Upon application, a clinical fellowship license or doctoral externship license shall be renewed once to persons who have not met the supervised postgraduate clinical experience requirement under section 148.515, subdivision 4, within the initial clinical fellowship license or doctoral externship license period and meet the requirements of subdivision 1.\nA licensee with a clinical fellowship or doctoral externship shall be identified by one of the protected titles and a designation indicating clinical fellowship status or doctoral externship status.",
	"repealed": false
}