{
	"id": "41B.044",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.044",
	"title": "41B.044 ETHANOL DEVELOPMENT PROGRAM.",
	"text": "The authority may establish, adopt rules for, and implement an ethanol production facility loan program to provide capital for ethanol production facilities. The program may provide for secured or unsecured loans, loan participations and loan guarantees with respect to real or personal property comprising all or part of an ethanol production facility, and the payment of costs incurred by the authority to establish and administer the program.\nThere is established in the state treasury an ethanol development fund. All repayments of financial assistance granted under subdivision 1, including principal and interest, must be deposited into the general fund.\nThe authority may issue revenue bonds to finance the ethanol production facility loan program in accordance with sections 41B.08 to 41B.15, 41B.17, and 41B.18. Bonds may be refunded by the issuance of refunding bonds in the manner authorized by chapter 475.\nThe requirements in this subdivision apply to the ethanol production facility loan program.\n(a) Individuals, corporations, cooperatives, partnerships, and joint ventures may participate in the program and are not required to meet the eligibility requirements of section 41B.03, subdivision 1.\n(b) Program participants may be required to pay reasonable nonrefundable application fees and origination fees established by the authority by rule under section 41B.07. Application and origination fees received by the authority must be deposited in the ethanol development fund.\n(c) Total assistance provided to an ethanol production facility from appropriated funds must not exceed $500,000 or a lesser amount as provided by rules relating to the program.\n(d) The interest payable on loans and loan participations made by the authority must, if funded by revenue bond proceeds, be at a rate not less than the rate on the revenue bonds, and may be established at a higher rate necessary to pay costs associated with the issuance of the revenue bonds and a proportionate share of the cost of administering the program. The interest payable on loans and loan participations funded from sources other than revenue bond proceeds must be at a rate determined by the authority.",
	"repealed": false
}