{
	"id": "256.4792",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.4792",
	"title": "256.4792 LONG-TERM SERVICES AND SUPPORTS LOAN PROGRAM.",
	"text": "The commissioner of human services shall establish a competitive loan program to provide operating loans to eligible long-term services and supports providers and facilities. The commissioner shall initiate the application process for the loan described in this section at least once annually if money is available. A second application process may be initiated each year at the discretion of the commissioner.\nTo be an eligible applicant for a loan under this section, a provider must submit to the commissioner of human services a loan application in the form and according to the timelines established by the commissioner. In its loan application, a loan applicant must demonstrate the following:\n(1) for nursing facilities with a medical assistance provider agreement that are licensed as a nursing home or boarding care home according to section 256R.02, subdivision 33:\n(i) the total net income of the nursing facility is not generating sufficient revenue to cover the nursing facility's operating expenses;\n(ii) the nursing facility is at risk of closure; and\n(iii) additional operating revenue is necessary to either preserve access to nursing facility services within the community or support people with complex, high-acuity support needs; and\n(2) for other long-term services and supports providers:\n(i) demonstration that the provider is enrolled in a Minnesota health care program and provides one or more of the following services in a Minnesota health care program:\n(A) home and community-based services under chapter 245D;\n(B) personal care assistance services under section 256B.0659;\n(C) community first services and supports under section 256B.85;\n(D) early intensive developmental and behavioral intervention services under section 256B.0949;\n(E) home care services as defined under section 256B.0651, subdivision 1, paragraph (d); or\n(F) customized living services as defined in section 256S.02; and\n(ii) additional operating revenue is necessary to preserve access to services within the community, expand services to people within the community, expand services to new communities, or support people with complex, high-acuity support needs.\n(a) A loan awarded to a nursing facility under subdivision 2, clause (1), must only be used to cover the facility's short-term operating expenses. Nursing facilities receiving loans must not use the loan proceeds to pay related organizations as defined in section 256R.02, subdivision 43.\n(b) A loan awarded to a long-term services and supports provider under subdivision 2, clause (2), must only be used to cover expenses related to achieving outcomes identified in subdivision 2, clause (2), item (ii).\nThe commissioner must evaluate all loan applications on a competitive basis and award loans to successful applicants within available appropriations for this purpose. The commissioner's decisions are final and not subject to appeal.\nSuccessful loan applicants under this section may receive loan disbursements as a lump sum or on an agreed upon disbursement schedule. The commissioner shall approve disbursements to successful loan applicants through a memorandum of understanding. Memoranda of understanding must specify the amount and schedule of loan disbursements.\nThe commissioner may contract with an independent third party to administer the loan program under this section.\nThe commissioner shall negotiate the terms of the loan repayment, including the start of the repayment plan, the due date of the repayment, and the frequency of the repayment installments. Repayment installments must not begin until at least 18 months after the first disbursement date. The memoranda of understanding must specify the amount and schedule of loan payments. The repayment term must not exceed 72 months. If any loan payment to the commissioner is not paid within the time specified by the memoranda of understanding, the late payment must be assessed a penalty rate of 0.01 percent of the original loan amount each month the payment is past due. For nursing facilities, this late fee is not an allowable cost on the department's cost report. The commissioner shall have the power to abate penalties when discrepancies occur resulting from but not limited to circumstances of error and mail delivery.\n(a) If a borrower is more than 60 calendar days delinquent in the timely payment of a contractual payment under this section, the provisions in paragraphs (b) to (e) apply.\n(b) The commissioner may withhold some or all of the amount of the delinquent loan payment, together with any penalties due and owing on those amounts, from any money the department owes to the borrower. The commissioner may, at the commissioner's discretion, also withhold future contractual payments from any money the commissioner owes the provider as those contractual payments become due and owing. The commissioner may continue this withholding until the commissioner determines there is no longer any need to do so.\n(c) The commissioner shall give prior notice of the commissioner's intention to withhold by mail, facsimile, or email at least ten business days before the date of the first payment period for which the withholding begins. The notice must be deemed received as of the date of mailing or receipt of the facsimile or electronic notice. The notice must:\n(1) state the amount of the delinquent contractual payment;\n(2) state the amount of the withholding per payment period;\n(3) state the date on which the withholding is to begin;\n(4) state whether the commissioner intends to withhold future installments of the provider's contractual payments; and\n(5) state other contents as the commissioner deems appropriate.\n(d) The commissioner, or the commissioner's designee, may enter into written settlement agreements with a provider to resolve disputes and other matters involving unpaid loan contractual payments or future loan contractual payments.\n(e) Notwithstanding any law to the contrary, all unpaid loans, plus any accrued penalties, are overpayments for the purposes of section 256B.0641, subdivision 1. The current owner of a nursing home, boarding care home, or long-term services and supports provider is liable for the overpayment amount owed by a former owner for any facility sold, transferred, or reorganized.\nLoan money allocated under this section is subject to audit to determine whether the money was spent as authorized under this section.\nA long-term services and supports loan account is created in the special revenue fund in the state treasury. Money appropriated for the purposes of this section must be transferred to the long-term services and supports loan account. All payments received under subdivision 6, along with fees, penalties, and interest, must be deposited into the special revenue account and are appropriated to the commissioner for the purposes of this section.\nNotwithstanding section 16A.28, subdivision 3, money in the long-term services and supports loan account for the purposes under this section carries forward and does not lapse.\nMS 2023 Supp [Repealed by amendment, 2024 c 125 art 2 s 16; 2024 c 127 art 47 s 16]",
	"repealed": false
}