{
	"id": "515B.2-102",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-102",
	"title": "515B.2-102 UNIT BOUNDARIES.",
	"text": "(a) The declaration shall describe the boundaries of the units as provided in section 515B.2-105(5). The boundaries need not be delineated by a physical structure. The unit may consist of noncontiguous portions of the common interest community.\n(b) In a condominium, a cooperative, or a planned community utilizing a CIC plat complying with section 515B.2-110(c):\n(1) except as the declaration otherwise provides, if the walls, floors, or ceilings of a unit are designated as its boundaries, then the boundaries shall be the interior, unfinished surfaces of the perimeter walls, floors, ceilings, doors, windows, and door and window frames of the unit, all paneling, tiles, wallpaper, paint, floor covering, and any other finishing materials applied to the interior surfaces of the perimeter walls, floors or ceilings, are a part of the unit, and all other portions of the perimeter walls, floors, ceilings, doors, windows, and door and window frames, are a part of the common elements; and\n(2) except in common interest communities created before August 1, 2010, and except in common interest communities in which all units are restricted to nonresidential use, if unit area or volume is used to allocate interests, the description of the unit boundaries for similar types of units, such as residential units, garage units, or storage units, shall be the same.\n(c) In a planned community utilizing a CIC plat complying with section 515B.2-110(d)(1) and (2), except as the declaration otherwise provides, the unit boundaries shall be the lot lines designated on a plat recorded pursuant to chapter 505 or the tract boundaries designated on a registered land survey recorded pursuant to chapter 508 or 508A.\n(d) Except as provided in section 515B.2-109(c), all spaces, fixtures, and improvements located wholly within the boundaries of a unit are a part of the unit.",
	"repealed": false
}