{
	"id": "626.8454",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8454",
	"title": "626.8454 MANUAL AND POLICY FOR INVESTIGATING CASES INVOLVING CHILDREN WHO ARE MISSING AND ENDANGERED.",
	"text": "By July 1, 1994, the superintendent of the Bureau of Criminal Apprehension shall transmit to law enforcement agencies a training and procedures manual on child abduction investigations.\nBy June 1, 1995, the Peace Officer Standards and Training Board shall develop a model investigation policy for cases involving children who are missing and endangered as defined in section 299C.52. The model policy shall describe the procedures for the handling of cases involving children who are missing and endangered. In developing the policy, the board shall consult with representatives of the Bureau of Criminal Apprehension, Minnesota Police Chiefs Association, Minnesota Sheriff's Association, Minnesota Police and Peace Officers Association, Minnesota Association of Women Police, Minnesota County Attorneys Association, a nonprofit foundation formed to combat child abuse, and two representatives of victims advocacy groups selected by the commissioner of corrections. The manual on child abduction investigation shall serve as a basis for defining the specific actions to be taken during the early investigation.\nBy August 1, 1995, each chief of police and sheriff shall establish and implement a written policy governing the investigation of cases involving children who are missing and endangered as defined in section 299C.52. The policy shall be based on the model policy developed under subdivision 2. The policy shall include specific actions to be taken during the initial two-hour period.\nIf an agency, board, or local representative reviews or updates its policies for missing children or persons investigations, it may consider the following resources:\n(1) nonprofit search and rescue organizations that provide trained animal searches, specialized equipment, and man trackers;\n(2) assistance from other law enforcement agencies at the local, state, or federal level, or qualified missing persons organizations;\n(3) use of subpoenas or search warrants for electronic and wireless communication devices, computers, and websites; and\n(4) assistance and services provided by the Civil Air Patrol.",
	"repealed": false
}