{
	"id": "116J.8737",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8737",
	"title": "116J.8737 SMALL BUSINESS INVESTMENT TAX CREDIT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Qualified small business\" means a business that has been certified by the commissioner under subdivision 2.\n(c) \"Qualified investor\" means an investor who has been certified by the commissioner under subdivision 3.\n(d) \"Qualified fund\" means a pooled angel investment network fund that has been certified by the commissioner under subdivision 4.\n(e) \"Qualified investment\" means a cash investment in a qualified small business of a minimum of:\n(1) $10,000 in a calendar year by a qualified investor;\n(2) $7,500 in a calendar year by a qualified investor in qualified greater Minnesota businesses, or veteran-owned, minority-owned, or women-owned businesses in Minnesota; or\n(3) $30,000 in a calendar year by a qualified fund.\nA qualified investment must be made in exchange for common stock, a partnership or membership interest, preferred stock, debt with mandatory conversion to equity, or an equivalent ownership interest as determined by the commissioner.\n(f) \"Family\" means a family member within the meaning of the Internal Revenue Code, section 267(c)(4).\n(g) \"Pass-through entity\" means a corporation that for the applicable taxable year is treated as an S corporation or a general partnership, limited partnership, limited liability partnership, trust, or limited liability company and which for the applicable taxable year is not taxed as a corporation under chapter 290.\n(h) \"Intern\" means a student of an accredited institution of higher education, or a former student who has graduated in the past six months from an accredited institution of higher education, who is employed by a qualified small business in a nonpermanent position for a duration of nine months or less that provides training and experience in the primary business activity of the business.\n(i) \"Liquidation event\" means a conversion of qualified investment for cash, cash and other consideration, or any other form of equity or debt interest.\n(j) \"Qualified greater Minnesota business\" means a qualified small business that is also certified by the commissioner as a qualified greater Minnesota business under subdivision 2, paragraph (h).\n(k) \"Minority group member\" means a United States citizen who is Asian, Pacific Islander, Black, Hispanic, or Native American.\n(l) \"Minority-owned business\" means a business for which one or more minority group members:\n(1) own at least 50 percent of the business, or, in the case of a publicly owned business, own at least 51 percent of the stock; and\n(2) manage the business and control the daily business operations.\n(m) \"Women\" means persons of the female gender.\n(n) \"Women-owned business\" means a business for which one or more women:\n(1) own at least 50 percent of the business, or, in the case of a publicly owned business, own at least 51 percent of the stock; and\n(2) manage the business and control the daily business operations.\n(o) \"Veteran\" has the meaning given in section 197.447.\n(p) \"Veteran-owned business\" means a business for which one or more veterans:\n(1) own at least 50 percent of the business, or, in the case of a publicly owned business, own at least 51 percent of the stock; and\n(2) manage the business and control the daily business operations.\n(q) \"Officer\" means a person elected or appointed by the board of directors to manage the daily operations of the qualified small business.\n(r) \"Principal\" means a person having authority to act on behalf of the qualified small business.\n(a) Businesses may apply to the commissioner for certification as a qualified small business or qualified greater Minnesota small business for a calendar year. The application must be in the form and be made under the procedures specified by the commissioner, accompanied by an application fee of $150. Application fees are deposited in the small business investment tax credit administration account in the special revenue fund. Applications for certification must be made available on the department's website by November 1 of the preceding year.\n(b) Within 30 days of receiving an application for certification under this subdivision, the commissioner must either certify the business as satisfying the conditions required of a qualified small business or qualified greater Minnesota small business, request additional information from the business, or reject the application for certification. If the commissioner requests additional information from the business, the commissioner must either certify the business or reject the application within 30 days of receiving the additional information. If the commissioner neither certifies the business nor rejects the application within 30 days of receiving the original application or within 30 days of receiving the additional information requested, whichever is later, then the application is deemed rejected, and the commissioner must refund the $150 application fee. A business that applies for certification and is rejected may reapply.\n(c) To receive certification as a qualified small business, a business must satisfy all of the following conditions:\n(1) the business has its headquarters in Minnesota;\n(2) at least:\n(i) 51 percent of the business's employees are employed in Minnesota;\n(ii) 51 percent of the business's total payroll is paid or incurred in the state; and\n(iii) 51 percent of the total value of all contractual agreements to which the business is a party in connection with its primary business activity is for services performed under contract in Minnesota, unless the business obtains a waiver under paragraph (i);\n(3) the business is engaged in, or is committed to engage in, innovation in Minnesota in one of the following as its primary business activity:\n(i) using proprietary technology to add value to a product, process, or service in a qualified high-technology field;\n(ii) researching or developing a proprietary product, process, or service in a qualified high-technology field;\n(iii) researching or developing a proprietary product, process, or service in the fields of agriculture, tourism, forestry, mining, manufacturing, or transportation; or\n(iv) researching, developing, or producing a new proprietary technology for use in the fields of agriculture, tourism, forestry, mining, manufacturing, or transportation;\n(4) other than the activities specifically listed in clause (3), the business is not engaged in real estate development, insurance, banking, lending, lobbying, political consulting, information technology consulting, wholesale or retail trade, leisure, hospitality, transportation, construction, ethanol production from corn, or professional services provided by attorneys, accountants, business consultants, physicians, or health care consultants;\n(5) the business has fewer than 25 employees;\n(6) the business must pay its employees annual wages of at least 175 percent of the federal poverty guideline for the year for a family of four and must pay its interns annual wages of at least 175 percent of the federal minimum wage used for federally covered employers, except that this requirement must be reduced proportionately for employees and interns who work less than full-time, and does not apply to an executive, officer, or member of the board of the business, or to any employee who owns, controls, or holds power to vote more than 20 percent of the outstanding securities of the business;\n(7) the business has (i) not been in operation for more than ten years, or (ii) not been in operation for more than 20 years if the business is engaged in the research, development, or production of medical devices or pharmaceuticals for which United States Food and Drug Administration approval is required for use in the treatment or diagnosis of a disease or condition;\n(8) the business has not previously received private equity investments of more than $4,000,000;\n(9) the business is not an entity disqualified under section 80A.50, paragraph (b), clause (3); and\n(10) the business has not issued securities that are traded on a public exchange.\n(d) In applying the limit under paragraph (c), clause (5), the employees in all members of the unitary business, as defined in section 290.17, subdivision 4, must be included.\n(e) In order for a qualified investment in a business to be eligible for tax credits:\n(1) the business must have applied for and received certification for the calendar year in which the investment was made prior to the date on which the qualified investment was made;\n(2) the business must not have issued securities that are traded on a public exchange;\n(3) the business must not issue securities that are traded on a public exchange within 180 days after the date on which the qualified investment was made; and\n(4) the business must not have a liquidation event within 180 days after the date on which the qualified investment was made.\n(f) The commissioner must maintain a list of qualified small businesses and qualified greater Minnesota businesses certified under this subdivision for the calendar year and make the list accessible to the public on the department's website.\n(g) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"qualified high-technology field\" includes aerospace, agricultural processing, renewable energy, energy efficiency and conservation, environmental engineering, food technology, cellulosic ethanol, information technology, materials science technology, nanotechnology, telecommunications, biotechnology, medical device products, pharmaceuticals, diagnostics, biologicals, chemistry, veterinary science, and similar fields;\n(2) \"proprietary technology\" means the technical innovations that are unique and legally owned or licensed by a business and includes, without limitation, those innovations that are patented, patent pending, a subject of trade secrets, or copyrighted; and\n(3) \"greater Minnesota\" means the area of Minnesota located outside of the metropolitan area as defined in section 473.121, subdivision 2.\n(h) To receive certification as a qualified greater Minnesota business, a business must satisfy all of the requirements of paragraph (c) and must satisfy the following conditions:\n(1) the business has its headquarters in greater Minnesota; and\n(2) at least:\n(i) 51 percent of the business's employees are employed in greater Minnesota;\n(ii) 51 percent of the business's total payroll is paid or incurred in greater Minnesota; and\n(iii) 51 percent of the total value of all contractual agreements to which the business is a party in connection with its primary business activity is for services performed under contract in greater Minnesota, unless the business obtains a waiver under paragraph (i).\n(i) The commissioner must exempt a business from the requirement under paragraph (c), clause (2), item (iii), if the business certifies to the commissioner that the services required under a contract in connection with the primary business activity cannot be performed in Minnesota if the business otherwise qualifies as a qualified small business, or in greater Minnesota if the business otherwise qualifies as a qualified greater Minnesota business. The business must submit the certification required under this paragraph every six months from the month the exemption was granted. The exemption allowed under this paragraph must be submitted in a form and manner prescribed by the commissioner.\n(a) Investors may apply to the commissioner for certification as a qualified investor for a taxable year. The application must be in the form and be made under the procedures specified by the commissioner, accompanied by an application fee of $350. Application fees are deposited in the small business investment tax credit administration account in the special revenue fund. Applications for certification must be made available on the department's website by November 1 of the preceding year.\n(b) Within 30 days of receiving an application for certification under this subdivision, the commissioner must either certify the investor as satisfying the conditions required of a qualified investor, request additional information from the investor, or reject the application for certification. If the commissioner requests additional information from the investor, the commissioner must either certify the investor or reject the application within 30 days of receiving the additional information. If the commissioner neither certifies the investor nor rejects the application within 30 days of receiving the original application or within 30 days of receiving the additional information requested, whichever is later, then the application is deemed rejected, and the commissioner must refund the $350 application fee. An investor who applies for certification and is rejected may reapply.\n(c) To receive certification, an investor must (1) be a natural person; and (2) certify to the commissioner that the investor will only invest in a transaction that is exempt under section 80A.46, clause (13) or (14), in a security exempt under section 80A.461, or in a security registered under section 80A.50, paragraph (b).\n(d) In order for a qualified investment in a qualified small business to be eligible for tax credits, a qualified investor who makes the investment must have applied for and received certification for the calendar year prior to making the qualified investment, except in the case of an investor who is not an accredited investor, within the meaning of Regulation D of the Securities and Exchange Commission, Code of Federal Regulations, title 17, section 230.501, paragraph (a), application for certification may be made within 30 days after making the qualified investment.\n(a) A pass-through entity may apply to the commissioner for certification as a qualified fund for a calendar year. The application must be in the form and be made under the procedures specified by the commissioner, accompanied by an application fee of $1,000. Application fees are deposited in the small business investment tax credit administration account in the special revenue fund. Applications for certification must be made available by November 1 of the preceding year.\n(b) Within 30 days of receiving an application for certification under this subdivision, the commissioner must either certify the fund as satisfying the conditions required of a qualified fund, request additional information from the fund, or reject the application for certification. If the commissioner requests additional information from the fund, the commissioner must either certify the fund or reject the application within 30 days of receiving the additional information. If the commissioner neither certifies the fund nor rejects the application within 30 days of receiving the original application or within 30 days of receiving the additional information requested, whichever is later, then the application is deemed rejected, and the commissioner must refund the $1,000 application fee. A fund that applies for certification and is rejected may reapply.\n(c) To receive certification, a fund must:\n(1) invest or intend to invest in qualified small businesses;\n(2) be organized as a pass-through entity; and\n(3) have at least three separate investors, of whom at least three whose investment is made in the certified business and who seek a tax credit allocation satisfy the conditions in subdivision 3, paragraph (c).\n(d) Investments in the fund may consist of equity investments or notes that pay interest or other fixed amounts, or any combination of both.\n(e) In order for a qualified investment in a qualified small business to be eligible for tax credits, a qualified fund that makes the investment must have applied for and received certification for the calendar year prior to making the qualified investment.\n(a) A qualified investor or qualified fund is eligible for a credit equal to 25 percent of the qualified investment in a qualified small business. Investments made by a pass-through entity qualify for a credit only if the entity is a qualified fund. The commissioner must not allocate to qualified investors or qualified funds more than the dollar amount in credits allowed for the taxable years listed in paragraph (i). For each taxable year, 50 percent must be allocated to credits for qualified investments in qualified greater Minnesota businesses and minority-owned, women-owned, or veteran-owned qualified small businesses in Minnesota. Any portion of a taxable year's credits that is reserved for qualified investments in greater Minnesota businesses and minority-owned, women-owned, or veteran-owned qualified small businesses in Minnesota that is not allocated by September 30 of the taxable year is available for allocation to other credit applications beginning on October 1. Any portion of a taxable year's credits that is not allocated by the commissioner does not cancel and may be carried forward to subsequent taxable years until all credits have been allocated.\n(b) The commissioner may not allocate more than a total maximum amount in credits for a taxable year to a qualified investor for the investor's cumulative qualified investments as an individual qualified investor and as an investor in a qualified fund; for married couples filing joint returns the maximum is $250,000, and for all other filers the maximum is $125,000. The commissioner may not allocate more than a total of $1,000,000 in credits over all taxable years for qualified investments in any one qualified small business.\n(c) The commissioner may not allocate a credit to a qualified investor either as an individual qualified investor or as an investor in a qualified fund if, at the time the investment is proposed:\n(1) the investor is an officer or principal of the qualified small business; or\n(2) the investor, either individually or in combination with one or more members of the investor's family, owns, controls, or holds the power to vote 20 percent or more of the outstanding securities of the qualified small business.\nA member of the family of an individual disqualified by this paragraph is not eligible for a credit under this section. For a married couple filing a joint return, the limitations in this paragraph apply collectively to the investor and spouse. For purposes of determining the ownership interest of an investor under this paragraph, the rules under section 267(c) and 267(e) of the Internal Revenue Code apply.\n(d) Applications for tax credits must be made available on the department's website by November 1 of the preceding year.\n(e) Qualified investors and qualified funds must apply to the commissioner for tax credits. Tax credits must be allocated to qualified investors or qualified funds in the order that the tax credit request applications are filed with the department. The commissioner must approve or reject tax credit request applications within 15 days of receiving the application. The investment specified in the application must be made within 60 days of the allocation of the credits. If the investment is not made within 60 days, the credit allocation is canceled and available for reallocation. A qualified investor or qualified fund that fails to invest as specified in the application, within 60 days of allocation of the credits, must notify the commissioner of the failure to invest within five business days of the expiration of the 60-day investment period.\n(f) All tax credit request applications filed with the department on the same day must be treated as having been filed contemporaneously. If two or more qualified investors or qualified funds file tax credit request applications on the same day, and the aggregate amount of credit allocation claims exceeds the aggregate limit of credits under this section or the lesser amount of credits that remain unallocated on that day, then the credits must be allocated among the qualified investors or qualified funds who filed on that day on a pro rata basis with respect to the amounts claimed. The pro rata allocation for any one qualified investor or qualified fund is the product obtained by multiplying a fraction, the numerator of which is the amount of the credit allocation claim filed on behalf of a qualified investor and the denominator of which is the total of all credit allocation claims filed on behalf of all applicants on that day, by the amount of credits that remain unallocated on that day for the taxable year.\n(g) A qualified investor or qualified fund, or a qualified small business acting on their behalf, must notify the commissioner when an investment for which credits were allocated has been made, and the taxable year in which the investment was made. A qualified fund must also provide the commissioner with a statement indicating the amount invested by each investor in the qualified fund based on each investor's share of the assets of the qualified fund at the time of the qualified investment. After receiving notification that the investment was made, the commissioner must issue credit certificates for the taxable year in which the investment was made to the qualified investor or, for an investment made by a qualified fund, to each qualified investor who is an investor in the fund. The certificate must state that the credit is subject to revocation if the qualified investor or qualified fund does not hold the investment in the qualified small business for at least three years, consisting of the calendar year in which the investment was made and the two following years. The three-year holding period does not apply if:\n(1) the investment by the qualified investor or qualified fund becomes worthless before the end of the three-year period;\n(2) 80 percent or more of the assets of the qualified small business is sold before the end of the three-year period;\n(3) the qualified small business is sold before the end of the three-year period;\n(4) the qualified small business's common stock begins trading on a public exchange before the end of the three-year period; or\n(5) the qualified investor dies before the end of the three-year period.\n(h) The commissioner must notify the commissioner of revenue of credit certificates issued under this section.\n(i) The credit allowed under this subdivision is effective as follows:\n(1) $10,000,000 for taxable years beginning after December 31, 2020, and before January 1, 2022; and\n(2) $5,000,000 for taxable years beginning after December 31, 2021, and before January 1, 2025.\n(a) By July 1, 2014, the commissioner shall develop a plan to increase awareness of and use of the credit for investments in qualified greater Minnesota businesses and minority-owned and women-owned qualified small businesses with the goal that the portion of the credit reserved for investments in qualified greater Minnesota businesses and minority-owned and women-owned qualified small businesses is allocated in full to those investments.\n(b) Beginning with the legislative report due on March 15, 2015, under subdivision 9, the commissioner shall report on its plan under this subdivision and the results achieved.\n(a) By February 1 of each year each qualified small business that received an investment that qualified for a credit, and each qualified investor and qualified fund that made an investment that qualified for a credit, must submit an annual report to the commissioner and pay a filing fee of $100 as required under this subdivision. Each qualified investor and qualified fund must submit reports for three years following each year in which it made an investment that qualified for a credit, and each qualified small business must submit reports for five years following the year in which it received an investment qualifying for a credit. Reports must be made in the form required by the commissioner. All filing fees collected are deposited in the small business investment tax credit administration account in the special revenue fund.\n(b) A report from a qualified small business must certify that the business satisfies the following requirements:\n(1) the business has its headquarters in Minnesota;\n(2) at least 51 percent of the business's employees are employed in Minnesota, and 51 percent of the business's total payroll is paid or incurred in the state;\n(3) that the business is engaged in, or is committed to engage in, innovation in Minnesota as defined under subdivision 2; and\n(4) that the business meets the payroll requirements in subdivision 2, paragraph (c), clause (6).\n(c) Reports from qualified investors must certify that the investor remains invested in the qualified small business as required by subdivision 5, paragraph (g).\n(d) Reports from qualified funds must certify that the fund remains invested in the qualified small business as required by subdivision 5, paragraph (g).\n(e) A qualified small business that ceases all operations and becomes insolvent must file a final annual report in the form required by the commissioner documenting its insolvency. In following years the business is exempt from the annual reporting requirement, the report filing fee, and the fine for failure to file a report.\n(f) A qualified small business, qualified investor, or qualified fund that fails to file an annual report by February 1 as required under this subdivision is subject to a $100 fine.\n(g) A qualified investor or qualified fund that fails to file an annual report by April 1 may, at the commissioner's discretion, have any credit allocated and certified to the investor or fund revoked and such credit must be repaid by the investor.\n(h) A qualified business that fails to file an annual report by April 1 may, at the commissioner's discretion, be subject to the credit repayment provisions in subdivision 7, paragraph (b).\n(a) If the commissioner determines that a qualified investor or qualified fund did not meet the three-year holding period required in subdivision 5, paragraph (g), any credit allocated and certified to the investor or fund is revoked and must be repaid by the investor.\n(b) If the commissioner determines that a business did not meet the employment and payroll requirements in subdivision 2, paragraph (c), clause (2), or paragraph (h), as applicable, in any of the five calendar years following the year in which an investment in the business that qualified for a tax credit under this section was made, the business must repay the following percentage of the credits allowed for qualified investments in the business:\n(c) The commissioner must notify the commissioner of revenue of every credit revoked and subject to full or partial repayment under this section.\n(d) For the repayment of credits allowed under this section and section 290.0692, a qualified small business, qualified investor, or investor in a qualified fund must file an amended return with the commissioner of revenue and pay any amounts required to be repaid within 30 days after becoming subject to repayment under this section.\n(a) Data contained in an application submitted to the commissioner under subdivision 2, 3, or 4 are nonpublic data, or private data on individuals, as defined in section 13.02, subdivision 9 or 12, except that the following data items are public:\n(1) the name, mailing address, telephone number, email address, contact person's name, and industry type of a qualified small business upon approval of the application and certification by the commissioner under subdivision 2;\n(2) the name of a qualified investor upon approval of the application and certification by the commissioner under subdivision 3;\n(3) the name of a qualified fund upon approval of the application and certification by the commissioner under subdivision 4;\n(4) for credit certificates issued under subdivision 5, the amount of the credit certificate issued, amount of the qualified investment, the name of the qualified investor or qualified fund that received the certificate, and the name of the qualified small business in which the qualified investment was made;\n(5) for credits revoked under subdivision 7, paragraph (a), the amount revoked and the name of the qualified investor or qualified fund; and\n(6) for credits revoked under subdivision 7, paragraphs (b) and (c), the amount revoked and the name of the qualified small business.\n(b) The following data, including data classified as nonpublic or private, must be provided to the consultant for use in conducting the program evaluation under subdivision 10:\n(1) the commissioner of employment and economic development shall provide data contained in an application for certification received from a qualified small business, qualified investor, or qualified fund, and any annual reporting information received on a qualified small business, qualified investor, or qualified fund; and\n(2) the commissioner of revenue shall provide data contained in any applicable tax returns of a qualified small business, qualified investor, or qualified fund.\nBeginning in 2011, the commissioner must annually report by March 15 to the chairs and ranking minority members of the legislative committees having jurisdiction over taxes and economic development in the senate and the house of representatives, in compliance with sections 3.195 and 3.197, on the tax credits issued under this section. The report must include:\n(1) the number and amount of the credits issued;\n(2) the recipients of the credits;\n(3) for each qualified small business or qualified greater Minnesota business, its location, line of business, and if it received an investment resulting in certification of tax credits;\n(4) the total amount of investment in each qualified small business resulting in certification of tax credits;\n(5) for each qualified small business that received investments resulting in tax credits, the total amount of additional investment that did not qualify for the tax credit;\n(6) the number and amount of credits revoked under subdivision 7;\n(7) the number and amount of credits that are no longer subject to the three-year holding period because of the exceptions under subdivision 5, paragraph (g), clauses (1) to (4); and\n(8) any other information relevant to evaluating the effect of these credits.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]\nAmounts in the small business investment tax credit administration account in the special revenue fund are appropriated to the commissioner of employment and economic development for costs associated with certifying applications and refunding application fees as provided in subdivisions 2, 3, and 4, and for personnel and administrative expenses related to administering the small business investment tax credit in this section.\nThis section expires for taxable years beginning after December 31, 2024, except that reporting requirements under subdivision 6 and revocation of credits under subdivision 7 remain in effect through 2026 for qualified investors and qualified funds, and through 2028 for qualified small businesses, reporting requirements under subdivision 9 remain in effect through 2024, and the appropriation in subdivision 11 remains in effect through 2028.",
	"repealed": false
}