{
	"id": "16A.646",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.646",
	"title": "16A.646 ZERO COUPON BONDS.",
	"text": "When authorized by law to issue state general obligation bonds, the commissioner may issue all or part of the bonds as serial maturity bonds or as zero coupon bonds or a combination of the two.\n(a) For purposes of this section and section 16A.645, the following terms have the meanings given them.\n(b) \"Compounded maturity\" means the amount of principal and interest payable at maturity on zero coupon bonds.\n(c) \"Serial maturity bonds\" means bonds maturing on a specified day in two or more consecutive years and bearing interest at a specified rate payable periodically to maturity or prior redemption.\n(d) \"Zero coupon bonds\" means bonds in a stated principal amount, maturing on a specified date or dates, and bearing interest that accrues and compounds to and is payable only at maturity or upon prior redemption of the bonds.\nExcept as otherwise provided by this section or section 16A.645, any series of bonds including zero coupon bonds must be issued and sold under the provisions of section 16A.641. The stated principal amount of zero coupon bonds must be used to determine the principal amount of bonds issued under the laws authorizing issuance of state general obligation bonds.\nThe commissioner's order authorizing the issuance of zero coupon bonds shall establish a separate sinking fund account for the zero coupon bonds in the state bond fund. There is annually appropriated from the general fund to each zero coupon bond account, beginning in the year in which the zero coupon bonds are issued, an amount not less than the sum of:\n(1) the total stated principal amount of the zero coupon bonds that would have matured from their date of issue to and including the second July 1 following the transfer of appropriated money, if the bonds matured serially in an equal principal amount in each year during their term and in the same month as their stated maturity date; plus\n(2) the total amount of interest accruing on the stated principal amount of the bonds and on interest previously accrued, from bonds date of issue to and including the second July 1 following the transfer of appropriated money; less\n(3) the amount in the sinking fund account for the payment of the compounded maturity amount of the bonds, including interest earnings on amounts in the account. This appropriation is in lieu of all other appropriations made with respect to zero coupon bonds. The appropriated amounts must be transferred from the general fund to the sinking fund account in the state bond fund by December 1 of each year.\nExcept as otherwise provided in section 16A.645, zero coupon bonds, or a series of bonds including zero coupon bonds, must be sold at public sale at a price not less than 98 percent of their stated principal amount. No state trunk highway bond may be sold for a price of less than par and accrued interest.",
	"repealed": false
}