{
	"id": "181.980",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.980",
	"title": "181.980 ACCESS TO EMPLOYEE ASSISTANCE RECORDS.",
	"text": "(a) For the purpose of this section, the following terms have the meanings given to them in this subdivision.\n(b) \"Employee assistance services\" means services paid for or provided by an employer and offered to employees or their family members on a voluntary basis. The services are designed to assist in the identification and resolution of productivity problems associated with personal concerns. Services include, but are not limited to, assessment; assistance; counseling or referral assistance with medical or mental health problems; alcohol or drug use; or emotional, marital, familial, financial, legal, or other personal problems.\n(c) \"Employer\" means a person or entity located or doing business in the state and having one or more employees, but does not include a government entity that is subject to chapter 13.\n(d) \"Employee assistance provider\" means an employer, or a person acting on behalf of an employer, who is providing employee assistance services.\n(e) \"Employee assistance records\" means the records created, collected, or maintained by an employee assistance provider that relate to participation by an employee or an employee's family member in employee assistance services.\nEmployee assistance records do not include:\n(1) written or recorded comments or data of a personal nature about a person other than the employee, if disclosure of the information would constitute an intrusion upon that person's privacy;\n(2) written or recorded comments or data kept by the employee's supervisor or an executive, administrative, or professional employee, provided the written comments or data are kept in the sole possession of the author of the record;\n(3) information that is not discoverable in a worker's compensation, grievance arbitration, administrative, judicial, or quasi-judicial proceeding; or\n(4) any portion of a written, recorded, or transcribed statement by a third party about the recipient of employee assistance services that discloses the identity of the third party by name, inference, or otherwise.\nUpon written request of a person who has received employee assistance services, or a parent or legal guardian of the person if the person is a minor, an employee assistance provider shall provide the requesting person with an opportunity to review and obtain copies of the person's employee assistance records or the pertinent portion of the records specified by the person. An employee assistance provider shall comply with a request under this subdivision no later than seven working days after receipt of the request if the records are located in this state, or 14 working days after receipt of the request if the records are located outside this state. An employee assistance provider may not charge a fee for a copy of the record.\nEmployee assistance records must be maintained separate from personnel records and must not become part of an employee's personnel file.\nThe rights and obligations created by this section are in addition to rights or obligations created under a contract or other law governing access to records.\nNo portion of employee assistance records, or participation in employee assistance services, may be disclosed to a third person, including the employer or its representative, without the prior written authorization of the person receiving services, or the person's legal representative. This subdivision does not prohibit disclosure:\n(1) pursuant to state or federal law or judicial order;\n(2) required in the normal course of providing the requested services; or\n(3) if necessary to prevent physical harm or the commission of a crime.\nIn addition to other remedies provided by law, the recipient of employee assistance services may bring a civil action to compel compliance with this section and to recover actual damages, plus costs and reasonable attorney fees.",
	"repealed": false
}