{
	"id": "79.253",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.253",
	"title": "79.253 ASSIGNED RISK SAFETY ACCOUNT.",
	"text": "There is created the assigned risk safety account as a separate account in the special compensation fund in the state treasury. Income earned by funds in the account must be credited to the account. Principal and income of the account are annually appropriated to the commissioner of labor and industry to establish and promote workplace safety and health programs.\nThe assigned risk plan shall, through persons under contract with the plan, perform on-site surveys of employers insured by the assigned risk plan and recommend practices and equipment to employers designed to reduce the risk of injury to employees. The recommendations may include that the employer form a joint labor-management safety committee. The plan shall generally survey employers in the following priority:\n(1) employers with poor safety records for their industry based on their premium modification factor or other factors;\n(2) employers whose workers' compensation premium classification assigned to the greatest portion of the payroll for the employer has a premium rate in the top 25 percent of premium rates for all classes; and\n(3) all other employers.\nAn employer is eligible to apply for a grant or loan under this section if the employer meets the following requirements:\n(1) the employer's workers' compensation insurance is provided by the assigned risk plan, is provided by an insurer subject to penalties under chapter 176, or the employer is self-insured;\n(2) the employer has had an on-site safety survey conducted by a Minnesota occupational safety and health investigator, a Minnesota Department of Labor and Industry workplace safety and health consultant, an in-house employee safety and health committee, a workers' compensation underwriter, a private safety consultant, or a person under contract with the assigned risk plan; and\n(3) the on-site safety survey recommends specific safety practices or equipment designed to reduce the risk of illness or injury to employees.\nThe assigned risk plan shall develop a premium rating system subject to approval by the commissioner of commerce that provides a reduction in premium rates for employers that follow safety recommendations made under this section and an increase in rates for employers that do not. The system must be sensitive to the economic ability of an employer to implement particular recommendations.\nThe commissioner of labor and industry may make grants or loans to employers for the cost of implementing safety recommendations made under this section.\nThe commissioner of labor and industry may adopt rules necessary to implement this section.",
	"repealed": false
}