{
	"id": "609.7475",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.7475",
	"title": "609.7475 FRAUDULENT OR OTHERWISE IMPROPER FINANCING STATEMENTS.",
	"text": "As used in this section, \"record\" has the meaning given in section 336.9-102.\nA person who:\n(1) knowingly causes to be presented for filing or promotes the filing of a record that:\n(i) is not:\n(A) related to a valid lien or security agreement; or\n(B) filed pursuant to section 336.9-502(d); or\n(ii) contains a forged signature or is based upon a document containing a forged signature; or\n(2) presents for filing or causes to be presented for filing a record with the intent that it be used to harass or defraud any other person;\nis guilty of a crime and may be sentenced as provided in subdivision 3.\n(a) Except as provided in paragraph (b), a person who violates subdivision 2 is guilty of a gross misdemeanor.\n(b) A person who violates subdivision 2 is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the person:\n(1) commits the offense with intent to influence or otherwise tamper with a juror or a judicial proceeding or with intent to retaliate against:\n(i) a judicial officer, as defined in section 609.415;\n(ii) a prosecutor, defense attorney, or officer of the court, because of that person's performance of official duties in connection with a judicial proceeding;\n(iii) a sheriff or deputy sheriff because of that person's performance of official duties;\n(iv) a police officer or chief of police because of that person's performance of official duties;\n(v) an official or employee of the Department of Corrections or a local correctional agency because of that person's performance of official duties; or\n(vi) a county recorder because of that person's performance of official duties in connection with the filing of liens placed on real property; or\n(2) commits the offense after having been previously convicted of a violation of this section.\nA violation of this section may be prosecuted in either the county of residence of the individual listed as debtor or the county in which the filing is made.",
	"repealed": false
}