{
	"id": "453A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/453A.08",
	"title": "453A.08 CITY MAY JOIN AGENCY, EXERCISE POWERS.",
	"text": "A city may, by resolution of its governing body, elect to join a municipal agency, provided that it shall give written notice by mail to all its gas consumers 20 days prior to the meeting at which the resolution is to be considered, and one week's prior notice by publication in the official newspaper.\nA city may, by resolution of its governing body, exercise any of the powers granted in sections 453A.01 to 453A.12 to a municipal gas agency, upon fulfillment of the conditions provided in sections 453A.01 to 453A.12 for the exercise of any such power, but without complying with the terms of section 453A.03 relating to incorporation, and notwithstanding any provision of any city charter or any other law denying, limiting, or placing conditions upon the exercise of any such power. Nothing in this section shall be construed to repeal any charter provision or law requiring an election or other condition precedent to the establishment after January 1, 1979, of a city gas distribution system.\nEvery resolution adopted in accordance with subdivision 1 shall be published in the official newspaper of the city. No action may be brought and no defense may be interposed in an action brought more than 30 days after publication of the resolution, placing at issue the validity of any provision of the resolution or the power of the city to make any contract or to issue any bond, note, or other obligation authorized thereby.\nNothing in sections 453A.01 to 453A.12 authorizes any city to issue general obligation bonds for any purpose specified in sections 453A.01 to 453A.12, without approval of its electors or performance of such other procedural conditions as may be required by its charter or the laws of this state. A city may, however, by resolution of its governing body and without approval of the electors or performance of other conditions provided in any charter or other law, enter into contracts with a municipal gas agency for the purchase, sale, exchange, exploration, storage, production, transmission or distribution of gas and other services, on such terms and for such period of time as the resolution may provide. A city may appropriate and use tax and other revenues received in any year to make payments due or to comply with covenants to be performed during that year under any contract made by the city when acting as a municipal gas agency, or any contract made by the city with a municipal gas agency, as contemplated by sections 453A.01 to 453A.12, subject to the provisions of its charter and the laws of this state regarding budget and payment procedures and annual tax levy limitations.",
	"repealed": false
}