{
	"id": "256R.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.265",
	"title": "256R.265 APPRAISALS AND DETERMINATION OF REPLACEMENT COSTS.",
	"text": "The commissioner shall select a commercial valuation system that property appraisal firms selected by the commissioner must utilize for all nursing facility property appraisals. The commissioner shall use appraisal reports produced by commissioner-selected appraisal firms using the commissioner-selected commercial valuation system for the purposes of rate setting under section 256R.26, subdivisions 1 to 8. The commissioner shall not adjust or substitute any alternative appraisal of properties.\nThe property appraisal firm selected by the commissioner shall determine the appraised valuation of a building and fixed equipment. The appraisal firm shall not include depreciable movable equipment, land, land improvements, or the physical plant for central office operations in the appraised valuation of the nursing facility. Appraisals are not intended to exactly reflect market value.\nAppraisal firms selected by the commissioner shall produce a report detailing both the DRC and URC of the nursing facility.\nSelected appraisal firms may include the full value of all shared areas in an initial appraisal but must adjust the nursing facility valuation of any shared area included in the square footage, DRC, and URC that are not used for nursing facility purposes to reflect only the nursing facility usage of shared areas. Selected appraisal firms shall adjust facility valuation for shared areas using a Medicare-approved allocation basis for the type of service provided in each area. Shared areas outside the appraised space must be added to the DRC, URC, and related square footage using the average of each value from the space in the appraisal.\nA nursing facility may appeal a finding of fact in the appraisal report to the appraiser within 20 calendar days after receipt of the appraisal report and request revision.\nWhen a facility's most recent physical appraisal was completed more than 12 months before the start of the rate year, the appraisal firm shall use the commercial valuation system to update the most recent DRC and URC of the nursing facility and the commissioner shall use the updated DRC and URC to determine the total property payment rate under section 256R.26. Updated DRC and URC are updates only and not subject to revisions of any of the original valuations or appeal to the appraiser by the facility.\nAfter a facility's initial rate year described in section 256R.26, subdivision 9, paragraph (b), the commissioner shall ensure that a selected appraisal firm conducts a new physical appraisal of the facility at least once every three years using a commercial valuation system.\nAfter the initial rate year described in section 256R.26, subdivision 9, paragraph (b), the increase in the URC for each subsequent appraisal shall not exceed $2,000 per bed per year since the most recent physical appraisal, plus any projects completed under section 256R.267 since the most recent appraisal. Any limitation to the URC must be applied in the same proportion to the DRC. The commissioner shall update annually on January 1 the per-bed per-year limit on the increase in the URC in this subdivision by the annual percent change in the construction cost per square foot value.",
	"repealed": false
}