{
	"id": "88.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.01",
	"title": "88.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Division\" or \"the division\" means the Division of Forestry in the Department of Natural Resources.\n\"Commissioner\" means commissioner of natural resources.\n\"Person\" includes any natural person acting either personally or in any representative capacity, a corporation, a firm, a copartnership, or an association of any nature or kind.\n\"Timber\" means and includes trees, saplings, bushes, seedlings, and sprouts from which trees may grow, of every size, nature, kind and description.\nEvery county now or hereafter having within its boundaries any tract or area of 1,000, or more, contiguous acres of trees, brush, grasslands, or other vegetative material where the potential for wildfire exists, is hereby declared to be a wildfire area.\n\"Forest land\" means land which is at least ten percent stocked by trees of any size and capable of producing timber, or of exerting an influence on the climate or on the water regime; land from which the trees described above have been removed to less than ten percent stocking and which has not been developed for other use; and afforested areas.\n\"Backfire\" means a fire intentionally started ahead of, or in the path of, an approaching wildfire for the purpose of burning back toward the wildfire so that when the two fires meet both will die for lack of fuel.\n[Repealed, 1955 c 699 s 2]\n[Repealed, 1955 c 699 s 2]\n[Repealed, 1955 c 699 s 2]\n[Repealed, 1955 c 699 s 2]\n[Repealed, 1955 c 699 s 2]\n\"County board\" means the board of county commissioners; and \"town board\" means the board of town supervisors.\n\"Improvement\" includes any act or thing done, or which may be done, and any construction made or structure erected or which may be made or erected, and any removal from any land of trees, brush, stumps, or other debris, which reasonably tend to prevent or abate wildfires.\n\"Forest\" means a plant association predominantly of trees and other woody vegetation occupying an extensive area of land.\n\"Auxiliary forest\" is used in relation to state forest, and includes any privately owned tract of land, including roads and camp or work sites, set apart for, and chiefly devoted to, the production of timber or forest products under the restrictions, and subject to the provisions, of sections 88.49 to 88.53.\n\"Forest products\" means and includes all products derived from timber.\n\"Merchantable timber\" means a tree or stand of trees which may be disposed of at a profit through conversion to a salable product.\n\"Owner\" includes the person owning the fee title to any tract of land, but does not include an owner of timber thereon or of minerals or any other thing therein when such ownership is separate from the ownership of the surface.\n\"County recorder\" includes the county recorder of the county in which the land referred to is located, or the registrar of titles in case the title to the land has been registered.\n\"Forest officer\" means an employee of the Natural Resources Department designated by the commissioner.\n\"Open fire\" or \"open burning\" means a fire burning in matter, whether concentrated or dispersed, which is not contained within a fully enclosed firebox, structure or vehicle and from which the products of combustion are emitted directly to the open atmosphere without passing through a stack, duct or chimney.\n\"Wildfire\" means a fire requiring suppression action, burning any forest, brush, grassland, cropland, or any other vegetative material.\n\"Campfire\" means a fire set for cooking, warming, or ceremonial purposes, which is not more than three feet in diameter by three feet high, and has had the ground five feet from the base of the fire cleared of all combustible material.\n\"Snow-covered\" means that the ground has a continuous, unbroken cover of snow, to a depth of three inches or more, surrounding the immediate area of the fire sufficient to keep the fire from spreading.\n\"Community forest\" means public and private trees and associated plants occurring individually, in small groups, or under forest conditions within a municipality.\n\"Prescribed burn\" means a fire that is intentionally ignited, managed, and controlled for the purpose of managing forests, prairies, or wildlife habitats by an entity meeting certification requirements established by the commissioner. A prescribed burn that has exceeded its prescribed boundaries and requires immediate suppression action by a local fire department or other agency with wildfire suppression responsibilities is considered a wildfire.",
	"repealed": false
}