{
	"id": "473.167",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.167",
	"title": "473.167 HIGHWAY PROJECTS.",
	"text": "MS 1994 [Renumbered 473.166]\n(a) The council may make loans to counties, towns, and statutory and home rule charter cities within the metropolitan area for the purchase of property within the right-of-way of a state trunk highway shown on an official map adopted pursuant to section 394.361 or 462.359 or for the purchase of property within the proposed right-of-way of a principal or intermediate arterial highway designated by the council as a part of the metropolitan highway system plan and approved by the council pursuant to section 473.166. The loans shall be made by the council, from the fund established pursuant to this subdivision, for purchases approved by the council. The loans shall bear no interest.\n(b) The council shall make loans only:\n(1) to accelerate the acquisition of primarily undeveloped property when there is a reasonable probability that the property will increase in value before highway construction, and to update an expired environmental impact statement on a project for which the right-of-way is being purchased;\n(2) to avert the imminent conversion or the granting of approvals which would allow the conversion of property to uses which would jeopardize its availability for highway construction;\n(3) to advance planning and environmental activities on highest priority major metropolitan river crossing projects, under the transportation development guide chapter/policy plan; or\n(4) to take advantage of open market opportunities when developed properties become available for sale, provided all parties involved are agreeable to the sale and funds are available.\n(c) The council shall not make loans for the purchase of property at a price which exceeds the fair market value of the property or which includes the costs of relocating or moving persons or property. The eminent domain process may be used to settle differences of opinion as to fair market value, provided all parties agree to the process.\n(d) A private property owner may elect to receive the purchase price either in a lump sum or in not more than four annual installments without interest on the deferred installments. If the purchase agreement provides for installment payments, the council shall make the loan in installments corresponding to those in the purchase agreement. The recipient of an acquisition loan shall convey the property for the construction of the highway at the same price which the recipient paid for the property. The price may include the costs of preparing environmental documents that were required for the acquisition and that were paid for with money that the recipient received from the loan fund. Upon notification by the council that the plan to construct the highway has been abandoned or the anticipated location of the highway changed, the recipient shall sell the property at market value in accordance with the procedures required for the disposition of the property. All rents and other money received because of the recipient's ownership of the property and all proceeds from the conveyance or sale of the property shall be paid to the council. If a recipient is not permitted to include in the conveyance price the cost of preparing environmental documents that were required for the acquisition, then the recipient is not required to repay the council an amount equal to 40 percent of the money received from the loan fund and spent in preparing the environmental documents.\n(e) The proceeds of the tax authorized by subdivision 3, all money paid to the council by recipients of loans, and all interest on the proceeds and payments shall be maintained as a separate fund. For administration of the loan program, the council may expend from the fund each year an amount no greater than three percent of the amount of the proceeds for that year.\n(a) The council may make loans to acquiring authorities within the metropolitan area to purchase homestead property located in a proposed state trunk highway right-of-way or project, and to provide relocation assistance. Acquiring authorities are authorized to accept the loans and to acquire the property. Except as provided in this subdivision, the loans shall be made as provided in subdivision 2. Loans shall be in the amount of the fair market value of the homestead property plus relocation costs and less salvage value. Before construction of the highway begins, the acquiring authority shall convey the property to the commissioner of transportation at the same price it paid, plus relocation costs and less its salvage value. Acquisition and assistance under this subdivision must conform to sections 117.50 to 117.56.\n(b) The council may make loans only when:\n(1) the owner of affected homestead property requests acquisition and relocation assistance from an acquiring authority;\n(2) federal or state financial participation is not available;\n(3) the owner is unable to sell the homestead property at its appraised market value because the property is located in a proposed state trunk highway right-of-way or project as indicated on an official map or plat adopted under section 160.085, 394.361, or 462.359; and\n(4) the council agrees to and approves the fair market value of the homestead property, which approval shall not be unreasonably withheld.\n(c) For purposes of this subdivision, the following terms have the meanings given them.\n(1) \"Acquiring authority\" means counties, towns, and statutory and home rule charter cities in the metropolitan area.\n(2) \"Homestead property\" means: (i) a single-family dwelling occupied by the owner, and the surrounding land, not exceeding a total of ten acres; or (ii) a manufactured home, as defined in section 327B.01, subdivision 13.\n(3) \"Salvage value\" means the probable sale price of the dwelling and other property that is severable from the land if offered for sale on the condition that it be removed from the land at the buyer's expense, allowing a reasonable time to find a buyer with knowledge of the possible uses of the property, including separate use of serviceable components and scrap when there is no other reasonable prospect of sale.\nThe council may levy a tax on all taxable property in the metropolitan area, as defined in section 473.121, to provide funds for loans made pursuant to subdivisions 2 and 2a. This tax for the right-of-way acquisition loan fund shall be certified by the council, levied, and collected in the manner provided by section 473.13. The tax shall be in addition to that authorized by section 473.249 and any other law and shall not affect the amount or rate of taxes which may be levied by the council or any metropolitan agency or local governmental unit. The amount of the levy shall be as determined and certified by the council, provided that the tax levied by the Metropolitan Council for the right-of-way acquisition loan fund shall not exceed $2,828,379 for taxes payable in 2004 and $2,828,379 for taxes payable in 2005. The amount of the levy for taxes payable in 2006 and subsequent years shall not exceed the product of (1) the Metropolitan Council's property tax levy limitation under this subdivision for the previous year, multiplied by (2) one plus a percentage equal to the growth in the implicit price deflator as defined in section 275.70, subdivision 2.\nMS 1996 [Repealed, 1996 c 464 art 1 s 12]\nThe commissioner of revenue shall certify the council's levy limitation under this section to the council by August 1 of the levy year. The council must certify its proposed property tax levy to the commissioner of revenue by September 1 of the levy year. The commissioner of revenue shall annually determine whether the property tax for the right-of-way acquisition loan fund certified by the Metropolitan Council for levy following the adoption of its proposed budget is within the levy limitation imposed by this section. The determination must be completed prior to September 10 of each year. If current information regarding market valuation in any county is not transmitted to the commissioner in a timely manner, the commissioner may estimate the current market valuation within that county for purposes of making the calculation.\nMS 1994 [Repealed, 1996 c 464 art 1 s 12]",
	"repealed": false
}