{
	"id": "469.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.013",
	"title": "469.013 ACCOUNTING.",
	"text": "Each authority shall keep an accurate account of all its activities and of all its receipts and expenditures. The authority shall annually, in January for accounts kept on a calendar year basis, and within 30 days of the end of its fiscal year for accounts kept on a fiscal year basis, make a report on the accounts to the commissioner of employment and economic development, the state auditor, and the governing body of the city. The reports shall be in a form prescribed by the commissioner of employment and economic development. All powers conferred and duties imposed upon the state auditor with respect to state and county officers, institutions, property, and improvements shall also be exercised and performed by the state auditor with respect to authorities, except the power to prescribe the form of reports or accounts provided in sections 469.001 to 469.047. The state auditor shall make audits of the low-rent public housing funds of the authorities that are deemed to be in the public interest, and shall file a written report covering the audits with the authority, the city clerk of the municipality, and the commissioner of employment and economic development. The first report of the state auditor shall include all expenditures and activities of the local authority from the creation of the authority. Each authority shall be liable to the state and shall pay all costs and expenses of the examination, from funds available for those purposes.\nThe commissioner of employment and economic development may investigate the affairs of authorities and their dealings, transactions, and relationships. The commissioner may examine the properties and records of authorities and prescribe methods of accounting and the rendering of periodical reports in relation to projects undertaken by authorities. In prescribing the form of accounts the commissioner of employment and economic development shall take into consideration any requirements of the federal government under any contract with an authority. The commissioner of employment and economic development may adopt, amend, and repeal rules prescribing standards and stating principles governing the planning, construction, maintenance, and operation of projects by authorities. Compliance with sections 469.001 to 469.047 and the rules adopted by the commissioner of employment and economic development may be enforced by the commissioner by a proceeding in equity.",
	"repealed": false
}