{
	"id": "13.599",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.599",
	"title": "13.599 GRANTS.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Completion of the evaluation process\" means that the granting agency has completed negotiating the grant agreement with the selected grantee.\n(b) \"Grant agreement\" has the meaning given in section 16B.97, subdivision 1.\n(c) \"Grantee\" means a person that applies for or receives a grant.\n(d) \"Granting agency\" means the state agency that provides the grant.\n(e) \"Opened\" means the act that occurs once the deadline for submitting a response to a proposal to the granting agency has been reached.\n(f) \"Request for proposal\" means the data outlining the responsibilities the granting agency wants the grantee to assume.\n(g) \"Response\" means the data submitted by a grantee as required by a request for proposal.\nData created by a granting agency to create a request for proposal is classified as nonpublic until the request for proposal is published. To the extent that a granting agency involves persons outside the granting agency to create the request for proposal, the data remain nonpublic in the hands of all persons who may not further disseminate any data that are created or reviewed as part of the request for proposal development. At publication, the data in the request for proposal is public.\n(a) Responses submitted by a grantee are private or nonpublic until the responses are opened. Once the responses are opened, the name and address of the grantee and the amount requested is public. All other data in a response is private or nonpublic data until completion of the evaluation process. After a granting agency has completed the evaluation process, all remaining data in the responses is public with the exception of trade secret data as defined and classified in section 13.37. A statement by a grantee that the response is copyrighted or otherwise protected does not prevent public access to the response.\n(b) If all responses are rejected prior to completion of the evaluation process, all data, other than that made public at the opening, remain private or nonpublic until a resolicitation of proposals results in completion of the evaluation process or a determination is made to abandon the grant. If the rejection occurs after the completion of the evaluation process, the data remain public. If a resolicitation of proposals does not occur within one year of the grant opening date, the remaining data become public.\n(a) Data created or maintained by a granting agency as part of the evaluation process referred to in this section are protected nonpublic data until completion of the evaluation process at which time the data are public with the exception of trade secret data as defined and classified in section 13.37.\n(b) If a granting agency asks individuals outside the granting agency to assist with the evaluation of the responses, the granting agency may share not public data in the responses with those individuals. The individuals participating in the evaluation may not further disseminate the not public data they review.\nNotwithstanding subdivision 3, responses submitted by a grantee to the State Arts Board or to a regional arts council under chapter 129D become public data at the public review meeting at which they are considered, except for trade secret data as defined and classified in section 13.37.",
	"repealed": false
}