{
	"id": "115A.97",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.97",
	"title": "115A.97 SPECIAL WASTE; INCINERATOR ASH.",
	"text": "(a) It is the policy of the legislature that mixed municipal solid waste incinerators be planned and managed to achieve to the maximum extent feasible and prudent:\n(1) reduction of the toxicity of incinerator ash;\n(2) reduction of the quantity of the incinerator ash; and\n(3) reduction of the quantity of waste processing residuals that require disposal.\n(b) The purpose of this section is to establish temporary and permanent programs to achieve these reduction goals.\n(a) For the purposes of this section the following terms have the meanings given them.\n(b) \"Incinerator ash\" means ash resulting from the combustion of mixed municipal solid waste and ash resulting from the combustion of refuse-derived fuel.\n(c) \"Noncombustible fraction\" means constituents of mixed municipal solid waste, including glass, ferrous metals, nonferrous metals and other inorganics, that, when burned, disproportionately add to the quantity of incinerator ash.\nThe agency shall adopt rules to establish techniques to measure the noncombustible fraction of mixed municipal solid waste prior to incineration or processing into refuse-derived fuel and for at least the testing, management, and disposal of incinerator ash. The rules must be designed to meet the goals in subdivision 1.\n[Repealed, 1996 c 310 s 1]\nA county solid waste plan, or revision of a plan, that includes incineration of mixed municipal solid waste must clearly state how the county plans to meet the goals in subdivision 1 of reducing the toxicity and quantity of incinerator ash and of reducing the quantity of processing residuals that require disposal. The commissioner, in cooperation with the counties, may develop guidelines for counties to use to identify ways to meet the goals in subdivision 1.\nAn application for a permit to build or operate a mixed municipal solid waste incinerator, including an application for permit renewal, must clearly state how the applicant will achieve the goals in subdivision 1 of reducing the toxicity and quantity of incinerator ash and of reducing the quantity of processing residuals that require disposal. The agency, in cooperation with the counties, may develop guidelines for applicants to use to identify ways to meet the goals in subdivision 1.",
	"repealed": false
}