{
	"id": "390.0065",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.0065",
	"title": "390.0065 HENNEPIN COUNTY MEDICAL EXAMINER; SELECTION AND TERM.",
	"text": "Hennepin County shall use the following procedure to select the Hennepin County medical examiner: the Hennepin County Board shall designate three licensed physicians who shall constitute a Medical Examiner Board. One member shall be a dean or professor of the Department of Pathology of a Class A medical school as designated by the American Medical Association. Another member of the board shall be a member of the Minnesota Society of Pathologists. The third member shall be designated by the Hennepin County Medical Association from its membership. The Medical Examiner Board shall accept applications for the position of Hennepin County medical examiner when a vacancy exists in the office. Applications therefore shall be considered from doctors of medicine who are: (1) graduates of a medical school recognized by the American Medical Association or American Osteopathic Association, (2) members in good standing in the medical profession, (3) eligible for appointment to the staff of the Hennepin County Medical Center, and (4) certified or eligible for certification in forensic pathology by the American Board of Pathology. The Medical Examiner Board shall review the qualifications of the applicants and shall rank the applicants deemed qualified for the position and provide to the county board a report of the seven highest ranked applicants together with their qualifications. The county board shall appoint a county medical examiner from those listed in the report. The term of the examiner shall continue for four years from the date of appointment. Reappointment shall be made at least 90 days prior to the expiration of the term. If a vacancy requires a temporary appointment, the board of commissioners shall appoint a medical doctor on the staff of the county medical examiner's office to assume the duties of the medical examiner until an appointment can be made in compliance with the specified selection procedure. Actual and necessary expenses of the Medical Examiner Board shall be paid in accordance with sections 471.38 to 471.415.",
	"repealed": false
}