{
	"id": "223.177",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.177",
	"title": "223.177 PURCHASE BY VOLUNTARY EXTENSION OF CREDIT CONTRACTS.",
	"text": "Every grain buyer who intends to purchase grain by voluntary extension of credit contracts shall indicate the intention to do so annually to the commissioner on a form provided by the commissioner.\nAny grain buyer entering into a voluntary extension of credit contract orally or by phone shall give or mail to the seller a written confirmation conforming to the requirements of section 223.175 within 30 days of entering the voluntary extension of credit contract. Written confirmation of oral contracts must meet the requirements of subdivision 3.\nA voluntary extension of credit contract must be reduced to writing by the grain buyer, mailed or given to the seller, and signed by both buyer and seller within 30 days of the date of delivery of the grain. The form of the contract shall comply with the requirements of section 223.175. A grain buyer may use an electronic version of a voluntary extension of credit contract that contains the same information as a written document and that conforms to the requirements of this chapter to which a seller has applied an electronic signature in place of a written document. There must not at any time be an electronic and paper voluntary extension of credit contract representing the same lot of grain.\nA licensed grain buyer purchasing grain by voluntary extension of credit contracts shall at all times maintain grain, rights in grain, or proceeds from the sale of grain totaling 90 percent of the grain buyer's obligation for grain purchased by voluntary extension of credit contracts. That amount must be evidenced or represented by one or more of the following:\n(1) grain owned and actually held by the grain buyer in a grain warehouse owned or controlled by the grain buyer;\n(2) rights in grain evidenced or represented by warehouse receipts issued by a state or federally licensed grain warehouse;\n(3) cash on hand or cash held on account in federally or state licensed institutions;\n(4) short-term investments held in time accounts with federally or state licensed institutions;\n(5) balances on grain margin accounts;\n(6) voluntary extension of credit contracts for grain shipped to a processor or terminal as purchaser, less any payment or advance that has been received;\n(7) an irrevocable letter of credit, as defined in section 336.5-102; or\n(8) other evidence of proceeds from the sale of grain acceptable to the commissioner.\nFor the purpose of computing the dollar value of inventories of voluntary extension of credit obligations, the value of grain must be figured at the current market price on the day of delivery.\nThe title to grain delivered on a voluntary extension of credit contract transfers to the grain buyer upon delivery.\nNo storage charges may be charged with respect to grain purchased on voluntary extension of credit contracts.\nA grain buyer shall keep sufficiently detailed books and records of voluntary extension of credit contracts and evidences of grain, rights in grain, and the proceeds from the sale of grain so as to clearly show compliance with this section. The commissioner or the commissioner's authorized agent may inspect these books and records to determine whether grain buyers are complying with the provisions of this chapter, and for this purpose the commissioner may enter upon any public or private premises during regular business hours.",
	"repealed": false
}