{
	"id": "124D.522",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.522",
	"title": "124D.522 ADULT BASIC EDUCATION SUPPLEMENTAL SERVICE GRANTS.",
	"text": "(a) The commissioner, in consultation with the policy review task force under section 124D.521, may make grants to nonprofit organizations to provide services that are not offered by a district adult basic education program or that are supplemental to either the statewide adult basic education program, or a district's adult basic education program. The commissioner may make grants for: staff development for adult basic education teachers and administrators; training for volunteer tutors; training, services, and materials for serving disabled students through adult basic education programs; statewide promotion of adult basic education services and programs; development and dissemination of instructional and administrative technology for adult basic education programs; programs which primarily serve communities of color; adult basic education distance learning projects, including television instruction programs; initiatives to accelerate English language acquisition and the achievement of career and college ready skills among English learners; and other supplemental services to support the mission of adult basic education and innovative delivery of adult basic education services.\n(b) The commissioner must establish eligibility criteria and grant application procedures. Grants under this section must support services throughout the state, focus on educational results for adult learners, and promote outcome-based achievement through adult basic education programs. Beginning in fiscal year 2002, the commissioner may make grants under this section from the state total adult basic education aid set aside for supplemental service grants under section 124D.531. Up to one-fourth of the appropriation for supplemental service grants must be used for grants for adult basic education programs to encourage and support innovations in adult basic education instruction and service delivery. A grant to a single organization cannot exceed 40 percent of the total supplemental services aid. Nothing in this section prevents an approved adult basic education program from using state or federal aid to purchase supplemental services.",
	"repealed": false
}