{
	"id": "148.9987",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9987",
	"title": "148.9987 EXCEPTIONS TO LICENSE REQUIREMENT.",
	"text": "(a) Sections 148.9981 to 148.9995 must not be construed to prohibit or restrict:\n(1) the practice of an individual who is licensed to practice psychology in the state or an individual who is providing psychological services under the supervision of a licensed psychologist in accordance with section 148.925;\n(2) the practice of any other profession or occupation licensed, certified, or registered by the state by an individual duly licensed, certified, or registered to practice the profession or occupation or to perform any act that falls within the scope of practice of the profession or occupation;\n(3) an individual who is employed by a school district from providing behavior analysis services as part of the individual's employment with the school district, so long as the individual does not provide behavior analysis services to any person or entity other than as an employee of the school district or accept remuneration for the provision of behavior analysis services outside of the individual's employment with the school district;\n(4) an employee of a program licensed under chapter 245D from providing the services described in section 245D.091, subdivision 1;\n(5) teaching behavior analysis or conducting behavior analysis research if the teaching or research does not involve the direct delivery of behavior analysis services;\n(6) providing behavior analysis services by an unlicensed supervisee or trainee under the authority and direction of a licensed behavior analyst and in compliance with the licensure and supervision standards required by law or rule;\n(7) a family member or guardian of the recipient of behavior analysis services from performing behavior analysis services under the authority and direction of a licensed behavior analyst; or\n(8) students or interns enrolled in an accredited school or educational program, or participating in a behavior analysis practicum, from engaging in the practice of applied behavior analysis while supervised by a licensed behavior analyst or instructor of an accredited school or educational program. These individuals must be designated as a behavior analyst student or intern.\n(b) Notwithstanding paragraph (a), a licensed psychologist may supervise an unlicensed supervisee, trainee, student, or intern who is engaged in the practice of behavior analysis if the supervision is authorized under the Minnesota Psychology Practice Act.",
	"repealed": false
}