{
	"id": "116J.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.035",
	"title": "116J.035 POWERS OF COMMISSIONER; RULES.",
	"text": "(a) The commissioner may:\n(1) apply for, receive, and expend money from municipal, county, regional, and other government agencies;\n(2) apply for, accept, and disburse grants and other aids from other public or private sources;\n(3) contract for professional services if such work or services cannot be satisfactorily performed by employees of the department or by any other state agency;\n(4) enter into interstate compacts to jointly carry out such research and planning with other states or the federal government where appropriate;\n(5) distribute informational material at no cost to the public upon reasonable request; and\n(6) enter into contracts necessary for the performance of the commissioner's duties with federal, state, regional, metropolitan, local, and other agencies or units of government; educational institutions, including the University of Minnesota. Contracts made pursuant to this section shall not be subject to the competitive bidding requirements of chapter 16C.\n(b) The commissioner may apply for, receive, and expend money made available from federal or other sources for the purpose of carrying out the duties and responsibilities of the commissioner pursuant to this chapter.\n(c) All moneys received by the commissioner pursuant to this chapter shall be deposited in the state treasury and, subject to section 3.3005, are appropriated to the commissioner for the purpose for which the moneys have been received. The money shall not cancel and shall be available until expended.\nIn order to best carry out duties and responsibilities and to serve the people of the state in the promotion of tourism, trade, and economic development, the commissioner may engage in programs and projects jointly with a private person, firm, corporation or association and may enter into contracts under terms to be mutually agreed upon to carry out such programs and projects not including acquisition of land or buildings. Contracts may be negotiated and are not subject to the provisions of chapter 16C relating to competitive bidding.\nThe commissioner may adopt rules pursuant to chapter 14 as necessary to carry out the commissioner's duties and responsibilities.\n[Repealed, 1987 c 403 art 2 s 164]\nThe commissioner may delegate, in written orders filed with the secretary of state, any powers or duties subject to the commissioner's control to officers and employees in the department. Regardless of any other law, the commissioner may delegate the execution of specific contracts or specific types of contracts to the commissioner's deputies, an assistant commissioner, or a program director if the delegation has been approved by the commissioner of administration and filed with the secretary of state.\nThe commissioner may conduct and administer demonstration projects to test methods and procedures for providing employment and training services. The demonstration must provide new methods and procedures of administration and must not conflict with the basic purposes, coverage, or benefits provided by law. No demonstration project authorized by this section is effective until any required approval by a federal agency is obtained and the comprehensive plan, including the estimated project costs, is filed with the commissioner of administration.\n(a) The commissioner may:\n(1) apply for, accept, and disburse gifts, bequests, grants, payments for services, loans, or other property from the United States, the state, private foundations, or any other source;\n(2) enter into an agreement required for the gifts, grants, or loans; and\n(3) hold, use, and dispose of its assets according to the terms of the gift, grant, loan, or agreement.\n(b) Money received by the commissioner under this subdivision must be deposited in a separate account in the state treasury and invested by the State Board of Investment. The amount deposited, including investment earnings, is appropriated to the commissioner to carry out duties under this section.\n(c) Money received by the commissioner under this subdivision for State Services for the Blind is exempt from depositing gifts, bequests, charitable contributions, and similar contributions made solely into the state treasury.\nThe commissioner shall monitor the activities and outcomes of programs and services funded by legislative appropriations and administered by the department on a pass-through basis. Unless amounts are otherwise appropriated for administrative costs, the commissioner may retain up to five percent of the amount appropriated to the department for grants to pass-through entities. Amounts retained are deposited to a special revenue account and are appropriated to the commissioner for costs incurred in administering and monitoring the pass-through grants.\n(a) The commissioner of employment and economic development shall, through the multiagency collaboration called \"Minnesota Business First Stop,\" ensure the coordination, development, implementation, and administration of state permits, including:\n(1) establishing a mechanism in state government that will coordinate administrative decision-making procedures and related quasijudicial and judicial review pertaining to permits related to the state's air, land, and water resources;\n(2) providing coordination and understanding between federal, state, and local governmental units in the administration of the various programs relating to air, water, and land resources;\n(3) identifying all existing state permits, reviews, and other approvals, compliance schedules, or other programs that pertain to the use of natural resources and protection of the environment; and\n(4) recommending legislative or administrative modifications to existing permit programs to increase their efficiency and utility.\n(b) A person proposing a project may apply to Minnesota Business First Stop for assistance in obtaining necessary state permits, reviews, and other approvals. Upon request, the commissioner shall to the extent practicable:\n(1) provide a list of all federal, state, and local permits and other required reviews and approvals for the project;\n(2) provide a plan that will coordinate federal, state, and local administrative decision-making practices, including monitoring, analysis and reporting, public comments and hearings, and issuances of permits and approvals;\n(3) provide a timeline for the issuance of all federal, state, and local permits and other reviews and approvals required for the project;\n(4) coordinate the execution of any memorandum of understanding between the person proposing a project and any federal, state, or local agency;\n(5) coordinate all federal, state, or local public comment periods and hearings; and\n(6) provide other assistance requested to facilitate final approval and issuance of all federal, state, and local permits and other approvals required for the project.\n(c) Notwithstanding section 16A.1283, as necessary, the commissioner may negotiate a schedule to assess the project proposer for reasonable costs that any state agency incurs in the coordination, development, implementation, and administration of state permits, and the proposer shall pay the assessed costs to the commissioner. Money received by the commissioner must be credited to an account in the special revenue fund and is appropriated to the commissioner to cover the assessed costs incurred.\n(d) Reimbursement by a project proposer shall precede and not be contingent upon issuance of a permit and shall not affect any state agency's decision on whether to issue or deny a permit, what conditions are included in a permit, or the application of state and federal statutes and rules governing permit determinations.\n(e) The coordination of the development, implementation, and administration of state permits is not governmental action under section 116D.04.",
	"repealed": false
}