{
	"id": "103G.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.245",
	"title": "103G.245 WORK IN PUBLIC WATERS.",
	"text": "Except as provided in subdivisions 2, 11, and 12, the state, a political subdivision of the state, a public or private corporation, or a person must have a public-waters-work permit to:\n(1) construct, reconstruct, remove, abandon, transfer ownership of, or make any change in a reservoir, dam, or waterway obstruction on public waters; or\n(2) change or diminish the course, current, or cross section of public waters, entirely or partially within the state, by any means, including filling, excavating, or placing of materials in or on the beds of public waters.\nA public-waters-work permit is not required for:\n(1) work in altered natural watercourses that are part of drainage systems established under chapter 103D or 103E if the work in the waters is undertaken according to chapter 103D or 103E;\n(2) a drainage project for a drainage system established under chapter 103E that does not substantially affect public waters; or\n(3) culvert restoration or replacement of the same size and elevation, if the restoration or replacement does not impact a designated trout stream.\nApplication for a public-waters-work permit must be in writing to the commissioner on forms prescribed by the commissioner. The commissioner may issue a state general permit to a governmental subdivision or to the general public under which more than one project may be conducted under a single permit.\n(a) The following definitions apply to this subdivision:\n(1) \"boathouse\" means a structure or watercraft that is moored by spuds, cables, ropes, anchors, or chains that may be intended for habitation and has walls, a roof, and either an open well for boats or a floor from wall to wall and does not include watercraft that are designed and operated as motorboats;\n(2) \"motorboat\" means a watercraft that is designed for and is capable of navigation on the water and that has an adequately sized external or internal mechanical propulsion system for the type of watercraft; and\n(3) \"boat storage structure\" means a structure that is used for storing boats or float planes.\n(b) Boathouses and boat storage structures are prohibited on public waters of Minnesota, except as allowed by paragraphs (c) to (f).\n(c) The commissioner may issue a public-waters-work permit for boathouses, when approved by the local governmental unit and:\n(1) only in areas of historic use for the structures, as determined by the commissioner, and where the boathouse was in existence on public waters prior to January 1, 1997; or\n(2) where the boathouse serves as a public service structure within a permitted commercial marina.\n(d) A boathouse in existence on public waters prior to January 1, 1997, may be repaired or replaced, provided that the repairs or replacement are consistent with the permit issued by the commissioner under paragraph (c).\n(e) The commissioner may issue a public-waters-work permit for the repair or replacement of boat storage structures when:\n(1) approved by the local governmental unit;\n(2) the boat storage structure was in existence prior to 1979 and is currently used for boat storage;\n(3) the boat storage structure is not habitable and is not connected to a sewage system;\n(4) the local government unit has had the opportunity to review the boat storage structure application and has not provided written comments opposing the application;\n(5) the total area of boat storage structures on the applicant's property and on public waters adjacent to the applicant's property is not increased;\n(6) the height of boat storage structures is not increased more than one foot, unless boat storage structures are consolidated and the same pitch roof results in an increased height; and\n(7) the public-waters-work permit with the specific dimensions and location of the boat storage structure is recorded in the real estate records of the office of the county recorder or registrar of titles in the county in which the applicant's property is located.\n(f) A boat storage structure may be repaired, replaced, or consolidated, provided that the repairs, replacement, or consolidation are consistent with the permit issued by the commissioner under paragraph (e). The repair or replacement of a boat storage structure may include:\n(1) the replacement of the foundation of the boat storage structure, provided that the material below the ordinary high-water mark is not toxic to aquatic life; and\n(2) the consolidation of multiple boat storage structures.\n(g) Notwithstanding sections 103F.201 to 103F.221, and rules adopted under those sections, the local zoning authority may approve a boat storage structure that is at or above the ordinary high-water level to replace a boat storage structure that is at or below the ordinary high-water level of a public water if the boat storage structure was in existence prior to 1979. The replacement boat storage structure may not exceed the total area of the boat storage structure being replaced. A boat storage structure that is replaced under this paragraph must be removed prior to building the replacement structure.\n(a) The commissioner may delegate public-waters-work permit authority to the appropriate county or municipality or to watershed districts or watershed management organizations that have elected to assert local authority over protected waters. The public-waters-work permit authority must be delegated under guidelines of the commissioner and the delegation must be done by agreement with the involved county, municipality, watershed district, or water management organization and in compliance with section 103G.315.\n(b) For projects affecting public waters wetlands and for wetland areas of public waters affected by a public transportation project as determined by the commissioner, the commissioner may waive the requirement for a public-waters-work permit if the local government unit makes a replacement, no-loss, or exemption determination in compliance with sections 103A.201, 103B.3355, and 103G.222 to 103G.2372, and rules adopted pursuant to these same sections.\n(c) For projects affecting both public waters and wetlands, the local government unit may, by written agreement with the commissioner, waive the requirement for a replacement plan, no-loss, or exemption determination if a public-waters-work permit is required and the commissioner includes the provisions of sections 103A.201, 103B.3355, and 103G.222 to 103G.2372, and rules adopted pursuant to these same sections in the public-waters-work permit.\nA public-waters-work permit may not be issued under this section if the project does not conform to state, regional, and local water and related land resources management plans.\n(a) A public-waters-work permit may be issued only if the project will involve a minimum encroachment, change, or damage to the environment, particularly the ecology of the waterway.\n(b) If a major change in the resource is justified, public-waters-work permits must include provisions to compensate for the detrimental aspects of the change.\nPublic-waters-work permits for projects that involve excavation in the beds of public waters may be granted only if:\n(1) the area where the excavation will take place is covered by a shoreland zoning ordinance approved by the commissioner;\n(2) the work under the permit is consistent with the shoreland zoning ordinance; and\n(3) the permit includes provisions for the deposition of excavated materials.\n(a) A public-waters-work permit for a project affecting floodwaters may be granted only if:\n(1) the area covered by the public-waters-work permit is governed by a floodplain management ordinance approved by the commissioner; and\n(2) the conduct authorized by the public-waters-work permit is consistent with the floodplain management ordinance, if the commissioner has determined that enough information is available for the adoption of a floodplain ordinance.\n(b) A public-waters-work permit involving the control of floodwaters by structural means, such as dams, dikes, levees, and channel improvements, may be granted only after the commissioner has considered all other flood damage reduction alternatives. In developing a policy on placing emergency levees along the banks of public waters under emergency flood conditions, the commissioner shall consult and cooperate with the office of emergency services.\n(a) A public-waters-work permit that will change the level of public waters may not be issued unless:\n(1) the shoreland adjacent to the waters to be changed is governed by a shoreland zoning ordinance approved by the commissioner; and\n(2) the change in water level is consistent with the shoreland zoning ordinance.\n(b) Standards and procedures for use in deciding the level of public waters must ensure that the rights of all persons are protected when public water levels are changed and must provide for:\n(1) technical advice to persons involved;\n(2) establishing alternatives to help local agencies resolve water level conflicts; and\n(3) mechanics necessary for local resolution of water problems within the state guidelines.\n(a) The owner of a dam, reservoir, control structure, or waterway obstruction may make repairs that are immediately necessary in case of emergency without a public-waters-work permit under subdivision 1. The owner must immediately notify the commissioner of the emergency and of the emergency repairs being made. The owner must apply for a public-waters-work permit for the emergency repairs and necessary permanent repairs as soon as practicable.\n(b) This subdivision does not apply to routine maintenance not affecting the safety of the structures.\n(c) If the commissioner declares there is an emergency and repairs or remedial action are immediately necessary to safeguard life and property, the repairs, remedial action, or both, must be started immediately by the owner.\nThe owner of a dam, reservoir, control structure, or waterway obstruction constructed before a public-waters-work permit was required by law must maintain and operate the dam, reservoir, control structure, or waterway obstruction in a manner approved and prescribed by rule by the commissioner.",
	"repealed": false
}