{
	"id": "469.312",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.312",
	"title": "469.312 JOB OPPORTUNITY BUILDING ZONES; LIMITATIONS.",
	"text": "A job opportunity building zone may not exceed 5,000 acres. For a zone designated as an agricultural processing facility zone, the zone also may not exceed the size of a site necessary for the agricultural processing facility, including ancillary operations and space for expansion in the reasonably foreseeable future. For a zone designated as a create automotive recovery zone, the zone also may not exceed the size of the site necessary for the assembly of motor vehicles, including ancillary operations and space for expansion in the reasonably foreseeable future.\nThe area of a job opportunity building zone may consist of one or more noncontiguous areas or subzones.\nExcept for a create automotive recovery zone, the area of a job opportunity building zone must be located outside of the metropolitan area, as defined in section 473.121, subdivision 2.\n(a) The area of a job opportunity building zone may not include the area of a border city development zone designated under section 469.1731. The city may remove property from a border city development zone contingent upon the area being designated as a job opportunity building zone. Before removing a parcel of property from a border city development zone, the city must obtain the written consent to the removal from each recipient that is located on the parcel and receives incentives under the border city development zone. Consent of any other property owner or taxpayer in the border city development zone is not required.\n(b) A city may not provide tax incentives under section 469.1734 to individuals or businesses for operations or activity in a job opportunity building zone.\n(a) The maximum duration of a zone is 12 years. The applicant may request a shorter duration. The commissioner may specify a shorter duration, regardless of the requested duration.\n(b) The duration limit under this subdivision and the duration of the zone for purposes of allowance of tax incentives described in section 469.315 is extended by three calendar years for each parcel of property that meets the following requirements:\n(1) the qualified business operates an ethanol plant, as defined in section 41A.09, on the site that includes the parcel; and\n(2) the business subsidy agreement was executed after April 30, 2006.\n(c) The duration limit under this subdivision and the duration of the zone for purposes of allowance of tax incentives described in section 469.315 is extended by five calendar years for each parcel of property that meets the following requirements:\n(1) the parcel is located in a county with an unemployment rate that on the date that the business subsidy agreement is executed (i) equals or exceeds ten percent or (ii) is ten percent higher than the statewide average;\n(2) the operations of the qualified business on the site include:\n(i) its headquarters;\n(ii) facilities for research and development; and\n(iii) the manufacturing of products, used by the building, transport, consumer products, and industrial products sectors, that reduce the use of or increase the efficiency of the use of energy resources and that are manufactured using innovative and high technology processes; and\n(3) the business subsidy agreement is executed after July 1, 2009, and before July 1, 2011.\n(d) The duration of a create automotive recovery zone is 12 years from the date of the designation of a zone by the commissioner under section 469.314, subdivision 4, paragraph (g).\n(e) The duration limit under this subdivision and the duration of the zone for purposes of allowance of tax incentives described in section 469.315 is extended by five calendar years for each parcel of property that meets the following requirements:\n(1) the parcel is located in a county with an unemployment rate for any of the 12 months preceding the date on which the business subsidy agreement is executed that (i) equals or exceeds ten percent or (ii) is ten percent higher than the statewide average;\n(2) the qualified business is engaged in the business of manufacturing wind turbines and related products for the generation of energy, and the parcel includes one or more of the following facilities of the qualified business:\n(i) the headquarters of the business in this country;\n(ii) training facilities; or\n(iii) manufacturing facilities; and\n(3) the initial business subsidy agreement is executed after July 1, 2010, and before November 1, 2011.",
	"repealed": false
}