{
	"id": "148E.060",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.060",
	"title": "148E.060 TEMPORARY LICENSES.",
	"text": "(a) To be issued a temporary license to practice social work, an applicant who is a student as defined in section 148E.010 or a person not licensed or credentialed to practice social work in any jurisdiction must provide evidence satisfactory to the board that the applicant:\n(1) has submitted a current application for a license under section 148E.055;\n(2) has submitted the required fees and documentation for the criminal background check according to section 214.075;\n(3) has passed the applicable licensure examination required in section 148E.055;\n(4) has completed all requirements for a baccalaureate or graduate degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates, or a doctorate in social work from an accredited university, including all coursework and internships required to obtain the degree;\n(5) has submitted a completed, signed temporary license application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(6) has paid the fee specified in section 148E.180; and\n(7) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(b) A temporary license is effective on the day that the board receives the application and fee or on the date that all requirements are complete as specified in this subdivision, whichever date is later.\n(c) A temporary license issued under this subdivision expires on the last day of the month six months from the effective date or when a license is issued under section 148E.055, whichever date is earlier. A temporary license is nonrenewable.\n(d) In all professional use of the social worker's name, an individual with a baccalaureate or graduate temporary license must represent themselves as a Temporary License Baccalaureate Social Worker or Temporary License Graduate Social Worker. An individual with a baccalaureate or graduate temporary license must not use the credentials LSW, LGSW, LISW, or LICSW until the individual is issued a license under section 148E.055.\n(e) An individual issued a baccalaureate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 2. An individual issued a graduate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 3.\n(f) An individual issued a temporary license under this subdivision must obtain supervision in compliance with sections 148E.100 to 148E.125. Supervised practice obtained with a temporary license applies to the supervised practice requirements for a license issued under section 148E.055.\n(g) An individual issued a temporary license under this subdivision may complete continuing education in compliance with the requirements of section 148E.130. Continuing education obtained with a temporary license may be applied to the continuing education requirements of a license issued under section 148E.055.\n(a) To be issued a temporary license to practice social work, an applicant who is licensed or credentialed to practice social work in another jurisdiction must provide evidence satisfactory to the board that the applicant:\n(1) holds an active license or credential to practice social work in another jurisdiction;\n(2) has completed the criminal background check according to section 214.075 and submitted the required fees;\n(3) has submitted a completed, signed temporary license application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has paid the fee specified in section 148E.180; and\n(5) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(b) A temporary license is effective on the day that the board receives the application and fee or on the date that all requirements are complete as specified in this subdivision, whichever date is later.\n(c) A temporary license issued under this subdivision expires on the last day of the month six months from the effective date or when a license is issued under section 148E.055, whichever date is earlier. A temporary license is nonrenewable.\n(d) The board may not issue a temporary license to an individual more than one time in a 12-month period under this subdivision.\n(e) In all professional use of the social worker's name, an individual with a baccalaureate or graduate temporary license must represent themselves as a Temporary License Baccalaureate Social Worker or Temporary License Graduate Social Worker. An individual with a baccalaureate or graduate temporary license must not use the credentials LSW, LGSW, LISW, or LICSW until the individual is issued a license under section 148E.055.\n(f) An individual issued a baccalaureate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 2. An individual issued a graduate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 3, 4, or 5, consistent with the individual's license or credential in the other jurisdiction.\n(a) To be issued a temporary license to practice social work, an applicant who is a student as defined in section 148E.010 or a graduate from a program in candidacy status with the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates, must provide evidence satisfactory to the board that the applicant:\n(1) has a current application for a license under section 148E.055;\n(2) has submitted the required fees and documentation for the criminal background check according to section 214.075;\n(3) has passed the applicable licensure examination required in section 148E.055;\n(4) has completed all requirements for a baccalaureate, graduate, or doctoral degree in social work from a program in candidacy status with the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates, including all coursework and internships required to obtain the degree;\n(5) has submitted a completed, signed temporary license application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(6) has paid the fee specified in section 148E.180; and\n(7) has not engaged in conduct that is in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that is in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(b) A temporary license is effective on the day that the board receives the application and fee or on the date that all requirements are complete as specified in this subdivision, whichever date is later.\n(c) A temporary license issued under this subdivision expires on the last day of the month 12 months from the license's effective date or when a license is issued under section 148E.055, whichever date is earlier. A temporary license is nonrenewable.\n(d) A temporary license issued under this subdivision may be extended upon a showing that the social work program remains in candidacy status with the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates.\n(e) In all professional use of the social worker's name, an individual with a baccalaureate or graduate temporary license must represent themselves as a Temporary License Baccalaureate Social Worker or Temporary License Graduate Social Worker. An individual with a baccalaureate or graduate temporary license must not use the credentials LSW, LGSW, LISW, or LICSW until the individual has a license under section 148E.055.\n(f) An individual who has a baccalaureate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 2. An individual who has a graduate temporary license under this subdivision is authorized to practice social work as described in section 148E.050, subdivision 3.\n(g) An individual issued a temporary license under this subdivision must obtain supervision in compliance with sections 148E.100 to 148E.125. Supervised practice obtained with a temporary license applies to the supervised practice requirements for a license issued under section 148E.055.\n(h) An individual who has a temporary license under this subdivision may complete continuing education in compliance with the requirements of section 148E.130. An individual who earns continuing education hours with a temporary license may apply those continuing education hours to the continuing education requirements of a license under section 148E.055.\n(i) If the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates does not grant accreditation to the program in candidacy status, the board must immediately revoke the temporary license.\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2014 [Repealed, 2015 c 71 art 10 s 34]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]",
	"repealed": false
}