{
	"id": "254B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.06",
	"title": "254B.06 REIMBURSEMENT; PAYMENT; DENIAL.",
	"text": "The commissioner is responsible for all collections from persons determined to be partially responsible for the cost of care of an eligible person receiving services under Laws 1986, chapter 394, sections 8 to 20. The commissioner may initiate, or request the attorney general to initiate, necessary civil action to recover the unpaid cost of care. The commissioner may collect all third-party payments for substance use disorder services provided under Laws 1986, chapter 394, sections 8 to 20, including private insurance and federal Medicaid and Medicare financial participation. The remaining receipts must be deposited in the behavioral health fund.\nThe commissioner shall allocate 77.05 percent of patient payments and third-party payments to the special revenue account and 22.95 percent to the county financially responsible for the patient.\nThe commissioner shall pay eligible vendors for placements made by local agencies under section 254B.03, subdivision 1, and placements by tribal designated agencies according to section 254B.09. The commissioner may reduce or deny payment of the state share when services are not provided according to the placement criteria established by the commissioner. The commissioner may pay for all or a portion of improper county substance use disorder placements and bill the county for the entire payment made when the placement did not comply with criteria established by the commissioner. The commissioner may make payments to vendors and charge the county 100 percent of the payments if documentation of a county approved placement is received more than 30 working days, exclusive of weekends and holidays, after the date services began. The commissioner shall not pay vendors until private insurance company claims have been settled.\nThe commissioner shall not deny reimbursement to a program designated as an institution for mental diseases under United States Code, title 42, section 1396d, due to a reduction in federal financial participation and the addition of new residential beds.",
	"repealed": false
}