{
	"id": "462A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.03",
	"title": "462A.03 DEFINITIONS.",
	"text": "For the purpose of this chapter, the terms defined in this section have the meanings ascribed to them.\n\"Development costs\" means the costs approved by the agency as appropriate expenditures which may be incurred by sponsors of land development for residential housing or of residential housing, within this state, prior to commitment and initial advance of the proceeds of an eligible construction loan, or eligible mortgage, and for which temporary loans from the housing development fund may be made by the agency subject to the provisions of section 462A.05, subdivision 5, including but not limited to:\n(1) payments for options to purchase properties on the proposed residential housing site, deposits on contracts of purchase, or, with prior approval of the agency, payments for the purchase of such properties;\n(2) legal and organizational expenses, including payments of attorneys' fees, project manager and clerical staff salaries, office rent and other incidental expenses;\n(3) payment of fees for preliminary feasibility studies, advances for planning, engineering and architectural work;\n(4) expenses for tenant surveys and market analyses; and\n(5) necessary application and other fees.\n\"Federally insured construction loan\" means a construction loan for residential housing which is insured by the United States or an instrumentality thereof, or by a commitment by the United States or an instrumentality thereof to insure such a loan or to make mortgage insurance available for a residential housing project upon the completion thereof in accordance with federal law and regulations.\n\"Federally insured mortgage\" means a mortgage loan for residential housing which is insured or guaranteed by the United States or an instrumentality thereof, or by a commitment by the United States or an instrumentality thereof to insure such a mortgage.\n\"Federally insured security\" means an evidence of indebtedness insured or guaranteed as to repayment of principal and interest by the United States or an instrumentality thereof.\n\"Agency\" means the Minnesota Housing Finance Agency created by this chapter.\n\"Residential housing\" means a specific work or improvement within this state undertaken primarily to provide residential care facilities for mentally ill, developmentally disabled, physically disabled, and drug dependent persons licensed or potentially eligible for licensure under rules promulgated by the commissioner of human services, or to provide dwelling accommodations or manufactured home parks for persons and families of low and moderate income and for other persons and families when determined to be necessary in furtherance of the policy of economic integration stated in section 462A.02, subdivision 6, including land development and the acquisition, construction or rehabilitation of buildings and improvements thereto, for residential housing, and such other nonhousing facilities as may be incidental or appurtenant thereto.\n\"Land development\" means the process of acquiring land for residential housing construction, and of making, installing, or constructing nonresidential housing improvements, including waterlines and water supply installations, sewer lines and sewage disposal installations, steam, gas and electric lines and installations, roads, streets, curbs, gutters, sidewalks, whether on or off the site, which the agency deems necessary or desirable to prepare such land for residential housing construction within this state.\n\"Housing development fund\" means the fund established by section 462A.20. \"Bond fund\" means any fund or funds established by the agency for the disposition of the proceeds of its bonds or notes issued as authorized in sections 462A.08 to 462A.17 and any debt service reserve fund established for the security of bonds or notes pursuant to section 462A.22.\n\"Persons and families of low and moderate income\" means persons and families, irrespective of race, creed, national origin, sex, or status with respect to guardianship or conservatorship, determined by the agency to require such assistance as is made available by this chapter on account of personal or family income not sufficient to afford adequate housing. In making such determination the agency shall take into account the following: (a) The amount of the total income of such persons and families available for housing needs, (b) the size of the family, (c) the cost and condition of housing facilities available, (d) the eligibility of such persons and families to compete successfully in the normal housing market and to pay the amounts at which private enterprise is providing sanitary, decent and safe housing. In the case of federally subsidized mortgages with respect to which income limits have been established by any agency of the federal government having jurisdiction thereover for the purpose of defining eligibility of low and moderate income families, the limits so established shall govern under the provisions of this chapter. In all other cases income limits for the purpose of defining low or moderate income persons shall be established by the agency by rules.\n\"Eligible loan\" means any mortgage loan, construction loan, rehabilitation loan, or other loan, whether or not federally insured, granted by the agency to an eligible mortgagor.\n\"Eligible security\" means any security payable from or evidencing an interest in mortgages, all or a portion of which secure loans financing residential housing.\n\"Eligible mortgagor\" means a nonprofit or cooperative housing corporation; the Department of Administration for the purpose of developing community-based programs as defined in section 246C.11; a limited profit entity or a builder as defined by the agency in its rules, which sponsors or constructs residential housing as defined in subdivision 7; or a natural person of low or moderate income, except that the return to a limited dividend entity shall not exceed 15 percent of the capital contribution of the investors or such lesser percentage as the agency shall establish in its rules, provided that residual receipts funds of a limited dividend entity may be used for agency-approved, housing-related investments owned by the limited dividend entity without regard to the limitation on returns. Owners of existing residential housing occupied by renters shall be eligible for rehabilitation loans, only if, as a condition to the issuance of the loan, the owner agrees to conditions established by the agency in its rules relating to rental or other matters that will ensure that the housing will be occupied by persons and families of low or moderate income. The agency shall require by rules that the owner give preference to those persons of low or moderate income who occupied the residential housing at the time of application for the loan.\n\"Federal housing assistance supplements\" means all funds or certificates of tax credit or exemption, including mortgage credit certificates, or low-income housing credits, made available to the state of Minnesota by the federal government or any agency or instrumentality thereof for the purpose of assisting in providing adequate and economic housing in the state of Minnesota.\n\"Rehabilitation\" means the repair, reconstruction, or improvement of existing residential housing with the object of making such residential housing decent, safe, sanitary and more desirable to live in, of greater market value or in conformance with state, county, or city health, housing, building, fire prevention, and housing maintenance codes, and lead and other public standards applicable to housing, as determined by the agency.\n\"Mentally ill person\" means a person with a mental illness, an adult with an acute mental illness, or a person with a serious and persistent mental illness, as prescribed by section 245.462, subdivision 20.\n\"Developmentally disabled person\" shall have the meaning prescribed by section 253B.02, subdivision 17b.\n\"Drug dependent person\" shall have the meaning prescribed by section 254A.02, subdivision 5.\n\"Residential care facility\" means a living unit established primarily for the accommodation and treatment of persons who are mentally ill, developmentally disabled, physically disabled, and drug dependent.\n\"American Indian\" means a person who is a member of an Indian tribe, as the terms \"Indian,\" \"Indian tribe,\" and \"tribal organization\" are defined in United States Code, title 25, section 450b.\n\"City\" has the meaning given in section 462C.02, subdivision 6.\n\"Nonprofit organization\" means a housing and redevelopment authority established under sections 469.001 to 469.047, or other law, or a partnership, joint venture, corporation, or association which is established for a purpose not involving pecuniary gain to the members, partners, or shareholders; pays no dividends or other pecuniary remuneration to the members, partners, or shareholders; and in the case of a private nonprofit corporation, is established under chapter 317A and is in compliance with chapter 317A. A nonprofit organization does not include a limited dividend entity.\n\"Metropolitan area\" has the meaning given in section 473.121, subdivision 2.",
	"repealed": false
}