{
	"id": "142B.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.51",
	"title": "142B.51 CHILD PASSENGER RESTRAINT SYSTEMS.",
	"text": "When a child is transported, a license holder must comply with all seat belt and child passenger restraint system requirements under sections 169.685 and 169.686.\n(a) Programs licensed by the Department of Human Services under chapter 245A or the Department of Children, Youth, and Families under this chapter and Minnesota Rules, chapter 2960, that serve a child or children under eight years of age must document training that fulfills the requirements in this subdivision.\n(b) Before a license holder, staff person, or caregiver transports a child or children under age eight in a motor vehicle, the person transporting the child must satisfactorily complete training on the proper use and installation of child restraint systems in motor vehicles. Training completed under this section may be used to meet initial or ongoing training under Minnesota Rules, part 2960.3070, subparts 1 and 2.\n(c) Training required under this section must be completed at orientation or initial training and repeated at least once every five years. At a minimum, the training must address the proper use of child restraint systems based on the child's size, weight, and age, and the proper installation of a car seat or booster seat in the motor vehicle used by the license holder to transport the child or children.\n(d) Training under paragraph (c) must be provided by individuals who are certified and approved by the Office of Traffic Safety within the Department of Public Safety. License holders may obtain a list of certified and approved trainers through the Department of Public Safety website or by contacting the agency.\n(e) Notwithstanding paragraph (a), for an emergency relative placement under section 142B.06, the commissioner may grant a variance to the training required by this subdivision for a relative who completes a child seat safety check up. The child seat safety check up trainer must be approved by the Department of Public Safety, Office of Traffic Safety, and must provide one-on-one instruction on placing a child of a specific age in the exact child passenger restraint in the motor vehicle in which the child will be transported. Once granted a variance, and if all other licensing requirements are met, the relative applicant may receive a license and may transport a relative foster child younger than eight years of age. A child seat safety check up must be completed each time a child requires a different size car seat according to car seat and vehicle manufacturer guidelines. A relative license holder must complete training that meets the other requirements of this subdivision prior to placement of another foster child younger than eight years of age in the home or prior to the renewal of the child foster care license.",
	"repealed": false
}