{
	"id": "240A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/240A.09",
	"title": "240A.09 PLAN DEVELOPMENT; CRITERIA.",
	"text": "The Minnesota Amateur Sports Commission shall develop a plan to promote the development of proposals for new statewide public ice facilities including proposals for ice centers and matching grants based on the criteria in this section.\n(a) For ice center proposals, the commission will give priority to proposals that come from more than one local government unit. Institutions of higher education are not eligible to receive a grant.\n(b) The commission must give priority to grant applications for indoor air quality improvements and projects that eliminate R-22. For purposes of this section:\n(1) \"indoor air quality improvements\" means: (i) renovation or replacement of heating, ventilating, and air conditioning systems in existing indoor ice arenas whose ice resurfacing and ice edging equipment are not powered by electricity in order to reduce concentrations of carbon monoxide and nitrogen dioxide; and (ii) acquisition of zero-emission ice resurfacing and ice edging equipment. The new or renovated systems may include continuous electronic air monitoring devices to automatically activate the ventilation systems when the concentration of carbon monoxide or nitrogen dioxide reaches a predetermined level; and\n(2) \"projects that eliminate R-22\" means replacement of ice-making systems in existing public facilities that use R-22 as a refrigerant, with systems that use alternative non-ozone-depleting refrigerants.\n(c) In the metropolitan area as defined in section 473.121, subdivision 2, the commission is encouraged to give priority to the following proposals:\n(1) proposals for construction of two or more ice sheets in a single new facility;\n(2) proposals for construction of an additional sheet of ice at an existing ice center;\n(3) proposals for construction of a new, single sheet of ice as part of a sports complex with multiple sports facilities; and\n(4) proposals for construction of a new, single sheet of ice that will be expanded to a two-sheet facility in the future.\n(d) The commission shall administer a site selection process for the ice centers. The commission shall invite proposals from cities or counties or consortia of cities. A proposal for an ice center must include matching contributions including in-kind contributions of land, access roadways and access roadway improvements, and necessary utility services, landscaping, and parking.\n(e) Proposals for ice centers and matching grants must provide for meeting the demand for ice time for female groups by offering up to 50 percent of prime ice time, as needed, to female groups. For purposes of this section, prime ice time means the hours of 4:00 p.m. to 10:00 p.m. Monday to Friday and 9:00 a.m. to 8:00 p.m. on Saturdays and Sundays.\n(f) The location for all proposed facilities must be in areas of maximum demonstrated interest and must maximize accessibility to an arterial highway.\n(g) To the extent possible, all proposed facilities must be dispersed equitably, must be located to maximize potential for full utilization and profitable operation, and must accommodate noncompetitive family and community skating for all ages.\n(h) The commission may also use the money to upgrade current facilities, purchase girls' ice time, or conduct amateur women's hockey and other ice sport tournaments.\n(i) To the extent possible, 50 percent of all grants must be awarded to communities in greater Minnesota.\n(j) To the extent possible, technical assistance shall be provided to Minnesota communities by the commission on ice arena planning, design, and operation, including the marketing of ice time and on projects described in paragraph (b).\n(k) A grant for new facilities may not exceed $250,000.\n(l) The commission may make grants for rehabilitation and renovation. A rehabilitation or renovation grant for air quality may not exceed $200,000 and a rehabilitation or renovation grant for R-22 elimination may not exceed $250,000 for indirect cooling systems and may not exceed $500,000 for direct cooling systems. Priority must be given to grant applications for indoor air quality improvements, including zero emission ice resurfacing equipment, and for projects that eliminate R-22.\n(m) Grant money may be used for ice centers designed for sports other than hockey.\n(n) Grant money may be used to upgrade existing facilities to comply with the bleacher safety requirements of section 326B.112.",
	"repealed": false
}