{
	"id": "138.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.73",
	"title": "138.73 DESIGNATION OF HISTORIC DISTRICTS.",
	"text": "The land and water areas enumerated and described in the following subdivisions of this section are hereby designated by law as historic districts.\nPipestone Historic District includes the following described property constituting a museum, a vacant lot, a shoe store, and a masonic lodge:\n(1) The South fifty-seven feet four inches (S. 57' & 4\") except the East two feet (2') of Lot Five (5) and the South fifty-seven feet four inches (S. 57' & 4\") of Lot Six (6), Block Four (4), Nichols Addition to the City of Pipestone. Subject to any party wall agreements or easements.\n(2) All that part of Lot Six (6), Block Four (4), Nichols' Addition to the City of Pipestone, Minnesota, described as follows, to-wit:\nCommencing at a point on the west line of said Lot Six (6), 69.7 feet South of the northwest corner thereof; thence East 25.8 feet, more or less, to the west wall of the building now located thereon; thence South along said west wall for 22.97 feet; thence West for 25.8 feet, more or less, to the west line of said Lot Six (6); thence North along said west line for 22.97 feet to the place of beginning.\n(3) Beginning at the northwest corner of Lot Six (6), Block Four (4), Nichols' Addition to the City of Pipestone, Minnesota; thence East along the north line of Block Four (4), 27.9 feet to the centerline of a party wall; thence South 24.0 feet along the centerline of a party wall; thence West 4.2 feet along the centerline of a party wall; thence South 45.7 feet along the centerline of a party wall; thence West along the centerline of a party wall 23.7 feet to the west line of said Block Four (4); thence North 69.7 feet to the point of beginning. Subject to a party wall agreement dated May 31, 1964 between the parties hereto.\n(4) The following described parcels of land, all of which are located in Block 4, Nichols' Addition to the City of Pipestone:\nParcel A: The West two (2) feet, eight (8) inches of Lot Two (2).\nParcel B: Lot Three (3).\nParcel C: Beginning at the northwest corner of Lot 4; running thence South 92 feet along the west side of said lot; thence East 17 feet 6 inches; thence South 8 feet; thence West 10 inches; thence South 50 feet to the south line of Lot 4; thence East 9 feet to the southeast corner of Lot 4; thence North 150 feet to the northeast corner of Lot 4; thence West along the north line of Lot 4 to the place of beginning.\nParcel D: The East 2 feet of Lot 5, except that portion owned by the city of Pipestone, Minnesota.\nParcel E: Commencing at a point 27.9 feet East of the northwest corner of Lot 6, Block 4, Nichols' Addition to City of Pipestone; said point being the center of a party wall; thence East along the north line of Block 4 to a point 2 feet West of the northeast corner of Lot 5, of said Block 4; thence South and parallel with the west line of Block 4, 92 feet 8 inches; thence West and parallel with the north line of Block 4, 51 feet, 4 inches to the west line of Block 4; thence North along the west line of Block 4, to a point 69.7 feet South of the northwest corner of Lot 6, of said Block 4, said point being the centerline of a party wall; thence East along the centerline of a party wall for 23.7 feet; thence North along the centerline of a party wall 45.7 feet; thence East along the centerline of a party wall 4.2 feet; thence North along the centerline of a party wall 24.0 feet to the point of beginning.\nAngel's Hill Historic District in Chisago County is located in the city of Taylors Falls on a hill above the commercial district and encompasses an area bordered on the south by Mill Street; on the east by High Rock Street and Government Street; on the north by Military Road and on the west by Mulberry Street.\nChippewa City Pioneer Village Historic District in Chippewa County is located at the junction of highways No. 7 and No. 59 in the city of Montevideo, and encompasses Sublot 28, Section 18, Township 117 North, Range 40 West.\nGrand Portage Historic District in Cook County is located within the boundaries of Grand Portage National Monument.\nKathio Archaeological District is located in Mille Lacs County and is composed of the area designated as Mille Lacs-Kathio State Park plus the North Half of Section 25, Township 42 North, Range 27 West; an area of 11,680 acres more or less.\nLac qui Parle Mission and Village Historic District in Chippewa and Lac qui Parle Counties is comprised of Lac qui Parle State Park and the Southeast Quarter of the Northwest Quarter, the Northeast Quarter of the Southwest Quarter, the Northwest Quarter of the Southeast Quarter, and the Southwest Quarter of the Northeast Quarter of Section 27, Township 118 North, Range 42 West, in Lac qui Parle County.\nLake Benton Historic District is located in Lincoln County within the city of Lake Benton and includes the South Half of Section 5; Section 7; Section 8; the West Half of Section 9; the Northeast Quarter of Section 18; and the North Half of Section 17; Township 109 North, Range 45 West; an area of 2400 acres more or less.\nLower Sioux Agency Historic District in Redwood County consists of the Northeast Quarter of the Northwest Quarter of Section 8; Government Lots 2 and 3, and the North 8 acres of the Southeast Quarter of the Northeast Quarter of Section 8; and the North 6.76 acres of Government Lot 7 in Section 9; all in Township 112 North, Range 34 West, including 122.86 acres more or less.\nMantorville Historic District in Dodge County is located within the city of Mantorville and includes the Southeast Quarter of Section 17; the South Half of Section 16; the North Half of Section 21; the Northeast Quarter of Section 20; all in Township 107 North, Range 16 West; an area of 960 acres more or less.\nMinnetonka Mills Historic District in Hennepin County is located at the intersection of County Highways No. 5 and No. 60 within the limits of the city of Minnetonka in the East Half of Section 15, Township 117 North, Range 22 West, and is comprised of the former village of Minnetonka Mills.\nMorgan Park Historic District in St. Louis County is located in the southwest part of the city of Duluth and is composed of the following area:\nBeginning at a point at the intersection of Commonwealth Avenue and Grand Avenue in Duluth; thence northeasterly along Grand Avenue to the intersection of Grand Avenue and Hulett Avenue; thence southeasterly along Hulett Avenue to the shore of the St. Louis River; thence southeasterly along said shoreline to the long pier extending into Spirit Lake; thence northwesterly along a straight line from said point to Commonwealth Avenue; thence north along Commonwealth Avenue to the point of beginning.\nOld Fort Snelling Historic District in Hennepin County is located within the following boundaries: beginning at the intersection of the westerly Chicago, Milwaukee, St. Paul and Pacific Railroad (abandoned) right-of-way and the south boundary of Minnehaha State Park extended (which is an extension of East 55th Street, Minneapolis); thence east along the extension of East 55th Street to the easterly county line of Hennepin County (centerline of Mississippi River); thence southerly and easterly along said county line to the point of intersection of Hennepin, Ramsey, and Dakota Counties; thence easterly along the Ramsey-Dakota common boundary to intersection with the easterly line of Government Lot No. 2, Section 28, Township 28 North, Range 23 West, Dakota County; thence South on east line of said Government Lot No. 2, to intersection with the east-west quarter line of said Section 28; thence westerly on said east-west quarter line to the intersection with the easterly right-of-way line of Minnesota State Highway No. 5; thence southerly on said right-of-way line to intersect with the Metropolitan Airports Commission boundary line extended; thence northwesterly along last described boundary line to intersection with a line parallel to Old Trunk Highway 100 (Bloomington Road) and 600 feet northwesterly thereof, measured on a line perpendicular to said highway; thence northeasterly on last described parallel line to intersect with the northerly right-of-way line of State Highway No. 55; thence westerly on said right-of-way line to intersect with the westerly right-of-way line of the Chicago, Milwaukee, St. Paul and Pacific Railroad (abandoned); thence northerly on last described right-of-way line to the point of the beginning and there terminating. The tract herein described contains 580 acres more or less. This district aligns with the boundaries of the Fort Snelling Historic District in the National Register of Historic Places, as the description of that district is amended from time to time.\nOld Frontenac Historic District in Goodhue County consists of the city of Frontenac and is comprised of the East Half of the Southeast Quarter of Section 2, the East Half of the Northeast Quarter and the Northeast Quarter of the Southeast Quarter of Section 11, that portion of the Northwest Quarter of Section 12 west of the Mississippi River, the Northeast Quarter of the Southwest Quarter and the North Half of the Southwest Quarter of the Southwest Quarter of Section 12; all in Township 112 North, Range 13 West.\nOld Mendota Historic District in Dakota County on the south bank of the Minnesota River just at the point where the Mississippi and the Minnesota Rivers unite and is comprised of the following:\nBeginning on the east line of Government Lot No. 2, Section 28, Township 28 North, Range 23 West, Dakota County, South on said line to the Interstate Highway 55; thence southwest on said highway to the intersection with Sibley Highway; thence northeast on said highway to the intersection with \"D\" Street in Mendota; thence northwest on \"D\" Street to Chicago and Northwestern Railroad right-of-way; thence on an imaginary line straight north to the Dakota-Ramsey County line; thence southwest on said line to the boundary of Government Lot No. 2 extended north; thence south along said line to the point of beginning, containing 50 acres more or less.\nOttawa Village Historic District in Le Sueur County is comprised of the city of Ottawa located in the West Half of Section 34, Township 111 North, Range 26 West.\nSt. Anthony Falls Historic District is in Hennepin County and is located within the city of Minneapolis and is comprised of the following:\nBeginning at the intersection of Second Street North and the south right-of-way line of proposed Interstate Highway 335 (State Project 2788-01) as identified on February 1, 1972; following Second Street southeasterly to its intersection with Tenth Avenue South; thence northeasterly along Tenth Avenue south and along an imaginary line which is an extension thereof to the beginning of Sixth Avenue Southeast on the east bank of the Mississippi River and along Sixth Avenue Southeast to its intersection with University Avenue; thence northwesterly along University Avenue to the south right-of-way line of proposed Interstate Highway 335 (State Project 2788-01) as identified on February 1, 1972, and thence northwesterly along the proposed Interstate 335 right-of-way to the point of beginning.\nShakopee Historic District is in Scott County and the city of Shakopee and consists of the following portion of Section 5, Township 115 North, Range 22 West:\nBeginning at a point in the centerline of the west bound lane of Trunk Highway No. 101, distant 1671.07 feet (as measured along centerline of said lane) East of the west line of Section 5; thence North at right angles a distance of 202 feet; thence deflecting to the North at an angle of 87 degrees 48 minutes a distance of 251.4 feet; thence deflecting to the North at an angle of 23 degrees ten minutes a distance of 403.1 feet; thence North a distance of 130 feet more or less to a point 30 feet North of the north bank of the Mill Creek; thence easterly and parallel to said north bank to the Minnesota River; thence downstream or easterly along the southerly bank of the Minnesota River to the east line of Section 5; thence South to Highway No. 101 right-of-way; thence westerly following north boundary of right-of-way to its intersection with the line running North from the point of origin.\nUpper Sioux Agency Historic District in Yellow Medicine County is comprised of the following area:\nBeginning at the line dividing Sections 28 and 29 of Township 115 North, Range 38 West, on the bank of the Yellow Medicine River, follow the bank of the river West from this line to the line dividing Section 30, Township 115 North, Range 38 West, with Section 25, Township 115 North, Range 39 West; thence North on said line to State Highway No. 67 (the old Lac qui Parle Trail); thence southeast on said line to the western border of the present Upper Sioux Agency State Park; thence North on the state park boundary to the Renville-Yellow Medicine County border; thence East on said border to the eastern border of the Upper Sioux Agency State Park; follow this line to the border of Sections 28 and 29, Township 115 North, Range 38 West; thence South on this line to the bank of the Yellow Medicine River to the point of beginning including 800 acres more or less.\nVillage of St. Vincent Historic District in Kittson County is located on the Red River two miles south of the Canadian border and across from Pembina, North Dakota and is comprised of Section 8 and the North Half of the Northeast Quarter of Section 11, both in Township 163 North, Range 51 West.\nWasioja Historic District in Dodge County is located within the city of Wasioja and includes the Southeast Quarter of the Southeast Quarter of Section 11; the Southwest Quarter of Section 12; the Northwest Quarter of Section 13; and the Northeast Quarter of Section 14; all in Township 107 North, Range 17 West; an area of 520 acres more or less.\nMarine on St. Croix Historic District in Washington County is located within the city of Marine on St. Croix and includes the Southwest Quarter of Sec. 6, and the South Half of the Northwest Quarter of Sec. 6, T31N, R19W, the Northwest Quarter of Sec. 7, T31N, R19W; these areas lying west of the St. Croix River. Also, the Southeast Quarter of Sec. 1, T31N, R20W, and the East Half of the Northeast Quarter of Sec. 12, T31N, R20W.\nHistoric Hill District in Ramsey County is located within the city of St. Paul and comprises the area which is located within the following described boundaries: beginning at a point at the intersection of the centerlines of Holly Avenue and North Dale Street in the city of St. Paul; thence North along the centerline of North Dale Street to the point at which it intersects the centerline of Marshall Avenue; thence East along the centerline of Marshall Avenue to the point at which it intersects the centerline of Western Avenue North; thence North along the centerline of Western Avenue North to the point at which it intersects the centerline of Iglehart Avenue; thence East along the centerline of Iglehart Avenue to the point at which it intersects the centerline of Virginia Street; thence South along the centerline of Virginia Street to the point at which it intersects the centerline of Marshall Avenue; thence East along the centerline of Marshall Avenue to the point at which it intersects the centerline of John Ireland Boulevard; thence southwesterly along the centerline of John Ireland Boulevard to the point at which it joins the centerline of Summit Avenue; thence southerly along the centerline of Summit Avenue to the point at which it intersects the northerly right-of-way line of Selby Avenue extended; thence easterly along the northerly right-of-way line of Selby Avenue extended to a point parallel with and 300 feet southeasterly of the centerline of Summit Avenue; thence southwesterly along a line parallel with and 300 feet southeasterly of the centerline of Summit Avenue to the point at which it intersects the northeasterly line of Lot 3, Block 69, of Dayton and Irvine's Addition; thence southeasterly along the northeasterly line of said Lot 3 and its southeasterly extension to its intersection with the centerline of Irvine Avenue; thence southwesterly along the centerline of Irvine Avenue to the intersection with the centerline of Western Avenue South; thence southerly along the centerline of Western Avenue South to the intersection with the centerline of Ramsey Street; thence southwesterly on a line to the point on the south line of Lot 5, Block 6, Terrace Park Addition, distant 100 feet East of the southwest corner of said Lot 5; thence West along the south line of Lot 5 to the southwest corner of Lot 5; thence southwesterly to the northwest corner of Lot 1, Auditors Subdivision number 33; thence southerly along the west line of said Lot 1 to the point distant 120 feet South of the northwest corner of Lot 1; thence southwesterly on a line to the point on the southwesterly line of St. Albans Street distant 120 feet northwesterly of its intersection with the northerly right-of-way line of Pleasant Avenue; thence southeasterly along the northwesterly right-of-way line of St. Albans Street and its southeasterly extension to its intersection with the centerline of Pleasant Avenue; thence southwesterly on a line to the point of intersection of the centerlines of St. Clair Avenue and Pleasant Avenue; thence southwesterly to the point of intersection of the west line of Arbor Street with the most northerly line of Interstate 35-E right-of-way, also being the north line of relocated Grace Street; thence southwesterly on the northerly line of Interstate 35-E (Grace Street) right-of-way to the point at which it intersects the north right-of-way line of the Chicago, Milwaukee, St. Paul, and Pacific Railroad right-of-way; thence westerly and northwesterly along said right-of-way line to a point at which it intersects the centerline of the alley between Portland and Ashland; thence East along the centerline of said alley to the point at which it intersects the centerline of North Victoria Street; thence North along the centerline of North Victoria Street to the point at which it intersects the centerline of the alley between Holly Avenue and Ashland Avenue; thence East along the centerline of said alley to the point at which it intersects the centerline of North Grotto Avenue; thence South along the centerline of North Grotto Avenue to the point at which it intersects the centerline of Holly Avenue; thence East along Holly Avenue to the point of beginning and there terminating.\nIrvine Park Historic District, partly owned by the city of St. Paul and portions of which are privately owned, consisting of all area within the following description: beginning at the center of the intersection of Walnut and West Seventh Street; thence southeasterly along the centerline of Walnut to the intersection of the centerline of the perimeter street surrounding Irvine Park; thence northeasterly to the north corner; thence southeasterly along the centerline of the perimeter street to the intersection of the centerline of Ryan; thence northeasterly along the centerline of Ryan to the northeast edge of Lot 2, Block 35; thence southeasterly to include Lots 2, 3, 4, Block 35; thence southwesterly to the centerline of Hill Street including that portion of Hill vacated; thence southwesterly along the centerline of Hill Street to the top of the bluff's concrete retaining wall; thence following the concrete of the top of the retaining wall to the centerline of Sherman; thence northwesterly along the centerline of Sherman to the intersection of the centerline of Ryan; thence southwesterly along the centerline of Ryan to the intersection of the line extending from the southwest edge of Lot 11; thence northwesterly along the southwest of edge of Lots 11, 12 of Block 30, to the intersection of the centerline alleyway parallel to Ryan and Exchange, Block 30; thence southwesterly along the centerline of the alleyway to the intersection of the property line running northwest-southeast dividing in half Lot 3, Block 30; thence along the property line to the intersection of the centerline of South Exchange; then northeasterly along the centerline of South Exchange to the intersection of the centerline of Sherman; thence northwesterly along the centerline of Sherman to the intersection of the centerline of Ramsey; thence westerly along Ramsey to the intersection of the centerline of West Seventh; thence northeasterly to the point of beginning. All in Rice and Irvine's Addition to city of St. Paul.\nMilwaukee Avenue Historic District in the city of Minneapolis in Hennepin County, extending from Franklin Avenue to 24th Street.\nVictory Memorial Drive Historic District in Hennepin County is comprised of the drive extending from Lowry Avenue North on the south to Humboldt Avenue North on the east, and all property associated with the drive owned by the Minneapolis Park and Recreation Board, including the Lincoln Statue area and the Flagpole Memorial area.",
	"repealed": false
}