{
	"id": "204D.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.29",
	"title": "204D.29 REPRESENTATIVE IN CONGRESS VACANCY.",
	"text": "(a) A vacancy in the office of representative in Congress must be filled as specified in this section.\n(b) \"Vacancy,\" as used in this section, means a vacancy in the office of representative in Congress.\n(a) If a vacancy occurs 27 weeks or more before the state primary, the governor must issue a writ within three days of the vacancy for a special election for that office to be held between 20 and 24 weeks of the vacancy, but not fewer than 47 days before a state primary. A special primary must be held 11 weeks before the special election or on the second Tuesday in August if the general election is held on the first Tuesday after the first Monday in November if any major party has more than one candidate after the time for withdrawal has expired.\n(b) The filing period for a special election under this subdivision must end on or before the 131st day before the special election. Minor party and independent candidates must submit their petitions by the last day for filing and signatures on the petitions must be dated from the date of the vacancy through the last day for filing. There must be a one-day period for withdrawal of candidates after the last day for filing.\n(a) If a vacancy occurs more than 22 weeks but fewer than 27 weeks before the state primary, the governor must issue a writ within three days of the vacancy for a special election for that office to be held on the day of the state primary with a special primary held 11 weeks before the state primary, if any major party has more than one candidate after the time for withdrawal has expired. The regularly scheduled election to fill the next full term shall proceed pursuant to law.\n(b) The filing period for a special election under this subdivision must end on or before the 147th day before the state primary. Minor party and independent candidates must submit their petitions by the last day for filing and signatures on the petitions must be dated from the date of the vacancy through the last day for filing. There must be a one-day period for withdrawal of candidates after the last day for filing. Candidates for a special election under this subdivision are not subject to the prohibition in section 204B.06 against having more than one affidavit of candidacy on file for the same election.\n(c) The winner of a special election on the day of the state primary under this subdivision shall serve the remainder of the vacant term and is eligible to be seated in Congress upon issuance of the certificate of election. The winner of the regularly scheduled term for that office at the general election shall take office on the day new members of Congress take office.\n(a) If a vacancy occurs from 22 weeks before the state primary to the day before the general election, no special election will be held. The winner of the general election for the next full term for that office will serve the remainder of the unexpired term and is eligible to be seated in Congress immediately upon issuance of a certificate of election.\n(b) If the incumbent filed an affidavit of candidacy for reelection as the candidate of a major political party and was nominated for the general election ballot by that party and a vacancy occurs from the day of the state primary until the date of the general election, there is a vacancy in nomination to be resolved pursuant to section 204B.13.\n(a) If a vacancy occurs between the day of the general election and the day new members of Congress take office and the incumbent was not the winner of the general election, the winner of the general election for the next full term for that office is eligible to be seated in Congress immediately upon issuance of a certificate of election or the vacancy, whichever occurs last.\n(b) If a vacancy occurs on or after election day but before the day new members of Congress take office and the incumbent was the winner of the general election, the vacancy must be filled pursuant to subdivision 2.",
	"repealed": false
}