{
	"id": "518A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.32",
	"title": "518A.32 POTENTIAL INCOME.",
	"text": "This section applies to child support orders, including orders for past support or reimbursement of public assistance, issued under this chapter, chapter 256, 257, 518B, or 518C. If a parent is voluntarily unemployed, underemployed, or employed on a less than full-time basis, or there is no direct evidence of any income, child support must be calculated based on a determination of potential income. For purposes of this determination, it is rebuttably presumed that a parent can be gainfully employed on a full-time basis. As used in this section, \"full time\" means 40 hours of work in a week except in those industries, trades, or professions in which most employers, due to custom, practice, or agreement, use a normal work week of more or less than 40 hours in a week.\nDetermination of potential income must be made according to one of three methods, as appropriate:\n(1) the parent's probable earnings level based on employment potential, recent work history, and occupational qualifications in light of prevailing job opportunities and earnings levels in the community;\n(2) if a parent is receiving unemployment compensation or workers' compensation, that parent's income may be calculated using the actual amount of the unemployment compensation or workers' compensation benefit received; or\n(3) the amount of income a parent could earn working 30 hours per week at 100 percent of the current federal or state minimum wage, whichever is higher.\nA parent is not considered voluntarily unemployed, underemployed, or employed on a less than full-time basis upon a showing by the parent that:\n(1) the unemployment, underemployment, or employment on a less than full-time basis is temporary and will ultimately lead to an increase in income;\n(2) the unemployment, underemployment, or employment on a less than full-time basis represents a bona fide career change that outweighs the adverse effect of that parent's diminished income on the child;\n(3) the unemployment, underemployment, or employment on a less than full-time basis is because a parent is physically or mentally incapacitated or due to incarceration; or\n(4) a governmental agency authorized to determine eligibility for general assistance or supplemental Social Security income has determined that the individual is eligible to receive general assistance or supplemental Social Security income. Actual income earned by the parent may be considered for the purpose of calculating child support.\nIf the parent of a joint child is a recipient of a temporary assistance to a needy family (TANF) cash grant or comparable state-funded Minnesota family investment program (MFIP) benefits, no potential income is to be imputed to that parent.\nIf a parent stays at home to care for a child who is subject to the child support order, the court may consider the following factors when determining whether the parent is voluntarily unemployed, underemployed, or employed on a less than full-time basis:\n(1) the parties' parenting and child care arrangements before the child support action;\n(2) the stay-at-home parent's employment history, recency of employment, earnings, and the availability of jobs within the community for an individual with the parent's qualifications;\n(3) the relationship between the employment-related expenses, including, but not limited to, child care and transportation costs required for the parent to be employed, and the income the stay-at-home parent could receive from available jobs within the community for an individual with the parent's qualifications;\n(4) the child's age and health, including whether the child is physically or mentally disabled; and\n(5) the availability of child care providers.\nThis subdivision does not apply if the parent stays at home only to care for other nonjoint children.\nA self-employed parent is not considered to be voluntarily unemployed, underemployed, or employed on a less than full-time basis if that parent can show that the parent's net self-employment income is lower because of economic conditions that are directly related to the source or sources of that parent's income.",
	"repealed": false
}