{
	"id": "115C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.03",
	"title": "115C.03 RESPONSE TO RELEASES.",
	"text": "If there is a release, the commissioner may order a responsible person to take reasonable and necessary corrective actions. The commissioner shall notify the owner of real property where corrective action is ordered to be taken that responsible persons have been ordered to take corrective action and that the owner's cooperation will be required for responsible persons to take that action. When the commissioner has ordered a responsible person to take a corrective action, a political subdivision may not request or order the person to take an action that conflicts with the action ordered by the commissioner.\nPassive bioremediation must be used for petroleum tank cleanups whenever an assessment of the site determines that there is a low potential risk to public health and the environment.\nThe agency may take corrective action or request the attorney general to bring an action to compel performance of a corrective action if:\n(1) a responsible person cannot be identified;\n(2) an identified responsible person cannot or will not comply with the order issued under subdivision 1; or\n(3) an administrative or judicial proceeding on an order issued under subdivision 1 is pending.\nTo assure an adequate response to a release, the commissioner may take corrective action without following the procedures of subdivision 1 if the commissioner determines that the release constitutes a clear and immediate danger requiring immediate action to prevent, minimize, or mitigate damage to the public health and welfare or the environment. Before taking an action under this subdivision, the commissioner shall make all reasonable efforts, taking into consideration the urgency of the situation, to order a responsible person to take a corrective action and notify the owner of real property where the corrective action is to be taken.\nA release is a public nuisance and may be enjoined in an action, in the name of the state, brought by the attorney general.\nIf the commissioner has reason to believe that a release has occurred, the commissioner may undertake reasonable investigations necessary to identify the existence, source, nature, and extent of a release, the responsible persons, and the extent of danger to the public health and welfare or the environment.\nA person who the commissioner has reason to believe is a responsible person, or the owner of real property where corrective action is ordered to be taken, or who might otherwise have information concerning a release, shall, when requested by the commissioner or any member, employee, or agent of the agency who is authorized by the commissioner, furnish to the commissioner any information that person may have or may reasonably obtain that is relevant to the release.\nThe commissioner or any member, employee, or agent of the agency authorized by the commissioner, may, upon presentation of official agency credentials, take any of the following actions:\n(1) examine and copy books, papers, records, memoranda, or data of a person who has a duty to provide information to the commissioner under subdivision 6; and\n(2) enter upon public or private property for the purpose of taking action authorized by this section, including obtaining information from a person who has a duty to provide the information under subdivision 6, conducting surveys and investigations, and taking corrective action.\nA person aggrieved by a decision made by an employee of the agency relating to the need for or implementation of a corrective action may seek review of the decision by the commissioner. An application for review must state with specificity the decision for which review is sought, the name of the leak site, the leak number, the date the decision was made, the agency employee who made the decision, the ramifications of the decision, and any additional pertinent information. The commissioner shall review the application and schedule a time, date, and place for the aggrieved person to explain the grievance and for the agency employee to explain the decision under review. The commissioner shall issue a decision either sustaining or reversing the decision of the employee. The aggrieved person may appeal the commissioner's decision to the Pollution Control Agency Board in accordance with Minnesota Rules, part 7000.0500, subpart 6.\nExcept as otherwise provided in this subdivision, data obtained from a person under subdivision 6 or 7 is public data as defined in section 13.02. Upon certification by the subject of the data that the data relates to sales figures, processes or methods of production unique to that person, or information that would tend to adversely affect the competitive position of that person, the commissioner shall classify the data as private or nonpublic data as defined in section 13.02. Data classified as private or nonpublic under this subdivision may be disclosed when relevant in a proceeding under this chapter.\n(a) The commissioner may, upon request:\n(1) assist in determining whether a release has occurred;\n(2) assist in or supervise the development and implementation of reasonable and necessary corrective actions; and\n(3) assist in or supervise the investigation, development, and implementation of actions to minimize, eliminate, or clean up petroleum contamination at sites where it is not certain that the contamination is attributable to a release.\n(b) Assistance may include review of agency records and files and review and approval of a requester's investigation plans and reports and corrective action plans and implementation.\n(c) Assistance may include the issuance of a written determination that an owner or prospective buyer of real property will not be a responsible person under section 115C.021, if the commissioner finds the release came from a tank not located on the property. The commissioner may also issue a written confirmation that the real property was the site of a release and that the tank from which the release occurred has been removed or that the agency has issued a site closure letter and has not revoked that status. The issuance of the written determination or confirmation applies to tanks not on the property or removed only and does not affect liability for releases from tanks that are on the property at the time of purchase. The commissioner may also issue site closure letters and nonresponsible person determinations for sites contaminated by petroleum where it is not certain that the contamination is attributable to a release. The written determination or confirmation extends to the successors and assigns of the person to whom it originally applied, if the successors and assigns are not otherwise responsible for the release.\n(d) The person requesting assistance under this subdivision shall pay the agency for the agency's cost, as determined by the commissioner, of providing assistance. Money received by the agency for assistance under this subdivision must be deposited in the state treasury and credited to an account in the special revenue fund. Money in this account is annually appropriated to the commissioner for purposes of administering the subdivision.\nA contractor or consultant who has billed for corrective action services must prepare and retain all records related to the corrective action services for a minimum of seven years from the date the corrective action services are performed, including, but not limited to, invoices submitted to applicants, subcontractor invoices, receipts for equipment rental, and all other goods rented or purchased, personnel time reports, mileage logs, and expense accounts. An applicant must obtain and retain records necessary to document costs submitted in a claim for reimbursement for corrective action services for seven years from the date the claim is submitted to the board.",
	"repealed": false
}