{
	"id": "169.966",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.966",
	"title": "169.966 BOARD TO REGULATE TRAFFIC ON STATE UNIVERSITIES.",
	"text": "The Board of Trustees of the Minnesota State Colleges and Universities may from time to time make, adopt, and enforce such rules or ordinances not inconsistent with this chapter, as it may find expedient or necessary relating to the regulation of traffic and parking upon parking facilities and private roads and roadways situated on property owned, leased, occupied, or operated by state universities.\nThe Board of Trustees may establish rents, charges, or fees for the use of parking facilities owned, leased, occupied, or operated by the board. The money collected by the board as rents, charges, or fees in accordance with this subdivision shall be deposited in the university activity fund and is annually appropriated to the Board of Trustees for state university purposes and to maintain and operate parking lots and parking facilities.\nAny person who violates such rule or ordinance shall be guilty of a petty misdemeanor and subject to the provisions of sections 169.891 and 169.90, subdivision 1.\nThe prosecution may be before a district court having jurisdiction over the place where the violation occurs.\nEvery sheriff, police officer, or other peace officer shall see that all rules and ordinances are obeyed and shall arrest and prosecute offenders.\nThe Board of Trustees may appoint and employ, and fix the compensation to be paid out of funds which may be available for such purposes, persons who shall have and may exercise on property owned, leased, or occupied by the state universities the same powers of arrest for violation of rules or ordinances adopted by the board as possessed by a sheriff, police officer, or peace officer.\nAll persons shall take notice of such rules and ordinances without pleading and proof of the same.\n(a) The Board of Trustees shall fix a date for a public hearing on the adoption of any such proposed rule or ordinance. Notice of such hearing shall be published in a legal newspaper in the county in which the property affected by the rule or ordinance is located. The publication shall be at least 15 days and not more than 45 days before the date of the hearing.\n(b) If, after the public hearing, the proposed rule or ordinance shall be adopted by a majority of the members of the board, the same shall be considered to have been enacted by the board. A copy of the same shall be signed by the president and filed with the county recorder of each county where the rule or ordinance shall be in effect, together with proof of publication. Upon such filing, the rule or ordinance, as the case may be, shall thenceforth be in full force and effect.\nThe Board of Trustees may delegate its responsibilities under this section to a state university president. Actions of the president shall be presumed to be those of the board. The university president shall file with the board president the results of any public hearings and the subsequent adoption of any proposed rule or ordinance enacted pursuant thereto.",
	"repealed": false
}