{
	"id": "257.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/257.66",
	"title": "257.66 JUDGMENT OR ORDER.",
	"text": "The judgment or order of the court determining the existence or nonexistence of the parent and child relationship is determinative for all purposes.\nIf the judgment or order of the court is at variance with the child's birth record, the court shall order that a new birth record be issued under section 257.73.\nThe judgment or order shall contain provisions concerning the duty of support, the custody of the child, the name of the child, the Social Security number of the mother, father, and child, if known at the time of adjudication, parenting time with the child, the furnishing of bond or other security for the payment of the judgment, or any other matter in the best interest of the child. Custody and parenting time and all subsequent motions related to them shall proceed and be determined under section 257.541. The remaining matters and all subsequent motions related to them shall proceed and be determined in accordance with chapters 518 and 518A. The judgment or order may direct the appropriate party to pay all or a proportion of the reasonable expenses of the mother's pregnancy and confinement, including the mother's lost wages due to medical necessity, after consideration of the relevant facts, including the relative financial means of the parents; the earning ability of each parent; and any health insurance policies held by either parent, or by a spouse or parent of the parent, which would provide benefits for the expenses incurred by the mother during her pregnancy and confinement. Pregnancy and confinement expenses and genetic testing costs, submitted by the public authority, are admissible as evidence without third-party foundation testimony and constitute prima facie evidence of the amounts incurred for those services or for the genetic testing. Remedies available for the collection and enforcement of child support apply to confinement costs and are considered additional child support.\nSupport judgments or orders ordinarily shall be for periodic payments which may vary in amount. In the best interest of the child, a lump-sum payment may be ordered in lieu of periodic payments of support. The court shall limit the parent's liability for past support of the child to the proportion of the expenses that the court deems just, which were incurred in the two years immediately preceding the commencement of the action. In determining the amount of the parent's liability for past support, the court may deviate downward from the guidelines if:\n(1) the child for whom child support is sought is more than five years old and the obligor discovered or was informed of the existence of the parent and child relationship within one year of commencement of the action seeking child support;\n(2) the obligor is a custodian for or pays support for other children; and\n(3) the obligor's family income is less than 175 percent of the federal poverty level.\nAny order for support or maintenance issued under this section shall provide for a conspicuous notice that, if the obligor fails to make a support payment, the payment owed becomes a judgment by operation of law on and after the date the payment is due and the obligee or a public agency responsible for support enforcement may obtain entry and docketing of the judgment for the unpaid amounts under the provisions of section 548.091.\nUpon entry of judgment or order, each parent who is a party in a paternity proceeding shall:\n(1) file with the public authority responsible for child support enforcement the party's Social Security number, residential and mailing address, telephone number, driver's license number, and name, address, and telephone number of any employer if the party is receiving services from the public authority or begins receiving services from the public authority;\n(2) file the information in clause (1) with the district court; and\n(3) notify the court and, if applicable, the public authority responsible for child support enforcement of any change in the information required under this section within ten days of the change.",
	"repealed": false
}