{
	"id": "97A.465",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.465",
	"title": "97A.465 MILITARY PERSONNEL; FISHING AND HUNTING.",
	"text": "A resident that is in the armed forces of the United States, stationed outside of the state, and in the state on leave, may hunt and fish without a license if the resident possesses official military leave papers. The resident must obtain the seals, tags, and coupons required of a licensee, which must be furnished without charge. This subdivision does not apply to the taking of moose or elk.\nNotwithstanding section 97A.405, subdivision 5, the spouse of a resident who is on active military duty may obtain resident hunting and fishing licenses.\n(a) A resident who has served at any time during the preceding 24 months in federal active service, as defined in section 190.05, subdivision 5c, outside the United States as a member of the National Guard, or as a reserve component or active duty member of the United States armed forces and has been discharged from active service may take small game and fish without a license if the resident possesses official military discharge papers. The resident must obtain the seals, tags, and coupons required of a licensee, which must be furnished without charge.\n(b) The commissioner shall issue, without fee, a deer license, valid for a deer of either sex, to a resident who has served at any time during the preceding 24 months in federal active service, as defined in section 190.05, subdivision 5c, outside the United States as a member of the National Guard, or as a reserve component or active duty member of the United States armed forces and has been discharged from active service. Eligibility under this paragraph is limited to one license per resident.\nA nonresident who is in the military and in training at Camp Ripley may obtain a resident license to take fish.\n(a) The commissioner may issue a resident license to take game to a person in the armed forces of the United States that is stationed in the state. This paragraph does not apply to taking moose or elk.\n(b) The commissioner may issue a resident angling license to a person in the armed forces of the United States that is stationed in the state and to the spouse of a person in the armed forces of the United States that is stationed in the state.\nA resident who is discharged from the United States armed forces during, or within ten days before, the firearms deer season may, upon showing the official discharge paper, obtain a firearm deer license during the season that is valid immediately upon issuance.\n(a) For purposes of this subdivision:\n(1) \"qualified service member or veteran\" means a Minnesota resident who:\n(i) is currently serving, or has served at any time during the past 24 months, in active service as a member of the United States armed forces, including the National Guard or other military reserves;\n(ii) has received a Purple Heart medal for qualifying military service, as shown by official military records; or\n(iii) has a service-connected disability rated at 100 percent as defined by the United States Department of Veterans Affairs; and\n(2) \"active service\" means service defined under section 190.05, subdivision 5b or 5c.\n(b) Notwithstanding any other provision of this chapter, chapter 97B or 97C, or administrative rules, the commissioner may give first preference to qualified service members or veterans in any drawing or lottery involving the selection of applicants for hunting or fishing licenses, permits, and special permits. This subdivision does not apply to licenses or permits for taking moose, elk, or prairie chickens. Actions of the commissioner under this subdivision are not rules under the Administrative Procedure Act and section 14.386 does not apply.\nThe commissioner may by rule establish criteria, special seasons, and limits for military personnel and veterans to take big game and small game by firearms or archery in designated areas or times. A person hunting under this subdivision must be participating in a hunt sponsored and administered by the Minnesota Department of Military Affairs or the Minnesota Department of Veterans Affairs.\n(a) A resident from a Minnesota veterans home may obtain a firearm or muzzleloader deer license during the season and take antlerless deer without a permit in all areas of the state open during the respective regular firearms or muzzleloader deer seasons in any permit area. This subdivision does not authorize the taking of an antlerless deer by another member of a party under section 97B.301, subdivision 3, in an area closed to taking antlerless deer or where the number of antlerless deer that may be taken is limited by a quota on the number of permits.\n(b) A person may assist a Minnesota veterans home resident during the firearms or muzzleloader deer season without having a deer-hunting license, but the person may not shoot a deer.\n(a) A nonresident that is a member of the National Guard may obtain a resident license to take game. This paragraph does not apply to taking moose or elk.\n(b) A nonresident that is a member of the National Guard or that is the spouse of a member of the National Guard may obtain a resident license to take fish.\n(c) For purposes of this section, the term \"member of the National Guard\" means an active member of the state's National Guard or an active member of another state's National Guard who is temporarily stationed in this state.",
	"repealed": false
}