{
	"id": "518.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.145",
	"title": "518.145 DECREE, FINALITY AND REOPENING.",
	"text": "A decree of dissolution of marriage or of legal separation is final when entered, subject to the right of appeal. When entered, the findings of fact and conclusions of law may constitute the judgment and decree. An appeal from the decree of dissolution that does not challenge the finding that the marriage is irretrievably broken does not delay the finality of that provision of the decree which dissolves the marriage beyond the time for appealing from that provision. A party may remarry before the time for appeal has run if it is not contested that the marriage is irretrievably broken or if a stipulation that the marriage is irretrievably broken is incorporated in the decree of dissolution.\nOn motion and upon terms as are just, the court may relieve a party from a judgment and decree, order, or proceeding under this chapter, except for provisions dissolving the bonds of marriage, annulling the marriage, or directing that the parties are legally separated, and may order a new trial or grant other relief as may be just for the following reasons:\n(1) mistake, inadvertence, surprise, or excusable neglect;\n(2) newly discovered evidence which by due diligence could not have been discovered in time to move for a new trial under the Rules of Civil Procedure, rule 59.03;\n(3) fraud, whether denominated intrinsic or extrinsic, misrepresentation, or other misconduct of an adverse party;\n(4) the judgment and decree or order is void; or\n(5) the judgment has been satisfied, released, or discharged, or a prior judgment and decree or order upon which it is based has been reversed or otherwise vacated, or it is no longer equitable that the judgment and decree or order should have prospective application.\nThe motion must be made within a reasonable time, and for a reason under clause (1), (2), or (3), not more than one year after the judgment and decree, order, or proceeding was entered or taken. A motion under this subdivision does not affect the finality of a judgment and decree or order or suspend its operation. This subdivision does not limit the power of a court to entertain an independent action to relieve a party from a judgment and decree, order, or proceeding or to grant relief to a party not actually personally notified as provided in the Rules of Civil Procedure, or to set aside a judgment for fraud upon the court.",
	"repealed": false
}