{
	"id": "634.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/634.045",
	"title": "634.045 JAILHOUSE WITNESSES.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Benefit\" means any plea bargain, bail consideration, reduction or modification of sentence, or any other leniency, immunity, financial payment, reward, or amelioration of current or future conditions of incarceration offered or provided in connection with, or in exchange for, testimony that is offered or provided by a jailhouse witness.\n(c) \"Jailhouse witness\" means a person who (1) while incarcerated, claims to have obtained information from a defendant in a criminal case or a person suspected to be the perpetrator of an offense, and (2) offers or provides testimony concerning statements made by that defendant or person suspected to be the perpetrator of an offense. It does not mean a codefendant or confidential informant who does not provide testimony against a suspect or defendant.\n(d) \"Commissioner\" means the commissioner of corrections.\n(a) Each county attorney shall report to the commissioner, in a form determined by the commissioner:\n(1) the name of the jailhouse witness and the district court file number of the case in which that witness testified or planned to testify;\n(2) the substance and use of any testimony of a jailhouse witness against the interest of a suspect or defendant, regardless of whether such testimony is presented at trial; and\n(3) the jailhouse witness's agreement to cooperate with the prosecution and any benefit that the prosecutor has offered or may offer in the future to the jailhouse witness in connection with the testimony.\n(b) The commissioner shall maintain a statewide database containing the information received pursuant to paragraph (a) for 20 years from the date that the jailhouse witness information was entered into that statewide record.\n(c) Data collected and maintained pursuant to this subdivision are classified as confidential data on individuals, as defined in section 13.02, subdivision 3. Only the commissioner may access the statewide record but shall provide all information held on specific jailhouse witnesses to a county attorney upon request.\nBy September 15 of each year, beginning in 2022, the commissioner shall publish on its website an annual report of the statewide record of jailhouse witnesses required under subdivision 2. Information in the report must be limited to summary data, as defined in section 13.02, subdivision 19, and must include:\n(1) the total number of jailhouse witnesses tracked in the statewide record; and\n(2) for each county, the number of new reports added pursuant to subdivision 2, paragraph (a), over the previous fiscal year.\n(a) In addition to the requirements for disclosures under rule 9 of the Rules of Criminal Procedure, and within the timeframes established by that rule, a prosecutor must disclose the following information to the defense about any jailhouse witness:\n(1) the complete criminal history of the jailhouse witness, including any charges that are pending or were reduced or dismissed as part of a plea bargain;\n(2) any cooperation agreement with the jailhouse witness and any deal, promise, inducement, or benefit that the state has made or intends to make in the future to the jailhouse witness;\n(3) whether, at any time, the jailhouse witness recanted any testimony or statement implicating the suspect or defendant in the charged crime and, if so, the time and place of the recantation, the nature of the recantation, and the names of the persons who were present at the recantation;\n(4) whether, at any time, the jailhouse witness made a statement implicating any other person in the charged crime and, if so, the time and place of the statement, the nature of the statement, and the names of the persons who were present at the statement; and\n(5) information concerning other criminal cases in which the jailhouse witness has testified, or offered to testify, against a suspect or defendant with whom the jailhouse witness was imprisoned or confined, including any cooperation agreement, deal, promise, inducement, or benefit that the state has made or intends to make in the future to the jailhouse witness.\n(b) A prosecutor has a continuing duty of disclosure before and during trial. If, after the omnibus hearing held pursuant to rule 11 of the Rules of Criminal Procedure, a prosecutor discovers additional material, information, or witnesses subject to disclosure under this subdivision, the prosecutor must promptly notify the court and defense counsel, or, if the defendant is not represented, the defendant, of what was discovered. If the court finds that the jailhouse witness was not known or that materials in paragraph (a) could not be discovered or obtained by the state within that period with the exercise of due diligence, the court may order that disclosure take place within a reasonable period. Upon good cause shown, the court may continue the proceedings.\n(c) If the prosecutor files a written certificate with the trial court that disclosing the information described in paragraph (a) would subject the jailhouse witness or other persons to physical harm or coercion, the court may order that the information must be disclosed to the defendant's counsel but may limit disclosure to the defendant in a way that does not unduly interfere with the defendant's right to prepare and present a defense, including limiting disclosure to nonidentifying information.\n(a) A prosecutor shall make every reasonable effort to notify a victim if the prosecutor has decided to offer or provide any of the following to a jailhouse witness in exchange for, or as the result of, a jailhouse witness offering or providing testimony against a suspect or defendant:\n(1) reduction or dismissal of charges;\n(2) a plea bargain;\n(3) support for a modification of the amount or conditions of bail; or\n(4) support for a motion to reduce or modify a sentence.\n(b) Efforts to notify the victim should include, in order of priority: (1) contacting the victim or a person designated by the victim by telephone; and (2) contacting the victim by mail. If a jailhouse witness is still in custody, the notification attempt shall be made before the jailhouse witness is released from custody.\n(c) Whenever a prosecutor notifies a victim of domestic assault, criminal sexual conduct, or harassment or stalking under this section, the prosecutor shall also inform the victim of the method and benefits of seeking an order for protection under section 518B.01 or a restraining order under section 609.748 and that the victim may seek an order without paying a fee.\n(d) The notification required under this subdivision is in addition to the notification requirements and rights described in sections 611A.03, 611A.0315, 611A.039, and 611A.06.",
	"repealed": false
}