{
	"id": "260D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.01",
	"title": "260D.01 CHILD IN VOLUNTARY FOSTER CARE FOR TREATMENT.",
	"text": "(a) Sections 260D.01 to 260D.10, may be cited as the \"child in voluntary foster care for treatment\" provisions of the Juvenile Court Act.\n(b) The juvenile court has original and exclusive jurisdiction over a child in voluntary foster care for treatment upon the filing of a report or petition required under this chapter. All obligations of the responsible social services agency to a child and family in foster care contained in chapter 260C not inconsistent with this chapter are also obligations of the agency with regard to a child in foster care for treatment under this chapter.\n(c) This chapter shall be construed consistently with the mission of the children's mental health service system as set out in section 245.487, subdivision 3, and the duties of an agency under sections 256B.092 and 260C.157 and Minnesota Rules, parts 9525.0004 to 9525.0016, to meet the needs of a child with a developmental disability or related condition. This chapter:\n(1) establishes voluntary foster care through a voluntary foster care agreement as the means for an agency and a parent to provide needed treatment when the child must be in foster care to receive necessary treatment for an emotional disturbance or developmental disability or related condition;\n(2) establishes court review requirements for a child in voluntary foster care for treatment due to emotional disturbance or developmental disability or a related condition;\n(3) establishes the ongoing responsibility of the parent as legal custodian to visit the child, to plan together with the agency for the child's treatment needs, to be available and accessible to the agency to make treatment decisions, and to obtain necessary medical, dental, and other care for the child;\n(4) applies to voluntary foster care when the child's parent and the agency agree that the child's treatment needs require foster care either:\n(i) due to a level of care determination by the agency's screening team informed by the child's diagnostic and functional assessment under section 245.4885; or\n(ii) due to a determination regarding the level of services needed by the child by the responsible social services agency's screening team under section 256B.092, and Minnesota Rules, parts 9525.0004 to 9525.0016; and\n(5) includes the requirements for a child's placement in sections 260C.70 to 260C.714, when the juvenile treatment screening team recommends placing a child in a qualified residential treatment program, except as modified by this chapter.\n(d) This chapter does not apply when there is a current determination under chapter 260E that the child requires child protective services or when the child is in foster care for any reason other than treatment for the child's emotional disturbance or developmental disability or related condition. When there is a determination under chapter 260E that the child requires child protective services based on an assessment that there are safety and risk issues for the child that have not been mitigated through the parent's engagement in services or otherwise, or when the child is in foster care for any reason other than the child's emotional disturbance or developmental disability or related condition, the provisions of chapter 260C apply.\n(e) The paramount consideration in all proceedings concerning a child in voluntary foster care for treatment is the safety, health, and the best interests of the child. The purpose of this chapter is:\n(1) to ensure that a child with a disability is provided the services necessary to treat or ameliorate the symptoms of the child's disability;\n(2) to preserve and strengthen the child's family ties whenever possible and in the child's best interests, approving the child's placement away from the child's parents only when the child's need for care or treatment requires out-of-home placement and the child cannot be maintained in the home of the parent; and\n(3) to ensure that the child's parent retains legal custody of the child and associated decision-making authority unless the child's parent willfully fails or is unable to make decisions that meet the child's safety, health, and best interests. The court may not find that the parent willfully fails or is unable to make decisions that meet the child's needs solely because the parent disagrees with the agency's choice of foster care facility, unless the agency files a petition under chapter 260C, and establishes by clear and convincing evidence that the child is in need of protection or services.\n(f) The legal parent-child relationship shall be supported under this chapter by maintaining the parent's legal authority and responsibility for ongoing planning for the child and by the agency's assisting the parent, when necessary, to exercise the parent's ongoing right and obligation to visit or to have reasonable contact with the child. Ongoing planning means:\n(1) actively participating in the planning and provision of educational services, medical, and dental care for the child;\n(2) actively planning and participating with the agency and the foster care facility for the child's treatment needs;\n(3) planning to meet the child's need for safety, stability, and permanency, and the child's need to stay connected to the child's family and community;\n(4) engaging with the responsible social services agency to ensure that the family and permanency team under section 260C.706 consists of appropriate family members. For purposes of voluntary placement of a child in foster care for treatment under chapter 260D, prior to forming the child's family and permanency team, the responsible social services agency must consult with the child's parent or legal guardian, the child if the child is 14 years of age or older, and, if applicable, the child's Tribe to obtain recommendations regarding which individuals to include on the team and to ensure that the team is family-centered and will act in the child's best interests. If the child, child's parents, or legal guardians raise concerns about specific relatives or professionals, the team should not include those individuals unless the individual is a treating professional or an important connection to the youth as outlined in the case or crisis plan; and\n(5) for a voluntary placement under this chapter in a qualified residential treatment program, as defined in section 260C.007, subdivision 26d, for purposes of engaging in a relative search as provided in section 260C.221, the county agency must consult with the child's parent or legal guardian, the child if the child is 14 years of age or older, and, if applicable, the child's Tribe to obtain recommendations regarding which adult relatives the county agency should notify. If the child, child's parents, or legal guardians raise concerns about specific relatives, the county agency should not notify those relatives.\n(g) The provisions of section 260.012 to ensure placement prevention, family reunification, and all active and reasonable effort requirements of that section apply.",
	"repealed": false
}