{
	"id": "299F.854",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.854",
	"title": "299F.854 PENALTIES AND REMEDIES.",
	"text": "(a) A manufacturer, wholesale dealer, agent, or any other person or entity who knowingly sells or offers to sell cigarettes, other than through retail sale, in violation of section 299F.851 is liable to a civil penalty:\n(1) for a first offense, not to exceed $10,000 per each sale of such cigarettes; and\n(2) for a subsequent offense, not to exceed $25,000 per each sale of such cigarettes.\n(b) However, the penalty against any such person or entity for a violation under paragraph (a) must not exceed $100,000 during any 30-day period.\n(a) A retail dealer who knowingly sells cigarettes in violation of section 299F.851 is liable to a civil penalty for a first offense, not to exceed:\n(1) $500, and for a subsequent offense, not to exceed $2,000, per each sale or offer for sale of such cigarettes, if the total number sold or offered for sale does not exceed 1,000 cigarettes; or\n(2) $1,000, and for a subsequent offense, not to exceed $5,000, per each sale or offer for sale of such cigarettes, if the total number sold or offered for sale exceeds 1,000 cigarettes.\n(b) However, the penalty against any retail dealer must not exceed $25,000 during any 30-day period.\nIn addition to any penalty prescribed by law, any corporation, partnership, sole proprietor, limited partnership, or association engaged in the manufacture of cigarettes that knowingly makes a false certification pursuant to this subdivision is, for a first offense, liable to a civil penalty of at least $75,000, and for a subsequent offense a civil penalty not to exceed $250,000 for each false certification.\nAny person violating any other provision in sections 299F.850 to 299F.859 is liable to a civil penalty for a first offense not to exceed $1,000, and for a subsequent offense a civil penalty not to exceed $5,000, for each violation.\nCigarettes that have been sold or offered for sale that do not comply with the performance standard required by section 299F.851 are subject to forfeiture under section 297F.21 and, upon judgment of forfeiture, shall be destroyed; provided, however, that before destroying any cigarettes seized in accordance with section 297F.21, which seizure is hereby authorized, the true holder of the trademark rights in the cigarette brand must be permitted to inspect the cigarette.\nIn addition to any other remedy provided by law, the state fire marshal or attorney general may institute a civil action in district court for a violation of this section, including petitioning for injunctive relief or to recover any costs or damages suffered by the state because of a violation under this section, including enforcement costs relating to the specific violation and attorney fees. Each violation of sections 299F.850 to 299F.859 or of rules adopted under sections 299F.850 to 299F.859 constitutes a separate civil violation for which the state fire marshal or attorney general may obtain relief.",
	"repealed": false
}