{
	"id": "144A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.43",
	"title": "144A.43 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 144.699, subdivision 2, and 144A.43 to 144A.482.\n\"Agent\" means the person upon whom all notices and orders shall be served and who is authorized to accept service of notices and orders on behalf of the home care provider.\n\"Applicant\" means an individual, organization, association, corporation, unit of government, or other entity that applies for a temporary license, license, or renewal of the applicant's home care provider license under section 144A.472.\n\"Client\" means a person to whom home care services are provided.\n\"Client record\" means all records that document information about the home care services provided to the client by the home care provider.\n\"Client representative\" means a person who, because of the client's needs, makes decisions about the client's care on behalf of the client. A client representative may be a guardian, health care agent, family member, or other agent of the client. Nothing in this section expands or diminishes the rights of persons to act on behalf of clients under other law.\n\"Commissioner\" means the commissioner of health.\n\"Controlled substance\" has the meaning given in section 152.01, subdivision 4.\n\"Department\" means the Minnesota Department of Health.\n\"Dietary supplement\" means a product taken by mouth that contains a dietary ingredient intended to supplement the diet. Dietary ingredients may include vitamins, minerals, herbs or other botanicals, amino acids, and substances such as enzymes, organ tissue, glandulars, or metabolites.\n\"Dietitian\" is a person licensed under sections 148.621 to 148.633.\n\"Dietetics or nutrition practice\" is performed by a licensed dietitian or licensed nutritionist and includes the activities of assessment, setting priorities and objectives, providing nutrition counseling, developing and implementing nutrition care services, and evaluating and maintaining appropriate standards of quality of nutrition care under sections 148.621 to 148.633.\n\"Home care service\" means any of the following services delivered in the home of a person whose illness, disability, or physical condition creates a need for the service:\n(1) assistive tasks provided by unlicensed personnel;\n(2) services provided by a registered nurse or licensed practical nurse, physical therapist, respiratory therapist, occupational therapist, speech-language pathologist, dietitian or nutritionist, or social worker;\n(3) medication and treatment management services; or\n(4) the provision of durable medical equipment services when provided with any of the home care services listed in clauses (1) to (3).\n\"Hands-on assistance\" means physical help by another person without which the client is not able to perform the activity.\n\"Home\" means the client's temporary or permanent place of residence.\n\"Home care provider\" means an individual, organization, association, corporation, unit of government, or other entity that is regularly engaged in the delivery of at least one home care service, directly in a client's home for a fee and who has a valid current temporary license or license issued under sections 144A.43 to 144A.482.\n[Repealed by amendment, 2013 c 108 art 11 s 7]\n\"License\" means a basic or comprehensive home care license issued by the commissioner to a home care provider.\n\"Licensed health professional\" means a person, other than a registered nurse or licensed practical nurse, who provides home care services within the scope of practice of the person's health occupation license, registration, or certification as regulated and who is licensed by the appropriate Minnesota state board or agency.\n\"Licensee\" means a home care provider that is licensed under this chapter.\n\"Managerial official\" means an administrator, director, officer, trustee, or employee of a home care provider, however designated, who has the authority to establish or control business policy.\n\"Medication\" means a prescription or over-the-counter drug. For purposes of this chapter only, medication includes dietary supplements.\n\"Medication administration\" means performing a set of tasks that include the following:\n(1) checking the client's medication record;\n(2) preparing the medication as necessary;\n(3) administering the medication to the client;\n(4) documenting the administration or reason for not administering the medication; and\n(5) reporting to a registered nurse or appropriate licensed health professional any concerns about the medication, the client, or the client's refusal to take the medication.\n\"Medication management\" means the provision of any of the following medication-related services to a client:\n(1) performing medication setup;\n(2) administering medication;\n(3) storing and securing medications;\n(4) documenting medication activities;\n(5) verifying and monitoring effectiveness of systems to ensure safe handling and administration;\n(6) coordinating refills;\n(7) handling and implementing changes to prescriptions;\n(8) communicating with the pharmacy about the client's medications; and\n(9) coordinating and communicating with the prescriber.\n\"Medication reconciliation\" means the process of identifying the most accurate list of all medications the client is taking, including the name, dosage, frequency, and route by comparing the client record to an external list of medications obtained from the client, hospital, prescriber, or other provider.\n\"Medication setup\" means arranging medications by a nurse, pharmacy, or authorized prescriber for later administration by the client or by comprehensive home care staff.\n\"Nurse\" means a person who is licensed under sections 148.171 to 148.285.\n\"Occupational therapist\" means a person who is licensed under sections 148.6401 to 148.6449.\n\"Over-the-counter drug\" means a drug that is not required by federal law to bear the symbol \"Rx only.\"\n\"Owner\" means a proprietor, a general partner, a limited partner who has five percent or more equity interest in a limited partnership, a person who owns or controls voting stock in a corporation in an amount equal to or greater than five percent of the shares issued and outstanding, or a corporation that owns equity interest in a licensee or applicant for a license.\n\"Pharmacist\" has the meaning given in section 151.01, subdivision 3.\n\"Physical therapist\" means a person who is licensed under sections 148.65 to 148.78.\n\"Physician\" means a person who is licensed under chapter 147.\n\"Prescriber\" means a person who is authorized by sections 148.235; 151.01, subdivision 23; and 151.37 to prescribe prescription drugs.\n\"Prescription\" has the meaning given in section 151.01, subdivision 16a.\n\"Regularly scheduled\" means ordered or planned to be completed at predetermined times or according to a predetermined routine.\n\"Reminder\" means providing a verbal or visual reminder to a client.\n\"Respiratory therapist\" means a person who is licensed under chapter 147C.\n\"Revenues\" means all money received by a licensee derived from the provision of home care services, including fees for services and appropriations of public money for home care services.\n\"Service plan\" means the written plan between the client or client's representative and the temporary licensee or licensee about the services that will be provided to the client.\n\"Social worker\" means a person who is licensed under chapter 148D or 148E.\n\"Speech-language pathologist\" has the meaning given in section 148.512.\n\"Standby assistance\" means the presence of another person to assist a client with an assistive task by providing cues, oversight, and minimal physical assistance.\n\"Substantial compliance\" means complying with the requirements in this chapter sufficiently to prevent unacceptable health or safety risks to the home care client.\n\"Survey\" means an inspection of a licensee or applicant for licensure for compliance with this chapter.\n\"Surveyor\" means a staff person of the department authorized to conduct surveys of home care providers and applicants.\n\"Temporary license\" means the initial basic or comprehensive home care license the department issues after approval of a complete written application and before the department completes the temporary license survey and determines that the temporary licensee is in substantial compliance.\n\"Treatment\" or \"therapy\" means the provision of care, other than medications, ordered or prescribed by a licensed health professional provided to a client to cure, rehabilitate, or ease symptoms.\n\"Unit of government\" means every city, county, town, school district, other political subdivisions of the state, or agency of the state or federal government, which includes any instrumentality of a unit of government.\n\"Unlicensed personnel\" are individuals not otherwise licensed or certified by a governmental health board or agency who provide home care services in the client's home.\n\"Verbal\" means oral and not in writing.",
	"repealed": false
}