{
	"id": "325G.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.27",
	"title": "325G.27 REGISTRATION REQUIREMENTS, SURETY BOND REQUIREMENT, ALTERNATIVE SECURITY.",
	"text": "(a) Every buying, health, or social referral club doing business in this state shall register with the attorney general and provide all information requested on forms the attorney general provides. The person shall furnish the full name and address of each business location where the club's memberships are sold as well as any other registration information the attorney general considers appropriate.\n(b) Each registrant under this section shall pay a registration fee of $250 at the time of registration.\nOn September 1 of each year following the initial registration, each registrant shall pay a renewal fee of $150 to the attorney general.\n(c) The attorney general may bring an action for mandamus against a club to require the club to register or to have and maintain the surety required by this section.\n(a) Every club shall maintain a surety bond issued by a surety company admitted to do business in this state in an amount not less than the aggregate value of outstanding liabilities to members as defined in section 325G.23, subdivision 10. In the case of a renewed lifetime contract, the outstanding liabilities shall be calculated on a prorated basis for not more than 36 months. A copy of the bond shall be filed with the attorney general.\n(b) No club shall be required to file with the attorney general a bond, letter of credit, or cash in excess of $200,000, regardless of the number of facilities.\n(c) The amount of the bond shall be based upon a financial statement covering the immediately preceding 12-month period of the club, and shall be executed under the penalty of perjury by any two duly constituted officers of the corporation, describing the club's outstanding liabilities to the members using generally accepted accounting principles.\nThe financial statement shall be submitted at the time of initial registration and updated at each renewal under subdivision 1.\n(d) If a club's outstanding liabilities to the members exceed the amount of the bond, and the club has failed to increase the bond, then the club shall immediately stop selling club memberships and shall refrain from selling club memberships until the requirements of this subdivision have been satisfied.\n(e) An irrevocable letter of credit in a form acceptable to the attorney general, or a cash deposit, may be filed with the attorney general instead of a surety bond where evidence is presented that a surety bond cannot be obtained.\n(f) This subdivision does not apply to any club which files a declaration with the attorney general, executed under penalty of perjury by the owner or manager of such club, stating that the club does not require or in the ordinary course of business does not receive prepayment for services or merchandise.\n(a) A member of a club who suffers or sustains any loss of prepayments of membership fee by reason of the closing of a facility or bankruptcy by the seller of the club membership agreement shall file a claim with the surety and, if the claim is not paid, may bring an action based on the bond and recover against the surety. In the case of a letter of credit or cash deposit that has been filed with the attorney general, the member may file a claim with the attorney general.\n(b) Any claim under paragraph (a) shall be filed no later than one year from the date on which the facility closed or bankruptcy was filed.\n(c) The attorney general may file a claim with the surety on behalf of any member. The surety shall pay the amount of the claims to the attorney general for distribution to claimants entitled to restitution and shall be relieved of liability to that extent.\n(d) The liability of the surety under any bond may not exceed the aggregate amount of the bond, regardless of the number or amount of claims filed.\n(e) If the claims filed exceeds the amount of the surety bond, the surety shall pay the amount of the bond to the attorney general for distribution to claimants entitled to restitution and shall be relieved of all liability under the bond.\n(a) Each club that sells club memberships to be offered at a planned facility or a facility under construction shall:\n(1) register under subdivision 1 before conducting sales activities; and\n(2) maintain a surety bond, irrevocable letter of credit, or cash deposit filed with the attorney general, in an amount not less than $25,000 until the value of obligations to consumers exceeds that amount.\n(b) Until the time a person opens a club facility, the amount of the surety shall be increased as necessary to take into account increases in the person's outstanding liabilities to the members with a final adjustment to be made at the time of opening.\n(c) Upon opening the facility, the person is subject to subdivisions 1 to 3.",
	"repealed": false
}