{
	"id": "327C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.16",
	"title": "327C.16 CLASS I MANUFACTURED HOME PARK.",
	"text": "(a) To qualify as a class I manufactured home park, as defined in section 327C.015, subdivision 2, a park owner, or on-site attendant as an employee of the manufactured home park, must satisfy 12 hours of qualifying education courses every three years, as prescribed in this subdivision. Park owners or on-site attendants may begin accumulating qualifying hours to qualify as a class I manufactured home park beginning in 2017.\n(b) The qualifying education courses required for classification under this subdivision must be continuing education courses approved by the Department of Labor and Industry or the Department of Commerce for:\n(1) continuing education in real estate; or\n(2) continuing education for residential contractors and manufactured home installers.\n(c) The qualifying education courses must include:\n(1) two hours on fair housing, approved for real estate licensure or residential contractor licensure;\n(2) one hour on the Americans with Disabilities Act, approved for real estate licensure or residential contractor licensure;\n(3) four hours on legal compliance related to any of the following: landlord/tenant, licensing requirements, or home financing under chapters 58, 327, 327B, 327C, and 504B, and Minnesota Rules, chapter 1350 or 4630;\n(4) three hours of general education approved for real estate, residential contractors, or manufactured home installers; and\n(5) two hours of HUD-specific manufactured home installer courses as required under section 327B.041.\n(d) If the qualifying owner or employee attendant is no longer the person meeting the requirements under this subdivision, but did qualify during the current assessment year, then the manufactured home park shall still qualify for the class rate provided for class 4c property classified under section 273.13, subdivision 25, paragraph (d), clause (5), item (iii).\n(a) A park owner that has met the requirements of subdivision 1 shall provide an affidavit to the park owner's county assessor certifying that the park owner, corporate officer, or on-site attendant has complied with subdivision 1 and that the park meets the definition of a class I manufactured home park as defined in this section, and is entitled to the property tax classification rate for class I manufactured home parks in section 273.13, subdivision 25. The park owner shall retain the original course completion certificates issued by the course sponsor under this section for three years and, upon written request for verification, provide these to the county assessor within 30 days.\n(b) A park owner must provide the county assessor written notice of any change in compliance status of the manufactured home park no later than December 15 of the assessment year.",
	"repealed": false
}