{
	"id": "256P.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.01",
	"title": "256P.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Agency\" means any county, federally recognized Indian tribe, or multicounty social services collaboratives.\n\"Assistance unit\" is defined by program area under sections 142E.01, subdivision 13; 142G.02, subdivision 8; 256D.02, subdivision 1d; 256D.35, subdivision 3a; and 256I.03, subdivision 1b.\n\"Census income\" means income earned working as a census enumerator or decennial census worker responsible for recording the housing units and residents in a specific geographic area.\n\"Date of application\" means the date on which the agency receives an applicant's application as a signed written application, an application submitted by telephone, or an application submitted through Internet telepresence. The child care assistance program under chapter 142E is exempt from this definition.\n\"Earned income\" means income earned through the receipt of wages, salary, commissions, bonuses, tips, gratuities, profit from employment activities, net profit from self-employment activities, payments made by an employer for regularly accrued vacation or sick leave, severance pay based on accrued leave time, benefits paid under chapter 268B, royalties, honoraria, or other profit from activity that results from the client's work, effort, or labor for purposes other than student financial assistance, rehabilitation programs, student training programs, or service programs such as AmeriCorps. The income must be in return for, or as a result of, legal activity.\n[See Note.]\n\"Earned income disregard\" means earned income that is not counted according to section 256P.03 when determining eligibility and calculating the amount of the assistance payment.\n\"Equity value\" means the amount of equity in personal property owned by a person and is determined by subtracting any outstanding encumbrances from the fair market value of the personal property.\n\"Lived-experience engagement\" means an intentional engagement of people with lived experience by a federal, Tribal, state, county, municipal, or nonprofit human services agency funded in part or in whole by federal, state, local government, Tribal Nation, public, private, or philanthropic money to gather and share feedback on the impact of human services programs.\n\"Personal property\" means an item of value that is not real property.\n(a) For illness, injury, or incapacity, a \"qualified professional\" means a licensed physician, physician assistant, advanced practice registered nurse, physical therapist, occupational therapist, or licensed chiropractor, according to their scope of practice.\n(b) For developmental disability, learning disability, and intelligence testing, a \"qualified professional\" means a licensed physician, physician assistant, advanced practice registered nurse, licensed independent clinical social worker, licensed psychologist, certified school psychologist, or certified psychometrist working under the supervision of a licensed psychologist.\n(c) For mental health, a \"qualified professional\" means a licensed physician, advanced practice registered nurse, physician assistant, or qualified mental health professional under section 245I.04, subdivision 2.\n(d) For substance use disorder, a \"qualified professional\" means a licensed physician, a licensed physician assistant, a qualified mental health professional under section 245I.04, subdivision 2, or an individual as defined in section 245G.11, subdivision 3, 4, or 5.\n\"Self-employment\" means employment by an individual who:\n(1) incurs costs in producing income and deducts these costs in order to equate the individual's income with income from sources where there are no production costs; and\n(2) controls the individual's work by working either independently of an employer or freelance, or by running the business; or\n(3) pays self-employment taxes.\n\"Unearned income\" has the meaning given in section 256P.06, subdivision 3, clause (2).\n\"Prospective budgeting\" means estimating the amount of monthly income that an assistance unit will have in the payment month.\n[See Note.]",
	"repealed": false
}