{
	"id": "147E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/147E.06",
	"title": "147E.06 PROFESSIONAL CONDUCT.",
	"text": "(a) The registered naturopathic doctor shall obtain a signed informed consent from the patient prior to initiating treatment and after advising the patient of the naturopathic doctor's qualifications including education and registration information; and outlining of the scope of practice of registered naturopathic doctors in Minnesota. This information must be supplied to the patient in writing before or at the time of the initial visit. The registrant shall present treatment facts and options accurately to the patient or to the individual responsible for the patient's care and make treatment recommendations according to standards of good naturopathic medical practice.\n(b) Upon request, the registered naturopathic doctor must provide a copy of the informed consent form to the board.\n(a) A registered naturopathic doctor shall maintain a record for seven years for each patient treated, including:\n(1) a copy of the informed consent;\n(2) evidence of a patient interview concerning the patient's medical history and current physical condition;\n(3) evidence of an examination and assessment;\n(4) record of the treatment provided to the patient; and\n(5) evidence of evaluation and instructions given to the patient, including acknowledgment by the patient in writing that, if deemed necessary by the registered naturopathic doctor, the patient has been advised to consult with another health care provider.\n(b) A registered naturopathic doctor shall maintain the records of minor patients for seven years or until the minor's 19th birthday, whichever is longer.\nAll records maintained on a naturopathic patient by a registered naturopathic doctor are subject to sections 144.291 to 144.298.\nSubd. 4. State and municipal public health regulations. A registered naturopathic doctor shall comply with all applicable state and municipal requirements regarding public health.",
	"repealed": false
}