{
	"id": "62L.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.13",
	"title": "62L.13 REINSURANCE ASSOCIATION.",
	"text": "The Health Coverage Reinsurance Association may operate as a nonprofit unincorporated association, but is authorized to incorporate under chapter 317A. All health carriers in the small employer market shall be and remain members of the association as a condition of their authority to transact business.\nThe association is established to provide for the fair and equitable transfer of risk associated with participation by a health carrier in the small employer market to a private reinsurance pool established and maintained by the association.\nThe association, its transactions, and all property owned by it are exempt from taxation under the laws of this state or any of its subdivisions, including, but not limited to, premiums taxes imposed under chapter 297I, income tax, sales tax, use tax, and property tax. The association may seek exemption from payment of all fees and taxes levied by the federal government. Except as otherwise provided in this chapter, the association is not subject to the provisions of chapters 13, 13D, 60A, and 62A to 62H. The association is not a public employer and is not subject to the provisions of chapters 179A and 353. The board of directors and health carriers who are members of the association are exempt from sections 325D.49 to 325D.66 in the performance of their duties as directors and members of the association.\nThe association may exercise all of the powers of a corporation formed under chapter 317A, including, but not limited to, the authority to:\n(1) establish operating rules, conditions, and procedures relating to the reinsurance of members' risks;\n(2) assess members in accordance with the provisions of this section and to make advance interim assessments as may be reasonable and necessary for organizational and interim operating expenses;\n(3) sue and be sued, including taking any legal action necessary to recover any assessments;\n(4) enter into contracts necessary to carry out the provisions of this chapter;\n(5) establish operating, administrative, and accounting procedures for the operation of the association; and\n(6) borrow money against the future receipt of premiums and assessments up to the amount of the previous year's assessment, with the prior approval of the commissioner.\nThe provisions of this chapter govern if the provisions of chapter 317A conflict with this chapter. The association may operate under the plan of operation approved by the board and shall be governed in accordance with this chapter and may operate in accordance with chapter 317A. If the association incorporates as a nonprofit corporation under chapter 317A, the filing of the plan of operation meets the requirements of filing articles.\nThe commissioner of commerce shall supervise the association in accordance with this chapter. The commissioner of commerce may examine the association. The association's reinsurance policy forms, its contracts, its premium rates, and its assessments are subject to the approval of the commissioner of commerce. The association's policy forms, contracts, and premium rates are deemed approved if not disapproved by the commissioner of commerce within 60 days after the date of filing them with the commissioner of commerce. The association's assessments are deemed approved if not disapproved by the commissioner of commerce within 15 business days after filing them with the commissioner of commerce. The association shall notify the commissioner of all association or board meetings, and the commissioner or the commissioner's designee may attend all association or board meetings. The association shall file an annual report with the commissioner on or before July 1 of each year, beginning July 1, 1994, describing its activities during the preceding calendar year. The report must include a financial report and a summary of claims paid by the association. The annual report must be available for public inspection.",
	"repealed": false
}