{
	"id": "290.0674",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0674",
	"title": "290.0674 MINNESOTA EDUCATION CREDIT.",
	"text": "An individual is allowed a credit against the tax imposed by this chapter in an amount equal to 75 percent of the amount paid for education-related expenses for a qualifying child in kindergarten through grade 12.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Education-related expenses\" means:\n(1) qualifying instructional fees or tuition;\n(2) expenses for textbooks, including books and other instructional materials and equipment purchased or leased for use in elementary and secondary schools in teaching only those subjects legally and commonly taught in public elementary and secondary schools in this state. \"Textbooks\" does not include instructional books and materials used in the teaching of religious tenets, doctrines, or worship, the purpose of which is to instill such tenets, doctrines, or worship, nor does it include books or materials for extracurricular activities including sporting events, musical or dramatic events, speech activities, driver's education, or similar programs;\n(3) a maximum expense of $200 per family for personal computer hardware, excluding single purpose processors, and educational software that assists a dependent to improve knowledge of core curriculum areas or to expand knowledge and skills under the required academic standards under section 120B.021, subdivision 1, and the elective standard under section 120B.022, subdivision 1, clause (2), purchased for use in the taxpayer's home and not used in a trade or business regardless of whether the computer is required by the dependent's school; and\n(4) the amount paid to others for transportation of a qualifying child attending an elementary or secondary school situated in Minnesota, North Dakota, South Dakota, Iowa, or Wisconsin, wherein a resident of this state may legally fulfill the state's compulsory attendance laws, which is not operated for profit, and which adheres to the provisions of the Civil Rights Act of 1964 and chapter 363A. Amounts under this clause exclude any expense the taxpayer incurred in using the taxpayer's or the qualifying child's vehicle.\n(c) \"Qualified instructor\" means an individual who is not a lineal ancestor or sibling of the dependent and who is:\n(1) an instructor under section 120A.22, subdivision 10, clause (1), (2), (3), (4), or (5); or\n(2) a member of the Minnesota Music Teachers Association.\n(d) \"Qualifying child\" has the meaning given in section 32(c)(3) of the Internal Revenue Code.\n(e) \"Qualifying instructional fees or tuition\" means fees or tuition for instruction by a qualified instructor outside the regular school day or school year, and that does not include the teaching of religious tenets, doctrines, or worship, the purpose of which is to instill such tenets, doctrines, or worship, including:\n(1) driver's education offered as part of school curriculum, regardless of whether it is taken from a public or private entity; or\n(2) tutoring or summer camps that:\n(i) are in grade or age appropriate curricula that supplement curricula and instruction available during the regular school year;\n(ii) assist a dependent to improve knowledge of core curriculum areas; or\n(iii) expand knowledge and skills under:\n(A) the required academic standards under section 120B.021, subdivision 1; and\n(B) the world languages standards under section 120B.022, subdivision 1.\n(a) For claimants with adjusted gross income not greater than $70,000, the maximum credit allowed for a family is $1,500 multiplied by the number of qualifying children in kindergarten through grade 12 in the family. The maximum credit for families with one qualifying child in kindergarten through grade 12 is reduced by $1 for each $4 of adjusted gross income over $70,000, and the maximum credit for families with two or more qualifying children in kindergarten through grade 12 is reduced by $2 for each $4 of adjusted gross income over $70,000, but in no case is the credit less than zero.\n(b) In the case of a married claimant, a credit is not allowed unless a joint income tax return is filed.\n(c) For a nonresident or part-year resident, the credit determined under subdivision 1 and the maximum credit amount in paragraph (a) must be allocated using the percentage calculated in section 290.06, subdivision 2c, paragraph (e).\nMS 2022 [Repealed by amendment, 2023 c 64 art 1 s 37]\n[Repealed, 2014 c 308 art 9 s 94]\nIf the amount of credit that the claimant is eligible to receive under this section exceeds the claimant's tax liability under this chapter, the commissioner shall refund the excess to the claimant.\nAn amount sufficient to pay the refunds required by this section is appropriated to the commissioner from the general fund.\nThe commissioner shall annually adjust the adjusted gross income amounts in subdivision 2, as provided in section 270C.22. The statutory year is taxable year 2023.",
	"repealed": false
}