{
	"id": "169A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.60",
	"title": "169A.60 ADMINISTRATIVE IMPOUNDMENT OF PLATES.",
	"text": "(a) As used in this section, the following terms have the meanings given in this subdivision.\n(b) \"Family or household member\" has the meaning given in section 169A.63, subdivision 1.\n(c) \"Motor vehicle\" means a self-propelled motor vehicle other than a motorboat in operation or an off-road recreational vehicle.\n(d) \"Plate impoundment violation\" includes:\n(1) a violation of section 169A.20 (driving while impaired), 169A.52 (license revocation for test failure or refusal), or 171.177 (revocation; search warrant), or an ordinance from this state or a statute or ordinance from another state in conformity with any of those sections, that results in the revocation of a person's driver's license or driving privileges, within ten years of a qualified prior impaired driving incident;\n(2) a license disqualification under section 171.165 (commercial driver's license disqualification) resulting from a violation of section 169A.52 or 171.177 within ten years of a qualified prior impaired driving incident;\n(3) a violation of section 169A.20, 169A.52, or 171.177 while having an alcohol concentration of twice the legal limit or more as measured at the time, or within two hours of the time, of the offense;\n(4) a violation of section 169A.20, 169A.52, or 171.177 while having a child under the age of 16 in the vehicle if the child is more than 36 months younger than the offender; or\n(5) a violation of section 171.24 (driving without valid license) by a person whose driver's license or driving privileges have been canceled or denied under section 171.04, subdivision 1, clause (10) (persons not eligible for driver's license, inimical to public safety).\n(e) \"Violator\" means a person who was driving, operating, or in physical control of the motor vehicle when the plate impoundment violation occurred.\n(a) The commissioner shall issue a registration plate impoundment order when:\n(1) a person's driver's license or driving privileges are revoked for a plate impoundment violation;\n(2) a person is arrested for or charged with a plate impoundment violation described in subdivision 1, paragraph (d), clause (5); or\n(3) a person issued new registration plates pursuant to subdivision 13, paragraph (f), violates the terms of the ignition interlock program as described in subdivision 13, paragraph (g).\n(b) The order must require the impoundment of the registration plates of the motor vehicle involved in the plate impoundment violation. The commissioner shall not issue an impoundment order for the registration plates of a rental vehicle, as defined in section 168.041, subdivision 10, or a vehicle registered in another state.\nAn impoundment order is effective when the commissioner or a peace officer acting on behalf of the commissioner notifies the violator or the registered owner of the motor vehicle of the intent to impound and order of impoundment. The notice must advise the violator of the duties and obligations set forth in subdivision 6 (surrender of plates) and of the right to obtain administrative and judicial review. The notice to the registered owner who is not the violator must include the procedure to obtain new registration plates under subdivision 8. If mailed, the notice and order of impoundment is deemed received three days after mailing to the last known address of the violator or the registered owner, including the address provided when the person became a program participant in the ignition interlock program under section 171.306.\nOn behalf of the commissioner, a peace officer issuing a notice of intent to revoke and of revocation for a plate impoundment violation shall also serve a notice of intent to impound and an order of impoundment. On behalf of the commissioner, a peace officer who is arresting a person for or charging a person with a plate impoundment violation described in subdivision 1, paragraph (d), clause (5), shall also serve a notice of intent to impound and an order of impoundment. If the vehicle involved in the plate impoundment violation is accessible to the officer at the time the impoundment order is issued, the officer shall seize the registration plates subject to the impoundment order. The officer shall destroy all plates seized or impounded under this section. The officer shall send to the commissioner copies of the notice of intent to impound and the order of impoundment and a notice that registration plates impounded and seized under this section have been destroyed.\nIf the motor vehicle is registered to the violator, the officer shall issue a temporary vehicle permit that is valid for seven days when the officer issues the notices under subdivision 4. If the motor vehicle is registered in the name of another, the officer shall issue a temporary vehicle permit that is valid for 45 days when the notices are issued under subdivision 3. The permit must be in a form determined by the registrar and whenever practicable must be posted on the left side of the inside rear window of the vehicle. A permit is valid only for the vehicle for which it is issued.\nWithin seven days after issuance of the impoundment notice, a person who receives a notice of impoundment and impoundment order shall surrender all registration plates subject to the impoundment order that were not seized by a peace officer under subdivision 4. Registration plates required to be surrendered under this subdivision must be surrendered to a Minnesota police department, sheriff, or the State Patrol, along with a copy of the impoundment order. A law enforcement agency receiving registration plates under this subdivision shall destroy the plates and notify the commissioner that they have been destroyed. The notification to the commissioner shall also include a copy of the impoundment order.\nA violator may file a sworn statement with the commissioner within seven days of the issuance of an impoundment order stating any material information relating to the impoundment order, including that the vehicle has been sold or destroyed, and supplying the date, name, location, and address of the person or entity that purchased or destroyed the vehicle. The commissioner shall rescind the impoundment order if the violator shows that the impoundment order was not properly issued.\n(a) The commissioner shall rescind the impoundment order of a person subject to an order under this section, other than the violator, if:\n(1) the violator had a valid driver's license on the date of the plate impoundment violation and the person files with the commissioner an acceptable sworn statement containing the following information:\n(i) that the person is the registered owner of the vehicle from which the plates have been impounded under this section;\n(ii) that the person is the current owner and possessor of the vehicle used in the violation;\n(iii) the date on which the violator obtained the vehicle from the registered owner;\n(iv) the residence addresses of the registered owner and the violator on the date the violator obtained the vehicle from the registered owner;\n(v) that the person was not a passenger in the vehicle at the time of the plate impoundment violation; and\n(vi) that the person knows that the violator may not drive, operate, or be in physical control of a vehicle without a valid driver's license; or\n(2) the violator did not have a valid driver's license on the date of the plate impoundment violation and the person made a report to law enforcement before the violation stating that the vehicle had been taken from the person's possession or was being used without permission.\n(b) A person who has failed to make a report as provided in paragraph (a), clause (2), may be issued special registration plates under subdivision 13 for a period of one year from the effective date of the impoundment order. Following this period, the person may apply for regular registration plates.\n(c) If the order is rescinded, the owner shall receive new registration plates at no cost, if the plates were seized and destroyed.\n(a) At any time during the effective period of an impoundment order, a person may request in writing a review of the impoundment order by the commissioner. On receiving a request, the commissioner or the commissioner's designee shall review the order, the evidence upon which the order was based, and any other material information brought to the attention of the commissioner, and determine whether sufficient cause exists to sustain the order. The commissioner shall report in writing the results of the review within 15 days of receiving the request. The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act in sections 14.001 to 14.69. As a result of this review, the commissioner may authorize the issuance at no cost of new registration plates to the registered owner of the vehicle if the registered owner's license or driving privileges were not revoked as a result of the plate impoundment violation.\n(b) Review under this subdivision must take place, if possible, at the same time as any administrative review of the person's license revocation under section 169A.53 (administrative and judicial review of license revocation).\n(a) Within 60 days following receipt of a notice and order of impoundment under this section, a person may petition the court for review. The petition must include proof of service of a copy of the petition on the commissioner. The petition must include the petitioner's date of birth, driver's license number, and date of the plate impoundment violation, as well as the name of the violator and the law enforcement agency that issued the plate impoundment order. The petition must state with specificity the grounds upon which the petitioner seeks rescission of the order for impoundment. The petition may be combined with any petition filed under section 169A.53 (administrative and judicial review of license revocation).\n(b) Except as otherwise provided in this section, the judicial review and hearing are governed by section 169A.53 and must take place at the same time as any judicial review of the person's license revocation under section 169A.53. The filing of the petition does not stay the impoundment order. The reviewing court may order a stay of the balance of the impoundment period if the hearing has not been conducted within 60 days after filing of the petition upon terms the court deems proper. The court shall order either that the impoundment be rescinded or sustained, and forward the order to the commissioner. The court shall file its order within 14 days following the hearing.\n(c) In addition to the issues described in section 169A.53, subdivision 3 (judicial review of license revocation), the scope of a hearing under this subdivision is limited to:\n(1) if the impoundment is based on a plate impoundment violation described in subdivision 1, paragraph (d), clause (3) or (4), whether the peace officer had probable cause to believe the violator committed the plate impoundment violation and whether the evidence demonstrates that the plate impoundment violation occurred; and\n(2) for all other cases, whether the peace officer had probable cause to believe the violator committed the plate impoundment violation.\n(d) In a hearing under this subdivision, the following records are admissible in evidence:\n(1) certified copies of the violator's driving record; and\n(2) certified copies of vehicle registration records bearing the violator's name.\nIf:\n(1) the driver's license revocation that is the basis for an impoundment order is rescinded; and\n(2) the charges for the plate impoundment violation have been dismissed with prejudice or the violator has been acquitted of the plate impoundment violation;\nthen the registrar of motor vehicles shall issue new registration plates for the vehicle at no cost, when the registrar receives an application that includes a copy of the order rescinding the driver's license revocation and either the order dismissing the charges or the judgment of acquittal.\nWhen the registrar of motor vehicles reinstates a person's registration plates after impoundment for reasons other than those described in subdivision 11, the registrar shall charge the person $50 for each vehicle for which the registration plates are being reinstated.\n(a) At any time during the effective period of an impoundment order, a violator or registered owner may apply to the commissioner for new registration plates, which must bear a special series of numbers or letters so as to be readily identified by traffic law enforcement officers.\n(b) The commissioner may not issue new registration plates for that vehicle subject to plate impoundment for a period of at least one year from the date of the impoundment order. In addition, if the owner is the violator, new registration plates may not be issued for the vehicle unless the person has been reissued a valid driver's license in accordance with chapter 171.\n(c) A violator may not apply for new registration plates for a vehicle at any time before the person's driver's license is reinstated.\n(d) The commissioner may issue the special plates on payment of a $50 fee for each vehicle for which special plates are requested, except that a person who paid the fee required under paragraph (f) must not be required to pay an additional fee if the commissioner issued an impoundment order pursuant to paragraph (g).\n(e) Paragraphs (a) to (d) notwithstanding, the commissioner must issue upon request new registration plates for any vehicle owned by a violator or registered owner for which the registration plates have been impounded if:\n(1) the impoundment order is rescinded;\n(2) the vehicle is transferred in compliance with subdivision 14; or\n(3) the vehicle is transferred to a Minnesota automobile dealer licensed under section 168.27, a financial institution that has submitted a repossession affidavit, or a government agency.\n(f) Notwithstanding paragraphs (a) to (d), the commissioner, upon request and payment of a $100 fee for each vehicle for which special plates are requested, must issue new registration plates for any vehicle owned by a violator or registered owner for which the registration plates have been impounded if the violator becomes a program participant in the ignition interlock program under section 171.306. This paragraph does not apply if the registration plates have been impounded pursuant to paragraph (g).\n(g) The commissioner shall issue a registration plate impoundment order for new registration plates issued pursuant to paragraph (f) if, before a program participant in the ignition interlock program under section 171.306 has been restored to full driving privileges, the program participant:\n(1) either voluntarily or involuntarily ceases to participate in the program for more than 30 days; or\n(2) fails to successfully complete the program as required by the Department of Public Safety due to:\n(i) two or more occasions of the participant's driving privileges being withdrawn for violating the terms of the program, unless the withdrawal is determined to be caused by an error of the department or the interlock provider; or\n(ii) violating the terms of the contract with the provider as determined by the provider.\n(a) A registered owner may not sell or transfer a motor vehicle during the time its registration plates have been ordered impounded or during the time its registration plates bear a special series number, unless:\n(1) the sale is for a valid consideration;\n(2) the transferee and the registered owner are not family or household members;\n(3) the transferee signs an acceptable sworn statement with the commissioner attesting that:\n(i) the transferee and the violator are not family or household members;\n(ii) the transferee understands that the vehicle is subject to an impoundment order; and\n(iii) it is a crime under section 169A.37 to file a false statement under this section or to allow the previously registered owner to drive, operate, or be in control of the vehicle during the impoundment period; and\n(4) all elements of section 168A.10 (transfer of interest by owner) are satisfied.\n(b) If the conditions of paragraph (a) are satisfied, the registrar may transfer the title to the new owner upon proper application and issue new registration plates for the vehicle.\nIf the violator applies to the commissioner for registration plates for any vehicle during the effective period of the plate impoundment, the commissioner shall not issue registration plates unless the violator qualifies for special registration plates under subdivision 13 and unless the plates issued are special plates as described in subdivision 13.\nFees collected from the sale or reinstatement of license plates under this section must be paid into the state treasury and credited one-half to the driver and vehicle services operating account under section 299A.705 and one-half to the general fund.\nCriminal penalties for violating this section are governed by section 169A.37.\n[Repealed, 2014 c 255 s 21]",
	"repealed": false
}