{
	"id": "352F.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/352F.02",
	"title": "352F.02 DEFINITIONS.",
	"text": "As used in this chapter, unless the context or subject matter indicates otherwise, the following terms have the meanings given in this section.\n\"Allowable service\" has the meaning provided in Minnesota Statutes 1994, section 352.01, subdivision 11.\n\"Effective date\" is the date terminated hospital employees transfer employment to Fairview under a definitive integration agreement between the University of Minnesota and Fairview or the date terminated Academic Health Center employees are transferred to the University of Minnesota Physicians or University Affiliated Family Physicians, whichever is applicable.\n\"Fairview\" means Fairview Hospital and Healthcare Services, a Minnesota nonprofit corporation, and its successors.\n\"Section\" means the designated section of Minnesota Statutes.\n\"Terminated hospital employee\" means a person who:\n(1) was employed on the day before the effective date by the University of Minnesota at the University of Minnesota Hospital and clinics or the Academic Health Center and was paid on a biweekly payroll;\n(2) terminated employment with the University of Minnesota on the day before the effective date or in the case of employees of the Academic Health Center, terminated employment with the University of Minnesota after the effective date but immediately transferred employment to the University of Minnesota Physicians or University Affiliated Family Physicians; and\n(3) was a participant in the general state employees retirement plan of the Minnesota State Retirement System at the time of termination of employment with the University of Minnesota.\n\"University of Minnesota\" means University of Minnesota Hospital and clinics, the hospitals and clinics operated by the regents of the University of Minnesota.\n\"Years of allowable service\" has the meaning provided in Minnesota Statutes 1994, section 352.01, subdivision 16.\n\"Academic Health Center\" means the seven professional schools in health care related disciplines at the University of Minnesota.\n\"University of Minnesota Physicians\" means the multispecialty single group medical practice group in which medical school faculty will practice medicine beginning in 1997.\n\"University Affiliated Family Physicians\" means the private practice group of the Department of Family Practice in the university's medical school.",
	"repealed": false
}