{
	"id": "18F.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/18F.02",
	"title": "18F.02 DEFINITIONS.",
	"text": "As used in sections 18F.01 to 18F.13, the terms defined in this section have the meanings given them.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n\"Agriculturally related organism\" means any organism that is used in agricultural production or processing of agricultural products. It includes livestock and livestock products; dairy animals and dairy products; poultry and poultry products; domestic fur-bearing animals; animal feeds; horticultural stock; nursery stock, as defined in section 18G.02, subdivision 17; fruit; vegetables; forage grain; wild rice; seeds; bees; apiary products; and products for the control or mitigation of noxious weeds. It excludes vaccines and drugs for use in humans; genetic engineering of human germ cells and human somatic cells intended for use in human gene therapy; vaccines for use in livestock, dairy animals, poultry, domestic fur-bearing animals, or private aquatic life; genetically engineered wild animals; and forestry products.\n\"Commissioner\" means the commissioner of agriculture or an agent authorized by the commissioner.\n\"Coordinated Framework\" means the federal Coordinated Framework for the Regulation of Biotechnology set forth in Federal Register, volume 51, pages 23,302 to 23,350 (June 26, 1986), as amended.\n\"Genetic engineering\" means the introduction of new genetic material to an organism or the regrouping of an organism's genes using techniques or technology designed by humans. This does not include selective breeding, hybridization, or nondirected mutagenesis.\n\"Genetically engineered organism\" means an organism that has been modified directly or indirectly using genetic engineering.\n\"Organism\" means an animal, plant, bacterium, cyanobacterium, fungus, protist, or virus.\n[Repealed, 1994 c 454 s 14]\n\"Regulated organism\" means a genetically engineered organism that is not exempt from federal regulations or that is not yet authorized for commercial use by the appropriate federal agency in the Coordinated Framework.\n\"Release\" means the placement or use of a genetically engineered organism outside a contained laboratory, greenhouse, building, structure, or other similar facility or under other conditions not specifically determined by the commissioner to be adequately contained.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]",
	"repealed": false
}