{
	"id": "524.2-208",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-208",
	"title": "524.2-208 EXCLUSIONS, VALUATION, AND OVERLAPPING APPLICATION.",
	"text": "(a) Exclusions. The value of any property is excluded from the decedent's nonprobate transfers to others (i) to the extent the decedent received adequate and full consideration in money or money's worth for a transfer of the property, or (ii) if the property was transferred with the written joinder of, or if the transfer was consented to in writing by, the surviving spouse.\n(b) Protection of bona fide purchasers. A bona fide purchaser who purchases property from a successor or successors in interest of the decedent or from a transferee of the decedent is neither obligated under this part to return the payment, item of property, or benefit nor is liable under this part for the amount of the payment or the value of the item of property or benefit.\n(c) Valuation. The value of property:\n(1) included in the augmented estate under section 524.2-205, 524.2-206, or 524.2-207 is reduced in each category by mortgages, liens, and enforceable claims against the included property; and\n(2) includes the commuted value of any present or future interest and the commuted value of amounts payable under any trust, life insurance settlement option, annuity contract, public or private pension, disability compensation, death benefit or retirement plan, or any similar arrangement, exclusive of the federal Social Security system. The commuted value of the surviving spouse's interest in a life estate or in any trust shall be calculated as if worth one-half of the total value of the property subject to the life estate, or of the trust estate, unless higher or lower values for these interests are established by proof.\n(d) Overlapping application; no double inclusion. In case of overlapping application to the same property of portions of section 524.2-205, 524.2-206, or 524.2-207, the property is included in the augmented estate under the provision yielding the greatest value, and under only one overlapping provision if they all yield the same value.",
	"repealed": false
}