{
	"id": "144A.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.105",
	"title": "144A.105 SUSPENSION OF ADMISSIONS.",
	"text": "The commissioner of health may suspend admissions to a nursing home or certified boarding care home when:\n(1) the commissioner has issued a penalty assessment or the nursing home has a repeated violation for noncompliance with section 144A.04, subdivision 7;\n(2) the commissioner has issued a penalty assessment or the nursing home or certified boarding care home has repeated violations for not maintaining a sufficient number or type of nursing personnel to meet the needs of the residents, as required by Minnesota Rules, parts 4655.5100 to 4655.5400;\n(3) the commissioner has determined that an emergency exists;\n(4) the commissioner has initiated proceedings to suspend, revoke, or not renew the license of the nursing home or certified boarding care home; or\n(5) the commissioner determines that the remedy of denial of payment, as provided by subparagraph 1919(h)(2)(A)(i) of the Social Security Act, is to be imposed under section 1919(h) of the Social Security Act, or regulations adopted under that section of the Social Security Act.\nIf the commissioner suspends admissions under subdivision 1, the commissioner shall notify the nursing home or certified boarding care home, by written order, that admissions to the nursing home or certified boarding care home will be suspended beginning at a time specified in the order. The suspension is effective no earlier than 48 hours after the nursing home or certified boarding care home receives the order, unless the order is due to an emergency under subdivision 1, clause (3). The order may be served on the administrator of the nursing home or certified boarding care home, or the designated agent in charge of the home, by personal service or by certified or registered mail with a return receipt of delivery. The order shall specify the reasons for the suspension, the corrective action required to be taken by the nursing home or certified boarding care home, and the length of time the suspension will be in effect. The nursing home or certified boarding care home shall not admit any residents after the effective time of the order. In determining the length of time for the suspension, the commissioner shall consider the reasons for the suspension, the performance history of the nursing home, and the needs of the residents.\nAfter receiving the order for suspension, the nursing home or certified boarding care home may request a conference with the commissioner to present reasons why the suspension should be modified or should not go into effect. The request need not be in writing. If a conference is requested within 24 hours after receipt of the order, the commissioner shall hold the conference before the effective time of the suspension, unless the order for suspension is due to an emergency under subdivision 1, clause (3). If a conference is not requested within 24 hours after receipt of the order, the nursing home or certified boarding care home may request a conference and the commissioner shall schedule the conference as soon as practicable. The conference may be held in person or by telephone. After a conference, the commissioner may affirm, rescind, or modify the order.\nThe nursing home or certified boarding care home shall notify the commissioner, in writing, when any required corrective action has been completed. The commissioner may verify the corrective action by inspection under section 144A.10. The commissioner may extend the initial suspension period by written notice to the nursing home or certified boarding care home.\nWhenever the commissioner suspends admissions to a nursing home or certified boarding care home, the commissioner shall notify the commissioner of human services of the order and of any modifications to the order.\nA nursing home or certified boarding care home may appeal from an order for suspension of admissions issued under subdivision 1. To appeal, the nursing home or certified boarding care home shall file with the commissioner a written notice of appeal. The appeal must be received by the commissioner within ten days after the date of receipt of the order for suspension by the nursing home or certified boarding care home. Within 15 calendar days after receiving an appeal, the commissioner shall request assignment of an administrative law judge under sections 14.48 to 14.56 to conduct the hearing as soon as possible or according to agreement of the parties. Regardless of any appeal, the order for suspension of admissions remains in effect until final resolution of the appeal.",
	"repealed": false
}