{
	"id": "469.1761",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1761",
	"title": "469.1761 INCOME REQUIREMENTS; HOUSING DISTRICTS.",
	"text": "(a) In order for a tax increment financing district to qualify as a housing district:\n(1) the income limitations provided in this section must be satisfied; and\n(2) no more than 20 percent of the square footage of buildings that receive assistance from tax increments may consist of commercial, retail, or other nonresidential uses.\n(b) The requirements imposed by this section apply to property receiving assistance financed with tax increments, including interest reduction, land transfers at less than the authority's cost of acquisition, utility service or connections, roads, parking facilities, or other subsidies. The provisions of this section do not apply to districts located in a targeted area as defined in section 462C.02, subdivision 9, clause (e).\n(c) For purposes of the requirements of paragraph (a), the authority may elect to treat an addition to an existing structure as a separate building if:\n(1) construction of the addition begins more than three years after construction of the existing structure was completed; and\n(2) for an addition that does not meet the requirements of paragraph (a), clause (2), if it is treated as a separate building, the addition was not contemplated by the tax increment financing plan which includes the existing structure.\nFor owner-occupied residential property, 95 percent of the housing units must be initially purchased and occupied by individuals whose family income is less than or equal to the income requirements for qualified mortgage bond projects under section 143(f) of the Internal Revenue Code.\nFor residential rental property, the property must satisfy the income requirements for a qualified residential rental project as defined in section 142(d) of the Internal Revenue Code. The requirements of this subdivision apply for the duration of the tax increment financing district.\nFailure to comply with the requirements of this section is subject to section 469.1771.\nFor a project receiving a loan or grant from the Minnesota Housing Finance Agency challenge program under section 462A.33, the income limits under section 462A.33 are substituted for the applicable income limits for the project under subdivision 2 or 3.",
	"repealed": false
}