{
	"id": "244.052",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.052",
	"title": "244.052 PREDATORY OFFENDERS; NOTICE.",
	"text": "As used in this section:\n(1) \"confinement\" means confinement in a state correctional facility or a state treatment facility;\n(2) \"immediate household\" means any and all individuals who live in the same household as the offender;\n(3) \"law enforcement agency\" means the law enforcement agency having primary jurisdiction over the location where the offender expects to reside upon release;\n(4) \"residential facility\" means a regional treatment center operated by the Direct Care and Treatment executive board or a facility that is licensed as a residential program, as defined in section 245A.02, subdivision 14, by the commissioner of human services under chapter 245A, or the commissioner of corrections under section 241.021, whose staff are trained in the supervision of sex offenders; and\n(5) \"predatory offender\" and \"offender\" mean a person who is required to register as a predatory offender under section 243.166. However, the terms do not include persons required to register based solely on a delinquency adjudication.\nBy January 1, 1997, the commissioner of corrections shall develop a risk assessment scale which assigns weights to the various risk factors listed in subdivision 3, paragraph (g), and specifies the risk level to which offenders with various risk assessment scores shall be assigned. In developing this scale, the commissioner shall consult with county attorneys, treatment professionals, law enforcement officials, and probation officers.\n(a) The commissioner of corrections shall establish and administer end-of-confinement review committees at each state correctional facility and at each state treatment facility where predatory offenders are confined. The committees shall assess on a case-by-case basis the public risk posed by predatory offenders who are about to be released from confinement.\n(b) Each committee shall be a standing committee and shall consist of the following members appointed by the commissioner:\n(1) the chief executive officer or head of the correctional or treatment facility where the offender is currently confined, or that person's designee;\n(2) a law enforcement officer;\n(3) a treatment professional who is trained in the assessment of sex offenders;\n(4) a caseworker experienced in supervising sex offenders; and\n(5) a victim's services professional.\nMembers of the committee, other than the facility's chief executive officer or head, shall be appointed by the commissioner to two-year terms. The chief executive officer or head of the facility or designee shall act as chair of the committee and shall use the facility's staff, as needed, to administer the committee, obtain necessary information from outside sources, and prepare risk assessment reports on offenders.\n(c) The committee shall have access to the following data on a predatory offender only for the purposes of its assessment and to defend the committee's risk assessment determination upon administrative review under this section:\n(1) private medical data under section 13.384 or sections 144.291 to 144.298, or welfare data under section 13.46 that relate to medical treatment of the offender;\n(2) private and confidential court services data under section 13.84;\n(3) private and confidential corrections data under section 13.85; and\n(4) private criminal history data under section 13.87.\nData collected and maintained by the committee under this paragraph may not be disclosed outside the committee, except as provided under section 13.05, subdivision 3 or 4. The predatory offender has access to data on the offender collected and maintained by the committee, unless the data are confidential data received under this paragraph.\n(d)(i) Except as otherwise provided in items (ii), (iii), and (iv), at least 90 days before a predatory offender is to be released from confinement, the commissioner of corrections shall convene the appropriate end-of-confinement review committee for the purpose of assessing the risk presented by the offender and determining the risk level to which the offender shall be assigned under paragraph (e). The offender and the law enforcement agency that was responsible for the charge resulting in confinement shall be notified of the time and place of the committee's meeting. The offender has a right to be present and be heard at the meeting. The law enforcement agency, agent, and victim may provide material in writing that is relevant to the offender's risk level to the chair of the committee. The committee shall use the risk factors described in paragraph (g) and the risk assessment scale developed under subdivision 2 to determine the offender's risk assessment score and risk level. Offenders scheduled for release from confinement shall be assessed by the committee established at the facility from which the offender is to be released.\n(ii) If an offender is received for confinement in a facility with less than 90 days remaining in the offender's term of confinement, the offender's risk shall be assessed at the first regularly scheduled end of confinement review committee that convenes after the appropriate documentation for the risk assessment is assembled by the committee. The commissioner shall make reasonable efforts to ensure that offender's risk is assessed and a risk level is assigned or reassigned at least 30 days before the offender's release date.\n(iii) If the offender is subject to a mandatory life sentence under section 609.3455, subdivision 3 or 4, the commissioner of corrections shall convene the appropriate end-of-confinement review committee at least nine months before the offender's minimum term of imprisonment has been served. If the offender is received for confinement in a facility with less than nine months remaining before the offender's minimum term of imprisonment has been served, the committee shall conform its procedures to those outlined in item (ii) to the extent practicable.\n(iv) If the offender is granted supervised release, the commissioner of corrections shall notify the appropriate end-of-confinement review committee that it needs to review the offender's previously determined risk level at its next regularly scheduled meeting. The commissioner shall make reasonable efforts to ensure that the offender's earlier risk level determination is reviewed and the risk level is confirmed or reassigned at least 60 days before the offender's release date. The committee shall give the report to the offender and to the law enforcement agency, and the commissioner shall provide notice of the risk level assignment to the victim, if requested, at least 60 days before an offender is released from confinement.\n(e) The committee shall assign to risk level I a predatory offender whose risk assessment score indicates a low risk of reoffense. The committee shall assign to risk level II an offender whose risk assessment score indicates a moderate risk of reoffense. The committee shall assign to risk level III an offender whose risk assessment score indicates a high risk of reoffense.\n(f) Before the predatory offender is released from confinement, the committee shall prepare a risk assessment report which specifies the risk level to which the offender has been assigned and the reasons underlying the committee's risk assessment decision. Except for an offender subject to a mandatory life sentence under section 609.3455, subdivision 3 or 4, who has not been granted supervised release, the committee shall give the report to the offender and to the law enforcement agency, and the commissioner shall provide notice of the risk level assignment to the victim, if requested, at least 60 days before an offender is released from confinement. If the offender is subject to a mandatory life sentence and has not yet served the entire minimum term of imprisonment, the committee shall give the report to the offender and to the commissioner at least six months before the offender is first eligible for release. If the risk assessment is performed under the circumstances described in paragraph (d), item (ii), the report shall be given to the offender and the law enforcement agency as soon as it is available. The committee also shall inform the offender of the availability of review under subdivision 6.\n(g) As used in this subdivision, \"risk factors\" includes, but is not limited to, the following factors:\n(1) the seriousness of the offense should the offender reoffend. This factor includes consideration of the following:\n(i) the degree of likely force or harm;\n(ii) the degree of likely physical contact; and\n(iii) the age of the likely victim;\n(2) the offender's prior offense history. This factor includes consideration of the following:\n(i) the relationship of prior victims to the offender;\n(ii) the number of prior offenses or victims;\n(iii) the duration of the offender's prior offense history;\n(iv) the length of time since the offender's last prior offense while the offender was at risk to commit offenses; and\n(v) the offender's prior history of other antisocial acts;\n(3) the offender's characteristics. This factor includes consideration of the following:\n(i) the offender's response to prior treatment efforts; and\n(ii) the offender's history of substance abuse;\n(4) the availability of community supports to the offender. This factor includes consideration of the following:\n(i) the availability and likelihood that the offender will be involved in therapeutic treatment;\n(ii) the availability of residential supports to the offender, such as a stable and supervised living arrangement in an appropriate location;\n(iii) the offender's familial and social relationships, including the nature and length of these relationships and the level of support that the offender may receive from these persons; and\n(iv) the offender's lack of education or employment stability;\n(5) whether the offender has indicated or credible evidence in the record indicates that the offender will reoffend if released into the community; and\n(6) whether the offender demonstrates a physical condition that minimizes the risk of reoffense, including but not limited to, advanced age or a debilitating illness or physical condition.\n(h) Upon the request of the law enforcement agency or the offender's corrections agent, the commissioner may reconvene the end-of-confinement review committee for the purpose of reassessing the risk level to which an offender has been assigned under paragraph (e). In a request for a reassessment, the law enforcement agency which was responsible for the charge resulting in confinement or agent shall list the facts and circumstances arising after the initial assignment or facts and circumstances known to law enforcement or the agent but not considered by the committee under paragraph (e) which support the request for a reassessment. The request for reassessment by the law enforcement agency must occur within 30 days of receipt of the report indicating the offender's risk level assignment. The offender's corrections agent, in consultation with the chief law enforcement officer in the area where the offender resides or intends to reside, may request a review of a risk level at any time if substantial evidence exists that the offender's risk level should be reviewed by an end-of-confinement review committee. This evidence includes, but is not limited to, evidence of treatment failures or completions, evidence of exceptional crime-free community adjustment or lack of appropriate adjustment, evidence of substantial community need to know more about the offender or mitigating circumstances that would narrow the proposed scope of notification, or other practical situations articulated and based in evidence of the offender's behavior while under supervision. Upon review of the request, the end-of-confinement review committee may reassign an offender to a different risk level. If the offender is reassigned to a higher risk level, the offender has the right to seek review of the committee's determination under subdivision 6.\n(i) An offender may request the end-of-confinement review committee to reassess the offender's assigned risk level after three years have elapsed since the committee's initial risk assessment and may renew the request once every two years following subsequent denials. In a request for reassessment, the offender shall list the facts and circumstances which demonstrate that the offender no longer poses the same degree of risk to the community. In order for a request for a risk level reduction to be granted, the offender must demonstrate full compliance with supervised release conditions, completion of required post-release treatment programming, and full compliance with all registration requirements as detailed in section 243.166. The offender must also not have been convicted of any felony, gross misdemeanor, or misdemeanor offenses subsequent to the assignment of the original risk level. The committee shall follow the process outlined in paragraphs (a) to (c) in the reassessment. An offender who is incarcerated may not request a reassessment under this paragraph.\n(j) Offenders returned to prison as release violators shall not have a right to a subsequent risk reassessment by the end-of-confinement review committee unless substantial evidence indicates that the offender's risk to the public has increased.\n(k) If the committee assigns a predatory offender to risk level III, the committee shall determine whether residency restrictions shall be included in the conditions of the offender's release based on the offender's pattern of offending behavior.\n(a) Except as provided in paragraph (b), the commissioner shall establish an end-of-confinement review committee to assign a risk level:\n(1) to offenders who are released from a federal correctional facility in Minnesota or a federal correctional facility in another state and who intend to reside in Minnesota;\n(2) to offenders who are accepted from another state under the interstate compact authorized by section 243.1605 or any other authorized interstate agreement; and\n(3) to offenders who are referred to the committee by local law enforcement agencies under paragraph (f).\n(b) This subdivision does not require the commissioner to convene an end-of-confinement review committee for a person coming into Minnesota who is subject to probation under another state's law. The probation or court services officer and law enforcement officer shall manage such cases in accordance with section 244.10, subdivision 8.\n(c) The committee shall make reasonable efforts to conform to the same timelines applied to offenders released from a Minnesota correctional facility and shall collect all relevant information and records on offenders assessed and assigned a risk level under this subdivision. However, for offenders who were assigned the most serious risk level by another state, the committee must act promptly to collect the information required under this paragraph.\nThe end-of-confinement review committee must proceed in accordance with all requirements set forth in this section and follow all policies and procedures applied to offenders released from a Minnesota correctional facility in reviewing information and assessing the risk level of offenders covered by this subdivision, unless restrictions caused by the nature of federal or interstate transfers prevent such conformance. All of the provisions of this section apply to offenders who are assessed and assigned a risk level under this subdivision.\n(d) If a local law enforcement agency learns or suspects that a person who is subject to this section is living in Minnesota and a risk level has not been assigned to the person under this section, the law enforcement agency shall provide this information to the Bureau of Criminal Apprehension and the commissioner of corrections within three business days.\n(e) If the commissioner receives reliable information from a local law enforcement agency or the bureau that a person subject to this section is living in Minnesota and a local law enforcement agency so requests, the commissioner must determine if the person was assigned a risk level under a law comparable to this section. If the commissioner determines that the law is comparable and public safety warrants, the commissioner, within three business days of receiving a request, shall notify the local law enforcement agency that it may, in consultation with the department, proceed with notification under subdivision 4 based on the person's out-of-state risk level. However, if the commissioner concludes that the offender is from a state with a risk level assessment law that is not comparable to this section, the extent of the notification may not exceed that of a risk level II offender under subdivision 4, paragraph (b), unless the requirements of paragraph (f) have been met. If an assessment is requested from the end-of-confinement review committee under paragraph (f), the local law enforcement agency may continue to disclose information under subdivision 4 until the committee assigns the person a risk level. After the committee assigns a risk level to an offender pursuant to a request made under paragraph (f), the information disclosed by law enforcement shall be consistent with the risk level assigned by the end-of-confinement review committee. The commissioner of corrections, in consultation with legal advisers, shall determine whether the law of another state is comparable to this section.\n(f) If the local law enforcement agency wants to make a broader disclosure than is authorized under paragraph (e), the law enforcement agency may request that an end-of-confinement review committee assign a risk level to the offender. The local law enforcement agency shall provide to the committee all information concerning the offender's criminal history, the risk the offender poses to the community, and other relevant information. The department shall attempt to obtain other information relevant to determining which risk level to assign the offender. The committee shall promptly assign a risk level to an offender referred to the committee under this paragraph.\n(a) The law enforcement agency in the area where the predatory offender resides, expects to reside, is employed, or is regularly found, shall disclose to the public any information regarding the offender contained in the report forwarded to the agency under subdivision 3, paragraph (f), that is relevant and necessary to protect the public and to counteract the offender's dangerousness, consistent with the guidelines in paragraph (b). The extent of the information disclosed and the community to whom disclosure is made must relate to the level of danger posed by the offender, to the offender's pattern of offending behavior, and to the need of community members for information to enhance their individual and collective safety.\n(b) The law enforcement agency shall employ the following guidelines in determining the scope of disclosure made under this subdivision:\n(1) if the offender is assigned to risk level I, the agency may maintain information regarding the offender within the agency and may disclose it to other law enforcement agencies. Additionally, the agency may disclose the information to any victims of or witnesses to the offense committed by the offender. The agency shall disclose the information to victims of the offense committed by the offender who have requested disclosure and to adult members of the offender's immediate household;\n(2) if the offender is assigned to risk level II, the agency also may disclose the information to agencies and groups that the offender is likely to encounter for the purpose of securing those institutions and protecting individuals in their care while they are on or near the premises of the institution. These agencies and groups include the staff members of public and private educational institutions, day care establishments, and establishments and organizations that primarily serve individuals likely to be victimized by the offender. The agency also may disclose the information to individuals the agency believes are likely to be victimized by the offender. The agency's belief shall be based on the offender's pattern of offending or victim preference as documented in the information provided by the Department of Corrections or Human Services. The agency may disclose the information to property assessors, property inspectors, code enforcement officials, and child protection officials who are likely to visit the offender's home in the course of their duties;\n(3) if the offender is assigned to risk level III, the agency shall disclose the information to the persons and entities described in clauses (1) and (2) and to other members of the community whom the offender is likely to encounter, unless the law enforcement agency determines that public safety would be compromised by the disclosure or that a more limited disclosure is necessary to protect the identity of the victim.\nNotwithstanding the assignment of a predatory offender to risk level II or III, a law enforcement agency may not make the disclosures permitted or required by clause (2) or (3), if: the offender is placed or resides in a residential facility. However, if an offender is placed or resides in a residential facility, the offender and the head of the facility shall designate the offender's likely residence upon release from the facility and the head of the facility shall notify the commissioner of corrections or the commissioner of human services of the offender's likely residence at least 14 days before the offender's scheduled release date. The commissioner shall give this information to the law enforcement agency having jurisdiction over the offender's likely residence. The head of the residential facility also shall notify the commissioner of corrections or human services within 48 hours after finalizing the offender's approved relocation plan to a permanent residence. Within five days after receiving this notification, the appropriate commissioner shall give to the appropriate law enforcement agency all relevant information the commissioner has concerning the offender, including information on the risk factors in the offender's history and the risk level to which the offender was assigned. After receiving this information, the law enforcement agency shall make the disclosures permitted or required by clause (2) or (3), as appropriate.\n(c) As used in paragraph (b), clauses (2) and (3), \"likely to encounter\" means that:\n(1) the organizations or community members are in a location or in close proximity to a location where the offender lives or is employed, or which the offender visits or is likely to visit on a regular basis, other than the location of the offender's outpatient treatment program; and\n(2) the types of interaction which ordinarily occur at that location and other circumstances indicate that contact with the offender is reasonably certain.\n(d) A law enforcement agency or official who discloses information under this subdivision shall make a good faith effort to make the notification within 14 days of receipt of a confirmed address from the Department of Corrections indicating that the offender will be, or has been, released from confinement, or accepted for supervision, or has moved to a new address and will reside at the address indicated. If a change occurs in the release plan, this notification provision does not require an extension of the release date.\n(e) A law enforcement agency or official who discloses information under this subdivision shall not disclose the identity or any identifying characteristics of the victims of or witnesses to the offender's offenses.\n(f) A law enforcement agency shall continue to disclose information on an offender as required by this subdivision for as long as the offender is required to register under section 243.166. This requirement on a law enforcement agency to continue to disclose information also applies to an offender who lacks a primary address and is registering under section 243.166, subdivision 3a.\n(g) A law enforcement agency that is disclosing information on an offender assigned to risk level III to the public under this subdivision shall inform the commissioner of corrections what information is being disclosed and forward this information to the commissioner within two days of the agency's determination. The commissioner shall post this information on the Internet as required in subdivision 4b.\n(h) A city council may adopt a policy that addresses when information disclosed under this subdivision must be presented in languages in addition to English. The policy may address when information must be presented orally, in writing, or both in additional languages by the law enforcement agency disclosing the information. The policy may provide for different approaches based on the prevalence of non-English languages in different neighborhoods.\n(i) An offender who is the subject of a community notification meeting held pursuant to this section may not attend the meeting.\n(j) When a school, day care facility, or other entity or program that primarily educates or serves children receives notice under paragraph (b), clause (3), that a level III predatory offender resides or works in the surrounding community, notice to parents must be made as provided in this paragraph. If the predatory offender identified in the notice is participating in programs offered by the facility that require or allow the person to interact with children other than the person's children, the principal or head of the entity must notify parents with children at the facility of the contents of the notice received pursuant to this section. The immunity provisions of subdivision 7 apply to persons disclosing information under this paragraph.\n(k) When an offender for whom notification was made under this subdivision no longer resides, is employed, or is regularly found in the area, and the law enforcement agency that made the notification is aware of this, the agency shall inform the entities and individuals initially notified of the change in the offender's status. If notification was made under paragraph (b), clause (3), the agency shall provide the updated information required under this paragraph in a manner designed to ensure a similar scope of dissemination. However, the agency is not required to hold a public meeting to do so.\n(a) When an offender assigned to risk level III is released from confinement or a residential facility to reside in the community or changes residence while on supervised or conditional release, the agency responsible for the offender's supervision shall:\n(1) take into consideration the proximity of the offender's residence to that of other level III offenders if the proximity presents a risk of reoffending;\n(2) take into consideration the proximity of the offender's residence to the following locations if the locations present a risk of reoffending:\n(i) schools;\n(ii) child care facilities or family or group family day care programs;\n(iii) licensed residences for vulnerable adults;\n(iv) attractions within public parks that are regularly used by minors, including but not limited to playgrounds or athletic fields; and\n(v) community centers and recreation centers that are regularly used in youth athletic activities or offer regularly scheduled indoor playtimes or access to gymnasiums and other facilities that are restricted to minors; and\n(3) to the greatest extent feasible, mitigate the concentration of level III offenders and concentration of level III offenders near the locations listed in clause (2) when the concentration presents a risk of reoffending.\n(b) If the owner or property manager of a hotel, motel, lodging establishment, or apartment building has an agreement with an agency that arranges or provides shelter for victims of domestic abuse, the owner or property manager may not knowingly rent rooms to both level III offenders and victims of domestic abuse at the same time. If the owner or property manager has an agreement with an agency to provide housing to domestic abuse victims and discovers or is informed that a tenant is a level III offender after signing a lease or otherwise renting to the offender, the owner or property manager may evict the offender.\nThe commissioner of corrections shall create and maintain an Internet website and post on the site the information about offenders assigned to risk level III forwarded by law enforcement agencies under subdivision 4, paragraph (g). This information must be updated in a timely manner to account for changes in the offender's address and maintained for the period of time that the offender remains subject to community notification as a level III offender.\n(a) The law enforcement agency in the area where a health care facility is located shall disclose the registrant status of any predatory offender registered under section 243.166 to the health care facility if the registered offender is receiving inpatient care in that facility.\n(b) As used in this section, \"health care facility\" means a hospital or other entity licensed under sections 144.50 to 144.58, a nursing home licensed to serve adults under section 144A.02, or a licensed setting authorized to provide housing support under section 256I.04 or an intermediate care facility for the developmentally disabled licensed under chapter 245A.\nAt least 60 days before a predatory offender is released from confinement, the Department of Corrections or Direct Care and Treatment, in the case of a person who was committed under chapter 253D or Minnesota Statutes 1992, section 526.10, shall give to the law enforcement agency that investigated the offender's crime of conviction or, where relevant, the law enforcement agency having primary jurisdiction where the offender was committed, all relevant information that the department and agency have concerning the offender, including information on risk factors in the offender's history. Within five days after receiving the offender's approved release plan from the hearings and release unit, the appropriate department or agency shall give to the law enforcement agency having primary jurisdiction where the offender plans to reside all relevant information the department or agency has concerning the offender, including information on risk factors in the offender's history and the risk level to which the offender was assigned. If the offender's risk level was assigned under the circumstances described in subdivision 3, paragraph (d), item (ii), the appropriate department or agency shall give the law enforcement agency all relevant information that the department or agency has concerning the offender, including information on the risk factors in the offender's history and the offender's risk level within five days of the risk level assignment or reassignment.\n(a) An offender assigned or reassigned to risk level II or III under subdivision 3, paragraph (e) or (h), has the right to seek administrative review of an end-of-confinement review committee's risk assessment determination. The offender must exercise this right within 14 days of receiving notice of the committee's decision by notifying the chair of the committee. Upon receiving the request for administrative review, the chair shall notify: (1) the offender; (2) the victim or victims of the offender's offense who have requested disclosure or their designee; (3) the law enforcement agency that investigated the offender's crime of conviction or, where relevant, the law enforcement agency having primary jurisdiction where the offender was committed; (4) the law enforcement agency having jurisdiction where the offender expects to reside, providing that the release plan has been approved by the hearings and release unit of the Department of Corrections; and (5) any other individuals the chair may select. The notice shall state the time and place of the hearing. A request for a review hearing shall not interfere with or delay the notification process under subdivision 4 or 5, unless the administrative law judge orders otherwise for good cause shown.\n(b) An offender who requests a review hearing must be given a reasonable opportunity to prepare for the hearing. The review hearing shall be conducted on the record before an administrative law judge. The review hearing shall be conducted at the correctional facility in which the offender is currently confined. If the offender no longer is incarcerated, the administrative law judge shall determine the place where the review hearing will be conducted. The offender has the burden of proof to show, by a preponderance of the evidence, that the end-of-confinement review committee's risk assessment determination was erroneous. The attorney general or a designee shall defend the end-of-confinement review committee's determination. The offender has the right to be present, to present evidence in support of the offender's position, to call supporting witnesses, and to cross-examine witnesses testifying in support of the committee's determination.\n(c) After the hearing is concluded, the administrative law judge shall decide whether the end-of-confinement review committee's risk assessment determination was erroneous and, based on this decision, shall either uphold or modify the review committee's determination. The judge's decision shall be in writing and shall include the judge's reasons for the decision. The judge's decision shall be final and a copy of it shall be given to the offender, the victim, the law enforcement agency, and the chair of the end-of-confinement review committee.\n(d) The review hearing is subject to the contested case provisions of chapter 14.\n(e) The administrative law judge may seal any portion of the record of the administrative review hearing to the extent necessary to protect the identity of a victim of or witness to the offender's offense.\n(a) A state or local agency or official, or a private organization or individual authorized to act on behalf of a state or local agency or official, is not criminally liable for disclosing or failing to disclose information as permitted by this section.\n(b) A state or local agency or official, or a private organization or individual authorized to act on behalf of a state or local agency or official, is not civilly liable for failing to disclose information under this section.\n(c) A state or local agency or official, or a private organization or individual authorized to act on behalf of a state or local agency or official, is not civilly liable for disclosing information as permitted by this section. However, this paragraph applies only to disclosure of information that is consistent with the offender's conviction history. It does not apply to disclosure of information relating to conduct for which the offender was not convicted.\nNothing in this section imposes a duty upon a person licensed under chapter 82, or an employee of the person, to disclose information regarding an offender who is required to register under section 243.166, or about whom notification is made under this section.",
	"repealed": false
}