{
	"id": "332A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/332A.13",
	"title": "332A.13 FEES, PAYMENTS, AND CONSENT OF CREDITORS.",
	"text": "The registrant may charge a nonrefundable origination fee of not more than $50, which may be retained by the registrant from the initial amount paid by the debtor to the registrant.\nThe registrant may charge a periodic fee for account maintenance or other purposes, but only if the fee is reasonable for the services provided and does not exceed the lesser of 15 percent of the monthly payment amount or $75.\nA registrant may not impose any fee or other charge or receive any funds or other payment other than the initial fee or monthly maintenance fee authorized by this section.\nThe registrant may retain as payment for the fees authorized by this section no more than 15 percent of any periodic payment made to the registrant by the debtor. The remaining 85 percent must be disbursed to listed creditors under and in accordance with the debt management services agreement. No fees or charges may be received or retained by the registrant for any handling of recurring payments. Recurring payments include current rent, mortgage, utility, telephone, maintenance as defined in section 518.27, child support, insurance premiums, and such other payments as the commissioner may by rule prescribe.\nNo fees or charges may be received or retained for any payments by the debtor made more than the following number of days in advance of the date specified in the debt management services agreement on which they are due: (1) 42 days in the case of contracts requiring monthly payments; (2) 15 days in the case of agreements requiring biweekly payments; or (3) seven days in the case of agreements requiring weekly payments. For those agreements which do not require payments in specified amounts, a payment is deemed an advance payment to the extent it exceeds twice the average regular payment previously made by the debtor under that contract. This subdivision does not apply when the debtor intends to use the advance payments to satisfy future payment of obligations due within 30 days under the contract. This subdivision supersedes any inconsistent provision of this chapter.\nA registrant must actively seek to obtain the consent of all creditors to the debt management services plan set forth in the debt management services agreement. Consent by a creditor may be express and in writing, or may be evidenced by acceptance of a payment made under the debt management services plan set forth in the contract. The registrant must notify the debtor within ten days after any failure to obtain the required consent and of the debtor's right to cancel without penalty. The notice must be in a form as the commissioner shall prescribe. Nothing contained in this section is deemed to require the return of any origination fee and any fees earned by the registrant prior to cancellation or default.\nWhenever a creditor withdraws from a debt management services plan, or refuses to participate in a debt management services plan, the registrant must promptly notify the debtor of the withdrawal or refusal. In no case may this notice be provided more than 15 days after the debt management services provider learns of the creditor's decision to withdraw from or refuse to participate in a plan. This notice must include the identity of the creditor withdrawing from the plan, the amount of the monthly payment to that creditor, and the right of the debtor to cancel the agreement under section 332A.11.\nThe registrant must maintain a separate trust account and deposit in the account all payments received from the moment that the funds are available, except that the registrant may commingle the payment with the registrant's own property or funds, but only to the extent necessary to ensure the maintenance of a minimum balance if the financial institution at which the trust account is held requires a minimum balance to avoid the assessment of fees or penalties for failure to maintain a minimum balance. All disbursements, whether to the debtor or to the creditors of the debtor, or to the registrant, must be made from such account, except that disbursements may be made from a trust account to an account established solely for the purpose of making disbursements to debtors and creditors.\nThe registrant must disburse any funds paid by or on behalf of a debtor to creditors of the consumer within 42 days after receipt of the funds, or earlier if necessary to comply with the due date in the agreement between the debtor and the creditor, unless the reasonable payment of one or more of the debtor's obligations requires that the funds be held for a longer period so as to accumulate a sum certain, or where the debtor's payment is returned for insufficient funds or other reason that makes the withholding of such payments in the net interest of the debtor.",
	"repealed": false
}