{
	"id": "342.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.07",
	"title": "342.07 AGRICULTURAL AND FOOD SAFETY PRACTICES; RULEMAKING.",
	"text": "In consultation with the commissioner of agriculture, the office by rule must establish certification, testing, and labeling requirements for the methods used to grow new cannabis plants or hemp plants, including but not limited to growth from seed, clone, cutting, or tissue culture.\nIn consultation with the commissioner of agriculture and representatives from the University of Minnesota Extension Service, the office shall establish best practices for:\n(1) the cultivation and preparation of cannabis plants; and\n(2) the use of pesticides, fertilizers, soil amendments, and plant amendments in relation to growing cannabis plants.\n(a) Any person seeking to manufacture, process, sell, handle, or store an edible cannabis product or lower-potency hemp edible, other than an edible cannabis product or lower-potency hemp edible that has been placed in its final packaging, must first obtain an edible cannabinoid product handler endorsement.\n(b) In consultation with the commissioner of agriculture, the office shall establish an edible cannabinoid product handler endorsement.\n(c) The office must regulate edible cannabinoid product handlers in a manner consistent with Department of Agriculture regulation of food handlers under chapters 28A, 31, and 34A and associated rules, with the following exceptions:\n(1) the office must issue an edible cannabinoid product handler endorsement, rather than a license;\n(2) eligibility for an edible cannabinoid product handler endorsement is limited to persons who possess a valid license issued by the office;\n(3) the office may not charge a fee for issuing or renewing the endorsement;\n(4) the office must align the term and renewal period for edible cannabinoid product handler endorsements with the term and renewal period of the license issued by the office; and\n(5) an edible cannabis product or lower-potency hemp edible must not be considered adulterated solely because the product or edible contains tetrahydrocannabinol, cannabis concentrate, hemp concentrate, artificially derived cannabinoids, or any other material extracted or derived from a cannabis plant, cannabis flower, hemp plant, or hemp plant parts.\n(d) The edible cannabinoid product handler endorsement must prohibit the manufacture of edible cannabis products at the same premises where food is manufactured, except for the limited production of edible products produced solely for product development, sampling, or testing. This limitation does not apply to the manufacture of lower-potency hemp edibles.",
	"repealed": false
}