{
	"id": "84.631",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.631",
	"title": "84.631 ROAD EASEMENTS ACROSS STATE LANDS.",
	"text": "(a) Except as provided in section 85.015, subdivision 1b, the commissioner of natural resources, on behalf of the state, may convey a road easement across state land under the commissioner's jurisdiction to a private person requesting an easement for access to property owned by the person only if the following requirements are met:\n(1) there are no reasonable alternatives to obtain access to the property; and\n(2) the exercise of the easement will not cause significant adverse environmental or natural resource management impacts.\n(b) The commissioner shall:\n(1) require the applicant to pay the market value of the easement;\n(2) limit the easement term to 50 years if the road easement is across school trust land;\n(3) provide that the easement reverts to the state in the event of nonuse; and\n(4) impose other terms and conditions of use as necessary and appropriate under the circumstances.\n(c) An applicant shall submit an application fee of $2,000 with each application for a road easement across state land. The application fee is nonrefundable, even if the application is withdrawn or denied.\n(d) In addition to the payment for the market value of the easement and the application fee, the commissioner of natural resources shall assess the applicant a monitoring fee to cover the projected reasonable costs for monitoring the construction of the road and preparing special terms and conditions for the easement. The commissioner must give the applicant an estimate of the monitoring fee before the applicant submits the fee. The applicant shall pay the application and monitoring fees to the commissioner of natural resources. The commissioner shall not issue the easement until the applicant has paid in full the application fee, the monitoring fee, and the market value payment for the easement.\n(e) Upon completion of construction of the road, the commissioner shall refund the unobligated balance from the monitoring fee revenue.\n(f) Fees collected under paragraphs (c) and (d) must be credited to the land management account in the natural resources fund and are appropriated to the commissioner of natural resources to cover the reasonable costs incurred under this section.\n(g) In addition to fees specified in this section, the applicant must reimburse the state for costs incurred for cultural resources review, monitoring, or other services provided by the Minnesota Historical Society under contract with the commissioner of natural resources or the State Historic Preservation Office of the Department of Administration in connection with the easement application, preparing the easement terms, or constructing the road.\n(h) Notwithstanding paragraphs (a) to (g), the commissioner of natural resources may elect to assume the application fee under paragraph (c) and waive or assume some or all of the remaining fees and costs imposed under this section if the commissioner determines that issuing the easement will benefit the state's land management interests.",
	"repealed": false
}