{
	"id": "260B.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.103",
	"title": "260B.103 TRANSFERS FROM OTHER COURTS.",
	"text": "Except where a juvenile court has certified an alleged violation in accordance with the provisions of section 260B.125, the child is alleged to have committed murder in the first degree after becoming 16 years of age, or a court has original jurisdiction of a child who has committed an adult court traffic offense, as defined in section 260B.225, subdivision 1, paragraph (c), a court other than a juvenile court shall immediately transfer to the juvenile court of the county the case of a minor who appears before the court on a charge of violating any state or local law or ordinance and who is under 18 years of age or who was under 18 years of age at the time of the commission of the alleged offense.\nThe court transfers the case by filing with the judge or court administrator of juvenile court a certificate showing the name, age, and residence of the minor, the names and addresses of the minor's parent or guardian, if known, and the reasons for appearance in court, together with all the papers, documents, and testimony connected therewith. The certificate has the effect of a petition filed in the juvenile court, unless the judge of the juvenile court directs the filing of a new petition, which shall supersede the certificate of transfer.\nThe transferring court shall order the minor to be taken immediately to the juvenile court and in no event shall detain the minor for longer than 48 hours after the appearance of the minor in the transferring court. The transferring court may release the minor to the custody of a parent, guardian, custodian, or other person designated by the court on the condition that the minor will appear in juvenile court as directed. The transferring court may require the person given custody of the minor to post such bail or bond as may be approved by the court which shall be forfeited to the juvenile court if the minor does not appear as directed. The transferring court may also release the minor on the minor's own promise to appear in juvenile court.",
	"repealed": false
}