{
	"id": "2.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/2.91",
	"title": "2.91 REDISTRICTING PLANS.",
	"text": "Upon enactment of a redistricting plan for the legislature or for Congress, the Legislative Coordinating Commission shall deposit the plan with the secretary of state. The secretary of state shall provide copies of the relevant portions of the redistricting plan to each county auditor, who shall provide a copy of the relevant portions of the plan to each municipal clerk within the county. The secretary of state, with the cooperation of the commissioner of administration, shall make copies of the plan file, maps, and tables available to the public for the cost of publication. The revisor of statutes shall code a metes and bounds description of the districts in Minnesota Statutes.\nThe legislature intends that a redistricting plan encompass all the territory of this state, that no territory be omitted or duplicated, that all districts consist of convenient contiguous territory substantially equal in population, and that political subdivisions not be divided more than necessary to meet constitutional requirements. Therefore, in implementing a redistricting plan for the legislature or for Congress, the secretary of state, after notifying the Legislative Coordinating Commission and the revisor of statutes, shall order the following corrections:\n(a) If a territory in this state is not named in the redistricting plan but lies within the boundaries of a district, it is a part of the district within which it lies.\n(b) If a territory in this state is not named in the redistricting plan but lies between the boundaries of two or more districts, it is a part of the contiguous district having the smallest population.\n(c) If a territory in this state is assigned in the redistricting plan to two or more districts, it is part of the district having the smallest population.\n(d) If a territory in this state is assigned to a district that consists of other territory containing a majority of the population of the district but with which it is not contiguous, the territory is a part of the contiguous district having the smallest population.\n(e) If the description of a district boundary line that divides a political subdivision is ambiguous because a highway, street, railroad track, power transmission line, river, creek, or other physical feature or census block boundary that forms part of the district boundary is omitted or is not properly named or has been changed, or because a compass direction for the boundary line is wrong, the secretary of state shall add or correct the name or compass direction and resolve the ambiguity in favor of creating districts of convenient, contiguous territory of substantially equal population that do not divide political subdivisions more than is necessary to meet constitutional requirements.\nThe secretary of state shall provide a copy of each correction order to each affected county auditor, municipal clerk, and candidate.\nThe secretary of state and the revisor of statutes shall recommend to the legislature any additional technical corrections to the redistricting plan they deem necessary or desirable.",
	"repealed": false
}