{
	"id": "480.242",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.242",
	"title": "480.242 DISTRIBUTION OF CIVIL LEGAL SERVICES FUNDS TO QUALIFIED LEGAL SERVICES PROGRAMS.",
	"text": "The supreme court shall establish an advisory committee to assist it in performing its responsibilities under sections 480.24 to 480.244. The advisory committee shall consist of 11 members appointed by the supreme court including seven attorneys-at-law who are well acquainted with the provision of legal services in civil matters, two public members who are not attorneys and two persons who would qualify as eligible clients. Four of the attorney-at-law members shall be nominated by the State Bar Association in the manner determined by it, and three of the attorney-at-law members shall be nominated by the programs in Minnesota providing legal services in civil matters on July 1, 1982, with funds provided by the federal Legal Services Corporation in the manner determined by them. In making the appointments of the attorney-at-law members, the supreme court shall not be bound by the nominations prescribed by this section. In making appointments to the advisory committee, the supreme court shall ensure that urban and rural areas of the state are represented. The supreme court shall adopt by rule policies and procedures for the operation of the advisory committee including, but not limited to, policies and procedures governing membership terms, removal of members, and the filling of membership vacancies.\n[See Note.]\nAt times and in accordance with any procedures adopted by the State Board of Civil Legal Aid, applications for the expenditure of civil legal services funds shall be accepted from qualified legal services programs or from local government agencies and nonprofit organizations seeking to establish qualified alternative dispute resolution programs. The applications shall be reviewed by the State Board of Civil Legal Aid, which shall distribute the funds available for this expenditure to qualified legal services programs or to qualified alternative dispute resolution programs submitting applications. The funds shall be distributed in accordance with the following formula:\n(a) Eighty-five percent of the funds distributed shall be distributed to qualified legal services programs that have demonstrated an ability as of July 1, 1982, to provide legal services to persons unable to afford private counsel with funds provided by the federal Legal Services Corporation. The allocation of funds among the programs selected shall be based upon the number of persons with incomes below the poverty level established by the United States Census Bureau who reside in the geographical area served by each program, as determined by the State Board of Civil Legal Aid on the basis of the most recent national census. All funds distributed pursuant to this clause shall be used for the provision of legal services in civil and farm legal assistance matters as prioritized by program boards of directors to eligible clients.\n(b) Fifteen percent of the funds distributed may be distributed (1) to other qualified legal services programs for the provision of legal services in civil matters to eligible clients, including programs which organize members of the private bar to perform services and programs for qualified alternative dispute resolution, (2) to programs for training mediators operated by nonprofit alternative dispute resolution corporations, or (3) to qualified legal services programs to provide family farm legal assistance for financially distressed state farmers. The family farm legal assistance must be directed at farm financial problems including, but not limited to, liquidation of farm property including bankruptcy, farm foreclosure, repossession of farm assets, restructuring or discharge of farm debt, farm credit and general debtor-creditor relations, and tax considerations. If all the funds to be distributed pursuant to this clause cannot be distributed because of insufficient acceptable applications, the remaining funds shall be distributed pursuant to clause (a).\nA person is eligible for legal assistance under this section if the person is an eligible client as defined in section 480.24, subdivision 2, or:\n(1) is a state resident;\n(2) is or has been a farmer or a family shareholder of a family farm corporation within the preceding 24 months;\n(3) has a debt-to-asset ratio greater than 50 percent; and\n(4) satisfies the income eligibility guidelines established under section 480.243, subdivision 1.\nQualifying farmers and small business operators whose bank loans are held by the Federal Deposit Insurance Corporation are eligible for legal assistance under this section.\n[See Note.]\nThe funds to be distributed to recipients selected in accordance with the provisions of subdivision 2 shall be distributed by the State Board of Civil Legal Aid no less than twice per calendar year.\n[See Note.]\n[Repealed, 1989 c 335 art 1 s 270]\nQualified legal services programs that receive funds under the provisions of subdivision 2 may provide the following types of farm legal assistance activities:\n(1) legal backup and research support to attorneys throughout the state who represent financially distressed farmers;\n(2) direct legal advice and representation to eligible farmers in the most effective and efficient manner, giving special emphasis to enforcement of legal rights affecting large numbers of farmers;\n(3) legal information to individual farmers;\n(4) general farm related legal education and training to farmers, private attorneys, legal services staff, state and local officials, state-supported farm management advisors, and the public;\n(5) an incoming, statewide, toll-free telephone line to provide the advice and referral described in this subdivision; and\n(6) legal advice and representation to eligible persons whose bank loans are held by the Federal Deposit Insurance Corporation.",
	"repealed": false
}