{
	"id": "144.998",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.998",
	"title": "144.998 ENVIRONMENTAL HEALTH TRACKING AND BIOMONITORING ADVISORY PANEL.",
	"text": "The commissioner shall establish the Environmental Health Tracking and Biomonitoring Advisory Panel. The commissioner shall appoint, from the panel's membership, a chair. The panel shall meet as often as it deems necessary but, at a minimum, on a quarterly basis. Members of the panel shall serve without compensation but shall be reimbursed for travel and other necessary expenses incurred through performance of their duties. Members appointed by the commissioner are appointed for a three-year term and may be reappointed. Legislative appointees serve at the pleasure of the appointing authority.\n(a) The commissioner shall appoint eight members, none of whom may be lobbyists registered under chapter 10A, who have backgrounds or training in designing, implementing, and interpreting health tracking and biomonitoring studies or in related fields of science, including epidemiology, biostatistics, environmental health, laboratory sciences, occupational health, industrial hygiene, toxicology, and public health, including:\n(1) at least two scientists representative of each of the following:\n(i) nongovernmental organizations with a focus on environmental health, environmental justice, children's health, or on specific chronic diseases; and\n(ii) statewide business organizations; and\n(2) at least one scientist who is a representative of the University of Minnesota.\n(b) Two citizen panel members meeting the scientific qualifications in paragraph (a) shall be appointed, one by the speaker of the house and one by the senate majority leader.\n(c) In addition, one representative each shall be appointed by the commissioners of the Pollution Control Agency and the Department of Agriculture, and by the commissioner of health to represent the department's Health Promotion and Chronic Disease Division.\nThe advisory panel shall make recommendations to the commissioner and the legislature on:\n(1) priorities for health tracking;\n(2) priorities for biomonitoring that are based on sound science and practice, and that will advance the state of public health in Minnesota;\n(3) specific chronic diseases to study under the environmental health tracking system;\n(4) specific environmental hazard exposures to study under the environmental health tracking system, with the agreement of at least nine of the advisory panel members;\n(5) specific communities and geographic areas on which to focus environmental health tracking and biomonitoring efforts;\n(6) specific chemicals to study under the biomonitoring program, with the agreement of at least nine of the advisory panel members; in making these recommendations, the panel may consider the following criteria:\n(i) the degree of potential exposure to the public or specific subgroups, including, but not limited to, occupational;\n(ii) the likelihood of a chemical being a carcinogen or toxicant based on peer-reviewed health data, the chemical structure, or the toxicology of chemically related compounds;\n(iii) the limits of laboratory detection for the chemical, including the ability to detect the chemical at low enough levels that could be expected in the general population;\n(iv) exposure or potential exposure to the public or specific subgroups;\n(v) the known or suspected health effects resulting from the same level of exposure based on peer-reviewed scientific studies;\n(vi) the need to assess the efficacy of public health actions to reduce exposure to a chemical;\n(vii) the availability of a biomonitoring analytical method with adequate accuracy, precision, sensitivity, specificity, and speed;\n(viii) the availability of adequate biospecimen samples; or\n(ix) other criteria that the panel may agree to; and\n(7) other aspects of the design, implementation, and evaluation of the environmental health tracking and biomonitoring system, including, but not limited to:\n(i) identifying possible community partners and sources of additional public or private funding;\n(ii) developing outreach and educational methods and materials; and\n(iii) disseminating environmental health tracking and biomonitoring findings to the public.\nNo member of the panel shall be held civilly or criminally liable for an act or omission by that person if the act or omission was in good faith and within the scope of the member's responsibilities under sections 144.995 to 144.998.",
	"repealed": false
}