{
	"id": "116A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.08",
	"title": "116A.08 PRELIMINARY HEARING.",
	"text": "Upon the filing of the report of the engineer, the auditor shall promptly notify the board, or the court administrator shall promptly notify the judge, thereof, and the auditor, or the court administrator with the approval of the judge, shall by order fix a time for the hearing thereon, not more than 60 days after the date of the order. Not less than ten days before the time of hearing, the auditor or court administrator shall give notice by mail of the time and place of hearing to the petitioners and the owners of the lands and properties, and corporations, public or private, likely to be affected by the proposed improvement as shown by the engineer's report. Notice also shall be published in the official papers covering the area of the proposed system called for in the petition, at least once not less than three weeks before the hearing.\nThe engineer shall attend the hearing and supply such information as may be necessary. The petitioners and all other parties interested may appear and be heard.\nThe board or court shall examine the petition, and if the petition is found sufficient as required by law, shall so find. If the petition is found insufficient in that it is not signed by the requisite number of owners, or otherwise, the hearing shall be adjourned and the petition referred back to the petitioners for such action thereon as may be advised. The petitioners, by unanimous action, may thereupon amend the recitals in the petition. They may procure the signatures of additional owners as added petitioners. At the adjourned hearing, if the petition is found insufficient, the proceedings shall be dismissed.\nAt the hearing or any adjournment thereof, if it shall appear that the proposed improvement is not feasible, and no plan is reported by the engineer where by it can be made feasible, or that it is not of public benefit or utility, the petition shall be dismissed.\nIf the board or court is satisfied that the proposed improvement as outlined in the petition or as modified and recommended by the engineer is feasible, that there is necessity therefor, that it will be of public benefit and promote the public health, it shall so find and by order shall designate any changes to be made in the proposed improvement. Changes may be described in general terms and shall be sufficiently described by filing with the order a map outlining the proposed improvement. Thereafter the petition shall be treated as modified accordingly.\nThe findings shall be construed as conclusive only as to the sufficiency of the petition, the nature and extent of the proposed plan and the need of a permanent survey, and only as to the persons or parties shown by the engineer's preliminary report as likely to be affected by the improvement. All questions relative to the practicability and necessity of the proposed improvement shall be subject to further investigation and consideration at the final hearing.",
	"repealed": false
}