{
	"id": "13.741",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.741",
	"title": "13.741 POLLUTION CONTROL; ENVIRONMENTAL QUALITY DATA.",
	"text": "The following data on individuals filing claims for compensation with the Pollution Control Agency for injury from harmful substances are classified as confidential while the claim is being investigated and private after a decision is made by the agency about the claim: the name, address, and all other information that may identify an individual filing a claim; all medical data provided to the agency by the claimant or providers of health care to the claimant, including reports of physical examinations, mental health treatment, hospital care, physical therapy, laboratory testing, X-ray studies, and prescriptions; and all financial data provided to the agency by the claimant or the claimant's employer, insurance carrier, or other provider of benefits, including state or federal tax forms, W-2 forms, salary records, records of insurance payments, unemployment or disability benefits.\nData that identify specific locations within the state where intensive and global survey site investigations are under way, or are determined by the Pollution Control Agency as appropriate for studying the cause of malformations in frogs, are nonpublic data until the agency determines that it will not investigate or has completed its scientific investigation at the reported abnormal frog site.\nThe following data collected and maintained by the Public Utilities Commission are classified as private data pursuant to section 13.02, subdivision 12: the names and addresses of individuals who submitted information and letters concerning personal health problems associated with transmission lines.\nPreliminary data entered or uploaded into the Pollution Control Agency online data submission system are classified as private or nonpublic data. The data is public once electronically transmitted through and received by the Pollution Control Agency from the online data submission system, unless otherwise classified by law.",
	"repealed": false
}