{
	"id": "256M.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/256M.42",
	"title": "256M.42 ADULT PROTECTION GRANT ALLOCATIONS.",
	"text": "(a) The commissioner shall allocate state money appropriated under this section on an annual basis to each county board for adult protection under section 626.557 and to Tribal Nations that have voluntarily chosen by resolution of Tribal government to participate in vulnerable adult protection programs according to the following formula after the award of the amounts in paragraph (c):\n(1) 25 percent must be allocated to the responsible agency on the basis of the number of reports of suspected vulnerable adult maltreatment under sections 626.557 and 626.5572, as determined by the most recent data of the commissioner; and\n(2) 75 percent must be allocated to the responsible agency on the basis of the number of screened-in reports for adult protective services or vulnerable adult maltreatment investigations under sections 626.557 and 626.5572, as determined by the most recent data of the commissioner.\n(b) Notwithstanding paragraph (a), the commissioner must not award a county less than a minimum allocation established by the commissioner.\n(c) To receive money under this subdivision, a participating Tribal Nation must apply to the commissioner. Of the amount appropriated for purposes of this section, the commissioner must award $100,000 to each federally recognized Tribal Nation that has applied to the commissioner and has a Tribal resolution establishing a vulnerable adult protection program. Money received by a Tribal Nation under this section must be used for its vulnerable adult protection program.\nThe commissioner shall make allocations for the state fiscal year starting July 1, 2023, and to each county board or Tribal government on or before October 10, 2023. The commissioner shall make allocations under subdivision 1 to each county board or Tribal government each year thereafter on or before July 10.\nMoney received under this section must be used to meet the agency's duties under section 626.557 and to expand adult protective services to stop, prevent, and reduce risks of maltreatment for adults accepted for services under section 626.557, or for multidisciplinary teams under section 626.5571.\nState money must be used to expand, not supplant, county or Tribal expenditures for the fiscal year 2023 base for adult protection programs, service interventions, or multidisciplinary teams. A county receiving money under this section must maintain a level of yearly county expenditures for adult protection services under chapter 626 at least equal to that county's average expenditures for those services for calendar years 2022 and 2023.\nThe commissioner must set vulnerable adult protection measures and standards for money received under this section. The commissioner must require an underperforming county to demonstrate that the county designated money allocated under this section for the purpose required and implemented a reasonable strategy to improve adult protection performance, including the development of a performance improvement plan and additional remedies identified by the commissioner. The commissioner may redirect up to 20 percent of an underperforming county's money under this section toward the performance improvement plan.\nTribal Nations receiving money under this section must establish vulnerable adult protection measures and standards and report annually to the commissioner on these outcomes and the number of adults served.\nThe requirements of subdivisions 2 to 6 apply to the Reform 2020 adult protection state grants in Minnesota Statutes 2013 Supplement, section 256M.40, subdivision 1, and Laws 2013, chapter 108, article 15. The Reform 2020 state adult protection grant must be allocated annually consistent with the calendar year 2023 allocation made under section 256M.40.",
	"repealed": false
}