{
	"id": "146B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.05",
	"title": "146B.05 GROUNDS FOR DENIAL OF AN ESTABLISHMENT LICENSE OR EMERGENCY CLOSURE.",
	"text": "If any of the following conditions exist, the owner or operator of a licensed establishment may be ordered by the commissioner to discontinue all operations of a licensed body art establishment or the commissioner may refuse to grant or renew, suspend, or revoke licensure:\n(1) evidence of a sewage backup in an area of the body art establishment where body art activities are conducted;\n(2) lack of potable, plumbed, or hot or cold water to the extent that handwashing or toilet facilities are not operational;\n(3) lack of electricity or gas service to the extent that handwashing, lighting, or toilet facilities are not operational;\n(4) significant damage to the body art establishment due to tornado, fire, flood, or another disaster;\n(5) evidence of an infestation of rodents or other vermin;\n(6) evidence of any individual performing a body art procedure without a license as required under this chapter;\n(7) evidence of existence of a public health nuisance;\n(8) use of instruments or jewelry that are not sterile;\n(9) failure to maintain required records;\n(10) failure to use gloves as required;\n(11) failure to properly dispose of sharps, blood or body fluids, or items contaminated by blood or body fluids;\n(12) failure to properly report complaints of potential bloodborne pathogen transmission to the commissioner; or\n(13) evidence of a positive spore test on the sterilizer if there is no other working sterilizer with a negative spore test in the establishment.\nPrior to license approval or renewal or the reopening of the establishment, the establishment shall submit to the commissioner satisfactory proof that the problem condition causing the need for the licensure action or emergency closure has been corrected or removed by the operator of the establishment. A body art establishment may not reopen without the written approval of the commissioner and a valid establishment license.",
	"repealed": false
}