{
	"id": "201.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.195",
	"title": "201.195 CHALLENGES.",
	"text": "(a) Upon petition filed with the county auditor, any voter registered within a county may challenge the eligibility or residence of any other voter registered within that county. A petition filed pursuant to this section must not include the name of more than one person whose right to vote is challenged. The county auditor must not accept a filing which challenges the eligibility of more than one voter. Petitions must be filed at least 45 days before the election, unless the voter registered or updated the voter's registration within 60 days before the election, in which case the petition must be filed at least ten days before the election, or within ten days after the voter's new or updated registration appeared on the public information list, whichever is later.\n(b) The petition must state the grounds for challenge, provide facts and circumstances supporting the challenge, and may include supporting documents, affidavits, or other evidence. The petition must be accompanied by an affidavit stating that the challenge is based on the challenger's personal knowledge, and that the filer exercised due diligence to personally verify the facts and circumstances establishing the basis for the challenge. The filer has the burden to prove, by clear and convincing evidence, that the basis for challenging the individual's eligibility to vote is valid.\n(c) The following reasons, standing alone, do not constitute adequate grounds for a challenge:\n(1) a piece of mail sent to the voter by someone other than the county auditor that was returned as undeliverable;\n(2) enrollment in an educational institution; or\n(3) registration to vote at an address that is housing provided for students by an educational institution.\nIf the petition is incomplete, or if the basis for the challenge does not meet the requirements of this section, the county auditor must dismiss the petition and notify the filer in writing of the reasons for the dismissal.\nWithin five days after receipt of a petition that meets the requirements of this section, the county auditor must set a date for a hearing on the challenge and notify the challenger by mail. A copy of the petition and notice of the hearing must be served on the challenged voter by the county auditor in the same manner as in a civil action. The county auditor must inform the challenged individual that:\n(1) a petition has been filed as to whether the individual is eligible to vote as well as the basis of the challenge;\n(2) if the individual votes by mail, the individual's ballot will not be counted unless the challenge is resolved; and\n(3) the individual may submit information prior to the hearing or present information at the hearing. This information may include a sworn statement, supporting documents, affidavits, witnesses, or other evidence supporting the challenged individual's eligibility to vote in the election.\nThe hearing must be held before the county auditor or the auditor's designee who must then make findings and affirm or dismiss the challenge. The hearing must be recorded by either video or audio recording. The recording must be retained for 22 months.\nIf a challenge is affirmed, the voter whose registration has been challenged may appeal the ruling to the secretary of state. The voter must immediately notify the county auditor of the appeal, and upon receipt of this notice, the county auditor must submit the entire record of the hearing, including all documents and a recording of the hearing, to the secretary of state. The appeal must be heard within five days but in any case before election day. Upon hearing the appeal the secretary of state must affirm or reverse the ruling and must give appropriate instructions to the county auditor.\nA hearing before the secretary of state must be conducted as a contested case and determined in accordance with chapter 14.",
	"repealed": false
}