{
	"id": "116R.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.05",
	"title": "116R.05 BONDS; ORDERS AUTHORIZING, ADDITIONAL TERMS, SALE.",
	"text": "The bonds must be authorized by an order or orders of the commissioner, bear such date or dates, mature at such time or times, bear interest at such rate or rates, be in such denominations, be in such form, carry such registration privileges, be executed in such manner, be payable in lawful money of the United States, at such place or places within or without the state, and be subject to such terms of redemption or purchase prior to maturity as the order or orders may provide, or as may be provided in any indenture or indentures of trust. If, for any reason, whether existing at the date of issue of any bonds or at the date of making or purchasing any loan or securities from the proceeds or after that date, the interest on any bonds is or becomes subject to federal income taxation, this shall not impair or affect the validity of the provisions made for the security of the bonds. The bonds may be sold at public or private sale at a price or prices determined by the commissioner. The underwriting discount, spread, or commission paid or allowed to the underwriters of the bonds, however, must be an amount not in excess of the amount determined by the commissioner to be reasonable in the light of the risk assumed and the expenses of issuance, if any, required to be paid by the underwriters or prevailing market conditions and practices.\nExcept as otherwise provided for bonds issued under section 116R.02, subdivision 4, paragraph (a), the bonds and interest payable thereon are payable solely from the following sources and are irrevocably appropriated for that purpose, but only to the extent provided in the order or indenture authorizing or securing the bonds:\n(1) revenues of any nature derived from the ownership, lease, operation, sale, foreclosure, or refinancing of a project described in section 116R.02, subdivision 5;\n(2) repayments of any loans made under sections 116R.01 to 116R.15;\n(3) proceeds of any bonds or deficiency bonds;\n(4) amounts in any account or accounts authorized by section 116R.11 or 116R.12;\n(5) amounts paid by St. Louis County under its obligations referred to in section 116R.02, subdivision 4, and amounts paid under Laws 1991, chapter 350, article 1, section 24 or 25, for the payment of bonds or interest thereon;\n(6) amounts payable under any insurance policy, guaranty, letter of credit, or other instrument securing the bonds;\n(7) any other revenues which the commissioner may pledge but excluding state appropriations unless the appropriation was specifically designated for that purpose; and\n(8) investment income on any of the sources specified in clauses (1) to (7).\nExcept as provided in section 116R.02, subdivision 4, paragraph (a), no bond shall constitute a debt of the state within the meaning of any statutory or constitutional limitation or pledge the full faith and credit of the state and no holder of any bonds may compel any exercise of the taxing power of the state to pay principal, premiums, or interest for the bonds, nor to enforce payment of principal, premiums, or interest against any property of the state, except for property expressly pledged, mortgaged, encumbered, or appropriated for this purpose.",
	"repealed": false
}