{
	"id": "260E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.08",
	"title": "260E.08 CRIMINAL PENALTIES FOR FAILURE TO REPORT; CIVIL PENALTY FOR MAKING FALSE REPORT.",
	"text": "(a) A person mandated by section 260E.06, subdivision 1, to report who knows or has reason to believe that a child is maltreated, as defined in section 260E.03, or has been maltreated within the preceding three years, and fails to report is guilty of a misdemeanor.\n(b) A person mandated by section 260E.06, subdivision 1, to report who knows or has reason to believe that two or more children not related to the offender have been maltreated, as defined in section 260E.03, by the same offender within the preceding ten years, and fails to report is guilty of a gross misdemeanor.\n(c) A parent, guardian, or caretaker who knows or reasonably should know that the child's health is in serious danger and who fails to report as required by section 260E.06, subdivision 3, is guilty of a gross misdemeanor if the child suffers substantial or great bodily harm because of the lack of medical care. If the child dies because of the lack of medical care, the person is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both. The provision in section 609.378, subdivision 1, paragraph (a), clause (1), providing that a parent, guardian, or caretaker may, in good faith, select and depend on spiritual means or prayer for treatment or care of a child, does not exempt a parent, guardian, or caretaker from the duty to report under this chapter.\n(d) Any person who knowingly or recklessly makes a false report under the provisions of this chapter shall be liable in a civil suit for any actual damages suffered by the person or persons so reported and for any punitive damages set by the court or jury, plus costs and reasonable attorney fees.\n(e) A person who intentionally prevents or attempts to prevent a person mandated by section 260E.06, subdivision 1, to report under this chapter is guilty of a misdemeanor.",
	"repealed": false
}