{
	"id": "383C.043",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.043",
	"title": "383C.043 VACANCIES.",
	"text": "(a) Whenever a position in the classified service becomes vacant and the appointing authority desires to fill the vacancy, the appointing authority shall submit a requisition to the human resources director. The human resources director shall refer the names of candidates to the appointing authority in the order as follows:\n(1) when the position is to be filled promotionally, the name of the person highest on the appropriate reemployment-layoff list. If there are no names on the reemployment-layoff list, then:\n(i) the names of the persons on the reemployment list, if any; and\n(ii) the names of the persons associated with the three highest scores on the promotional list; or\n(2) when the position is to be filled from an open competitive employment list, the name of the person highest on the appropriate reemployment-layoff list. If there are no names on the reemployment-layoff list, then:\n(i) the names of the persons on the reemployment list, if any; and\n(ii) the names of the persons associated with the 20 highest scores on the open list.\n(b) The hiring authority must interview all referred candidates if promotional, or ten candidates if open, unless fewer are available for referral from all applicable lists. When the director determines that there is significant underrepresentation of a protected group with respect to ethnicity or gender in the class, and the highest 20 scores on the open employment list do not include a member of the underrepresented group, the director shall refer the highest-ranking available individual on the list from that protected group.\n(c) The appointing authority shall, at its discretion, appoint one of the persons so referred for the probationary period. At the end of the probationary period the appointing authority shall notify the human resources director in writing whether the individual is a satisfactory employee and should receive the status of a permanent employee. Upon such notice, the employee shall be deemed to have a permanent status in the classified service; otherwise the employee is automatically separated from the service.\n(d) If there is no appropriate reemployment or employment list, the director may authorize a temporary appointment of a qualified individual pending the establishment of an employment list for the class.\n(e) Temporary appointments shall not continue for a period longer than six months unless extended through mutual agreement with the exclusive bargaining unit.\n(f) In case of an emergency, an appointment of a qualified individual may be made of not to exceed the full-time equivalent of ten days' duration without regard to the provisions of sections 383C.03 to 383C.056, the appointment shall be immediately reported to the human resources director. Successive emergency appointments shall not be made.",
	"repealed": false
}