{
	"id": "123A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.36",
	"title": "123A.36 COOPERATION AND COMBINATION PLAN.",
	"text": "Each board must adopt, by resolution, a plan for cooperation and combination. The plan must address each item in this section. The plan must be specific for any item that will occur within three years and may be general or set forth alternative resolutions for an item that will occur in more than three years. The plan must be submitted to the commissioner of education and the secretary of state for review and comment. Significant modifications and specific resolutions of items must be submitted to the commissioner for review and comment. In the official newspaper of each district proposed for combination, the board must publish at least a summary of the adopted plans, each significant modification and resolution of items, and each commissioner review and comment.\nThe plan must identify the rules of the commissioner of education from which the district intends to request exemption, according to Minnesota Rules, part 3500.1000. The plan may provide information about state laws that deter or impair cooperation or combination.\nThe plan must state:\n(1) whether the new district would have one elected board or whether it would have one elected board and one elected board for each elementary school exercising powers and duties delegated to it by the board of the entire district;\n(2) how many of the existing members of each district would become members of the board of the combined district and, if so, a method to gradually reduce the membership to six or seven; and\n(3) if desired, election districts that include the establishment of separate areas from each of the combining districts from which board members will be elected, the boundaries of these election districts, and the initial term of the member elected from each of these election districts.\nThe plan must provide for:\n(1) selection of one superintendent for the combined district at a specified time, according to section 123B.143, subdivision 1; and\n(2) alterations, if any, in administrative personnel and duties.\nThe plan must state:\n(1) procedures needed, at the time of combination, to combine teachers into one bargaining unit, with the exclusive representative determined according to section 123A.75;\n(2) procedures needed, at the time of combination, to combine other bargaining units;\n(3) procedures to negotiate, with the assistance of the Bureau of Mediation Services, an employment plan for licensed employees affected by the agreement;\n(4) procedures to negotiate, with the assistance of the Bureau of Mediation Services, an employment plan for nonlicensed employees affected by the agreement; and\n(5) incentives that may be offered to superintendents, principals, teachers, and other licensed and nonlicensed employees, such as early retirement, severance pay, and health insurance benefits.\nThe plan must set forth:\n(1) elementary curriculum and programs;\n(2) improvements in secondary course offerings in at least communications, mathematics, science, social studies, foreign languages, physical education, health, and career education;\n(3) procedures for involving parents, teachers, and other interested people in developing learner outcomes in curricular areas;\n(4) procedures for involving teachers in determining levels of learner outcomes;\n(5) implications for special education cooperatives, secondary vocational cooperatives, joint powers agreements, education districts, and other cooperative arrangements if the districts combined and if they did not; and\n(6) a description of the long-range educational services of the combined district and of the individual districts if the combination is not achieved.\nThe plan must provide for combining extracurricular and cocurricular activities.\nThe plan must set forth:\n(1) procedures for a referendum, held prior to the year of the proposed combination, to approve combining the districts; and\n(2) whether a majority of those voting in each district proposed for combination or a majority of those voting on the question in the entire area proposed for combination would be needed to pass the referendum.\nThe plan must state:\n(1) whether debt service for the bonds outstanding at the time of combination remains solely with the district that issued the bonds or whether all or a portion of the debt service for the bonds will be assumed by the combined district and paid by the combined district on behalf of the district that issued the bonds;\n(2) whether obligations for a capital loan or energy loan made according to section 216C.37 or sections 298.292 to 298.297 outstanding at the time of combination remain solely with the district that obtained the loan, or whether all or a portion of all the loan obligations will be assumed by the combined district and paid by the combined district on behalf of the district that obtained the loan;\n(3) the treatment of debt service levies, down payment levies under section 123B.63, and referendum levies;\n(4) whether the cooperating or combined district will levy for reorganization operating debt according to section 123B.82, clause (1); and\n(5) two- and five-year projections, prepared by the department upon the request of any district, of revenues, expenditures, and property taxes for each district if it cooperated and combined and if it did not.\nThe plan must provide for:\n(1) locations for elementary schools which need not be altered and may contain assurances that, to the extent feasible, elementary schools will be retained for at least the number of years specified in the plan; and\n(2) one location, if possible, for a secondary school.\nThe plan must contain a time schedule for implementation.",
	"repealed": false
}