{
	"id": "521A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/521A.02",
	"title": "521A.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Account\" means an arrangement under a terms-of-service agreement in which a custodian carries, maintains, processes, receives, or stores a digital asset of the user or provides goods or services to the user.\n\"Agent\" means an attorney-in-fact granted authority under a durable or nondurable power of attorney.\n\"Carries\" means engages in the transmission of an electronic communication.\n\"Catalog of electronic communications\" means information that identifies each person with which a user has had an electronic communication, the time and date of the communication, and the electronic address of the person.\n\"Conservator\" means a person appointed by a court to manage the estate of a living individual. The term includes a limited conservator, or unlimited under section 524.5-401.\n\"Content of an electronic communication\" means information concerning the substance or meaning of the communication that:\n(1) has been sent or received by a user;\n(2) is in electronic storage by a custodian providing an electronic communication service to the public or is carried or maintained by a custodian providing a remote computing service to the public; and\n(3) is not readily accessible to the public.\n\"Court\" has the meaning given in section 524.1-201, clause (9).\n\"Custodian\" means a person that carries, maintains, processes, receives, or stores a digital asset of a user.\n\"Designated recipient\" means a person chosen by a user using an online tool to administer digital assets of the user.\n\"Digital asset\" means an electronic record in which an individual has a right or interest. The term does not include an underlying asset or liability unless the asset or liability is itself an electronic record.\n\"Electronic\" means relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities.\n\"Electronic communication\" has the meaning given in United States Code, title 18, section 2510(12), as amended.\n\"Electronic communication service\" means a custodian that provides to a user the ability to send or receive an electronic communication.\n\"Fiduciary\" means an original, additional, or successor personal representative, conservator, agent, or trustee.\n\"Information\" means data, text, images, videos, sounds, codes, computer programs, software, databases, or similar material.\n\"Online tool\" means an electronic service provided by a custodian that allows the user, in an agreement distinct from the terms-of-service agreement between the custodian and user, to provide directions for disclosure or nondisclosure of digital assets to a third person.\n\"Person\" means an individual, estate, business or nonprofit entity, public corporation, government or governmental subdivision, agency, or instrumentality, or other legal entity.\n\"Personal representative\" has the meaning given in section 524.1-201.\n\"Power of attorney\" means a record that grants an agent authority to act in the place of a principal, under chapter 523.\n\"Principal\" means an individual who grants authority to an agent in a power of attorney.\n\"Protected person\" means an individual for whom a conservator has been appointed. The term includes an individual for whom an application for the appointment of a conservator is pending.\n\"Record\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n\"Remote computing service\" means a custodian that provides to a user computer processing services or the storage of digital assets by means of an electronic communications system, as defined in United States Code, title 18, section 2510(14), as amended.\n\"Terms-of-service agreement\" means an agreement that controls the relationship between a user and a custodian.\n\"Trustee\" means a fiduciary with legal title to property under an agreement or declaration that creates a beneficial interest in another. The term includes a successor trustee.\n\"User\" means a person that has an account with a custodian.\n\"Will\" includes a codicil, testamentary instrument that only appoints an executor, and an instrument that revokes or revises a testamentary instrument.",
	"repealed": false
}