{
	"id": "345.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/345.31",
	"title": "345.31 DEFINITIONS AND USE OF TERMS.",
	"text": "As used in sections 345.31 to 345.60, unless the context otherwise requires, the terms defined in this section shall have the meanings ascribed to them.\n\"Banking organization\" means any bank, trust company, savings bank, safe deposit company or private banker engaged in business in this state.\n\"Business association\" means any corporation, joint stock company, business trust, partnership, cooperative, or any association for business purposes of two or more individuals.\n\"Commissioner\" means the commissioner of commerce.\n\"Financial organization\" means any savings association, credit union, industrial loan and thrift company or investment company engaged in business in this state.\n\"Holder\" means any person in possession of property subject to sections 345.31 to 345.60 belonging to another, or who is trustee in case of a trust, or is indebted to another on an obligation subject to sections 345.31 to 345.60.\n\"Life insurance corporation\" means any association or corporation, including a fraternal benefit society as defined in section 64B.01, transacting within this state the business of insurance on the lives of persons or insurance appertaining thereto, including, but not by way of limitation, endowments and annuities.\n\"Money order\" includes an express money order and a personal money order, on which the remitter is the purchaser. The term does not include a bank order or any other instrument sold by a financial organization if the seller has obtained the name and address of the payee.\n\"Owner\" means a depositor in case of a deposit, a beneficiary in case of a trust, a creditor, claimant or payee in case of other choses in action, or any person having a legal or equitable interest in property subject to sections 345.31 to 345.60 or the person's legal representative.\n\"Person\" means any individual, business association, government or political subdivision, public corporation, public authority, estate, trust, two or more persons having a joint or common interest, or any other legal or commercial entity.\n\"Utility\" means any person who owns or operates within this state, for public use, any plant, equipment, property, franchise or license for the transmission of communications or the production, storage, transmission, sale, delivery or furnishing of electricity, water, steam or gas.",
	"repealed": false
}