{
	"id": "82.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.57",
	"title": "82.57 LICENSE FEES.",
	"text": "The following fees shall be paid to the commissioner:\n(a) a fee of $150 for each initial individual broker's license, and a fee of $100 for each renewal thereof;\n(b) a fee of $70 for each initial salesperson's license, and a fee of $40 for each renewal thereof;\n(c) a fee of $85 for each initial real estate closing agent license, and a fee of $60 for each renewal thereof;\n(d) a fee of $150 for each initial corporate, limited liability company, or partnership license, and a fee of $100 for each renewal thereof;\n(e) a fee for payment to the education, research and recovery fund in accordance with section 82.86;\n(f) a fee of $20 for each transfer;\n(g) a fee of $20 for reactivating a corporate, limited liability company, or partnership license; and\n(h) in addition to the fees required under this subdivision, individual licensees under clauses (a) and (b) shall pay, for each initial license and renewal, a technology surcharge of up to $40 under section 45.24, unless the commissioner has adjusted the surcharge as permitted under that section.\nAll fees shall be retained by the commissioner and shall be nonreturnable, except that an overpayment of any fee shall be the subject of a refund upon proper application.\nFor all license renewal fees, recovery fund renewal fees, and recovery fund assessments pursuant to this section and section 82.86, the broker must remit the fees or assessments for the company, broker, and all salespersons licensed to the broker.\nUnless otherwise provided by this chapter, all fees collected under this chapter shall be deposited in the state treasury. The technology surcharge shall be deposited as required under section 45.24.\nAn initial license issued under this chapter expires in the year that results in the term of the license being at least 12 months, but no more than 24 months.\nAll fees must be paid by check, draft, credit card, or other negotiable or nonnegotiable instrument or order of withdrawal that is drawn against funds held by a financial institution. Cash will not be accepted.\nAn overpayment of a fee paid pursuant to this chapter shall be refunded within a reasonable time after a letter requesting the refund is received by the commissioner and signed by the person making the overpayment.\nRefunds shall not be given for anything other than overpayment of fees. A request for a refund of an overpayment must be received by the commissioner within six months of the date of deposit or it will be forfeited.",
	"repealed": false
}