{
	"id": "103F.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.401",
	"title": "103F.401 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103F.401 to 103F.455.\n\"Conservation plan\" means a set of practices that will decrease soil erosion to the soil loss limits on a particular parcel of land.\n\"Conservation practices\" means practices and standards containing a definition, purpose, and conditions that the practice applies including design requirements and specifications containing a statement of details required for installing a conservation practice, including kinds, quality, and quantity of work and materials needed to meet the standards. A conservation practice may be a permanent or temporary, vegetative or structural measure that will aid the control of wind and water erosion. Permanent practices are those that have effective life greater than ten years and include grassed waterways, terraces, field windbreaks, water control structures, grade stabilization structures, sediment retention structures, strip-cropping, and other permanent practices approved by the Board of Water and Soil Resources. Temporary practices include conservation tillage, contour farming, grasses and legumes in rotation, emergency tillage, and any other cultural practices approved by the Board of Water and Soil Resources.\n\"Development activity\" means a physical disturbance of the land, that may result in sedimentation of adjacent lands or waters, associated with activities that include clearing, grading, excavating, transporting, and filling lands. Road construction by federal, state, county, and municipal governments designed according to Department of Transportation standard specifications for construction are not development activities.\n\"Erosion\" means any process that removes soil away from the surface of the land by the action of water, wind, or gravity.\n\"Excessive soil loss\" means soil loss that is greater than the soil loss limits. Excessive soil loss may be evidenced by sedimentation on adjoining land or in a body of water.\n\"Land occupier\" means a person, firm, corporation, municipality, or other legal entity that holds title to or is in possession of lands, as owner, lessee, or otherwise. \"Land occupier\" includes both the owner and the occupier of the land if they are not the same.\n\"Local government\" means the elected governing body of a county, home rule charter or statutory city, or town, or their designated agents. Agents may include soil and water conservation districts, water management organizations, joint powers boards, watershed districts, and other governmental entities responsible for resource management within the local government's jurisdiction.\n\"Sediment\" means solid mineral or organic material that is in suspension, is being transported, or has been moved from its original location by air, water, gravity, or ice, and has been deposited at another location.\n\"Soil\" means the unconsolidated mineral and organic material on the immediate surface of the earth that serves as natural medium for the growth of land plants.\n\"Soil loss limit\" means the maximum amount of soil loss from water or wind erosion, expressed in tons per acre per year, that is allowed by local regulations on a particular soil.\n\"Technical guide\" means the guide developed by the United States Natural Resources Conservation Service and adopted by soil and water conservation districts containing technical information including methods and procedures by which the various types of erosion can be measured, and conservation practice standards and specifications required in the application of soil and water conservation practices.",
	"repealed": false
}