{
	"id": "354.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.49",
	"title": "354.49 REFUND.",
	"text": "A person who ceases to render teaching service in any school or institution to which the provisions of this chapter apply is entitled to a refund provided in subdivision 2, or a deferred retirement annuity under section 354.55, subdivision 11. An application for a refund must not be made sooner than 30 days after termination of teaching service if the applicant has not again become a teacher. This payment must be made within 45 days after the receipt of an application for a refund or upon the receipt of member reporting data under section 354.52, subdivision 4a, and payroll cycle data under section 354.52, subdivision 4b, whichever is later.\n(a) Except as provided in section 354.44, subdivision 1, any person who ceases to be a member by reason of termination of teaching service, is entitled to receive a refund in an amount equal to the accumulated deductions credited to the account plus interest compounded annually using the following interest rates:\n(1) before July 1, 1957, no interest accrues;\n(2) July 1, 1957, to June 30, 2011, six percent;\n(3) July 1, 2011, to June 30, 2018, four percent; and\n(4) after June 30, 2018, three percent.\nFor the purpose of this subdivision, interest must be computed on fiscal year end balances through the last day of the month prior to the month in which the refund is issued.\n(b) If the person has received permanent disability payments under section 354.48, the refund amount must be reduced by the amount of those payments.\nAny person not covered by the formula program who has attained normal retirement age with less than the minimum service required for an annuity and who ceases to be a member because of termination of teaching service is entitled upon application to a refund in an amount equal to the person's accumulated deductions plus interest at the rates used to compute annuities under section 354.44, subdivision 2 in lieu of a proportionate annuity pursuant to section 356.32. If a person who has attained normal retirement age is eligible for an annuity or is covered by the formula program, the refund is an amount equal to the accumulated deductions credited to the person's account as of June 30, 1957, and after July 1, 1957, the accumulated deductions plus interest computed as provided under subdivision 2.\nMembership in the retirement association of any person shall terminate under the following conditions: (1) if a person takes a refund pursuant to this section; (2) when a person's retirement annuity first begins to accrue as provided in section 354.44, subdivisions 1 and 4; (3) upon the person's ceasing to be a \"teacher\" whether by resignation, dismissal, or termination of temporary or provisional employment for the purpose of determining eligibility for disability or survivorship benefits as provided in sections 354.48, subdivision 1 and 354.46, subdivision 1, respectively.\n[Repealed, 2007 c 134 art 2 s 50]",
	"repealed": false
}