{
	"id": "245A.242",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.242",
	"title": "245A.242 EMERGENCY OVERDOSE TREATMENT.",
	"text": "This section applies to the following licenses issued under this chapter:\n(1) substance use disorder treatment programs licensed according to chapter 245G;\n(2) children's residential facility substance use disorder treatment programs licensed according to Minnesota Rules, parts 2960.0010 to 2960.0220 and 2960.0430 to 2960.0490;\n(3) detoxification programs licensed according to Minnesota Rules, parts 9530.6510 to 9530.6590;\n(4) withdrawal management programs licensed according to chapter 245F; and\n(5) intensive residential treatment services or residential crisis stabilization licensed according to chapter 245I and section 245I.23.\n(a) A license holder must maintain a supply of opiate antagonists as defined in section 604A.04, subdivision 1, available for emergency treatment of opioid overdose and must have a written standing order protocol by a physician who is licensed under chapter 147, advanced practice registered nurse who is licensed under chapter 148, or physician assistant who is licensed under chapter 147A, that permits the license holder to maintain a supply of opiate antagonists on site. A license holder must require staff to undergo training in the specific mode of administration used at the program, which may include intranasal administration, intramuscular injection, or both.\n(b) Notwithstanding any requirements to the contrary in Minnesota Rules, chapters 2960 and 9530, and Minnesota Statutes, chapters 245F, 245G, and 245I:\n(1) emergency opiate antagonist medications are not required to be stored in a locked area and staff and adult clients may carry this medication on them and store it in an unlocked location;\n(2) staff persons who only administer emergency opiate antagonist medications only require the training required by paragraph (a), which any knowledgeable trainer may provide. The trainer is not required to be a registered nurse or part of an accredited educational institution; and\n(3) nonresidential substance use disorder treatment programs that do not administer client medications beyond emergency opiate antagonist medications are not required to have the policies and procedures required in section 245G.08, subdivisions 5 and 6, and must instead describe the program's procedures for administering opiate antagonist medications in the license holder's description of health care services under section 245G.08, subdivision 1.",
	"repealed": false
}