{
	"id": "306.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.44",
	"title": "306.44 INVESTMENT AND USE OF FUNDS.",
	"text": "(a) A cemetery board of directors voting to establish a fund under section 306.41 shall on January 1, April 1, July 1, and October 1 of each year, deposit or invest all money belonging to the fund as provided in this section.\n(b) The money may be deposited in the county treasury of the county in which the cemetery is located and the treasurer of that county shall deposit it as provided in this section.\n(c) The money may be invested in the same securities in which savings banks are by law permitted to invest. Any of the income unexpended and unappropriated for one year after becoming available for care, maintenance, or improvement must be returned to the fund and become a part of the principal.\n(d) The money may be deposited or invested as provided in paragraphs (b) and (c) and may be withdrawn from either and deposited in the other, and the county treasurer shall return to the board any money deposited in the county treasury which the board, by resolution, withdraws.\n(e) When money is deposited in the county treasury, the board of directors shall also file with the county auditor for record and future reference, at the time of the deposit, a statement of each particular amount so set aside from the sale of a lot or the amount received by a gift or donation of money, with the name of the owner of the lot and the name of the donor of each particular gift and a description of the lot to which the income from the particular amount as a part of the permanent fund is applicable.\n(f) If the board of directors invests permanent care and improvement funds in the securities in which savings banks are by law permitted to invest, the board shall designate certain of its members to handle those funds. The designated persons shall give bond to the association, corporation, or municipality maintaining the cemetery in an amount at least equal to the total amount of the fund at the time of posting the bond, conditioned upon the faithful discharge of the trust. On July 1 of each even-numbered year after making the original bond, the person shall give a new bond in the amount and with the conditions provided above.\nThe directors may retain annually out of the money received not more than $100 for upkeep, improvements, and expenses.",
	"repealed": false
}