{
	"id": "169.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.71",
	"title": "169.71 WINDSHIELD.",
	"text": "(a) A person shall not drive or operate any motor vehicle with:\n(1) a windshield cracked or discolored to an extent to limit or obstruct proper vision;\n(2) any objects suspended between the driver and the windshield, other than:\n(i) sun visors;\n(ii) rearview mirrors;\n(iii) driver feedback and safety monitoring equipment when mounted immediately behind, slightly above, or slightly below the rearview mirror;\n(iv) global positioning systems or navigation systems when mounted or located near the bottommost portion of the windshield;\n(v) electronic toll collection devices; and\n(vi) an identifying device as provided in section 169.58, subdivision 5, when the device is mounted or located near the bottommost portion of the windshield; or\n(3) any sign, poster, or other nontransparent material upon the front windshield, sidewings, or side or rear windows of the vehicle, other than a certificate or other paper required to be so displayed by law or authorized by the state director of the Division of Emergency Management or the commissioner of public safety.\n(b) Paragraph (a), clauses (2) and (3), do not apply to law enforcement vehicles.\n(c) Paragraph (a), clause (2), does not apply to authorized emergency vehicles.\nThe windshield on every motor vehicle shall be equipped with a device for cleaning rain, snow or other moisture from the windshield, which device shall be so constructed as to be controlled or operated by the driver of the vehicle.\nNo person shall drive any motor vehicle with the windshield or front side windows covered with steam or frost to such an extent as to prevent proper vision.\nA person must not drive or operate any motor vehicle required to be registered in the state of Minnesota upon any street or highway under the following conditions:\n(1) when the windshield is composed of, covered by, or treated with any material which has the effect of making the windshield more reflective or in any other way reducing light transmittance through the windshield;\n(2) when any window on the vehicle is composed of, covered by, or treated with any material that has a highly reflective or mirrored appearance;\n(3) when any side window or rear window is composed of or treated with any material so as to obstruct or substantially reduce the driver's clear view through the window or has a light transmittance of less than 50 percent plus or minus three percent in the visible light range or a luminous reflectance of more than 20 percent plus or minus three percent; or\n(4) when any material has been applied after August 1, 1985, to any motor vehicle window without an accompanying permanent marking which indicates the percent of transmittance and the percent of reflectance afforded by the material. The marking must be in a manner so as not to obscure vision and be readable when installed on the vehicle.\n(a) Subdivision 4 does not apply to glazing materials that:\n(1) have not been modified since the original installation, nor to original replacement windows and windshields, that were originally installed or replaced in conformity with Federal Motor Vehicle Safety Standard 205;\n(2) are required to satisfy prescription or medical needs, provided:\n(i) the vehicle's driver or a passenger possesses a prescription or a physician's statement of medical need;\n(ii) the prescription or statement specifically states the minimum percentage that light transmittance may be reduced to satisfy the prescription or medical needs of the patient; and\n(iii) the prescription or statement contains an expiration date, which must be no more than two years after the date the prescription or statement was issued; or\n(3) are applied to:\n(i) the rear windows of a pickup truck as defined in section 168.002, subdivision 26;\n(ii) the rear windows or the side windows on either side behind the driver's seat of a van as defined in section 168.002, subdivision 40;\n(iii) the side and rear windows of a vehicle used to transport human remains by a funeral establishment holding a license under section 149A.50;\n(iv) the side and rear windows of a limousine as defined in section 168.002, subdivision 15; or\n(v) the rear and side windows of a police vehicle.\n(b) For the purposes of paragraph (a), clause (2), a driver of a vehicle may rely on a prescription or physician's statement of medical need issued to a person not present in the vehicle if:\n(1) the prescription or physician's statement of medical need is issued to (i) the driver's parent, child, grandparent, grandchild, sibling, or spouse, or (ii) a person for whom the driver is a personal care attendant;\n(2) the prescription or physician's statement of medical need specifies the make, model, and license plate of one or two vehicles that will have tinted windows; and\n(3) the driver is in possession of the prescription or physician's statement of medical need.\n(a) No person shall sell or offer for sale or use on any motor vehicle, windows or windshields that are composed of, covered by, or treated with material that fails to comply with the provisions of subdivision 4. No person shall apply or offer to apply, as part of a business transaction, material to motor vehicle windows or windshields that fails to comply with the provisions of subdivision 4.\n(b) Violation of this subdivision is a misdemeanor.\n(c) This subdivision does not apply to sale or offers for sale of a motor vehicle containing windows or windshields composed of, covered by, or treated with material that fails to comply with the provisions of subdivision 4.",
	"repealed": false
}