{
	"id": "367.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/367.33",
	"title": "367.33 OPTION A; ELECTION OF ADDITIONAL SUPERVISORS.",
	"text": "Following the adoption of option A in a town, except a town exercising the powers of a statutory city, the town board may call a special town election to be held on a date authorized by section 205.10, subdivision 3a, to elect two additional members to the board of supervisors. In lieu of a special election, the town board may determine to elect the additional members at the next annual town election.\nIf the town is exercising the powers of a statutory city under section 368.01 or a special law granting substantially similar powers, the town board shall call a special election to be held on a date authorized by section 205.10, subdivision 3a, at which option A is adopted to elect the two additional supervisors.\nIf a special election is called under subdivision 1, the clerk shall give ten days' posted notice of it, specifying its purpose. If a newspaper is published in the town, the clerk shall give one week's published notice of the election.\nSection 205.13 shall apply to the filing of affidavits of candidacy, except that if the additional supervisors are to be elected at a special election, the affidavits shall be filed not more than three weeks nor less than ten days before the election, and notice of the first and last dates for filing affidavits of candidacy shall be published at least two weeks before the first day for filing. If publication schedules do not allow sufficient time to give two weeks' notice, at least one weeks notice shall be given.\nIf the additional supervisors are elected at a special election, they shall serve until the next annual town election. Additional members shall then be elected, one for two years and one for three years. A candidate for one of the additional supervisor positions shall specify in the affidavit of candidacy that the candidate is filing for either the two-year or the three-year term.\nIn a town where option A is abandoned, the terms of incumbent supervisors shall not be affected, but if one or more supervisors are elected at the annual town election on the same day as the annual town election at which the option is abandoned, the election of one supervisor, or two if more than one is elected, shall be null. Otherwise the offices of the two incumbent supervisors expiring at the annual town election or elections next following the annual election at which the option is abandoned shall not be filled. Thereafter the town board shall be composed of three supervisors unless option A is again adopted.",
	"repealed": false
}