{
	"id": "481.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/481.13",
	"title": "481.13 LIEN FOR ATTORNEYS' FEES.",
	"text": "(a) An attorney has a lien for compensation whether the agreement for compensation is expressed or implied (1) upon the cause of action from the time of the service of the summons in the action, or the commencement of the proceeding, and (2) upon the interest of the attorney's client in any money or property involved in or affected by any action or proceeding in which the attorney may have been employed, from the commencement of the action or proceeding, and, as against third parties, from the time of filing the notice of the lien claim, as provided in this section.\n(b) An attorney has a lien for compensation upon a judgment, whether there is a special express or implied agreement as to compensation, or whether a lien is claimed for the reasonable value of the services. The lien extends to the amount of the judgment from the time of giving notice of the claim to the judgment debtor. The lien under this paragraph is subordinate to the rights existing between the parties to the action or proceeding.\n(c) A lien provided by paragraphs (a) and (b) may be established, and the amount of the lien may be determined, summarily by the court under this paragraph on the application of the lien claimant or of any person or party interested in the property subject to the lien.\nJudgment shall be entered under the direction of the court, adjudging the amount due.\n(a) If the lien is claimed on the client's interest in real property involved in or affected by the action or proceeding, a notice of intention to claim a lien on the property must be filed in the office of the county recorder or registrar of titles, where appropriate, and noted on the certificate or certificates of title affected, in and for the county where the real property is located. Within 30 days of filing a lien on real property, the claimant must prepare and deliver a written notice of the filing personally or by certified mail to the owner of the real property or the owner's authorized agent. A person who fails to provide the required notice shall not have the lien and remedy provided by this section. Upon receipt of payment in full of the debt which gave rise to the lien, the lienholder shall deliver within 30 days a recordable satisfaction and release of lien to the owner of the real property or the owner's authorized agent. No notice of intent to claim a lien may be filed more than 120 days after the last item of claim.\n(b) If the lien is claimed on the client's interest in personal property involved in or affected by the action or proceeding, the notice must be filed in the same manner as provided by law for the filing of a security interest.\nNo lien against real property shall be enforced unless the lienholder, by filing either a complaint or an answer with the court administrator, asserts a lien within one year after the filing of the notice of intention to claim a lien, unless within the one-year time period the owner has agreed to a longer time period to assert the lien. This agreement must be in a written instrument signed by the owner containing the legal description of the affected real property and a description of the recording information of the filed lien and the written instrument must be recorded in the same office as the lien within one year after the filing of the notice of intention to claim a lien. In no event may the lien be asserted more than three years after filing. No person is bound by any judgment in the action unless made a party to the action within the time limit. The absence from the record in the Office of the County Recorder or the registrar of titles, where appropriate, of a notice of lis pendens of an action after the expiration of the time limit in which the lien could be so asserted is conclusive evidence that the lien may no longer be enforced as to a bona fide purchaser, mortgagee, or encumbrancer without notice. In the case of registered land, the registrar of titles shall refrain from carrying forward to new certificates of title the memorials of lien statements when no notice of lis pendens has been registered within the time limit.",
	"repealed": false
}