{
	"id": "475.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.61",
	"title": "475.61 TAX LEVIES.",
	"text": "The governing body of any municipality issuing general obligations shall, prior to delivery of the obligations, levy by resolution a direct general ad valorem tax upon all taxable property in the municipality to be spread upon the tax rolls for each year of the term of the obligations. The tax levies for all years for municipalities other than school districts shall be specified and such that if collected in full they, together with estimated collections of special assessments and other revenues pledged for the payment of said obligations, will produce at least five percent in excess of the amount needed to meet when due the principal and interest payments on the obligations. The tax levies for school districts shall be specified and such that if collected in full they, together with estimated collection of other revenues pledged for the payment of the obligations, will produce five percent in excess of the amount needed to meet when due the principal and interest payments on the obligations, rounded up to the nearest dollar; except that, with the permission of the commissioner of education, a school board may specify a tax levy in a higher amount if necessary either to meet an anticipated tax delinquency or for cash flow needs to meet the required payments from the debt redemption fund. Such resolution shall irrevocably appropriate the taxes so levied and any special assessments or other revenues so pledged to the municipality's debt service fund or a special debt service fund or account created for the payment of one or more issues of obligations. The governing body may, in its discretion, at any time after the obligations have been authorized, adopt a resolution levying only a portion of such taxes, to be filed, assessed, extended, collected, and remitted as hereinafter provided, and the amount or amounts therein levied shall be credited against the tax required to be levied prior to delivery of the obligations.\nThe recording officer of the municipality shall file in the office of the county auditor of each county in which any part of the municipality is located a certified copy of the resolution, together with full information regarding the obligations for which the tax is levied. No further action by the municipality is required to authorize the extension, assessment and collection of the tax, but the municipality's liability on the obligations is not limited thereto and its governing body shall levy and cause to be extended, assessed and collected any additional taxes found necessary for full payment of the principal and interest. The county auditor shall forthwith certify to the municipality that the obligations have been entered in the register required by sections 475.51 to 475.74 and that the tax levy required by sections 475.51 to 475.74 has been made. The auditor shall annually assess and extend upon the tax rolls the amount specified for such year in the resolution, unless the amount has been reduced as authorized below or, if the municipality is located in more than one county, the portion thereof which bears the same ratio to the whole amount as the net tax capacity of taxable property in that part of the municipality located in the auditor's county bears to the net tax capacity of all taxable property in the municipality.\n(a) Tax levies so made and filed shall be irrevocable, except as provided in this subdivision.\n(b) For purposes of this subdivision, \"excess debt redemption fund balance\" means the greater of zero or the balance in the district's debt redemption fund as of June 30 of the fiscal year ending in the year before the year the levy is certified, minus any debt redemption fund balance attributable to refunding of existing bonds, minus the amount of the levy reduction for the current year and the prior year under paragraphs (e) and (f), minus five percent of the district's required debt service levy for the next year.\n(c) By July 15 each year, a district shall report to the commissioner of education the amount of the districts' debt redemption fund balance as of June 30 of the prior year attributable to refunding of existing bonds.\n(d) By August 15 each year, the commissioner shall determine the excess debt redemption fund balance for each school district, and shall certify the amount of the excess balance to the school district superintendent.\n(e) In each year when a district has an excess debt redemption fund balance, the commissioner shall reduce the tax levy otherwise to be included in the rolls next prepared by the amount certified.\n(f) The school board may, with the approval of the commissioner, retain all or part of the excess balance if it is necessary to ensure the prompt and full payment of its obligations and any call premium on its obligations, will be used for redemption of its obligations in accordance with their terms, or to level out the debt service tax rate, excluding the debt excess adjustment, for its obligations over the next two years. A school district requesting authority to retain all or part of the excess balance shall provide written documentation to the commissioner describing the rationale for its request by September 15 including the issuance of new obligations within the next year or the refunding of existing obligations. A school district that retains an excess may request to transfer the excess to its operating capital account in the general fund under section 123B.80. The school board may, with the approval of the commissioner, specify a tax levy in a higher amount if necessary because of anticipated tax delinquency or for cash flow needs to meet the required payments from the debt redemption fund.\n(g) If the governing body, including the governing body of a school district, in any year makes an irrevocable appropriation to the debt service fund of money actually on hand or if there is on hand any excess amount in the debt service fund, the recording officer may certify to the county auditor the fact and amount thereof and the auditor shall reduce by the amount so certified the amount otherwise to be included in the rolls next thereafter prepared.\n(a) All such taxes shall be collected and remitted to the municipality by the county treasurer as other taxes are collected and remitted, and shall be used only for payment of the obligations on account of which levied or to repay advances from other funds used for such payments, except that any surplus remaining in the debt service fund when the obligations and interest thereon are paid may be appropriated to any other general purpose by the municipality. However, for obligations authorized before July 1, 2005, the amount of any surplus remaining in the debt service fund of a school district when the obligations and interest thereon are paid shall be used to reduce the general fund levies authorized pursuant to chapters 122A, 123A, 123B, 124D, and 126C and the state aids authorized pursuant to chapters 122A, 123A, 123B, 124D, 125A, 126C, and 127A. For obligations authorized on July 1, 2005, or thereafter, the amount of any surplus remaining in the debt service fund of a school district when the obligations and interest thereon are paid in full may be appropriated to any other general purpose by the school district without any reduction in state aid or levies or may be used to reduce the general fund levies authorized under chapters 122A, 123A, 123B, 124D, and 126C, and the state aids authorized under chapters 122A, 123A, 123B, 124D, 125A, 126C, and 127A.\n(b) If the district qualified for second tier debt service equalization aid in the last year that it qualified for debt service equalization aid, the reduction to state aids equals the lesser of (1) the amount of the surplus times the ratio of the district's second tier debt service equalization aid to the district's second tier debt service equalization revenue for the last year that the district qualified for debt service equalization aid; or (2) the district's cumulative amount of debt service equalization aid.\n(c) If the district did not qualify for second tier debt service equalization aid in the last year that it qualified for debt service equalization aid, the reduction to state aids equals the lesser of (1) the amount of the surplus times the ratio of the district's debt service equalization aid to the district's debt service equalization revenue for the last year that the district qualified for debt service equalization aid; or (2) the district's cumulative amount of debt service equalization aid.\n(d) The reduction to the general fund levies equals the total amount of the surplus minus the reduction to state aids.\nWhen all conditions exist precedent to the offering for sale of obligations of any municipality in any amount for any purpose authorized by law, and the municipality has applied for a grant or loan of state or federal funds to aid in payment of cost incurred for the authorized purpose, its governing body may by resolution issue and sell temporary obligations not exceeding the total amount authorized, maturing within not more than three years from the date such obligations are issued. In this event so much of the proceeds of the grant or loan when received shall be credited to the debt service fund for the temporary obligations as may be needed for the payment thereof, with interest, when due, and the tax which would otherwise be required by subdivision 1 need not be levied. Any amount of the temporary obligations which cannot be paid at maturity, from the proceeds of the grant or loan or from any other funds appropriated by the governing body for the purpose, shall be paid from the proceeds of definitive obligations to be issued and sold before the maturity date; or if sufficient funds are not available for payment in full of the temporary obligations at maturity, the holders thereof shall have the right to require the issuance in exchange therefor of definitive obligations secured in the manner provided in subdivision 1 and bearing interest at the maximum rate permitted by law.\nWhen all conditions exist precedent to the offering for sale of obligations of any municipality in any amount for any purpose authorized by law, the governing body may issue and sell temporary obligations not exceeding the total amount authorized, maturing in not more than three years from the date the obligations are issued, in anticipation of the issuance of the permanent obligations. To the extent that the principal of and interest on the temporary obligations cannot be paid when due from other sources pledged or appropriated for the purpose, they shall be paid from the proceeds of permanent bonds or additional temporary bonds which the governing body shall offer for sale in advance of their maturity but the indebtedness funded by an issue of temporary bonds shall not be extended by the issue of additional temporary bonds for more than six years from the date of the first issue. The holders of any temporary bonds shall have and may enforce, by mandamus or other appropriate proceedings, all rights respecting the levy and collection of taxes that are granted by law to holders of permanent bonds, except the right to require the levies to be collected prior to the maturity of the temporary bonds. If any temporary bonds are not paid in full at maturity, the holders may require the issuance in exchange for them, at par, of new temporary bonds maturing within one year from their date of issue but not subject to any other maturity limitation, and bearing interest at the maximum rate permitted by law. The governing body may by resolution adopted prior to the sale of any temporary bonds pledge the full faith, credit, and taxing power of the municipality for the payment of the principal and interest, in addition to all provisions made for their security in the authorizing resolution. If it does so, the bonds will be designated as general obligation temporary bonds, and the governing body shall levy taxes for their payment in accordance with this section. Proceeds of permanent bonds or temporary bonds not yet sold may be treated as pledged revenues, in reduction of the tax otherwise required by this section to be levied prior to delivery of the obligations. Funds of a municipality may be invested in its temporary bonds in accordance with section 118A.04, and may be purchased upon their initial issue, but shall be purchased only from funds which the municipality determines will not be required for other purposes before the maturity date, and shall be resold before maturity only in the case of an emergency.",
	"repealed": false
}