{
	"id": "360.0426",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0426",
	"title": "360.0426 CREATION OF AN AIRPORT AUTHORITY; DISSOLUTION.",
	"text": "A city together with another city, county, town, or an Indian tribe may create an airport authority. For purposes of this chapter, \"airport authority\" means a governmental entity created pursuant to this section for the purpose of acquiring, establishing, constructing, maintaining, improving, and operating airports and other air navigation facilities.\nA city that owns an airport by joint resolution together with other willing governmental units may create an airport authority that is authorized to exercise its functions upon passage of a joint resolution by each of their governing bodies, including a proposed date for the first meeting of the authority.\nThe powers of the airport authority shall be vested in the airport authority commissioners. The commission shall consist of at least five commissioners. Each governmental unit that is a member of the authority shall be represented by at least one commissioner. If fewer than five governmental units are members of the authority, there must be two commissioners appointed from each member unit of government. The terms of each commissioner are three years, provided that the length of the initial appointments must be staggered so that the terms of approximately one-third of the commissioners expire each calendar year.\nThe governmental body of each member governmental unit shall appoint a resident of that governmental unit to be a commissioner of the airport authority. Upon vacancy of a commissioner prior to the end of a normal term, the appropriate governmental body shall appoint a commissioner to fill the unexpired term.\nCommissioners shall receive no compensation for services, but are entitled to payment for necessary expenses, including travel expenses, incurred in the discharge of the commissioners' duties.\nThe commission shall establish a regular meeting schedule. A majority of the commissioners of the authority constitutes a quorum for purposes of conducting business of the authority. Action may be taken by a vote of not less than a majority of the commissioners present, providing there is a quorum.\nThe commission shall elect a chair, a vice-chair, a secretary, and a treasurer at its organizational meeting. The authority may hire an executive director, a legal advisor, technical experts, and other employees, permanent and temporary, as it may require.\nAn airport authority may be increased in size by adding additional governmental entities if each of the additional entities and each of the governmental entities currently included in the existing authority adopt a resolution agreeing to the size increase.\nAn airport authority may be decreased in size if each of the governmental entities that are members of the authority and the current commissioners consent to change and make provisions for the retention or disposition of its assets and liabilities.\nAn airport authority may be dissolved after payment of all debts and adoption of a joint resolution of the governing bodies of all of the participating units of government. Before dissolution, the property of the airport authority must be sold, transferred, or distributed as agreed to by the participating units of government. Any remaining funds must be distributed to the general funds of the participating units of government in proportion to their relative shares of the most recent levy under section 360.0427.",
	"repealed": false
}