{
	"id": "256B.5015",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.5015",
	"title": "256B.5015 PASS-THROUGH OF OTHER SERVICES COSTS.",
	"text": "Day training and habilitation services costs shall be paid as a pass-through payment at the lowest rate paid for the comparable services at that site under sections 252.41 to 252.46. The pass-through payments for training and habilitation services shall be paid separately by the commissioner and shall not be included in the computation of the ICF/DD facility total payment rate.\n(a) Services during the day, as defined in section 256B.501, but excluding day training and habilitation services, shall be paid as a pass-through payment. The commissioner shall establish rates for these services, other than day training and habilitation services, at 100 percent of a recipient's day training and habilitation service costs prior to the service change.\n(b) An individual qualifies for services during the day under paragraph (a) if, through consultation with the individual and the individual's support team or interdisciplinary team:\n(1) it has been determined that the individual's needs can best be met through partial or full retirement from:\n(i) participation in a day training and habilitation service; or\n(ii) the use of services during the day in the individual's home environment; and\n(2) an individualized plan has been developed with designated outcomes that:\n(i) address the support needs and desires contained in the person-centered plan or individual support plan; and\n(ii) include goals that focus on community integration as appropriate for the individual.\n(c) When establishing a rate for these services, the commissioner shall also consider an individual recipient's needs as identified in the individual support plan and the person's need for active treatment as defined under federal regulations. The pass-through payments for services during the day shall be paid separately by the commissioner and shall not be included in the computation of the ICF/DD facility total payment rate.",
	"repealed": false
}