{
	"id": "245F.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.02",
	"title": "245F.02 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n\"Administration of medications\" means performing a task to provide medications to a patient, and includes the following tasks performed in the following order:\n(1) checking the patient's medication record;\n(2) preparing the medication for administration;\n(3) administering the medication to the patient;\n(4) documenting administration of the medication or the reason for not administering the medication as prescribed; and\n(5) reporting information to a licensed practitioner or a registered nurse regarding problems with the administration of the medication or the patient's refusal to take the medication.\n\"Alcohol and drug counselor\" means an individual qualified under section 245G.11, subdivision 5.\n\"Applicant\" means an individual, partnership, voluntary association, corporation, or other public or private organization that submits an application for licensure under this chapter.\n\"Care coordination\" means activities intended to bring together health services, patient needs, and streams of information to facilitate the aims of care. Care coordination includes an ongoing needs assessment, life skills advocacy, treatment follow-up, disease management, education, and other services as needed.\n\"Chemical\" means alcohol, solvents, controlled substances as defined in section 152.01, subdivision 4, and other mood-altering substances.\n\"Clinically managed program\" means a residential setting with staff comprised of a medical director and a licensed practical nurse. A licensed practical nurse must be on site 24 hours a day, seven days a week. A licensed practitioner must be available by telephone or in person for consultation 24 hours a day. Patients admitted to this level of service receive medical observation, evaluation, and stabilization services during the detoxification process; access to medications administered by trained, licensed staff to manage withdrawal; and a comprehensive assessment pursuant to section 245F.06.\n\"Commissioner\" means the commissioner of human services or the commissioner's designated representative.\n\"Department\" means the Department of Human Services.\n\"Direct patient contact\" has the meaning given for \"direct contact\" in section 245C.02, subdivision 11.\n\"Discharge plan\" means a written plan that states with specificity the services the program has arranged for the patient to transition back into the community.\n\"Licensed practitioner\" means a practitioner as defined in section 151.01, subdivision 23, who is authorized to prescribe.\n\"Medical director\" means an individual licensed in Minnesota by the Board of Medical Practice as a doctor of osteopathic medicine, physician, or physician assistant, or an individual licensed in Minnesota as an advanced practice registered nurse by the Board of Nursing and certified to practice as a clinical nurse specialist or nurse practitioner by a national nurse organization acceptable to the board. The medical director must be employed by or under contract with the license holder to direct and supervise health care for patients of a program licensed under this chapter.\n\"Medically monitored program\" means a residential setting with staff that includes a registered nurse and a medical director. A registered nurse must be on site 24 hours a day. A licensed practitioner must be available seven days a week, and patients must have the ability to be seen by a licensed practitioner within 24 hours. Patients admitted to this level of service receive medical observation, evaluation, and stabilization services during the detoxification process; medications administered by trained, licensed staff to manage withdrawal; and a comprehensive assessment pursuant to section 245F.06.\n\"Nurse\" means a person licensed and currently registered to practice practical or professional nursing as defined in section 148.171, subdivisions 14 and 15.\n\"Patient\" means an individual who presents or is presented for admission to a withdrawal management program that meets the criteria in section 245F.05.\n\"Peer recovery support services\" means services provided according to section 245F.08, subdivision 3.\n\"Program director\" means the individual who is designated by the license holder to be responsible for all operations of a withdrawal management program and who meets the qualifications specified in section 245F.15, subdivision 3.\n\"Protective procedure\" means an action taken by a staff member of a withdrawal management program to protect a patient from imminent danger of harming self or others. Protective procedures include the following actions:\n(1) seclusion, which means the temporary placement of a patient, without the patient's consent, in an environment to prevent social contact; and\n(2) physical restraint, which means the restraint of a patient by use of physical holds intended to limit movement of the body.\nMS 2018 [Repealed, 1Sp2020 c 2 art 5 s 98]\n\"Recovery peer\" means a person who has progressed in the person's own recovery from substance use disorder and is willing to serve as a peer to assist others in their recovery and is qualified according to section 245F.15, subdivision 7.\n\"Responsible staff person\" means the program director, the medical director, or a staff person with current licensure as a nurse in Minnesota. The responsible staff person must be on the premises and is authorized to make immediate decisions concerning patient care and safety.\n\"Substance\" means \"chemical\" as defined in subdivision 6.\n\"Substance use disorder\" means a pattern of substance use as defined in the current edition of the Diagnostic and Statistical Manual of Mental Disorders.\n\"Technician\" means a person who meets the qualifications in section 245F.15, subdivision 6.\n\"Withdrawal management program\" means a licensed program that provides short-term medical services on a 24-hour basis for the purpose of stabilizing intoxicated patients, managing their withdrawal, and facilitating access to substance use disorder treatment as indicated by a comprehensive assessment.",
	"repealed": false
}