{
	"id": "18C.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.70",
	"title": "18C.70 MINNESOTA AGRICULTURAL FERTILIZER RESEARCH AND EDUCATION COUNCIL.",
	"text": "(a) The Minnesota Agricultural Fertilizer Research and Education Council is established. The council is composed of 15 voting members as follows:\n(1) one member of the Minnesota Crop Production Retailers;\n(2) one member of the Minnesota Corn Growers Association;\n(3) one member of the Minnesota Soybean Growers Association;\n(4) one member of the sugar beet growers industry;\n(5) one member of the Minnesota Association of Wheat Growers;\n(6) one member of the potato growers industry;\n(7) one member of the Minnesota Farm Bureau;\n(8) one member of the Minnesota Farmers Union;\n(9) one member from the Minnesota Irrigators Association;\n(10) one member of the Minnesota Grain and Feed Association;\n(11) one member of the Minnesota Independent Crop Consultant Association or the Minnesota certified crop advisor program;\n(12) one member representing the Minnesota Institute for Sustainable Agriculture;\n(13) one member of the Minnesota Soil Health Coalition;\n(14) one member who is an expert in public health; and\n(15) one member who is an expert in water quality and has performed scientific research on water issues.\n(b) Council members shall serve three-year terms. After the initial council is appointed, subsequent appointments must be staggered so that one-third of council membership is replaced each year. Council members must be appointed by the commissioner and, except for the members specified under paragraph (a), clauses (14) and (15), nominated by their organizations. The council may add ex officio members at its discretion. The council must meet at least once per year, with all related expenses reimbursed by members' sponsoring organizations or by the members themselves.\nThe council must review applications and select projects to receive agricultural fertilizer research and education program grants, as authorized in section 18C.71. The council must establish a program to provide grants to research, education, and technology transfer projects related to agricultural fertilizer, soil amendments, and plant amendments. For the purpose of this section, \"fertilizer\" includes soil amendments and plant amendments, but does not include vegetable or animal manures that are not manipulated. The commissioner is responsible for all fiscal and administrative duties.\nThe council may recommend to the governor and legislature a checkoff fee to provide funding for grants under section 18C.71.\nThe commissioner's duties under this section and section 18C.71 are not subject to the provisions of chapter 14.\nThis section expires June 30, 2030.",
	"repealed": false
}