{
	"id": "181.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.87",
	"title": "181.87 PAYMENT TERMS.",
	"text": "Each migrant worker who is recruited by an employer is entitled to payment in accordance with this section.\nThe employer shall pay wages due to the migrant worker at least every two weeks, except on termination, when the employer shall pay within three days unless payment is required sooner pursuant to section 181.13.\nThe employer shall guarantee to each recruited migrant worker a minimum of 70 hours pay for work in any two successive weeks and, should the pay for hours actually offered by the employer and worked by the migrant worker provide a sum of pay less than the minimum guarantee, the employer shall pay the migrant worker the difference within three days after the scheduled payday for the pay period involved. Payment for the guaranteed hours shall be at the hourly wage rate, if any, specified in the employment statement, or the federal, state, or local minimum wage, whichever is highest. Any pay in addition to the hourly wage rate specified in the employment statement shall be applied against the guarantee. This guarantee applies for the minimum period of employment specified in the employment statement beginning with the date on which employment is to begin as specified in the employment statement. The date on which employment is to begin may be changed by the employer by written, telephonic, or telegraphic notice to the migrant worker, at the worker's last known physical address or email address, no later than ten days prior to the previously stated beginning date. The migrant worker shall contact the recruiter to obtain the latest information regarding the date upon which employment is to begin no later than five days prior to the previously stated beginning date. This guarantee shall be reduced, when there is no work available for a period of seven or more consecutive days during any two-week period subsequent to the commencement of work, by five hours pay for each such day, when the unavailability of work is caused by climatic conditions or an act of God, provided that the employer pays the migrant worker, on the normal payday, the sum of $50 for each such day.\nIf the migrant worker quits or is fired for cause prior to the completion of the operation for which hired, the migrant worker is entitled to no further guarantee under subdivision 3 from that employer. If the migrant worker quits or is fired for cause before the completion of a two-week pay period, the worker is entitled to no guarantee for that period.\nThe employer may require the migrant worker to vacate the provided housing on final payment of all wages.\nIf on any day for which work is offered the migrant worker refuses or because of illness or disability is unable to perform work which is offered, the employer may reduce the guarantee available in the pay period by the number of hours of work actually offered by the employer that day.\nThe employer shall provide a written statement at the time wages are paid clearly itemizing each deduction from wages. The written statement shall also comply with all other requirements for an earnings statement in section 181.032.",
	"repealed": false
}