{
	"id": "181.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.14",
	"title": "181.14 PAYMENT TO EMPLOYEES WHO QUIT OR RESIGN; SETTLEMENT OF DISPUTES.",
	"text": "(a) When any such employee quits or resigns employment, the wages or commissions earned and unpaid at the time the employee quits or resigns shall be paid in full not later than the first regularly scheduled payday following the employee's final day of employment, unless an employee is subject to a collective bargaining agreement with a different provision. Wages are earned and unpaid if the employee was not paid for all time worked at the employee's regular rate of pay or at the rate required by law, including any applicable statute, regulation, rule, ordinance, government resolution or policy, contract, or other legal authority, whichever rate of pay is greater. If the first regularly scheduled payday is less than five calendar days following the employee's final day of employment, full payment may be delayed until the second regularly scheduled payday but shall not exceed a total of 20 calendar days following the employee's final day of employment.\n(b) Notwithstanding the provisions of paragraph (a), in the case of migrant workers, as defined in section 181.85, the wages or commissions earned and unpaid at the time the employee quits or resigns shall become due and payable within three days thereafter.\nWages or commissions not paid within the required time period shall become immediately payable upon the demand of the employee. If the employee's earned wages or commissions are not paid within 24 hours after the demand, the employer shall be liable to the employee for a penalty equal to the amount of the employee's average daily earnings at the employee's regular rate of pay or the rate required by law, whichever rate is greater, for every day, not exceeding 15 days in all, until such payment or other settlement satisfactory to the employee is made. The employer shall also be liable to the employee for the amount of wages and commissions that are earned and unpaid. An employee's demand for payment under this section must be in writing but need not state the precise amount of unpaid wages or commissions. An employee may directly seek and recover payment from an employer under this section even if the employee is not a party to a contract that requires the employer to pay the employee at the rate of pay demanded by the employee, so long as the contract or any applicable statute, regulation, rule, ordinance, government resolution or policy, or other legal authority requires payment to the employee at the particular rate of pay. The employee shall be able to directly seek payment at the highest rate of pay provided in the contract or applicable law, and any other remedies related thereto as provided in this section.\nIf the employer disputes the amount of wages or commissions claimed by the employee under the provisions of this section or section 181.13, and the employer makes a legal tender of the amount which the employer in good faith claims to be due, the employer shall not be liable for any sum greater than the amount so tendered and interest thereon at the legal rate, unless, in an action brought in a court having jurisdiction, the employee recovers a greater sum than the amount so tendered with interest thereon; and if, in the suit, the employee fails to recover a greater sum than that so tendered, with interest, the employee shall not pay the cost of the suit, otherwise the cost shall be paid by the employer.\nIn cases where the discharged or quitting employee was, during employment, entrusted with the collection, disbursement, or handling of money or property, the employer shall have ten calendar days after the termination of the employment to audit and adjust the accounts of the employee before the employee's wages or commissions shall be paid as provided in this section, and the penalty herein provided shall apply in such case only from the date of demand made after the expiration of the period allowed for payment of the employee's wages or commissions. No employer shall make any deduction, directly or indirectly, from the wages due or earned by any employee, who is not an independent contractor, for lost or stolen property, damage to property, or to recover any other claimed indebtedness running from employee to employer, except as permitted by section 181.79.\nWages and commissions paid under this section shall be paid in the usual manner of payment unless the employee requests that the wages and commissions be sent to the employee through the mails. If, in accordance with a request by the employee, the employee's wages and commissions are sent to the employee through the mail, the wages and commissions shall be deemed to have been paid as of the date of their postmark for the purposes of this section.",
	"repealed": false
}