{
	"id": "62S.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.21",
	"title": "62S.21 PROHIBITION AGAINST POSTCLAIMS UNDERWRITING.",
	"text": "All applications for long-term care insurance policies or certificates, except those which are guaranteed issue must contain clear and unambiguous questions designed to ascertain the health condition of the applicant.\nIf an application for long-term care insurance contains a question which asks whether the applicant has had medication prescribed by a physician, advanced practice registered nurse, or physician assistant, it must also ask the applicant to list the medication that has been prescribed. If the medications listed in the application were known by the insurer, or should have been known at the time of application, to be directly related to a medical condition for which coverage would otherwise be denied, then the policy or certificate shall not be rescinded for that condition.\n(a) The following language must be set out conspicuously and in close conjunction with the applicant's signature block on an application for a long-term care insurance policy or certificate:\nCAUTION: If your answers on this application are incorrect or untrue, (company) has the right to deny benefits or rescind your policy.\n(b) The following language, or language substantially similar to the following, must be set out conspicuously on the long-term care insurance policy or certificate at the time of delivery:\nCAUTION: The issuance of this long-term care insurance (policy) (certificate) is based upon your responses to the questions on your application. A copy of your (application) (enrollment form) (is enclosed) (was retained by you when you applied). If your answers are incorrect or untrue, the company has the right to deny benefits or rescind your policy. The best time to clear up any questions is now, before a claim arises. If, for any reason, any of your answers are incorrect, contact the company at this address: (insert address).\nBefore issuing a long-term care policy or certificate to an applicant aged 80 or older, the insurer shall obtain one of the following:\n(1) a report of a physical examination;\n(2) an assessment of functional capacity;\n(3) an attending physician's statement; or\n(4) copies of medical records.\nSubdivisions 3 and 4 do not apply to policies or certificates which are guaranteed issue.\nA copy of the completed application or enrollment form, whichever is applicable, must be delivered to the insured no later than at the time of delivery of the policy or certificate unless it was retained by the applicant at the time of application.\nAn insurer or other entity selling or issuing long-term care insurance benefits shall maintain a record of all policy or certificate rescissions, both state and countrywide, except those which the insured voluntarily effectuated and shall annually furnish this information to the commissioner.",
	"repealed": false
}