{
	"id": "401.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.02",
	"title": "401.02 COUNTIES OR REGIONS; INCLUDED CORRECTIONAL SERVICES.",
	"text": "(a) A county or Tribal Nation may qualify for the subsidy program under section 401.01 by:\n(1) designating an officer or agency responsible for administering the subsidy; and\n(2) preparing a comprehensive plan for developing, implementing, and operating the correctional services under this chapter.\n(b) When preparing a comprehensive plan, a county or Tribal Nation must:\n(1) provide correctional services, not including the operation of state facilities, that are currently provided by the Department of Corrections or, for Tribal Nations, probation services in a Tribal Nation;\n(2) provide for centralized administration and control of the correctional services; and\n(3) enact the appropriate resolutions to create and establish a local advisory board.\n(c) If counties or Tribal Nations combine as authorized under this section, they must comply with section 471.59. Unless the context indicates otherwise, a CCA or non-CCA jurisdiction includes a group of counties or a group of Tribal Nations.\nA single CCA jurisdiction that has participated in the Community Corrections Act for five or more years may continue to participate in the Community Corrections Act.\n(a) To assist a county or Tribal Nation that has complied with subdivision 1 and requires financial aid to defray all or a part of the expenses incurred by corrections advisory board members in discharging their official duties according to section 401.08, the commissioner may:\n(1) designate the county or Tribal Nation as a \"planning county\"; and\n(2) upon receiving a resolution by the governing board of the county or Tribal Nation certifying the need for and inability to pay the expenses under this subdivision, advance to the county or Tribal Nation an amount not to exceed five percent of the maximum quarterly subsidy for which the county or Tribal Nation is eligible.\n(b) The expenses under this subdivision must be paid in the same manner and amount as for state employees.\n(a) Any county or Tribal Nation that has qualified for participating in the subsidy program may establish, organize, and reorganize an administrative structure and:\n(1) budget, staff, and operate court services and probation;\n(2) construct or improve juvenile detention and juvenile correctional facilities and adult detention and correctional facilities; and\n(3) provide for other activities required to conform to this chapter.\n(b) No other law divests any county or Tribal Nation of the authority granted under this subdivision.\n[Repealed, 1998 c 367 art 7 s 15]\nMS 2022 [Repealed by amendment, 2023 c 52 art 17 s 16]\n(a) Nothing in this chapter relating to correctional services is intended to infringe on the sovereignty of a Tribal Nation. Notwithstanding any other law to the contrary and to the extent consistent with a Tribal Nation's sovereignty, a Tribal Nation is subject to the same requirements and has the same authority as a county participating in the subsidy program or as a non-CCA jurisdiction under this chapter.\n(b) The Department of Corrections and the Community Supervision Advisory Committee under section 401.17 must consult with Tribal Nations and offer guidance as necessary to implement and fulfill the purposes of this chapter.",
	"repealed": false
}