{
	"id": "403.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.15",
	"title": "403.15 MULTILINE TELEPHONE SYSTEM 911 REQUIREMENTS.",
	"text": "Except as otherwise provided in this section, every owner and operator of a new multistation or private branch exchange (PBX) multiline telephone system purchased after December 31, 2004, shall design and maintain the system to provide a callback number and emergency response location.\nEach multiline telephone system operator must demonstrate or otherwise inform each new telephone system user how to call for emergency assistance from that particular multiline telephone system.\nOperators of shared multiline telephone systems, whenever installed, serving residential customers shall ensure that the shared multiline telephone system is connected to the public switched network and that 911 calls from the system result in at least one distinctive automatic number identification and automatic location identification for each residential unit, except those requirements do not apply if the residential facility maintains one of the following:\n(1) automatic location identification for each respective emergency response location;\n(2) the ability to direct emergency responders to the 911 caller's location through an alternative and adequate means, such as the establishment of a 24-hour private answering point; or\n(3) a connection to a switchboard operator, attendant, or other designated on-site individual.\nOperators of hotel and motel multiline telephone systems shall permit the dialing of 911 and shall ensure that 911 calls originating from hotel or motel multiline telephone systems allow the 911 system to clearly identify the address and specific location of the 911 caller.\n(a) An operator of business multiline telephone systems connected to the public switched telephone network and serving business locations of one employer shall ensure that calls to 911 from any telephone on the system result in one of the following:\n(1) automatic location identification for each respective emergency response location;\n(2) an ability to direct emergency responders to the 911 caller's location through an alternative and adequate means, such as the establishment of a 24-hour private answering point; or\n(3) a connection to a switchboard operator, attendant, or other designated on-site individual.\n(b) Except as provided in paragraph (c), providers of multiline telephone systems serving multiple employers' business locations shall ensure that calls to 911 from any telephone result in automatic location identification for the respective emergency response location of each business location sharing the system.\n(c) Only one emergency response location is required in the following circumstances:\n(1) an employer's work space is less than 40,000 square feet, located on a single floor and on a single contiguous property;\n(2) an employer's work space is less than 7,000 square feet, located on multiple floors and on a single contiguous property; or\n(3) an employer's work space is a single public entrance, single floor facility on a single contiguous property.\nA multiline telephone system operated by a public or private educational institution, including a system serving dormitories and other residential customers, is subject to this subdivision and is not subject to subdivision 3. The operator of the education institution multiline system connected to the public switched network must ensure that calls to 911 from any telephone on the system result in one of the following:\n(1) automatic location identification for each respective emergency response location;\n(2) an ability to direct emergency responders to the 911 caller's location through an alternative and adequate means, such as the establishment of a 24-hour private answering point; or\n(3) a connection to a switchboard operator, attendant, or other designated on-site individual.\n(a) Multiline telephone systems with a single emergency response location are exempt from subdivisions 1 and 3 to 6 and section 403.07, subdivision 3.\n(b) Multiline telephone system operators that employ alternative methods of enhanced 911 support are exempt from subdivisions 1 and 3 to 6 and section 403.07, subdivision 3.\n(c) A multiline telephone system operator may apply for an exemption from the requirements in this section from the chief officer of each public safety answering point serving that jurisdiction.\nThe requirements of subdivisions 4, 5, and 6 apply to new multiline telephone systems purchased after December 31, 2004. The requirements of subdivisions 2 and 3 and the exemptions in subdivision 7 apply regardless of when the multiline telephone system was installed.",
	"repealed": false
}