{
	"id": "179.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.86",
	"title": "179.86 PACKINGHOUSE WORKERS BILL OF RIGHTS.",
	"text": "For the purpose of this section, \"employer\" means an employer in the meatpacking or poultry processing industry.\nAn employer must furnish its employees with equipment to safely perform their jobs under OSHA standards.\n(a) At the start of employment, an employer must provide an explanation in an employee's native language of the employee's rights and duties as an employee both person to person and through written materials that, at a minimum, include:\n(1) a complete description of the salary and benefits plans as they relate to the employee;\n(2) a job description for the employee's position;\n(3) a description of leave policies;\n(4) a description of the work hours and work hours policy;\n(5) a description of the occupational hazards known to exist for the position; and\n(6) when workers' compensation insurance coverage is required by chapter 176, the name of the employer's workers' compensation insurance carrier, the carrier's phone number, and the insurance policy number.\n(b) The explanation must also include information on the following employee rights as protected by state or federal law and a description of where additional information about those rights may be obtained:\n(1) the right to organize and bargain collectively and refrain from organizing and bargaining collectively;\n(2) the right to a safe workplace;\n(3) the right to be free from discrimination; and\n(4) the right to workers' compensation insurance coverage.\n(c) The Department of Labor and Industry shall provide a standard explanation form for use at the employer's option for providing the information required in this subdivision. The form shall be available in English and Spanish and additional languages upon request.\n(d) The requirements under this subdivision are in addition to the requirements under section 181.032.\nThe commissioner of labor and industry in consultation with the commissioner of human rights must develop and implement a strategy to assist employers in providing adequate notice and education to employees of their rights under this section. The commissioner shall assign the duty to implement the strategy to a specific identified position in the department. The position, along with contact information, must be included on printed materials the department prepares and distributes to carry out the commissioner's duties under this section.\nAn employee injured by a violation of this section has a cause of action for damages for the greater of $1,000 per violation or twice the employee's actual damages, plus costs and reasonable attorney fees. A damage award shall be the greater of $1,400 or three times actual damages for an employee injured by an intentional violation of this section.\nThe commissioner of labor and industry shall fine an employer not less than $400 or more than $1,000 for each violation of subdivision 3. The fine shall be payable to the employee aggrieved.",
	"repealed": false
}