{
	"id": "144.2151",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.2151",
	"title": "144.2151 FETAL DEATH RECORD AND CERTIFICATE OF BIRTH RESULTING IN STILLBIRTH.",
	"text": "A fetal death record must be established for each fetal death reported and registered under section 144.222, subdivision 1.\nThe party responsible for filing a fetal death report under section 144.222, subdivision 1, shall advise the parent or parents of a stillbirth:\n(1) that the parent or parents may choose to provide a full name or provide only a last name for the record;\n(2) that the parent or parents may request a certificate of birth resulting in stillbirth after the fetal death record is established;\n(3) that the parent who gave birth may request an informational copy of the fetal death record; and\n(4) that the parent or parents named on the fetal death record and the party responsible for reporting the fetal death may correct or amend the record to protect the integrity and accuracy of vital records.\nThe state registrar shall:\n(1) prescribe the process to:\n(i) register a fetal death;\n(ii) request the certificate of birth resulting in stillbirth; and\n(iii) request the informational copy of a fetal death record;\n(2) prescribe a standardized format for the certificate of birth resulting in stillbirth, which shall integrate security features and be as similar as possible to a birth certificate;\n(3) issue a certificate of birth resulting in stillbirth or a statement of no vital record found to the parent or parents named on the fetal death record upon the parent's proper completion of an attestation provided by the commissioner and payment of the required fee;\n(4) correct or amend the fetal death record upon a request from the parent who gave birth, parents, or the person who registered the fetal death or filed the report; and\n(5) refuse to amend or correct the fetal death record when an applicant does not submit the minimum documentation required to amend the record or when the state registrar has cause to question the validity or completeness of the applicant's statements or any documentary evidence and the deficiencies are not corrected. The state registrar shall advise the applicant of the reason for this action and shall further advise the applicant of the right of appeal to a court with competent jurisdiction over the Department of Health.\nIf a fetal death occurred in this state at any time for which a fetal death report was required under section 144.222, subdivision 1, but a fetal death was not registered and a record was not established, a person responsible for registering the fetal death, the medical examiner or coroner with jurisdiction, or a parent may submit to the state registrar a written request to register the fetal death and submit the evidence to support the request.\nMS 2022 [Repealed by amendment, 2023 c 70 art 3 s 4]",
	"repealed": false
}