{
	"id": "182.669",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.669",
	"title": "182.669 DISCRIMINATION.",
	"text": "Any employee believed to have been discharged or otherwise discriminated against by any person because the employee has exercised any right authorized under the provisions of sections 182.65 to 182.674, may, within 30 days after the alleged discrimination occurs, file a complaint with the commissioner alleging the discriminatory act. Upon receipt of the complaint, the commissioner shall cause an investigation to be made as the commissioner deems appropriate. If upon such investigation the commissioner determines that a discriminatory act was committed against an employee, the commissioner shall refer the matter to the Office of Administrative Hearings for a hearing before an administrative law judge pursuant to the provisions of chapter 14. Communications between discrimination complainants and attorneys representing the commissioner are privileged as would be communications between an attorney and a client. For purposes of this section, the commissioner shall file with the administrative law judge and serve upon the respondent, by registered or certified mail, a complaint and written notice of hearing. The respondent shall file with the administrative law judge and serve upon the commissioner, by registered or certified mail, an answer within 20 days after service of the complaint. In all cases where the administrative law judge finds that an employee has been discharged or otherwise discriminated against by any person because the employee has exercised any right authorized under sections 182.65 to 182.674, the administrative law judge may order payment to the employee of back pay and compensatory damages. The administrative law judge may also order rehiring of the employee; reinstatement of the employee's former position, fringe benefits, and seniority rights; and other appropriate relief. In addition, the administrative law judge may order payment to the commissioner or to the employee of costs, disbursements, witness fees, and attorney fees. Interest shall accrue on, and be added to, the unpaid balance of an administrative law judge's order from the date the order is signed by the administrative law judge until it is paid, at the annual rate provided in section 549.09, subdivision 1, paragraph (c). An employee may bring a private action in the district court for relief under this section.\n[Repealed, 1975 c 343 s 2]\n[Repealed, 1975 c 343 s 2]\n[Repealed, 1975 c 343 s 2]\n[Repealed, 1975 c 343 s 2]\n[Repealed, 1975 c 343 s 2]",
	"repealed": false
}