{
	"id": "297A.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.70",
	"title": "297A.70 EXEMPTIONS FOR GOVERNMENTS AND NONPROFIT GROUPS.",
	"text": "(a) To the extent provided in this section, the gross receipts from sales of items to or by, and storage, distribution, use, or consumption of items by the organizations or units of local government listed in this section are specifically exempted from the taxes imposed by this chapter.\n(b) Notwithstanding any law to the contrary enacted before 1992, only sales to governments and political subdivisions listed in this section are exempt from the taxes imposed by this chapter.\n(c) \"Sales\" includes purchases under an installment contract or lease purchase agreement under section 465.71.\n(a) All sales, except those listed in paragraph (b), to the following governments and political subdivisions, or to the listed agencies or instrumentalities of governments and political subdivisions, are exempt:\n(1) the United States and its agencies and instrumentalities;\n(2) school districts, local governments, the University of Minnesota, state universities, community colleges, technical colleges, state academies, the Perpich Minnesota Center for Arts Education, and an instrumentality of a political subdivision that is accredited as an optional/special function school by the North Central Association of Colleges and Schools;\n(3) hospitals and nursing homes owned and operated by political subdivisions of the state of tangible personal property and taxable services used at or by hospitals and nursing homes;\n(4) other states or political subdivisions of other states, if the sale would be exempt from taxation if it occurred in that state; and\n(5) public libraries, public library systems, multicounty, multitype library systems as defined in section 134.001, county law libraries under chapter 134A, state agency libraries, the state library under section 480.09, and the Legislative Reference Library.\n(b) This exemption does not apply to the sales of the following products and services:\n(1) building, construction, or reconstruction materials purchased by a contractor or a subcontractor as a part of a lump-sum contract or similar type of contract with a guaranteed maximum price covering both labor and materials for use in the construction, alteration, or repair of a building or facility;\n(2) construction materials purchased by tax exempt entities or their contractors to be used in constructing buildings or facilities which will not be used principally by the tax exempt entities;\n(3) the leasing of a motor vehicle as defined in section 297B.01, subdivision 11, except for leases entered into by the United States or its agencies or instrumentalities;\n(4) lodging as defined under section 297A.61, subdivision 3, paragraph (g), clause (2), prepared food, candy, soft drinks, alcoholic beverages as defined in section 297A.67, subdivision 2, and taxable cannabis products as defined under section 295.81, subdivision 1, paragraph (r), except for lodging, prepared food, candy, soft drinks, alcoholic beverages, and taxable cannabis products purchased directly by the United States or its agencies or instrumentalities; or\n(5) goods or services purchased by a local government as inputs to a liquor store, taxable cannabis product retailer as defined under section 295.81, subdivision 1, paragraph (p), gas or electric utility, solid waste hauling service, solid waste recycling service, landfill, golf course, marina, campground, cafe, or laundromat.\n(c) As used in this subdivision, \"school districts\" means public school entities and districts of every kind and nature organized under the laws of the state of Minnesota, and any instrumentality of a school district, as defined in section 471.59.\n(d) For purposes of the exemption granted under this subdivision, \"local governments\" has the following meaning:\n(1) for the period prior to January 1, 2017, local governments means statutory or home rule charter cities, counties, and townships; and\n(2) beginning January 1, 2017, local governments means statutory or home rule charter cities, counties, and townships; special districts as defined under section 6.465; any instrumentality of a statutory or home rule charter city, county, or township as defined in section 471.59; and any joint powers board or organization created under section 471.59.\n(a) The following sales to or use by the specified governments and political subdivisions of the state are exempt:\n(1) repair and replacement parts for emergency rescue vehicles, fire trucks, and fire apparatus to a political subdivision;\n(2) machinery and equipment, except for motor vehicles, used directly for mixed municipal solid waste management services at a solid waste disposal facility as defined in section 115A.03, subdivision 10;\n(3) chore and homemaking services to a political subdivision of the state to be provided to elderly individuals or persons with a disability;\n(4) telephone services to the Department of Information Technology Services that are used to provide telecommunications services through the MNIT services revolving fund;\n(5) firefighter personal protective equipment as defined in paragraph (b), if purchased or authorized by and for the use of an organized fire department, fire protection district, or fire company regularly charged with the responsibility of providing fire protection to the state or a political subdivision;\n(6) bullet-resistant body armor that provides the wearer with ballistic and trauma protection, if purchased by a law enforcement agency of the state or a political subdivision of the state, or a licensed peace officer, as defined in section 626.84, subdivision 1;\n(7) motor vehicles purchased or leased by political subdivisions of the state if the vehicles are exempt from registration under section 168.012, subdivision 1, paragraph (b), exempt from taxation under section 473.448, or exempt from the motor vehicle sales tax under section 297B.03, clause (12);\n(8) equipment designed to process, dewater, and recycle biosolids for wastewater treatment facilities of political subdivisions, and materials incidental to installation of that equipment;\n(9) the removal of trees, bushes, or shrubs for the construction and maintenance of roads, trails, or firebreaks when purchased by an agency of the state or a political subdivision of the state;\n(10) purchases by the Metropolitan Council or the Department of Transportation of vehicles and repair parts to equip operations provided for in section 174.90, including, but not limited to, the Northstar Corridor Rail project; and\n(11) purchases of water used directly in providing public safety services by an organized fire department, fire protection district, or fire company regularly charged with the responsibility of providing fire protection to the state or a political subdivision.\n(b) For purposes of this subdivision, \"firefighters personal protective equipment\" means helmets, including face shields, chin straps, and neck liners; bunker coats and pants, including pant suspenders; boots; gloves; head covers or hoods; wildfire jackets; protective coveralls; goggles; self-contained breathing apparatus; canister filter masks; personal alert safety systems; spanner belts; optical or thermal imaging search devices; and all safety equipment required by the Occupational Safety and Health Administration.\n(c) For purchases of items listed in paragraph (a), clause (10), the tax must be imposed and collected as if the rate under section 297A.62, subdivision 1, applied and then refunded in the manner provided in section 297A.75.\n(a) All sales, except those listed in paragraph (b), to the following \"nonprofit organizations\" are exempt:\n(1) a corporation, society, association, foundation, or institution organized and operated exclusively for charitable, religious, or educational purposes if the item purchased is used in the performance of charitable, religious, or educational functions;\n(2) any senior citizen group or association of groups that:\n(i) in general limits membership to persons who are either age 55 or older, or persons with a physical disability;\n(ii) is organized and operated exclusively for pleasure, recreation, and other nonprofit purposes, not including housing, no part of the net earnings of which inures to the benefit of any private shareholders; and\n(iii) is an exempt organization under section 501(c) of the Internal Revenue Code; and\n(3) an organization that qualifies for an exemption for memberships under subdivision 12 if the item is purchased and used in the performance of the organization's mission.\nFor purposes of this subdivision, charitable purpose includes the maintenance of a cemetery owned by a religious organization.\n(b) This exemption does not apply to the following sales:\n(1) building, construction, or reconstruction materials purchased by a contractor or a subcontractor as a part of a lump-sum contract or similar type of contract with a guaranteed maximum price covering both labor and materials for use in the construction, alteration, or repair of a building or facility;\n(2) construction materials purchased by tax-exempt entities or their contractors to be used in constructing buildings or facilities that will not be used principally by the tax-exempt entities;\n(3) lodging as defined under section 297A.61, subdivision 3, paragraph (g), clause (2), prepared food, candy, soft drinks, taxable cannabis products as defined under section 295.81, subdivision 1, paragraph (r), and alcoholic beverages as defined in section 297A.67, subdivision 2, except wine purchased by an established religious organization for sacramental purposes or as allowed under subdivision 9a; and\n(4) leasing of a motor vehicle as defined in section 297B.01, subdivision 11, except as provided in paragraph (c).\n(c) This exemption applies to the leasing of a motor vehicle as defined in section 297B.01, subdivision 11, only if the vehicle is:\n(1) a truck, as defined in section 168.002, a bus, as defined in section 168.002, or a passenger automobile, as defined in section 168.002, if the automobile is designed and used for carrying more than nine persons including the driver; and\n(2) intended to be used primarily to transport tangible personal property or individuals, other than employees, to whom the organization provides service in performing its charitable, religious, or educational purpose.\n(d) A limited liability company also qualifies for exemption under this subdivision if (1) it consists of a sole member that would qualify for the exemption, and (2) the items purchased qualify for the exemption.\nSales to an organization of military service veterans or an auxiliary unit of an organization of military service veterans are exempt if:\n(1) the organization or auxiliary unit is organized within the state of Minnesota and is exempt from federal taxation under section 501(c), clause (19), of the Internal Revenue Code; and\n(2) the tangible personal property or services are for charitable, civic, educational, or nonprofit uses and not for social, recreational, pleasure, or profit uses.\nThe lease of a motor vehicle by an ambulance service licensed under section 144E.10 that is equipped and specifically intended for emergency response or for providing ambulance services is exempt.\n(a) Sales, except for those listed in paragraph (f), to a hospital are exempt, if the items purchased are used in providing hospital services. For purposes of this subdivision, \"hospital\" means a hospital organized and operated for charitable purposes within the meaning of section 501(c)(3) of the Internal Revenue Code, and licensed under chapter 144 or by any other jurisdiction, and \"hospital services\" are services authorized or required to be performed by a \"hospital\" under chapter 144.\n(b) Sales, except for those listed in paragraph (f), to an outpatient surgical center are exempt, if the items purchased are used in providing outpatient surgical services. For purposes of this subdivision, \"outpatient surgical center\" means an outpatient surgical center organized and operated for charitable purposes within the meaning of section 501(c)(3) of the Internal Revenue Code, and licensed under chapter 144 or by any other jurisdiction. For the purposes of this subdivision, \"outpatient surgical services\" means: (1) services authorized or required to be performed by an outpatient surgical center under chapter 144; and (2) urgent care. For purposes of this subdivision, \"urgent care\" means health services furnished to a person whose medical condition is sufficiently acute to require treatment unavailable through, or inappropriate to be provided by, a clinic or physician's office, but not so acute as to require treatment in a hospital emergency room.\n(c) Sales, except for those listed in paragraph (f), to a critical access dental provider are exempt, if the items purchased are used in providing critical access dental care services. For the purposes of this subdivision, \"critical access dental provider\" means a dentist or dental clinic that qualifies under section 256B.76, subdivision 4, paragraph (b), and, in the previous calendar year, had no more than 15 percent of its patients covered by private dental insurance.\n(d) Sales, except for those listed in paragraph (f), to a blood center are exempt, if the items purchased are used in providing blood collection and distribution services. Notwithstanding paragraph (f), leases by a blood center of a truck, as defined in section 168.002; a bus, as defined in section 168.002; or a passenger automobile, as defined in section 168.002, if the truck, bus, or automobile is used for carrying out the purposes of the blood center, including the collection of blood from donors, setting up of blood drives, and delivering blood to hospitals are exempt. For purposes of this subdivision, \"blood center\" means an entity organized and operated for charitable purposes under section 501(c)(3) of the Internal Revenue Code that is:\n(1) registered as a blood establishment pursuant to Code of Federal Regulations, title 21, part 607;\n(2) a human cells, tissues, and cellular and tissue-based products establishment under Code of Federal Regulations, title 21, part 1271, subpart B; or\n(3) a clinical lab that performs infectious disease testing, blood typing, and other laboratory testing services in connection with blood processing for transfusion into humans under Code of Federal Regulations, title 42, part 493.\n(e) The exemption provided under paragraph (d) expires January 1, 2028.\n(f) This exemption does not apply to the following products and services:\n(1) purchases made by a clinic, physician's office, or any other medical facility not operating as a hospital, outpatient surgical center, critical access dental provider, or blood center, even though the clinic, office, or facility may be owned and operated by a hospital, outpatient surgical center, critical access dental provider, or blood center;\n(2) sales under section 297A.61, subdivision 3, paragraph (g), clause (2), and prepared food, candy, and soft drinks;\n(3) building and construction materials used in constructing buildings or facilities that will not be used principally by the hospital, outpatient surgical center, critical access dental provider, or blood center;\n(4) building, construction, or reconstruction materials purchased by a contractor or a subcontractor as a part of a lump-sum contract or similar type of contract with a guaranteed maximum price covering both labor and materials for use in the construction, alteration, or repair of a hospital, outpatient surgical center, critical access dental provider, or blood center; or\n(5) the leasing of a motor vehicle as defined in section 297B.01, subdivision 11.\n(g) A limited liability company also qualifies for exemption under this subdivision if (1) it consists of a sole member that would qualify for the exemption, and (2) the items purchased qualify for the exemption.\n(h) An entity that contains both a hospital and a nonprofit unit may claim this exemption on purchases made for both the hospital and nonprofit unit provided that:\n(1) the nonprofit unit would have qualified for exemption under subdivision 4; and\n(2) the items purchased would have qualified for the exemption.\nProducts and services including, but not limited to, end user equipment used for construction, ownership, operation, maintenance, and enhancement of the backbone system of the regionwide public safety radio communication system established under sections 403.21 to 403.40, are exempt. For purposes of this subdivision, backbone system is defined in section 403.21, subdivision 9. This subdivision is effective for purchases, sales, storage, use, or consumption for use in the first and second phases of the system, as defined in section 403.21, subdivisions 3, 10, and 11, that portion of the third phase of the system that is located in the southeast district of the State Patrol and the counties of Benton, Sherburne, Stearns, and Wright, and that portion of the system that is located in Itasca County.\nWine for sacramental purposes in religious ceremonies, as described in section 340A.316, is exempt if the wine is purchased from a nonprofit religious organization meeting the requirements of subdivision 4 or from a person authorized to import sacramental wine without a license as provided in section 340A.316.\n(a) Sales of lodging, prepared food, candy, soft drinks, and alcoholic beverages at noncatered events between an established religious order and an affiliated institution of higher education are exempt.\n(b) For purposes of this subdivision, \"established religious order\" means an organization directly or indirectly under the control or supervision of a church or convention or association of churches, where members of the organization:\n(1) normally live together as part of a community;\n(2) make long-term commitments to live under a strict set of moral and spiritual rules; and\n(3) work or engage full time in a combination of prayer, religious study, church reform or renewal, or other religious, educational, or charitable goals of the organization.\n(c) For purposes of this subdivision, an institution of higher education is \"affiliated\" with an established religious order if members of the religious order are represented on the governing board of the institution of higher education and the two organizations share campus space and common facilities.\n(a) Tickets or admissions to an event are exempt if all the gross receipts are recorded as such, in accordance with generally accepted accounting principles, on the books of one or more organizations whose primary mission is to provide an opportunity for citizens of the state to participate in the creation, performance, or appreciation of the arts, and provided that each organization is:\n(1) an organization described in section 501(c)(3) of the Internal Revenue Code in which voluntary contributions make up at least five percent of the organization's annual revenue in its most recently completed 12-month fiscal year, or in the current year if the organization has not completed a 12-month fiscal year;\n(2) a municipal board that promotes cultural and arts activities; or\n(3) the University of Minnesota, a state college and university, or a private nonprofit college or university provided that the event is held at a facility owned by the educational institution holding the event.\nThe exemption only applies if the entire proceeds, after reasonable expenses, are used solely to provide opportunities for citizens of the state to participate in the creation, performance, or appreciation of the arts.\n(b) Tickets or admissions to the premises of the Minnesota Zoological Garden are exempt, provided that the exemption under this paragraph does not apply to tickets or admissions to performances or events held on the premises unless the performance or event is sponsored and conducted exclusively by the Minnesota Zoological Board or employees of the Minnesota Zoological Garden.\n(c) Tickets or admissions to a performance or event on the premises of a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code are exempt if:\n(1) the nonprofit organization was established to preserve Minnesota's rural agricultural heritage and focuses on educating the public about rural history and how farms in Minnesota helped to provide food for the nation and the world;\n(2) the premises of the nonprofit organization is at least 115 acres;\n(3) the performance or event is sponsored and conducted exclusively by volunteers, employees of the nonprofit organization, or members of the board of directors of the nonprofit organization; and\n(4) the performance or event is consistent with the nonprofit organization's purposes under section 501(c)(3) of the Internal Revenue Code.\nTickets or admissions to regular season school games, events, and activities are exempt. For purposes of this subdivision, \"school\" has the meaning given it in section 120A.22, subdivision 4.\nTickets and admissions to games, events, and activities sponsored by the Minnesota State High School League under chapter 128C are exempt.\n[See Note.]\n(a) The sale of memberships, meaning both onetime initiation fees and periodic membership dues, to an association incorporated under section 315.44 or an organization defined under section 315.51, or a nonprofit organization offering similar services are exempt. However, all separate charges made for the privilege of having access to and the use of the association's sports and athletic facilities are taxable.\n(b) For purposes of this subdivision, a \"nonprofit organization offering similar services\" means an exempt organization under section 501(c)(3) of the Internal Revenue Code whose mission is to support youth and families through a variety of activities, including membership allowing access to athletic facilities, and who provides free or reduced-price memberships to seniors or low-income persons or families.\n(a) The following sales by the specified organizations for fundraising purposes are exempt, subject to the limitations listed in paragraph (b):\n(1) all sales made by a nonprofit organization that exists solely for the purpose of providing educational or social activities for young people primarily age 18 and under;\n(2) all sales made by an organization that is a senior citizen group or association of groups if (i) in general it limits membership to persons age 55 or older; (ii) it is organized and operated exclusively for pleasure, recreation, and other nonprofit purposes; and (iii) no part of its net earnings inures to the benefit of any private shareholders;\n(3) the sale or use of tickets or admissions to a golf tournament held in Minnesota if the beneficiary of the tournament's net proceeds qualifies as a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code; and\n(4) sales of candy sold for fundraising purposes by a nonprofit organization that provides educational and social activities primarily for young people age 18 and under.\n(b) The exemptions listed in paragraph (a) are limited in the following manner:\n(1) the exemption under paragraph (a), clauses (1) and (2), applies only to the first $20,000 of the gross annual receipts of the organization from fundraising;\n(2) the exemption under paragraph (a), clause (1), does not apply if the sales are derived from admission charges or from activities for which the money must be deposited with the school district treasurer under section 123B.49, subdivision 2; and\n(3) the exemption under paragraph (a), clause (1), does not apply if the sales are derived from admission charges or from activities for which the money must be recorded in the same manner as other revenues or expenditures of the school district under section 123B.49, subdivision 4, unless the following conditions are both met:\n(i) the sales are made for fundraising purposes of a club, association, or other organization of elementary or secondary school students organized for the purpose of carrying on sports activities, educational activities, or other extracurricular activities; and\n(ii) the school district reserves revenue raised for extracurricular activities, as provided in section 123B.49, subdivision 4, paragraph (e), and spends the revenue raised by a particular extracurricular activity only for that extracurricular activity.\n(c) Sales of tangible personal property and services are exempt if the entire proceeds, less the necessary expenses for obtaining the property or services, will be contributed to a registered combined charitable organization described in section 43A.50, to be used exclusively for charitable, religious, or educational purposes, and the registered combined charitable organization has given its written permission for the sale. Sales that occur over a period of more than 24 days per year are not exempt under this paragraph.\n(d) For purposes of this subdivision, a club, association, or other organization of elementary or secondary school students organized for the purpose of carrying on sports, educational, or other extracurricular activities is a separate organization from the school district or school for purposes of applying the $20,000 limit.\n(a) Sales of tangible personal property or services at, and admission charges for fundraising events sponsored by, a nonprofit organization are exempt if:\n(1) all gross receipts are recorded as such, in accordance with generally accepted accounting practices, on the books of the nonprofit organization; and\n(2) the entire proceeds, less the necessary expenses for the event, will be used solely and exclusively for charitable, religious, or educational purposes. Exempt sales include the sale of prepared food, candy, and soft drinks at the fundraising event.\n(b) This exemption is limited in the following manner:\n(1) it does not apply to admission charges for events involving bingo or other gambling activities or to charges for use of amusement devices involving bingo or other gambling activities;\n(2) all gross receipts are taxable if the profits are not used solely and exclusively for charitable, religious, or educational purposes;\n(3) it does not apply unless the organization keeps a separate accounting record, including receipts and disbursements from each fundraising event that documents all deductions from gross receipts with receipts and other records;\n(4) it does not apply to any sale made by or in the name of a nonprofit corporation as the active or passive agent of a person that is not a nonprofit corporation;\n(5) all gross receipts are taxable if fundraising events exceed 24 days per year;\n(6) it does not apply to fundraising events conducted on premises leased for more than ten days but less than 30 days; and\n(7) it does not apply if the risk of the event is not borne by the nonprofit organization and the benefit to the nonprofit organization is less than the total amount of the state and local tax revenues forgone by this exemption.\n(c) For purposes of this subdivision, a \"nonprofit organization\" means any unit of government, corporation, society, association, foundation, or institution organized and operated for charitable, religious, educational, civic, fraternal, and senior citizens' or veterans' purposes, no part of the net earnings of which inures to the benefit of a private individual.\n(d) For purposes of this subdivision, \"fundraising events\" means activities of limited duration, not regularly carried out in the normal course of business, that attract patrons for community, social, and entertainment purposes, such as auctions, bake sales, ice cream socials, block parties, carnivals, competitions, concerts, concession stands, craft sales, bazaars, dinners, dances, door-to-door sales of merchandise, fairs, fashion shows, festivals, galas, special event workshops, sporting activities such as marathons and tournaments, and similar events. Fundraising events do not include the operation of a regular place of business in which services are provided or sales are made during regular hours such as bookstores, thrift stores, gift shops, restaurants, ongoing Internet sales, regularly scheduled classes, or other activities carried out in the normal course of business.\nNotwithstanding section 297A.61, subdivision 3, or any other provision of this chapter, the gross receipts from the following sales made to or by a nonprofit corporation designated by the Minnesota Amateur Sports Commission to conduct a series of statewide amateur athletic games and related events, workshops, and clinics are exempt:\n(1) sales of tangible personal property to or the storage, use, or other consumption of tangible personal property by the nonprofit corporation; and\n(2) sales of tangible personal property, admission charges, and sales of prepared food, candy, and soft drinks by the nonprofit corporation at fundraising events, athletic events, or athletic facilities.\nFees to camps or other recreation facilities are exempt for:\n(1) services primarily for children, adults accompanying children, or persons with a disability; or\n(2) educational or religious activities;\nif the camp or facilities are owned and operated by an exempt organization under section 501(c)(3) of the Internal Revenue Code.\nPrivate communication service, as defined in section 297A.61, subdivision 26, is exempt if the service is purchased by an agent acting on behalf of the State Lottery.\n(a) All sales, except those listed in paragraph (b), to a nursing home licensed under section 144A.02 or a boarding care home certified as a nursing facility under title 19 of the Social Security Act are exempt if the facility:\n(1) is exempt from federal income taxation pursuant to section 501(c)(3) of the Internal Revenue Code; and\n(2) is certified to participate in the medical assistance program under title 19 of the Social Security Act, or certifies to the commissioner that it does not discharge residents due to the inability to pay.\n(b) This exemption does not apply to the following sales:\n(1) building, construction, or reconstruction materials purchased by a contractor or a subcontractor as a part of a lump-sum contract or similar type of contract with a guaranteed maximum price covering both labor and materials for use in the construction, alteration, or repair of a building or facility;\n(2) construction materials purchased by tax-exempt entities or their contractors to be used in constructing buildings or facilities that will not be used principally by the tax-exempt entities;\n(3) lodging as defined under section 297A.61, subdivision 3, paragraph (g), clause (2), prepared food, candy, soft drinks, and alcoholic beverages as defined in section 297A.67, subdivision 2, and taxable cannabis products as defined under section 295.81, subdivision 1, paragraph (r); and\n(4) leasing of a motor vehicle as defined in section 297B.01, subdivision 11, except as provided in paragraph (c).\n(c) This exemption applies to the leasing of a motor vehicle as defined in section 297B.01, subdivision 11, only if the vehicle is:\n(1) a truck, as defined in section 168.002; a bus, as defined in section 168.002; or a passenger automobile, as defined in section 168.002, if the automobile is designed and used for carrying more than nine persons including the driver; and\n(2) intended to be used primarily to transport tangible personal property or residents of the nursing home or boarding care home.\nSales of tangible personal property to a nonprofit snowmobile club that is used primarily and directly for the grooming of state or grant-in-aid snowmobile trails are exempt. The exemption applies to grooming machines, attachments, other associated accessories, and repair parts. A nonprofit snowmobile club is eligible for the exemption under this subdivision if it received, in the current year or in the previous three-year period, a state grant-in-aid maintenance and grooming grant administered by the Department of Natural Resources by applying for the grant with a local unit of government sponsor.\nSales to organizations that exist primarily for the purpose of owning or operating ice arenas or rinks that are (1) part of either the Duluth Heritage Sports Center or the David M. Thaler Sports Center; and (2) are used for youth and high school programs, are exempt if the organization is a private, nonprofit corporation exempt from federal income taxation under section 501(c)(3) of the Internal Revenue Code.\n(a) The following sales by a county agricultural society are exempt:\n(1) admissions to and parking at the county fairgrounds;\n(2) admissions to separately ticketed events run by the county agricultural society; and\n(3) concessions and other sales made by employees or volunteers of the county agricultural society on the county fairgrounds.\n(b) The exemption under paragraph (a) does not apply to sales for events held at a time other than at the time of the regularly scheduled county fair, or events not held on the county fairgrounds.",
	"repealed": false
}