{
	"id": "275.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.025",
	"title": "275.025 STATE GENERAL TAX.",
	"text": "The state general levy is levied against commercial-industrial property and seasonal residential recreational property, as defined in this section. The state general levy for commercial-industrial property is $716,990,000 for taxes payable in 2023 and thereafter. The state general levy for seasonal-recreational property is $41,690,000 for taxes payable in 2020 and thereafter. The tax under this section is not treated as a local tax rate under section 469.177 and is not the levy of a governmental unit under chapters 276A and 473F.\nThe commissioner shall increase or decrease the preliminary or final rate for a year as necessary to account for errors and tax base changes that affected a preliminary or final rate for either of the two preceding years. Adjustments are allowed to the extent that the necessary information is available to the commissioner at the time the rates for a year must be certified, and for the following reasons:\n(1) an erroneous report of taxable value by a local official;\n(2) an erroneous calculation by the commissioner; and\n(3) an increase or decrease in taxable value for commercial-industrial or seasonal residential recreational property reported to the commissioner under section 270C.85, subdivision 2, clause (4), for the same year.\nThe commissioner may, but need not, make adjustments if the total difference in the tax levied for the year would be less than $100,000.\nFor the purposes of this section, \"commercial-industrial tax capacity\" means the tax capacity of all taxable property classified as class 3 or class 5(1) under section 273.13, excluding:\n(1) the tax capacity attributable to the first $150,000 of market value of each parcel of commercial-industrial property as defined under section 273.13, subdivision 24, clauses (1), (2), and (4);\n(2) electric generation attached machinery under class 3; and\n(3) property described in section 473.625.\nCounty commercial-industrial tax capacity amounts are not adjusted for the captured net tax capacity of a tax increment financing district under section 469.177, subdivision 2, the net tax capacity of transmission lines deducted from a local government's total net tax capacity under section 273.425, or fiscal disparities contribution and distribution net tax capacities under chapter 276A or 473F. For purposes of this subdivision, the procedures for determining eligibility for tier 1 under section 273.13, subdivision 24, clauses (1) and (2), shall apply in determining the portion of a property eligible to be considered within the first $150,000 of market value.\nFor the purposes of this section, \"seasonal residential recreational tax capacity\" means the tax capacity of tier III of class 1c under section 273.13, subdivision 22, and all class 4c(1), 4c(3)(ii), and 4c(12) property under section 273.13, subdivision 25, except that the first $76,000 of market value of each noncommercial class 4c(12) property has a tax capacity for this purpose equal to 40 percent of its tax capacity under section 273.13.\nThe state general tax must be levied by applying a uniform rate to all commercial-industrial tax capacity and a uniform rate to all seasonal residential recreational tax capacity. On or before October 1 each year, the commissioner of revenue shall certify the preliminary state general levy rates to each county auditor that must be used to prepare the notices of proposed property taxes for taxes payable in the following year. By January 1 of each year, the commissioner shall certify the final state general levy rates to each county auditor that shall be used in spreading taxes.\n(a) Any municipality that:\n(1) lies wholly or partially within the metropolitan area as defined under section 473.121, subdivision 2, but outside the transit taxing district as defined under section 473.446, subdivision 2; and\n(2) has a net fiscal disparities contribution equal to or greater than eight percent of its total taxable net tax capacity,\nis eligible for a distribution from the proceeds of the state general levy imposed on taxpayers within the municipality.\n(b) The distribution is equal to (1) the municipality's net tax capacity tax rate, times (2) the municipality's net fiscal disparities contribution in excess of eight percent of its total taxable net tax capacity; provided, however, that the distribution may not exceed the tax under this section imposed on taxpayers within the municipality. The amount of the distribution to each municipality must be determined by the commissioner of revenue and certified to each affected municipality and county by September 1 of the year in which taxes are payable.\n(c) The distribution under this subdivision must be paid to the qualifying municipality by the treasurer of the home county of the municipality by December 1 of the year the taxes are payable. The amounts distributed under this subdivision must be deducted from the settlement of the state general levy for the taxes payable year under section 276.112.\n(d) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Municipality\" means a home rule or statutory city, or a town, except that in the case of a city that lies only partially within the metropolitan area, municipality means the portion of the city lying within the metropolitan area.\n(2) \"Net fiscal disparities contribution\" means a municipality's fiscal disparities contribution tax capacity minus its distribution net tax capacity.\n(3) \"Total taxable net tax capacity\" means the total net tax capacity of all properties in the municipality under section 273.13 minus (i) the net fiscal disparities contribution, and (ii) the municipality's tax increment captured net tax capacity.\n(a) The county must abate the state general levy on personal property that is part of an intrastate natural gas transportation or distribution pipeline system if:\n(1) construction of the pipeline system commenced after January 1, 2018; and\n(2) the pipeline system provides service to an area:\n(i) outside the seven-county metropolitan area, as defined in section 473.121, subdivision 4; and\n(ii) in which more than half of the households or businesses lacked access to natural gas distribution systems as of January 1, 2018.\n(b) In the first year that a taxpayer seeks an abatement under this subdivision, the taxpayer must file an application with the commissioner of revenue by March 1 of the assessment year on a form prescribed by the commissioner.\n(c) The commissioner of revenue must notify any affected county in the first year that a pipeline system becomes eligible for an abatement under this subdivision.\n(d) The abatement under this subdivision applies for a period not to exceed 12 taxable years, provided that once a property no longer qualifies, it may not subsequently qualify for an abatement under this subdivision.",
	"repealed": false
}