{
	"id": "115A.0716",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.0716",
	"title": "115A.0716 ENVIRONMENTAL ASSISTANCE GRANT AND LOAN PROGRAM.",
	"text": "(a) The commissioner may make grants to any person for the purpose of researching, developing, and implementing projects or practices related to collection, processing, recycling, reuse, resource recovery, source reduction, and prevention of waste, hazardous substances, toxic pollutants, and problem materials; the development or implementation of pollution prevention projects or practices; the collection, recovery, processing, purchasing, or market development of recyclable materials or compost; resource conservation; and for environmental education.\n(b) In making grants, the agency may give priority to projects or practices that have broad application in the state and are consistent with the policies established under sections 115A.02 and 115D.02.\n(c) The commissioner shall adopt rules to administer the grant program.\n(d) For the purposes of this section:\n(1) \"pollution prevention\" has the meaning given it in section 115D.03;\n(2) \"toxic pollutant\" has the meaning given it in section 115D.03; and\n(3) \"hazardous substance\" has the meaning given it in section 115D.03.\n(a) The commissioner may make loans, or participate in loans, for capital costs or improvements related to any of the activities listed in subdivision 1.\n(b) The commissioner may work with financial institutions or other financial assistance providers in participating in loans under this section. The commissioner may contract with financial institutions or other financial assistance providers for loan processing and/or administration.\n(c) The commissioner may also make grants, as authorized in subdivision 1, to enable persons to receive loans from financial institutions or to reduce interest payments for those loans.\n(d) In making loans, the agency may give priority to projects or practices that have broad application in the state and are consistent with the policies established under sections 115A.02 and 115D.02.\n(e) The commissioner shall adopt rules to administer the loan program.\nAll repayments of loans awarded under this section, including principal and interest, must be credited to the environmental fund. Money deposited in the fund under this section is annually appropriated to the commissioner for loans for purposes identified in subdivisions 1 and 2.",
	"repealed": false
}