{
	"id": "116L.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.361",
	"title": "116L.361 DEFINITIONS.",
	"text": "For the purposes of sections 116L.361 to 116L.366, the following terms have the meanings given them.\n[Repealed, 2014 c 271 art 2 s 9; 2014 c 286 art 5 s 5]\n\"Eligible organization\" means a public agency or a nonprofit organization that can demonstrate an ability to implement a program for education and training services provided to targeted youth. Eligible organizations may include local jurisdictions, public school districts, private nonsectarian schools, postsecondary educational institutes, alternative schools, community groups, and labor organizations.\n\"Program\" means the services and activities performed or contracted for by an eligible organization for which a grant has been received or for which a grant application has been submitted to the commissioner.\n\"Homeless individual\" or \"homeless person\" means:\n(1) an individual who lacks a fixed, regular, and adequate nighttime residence; and\n(2) an individual who has a primary nighttime residence that is:\n(i) a supervised publicly or privately operated shelter or dwelling designed to provide temporary living accommodations;\n(ii) an institution that provides a temporary residence for individuals intended to be institutionalized; or\n(iii) a public or private place not designed for, or ordinarily used as, a regular sleeping accommodation for humans.\nThe term \"homeless individual\" does not include any individual imprisoned or otherwise detained under federal or state law.\n\"Targeted youth\" means at-risk persons who are at least 16 years of age but not older than 24 years of age, are eligible for the high school graduation incentive program under section 124D.68, subdivision 2, or are economically disadvantaged as defined in United States Code, title 29, section 1503, and are part of one of the following groups:\n(1) persons who are not attending any school and have not received a secondary school diploma or its equivalent; or\n(2) persons currently enrolled in a traditional or alternative school setting or a commissioner of education-selected high school equivalency program and who, in the opinion of an official of the school, are in danger of dropping out of the school.\n\"Low income\" means incomes that are at or less than 80 percent of the area median income, adjusted for family size, as estimated by the Department of Housing and Urban Development.",
	"repealed": false
}