{
	"id": "322C.0704",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0704",
	"title": "322C.0704 OTHER CLAIMS AGAINST DISSOLVED LIMITED LIABILITY COMPANY.",
	"text": "A dissolved limited liability company may publish notice of its dissolution and request persons having claims against the company to present them according to the notice.\nThe notice authorized by subdivision 1 must:\n(1) be published at least once in a newspaper of general circulation in the county or counties in this state in which the dissolved limited liability company's principal office is located or, if it has none in this state, in the county or counties in which the company's registered office is or was last located;\n(2) describe the information required to be contained in a claim and provide a mailing address to which the claim is to be sent; and\n(3) state that a claim against the company is barred unless an action to enforce the claim is commenced within five years after publication of the notice.\nIf a dissolved limited liability company publishes a notice according to subdivision 2, unless the claimant commences an action to enforce the claim against the company within five years after the publication date of the notice, the claim of each of the following claimants is barred:\n(1) a claimant that did not receive notice in a record under section 322C.0703;\n(2) a claimant whose claim was timely sent to the company but not acted on; and\n(3) a claimant whose claim is contingent at, or based on an event occurring after, the effective date of dissolution.\nA claim not barred under this section may be enforced:\n(1) against a dissolved limited liability company, to the extent of its undistributed assets; and\n(2) if assets of the company have been distributed after dissolution, against a member or transferee to the extent of that person's proportionate share of the claim or of the assets distributed to the member or transferee after dissolution, whichever is less, but a person's total liability for all claims under this clause does not exceed the total amount of assets distributed to the person after dissolution.",
	"repealed": false
}