{
	"id": "62R.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62R.07",
	"title": "62R.07 RELICENSURE.",
	"text": "(a) A health care network cooperative licensed under chapter 62C or 62D may relinquish that license and be granted a new license as a community integrated service network under chapter 62N in accordance with this section, provided that the cooperative meets all requirements for licensure as a network under chapter 62N, to the extent not expressly inconsistent with the provisions of chapter 308A.\n(b) The relicensure shall be effective at the time specified in the plan of relicensure, which must not be earlier than the date upon which the previous license is surrendered.\n(c) Upon the relicensure of the cooperative as a community integrated service network:\n(1) all existing group and individual enrollee benefit contracts in force on the effective date of the relicensure shall continue in effect and with the same terms and conditions, notwithstanding the cooperative's new licensure as a network, until the date of each contract's next renewal or amendment, but no later than one year from the date of the relicensure. At this time, each benefit contract then in force must be amended to comply with all statutory and regulatory requirements for network benefit contracts as of that date; and\n(2) all contracts between the cooperative and any health care providing entity, including a health care provider cooperative, in force on the effective date of relicensure shall remain in effect under the cooperative's new licensure as a network until the date of the next renewal or amendment of that contract, but no later than one year from the date of relicensure.\n(d) Except as otherwise provided in this section, nothing in the relicensure of a health care network cooperative shall in any way affect its corporate existence or any of its contracts, rights, privileges, immunities, powers or franchises, debts, duties or other obligations or liabilities.",
	"repealed": false
}