{
	"id": "103G.2165",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.2165",
	"title": "103G.2165 DEVELOPMENT OF FISH KILL RESPONSE PROTOCOL.",
	"text": "By June 30, 2024, the commissioners of agriculture, health, and natural resources and the commissioner of the Pollution Control Agency must update the fish kill response guidance by developing a protocol. The protocol must consist of steps that state agencies responding to a report of a fish kill under section 103G.216 must take to ascertain cause of or contributing factors to the fish kill based on scientific data and information gathered through investigation, as well as a communication plan to inform the public of potential hazards. The protocol must address:\n(1) how to approach sampling for aquatic life in most fish kill situations;\n(2) the types of locations from which samples described in clause (1) should be taken;\n(3) the types of locations where water samples should be taken from the body of water in which the fish kill occurred, as well as tributary streams and private wells with landowner consent that should also be sampled;\n(4) the types of locations from which soil and groundwater samples should be taken to ascertain whether contaminants traveled overland or underground to reach the body of water in which the fish kill occurred;\n(5) where other sampling should occur to determine the presence of contaminants that may have contributed to the fish kill;\n(6) developing a comprehensive list of contaminants, including degradation products, for which the materials sampled in clauses (3) to (5) should be tested;\n(7) the appropriate concentration limits to be used in testing samples for the presence of contaminants, allowing for the possibility that the fish kill may have resulted from the interaction of two or more contaminants present at concentrations below the level associated with toxic effects resulting from exposure to each individual chemical;\n(8) proper handling, storage, and treatment necessary to preserve the integrity of the samples described in this subdivision to maximize the information the samples can yield regarding the cause of the fish kill;\n(9) the organs and other parts of the fish and other aquatic creatures that should be analyzed to maximize the information the samples can yield regarding the cause of the fish kill;\n(10) identifying a rapid response team of interagency staff or an independent contractor with the necessary data collection equipment that can travel to the site of the fish kill to collect samples within 24 to 48 hours of the incident;\n(11) a communications plan with a health-risk assessment to notify potentially impacted downstream users of the surface water of the potential hazards and those in the vicinity whose public or private water supply, including surface water or groundwater, may be impacted; and\n(12) the proposed content and timing for investigation reports filed following fish kills. Investigation reports should identify the probable causes and include recommendations to prevent similar incidents in the future.\nThe Departments of Agriculture, Health, and Natural Resources and the Pollution Control Agency must post the draft protocol to their websites for a 60-day period for public review and comment. The Departments of Agriculture, Health, and Natural Resources and the Pollution Control Agency must hold one or more public informational meetings on the draft protocol. The Departments of Agriculture, Health, and Natural Resources and the Pollution Control Agency must consider comments submitted during the public comment period before posting the final protocol to their websites.\nOnce the protocol has been published, the relevant state agencies must follow the protocol and must maintain data related to each fish kill response documenting the extent to which the protocol was followed and any reasons why it was not. Once the protocol is in effect, investigation reports for fish kills must be posted to the EQB Monitor.\nThe updated protocol must be reviewed by the commissioners of agriculture, health, and natural resources and the commissioner of the Pollution Control Agency at least every five years according to the procedures in this section.",
	"repealed": false
}