{
	"id": "609.894",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.894",
	"title": "609.894 CELLULAR TELEPHONE COUNTERFEITING; CRIMES DEFINED.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Cellular telephone\" means a radio telecommunications device that may be used to obtain access to the public and cellular switch telephone networks and that is programmed by the manufacturer with an electronic serial number.\n(b) \"Cellular telephone service\" means all services and cellular telephone equipment and capabilities available from a provider to an end user for a fee.\n(c) \"Cloned cellular telephone\" or \"counterfeit cellular telephone\" means a cellular telephone, the electronic serial number of which has been altered by someone other than the manufacturer.\n(d) \"Telephone cloning paraphernalia\" means materials that, when possessed in combination, are capable of creating a cloned cellular telephone. Telephone cloning paraphernalia includes, but is not limited to:\n(1) scanners to intercept electronic serial numbers and mobile identification numbers;\n(2) cellular telephones;\n(3) cables;\n(4) EPROM chips;\n(5) EPROM burners;\n(6) software for programming the cellular telephone with a false electronic serial number, mobile identification number, other identifiable data, or a combination of those items;\n(7) computers containing software described in clause (6); and\n(8) lists of electronic serial number and mobile identification number combinations.\n(e) \"Electronic serial number\" means a unique number that is programmed into a cellular telephone by the manufacturer, transmitted by the cellular telephone, and used by cellular telephone providers to validate radio transmissions to the system as having been made by an authorized device.\n(f) \"End user\" is a person who pays a fee to subscribe to cellular telephone service from a provider or a person receiving a call from or sending a call to the person paying or subscribing for cellular telephone service.\n(g) \"Intercept\" means to electronically capture, record, reveal, or otherwise access the signals emitted or received during the operation of a cellular telephone by any instrument, device, or equipment without the consent of the sender or receiver.\n(h) \"Mobile identification number\" means the cellular telephone number assigned to the cellular telephone by the cellular telephone provider.\n(i) \"Provider\" means a licensed seller of cellular telephone service or a reselling agent authorized by a licensed seller.\n(a) A person commits the crime of cellular counterfeiting in the third degree if the person knowingly possesses a cloned cellular telephone and knows that the telephone is unlawfully cloned.\n(b) Cellular counterfeiting in the third degree is a gross misdemeanor.\n(a) A person commits the crime of cellular counterfeiting in the second degree if the person knowingly possesses, and knows the unlawful nature of using, any telephone cloning paraphernalia or any instrument capable of intercepting or manipulating electronic serial numbers, mobile identification numbers, other identifiable data, or a combination of those items.\n(b) A person who violates paragraph (a) may be sentenced to imprisonment for not more than three years and may be fined up to $7,000, or both.\n(a) A person commits the crime of cellular counterfeiting in the first degree if the person knowingly possesses or distributes, and knows the unlawful nature of using, any telephone cloning paraphernalia or any instrument capable of intercepting or manipulating electronic serial numbers, mobile identification numbers, other identifiable data, or a combination of those items, and agrees with, encourages, solicits, or permits one or more other persons to engage in or cause, or obtain cellular telephone service through, cellular counterfeiting.\n(b) A person who violates paragraph (a) may be sentenced to imprisonment for not more than five years and may be fined up to $10,000, or both.\nThe provisions of subdivisions 2 to 4 do not apply to:\n(1) officers, employees, or agents of cellular telephone service providers who engage in conduct prohibited by this section for the purpose of constructing, maintaining, or conducting the radio telecommunication service or for law enforcement purposes;\n(2) law enforcement officers and public officials in charge of jails, police premises, sheriffs' offices, Department of Corrections institutions, and other penal or correctional institutions, or any other person under the color of law, who engages in conduct prohibited by this section for the purpose of law enforcement or in the normal course of the officer's or official's employment activities or duties; and\n(3) officers, employees, or agents of federal or state agencies that are authorized to monitor or intercept cellular telephone service in the normal course of the officer's, employee's, or agent's employment.\nA prosecution under this section does not preclude civil liability under any applicable provision of law.",
	"repealed": false
}