{
	"id": "216I.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.28",
	"title": "216I.28 ROUTE APPLICATION FEE; APPROPRIATION; FUNDING.",
	"text": "An applicant for a site or route permit must pay to the commission a fee to cover the necessary and reasonable costs incurred by the commission to act on the permit application and carry out the requirements of this chapter. The commission may adopt rules providing for fee payment. Section 16A.1283 does not apply to establishment of the fee under this subdivision. All money received under this subdivision must be deposited in a special account. Money in the account is appropriated to the commission to pay expenses incurred to process applications for site and route permits in accordance with this chapter and, in the event expenses are less than the fee paid, to refund the excess fee paid to the applicant.\nThe commission shall finance its baseline studies, general environmental studies, development of criteria, inventory preparation, monitoring of conditions placed on site and route permits, and all other work, other than specific site and route designation, from an assessment made quarterly, at least 30 days before the start of each quarter, by the commission against all utilities with annual retail kilowatt-hour sales greater than 4,000,000 kilowatt-hours in the previous calendar year.\nEach share shall be determined as follows: (1) the ratio that the annual retail kilowatt-hour sales in the state of each utility bears to the annual total retail kilowatt-hour sales in the state of all these utilities, multiplied by 0.667, plus (2) the ratio that the annual gross revenue from retail kilowatt-hour sales in the state of each utility bears to the annual total gross revenues from retail kilowatt-hour sales in the state of all these utilities, multiplied by 0.333, as determined by the commission. The assessment shall be credited to the special revenue fund and shall be paid to the state treasury within 30 days after receipt of the bill, which shall constitute notice of said assessment and demand of payment thereof. The total amount which may be assessed to the several utilities under authority of this subdivision shall not exceed the sum of the annual budget of the commission for carrying out the purposes of this subdivision. The assessment for the third quarter of each fiscal year shall be adjusted to compensate for the amount by which actual expenditures by the commission for the preceding fiscal year were more or less than the estimated expenditures previously assessed.",
	"repealed": false
}