{
	"id": "281.274",
	"url": "https://www.revisor.mn.gov/statutes/cite/281.274",
	"title": "281.274 MAY BE WITHHELD FROM SALE, PAYMENTS.",
	"text": "The owner of any real property withheld from sale pursuant to section 281.273, or the owner's agent or representative, may at any time while entitled to have the same withheld from sale under the Servicemembers Civil Relief Act, as amended, pay the aggregate amount of all delinquent taxes and assessments as provided in subdivision 2 in one payment without penalties, interest or costs or in ten installments as provided in subdivision 3. Upon full payment of such aggregate amount of all delinquent taxes and assessments, the forfeiture shall be canceled and of no effect, and the county auditor shall certify to the commissioner of revenue the following facts: The description of the real property, the name of the owner thereof, the particulars of the owner's military service for the United States, so far as known, the payment in full of the aggregate amount of such taxes and assessments, and the date thereof. Upon receipt of such certificate from the county auditor, such owner shall receive a quitclaim deed to such property from the state executed by the commissioner of revenue.\nThe aggregate amount to be paid as provided in subdivision 1 shall mean the sum of the taxes and assessments without penalties, interest or costs accrued against such real property and unpaid, including taxes and assessments levied and assessed as omitted taxes as hereinafter provided. When an application is made to pay taxes and assessments as provided in subdivision 1, the auditor shall levy and assess against such real property as omitted taxes, upon the basis of the net tax capacity in effect in the last year in which taxes included in such notice of expiration of the time for redemption were levied and assessed, all taxes which would have been assessed in each year after the last year so included in such notice and all assessments which would have been levied and assessed against such real property after the last year included in such notice.\nWhen any person accorded the right in subdivision 2 to pay taxes makes application to the county auditor to pay the aggregate amount of such taxes and assessments in installments, the person shall pay one-tenth of the aggregate amount of such taxes and assessments at the time of application and the balance thereof in nine equal annual installments, with the privilege of paying the unpaid balance in full at any time, with interest at the rate of four percent on the balance remaining unpaid each year, the first installment of principal and interest to become due and payable on October 31 of the year following the year in which the application was made, the remaining installments to become due and payable on October 31 of each year thereafter until fully paid. Failure to make any payment herein required within 60 days from the date on which payment was due shall constitute default and upon such default the right, title, and interest of such person in the military service or the person's heirs, representatives or assigns in such real property shall terminate without the doing by the state of any act or thing.",
	"repealed": false
}