{
	"id": "153B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/153B.15",
	"title": "153B.15 DEFINITIONS.",
	"text": "For purposes of this chapter, the following words have the meanings given.\n\"Advisory council\" means the Orthotics, Prosthetics, and Pedorthics Advisory Council established under section 153B.25.\n\"Board\" means the Board of Podiatric Medicine.\n\"Custom-fabricated device\" means an orthosis, prosthesis, or pedorthic device for use by a patient that is fabricated to comprehensive measurements or a mold or patient model in accordance with a prescription and which requires on-site or in-person clinical and technical judgment in its design, fabrication, and fitting.\n\"Licensed orthotic-prosthetic assistant\" or \"assistant\" means a person, licensed by the board, who is educated and trained to participate in comprehensive orthotic and prosthetic care while under the supervision of a licensed orthotist or licensed prosthetist. Assistants may perform orthotic and prosthetic procedures and related tasks in the management of patient care. The assistant may fabricate, repair, and maintain orthoses and prostheses. The use of the title \"orthotic-prosthetic assistant\" or representations to the public is limited to a person who is licensed under this chapter as an orthotic-prosthetic assistant.\n\"Licensed orthotic fitter\" or \"fitter\" means a person licensed by the board who is educated and trained in providing certain orthoses, and is trained to conduct patient assessments, formulate treatment plans, implement treatment plans, perform follow-up, and practice management pursuant to a prescription. An orthotic fitter must be competent to fit certain custom-fitted, prefabricated, and off-the-shelf orthoses as follows:\n(1) cervical orthoses, except those used to treat an unstable cervical condition;\n(2) prefabricated orthoses for the upper and lower extremities, except those used in:\n(i) the initial or acute treatment of long bone fractures and dislocations;\n(ii) therapeutic shoes and inserts needed as a result of diabetes; and\n(iii) functional electrical stimulation orthoses;\n(3) prefabricated spinal orthoses, except those used in the treatment of scoliosis or unstable spinal conditions, including halo cervical orthoses; and\n(4) trusses.\nThe use of the title \"orthotic fitter\" or representations to the public is limited to a person who is licensed under this chapter as an orthotic fitter.\n\"Licensed orthotist\" means a person licensed by the board who is educated and trained to practice orthotics, which includes managing comprehensive orthotic patient care pursuant to a prescription. The use of the title \"orthotist\" or representations to the public is limited to a person who is licensed under this chapter as an orthotist.\n\"Licensed pedorthist\" means a person licensed by the board who is educated and trained to manage comprehensive pedorthic patient care and who performs patient assessments, formulates and implements treatment plans, and performs follow-up and practice management pursuant to a prescription. A pedorthist may fit, fabricate, adjust, or modify devices within the scope of the pedorthist's education and training. Use of the title \"pedorthist\" or representations to the public is limited to a person who is licensed under this chapter as a pedorthist.\n\"Licensed prosthetist\" means a person licensed by the board who is educated and trained to manage comprehensive prosthetic patient care, and who performs patient assessments, formulates and implements treatment plans, and performs follow-up and practice management pursuant to a prescription. Use of the title \"prosthetist\" or representations to the public is limited to a person who is licensed under this chapter as a prosthetist.\n\"Licensed prosthetist orthotist\" means a person licensed by the board who is educated and trained to manage comprehensive prosthetic and orthotic patient care, and who performs patient assessments, formulates and implements treatment plans, and performs follow-up and practice management pursuant to a prescription. Use of the title \"prosthetist orthotist\" or representations to the public is limited to a person who is licensed under this chapter as a prosthetist orthotist.\n\"NCOPE\" means National Commission on Orthotic and Prosthetic Education, an accreditation program that ensures educational institutions and residency programs meet the minimum standards of quality to prepare individuals to enter the orthotic, prosthetic, and pedorthic professions.\n\"Orthosis\" means an external device that is custom-fabricated or custom-fitted to a specific patient based on the patient's unique physical condition and is applied to a part of the body to help correct a deformity, provide support and protection, restrict motion, improve function, or relieve symptoms of a disease, syndrome, injury, or postoperative condition.\n\"Orthotics\" means the science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, adjusting, or servicing an orthosis pursuant to a prescription. The practice of orthotics includes providing the initial training necessary for fitting an orthotic device for the support, correction, or alleviation of neuromuscular or musculoskeletal dysfunction, disease, injury, or deformity.\n\"Over-the-counter\" means a prefabricated, mass-produced item that is prepackaged, requires no professional advice or judgment in size selection or use, and is currently available at retail stores without a prescription. Over-the-counter items are not regulated by this chapter.\n\"Off-the-shelf\" means a prefabricated device sized or modified for the patient's use pursuant to a prescription and that requires changes to be made by a qualified practitioner to achieve an individual fit, such as requiring the item to be trimmed, bent, or molded with or without heat, or requiring any other alterations beyond self adjustment.\n\"Pedorthic device\" means below-the-ankle partial foot prostheses for transmetatarsal and more distal amputations, foot orthoses, and subtalar-control foot orthoses to control the range of motion of the subtalar joint. A prescription is required for any pedorthic device, modification, or prefabricated below-the-knee orthosis addressing a medical condition that originates at the ankle or below. Pedorthic devices do not include nontherapeutic inlays or footwear regardless of method of manufacture; unmodified, nontherapeutic over-the-counter shoes; or prefabricated foot care products.\n\"Pedorthics\" means the science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, adjusting, or servicing a pedorthic device pursuant to a prescription for the correction or alleviation of neuromuscular or musculoskeletal dysfunction, disease, injury, or deformity. The practice of pedorthics includes providing patient care and services pursuant to a prescription to prevent or ameliorate painful or disabling conditions of the foot and ankle.\n\"Prescription\" means an order deemed medically necessary by a physician, podiatric physician, osteopathic physician, or a licensed health care provider who has authority in this state to prescribe orthotic and prosthetic devices, supplies, and services.\n\"Prosthesis\" means a custom-designed, fabricated, fitted, or modified device to treat partial or total limb loss for purposes of restoring physiological function or cosmesis. Prosthesis does not include artificial eyes, ears, fingers, or toes; dental appliances; external breast prosthesis; or cosmetic devices that do not have a significant impact on the musculoskeletal functions of the body.\n\"Prosthetics\" means the science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, adjusting, or servicing a prosthesis pursuant to a prescription. It includes providing the initial training necessary to fit a prosthesis in order to replace external parts of a human body lost due to amputation, congenital deformities, or absence.\n\"Resident\" means a person who has completed an NCOPE-approved education program in orthotics or prosthetics and is receiving clinical training in a residency accredited by NCOPE.\n\"Residency\" means a minimum of an NCOPE-approved program to acquire practical clinical training in orthotics and prosthetics in a patient care setting.\n\"Supervisor\" means the licensed orthotist, prosthetist, or pedorthist who oversees and is responsible for the delivery of appropriate, effective, ethical, and safe orthotic, prosthetic, or pedorthic patient care.",
	"repealed": false
}