{
	"id": "358.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/358.645",
	"title": "358.645 REMOTE ONLINE NOTARY PUBLIC.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Appear,\" \"personally appear,\" or \"in the presence of\" means:\n(1) being in the same physical location as another person and close enough to see, hear, communicate with, and exchange tangible identification credentials with that individual; or\n(2) interacting with another individual by means of communication technology as defined in this section.\n(c) \"Communication technology\" means an electronic device or process that allows a notary public physically located in this state and a remotely located individual to communicate with each other simultaneously by sight and sound and that, as necessary, makes reasonable accommodation for individuals with vision, hearing, or speech impairments.\n(d) \"Credential analysis\" means an automated software- or hardware-based process or service through which a third person affirms the validity of a government-issued identification credential through review of public or proprietary data sources.\n(e) \"Electronic journal\" means a secure electronic record of notarial acts that contains the items listed in and required by subdivision 4, paragraph (a), and performed by the remote online notary public.\n(f) \"Electronic record\" means information that is created, generated, sent, communicated, received, or stored by electronic means.\n(g) \"Electronic seal\" means information within a notarized electronic record that confirms the remote online notary public's name, jurisdiction, identifying number, and commission expiration date and generally corresponds to information in notary seals used on paper documents.\n(h) \"Identity proofing\" means a process or service through which a third person affirms the identity of an individual through review of personal information from public or proprietary data sources, and that may include dynamic knowledge-based authentication or biometric verification.\n(i) \"Outside the United States\" means outside the geographic boundaries of a state or commonwealth of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, and any territory or insular possession subject to the jurisdiction of the United States.\n(j) \"Principal\" means an individual:\n(1) whose electronic signature is notarized in a remote online notarization; or\n(2) making an oath or affirmation or an acknowledgment other than in the capacity of a witness for the remote online notarization.\n(k) \"Remote online notarial certificate\" is the form of an acknowledgment, jurat, verification on oath or affirmation, or verification of witness or attestation that is completed by a remote online notary public and:\n(1) contains the online notary public's electronic signature, electronic seal, title, commission number, and commission expiration date;\n(2) contains other required information concerning the date and place of the remote online notarization;\n(3) otherwise conforms to the requirements for an acknowledgment, jurat, verification on oath or affirmation, or verification of witness or attestation under the laws of this state; and\n(4) indicates that the person making the acknowledgment, oath, or affirmation appeared remotely online.\n(l) \"Remote online notarization\" or \"remote online notarial act\" means a notarial act performed by means of communication technology as defined in this section.\n(m) \"Remote online notary public\" means a notary public who has registered with the secretary of state to perform remote online notarizations.\n(n) \"Remote presentation\" means transmission to the remote online notary public through communication technology of an image of a government-issued identification credential that is of sufficient quality to enable the remote online notary public to:\n(1) identify the individual seeking the remote online notary public's services; and\n(2) perform credential analysis.\n(o) \"Remotely located individual\" means an individual who is not in the physical presence of the notary.\n(a) A remote online notary public:\n(1) is a notary public for purposes of chapter 359 and is subject to and must be appointed and commissioned under that chapter;\n(2) may perform notarial acts as provided by this chapter and chapter 359 in addition to performing remote online notarizations; and\n(3) may perform remote online notarizations authorized under this section.\n(b) A notary public commissioned in this state may apply for remote online notarization registration according to this section. Before a notary performs a remote online notarization, the notary must register the capability to perform notarial acts pursuant to this section with the secretary of state and must certify that the notary intends to use communication technology that conforms to this section.\n(c) Unless terminated under this section, the term of registration to perform remote online notarial acts begins on the registration starting date set by the secretary of state and continues as long as the notary public's current commission to perform notarial acts remains valid.\n(d) Upon the applicant's fulfillment of the requirements for remote online notarization registration under this section, the secretary of state shall record the registration under the applicant's notary public commission number.\n(e) The secretary of state may reject a registration application if the applicant fails to comply with paragraphs (a) to (d). The commissioner of commerce may revoke a registration if the applicant fails to comply with subdivisions 2 to 6.\n(a) A remote online notary public may perform a remote online notarial act authorized under this section only while the remote online notary public is physically located in this state. A remote online notary public physically located in this state may perform a remote online notarial act using communication technology as defined in this section for a remotely located individual who is physically located:\n(1) in this state;\n(2) outside this state, but within the United States; or\n(3) outside the United States if:\n(i) the remote online notary public has no actual knowledge of the remote online notarial act being prohibited in the jurisdiction in which the person is physically located; and\n(ii) the person placing an electronic signature on the electronic document confirms to the remote online notary public that the requested remote online notarial act and the electronic document:\n(A) are part of or pertain to a matter that is to be filed with or is currently before a court, governmental entity, or other entity in the United States;\n(B) relate to property located in the United States; or\n(C) relate to a transaction substantially connected to the United States.\n(b) The validity of a remote online notarization performed by an online notary public of this state according to this chapter shall be governed by the laws of this state.\n(c) A remote online notary public or the remote online notary public's employer may charge a fee not to exceed $25 for the performance of a remote online notarial act, if the act occurs before January 1, 2023.\n(a) A remote online notary public shall keep one or more secure electronic journals of notarial acts performed by the remote online notary public. An electronic journal must contain for each remote online notarization:\n(1) the date and time of the notarization;\n(2) the type of notarial act;\n(3) the type, the title, or a description of the electronic document or proceeding;\n(4) the printed name and address of each principal involved in the transaction or proceeding;\n(5) evidence of identity of each principal involved in the transaction or proceeding in the form of:\n(i) a statement that the person is personally known to the remote online notary public;\n(ii) a notation of the type of identification document provided to the remote online notary public; or\n(iii) the following:\n(A) the printed name and address of each credible witness swearing to or affirming the person's identity; and\n(B) for each credible witness not personally known to the remote online notary public, a description of the type of identification documents provided to the remote online notary public; and\n(6) the fee, if any, charged for the notarization.\n(b) The remote online notary public shall create an audio and video copy of the performance of the notarial act.\n(c) The remote online notary public shall take reasonable steps to:\n(1) ensure the integrity, security, and authenticity of remote online notarizations;\n(2) maintain a backup for the electronic journal required by paragraph (a) and the recordings required by paragraph (b); and\n(3) protect the records and backup record in this subdivision from unauthorized access or use.\n(d) The electronic journal required by paragraph (a) and the recordings required by paragraph (b) shall be maintained for at least ten years after the date of the transaction or proceeding. The remote online notary public may, by written agreement, designate as a repository of the recording and the electronic journal:\n(1) the employer of the remote online notary public if evidenced by a record signed by the remote online notary public and the employer in which the employer agrees to meet the applicable requirements of this paragraph and paragraph (c); or\n(2) another repository meeting the applicable requirements of this paragraph and paragraph (c).\nA remote online notarial act performed under this section shall comply with the following minimum standards:\n(1) Identity proofing shall include knowledge-based authentication with these or greater security characteristics:\n(i) The signer must be presented with five or more questions with a minimum of five possible answer choices per question.\n(ii) Each question must be drawn from a third-party provider of public and proprietary data sources and be identifiable to the signer's social security number or other identification information, or the signer's identity and historical events records.\n(iii) Responses to all questions must be made within a two-minute time constraint.\n(iv) The signer must answer a minimum of 80 percent of the questions correctly.\n(v) The signer may be offered an additional attempt in the event of a failed first attempt.\n(vi) During the second attempt, the signer may not be presented with more than three questions from the prior attempt.\n(2) Credential analysis must confirm that the credential is valid and matches the signer's claimed identity using one or more automated software or hardware processes that scan the credential, including its format features, data, bar codes, or other security elements.\n(a) A remote online notary public shall keep the remote online notary public's electronic journal and electronic seal secure and under the remote online notary public's exclusive control, which may be done by password-controlled access. The remote online notary public may, by agreement, use a software platform or service provider to facilitate provision of remote online notarizations and maintenance of and access to records, but may not allow another person to use the remote online notary public's electronic journal or electronic seal to perform notarial acts or for any unauthorized purpose.\n(b) A remote online notary public shall attach the remote online notary public's electronic signature and seal to the electronic notarial certificate of an electronic document in a manner that is capable of independent verification and renders any subsequent change or modification to the electronic document evident.\n(c) A remote online notary public shall immediately notify an appropriate law enforcement agency and the commissioner of commerce of the theft or vandalism of the remote online notary public's electronic journal, electronic signature, or electronic seal. A remote online notary public shall immediately notify the commissioner of commerce of the loss or use by another person of the remote online notary public's electronic journal or electronic seal.\n(a) A remote online notary public may perform a remote online notarization authorized under this section that meets the requirements of this section regardless of whether the principal is physically located in this state at the time of the remote online notarization.\n(b) In performing a remote online notarization, a remote online notary public shall verify the identity of a person creating an electronic signature at the time that the signature is taken by using communication technology as defined by this section. Identity may be verified by:\n(1) the remote online notary public's personal knowledge of the person creating the electronic signature; or\n(2) all of the following:\n(i) remote presentation by the person creating the electronic signature of a currently valid government-issued identification credential, including a passport or driver's license, that contains the signature and a photograph of the person;\n(ii) credential analysis of the credential described in item (i); and\n(iii) identity proofing of the person described in item (i).\n(c) The remote online notary public shall take reasonable steps to provide that the communication technology used in a remote online notarization is secure from unauthorized interception.\n(d) The electronic notarial certificate for a remote online notarization must include a notation that the notarization is a remote online notarization.\n(e) A remote online notarial act meeting the requirements of this section satisfies the requirement of any law of this state relating to a notarial act that requires a principal to appear or personally appear before a notary or that the notarial act be performed in the presence of a notary.\n(a) Except as provided by paragraph (b), a remote online notary public whose registration terminates shall destroy the coding, disk, certificate, card, software, or password that enables electronic affixation of the online notary public's official electronic signature or seal. The remote online notary public shall certify compliance with this paragraph to the secretary of state through the secretary of state's online commission record.\n(b) A former remote online notary public whose registration terminated for a reason other than revocation or a denial of renewal is not required to destroy the items described in paragraph (a) if the former remote online notary public is reregistered as a remote online notary public with the same electronic signature and seal within three months after the former remote online notary public's registration terminated.\nA person who, without authorization, knowingly obtains, conceals, damages, or destroys the certificate, disk, coding, card, program, software, or hardware enabling a remote online notary public to affix an official electronic signature or seal commits a misdemeanor.\nIn the event of a conflict between this section and any other law in this state, this section shall prevail.\nIn completing the certificate required to document the performance of the notarial act, the form shall indicate that the person appeared before the notary by means of communication technology if that was the method of the person's appearance before the notary.\n(a) The data collected by a notary public in compliance with this section is not subject to chapter 13, the Government Data Practices Act, but the notary public and the notary public's agent must make a copy of the individual's data included in the electronic journal and the audio-video recording available only to the individual whose signature was notarized or to a guardian, conservator, attorney-in-fact, or personal representative of an incapacitated or deceased individual.\n(b) The individual whose signature was notarized or the individual's guardian, conservator, attorney-in-fact, or personal representative of an incapacitated or deceased individual may consent to the release of the data to a third party.\nThe secretary of state shall maintain a list of entities that regularly offer a course of study for a remote online notary public in this state. The course must cover the laws, rules, procedures, and ethics relevant to notarial acts performed under this section.\nThis section may be cited as the \"Remote Online Notarization Act.\"",
	"repealed": false
}