{
	"id": "299A.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.801",
	"title": "299A.801 CORRECTIVE ORDERS AND INJUNCTIONS.",
	"text": "(a) Before seeking an administrative penalty order under section 299A.802, the commissioner must issue a corrective order that requires the administrative agent to correct the violation of statute, rule, or other authority. The corrective order must state the deficiencies that constitute the violation of the specific statute, rule, or other authority, and the time by which the violation must be corrected. In addition to service by certified mail on the administrative agent, a copy of the corrective order must be given to the county auditor in the county where the administrative agent is located.\n(b) The administrative agent to whom the corrective order was issued shall provide information to the commissioner, by the due date stated in the corrective order, demonstrating that the violation has been corrected or that the administrative agent has developed a corrective plan acceptable to the commissioner. The commissioner must determine whether the violation has been corrected and notify the administrative agent subject to the order of the commissioner's determination.\n(c) If the administrative agent believes that the information contained in the commissioner's corrective order is in error, the administrative agent may ask the commissioner to reconsider the parts of the corrective order that are alleged to be in error. The request must:\n(1) be in writing;\n(2) be delivered to the commissioner by certified mail within seven calendar days after receipt of the corrective order;\n(3) specify which parts of the corrective order are alleged to be in error and explain why they are in error; and\n(4) provide documentation to support the allegation of error.\n(d) The commissioner shall respond to requests made under paragraph (c) within 15 calendar days after receiving a request. A request for reconsideration does not stay the corrective order; however, after reviewing the request for reconsideration, the commissioner may provide additional time to comply with the order if necessary. The commissioner's disposition of a request for reconsideration of a corrective order is final.\nThe commissioner, or an employee of the department designated by the commissioner, may issue an order to cease an activity otherwise authorized by statute, rule, or other authority if continuation of the activity would result in an immediate risk to public safety. A cease and desist order issued under this subdivision is effective for a maximum of 72 hours. In conjunction with issuing the cease and desist order, the commissioner may post a sign to cease an activity until the cease and desist order is lifted and the sign is removed by the commissioner. To restrain activities for a period beyond 72 hours, the commissioner must seek an injunction or take other administrative action authorized by law. The issuance of a cease and desist order does not preclude the commissioner from pursuing any other enforcement action available to the commissioner.\nIn addition to any other remedy provided by law, the commissioner may bring an action for injunctive relief in the District Court in Ramsey County or, at the commissioner's discretion, in the district court in the county in which a violation of a statute, rule, or other authority has occurred to enjoin the violation.",
	"repealed": false
}