{
	"id": "123B.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.57",
	"title": "123B.57 HEALTH AND SAFETY PROJECTS.",
	"text": "[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n(a) Health and safety capital projects may include expenditures necessary for the correction of fire and life safety hazards; design, purchase, installation, maintenance, and inspection of fire protection and alarm equipment; purchase or construction of appropriate facilities for the storage of combustible and flammable materials; inventories and facility modifications not related to a remodeling project to comply with lab safety requirements under section 121A.31; inspection, testing, repair, removal or encapsulation, and disposal of asbestos-containing building materials; cleanup and disposal of polychlorinated biphenyls; cleanup and disposal of hazardous and infectious wastes; cleanup, removal, disposal, and repairs related to storing heating fuel or transportation fuels such as alcohol, gasoline, fuel oil, and special fuel, as defined in section 296A.01; correction of occupational safety and health administration regulated hazards; indoor air quality inspections, investigations, and testing; mold abatement; upgrades or replacement of mechanical ventilation systems to meet American Society of Heating, Refrigerating and Air Conditioning Engineers standards and State Mechanical Code; design, materials, and installation of local exhaust ventilation systems, including required make-up air for controlling regulated hazardous substances; correction of Department of Health Food Code violations; correction of swimming pool hazards excluding depth correction; playground safety inspections, repair of unsafe outdoor playground equipment, and the installation of impact surfacing materials; bleacher repair or rebuilding to comply with the order of a building code inspector under section 326B.112; testing and mitigation of elevated radon hazards; lead testing; copper in water testing; cleanup after major weather-related disasters or flooding; reduction of excessive organic and inorganic levels in wells and capping of abandoned wells; installation and testing of boiler backflow valves to prevent contamination of potable water; vaccinations, titers, and preventative supplies for bloodborne pathogen compliance; costs to comply with the Janet B. Johnson Parents' Right to Know Act; automated external defibrillators and other emergency plan equipment and supplies specific to the district's emergency action plan; compliance with the National Emission Standards for Hazardous Air Pollutants for school generators established by the United States Environmental Protection Agency; and health, safety, and environmental management costs associated with implementing the district's health and safety program including costs to establish and operate safety committees, in school buildings or property owned or being acquired by the district. Testing and calibration activities are permitted for existing mechanical ventilation systems at intervals no less than every five years.\n(b) For fiscal years 2014 through 2017, a school district must not include expenses related to emission compliance projects for school generators in its health and safety capital projects unless it reduces its approved spending on other qualified health and safety projects by the same amount.\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\n[Repealed by amendment, 1Sp2015 c 3 art 6 s 3]\nThe department may contract with regional service organizations, private contractors, Minnesota Safety Council, or state agencies to provide management assistance to school districts for health and safety capital projects. Management assistance is the development of written programs for the identification, recognition and control of hazards, and prioritization and scheduling of district health and safety capital projects. The commissioner shall not mandate management assistance or exclude private contractors from the opportunity to provide any health and safety services to school districts.",
	"repealed": false
}