{
	"id": "123B.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.65",
	"title": "123B.65 ENERGY-EFFICIENCY PROJECTS.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Energy conservation measure\" means a training program or facility alteration designed to reduce energy consumption or operating costs and includes:\n(1) insulation of the building structure and systems within the building;\n(2) storm windows and doors, caulking or weatherstripping, multiglazed windows and doors, heat absorbing or heat reflective glazed and coated window and door systems, additional glazing, reductions in glass area, and other window and door system modifications that reduce energy consumption;\n(3) automatic energy control systems;\n(4) heating, ventilating, or air conditioning system modifications or replacements;\n(5) replacement or modifications of lighting fixtures to increase the energy efficiency of the lighting system without increasing the overall illumination of a facility, unless such increase in illumination is necessary to conform to the applicable state or local building code for the lighting system after the proposed modifications are made;\n(6) energy recovery systems;\n(7) cogeneration systems that produce steam or forms of energy such as heat, as well as electricity, for use primarily within a building or complex of buildings;\n(8) energy conservation measures that provide long-term operating cost reductions.\n(b) \"Guaranteed energy-savings contract\" means a contract for the evaluation and recommendations of energy conservation measures, and for one or more energy conservation measures. The contract must provide that all payments, except obligations on termination of the contract before its expiration, are to be made over time, but not to exceed 15 years from the date of final installation, and the savings are guaranteed to the extent necessary to make payments for the systems.\n(c) \"Qualified provider\" means a person or business experienced in the design, implementation, and installation of energy conservation measures. A qualified provider to whom the contract is awarded shall give a sufficient bond to the school district for its faithful performance.\n(d) \"Commissioner\" means the commissioner of commerce through the state energy office.\n(a) Notwithstanding any law to the contrary, a school district may enter into a guaranteed energy-savings contract with a qualified provider to significantly reduce energy or operating costs.\n(b) Before entering into a contract under this subdivision, the board shall comply with clauses (1) to (5).\n(1) The board must seek proposals from multiple qualified providers by publishing notice of the proposed guaranteed energy-savings contract in the board's official newspaper and in other publications if the board determines that additional publication is necessary to notify multiple qualified providers.\n(2) The school board must select the qualified provider that best meets the needs of the board. The board must provide public notice of the meeting at which it will select the qualified provider.\n(3) The contract between the board and the qualified provider must describe the methods that will be used to calculate the costs of the contract and the operational and energy savings attributable to the contract.\n(4) The qualified provider shall issue a report to the board giving a description of all costs of installations, modifications, or remodeling, including costs of design, engineering, installation, maintenance, repairs, or debt service, and giving detailed calculations of the amounts by which energy or operating costs will be reduced and the projected payback schedule in years.\n(5) The board must provide published notice of the meeting in which it proposes to award the contract, the names of the parties to the proposed contract, and the contract's purpose.\n(c) The board must provide a copy of any contract entered into under paragraph (a) and the report provided under paragraph (b), clause (4), to the commissioner of commerce within 30 days of the effective date of the contract.\nUpon request of the board, the commissioner shall review the report required in subdivision 2 and provide an evaluation to the board on the proposed contract within 15 working days of receiving the report. In evaluating the proposed contract, the commissioner shall determine whether the detailed calculations of the costs and of the energy and operating savings are accurate and reasonable. The commissioner may request additional information about a proposed contract as the commissioner deems necessary. If the commissioner requests additional information, the commissioner shall not be required to submit an evaluation to the board within fewer than ten working days of receiving the requested information.\nUpon request of the board, the commissioner shall conduct a review of the energy and operating cost savings realized under a guaranteed energy-savings contract every three years during the period a contract is in effect. The commissioner shall compare the savings realized under the contract during the period under review with the calculations of savings included in the report required under subdivision 2 and provide an evaluation to the board concerning the performance of the system and the accuracy and reasonableness of the claimed energy and operating cost savings.\nThe commissioner may charge a district requesting services under subdivisions 3 and 4 actual costs incurred by the Department of Commerce while conducting the review, or one-half percent of the total identified project cost, whichever is less. Before conducting the review, the commissioner shall notify a district requesting review services that expenses will be charged to the district. The commissioner shall bill the district upon completion of the contract review. Money collected by the commissioner under this subdivision must be deposited in the general fund. A district may include the cost of a review by the commissioner under subdivision 3 in a contract made pursuant to this section.\nGuaranteed energy-savings contracts that include a written guarantee that savings will meet or exceed the cost of energy conservation measures is not subject to competitive bidding requirements. The contract is not subject to section 123B.52 or 471.345.\nA district may enter into a guaranteed energy-savings contract with a qualified provider if, after review of the report and the commissioner's evaluation if requested, the board finds that the amount it would spend on the energy conservation measures recommended in the report is not likely to exceed the amount to be saved in energy and operation costs over 15 years from the date of installation if the recommendations in the report were followed, and the qualified provider provides a written guarantee that the energy or operating cost savings will meet or exceed the costs of the system. The guaranteed energy-savings contract may provide for payments over a period of time, not to exceed 15 years. Notwithstanding section 123B.79, a district annually may transfer from the general fund to the reserve for operating capital account an amount up to the amount saved in energy and operation costs as a result of guaranteed energy-savings contracts.\nA district may enter into an installment payment contract for the purchase and installation of energy conservation measures. The contract must provide for payments of not less than 1/15 of the price to be paid within two years from the date of the first operation, and the remaining costs to be paid monthly, not to exceed a 15-year term from the date of the first operation.\nGuaranteed energy-savings contracts may extend beyond the fiscal year in which they become effective. The district must include in its annual appropriations measure for each later fiscal year any amounts payable under guaranteed energy-savings contracts during the year. Failure of a board to make such an appropriation does not affect the validity of the guaranteed energy-savings contract or the district's obligations under the contracts.\nA guaranteed energy-savings contract must provide that all work plans and other information prepared by the qualified provider in relation to the project, including a detailed description of the project, are public data after the contract is entered into. Information defined as trade secret information under section 13.37, subdivision 1, shall remain nonpublic data.",
	"repealed": false
}