{
	"id": "332A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/332A.09",
	"title": "332A.09 SUSPENDING, REVOKING, OR REFUSING TO RENEW REGISTRATION.",
	"text": "The commissioner may revoke, suspend, or refuse to renew any registration issued under this chapter, or may levy a civil penalty under section 45.027, or any combination of actions, if the debt management services provider or any controlling or affiliated person has committed any act or omission for which the commissioner could have refused to issue an initial registration or renew an existing registration. Revocation of or refusal to renew a registration must be upon notice and hearing as prescribed in the Administrative Procedure Act, sections 14.57 to 14.69. The notice must set a time for hearing before the commissioner not less than 20 nor more than 30 days after service of the notice, provided the registrant may waive the 20-day minimum. The commissioner may, in the notice, suspend the registration for a period not to exceed 60 days. Unless the notice states that the registration is suspended, pending the determination of the main issue, the registrant may continue to transact business until the final decision of the commissioner. If the registration is suspended, the commissioner shall hold a hearing and render a final determination within ten days of a request by the registrant. If the commissioner fails to do so, the suspension shall terminate and be of no force or effect.\nAfter the notice and hearing required in subdivision 1, upon issuing an order suspending or revoking a registration or refusing to renew a registration, the commissioner may notify all individuals who have contracts with the affected registrant and all creditors who have agreed to a debt management services plan that the registration has been revoked and that the order is subject to appeal.\nWhen an order is issued revoking or refusing to renew a registration, the commissioner may apply for, and the district court must appoint, a receiver to temporarily or permanently receive the assets of the registrant pending a final determination of the validity of the order.",
	"repealed": false
}