{
	"id": "142D.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.121",
	"title": "142D.121 DISTRIBUTION OF APPROPRIATION.",
	"text": "(a) The commissioner of children, youth, and families must distribute money appropriated for that purpose to federally designated Head Start programs to expand services and to serve additional low-income children, which may include costs associated with program operations, infrastructure, or reconfiguration to serve children from birth to age five in center-based services. The distribution must occur in the following order: (1) 10.72 percent of the total Head Start appropriation must be initially allocated to federally designated Tribal Head Start programs; (2) the Tribal Head Start portion of the appropriation must be initially allocated to Tribal Head Start programs based on the programs' share of federal funds; and (3) migrant programs must be initially allocated funding based on the programs' share of federal funds. The remaining money must be initially allocated to the remaining local agencies based equally on the agencies' share of federal funds and on the proportion of eligible children in the agencies' service area who are not currently being served. A Head Start program must be funded at a per child rate equal to its contracted, federally funded base level at the start of the fiscal year. For all agencies without a federal Early Head Start rate, the state average federal cost per child for Early Head Start applies. In allocating funds under this paragraph, the commissioner of children, youth, and families must assure that each Head Start program in existence in 1993 is allocated no less funding in any fiscal year than was allocated to that program in fiscal year 1993. Before paying money to the programs, the commissioner must notify each program of its initial allocation and how the money must be used. Each program must present a plan under section 142D.123. For any program that cannot utilize its full allocation at the beginning of the fiscal year, the commissioner must reduce the allocation proportionately. Money available after the initial allocations are reduced must be redistributed to eligible programs.\n(b) The commissioner must develop procedures to make payments to programs based upon the number of children reported to be enrolled during the required time period of program operations. Enrollment is defined by federal Head Start regulations. The procedures must include a reporting schedule, corrective action plan requirements, and financial consequences to be imposed on programs that do not meet full enrollment after the period of corrective action. Programs reporting chronic underenrollment, as defined by the commissioner, will have their subsequent program year allocation reduced proportionately. Funds made available by prorating payments and allocations to programs with reported underenrollment will be made available to the extent funds exist to fully enrolled Head Start programs through a form and manner prescribed by the department.\n(c) Programs with approved innovative initiatives that target services to high-risk populations, including homeless families and families living in homeless shelters and transitional housing, are exempt from the procedures in paragraph (b). This exemption does not apply to entire programs. The exemption applies only to approved innovative initiatives that target services to high-risk populations, including homeless families and families living in homeless shelters, transitional housing, and permanent supportive housing.",
	"repealed": false
}