{
	"id": "246.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.64",
	"title": "246.64 SUBSTANCE USE DISORDER SERVICE AGREEMENTS.",
	"text": "Notwithstanding sections 246.50, subdivision 5, and 246.511, the executive board shall establish separate rates for each substance use disorder service operated by the executive board and may establish separate rates for each service component within the program by establishing fees for services or different per diem rates for each separate substance use disorder unit within the program based on actual costs attributable to the service or unit. The rate must allocate the cost of all anticipated maintenance, treatment, and expenses including depreciation of buildings and equipment, interest paid on bonds issued for capital improvements for substance use disorder programs, reimbursement and other indirect costs related to the operation of substance use disorder programs other than that paid from the Minnesota state building fund or the bond proceeds fund, and losses due to bad debt. The rate must not include allocations of chaplaincy, patient advocacy, or quality assurance costs that are not required for substance use disorder licensure by the commissioner of human services or certification for chemical dependency by the Joint Commission on Accreditation of Hospitals. Notwithstanding any other law, the executive board shall treat these costs as nonhospital department expenses.\nDepreciation collected under subdivision 1 must be credited to the general fund. Principal and interest on the bonded debt collected under subdivision 1 must be deposited in the state bond fund.\nThe executive board shall credit all receipts from billings for rates set in subdivision 1, except those credited according to subdivision 2, to the behavioral health fund. This money must not be used for an activity in a regional treatment center that is not a substance use disorder service or an allocation of expenditures that are included in the base for computation of the rates under subdivision 1. The executive board may expand substance use disorder services so long as expenditures are recovered by patient fees, transfer of funds, or supplementary appropriations. The executive board may expand or reduce substance use disorder staff complement as long as expenditures are recovered by patient fees, transfer of funds, or supplementary appropriations. Notwithstanding chapters 176 and 268, the executive board shall provide for the self-insurance of regional treatment center substance use disorder programs for the costs of unemployment benefits and workers' compensation claims.\nNotwithstanding any law to the contrary, data concerning matters affecting the competitive position of the substance use disorder programs is \"trade secret information\" for purposes of classification under section 13.37, subdivision 2.",
	"repealed": false
}