{
	"id": "16A.645",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.645",
	"title": "16A.645 GOPHER STATE BONDS.",
	"text": "The commissioner of management and budget, in consultation with the University of Minnesota, the Minnesota State Colleges and Universities, and the Private College Council, shall establish a college savings bond program, to be known as \"gopher state bonds\" to encourage individuals to save for higher education costs by investing in state general obligation bonds. The program consists of: (1) issuing a portion of the state general obligation bonds in zero coupon form and in denominations and maturities that will be attractive to individuals saving to pay for higher education costs; and (2) developing a program for marketing the bonds to investors who are saving to pay for higher education costs. The commissioner of management and budget may designate all or a portion of each state general obligation bond sale as \"gopher state bonds.\"\nThe commissioner shall determine the appropriate denominations and maturities for gopher state bonds. It is the intent of the legislature to make bonds available in as small denominations as is feasible given the costs of marketing and administering the bond issue. Minimum denominations of $500 must be made available. The minimum denomination bonds need not be made available for bonds of all maturities. For purposes of this section, \"denomination\" means the compounded maturity amount of the bond.\nNotwithstanding the provisions of section 16A.646, subdivision 5, the commissioner may sell any series of gopher state bonds directly to the public or to financial institutions for prompt resale to the public upon the terms and conditions and the restrictions the commissioner prescribes. The commissioner may enter into all contracts deemed necessary or desirable to accomplish the sale in a cost-effective manner including a private or negotiated sale, but the commissioner may contract for investment banking and banking services only after receiving competitive proposals for the services.\nThe commissioner and the Higher Education Advisory Council shall develop a plan for marketing gopher state bonds.\nThe plan must include strategies to:\n(1) inform parents and relatives about the availability of the bonds;\n(2) take orders for the bonds;\n(3) target the sale of the bonds to Minnesota residents, especially parents and relatives of children who are likely to seek higher education;\n(4) ensure that purchase of the bonds by corporations will not prevent individuals and relatives of future students from buying them; and\n(5) market the bonds at the lowest cost to the state.\nThe first $25,000 of gopher state bonds purchased for the benefit of a student must not be considered in determining the financial need of an applicant for the state grant program under section 136A.121. This $25,000 is in addition to any other asset exclusion authorized under chapter 136A.",
	"repealed": false
}