{
	"id": "515A.2-120",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-120",
	"title": "515A.2-120 TERMINATION OF CONDOMINIUM.",
	"text": "(a) Except in the case of a taking of all the units by eminent domain (section 515A.1-107), a condominium may be terminated only by agreement of unit owners of units to which at least 80 percent of the votes in the association are allocated, and 80 percent of the first mortgagees of the units (each mortgagee having one vote per unit financed), or any larger percentage the declaration specifies. The declaration may specify a smaller percentage only if all of the units in the condominium are restricted exclusively to nonresidential uses.\n(b) An agreement of unit owners and mortgagees to terminate a condominium must be evidenced by their execution of a termination agreement or ratification thereof. If, pursuant to a termination agreement, the real estate constituting the condominium is to be sold following termination, the termination agreement shall set forth the terms of the sale. A termination agreement and all ratifications thereof shall be effective upon recording in every county in which a portion of the condominium is situated.\n(c) If the termination agreement provides that the real estate constituting the condominium is to be sold following termination, title to that real estate, upon termination, vests in the association as trustee for the holders of all interests in the units. The association as trustee thereafter has all powers necessary and appropriate to effect the sale. Until the sale has been concluded and the proceeds thereof distributed, the association continues in existence with all powers and responsibilities it had before termination whether under the declaration or otherwise. Unless the termination agreement otherwise provides, proceeds of the sale shall be paid to the association as trustee and shall be distributed to the unit owners and holders of an interest as security for an obligation as their interests may appear and according to the priority enjoyed prior to termination in proportion to the respective interests of unit owners as provided in subsection (f). Any interest as security for an obligation formerly affecting a unit shall constitute a claim against the proceeds in the amount existing at the time of termination plus interest and other amounts accrued until distribution. Except as otherwise specified in the termination agreement, as long as the association as trustee holds title to the real estate, each unit owner and successors in interest have the right to use the real estate that formerly constituted the common elements and have an exclusive right to occupancy of the portion of the real estate that formerly constituted the unit and limited common elements. During the period of such occupancy, each unit owner and successors in interest remain liable for all assessments and other obligations imposed on unit owners by sections 515A.1-101 to 515A.4-117, the declaration, or the termination agreement.\n(d) If the real estate constituting the condominium is not to be sold following termination, title to the real estate, upon termination, vests in the unit owners as tenants in common in proportion to their respective interests as provided in subsection (f). Any interests held as security for an obligation and the respective instruments formerly affecting a unit shall be deemed to be an interest affecting the resulting undivided interest in the same manner as they formerly affected the unit. As long as the tenancy in common exists, each unit owner and successors in interest have an exclusive right to occupancy of the portion of the real estate that formerly constituted that unit owner's unit and limited common elements. Unless the termination agreement otherwise provides during the period of tenancy in common, the cotenants and the association shall have the rights and obligations under sections 515A.1-101 to 515A.4-117, the declaration and bylaws and the termination agreement.\n(e) Following termination of the condominium, and after payment of or provision for the claims of the association's creditors, the assets of the association shall be distributed to unit owners and holders of an interest as security for an obligation in proportion to their respective interests as provided in subsection (f). The proceeds of sale described in subsection (c) and held by the association as trustee are not assets of the association.\n(f) The respective interests of unit owners referred to in subsections (c), (d), and (e) are as follows:\n(1) except as provided in paragraph (2), the respective interests of unit owners are the fair market values of their units, limited common elements, and common element interests immediately before the termination, as determined by one or more independent appraisers selected by the association. The decision of the independent appraisers shall be delivered in the manner provided in section 515A.1-115 addressed to the \"Occupant Entitled to Legal Notice\" at each unit and the first mortgagee of each unit at its last known address and becomes final unless disapproved within 30 days after delivery by unit owners of units to which 25 percent of the votes in the association are allocated or by 25 percent of the first mortgagees, each mortgagee having one vote per unit financed. The proportion of any unit owner's interest to that of all unit owners is determined by dividing the fair market value of that unit owner's interest by the total fair market values of the interests of all unit owners.\n(2) if any unit is destroyed to the extent that an appraisal of the fair market value thereof prior to destruction cannot be made and there is not satisfactory evidence to afford such an appraisal, the interests of all unit owners are their respective common element interests immediately before the termination.",
	"repealed": false
}