{
	"id": "256.478",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.478",
	"title": "256.478 TRANSITION TO COMMUNITY INITIATIVE.",
	"text": "(a) The commissioner shall establish the transition to community initiative to award grants to serve individuals who are not eligible for medical assistance or for whom goods, supports, and services not covered by medical assistance would allow them to:\n(1) live in the least restrictive setting and as independently as possible;\n(2) access services that support short- and long-term needs for developmental growth or individualized treatment needs;\n(3) build or maintain relationships with family and friends; and\n(4) participate in community life.\n(b) Grantees must ensure that individuals are engaged in a process that involves person-centered planning and informed choice decision-making. The informed choice decision-making process must provide accessible written information and be experiential whenever possible, and must engage family members, legal guardians, or natural supports, as appropriate and whenever possible.\nAn individual is eligible for the transition to community initiative if the individual can demonstrate that current services are not capable of meeting individual treatment and service needs that can be met in the community with support, and the individual meets at least one of the following criteria:\n(1) the person meets the criteria under section 256B.092, subdivision 13, or 256B.49, subdivision 24;\n(2) the person has met treatment objectives and no longer requires a hospital-level care, residential-level care, or a secure treatment setting, but the person's discharge from the Anoka Metro Regional Treatment Center, the Minnesota Forensic Mental Health Program, the Child and Adolescent Behavioral Health Hospital program, a psychiatric residential treatment facility under section 256B.0941, intensive residential treatment services under section 256B.0622, children's residential services under section 245.4882, juvenile detention facility, county supervised building, or a hospital would be substantially delayed without additional resources available through the transitions to community initiative;\n(3) the person (i) is receiving customized living services reimbursed under section 256B.4914, 24-hour customized living services reimbursed under section 256B.4914, or community residential services reimbursed under section 256B.4914; (ii) expresses a desire to move; and (iii) has received approval from the commissioner; or\n(4) the person can demonstrate that the person's needs are beyond the scope of current service designs and grant funding can support the inclusion of additional supports for the person to access appropriate treatment and services in the least restrictive environment.\nGrant funds may be used for but are not limited to the following:\n(1) increasing access to home and community-based services for an individual;\n(2) improving caregiver-child relationships and aiding progress toward treatment goals, including support for the individual to return to live in their home; and\n(3) reducing emergency department visits.\nProgram evaluation is based on but not limited to the following criteria:\n(1) expediting discharges for individuals who no longer need hospital level of care;\n(2) individuals obtaining and retaining housing, including successfully returning to live with support in their home;\n(3) individuals maintaining community living by diverting admission to Anoka Metro Regional Treatment Center and Forensic Mental Health Program;\n(4) reducing recidivism rates of individuals returning to state institutions; and\n(5) individuals' ability to live in the least restrictive community setting.",
	"repealed": false
}