{
	"id": "197.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.75",
	"title": "197.75 EDUCATIONAL ASSISTANCE; SURVIVING CHILDREN AND SPOUSES; VETERANS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of veterans affairs.\n(c) \"Deceased veteran\" means a veteran who has died as a result of the person's military service, as determined by the United States Veterans Administration, and who was a resident of this state: (1) within six months of entering the United States armed forces, or (2) for the six months preceding the veteran's date of death.\n(d) \"Eligible child\" means a person who:\n(1) is the natural or adopted child or stepchild of a deceased veteran; and\n(2) is a student making satisfactory academic progress at an eligible institution of higher education.\n(e) \"Eligible institution\" means a postsecondary educational institution located in this state that either is operated by this state or the Board of Regents of the University of Minnesota, or is licensed or registered with the Office of Higher Education.\n(f) \"Eligible spouse\" means the surviving spouse of a deceased veteran.\n(g) \"Eligible veteran\" means a veteran who:\n(1) is a student making satisfactory academic progress at an eligible institution of higher education;\n(2) had Minnesota as the person's state of residence at the time of the person's enlistment or any reenlistment into the United States armed forces, as shown by the person's federal form DD-214 or other official documentation to the satisfaction of the commissioner;\n(3) except for benefits under this section, has no remaining military or veteran-related educational assistance benefits for which the person may have been entitled; and\n(4) while using the educational assistance authorized in this section, remains a resident student as defined in section 136A.101, subdivision 8.\n(h) \"Satisfactory academic progress\" has the meaning given in section 136A.101, subdivision 10.\n(i) \"Student\" has the meaning given in section 136A.101, subdivision 7.\n(j) \"Veteran\" has the meaning given in section 197.447.\n(a) The commissioner of veterans affairs shall spend a biennial appropriation to provide an educational assistance stipend of $750 each year for each eligible child and each eligible spouse, and a single payment of $750 for each eligible veteran. This stipend is not available for any person who has attained a bachelor's or equivalent degree.\n(b) Each eligible child and each eligible spouse shall be admitted to any Minnesota public eligible institution free of tuition until the person has attained a bachelor's or equivalent degree.\n(c) Payments of benefits authorized under this section shall be made directly to the participating eligible institutions or to eligible individuals, as determined by the commissioner.\nApproval for benefits under this section shall require submission of the following evidence: application, proof of military service, and, where applicable, proof of residency and a statement from the United States Veterans Administration that the veteran has exhausted entitlement to federal educational benefits through use thereof or that the veteran died of service connected disabilities. Upon submission of satisfactory proof of eligibility, benefits shall be provided from the date of application and notification of approval shall be sent to the educational institution and applicant.\nThe commissioner shall establish policies and procedures for determining eligibility and payment under this section.\n(a) Each Minnesota public postsecondary institution must continue to participate in the educational assistance program authorized in this section during both peacetime and times of war.\n(b) Any participating eligible institution not described in paragraph (a) may suspend or terminate its participation in the program at the end of any academic semester or other academic term.\n[Repealed by amendment, 2007 c 45 art 2 s 3]",
	"repealed": false
}