{
	"id": "515B.2-123",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-123",
	"title": "515B.2-123 CHANGE OF FORM OF COMMON INTEREST COMMUNITY.",
	"text": "(a) The legal form of a condominium, planned community or cooperative subject to this chapter may be changed to a condominium or planned community, subject to any requirements contained in the declaration or bylaws of the common interest community, and the following requirements:\n(1) Subject to paragraphs (2) and (3), the change of form shall be approved in writing by the unit owners of units to which at least 80 percent of the votes in the association are allocated, and 80 percent of the first mortgagees of record of the units (each mortgagee having one vote per unit financed). The declaration or bylaws may specify a smaller percentage only if all of the units are restricted to nonresidential use. A declaration and bylaws complying with this chapter shall be approved, subject to the foregoing approval standards, with respect to the new common interest community.\n(2) If the period of declarant control has not expired, the change of form shall also be approved in writing by the declarant.\n(3) If the existing common interest community is a cooperative, the change of form shall also be approved in writing by (i) each holder of a blanket mortgage of record and (ii) 80 percent of the secured parties holding interests in share loans encumbering the cooperative units or memberships (each secured party having one vote per share loan owned).\n(b) Upon approval as provided in subsection (a), the association in the existing common interest community shall have authority to execute the declaration of the new common interest community on behalf of the unit owners of, and all other persons holding an interest in, the units or other property which is a part of the existing common interest community, and to do all other acts necessary to create the new common interest community.\n(c) Upon approval as provided in subsection (a), the association in the existing common interest community shall have a power of attorney coupled with an interest to effect the conveyance of the units or any other real estate owned by the unit owners or the association, which is a part of the existing common interest community, on behalf of the unit owners and all other holders of interests in the common interest community, including without limitation the power to execute all instruments of conveyance and related instruments.\n(d) In a change of legal form under this section, the offer, conveyance or exchange of a unit in the new common interest community to or with the person owning the unit in the existing common interest community shall not be subject to article 4 of this chapter.\n(e) A change of legal form under this section shall not affect any preexisting obligations or liabilities of a declarant under any statute, or under the disclosure statement, declaration or bylaws of the existing common interest community. The declarant of the existing common interest community shall continue to have the rights and obligations of a declarant with respect to the offer and sale of units owned by it or its affiliates in the new common interest community.",
	"repealed": false
}