{
	"id": "317A.441",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.441",
	"title": "317A.441 RIGHT TO VOTE.",
	"text": "(a) Unless the articles or bylaws provide otherwise, each member with voting rights is entitled to one vote on each matter voted on by the members. If a membership stands of record in the names of two or more persons, their acts with respect to voting have the following effect:\n(1) if only one votes, the act binds all; and\n(2) if more than one votes, the vote must be divided on a pro rata basis.\n(b) In the case of a neighborhood organization, members with voting rights are, at a minimum, individuals who are on a preexisting membership list or who, at a meeting of the neighborhood organization, can produce:\n(1) a Minnesota driver's license, Minnesota identification card, or some form of residency verification that indicates the individual resides within the geographic boundaries of the neighborhood organization; or\n(2) proof of ownership or lease of a business or property or proof of being employed by a nonprofit organization, business, or government entity located within the geographic boundaries of the neighborhood, if such members are authorized by the bylaws of the neighborhood organization.\n(c) An individual who resides within the geographic boundaries of a neighborhood organization or meets membership criteria under paragraph (b), clause (2), but lacks the documentation required by paragraph (b), clause (1), may vote at a meeting of the neighborhood organization if a member who has the required documentation vouches for the individual.\n(d) A neighborhood organization through its articles or bylaws may permit voting at its meetings by individuals in addition to those described in paragraph (b) or (c).\n(e) For purposes of this section, \"neighborhood organization\" has the meaning given in section 317A.435, subdivision 4. A neighborhood organization may choose to be governed by paragraphs (b), (c), and (d) by so providing in its articles or bylaws.",
	"repealed": false
}