{
	"id": "18D.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/18D.105",
	"title": "18D.105 CORRECTIVE ACTION ORDERS.",
	"text": "(a) After determining an incident has occurred, the commissioner may order the responsible party to take reasonable and necessary corrective actions.\n(b) The commissioner shall notify the owner of real property where corrective action is ordered that access to the property will be required for the responsible party or the commissioner to take corrective action.\n(c) A political subdivision may not request or order any person to take an action that conflicts with the corrective action ordered by the commissioner.\n(d) The attorney general on request of the commissioner may bring an action to compel corrective action.\nThe commissioner may take corrective action if:\n(1) a responsible party cannot be identified; or\n(2) an identified responsible party cannot or will not comply with a corrective action order issued under subdivision 1.\n(a) To assure an adequate response to an incident, the commissioner may take corrective action without following the procedures of subdivision 1 if the commissioner determines that the incident constitutes a clear and immediate danger requiring immediate action to prevent, minimize, or mitigate damage to the public health and welfare or the environment.\n(b) Before taking an action under this subdivision, the commissioner must make all reasonable efforts, taking into consideration the urgency of the situation, to order a responsible party to take a corrective action and notify the owner of real property where the corrective action is to be taken.\nPassive bioremediation must be considered for pesticide and fertilizer cleanups whenever an assessment of the site determines that there is a low potential risk to public health and the environment. The assessment may include the soil types involved, leaching potential, underlying geology, proximity to ground and surface water, and the soil half-life of the pesticides.\nThe Department of Agriculture is the lead state agency in taking corrective action for incidents.",
	"repealed": false
}