{
	"id": "260C.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.202",
	"title": "260C.202 COURT REVIEW OF DISPOSITION.",
	"text": "If the court orders a child into the home of a parent under the protective supervision of the responsible social services agency or child-placing agency under section 260C.201, subdivision 1, paragraph (a), clause (1), the court shall review the child protective services plan under section 260E.26 at least every 90 days. The court shall notify the parents of the provisions of sections 260C.503 to 260C.521, as required under juvenile court rules.\n(a) If the court orders a child placed in foster care, the court shall review the out-of-home placement plan and the child's placement at least every 90 days as required in juvenile court rules to determine whether continued out-of-home placement is necessary and appropriate or whether the child should be returned home.\n(b) This review is not required if the court has returned the child home, ordered the child permanently placed away from the parent under sections 260C.503 to 260C.521, or terminated rights under section 260C.301. Court review for a child permanently placed away from a parent, including where the child is under guardianship of the commissioner, is governed by section 260C.607.\n(c) When a child is placed in a qualified residential treatment program setting as defined in section 260C.007, subdivision 26d, the responsible social services agency must submit evidence to the court as specified in section 260C.712.\n(d) No later than three months after the child's placement in foster care, the court shall review agency efforts to search for and notify relatives pursuant to section 260C.221, and order that the agency's efforts begin immediately, or continue, if the agency has failed to perform, or has not adequately performed, the duties under that section. The court must order the agency to continue to appropriately engage relatives who responded to the notice under section 260C.221 in placement and case planning decisions and to consider relatives for foster care placement consistent with section 260C.221. Notwithstanding a court's finding that the agency has made reasonable efforts to search for and notify relatives under section 260C.221, the court may order the agency to continue making reasonable efforts to search for, notify, engage, and consider relatives who came to the agency's attention after sending the initial notice under section 260C.221.\n(e) The court shall review the out-of-home placement plan and may modify the plan as provided under section 260C.201, subdivisions 6 and 7.\n(f) When the court transfers the custody of a child to a responsible social services agency resulting in foster care or protective supervision with a noncustodial parent under subdivision 1, the court shall notify the parents of the provisions of sections 260C.204 and 260C.503 to 260C.521, as required under juvenile court rules.\n(g) When a child remains in or returns to foster care pursuant to section 260C.451 and the court has jurisdiction pursuant to section 260C.193, subdivision 6, paragraph (c), the court shall at least annually conduct the review required under section 260C.203.",
	"repealed": false
}