{
	"id": "31.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.103",
	"title": "31.103 FAIR PACKAGING AND LABELING PROVISIONS.",
	"text": "All labels of consumer commodities must conform with the requirements for the declaration of net quantity of contents of section 4 of the Fair Packaging and Labeling Act (United States Code, title 15, section 1451 et seq.) and federal regulations adopted under authority of that act, except to the extent that the commissioner amends the rules under chapter 14. Consumer commodities exempted from the requirements of section 4 of the Fair Packaging and Labeling Act are also exempt from this subdivision.\nThe label of any package of a consumer commodity which bears a representation as to the number of servings of such commodity contained in such package shall bear a statement of the net quantity (in terms of weight, measure, or numerical count) of each such serving.\nNo person shall distribute or cause to be distributed in commerce any packaged consumer commodity if any qualifying words or phrases appear in conjunction with the separate statement of net quantity of contents required by subdivision 1, but nothing in this section shall prohibit supplemental statements, at other places on the package, describing in nondeceptive terms the net quantity of contents; provided, that such supplemental statements of net quantity of contents shall not include any term qualifying a unit of weight, measure, or count that tends to exaggerate the amount of the commodity contained in the package.\nWhenever the commissioner determines that rules containing prohibitions or requirements other than those prescribed by subdivision 1, are necessary to prevent the deception of consumers or to facilitate value comparisons as to any consumer commodity, the commissioner shall promulgate, with respect to that commodity, rules effective to:\n(1) establish and define standards for the characterization of the size of a package enclosing any consumer commodity, which may be used to supplement the label statement of net quantity of contents of packages containing such commodity, but this paragraph shall not be construed as authorizing any limitation on the size, shape, weight, dimensions, or number of packages which may be used to enclose any commodity;\n(2) regulate the placement upon any package containing any commodity, or upon any label affixed to such commodity, of any printed matter stating or representing by implication that such commodity is offered for retail sale at a price lower than the ordinary and customary retail sale price or that a retail sale price advantage is accorded to purchasers thereof by reason of the size of that package or the quantity of its contents;\n(3) require that the label on each package of a consumer commodity bear the common or usual name of such consumer commodity, if any, and, in case such consumer commodity consists of two or more ingredients, the common or usual name of each such ingredient listed in order of decreasing predominance, but nothing in this clause shall be deemed to require that any trade secret be divulged; or\n(4) prevent the nonfunctional slack-fill of packages containing consumer commodities.\nFor the purposes of clause (4), a package shall be deemed to be nonfunctionally slack-filled if it is filled to substantially less than its capacity for reasons other than protection of the contents of such package or the requirements of machines used for enclosing the contents in such package.",
	"repealed": false
}