{
	"id": "259.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.49",
	"title": "259.49 NOTICE, HEARING ON PETITION.",
	"text": "Except as provided in subdivision 3, and subject to section 259.52, notice of the hearing upon a petition to adopt a child must be given to:\n(a) the guardian, if any, of a child;\n(b) the parent of a child if:\n(1) the person's name appears on the child's birth record, as a parent;\n(2) the person has substantially supported the child;\n(3) the person either was married to the person designated on the birth record as the natural mother within the 325 days before the child's birth or married that person within the ten days after the child's birth;\n(4) the person is openly living with the child or the person designated on the birth record as the natural mother of the child, or both;\n(5) the person has been adjudicated the child's parent;\n(6) the person has filed a paternity action within 30 days after the child's birth and the action is still pending;\n(7) the person and the mother of the child have signed a declaration of parentage under section 257.34 before August 1, 1995, which has not been revoked or a recognition of parentage under section 257.75, which has not been revoked or vacated; or\n(8) the person:\n(i) is not entitled to notice under clauses (1) to (7);\n(ii) has registered with the fathers' adoption registry;\n(iii) after receiving a fathers' adoption registry notice, has timely filed an intent to retain parental rights with entry of appearance form under section 259.52; and\n(iv) within 30 days of receipt of the fathers' adoption registry notice has initiated a paternity action, unless, for good cause shown, he is unable to do so within the 30 days; a paternity action must be initiated by the putative father in district court; application to the public authority for paternity establishment services does not constitute initiation of an action; and\n(c) the child's tribe pursuant to section 260.761, subdivision 3, if the child is an Indian child.\nNotice under this section need not be given to a person listed in this subdivision whose parental rights have been terminated. The notice of the hearing may be waived by a parent, guardian, or other interested party by a writing executed before two competent witnesses and duly acknowledged. The waiver must be filed in the adoption proceedings before the matter is heard.\nSuch notice shall be served, within or without the state, at least 14 days before the date of the hearing, in the manner provided by law for the service of a summons in a civil action. If personal service cannot be made, the court may order service by publication. The petitioner or petitioner's attorneys shall make an affidavit setting forth the effort that was made to locate the parents, and the names and addresses of the known kin of the child. If satisfied that the parents cannot be served personally, the court shall order three weeks published notice to be given, the last publication to be at least ten days before the time set for the hearing. Where service is made by publication the court may cause such further notice to be given as it deems just. If, in the course of the proceedings, the court shall consider that the interests of justice will be promoted it may continue the proceeding and require that such notice as it deems proper shall be served on any person. In the course of proceedings the court may enter reasonable orders for the protection of the child if the court determines that the best interests of the child require such an order.\nWhere a child is adjudicated a dependent or neglected child and a court of competent jurisdiction has appointed a permanent guardian, or where a juvenile court has appointed a guardian after terminating parental rights, no notice of hearing need be given to the parents.",
	"repealed": false
}