{
	"id": "13.461",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.461",
	"title": "13.461 HUMAN SERVICES DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify human services data as other than public, place restrictions on access to government data, or involve data sharing.\n(a) Client consent. Consent for release of information needed to bill the county for services provided to clients is governed by section 245.467, subdivision 5.\n(b) Identity disclosure. Disclosure of the names and addresses of persons receiving mental health services is governed by section 245.467, subdivision 6.\n(c) Release of commitment information for firearms and explosives background check. The release by the Direct Care and Treatment executive board of commitment information to law enforcement agencies for facilitating a firearms or explosives background check is governed by section 246C.15.\n(a) Client consent. Informed written consent necessary for a child to receive mental health services is governed by section 245.4876, subdivision 5.\n(b) Identity disclosure. Disclosure of identities of children receiving mental health services under sections 245.487 to 245.4889, and the identities of their families, is governed by section 245.4876, subdivision 7.\n(c) Children's mental health collaborative. Data shared on individuals served by the collaborative are governed by section 245.493.\n(d) Screening results. The classification of child mental health screening results is governed by section 245.4874, subdivision 1, paragraph (d).\nMS 2022 [Repealed, 2023 c 25 s 190]\nResearch involving effective mental health treatment methods and access to data and other information is governed by section 245.696, subdivision 2.\nAccess by the ombudsman for mental health and developmental disabilities to private data on individuals is provided under section 245.94, subdivision 1.\nAccess by the ombudsperson for family child care providers to private data on individuals is provided under section 245.975, subdivision 4.\nTribal licensing agency access to criminal history data is governed by section 245C.12.\n(a) Access to and sharing of data for human services background studies under chapter 245C are governed by that chapter.\n(b) Disqualifying records that are the subject of an order for expungement are governed by section 245C.22, subdivision 7, paragraph (f).\nData related to child care fraud and recipient fraud investigations are governed by section 142E.58.\nSection 245D.095, subdivision 3, requires certain license holders to protect service recipient records in accordance with specified provisions of this chapter.\nContents of, and access to, records of state hospital patients required to be kept by the Direct Care and Treatment executive board are governed by section 246.13.\nDisclosure of certain data on an individual who was buried on the grounds of a state institution is governed by section 246.33, subdivision 4.\nCertain data received by the Direct Care and Treatment executive board from substance use disorder programs are classified under section 246.64, subdivision 4.\nBlood test results obtained under sections 246.71 to 246.722 are classified under section 246.719.\nData relating to blood-borne pathogen test results are governed by sections 246.719 and 246.72.\nPrepetition screening investigations for judicial commitments are classified as private under section 253B.07, subdivision 1, paragraph (b).\nAccess to health records of a patient being treated for a mental illness for purposes of medication administration is governed by section 253B.0921.\nCounty attorney access to data relating to commitment of certain persons under chapter 253D is governed by that section.\nAccess to records of individuals who are the subject of research or who receive information, assessment, or treatment concerning alcohol or drug abuse is governed by section 254A.09.\n(a) Data practices of the commissioner of children, youth, and families as part of the child mortality review panel are governed by section 142A.03, subdivision 7.\n(b) For American Indian tribes with established child mortality review panels, access to data in section 142A.03, subdivision 7, is governed by section 256.01, subdivision 14b, paragraph (g).\nData practices of the commissioner of children, youth, and families as part of the child fatality and near fatality review team are governed by section 142A.03, subdivision 8.\nData of the vulnerable adult maltreatment review panel are classified under section 256.021.\nDisclosure of private data relating to an investigation conducted by the agency is governed by section 256.045.\nDisclosure of private data on the location of a party to the action is governed by section 518A.82.\nAccess to data of a state agency that is required to fulfill the ombudsman's duties is governed by section 256.9742.\nData held by the ombudsman on aging are classified under section 256.9744.\nAccess to information and disclosure of information collected for purposes of child support enforcement is governed by section 518A.83, subdivisions 1 and 2.\nAccess to welfare data by dental plans contracted to provide services under the medical assistance program is governed by section 256B.037.\nData practices provisions relating to the opioid prescribing improvement program are contained in section 256B.0638, subdivision 6.\nMedical records of medical assistance recipients obtained by the commissioner of human services for purposes of section 256B.27, subdivision 5, are classified under that section.\nData provided to the commissioner of human services by managed care plans relating to contracts and provider payment rates are classified under section 256B.69, subdivisions 9a and 9c.\nPrivacy, data collection, and confidentiality safeguards under the coordinated service delivery system are required under section 256B.77, subdivision 9.\nData sharing with other government agencies that is needed to verify income for eligibility and premium payment is governed by section 256L.05.\nAccess to information for purposes of verifying eligibility for the state soldiers assistance program is governed by section 197.065.\nData collected, maintained, used, or disseminated by the welfare system pertaining to persons selected as legal nonlicensed child care providers by families receiving child care assistance are classified under section 142E.02, subdivision 6, paragraph (a). Child care assistance program payment data is classified under section 142E.02, subdivision 6, paragraph (b).\nData on individuals receiving services under certain programs administered by the Department of Human Services are classified under sections 142F.14, subdivision 7, and 142F.302, subdivision 4.\nCertain data collected, used, or maintained by the recipient of a grant to provide transitional housing are classified under section 256K.48, subdivision 9.\nData sharing involving family services collaboratives is governed by section 142D.15, subdivision 5.\nData on ABLE accounts and designated beneficiaries of ABLE accounts are classified under section 256Q.05, subdivision 7.",
	"repealed": false
}