{
	"id": "62E.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.12",
	"title": "62E.12 MINIMUM BENEFITS OF COMPREHENSIVE HEALTH INSURANCE PLAN.",
	"text": "(a) The association through its comprehensive health insurance plan shall offer policies which provide the benefits of a number one qualified plan and a number two qualified plan, except that the maximum lifetime benefit on these plans shall be $5,000,000; and an extended basic Medicare supplement plan and a basic Medicare supplement plan as described in sections 62A.3099 to 62A.44. The association may also offer a plan that is identical to a number one and number two qualified plan except that it has a $2,000 annual deductible and a $5,000,000 maximum lifetime benefit. The association, subject to the approval of the commissioner, may also offer plans that are identical to the number one or number two qualified plan, except that they have annual deductibles of $5,000 and $10,000, respectively; have limitations on total annual out-of-pocket expenses equal to those annual deductibles and therefore cover 100 percent of the allowable cost of covered services in excess of those annual deductibles; and have a $5,000,000 maximum lifetime benefit. The association, subject to approval of the commissioner, may also offer plans that meet all other requirements of state law except those that are inconsistent with high deductible health plans as defined in sections 220 and 223 of the Internal Revenue Code and supporting regulations. As of January 1, 2006, the association shall no longer be required to offer an extended basic Medicare supplement plan.\n(b) The requirement that a policy issued by the association must be a qualified plan is satisfied if the association contracts with a preferred provider network and the level of benefits for services provided within the network satisfies the requirements of a qualified plan. If the association uses a preferred provider network, payments to nonparticipating providers must meet the minimum requirements of section 72A.20, subdivision 15.\n(c) The association shall offer health maintenance organization contracts in those areas of the state where a health maintenance organization has agreed to make the coverage available and has been selected as a writing carrier.\n(d) Notwithstanding the provisions of section 62E.06 and unless those charges are billed by a provider that is part of the association's preferred provider network, the state plan shall exclude coverage of services of a home care nurse other than on an inpatient basis and any charges for treatment in a hospital or other inpatient facility located outside of the state of Minnesota in which the covered person is receiving treatment for a mental or nervous disorder, unless similar treatment for the mental or nervous disorder is medically necessary, unavailable in Minnesota and provided upon referral by a licensed Minnesota medical practitioner.",
	"repealed": false
}