{
	"id": "13.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.02",
	"title": "13.02 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of the Department of Administration.\n\"Confidential data on individuals\" are data made not public by statute or federal law applicable to the data and are inaccessible to the individual subject of those data.\n\"Criminal justice agencies\" means all state and local prosecution authorities, all state and local law enforcement agencies, the Sentencing Guidelines Commission, the Bureau of Criminal Apprehension, the Department of Corrections, the Minnesota National Guard, and all probation officers who are not part of the judiciary.\n\"Data not on individuals\" are all government data that are not data on individuals.\n\"Data on individuals\" means all government data in which any individual is or can be identified as the subject of that data, unless the appearance of the name or other identifying data can be clearly demonstrated to be only incidental to the data and the data are not accessed by the name or other identifying data of any individual.\n\"Designee\" means any person designated by a responsible authority to be in charge of individual files or systems containing government data and to receive and comply with requests for government data.\n\"Government data\" means all data collected, created, received, maintained or disseminated by any government entity regardless of its physical form, storage media or conditions of use.\n\"Government entity\" means a state agency, statewide system, or political subdivision.\n\"Individual\" means a natural person. In the case of a minor or an incapacitated person as defined in section 524.5-102, subdivision 6, \"individual\" includes a parent or guardian or an individual acting as a parent or guardian in the absence of a parent or guardian, except that the responsible authority shall withhold data from parents or guardians, or individuals acting as parents or guardians in the absence of parents or guardians, upon request by the minor if the responsible authority determines that withholding the data would be in the best interest of the minor.\n\"Not public data\" are any government data classified by statute, federal law, or temporary classification as confidential, private, nonpublic, or protected nonpublic.\n\"Nonpublic data\" are data not on individuals made by statute or federal law applicable to the data: (a) not accessible to the public; and (b) accessible to the subject, if any, of the data.\n\"Person\" means any individual, partnership, corporation, association, business trust, or a legal representative of an organization.\n\"Political subdivision\" means any county, statutory or home rule charter city, school district, special district, any town exercising powers under chapter 368 and located in the metropolitan area, as defined in section 473.121, subdivision 2, and any board, commission, district or authority created pursuant to law, local ordinance or charter provision. It includes any nonprofit corporation which is a community action agency organized pursuant to the Economic Opportunity Act of 1964 (Public Law 88-452) as amended, to qualify for public funds, or any nonprofit social service agency which performs services under contract to a government entity, to the extent that the nonprofit social service agency or nonprofit corporation collects, stores, disseminates, and uses data on individuals because of a contractual relationship with a government entity.\n\"Private data on individuals\" are data made by statute or federal law applicable to the data: (a) not public; and (b) accessible to the individual subject of those data.\n\"Protected nonpublic data\" are data not on individuals made by statute or federal law applicable to the data (a) not public and (b) not accessible to the subject of the data.\n\"Public data not on individuals\" are data accessible to the public pursuant to section 13.03.\n\"Public data on individuals\" are data accessible to the public in accordance with the provisions of section 13.03.\n(a) \"Responsible authority\" in a state agency or statewide system means the state official designated by law or by the commissioner as the individual responsible for the collection, use and dissemination of any set of data on individuals, government data, or summary data.\n(b) \"Responsible authority\" in any political subdivision means the individual designated by the governing body of that political subdivision as the individual responsible for the collection, use, and dissemination of any set of data on individuals, government data, or summary data, unless otherwise provided by state law. Until an individual is designated by the political subdivision's governing body, the responsible authority is:\n(1) for counties, the county coordinator or administrator. If the county does not employ a coordinator or administrator, the responsible authority is the county auditor;\n(2) for statutory or home rule charter cities, the elected or appointed city clerk. If the home rule charter does not provide for an office of city clerk, the responsible authority is the chief clerical officer for filing and record keeping purposes;\n(3) for school districts, the superintendent; and\n(4) for all other political subdivisions, the chief clerical officer for filing and record keeping purposes.\n\"State agency\" means the state, the University of Minnesota, and any office, officer, department, division, bureau, board, commission, authority, district or agency of the state.\n\"Statewide system\" includes any record-keeping system in which government data is collected, stored, disseminated and used by means of a system common to one or more state agencies or more than one of its political subdivisions or any combination of state agencies and political subdivisions.\n\"Summary data\" means statistical records and reports derived from data on individuals but in which individuals are not identified and from which neither their identities nor any other characteristic that could uniquely identify an individual is ascertainable.",
	"repealed": false
}