{
	"id": "151.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.21",
	"title": "151.21 SUBSTITUTION.",
	"text": "Except as provided in this section, it shall be unlawful for any pharmacist or pharmacist intern who dispenses prescriptions, drugs, and medicines to substitute an article different from the one ordered, or deviate in any manner from the requirements of a prescription drug order without the approval of the prescriber.\nWhen a pharmacist receives a paper or hard copy prescription drug order on which the prescriber has personally written in handwriting \"dispense as written\" or \"D.A.W.,\" a prescription sent by electronic transmission on which the prescriber has expressly indicated in a manner consistent with the standards for electronic prescribing under Code of Federal Regulations, title 42, section 423, that the prescription is to be dispensed as transmitted and which bears the prescriber's electronic signature, or an oral prescription for which the prescriber has expressly indicated that the prescription is to be dispensed as communicated, the pharmacist shall dispense the drug as prescribed.\nWhen a pharmacist receives a paper or hard copy prescription on which the prescriber has not personally written in handwriting \"dispense as written\" or \"D.A.W.,\" a prescription sent by electronic transmission on which the prescriber has not expressly indicated in a manner consistent with the standards for electronic prescribing under Code of Federal Regulations, title 42, section 423, that the prescription is to be dispensed as transmitted and which bears the prescriber's electronic signature, or an oral prescription in which the prescriber has not expressly indicated that the prescription is to be dispensed as communicated, and there is available in the pharmacist's stock a less expensive generically equivalent drug or, if a biological product is prescribed, a less expensive interchangeable biological product, then the pharmacist shall, after disclosing the substitution to the purchaser, dispense the generically equivalent drug or the interchangeable biological product, unless the purchaser objects. A pharmacist may also substitute pursuant to the oral instructions of the prescriber. A pharmacist may not substitute a generically equivalent drug unless, in the pharmacist's professional judgment, the substituted drug is therapeutically equivalent and interchangeable to the prescribed drug. A pharmacist may not substitute a biological product unless the United States Food and Drug Administration has determined the substituted biological product to be interchangeable with the prescribed biological product. A pharmacist shall notify the purchaser if the pharmacist is dispensing a drug or biological product other than the specific drug or biological product prescribed.\nNothing in this section permits a prescriber to maintain \"dispense as written\" or \"D.A.W.\" as a default on all prescriptions. Prescribers must add the \"dispense as written\" or \"D.A.W.\" designation to electronic prescriptions individually, as appropriate.\nA pharmacist dispensing a drug under the provisions of subdivision 3 shall not dispense a drug of a higher retail price than that of the drug prescribed. If more than one safely interchangeable drug is available in a pharmacist's stock, then the pharmacist shall dispense the least expensive alternative.\nA pharmacy must post a sign in a conspicuous location and in a typeface easily seen at the counter where prescriptions are dispensed stating: \"In order to save you money, this pharmacy will substitute whenever possible an FDA-approved, less expensive, generic drug product, which is therapeutically equivalent to and safely interchangeable with the one prescribed by your doctor, advanced practice registered nurse, or physician assistant, unless you object to this substitution.\"\nNothing in this section requires a pharmacist to substitute a drug if the substitution will make the transaction ineligible for third-party reimbursement.\nWhen a pharmacist dispenses a brand name legend drug and, at that time, a less expensive generically equivalent drug or interchangeable biological product is also available in the pharmacist's stock, the pharmacist shall disclose to the purchaser that a generically equivalent drug or interchangeable biological product is available.\nSubdivision 3 does not apply when a pharmacist is dispensing a prescribed drug to persons covered under a managed health care plan that maintains a mandatory or closed drug formulary.\n(a) When a pharmacist receives a prescription order by paper or hard copy, by electronic transmission, or by oral instruction from the prescriber, in which the prescriber has not expressly indicated that the prescription is to be dispensed as communicated and the drug prescribed is not covered under the purchaser's health plan or prescription drug plan, the pharmacist may dispense a therapeutically equivalent and interchangeable prescribed drug or biological product that is covered under the purchaser's plan, if the pharmacist has a written protocol with the prescriber that outlines the class of drugs of the same generation and designed for the same indication that can be substituted and the required communication between the pharmacist and the prescriber.\n(b) The pharmacist must inform the purchaser if the pharmacist is dispensing a drug or biological product other than the specific drug or biological product prescribed and the reason for the substitution.\n(c) The pharmacist must communicate to the prescriber the name and manufacturer of the substituted drug that was dispensed and the reason for the substitution, in accordance with the written protocol.\nThe Drug Formulary Committee established under section 256B.0625, subdivision 13c, shall establish a list of drug products that are to be excluded from this section. This list shall be updated on an annual basis and shall be provided to the board for dissemination to pharmacists licensed in the state.\n(a) After a patient has obtained an initial 30-day supply of a prescription drug, and the patient returns to the pharmacy to obtain a refill, a pharmacist may dispense up to a 90-day supply of that prescription drug to the patient when the following requirements are met:\n(1) the total quantity of dosage units dispensed by the pharmacist does not exceed the total quantity of dosage units of the remaining refills authorized by the prescriber; and\n(2) the pharmacist is exercising the pharmacist's professional judgment.\n(b) The initial 30-day supply requirement in paragraph (a) is not required if the prescription has previously been filled with a 90-day supply.\n(c) Notwithstanding paragraph (a), a pharmacist may not exceed the number of dosage units authorized by a prescriber for an initial prescription or subsequent refills if:\n(1) the prescriber has specified on the prescription that, due to medical necessity, the pharmacist may not exceed the number of dosage units identified on the prescription; or\n(2) the prescription drug is a controlled substance, as defined in section 152.01, subdivision 4.\n(a) Within five business days following the dispensing of a biological product, the dispensing pharmacist or the pharmacist's designee shall communicate to the prescriber the name and manufacturer of the biological product dispensed.\n(b) The communication shall be conveyed by making an entry that is electronically accessible to the prescriber through:\n(1) an interoperable electronic medical records system;\n(2) an electronic prescribing technology;\n(3) a pharmacy benefit management system; or\n(4) a pharmacy record.\n(c) Entry into an electronic records system as described in paragraph (b) is presumed to provide notice to the prescriber.\n(d) When electronic communication as specified in paragraph (b) is not possible, the pharmacist or the pharmacist's designee shall communicate to the prescriber the name and manufacturer of the biological product dispensed by using mail, facsimile, telephone, or other secure means of electronic transmission.\n(e) Communication of the name and manufacturer of the biological product dispensed shall not be required if:\n(1) there is no United States Food and Drug Administration-approved interchangeable biological product for the product prescribed; or\n(2) a prescription is being refilled and the biological product being dispensed is the same product dispensed on the prior filling of the prescription.",
	"repealed": false
}