{
	"id": "383B.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.761",
	"title": "383B.761 DISCONTINUANCE OF HENNEPIN COUNTY SOIL AND WATER CONSERVATION DISTRICT; TRANSFER OF DUTIES.",
	"text": "Notwithstanding section 103C.225, the Hennepin County Board of Commissioners may petition the Minnesota Board of Water and Soil Resources to discontinue the Hennepin Soil and Water Conservation District and transfer the duties and authorities of the district to the Hennepin County Board of Commissioners. The Minnesota Board of Water and Soil Resources has 60 days from the receipt of the petition to conduct its review. The Minnesota Board of Water and Soil Resources shall make its determination regarding the petition no later than its first regular meeting following the 60-day review period.\nThe Minnesota Board of Water and Soil Resources shall review the petition submitted under subdivision 1 to determine whether progress toward the goals identified in section 103C.005 can be achieved by discontinuing the Hennepin Soil and Water Conservation District and transferring the duties and authorities of the district to the Hennepin County Board of Commissioners. If the Board of Water and Soil Resources determines that progress toward the goals identified in section 103C.005 can be achieved by the discontinuance of the district and the transfer of district duties and authorities to the Hennepin County Board of Commissioners, the Board of Water and Soil Resources shall order the discontinuance of the Hennepin Soil and Water Conservation District. The order shall become effective within 60 days from the date of the order. The Minnesota Board of Water and Soil Resources may discontinue the Hennepin Soil and Water Conservation District without a referendum.\nUpon discontinuance of the Hennepin Soil and Water Conservation District by the Minnesota Board of Water and Soil Resources, the Hennepin County Board of Commissioners has the duties and authorities of a soil and water conservation district. The Hennepin County Board of Commissioners may assign these duties and responsibilities to the Hennepin County Department of Environmental Services or other county departments as deemed appropriate by the county board. All contracts in effect on the date of the discontinuance of the district, to which the Hennepin Soil and Water Conservation District is a party, remain in force and effect for the period provided in the contracts. Hennepin County shall be substituted for the Hennepin Soil and Water Conservation District as party to the contracts and succeed to the district's rights and duties.\nThe Hennepin Conservation District Board of Supervisors shall transfer the assets of the district to the Hennepin County Board of Commissioners no later than 60 days from the date of the order. The Hennepin County Board of Commissioners shall use the transferred assets for purposes of implementing the transferred duties and authorities.\nUpon discontinuance of the Hennepin Soil and Water Conservation District by the Minnesota Board of Water and Soil Resources, Hennepin County has the eligibility of a soil and water conservation district for state grant funds.\nThe Hennepin County Board of Commissioners may petition the Minnesota Board of Water and Soil Resources to reestablish the Hennepin Soil and Water Conservation District. Alternatively, the Minnesota Board of Water and Soil Resources under its authority in section 103C.201, and after giving notice of corrective actions and time to implement the corrective actions, may reestablish the Hennepin Soil and Water Conservation District if it determines the goals identified in section 103C.005 are not being achieved. The Minnesota Board of Water and Soil Resources may reestablish the Hennepin Soil and Water Conservation District under this subdivision without a referendum.",
	"repealed": false
}