{
	"id": "240.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.06",
	"title": "240.06 RACETRACK LICENSES.",
	"text": "The commission may issue one or more class A licenses, but not more than one to any one person. An application for a class A license must be on a form the commission prescribes and must be accompanied by detailed plans and specifications of the track, buildings, fences, and other improvements. The application must contain:\n(1) the name and address of the applicant and, if it is a corporation, the names of all officers, directors, and shareholders of the corporation and any of its holding corporations;\n(2) if required by the commission, the names of any person or persons holding directly, indirectly, or beneficially an interest of any kind in the applicant or any of its holding corporations, whether the interest is financial, administrative, policy making, or supervisory;\n(3) a statement of the assets and liabilities of the applicant;\n(4) an affidavit executed by the applicant setting forth that no officer, director, or other person with a present or future direct or indirect financial or management interest in the racetrack, to the best of the applicant's knowledge:\n(i) is in default in the payment of an obligation or debt to the state under this chapter;\n(ii) has ever been convicted of a felony in a state or federal court or has a state or federal felony charge pending;\n(iii) is or has been connected with or engaged in any illegal business;\n(iv) has ever been found guilty of fraud or misrepresentation in connection with racing or breeding;\n(v) has ever been found guilty of a violation of a law or rule relating to horse racing, pari-mutuel betting or any other form of gambling which is a serious violation as defined by the commission's rules; or\n(vi) has ever knowingly violated a rule or order of the commission or a law of Minnesota relating to racing;\n(5) an irrevocable consent statement, to be signed by the applicant, which states that suits and actions relating to the subject matter of the application or acts or omissions arising from it may be commenced against the applicant in any court of competent jurisdiction in this state by the service on the secretary of state of any summons, process, or pleadings authorized by the laws of this state. If any summons, process, or pleadings is served upon the secretary of state, it must be by duplicate copies. One copy must be retained in the Office of the Secretary of State and the other copy must be forwarded immediately by certified mail to the address of the applicant, as shown by the records of the commission; and\n(6) an affirmative action plan establishing goals and timetables consistent with the Minnesota Human Rights Act, chapter 363A, and in conformity with the goals established by the commission by rule.\nBefore granting a class A license the commission shall conduct one or more public hearings in the area where the racetrack is or will be located. The commission shall also request comments on the application from the city council or town board of the city or town where the track is or will be located, or from the county board if it is to be located outside a city or town and from the appropriate regional development commission or the Metropolitan Council, as the case may be.\nBefore granting a class A license the commission shall conduct, or request the Division of Alcohol and Gambling Enforcement to conduct, a comprehensive background and financial investigation of the applicant and sources of financing. The commission may charge an applicant an investigation fee to cover the cost of the investigation, and shall from this fee reimburse the division of alcohol and gambling enforcement for its share of the cost of the investigation. The commission has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on class A licensees and applicants.\nIf after considering the information received at the hearing or hearings and the comments requested under subdivision 2, the commission determines that the license will not adversely affect the public health, welfare, and safety, that the racetrack will be operated in accordance with all applicable laws and rules, that the license will not create a competitive situation that will adversely affect racing and the public interest, and that the applicant is financially able to operate a licensed racetrack, it may issue a class A license to the applicant. The license is effective until revoked or suspended by the commission or relinquished by the licensee.\nA class A license may not be issued to any location where the operation of a racetrack is prohibited by a valid local zoning ordinance. Not more than one class A license may be issued by the commission within the seven-county metropolitan area.\n(a) Notwithstanding subdivision 5, the commission may issue one additional class A license within the seven-county metropolitan area, provided that the additional license may only be issued for a facility:\n(1) located more than 20 miles from any other racetrack in existence on January 1, 1987;\n(2) containing a track no larger than five-eighths of a mile in circumference;\n(3) at which standardbred racing is the only form of live horse racing conducted;\n(4) not owned or operated by a governmental entity or a nonprofit organization; and\n(5) that has a current road or highway system adequate to facilitate present and future vehicular traffic expeditiously to and from the facility.\nThe consideration of clause (5) shall prevail when two competing licensees are relatively equal regarding other considerations mandated by law or rule.\n(b) An application for an additional class A license within the seven-county metropolitan area may not delay or adversely affect an application for a class A license for a facility to be located outside the seven-county metropolitan area.\nNotwithstanding subdivision 5, a class A licensed racetrack operating within the seven-county metropolitan area may:\n(1) enter into an agreement with a horsepersons' organization that represents a breed other than the breed racing at the licensee's racetrack under which the licensee agrees to pay a percentage of simulcasting or card club revenues to the purse set-aside account of another class A licensed racetrack operating within the seven-county metropolitan area. The licensee may only enter into such an agreement with a horsepersons' organization that represents a breed other than the breed racing at the licensee's racetrack. All amounts contributed to a class A racetrack under such an agreement must go to purses for races run at that racetrack; and\n(2) conduct simulcasting on all breeds of horses if it:\n(i) enters into an agreement with another class A licensed racetrack within the seven-county metropolitan area regarding simulcasting of any breed of horses raced at such other class A licensed racetrack that the class A racetrack elects to simulcast; and\n(ii) contributes to the purse set-aside account of another class A licensed racetrack operating within the seven-county metropolitan area, and to the breeders fund, an amount equal to the amount that would have been contributed to the set-aside account and the breeders fund, as required by statute, if the simulcast had been conducted at such other class A licensed racetrack. The percentages used to determine the amount of the simulcast contribution to the purse set-aside account and the breeders fund will be the percentage required under law. Contributions to the purse set-aside account shall be used by such other class A licensed racetrack for purses for races conducted by that racetrack in the same manner as if the simulcast had occurred at that racetrack.\nIf a change in the officers, directors, shareholders, or other persons with a present or future direct or indirect financial or management interest in the licensee, or a change of ownership of more than five percent of the licensee's shares is made after the application is filed or the license issued, the applicant or licensee must notify the commission of the changes within five days of their occurrence and provide the affidavit required by subdivision 1, clause (4).\nThe commission:\n(1) may revoke a class A license for (i) a violation of law, order, or rule which in the commission's opinion adversely affects the integrity of horse racing in Minnesota, or for an intentional false statement made in a license application, or (ii) a willful failure to pay any money required to be paid by Laws 1983, chapter 214;\n(2) may revoke a class A license for failure to perform material covenants or representations made in a license application; and\n(3) shall revoke a class A license if live racing has not been conducted on at least 50 racing days assigned by the commission during any period of 12 consecutive months, unless the commission authorizes a shorter period because of circumstances beyond the licensee's control pursuant to section 240.30, subdivision 5.\nThe commission may suspend a class A license for up to one year for a violation of law, order, or rule which in the commission's opinion adversely affects the integrity of horse racing in Minnesota, and may suspend a class A license indefinitely if it determines that the licensee has as an officer, director, shareholder, or other person with a direct, indirect, or beneficial interest a person who is in the commission's opinion inimical to the integrity of horse racing in Minnesota or who cannot be certified under subdivision 1, clause (4).\nA license revocation or suspension under this subdivision is a contested case under sections 14.57 to 14.69 of the Administrative Procedure Act, and is in addition to criminal penalties imposed for a violation of law or rule.\nA class A licensee must provide at no cost to the commission suitable work areas for commission members, officers, employees, and agents, including agents of the Division of Alcohol and Gambling Enforcement, who are directed or requested by the commission to supervise and control racing at the licensed racetrack.",
	"repealed": false
}