{
	"id": "617.262",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.262",
	"title": "617.262 NONCONSENSUAL DISSEMINATION OF A DEEP FAKE DEPICTING INTIMATE PARTS OR SEXUAL ACTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Deep fake\" means any video recording, motion-picture film, sound recording, electronic image, or photograph, or any technological representation of speech or conduct substantially derivative thereof:\n(1) that is so realistic that a reasonable person would believe it depicts speech or conduct of an individual; and\n(2) the production of which was substantially dependent upon technical means, rather than the ability of another individual to physically or verbally impersonate such individual.\n(c) \"Depicted individual\" means an individual in a deep fake who appears to be engaging in speech or conduct in which the individual did not engage.\n(d) \"Dissemination\" means distribution to one or more persons, other than the individual depicted in the deep fake, or publication by any publicly available medium.\n(e) \"Harass\" means an act that would cause a substantial adverse effect on the safety, security, or privacy of a reasonable person.\n(f) \"Intimate parts\" means the genitals, pubic area, anus, or partially or fully exposed nipple of an individual.\n(g) \"Personal information\" means any identifier that permits communication or in-person contact with an individual, including:\n(1) an individual's first and last name, first initial and last name, first name and last initial, or nickname;\n(2) an individual's home, school, or work address;\n(3) an individual's telephone number, email address, or social media account information; or\n(4) an individual's geolocation data.\n(h) \"Sexual act\" means either sexual contact or sexual penetration.\n(i) \"Sexual contact\" means the intentional touching of intimate parts or intentional touching with seminal fluid or sperm onto another individual's body.\n(j) \"Sexual penetration\" means any of the following acts:\n(1) sexual intercourse, cunnilingus, fellatio, or anal intercourse; or\n(2) any intrusion, however slight, into the genital or anal openings of an individual by another's body part or an object used by another for this purpose.\n(k) \"Social media\" means any electronic medium, including an interactive computer service, telephone network, or data network, that allows users to create, share, and view user-generated content.\nIt is a crime to intentionally disseminate a deep fake when:\n(1) the actor knows or reasonably should know that the depicted individual did not consent to the dissemination;\n(2) the deep fake realistically depicts any of the following:\n(i) the intimate parts of another individual presented as the intimate parts of the depicted individual;\n(ii) artificially generated intimate parts presented as the intimate parts of the depicted individual; or\n(iii) the depicted individual engaging in a sexual act; and\n(3) the depicted individual is identifiable:\n(i) from the deep fake itself, by the depicted individual or by another individual; or\n(ii) from the personal information displayed in connection with the deep fake.\n(a) Except as provided in paragraph (b), whoever violates subdivision 2 is guilty of a gross misdemeanor.\n(b) Whoever violates subdivision 2 may be sentenced to imprisonment for not more than three years or to payment of a fine of $5,000, or both, if one of the following factors is present:\n(1) the depicted individual suffers financial loss due to the dissemination of the deep fake;\n(2) the actor disseminates the deep fake with intent to profit from the dissemination;\n(3) the actor maintains an Internet website, online service, online application, or mobile application for the purpose of disseminating the deep fake;\n(4) the actor posts the deep fake on a website;\n(5) the actor disseminates the deep fake with intent to harass the depicted individual;\n(6) the actor obtained the deep fake by committing a violation of section 609.52, 609.746, 609.89, or 609.891; or\n(7) the actor has previously been convicted under this chapter.\nIt is not a defense to a prosecution under this section that the depicted individual consented to the creation or possession of the deep fake, or the private transmission of the deep fake to an individual other than those to whom the deep fake was disseminated.\nNotwithstanding anything to the contrary in section 627.01, an offense committed under this section may be prosecuted in:\n(1) the county where the offense occurred;\n(2) the county of residence of the actor or victim or in the jurisdiction of the victim's designated address if the victim participates in the address confidentiality program established by chapter 5B; or\n(3) only if venue cannot be located in the counties specified under clause (1) or (2), the county where any deep fake is produced, reproduced, found, stored, received, or possessed in violation of this section.\nSubdivision 2 does not apply when:\n(1) the dissemination is made for the purpose of a criminal investigation or prosecution that is otherwise lawful;\n(2) the dissemination is for the purpose of, or in connection with, the reporting of unlawful conduct;\n(3) the dissemination is made in the course of seeking or receiving medical or mental health treatment, and the image is protected from further dissemination;\n(4) the deep fake was obtained in a commercial setting for the purpose of the legal sale of goods or services, including the creation of artistic products for sale or display, and the depicted individual knew, or should have known, that a deep fake would be created and disseminated;\n(5) the deep fake relates to a matter of public interest and dissemination serves a lawful public purpose;\n(6) the dissemination is for legitimate scientific research or educational purposes; or\n(7) the dissemination is made for legal proceedings and is consistent with common practice in civil proceedings necessary for the proper functioning of the criminal justice system, or protected by court order which prohibits any further dissemination.\nNothing in this section shall be construed to impose liability upon the following entities solely as a result of content or information provided by another person:\n(1) an interactive computer service as defined in United States Code, title 47, section 230, paragraph (f), clause (2);\n(2) a provider of public mobile services or private radio services; or\n(3) a telecommunications network or broadband provider.",
	"repealed": false
}