{
	"id": "13.719",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.719",
	"title": "13.719 MISCELLANEOUS INSURANCE DATA.",
	"text": "(a) The following data on eligible persons and enrollees of the state comprehensive health insurance plan are classified as private: all data collected or maintained by the Minnesota Comprehensive Health Association, the writing carrier, and the Department of Commerce.\n(b) The Minnesota Comprehensive Health Association is considered a state agency for purposes of this chapter.\n(c) The Minnesota Comprehensive Health Association may disclose data on eligible persons and enrollees of the state comprehensive health insurance plan to conduct actuarial and research studies, notwithstanding the classification of these data, if:\n(1) the board authorizes the disclosure;\n(2) no individual may be identified in the actuarial or research report;\n(3) materials allowing an individual to be identified are returned or destroyed as soon as they are no longer needed; and\n(4) the actuarial or research organization agrees not to disclose the information unless the disclosure would be permitted under this chapter is made by the association.\nData described in section 62E.13, subdivision 11, are nonpublic data.\n(a) Group workers' compensation self-insurance data. Financial data relating to nonpublic companies that are submitted to the commissioner of commerce for the purpose of obtaining approval to self-insure workers' compensation liability as a group are classified as nonpublic data.\n(b) Workers' compensation self-insurance data. Financial documents, including income statements, balance sheets, statements of changes in financial positions, and supporting financial information, submitted by nonpublic companies seeking to self-insure their workers' compensation liability or to be licensed as self-insurance plan administrators are classified as nonpublic data.\nData that could identify a company that responded to a pollution liability insurance survey taken by the Department of Commerce are classified as nonpublic data.\nThe following data collected and maintained by the Department of Commerce are nonpublic data:\n(a) that portion of any of the following data which would identify the affected insurance company or township mutual company: (1) any order issued pursuant to section 60A.031, subdivision 5, or 67A.241, subdivision 4, and based in whole or in part upon a determination or allegation by the Commerce Department or commissioner that an insurance company or township mutual company is in an unsound, impaired, or potentially unsound or impaired condition; or (2) any stipulation, consent agreement, letter agreement, or similar document evidencing the settlement of any proceeding commenced pursuant to an order of a type described in clause (1), or an agreement between the department and an insurance company or township mutual company entered in lieu of the issuance of an order of the type described in clause (1); and\n(b) any correspondence or attachments relating to the data listed in this subdivision.\n(a) Group self-insurance data. Financial data relating to nonpublic companies that are submitted to the commissioner of commerce for the purpose of obtaining approval to self-insure liability for automobile coverage as a group are classified as nonpublic data.\n(b) Self-insurance; plan administrator data. Financial documents, including income statements, balance sheets, statements of change in financial positions, and supporting financial information submitted by nonpublic companies seeking to self-insure their automobile liability or to be licensed as self-insurance plan administrators are classified as nonpublic data.\n(a) For the purposes of this subdivision, the terms used have the meanings given them in section 268B.01.\n(b) Data on applicants, family members, or employers under chapter 268B are private or nonpublic data, provided that the department may share data collected from applicants with employers or health care providers to the extent necessary to meet the requirements of chapter 268B or other applicable law.\n(c) The data classified under paragraph (b) may be exchanged between the department and the Department of Labor and Industry and the Department of Commerce to the extent necessary to meet the requirements of chapter 268B or the Department of Labor and Industry's enforcement authority over chapter 268B, as provided in section 177.27, or to the extent necessary for the Department of Commerce to review or verify compliance for a private plan under section 268B.10.",
	"repealed": false
}