{
	"id": "260.754",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.754",
	"title": "260.754 POLICY ON TRIBAL-STATE RELATIONS.",
	"text": "(a) The state of Minnesota acknowledges federally recognized Indian Tribes as sovereign political entities that predate the existence of the United States and that have retained inherent sovereign authority to pass their own laws, maintain their own systems of governance, and determine their own jurisdiction. The sovereign authority of Tribes may only be limited by the federal government and not by any action of the state, including the state legislature and state courts.\n(b) Inherently, as members of Indian Tribes recognized by the federal government, Indian people have rights and privileges as members of their Tribe which the state of Minnesota recognizes and protects.\n(c) Indian people have a right to be protected from being disfranchised or deprived of any of the rights and privileges secured to any citizen in the state and to have the recognition and protection of the rights and privileges flowing from their membership in an Indian Tribe by any state action.\n(d) The state of Minnesota recognizes all federally recognized Indian Tribes as having the inherent authority to determine their own jurisdiction for any and all Indian child custody or child placement proceedings regardless of whether the Tribe's members are on or off the reservation and regardless of the procedural posture of the proceeding.\n(e) The state of Minnesota has long recognized the importance of Indian children to their Tribes not only as members of Tribal families and communities, but also as the Tribe's greatest resource as future members and leaders of the Tribe. The vitality of Indian children in the state of Minnesota is essential to the health and welfare of both the state and the Tribes and is essential to the future welfare and continued existence of the child's Tribe.\n(f) The state of Minnesota recognizes that the historical deprivation of rights of Indian people and Indian Tribes has led to disparate out-of-home placement of Indian children.",
	"repealed": false
}