{
	"id": "626.8457",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8457",
	"title": "626.8457 PROFESSIONAL CONDUCT OF PEACE OFFICERS.",
	"text": "By March 1, 1996, the Peace Officer Standards and Training Board shall develop and distribute to all chief law enforcement officers a model policy regarding the professional conduct of peace officers. The policy must address issues regarding professional conduct not addressed by the standards of conduct under Minnesota Rules, part 6700.1600. The policy must define unprofessional conduct to include, but not be limited to, conduct prohibited by section 609.43, whether or not there has been a conviction for a violation of that section. The policy must also describe the procedures that a local law enforcement agency may follow in investigating and disciplining peace officers alleged to have behaved unprofessionally.\nBy July 1, 1996, all chief law enforcement officers shall establish and implement a written policy defining unprofessional conduct and governing the investigation and disposition of cases involving alleged unprofessional conduct by peace officers. A chief law enforcement officer shall adopt a policy identical or substantially similar to the model policy developed by the board under subdivision 1.\n(a) A chief law enforcement officer shall report annually to the board summary data regarding the investigation and disposition of cases involving alleged misconduct, indicating the total number of investigations, the total number by each subject matter, the number dismissed as unfounded, and the number dismissed on grounds that the allegation was unsubstantiated.\n(b) Beginning July 1, 2021, a chief law enforcement officer, in real time, must submit individual peace officer data classified as public data on individuals, as defined by section 13.02, subdivision 15, or private data on individuals, as defined by section 13.02, subdivision 12, and submitted using encrypted data that the board determines is necessary to:\n(1) evaluate the effectiveness of statutorily required training;\n(2) assist the Public Safety Advisory Council in accomplishing the council's duties; and\n(3) allow for the board, the Public Safety Advisory Council, and the board's complaint investigation committee to identify patterns of behavior that suggest an officer is in crisis or is likely to violate a board-mandated model policy.\n(c) The reporting obligation in paragraph (b) is ongoing. A chief law enforcement officer must update data within 30 days of final disposition of a complaint or investigation.\n(d) Law enforcement agencies and political subdivisions are prohibited from entering into a confidentiality agreement that would prevent disclosure of the data identified in paragraph (b) to the board. Any such confidentiality agreement is void as to the requirements of this section.\n(e) By February 1 of each year, the board shall prepare a report that contains summary data provided under paragraph (b). The board must post the report on its publicly accessible website and provide a copy to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy.\n(a) Upon receiving written notice that the board is investigating any allegation of misconduct within its regulatory authority, a chief law enforcement officer, city, county, or public official must cooperate with the board's investigation and any data request from the board.\n(b) Upon written request from the board that a matter alleging misconduct within its regulatory authority has occurred regarding a licensed peace officer, a chief law enforcement officer, city, county, or public official shall provide the board with all requested public and private data about the alleged misconduct involving the licensed peace officer, including any pending or final disciplinary or arbitration proceeding, any settlement or compromise, and any investigative files including but not limited to body worn camera or other audio or video files. Confidential data must only be disclosed when the board specifies that the particular identified data is necessary to fulfill its investigatory obligation concerning an allegation of misconduct within its regulatory authority.\n(c) If a licensed peace officer is discharged or resigns from employment after engaging in any conduct that initiates and results in an investigation of alleged misconduct within the board's regulatory authority, regardless of whether the licensee was criminally charged or an administrative or internal affairs investigation was commenced or completed, a chief law enforcement officer must report the conduct to the board and provide the board with all public and not public data requested under paragraph (b). If the conduct involves the chief law enforcement officer, the overseeing city, county, or public official must report the conduct to the board and provide the board with all public and not public data requested under paragraph (b).\n(d) Data obtained by the board shall be classified and governed as articulated in sections 13.03, subdivision 4, and 13.09, as applicable.\n(e) A chief law enforcement officer, or city, county, or public official is not required to comply with this subdivision when:\n(1) there is an active criminal investigation or active criminal proceeding regarding the same incident or misconduct that is being investigated by the board; or\n(2) an active internal investigation exists regarding the same incident or misconduct that is being investigated by the board during 45 days from the time the request was made by the board. The chief law enforcement officer, or city, county, or public official must comply with this subdivision upon completion of the internal investigation or once 45 days has passed, whichever occurs first.\nA chief law enforcement officer, city, county, or public official and employees of the law enforcement agency are immune from civil or criminal liability, including any liability under chapter 13, for reporting or releasing public or not public data to the board under subdivisions 3 and 4, unless the chief law enforcement officer, city, county, or public official or employees of the law enforcement agency presented false information to the board with the intention of causing reputational harm to the peace officer.",
	"repealed": false
}