{
	"id": "306.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/306.79",
	"title": "306.79 PRINCIPAL INVIOLATE; INVESTED IN CERTAIN SECURITIES.",
	"text": "The principal of a permanent care and improvement fund created under section 306.76 must forever remain intact and invested by the trustees only in the same class of securities in which savings banks are authorized by the laws of this state to invest their funds. However, the association may, by resolution adopted by vote of at least two-thirds of the members of its board of trustees at any authorized meeting of the board, authorize the withdrawal and use of not more than 50 percent of the principal of the fund to acquire additional land for cemetery purposes for the erection of a chapel, greenhouse, or other buildings desirable or necessary for the operation of the cemetery, for the building or improvement of roads and avenues in the cemetery, or for both of those purposes. However, the fund must not be diminished to an amount less than $1,000 per acre for each acre of land in the cemetery. Upon presentation to the trustees of a certified copy of the adopted resolution, the trustees shall at once comply with it and are then released from further liability for the part of the funds withdrawn and delivered to the association. The trustees of the funds shall, at least semiannually, turn over to the association the entire net income from the fund, which shall be used by the association solely for the care, maintenance, and improvement of the cemetery and the avenues leading to it. But if any part of the income is not spent or appropriated by the association for a period of one year after the income has been received by it, the income must be returned to the trustees and invested by them as a part of the principal of the fund. No trustee or board of trustees may receive as compensation for acting as trustee any amount in each year in excess of five percent of the income derived from the fund in its hands.",
	"repealed": false
}