{
	"id": "394.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.37",
	"title": "394.37 ENFORCEMENT.",
	"text": "The board shall provide for the enforcement of sections 394.21 to 394.37 and of ordinances and regulations made thereunder, and may impose enforcement duties on any officer, department, agency, or employee of the county. In a county in which subdivision regulations or controls are in force and have been filed or recorded as provided in section 394.35, the board may by ordinance require that a copy of some or all instruments which convey real estate be submitted by the county recorder to the administrative officer as provided in section 394.29, for review after recording. The officer shall examine each such instrument to determine whether the proposed conveyance complies with the subdivision and platting regulations of the county. If the conveyance does not comply with regulations, the administrative officer shall give notice by mail of the potential violation to the parties to the conveyance.\nIt is declared unlawful for any person to violate any of the terms and provisions of sections 394.21 to 394.37 or the provisions of any ordinance, regulation, or other official control adopted by the board. Violation thereof shall be a misdemeanor. All fines for violations shall be paid to the county and shall be credited to the general revenue fund.\nIn the event of a violation or a threatened violation of sections 394.21 to 394.37 or of any ordinance, regulation, or other official control adopted hereunder, the board, or any member thereof, in addition to other remedies, may institute appropriate actions or proceedings to prevent, restrain, correct, or abate such violations or threatened violations and it is the duty of the county attorney to institute such action.\nAny taxpayer of the county may institute mandamus proceedings in district court to compel specific performance by the proper official or officials of any duty required by sections 394.21 to 394.37 or by any ordinance adopted thereunder.",
	"repealed": false
}