{
	"id": "34A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/34A.06",
	"title": "34A.06 ADMINISTRATIVE ACTIONS.",
	"text": "(a) The commissioner may enforce this chapter by written warning, administrative meeting, cease and desist, forced sale, detention, embargo, condemnation, citation, corrective action order, seizure, agreement, withdrawal from distribution, or administrative penalty if the commissioner determines that the remedy is in the public interest.\n(b) For facilities required to submit a plan review under rules of the commissioner of agriculture, the commissioner may withdraw by written order the approval of a facility or equipment if:\n(1) hazards to human life exist; or\n(2) there is satisfactory evidence that the person to whom the approval was issued has used fraudulent or deceptive practices to evade or attempt to evade provisions of this chapter.\n(c) Any action under this subdivision may be appealed pursuant to section 34A.08.\n(a) The commissioner may revoke, suspend, limit, modify, or refuse to grant or renew a registration, listing, permit, license, or certification if a person violates or has violated this chapter within the last three years.\n(b) The commissioner may revoke, suspend, limit, modify, or refuse to grant or renew a registration, listing, permit, license, or certification to a person from another state if that person has had a registration, permit, license, or certification denied, revoked, or suspended by another state for an offense reasonably related to the requirements, qualifications, or duties of a registration, permit, license, or certification issued under this chapter.\n(c) The commissioner may revoke, suspend, limit, modify, or refuse to grant or renew a registration, listing, permit, license, or certification to a person after receiving satisfactory evidence that the registrant, permittee, licensee, or certificate holder has used fraudulent and deceptive practices in the evasion or attempted evasion of this chapter.\n(d) A registration, listing, permit, license, or certification may not be revoked or suspended until the registrant, permittee, licensee, or certificate holder has been given opportunity for a hearing by the commissioner. After receiving notice of revocation or suspension, a registrant, permittee, licensee, or certificate holder has ten days to request a hearing, or another time period mutually agreed to by both parties. If no request is made within ten days or other agreed-upon time, the registration, listing, permit, license, or certification is revoked or suspended. In the case of a refusal to grant a registration, listing, permit, license, or certification, the registrant, permittee, licensee, or certificate holder has ten days from notice of refusal to request a hearing. Upon receiving a request for hearing, the department shall proceed pursuant to section 34A.08, subdivision 2.",
	"repealed": false
}