{
	"id": "169.222",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.222",
	"title": "169.222 OPERATION OF BICYCLE.",
	"text": "(a) Every person operating a bicycle has all of the rights and duties applicable to the driver of any other vehicle by this chapter, except in respect to those provisions in this chapter relating expressly to bicycles and in respect to those provisions of this chapter which by their nature cannot reasonably be applied to bicycles. This subdivision applies to a bicycle operating on the shoulder of a roadway.\n(b) A person lawfully operating a bicycle (1) on a sidewalk, or (2) across a roadway or shoulder while using a crosswalk has all the rights and duties applicable to a pedestrian under the same circumstances.\n(a) For purposes of this subdivision,\"bicycle\" includes a tandem bicycle, electric-assisted bicycle, cargo or utility bicycle, or trailer.\n(b) No person may operate a bicycle while carrying more than the number of riders for which the bicycle is designed or equipped.\n(c) Notwithstanding paragraph (b), an adult bicycle operator may carry a child in a trailer or seat designed for carrying children that is securely attached to a bicycle.\nPersons riding upon any bicycle, coaster, roller skates, toboggan, sled, skateboard, or toy vehicle shall not attach the same or themselves to any street car or vehicle upon a roadway.\n(a) Every person operating a bicycle on a road must ride as close to the right-hand curb or edge of the road as the bicycle operator determines is safe. A person operating a bicycle is not required to ride as close to the right-hand curb or edge when:\n(1) overtaking and passing another vehicle proceeding in the same direction;\n(2) preparing for a left turn at an intersection or into a private road or driveway;\n(3) reasonably necessary to avoid conditions that make it unsafe to continue along the right-hand curb or edge, including fixed or moving objects, vehicles, pedestrians, animals, surface hazards, or narrow-width lanes;\n(4) operating on the shoulder of a roadway or in a bicycle lane; or\n(5) operating in a right-hand turn lane before entering an intersection.\n(b) If a bicycle is traveling on a shoulder of a roadway, the bicycle operator must travel in the same direction as adjacent vehicular traffic.\n(c) Persons riding bicycles upon a roadway or shoulder must not ride more than two abreast and, on a laned roadway, shall ride within a single lane.\n(d) A person operating a bicycle upon a sidewalk, or across a roadway or shoulder on a crosswalk, must yield the right-of-way to any pedestrian and give an audible signal when necessary before overtaking and passing any pedestrian. A person must not ride a bicycle upon a sidewalk within a business district unless permitted by local authorities. Local authorities may prohibit the operation of bicycles on any sidewalk or crosswalk under their jurisdiction.\n(e) An individual operating a bicycle or other vehicle on a bikeway must (1) give an audible signal a safe distance prior to overtaking a bicycle or individual, (2) leave a safe clearance distance when overtaking a bicycle or individual proceeding in the same direction, and (3) maintain clearance until safely past the overtaken bicycle or individual.\n(f) Notwithstanding section 169.06, subdivision 4, a bicycle operator may cross an intersection proceeding from the leftmost one-third of a dedicated right-hand turn lane without turning right.\n(a) For purposes of this subdivision, \"in the vicinity\" means located in an intersection or approaching an intersection in a manner that constitutes a hazard of collision during the time that a bicycle operator would occupy the intersection.\n(b) A bicycle operator who approaches a stop sign must slow to a speed that allows for stopping before entering the intersection or the nearest crosswalk. Notwithstanding subdivision 1 and section 169.06, subdivision 4, if there is not a vehicle in the vicinity, the operator may make a turn or proceed through the intersection without stopping.\n(c) Nothing in this subdivision alters the right-of-way requirements under section 169.20. The provisions under this subdivision do not apply when traffic is controlled by a peace officer or a person authorized to control traffic under section 169.06.\nNo person operating a bicycle shall carry any package, bundle, or article which prevents the driver from keeping at least one hand upon the handle bars or from properly operating the brakes of the bicycle.\n(a) No person shall operate a bicycle at nighttime unless the bicycle or its operator is equipped with (1) a lamp which emits a white light visible from a distance of at least 500 feet to the front; and (2) a red reflector of a type approved by the Department of Public Safety which is visible from all distances from 100 feet to 600 feet to the rear when directly in front of lawful lower beams of headlamps on a motor vehicle. A bicycle equipped with lamps that are visible from a distance of at least 500 feet from both the front and the rear is deemed to fully comply with this paragraph.\n(b) No person may operate a bicycle at any time when there is not sufficient light to render persons and vehicles on the highway clearly discernible at a distance of 500 feet ahead unless the bicycle or its operator is equipped with reflective surfaces that shall be visible during the hours of darkness from 600 feet when viewed in front of lawful lower beams of headlamps on a motor vehicle. The reflective surfaces shall include reflective materials on each side of each pedal to indicate their presence from the front or the rear and with a minimum of 20 square inches of reflective material on each side of the bicycle or its operator. Any bicycle equipped with side reflectors as required by regulations for new bicycles prescribed by the United States Consumer Product Safety Commission shall be considered to meet the requirements for side reflectorization contained in this subdivision.\n(c) A bicycle may be equipped with a front lamp that emits a white flashing signal, or a rear lamp that emits a red flashing signal, or both.\n(d) A bicycle may be equipped with tires having studs, spikes, or other protuberances designed to increase traction.\n(e) No person shall operate a bicycle unless it is equipped with a rear brake or front and rear brakes which will enable the operator to make a braked wheel skid on dry, level, clean pavement. A bicycle equipped with a direct or fixed gear that can make the rear wheel skid on dry, level, clean pavement shall be deemed to fully comply with this paragraph.\n(f) A bicycle may be equipped with a horn or bell designed to alert motor vehicles, other bicycles, and pedestrians of the bicycle's presence.\n(g) No person shall operate upon a highway any two-wheeled bicycle equipped with handlebars so raised that the operator must elevate the hands above the level of the shoulders in order to grasp the normal steering grip area.\n(h) No person shall operate upon a highway any bicycle which is of such a size as to prevent the operator from stopping the bicycle, supporting it with at least one foot on the highway surface and restarting in a safe manner.\n(a) A person may operate an electric-assisted bicycle in the same manner as provided for operation of other bicycles, including but not limited to operation on the shoulder of a roadway, a bicycle lane, and a bicycle route, and operation without the motor engaged on a bikeway or bicycle trail.\n(b) A person may operate a class 1 or class 2 electric-assisted bicycle with the motor engaged on a bicycle path, bicycle trail, or shared use path unless prohibited under section 85.015, subdivision 1d; 85.018, subdivision 2, paragraph (d); or 160.263, subdivision 2, paragraph (b), as applicable.\n(c) A person may operate a class 3 electric-assisted bicycle or multiple mode electric-assisted bicycle with the motor engaged on a bicycle path, bicycle trail, or shared use path unless the local authority or state agency having jurisdiction over the bicycle path or trail prohibits the operation.\n(d) The local authority or state agency having jurisdiction over a trail or over a bike park that is designated as nonmotorized and that has a natural surface tread made by clearing and grading the native soil with no added surfacing materials may regulate the operation of an electric-assisted bicycle.\n(e) A person under the age of 15 must not operate an electric-assisted bicycle.\n(a) The manufacturer or distributor of an electric-assisted bicycle must apply a label to the bicycle that is permanently affixed in a prominent location. The label must contain the class number, top assisted speed, and motor wattage of the electric-assisted bicycle, and must be printed in a legible font with at least 9-point type. A multiple mode electric-assisted bicycle must have labeling that identifies the highest class or each of the electric-assisted bicycle classes in which it is capable of operating.\n(b) A person must not modify an electric-assisted bicycle to change the motor-powered speed capability or motor engagement so that the bicycle no longer meets the requirements for the applicable class, unless:\n(1) the person replaces the label required in paragraph (a) with revised information; or\n(2) for a vehicle that no longer meets the requirements for any electric-assisted bicycle class, the person removes the labeling as an electric-assisted bicycle.\n(c) An electric-assisted bicycle must operate in a manner so that the electric motor is disengaged or ceases to function: (1) when the brakes are applied; or (2) except for a class 2 electric-assisted bicycle or a multiple mode electric-assisted bicycle operating in class 2 mode, when the rider stops pedaling.\n(d) A class 3 electric-assisted bicycle or multiple mode electric-assisted bicycle must be equipped with a speedometer that displays the speed at which the bicycle is traveling in miles per hour.\n(e) A multiple mode electric-assisted bicycle equipped with a throttle must not be capable of exceeding 20 miles per hour on motorized propulsion alone in any mode when the throttle is engaged.\n(a) No person shall sell or offer for sale any new bicycle unless it is equipped with reflectors and other equipment as required by subdivision 6, paragraphs (b) and (e) and by applicable regulations for new bicycles prescribed by the United States Consumer Product Safety Commission.\n(b) Notwithstanding paragraph (a), a new bicycle may be sold or offered for sale without pedals if the bicycle otherwise meets the requirements of paragraph (a).\nAn arm signal to turn right or left shall be given continuously during the last 100 feet traveled by the bicycle before turning, unless the arm is needed to control the bicycle, and shall be given while the bicycle is stopped waiting to turn.\n(a) A person may park a bicycle on a sidewalk unless prohibited or restricted by local authorities. A bicycle parked on a sidewalk shall not impede the normal and reasonable movement of pedestrian or other traffic.\n(b) A bicycle may be parked on a roadway at any location where parking is allowed if it is parked in such a manner that it does not obstruct the movement of a legally parked motor vehicle.\n(a) Bicycle events, parades, contests, or racing on a highway shall not be unlawful when approved by state or local authorities having jurisdiction over that highway. Approval shall be granted only under conditions which assure reasonable safety for all participants, spectators and other highway users, and which prevent unreasonable interference with traffic flow which would seriously inconvenience other highway users.\n(b) By agreement with the approving authority, participants in an approved bicycle highway event may be exempted from compliance with any traffic laws otherwise applicable thereto, provided that traffic control is adequate to assure the safety of all highway users.\nThe provisions of this section governing operation of bicycles do not apply to bicycles operated by peace officers while performing their duties.",
	"repealed": false
}