{
	"id": "62A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.31",
	"title": "62A.31 MEDICARE SUPPLEMENT BENEFITS; MINIMUM STANDARDS.",
	"text": "No individual or group policy, certificate, subscriber contract issued by a health service plan corporation regulated under chapter 62C, or other evidence of accident and health insurance the effect or purpose of which is to supplement Medicare coverage, including to supplement coverage under Medicare Advantage plans established under Medicare Part C, issued or delivered in this state or offered to a resident of this state shall be sold or issued to an individual covered by Medicare unless the requirements in subdivisions 1a to 1w are met.\n[See Note.]\nThe policy must provide a minimum of the coverage set out in subdivision 2 and for an extended basic plan, the additional requirements of section 62E.07.\nThe policy must cover preexisting conditions during the first six months of coverage if the insured was not diagnosed or treated for the particular condition during the 90 days immediately preceding the effective date of coverage.\n[See Note.]\nThe policy must contain a provision that the plan will not be canceled or nonrenewed on the grounds of the deterioration of health of the insured.\nBefore the policy is sold or issued, an offer of both categories of Medicare supplement insurance must be made to the individual, together with an explanation of both coverages.\nAn outline of coverage as provided in section 62A.39 must be delivered at the time of application and prior to payment of any premium and, except for direct response policies, an acknowledgment of receipt of this outline must be obtained from the applicant.\n(a) The policy or certificate must provide that benefits and premiums under the policy or certificate shall be suspended for any period that may be provided by federal regulation at the request of the policyholder or certificate holder for the period, not to exceed 24 months, in which the policyholder or certificate holder has applied for and is determined to be entitled to medical assistance under title XIX of the Social Security Act, but only if the policyholder or certificate holder notifies the issuer of the policy or certificate within 90 days after the date the individual becomes entitled to this assistance.\n(b) If suspension occurs and if the policyholder or certificate holder loses entitlement to this medical assistance, the policy or certificate shall be automatically reinstated, effective as of the date of termination of this entitlement, if the policyholder or certificate holder provides notice of loss of the entitlement within 90 days after the date of the loss and pays the premium attributable to the period, effective as of the date of termination of entitlement.\n(c) The policy must provide that upon reinstatement (1) there is no waiting period with respect to treatment of preexisting conditions, (2) coverage is provided which is substantially equivalent to coverage in effect before the date of the suspension. If the suspended policy provided coverage for outpatient prescription drugs, reinstitution of the policy for Medicare Part D enrollees must be without coverage for outpatient prescription drugs and must otherwise provide coverage substantially equivalent to the coverage in effect before the date of suspension, and (3) premiums are classified on terms that are at least as favorable to the policyholder or certificate holder as the premium classification terms that would have applied to the policyholder or certificate holder had coverage not been suspended.\n[See Note.]\nThe written statement required by an application for Medicare supplement insurance pursuant to section 62A.43, subdivision 1, shall be made on a form, approved by the commissioner, that states that counseling services may be available in the state to provide advice concerning the purchase of Medicare supplement policies and enrollment under the Medicaid program.\nNo health carrier issuing Medicare-related coverage in this state may impose preexisting condition limitations or otherwise deny or condition the issuance or effectiveness of any such coverage available for sale in this state, nor may it discriminate in the pricing of such coverage, because of the health status, claims experience, receipt of health care, medical condition, or age of an applicant where an application for such coverage is submitted: (1) prior to or during the six-month period beginning with the first day of the month in which an individual first enrolled for benefits under Medicare Part B; or (2) during the open enrollment period. This subdivision applies to each Medicare-related coverage offered by a health carrier regardless of whether the individual has attained the age of 65 years. If an individual who is enrolled in Medicare Part B due to disability status is involuntarily disenrolled due to loss of disability status, the individual is eligible for another six-month enrollment period provided under this subdivision beginning the first day of the month in which the individual later becomes eligible for and enrolls again in Medicare Part B and during the open enrollment period. An individual who is or was previously enrolled in Medicare Part B due to disability status is eligible for another six-month enrollment period under this subdivision beginning the first day of the month in which the individual has attained the age of 65 years and either maintains enrollment in, or enrolls again in, Medicare Part B and during the open enrollment period. If an individual enrolled in Medicare Part B voluntarily disenrolls from Medicare Part B because the individual becomes enrolled under an employee welfare benefit plan, the individual is eligible for another six-month enrollment period, as provided in this subdivision, beginning the first day of the month in which the individual later becomes eligible for and enrolls again in Medicare Part B and during the open enrollment period.\n[See Note.]\nIf a Medicare supplement policy or certificate replaces another Medicare supplement policy or certificate, the issuer of the replacing policy or certificate shall waive any time periods applicable to preexisting conditions, waiting periods, elimination periods, and probationary periods in the new Medicare supplement policy or certificate for benefits to the extent the time was spent under the original policy or certificate. For purposes of this subdivision, \"Medicare supplement policy or certificate\" means all coverage described in section 62A.011, subdivision 3, clause (10).\n[See Note.]\nThe policy must have been filed with and approved by the department as meeting all the requirements of sections 62A.3099 to 62A.44.\nThe policy must guarantee renewability.\n(a) Only the standards for renewability provided in this subdivision may be used in Medicare supplement insurance policy forms.\n(b) No issuer of Medicare supplement insurance policies may cancel or nonrenew a Medicare supplement policy or certificate for any reason other than nonpayment of premium or material misrepresentation.\n(c) If a group Medicare supplement insurance policy is terminated by the group policyholder and is not replaced as provided in this clause, the issuer shall offer certificate holders an individual Medicare supplement policy which, at the option of the certificate holder, provides for continuation of the benefits contained in the group policy; or provides for such benefits and benefit packages as otherwise meet the requirements of this clause.\n(d) If an individual is a certificate holder in a group Medicare supplement insurance policy and the individual terminates membership in the group, the issuer of the policy shall offer the certificate holder the conversion opportunities described in this clause; or offer the certificate holder continuation of coverage under the group policy.\n(e) If a Medicare supplement policy eliminates an outpatient prescription drug benefit as a result of requirements imposed by the Medicare Prescription Drug, Improvement, and Modernization Act of 2003, the policy as modified for that purpose is deemed to satisfy the guaranteed renewal requirements of this subdivision.\nA Medicare supplement policy or certificate shall not indemnify against losses resulting from sickness on a different basis than losses resulting from accidents.\nA Medicare supplement policy or certificate shall provide that benefits designed to cover cost sharing amounts under Medicare will be changed automatically to coincide with any changes in the applicable Medicare deductible amount and co-payment percentage factors. Premiums may be modified to correspond with the changes.\nAs soon as practicable, but no later than 30 days prior to the annual effective date of any Medicare benefit changes, an issuer shall notify its policyholders and certificate holders of modifications it has made to Medicare supplement insurance policies or certificates in a format acceptable to the commissioner. Such notice shall:\n(1) include a description of revisions to the Medicare program and a description of each modification made to the coverage provided under the Medicare supplement policy or certificate; and\n(2) inform each policyholder or certificate holder as to when any premium adjustment is to be made, due to changes in Medicare.\nThe notice of benefit modifications and any premium adjustments must be in outline form and in clear and simple terms so as to facilitate comprehension.\nThe notices must not contain or be accompanied by any solicitation.\n(a) Termination by an issuer of a Medicare supplement policy or certificate shall be without prejudice to any continuous loss that began while the policy or certificate was in force, but the extension of benefits beyond the period during which the policy or certificate was in force may be conditioned on the continuous total disability of the insured, limited to the duration of the policy or certificate benefit period, if any, or payment of the maximum benefits. The extension of benefits does not apply when the termination is based on fraud, misrepresentation, or nonpayment of premium. Receipt of Medicare Part D benefits is not considered in determining a continuous loss.\n(b) An issuer may discontinue the availability of a policy form or certificate form if the issuer provides to the commissioner in writing its decision at least 30 days before discontinuing the availability of the form of the policy or certificate. An issuer that discontinues the availability of a policy form or certificate form shall not file for approval a new policy form or certificate form of the same type for the same Medicare supplement benefit plan as the discontinued form for five years after the issuer provides notice to the commissioner of the discontinuance. This period of ineligibility to file a form for approval may be reduced if the commissioner determines that a shorter period is appropriate. The sale or other transfer of Medicare supplement business to another issuer shall be considered a discontinuance for the purposes of this section and section 62A.3099. A change in the rating structure or methodology shall be considered a discontinuance under this section and section 62A.3099 unless the issuer complies with the following requirements:\n(1) the issuer provides an actuarial memorandum, in a form and manner prescribed by the commissioner, describing the manner in which the revised rating methodology and resulting rates differ from the existing rating methodology and resulting rates; and\n(2) the issuer does not subsequently put into effect a change of rates or rating factors that would cause the percentage differential between the discontinued and subsequent rates as described in the actuarial memorandum to change. The commissioner may approve a change to the differential that is in the public interest.\n(a) Except as provided in paragraph (b), the Minnesota experience of all policy forms or certificate forms of the same type in a standard Medicare supplement benefit plan shall be combined for purposes of the refund or credit calculation prescribed in section 62A.36.\n(b) Forms assumed under an assumption reinsurance agreement shall not be combined with the Minnesota experience of other forms for purposes of the refund or credit calculation.\nMedicare supplement policies and certificates shall include a renewal or continuation provision. The language or specifications of the provision shall be consistent with the type of contract issued. The provision shall be appropriately captioned and shall appear on the first page of the policy or certificate, and shall include any reservation by the issuer of the right to change premiums. Except for riders or endorsements by which the issuer effectuates a request made in writing by the insured, exercises a specifically reserved right under a Medicare supplement policy or certificate, or is required to reduce or eliminate benefits to avoid duplication of Medicare benefits, all riders or endorsements added to a Medicare supplement policy or certificate after the date of issue or at reinstatement or renewal that reduce or eliminate benefits or coverage in the policy or certificate shall require a signed acceptance by the insured. After the date of policy or certificate issue, a rider or endorsement that increases benefits or coverage with a concomitant increase in premium during the policy or certificate term shall be agreed to in writing and signed by the insured, unless the benefits are required by the minimum standards for Medicare supplement policies or if the increased benefits or coverage is required by law. Where a separate additional premium is charged for benefits provided in connection with riders or endorsements, the premium charge shall be set forth in the policy, declaration page, or certificate.\nIssuers of accident and sickness policies or certificates that provide hospital or medical expense coverage on an expense incurred or indemnity basis to persons eligible for Medicare shall provide to those applicants a \"Guide to Health Insurance for People with Medicare\" in the form developed by the Centers for Medicare and Medicaid Services and in a type size no smaller than 12-point type. Delivery of the guide must be made whether or not such policies or certificates are advertised, solicited, or issued as Medicare supplement policies or certificates as defined in this section and section 62A.3099. Except in the case of direct response issuers, delivery of the guide must be made to the applicant at the time of application, and acknowledgment of receipt of the guide must be obtained by the issuer. Direct response issuers shall deliver the guide to the applicant upon request, but no later than the time at which the policy is delivered.\n[See Note.]\n(1) An issuer, directly or through its producers, shall:\n(i) establish marketing procedures to assure that a comparison of policies by its agents or other producers will be fair and accurate;\n(ii) establish marketing procedures to ensure that excessive insurance is not sold or issued;\n(iii) establish marketing procedures that set forth a mechanism or formula for determining whether a replacement policy or certificate contains benefits clearly and substantially greater than the benefits under the replaced policy or certificate;\n(iv) display prominently by type or other appropriate means, on the first page of the policy or certificate, the following:\n\"Notice to buyer: This policy or certificate may not cover all of your medical expenses\";\n(v) inquire and otherwise make every reasonable effort to identify whether a prospective applicant or enrollee for Medicare supplement insurance already has accident and sickness insurance and the types and amounts of the insurance;\n(vi) establish auditable procedures for verifying compliance with this subdivision;\n(2) in addition to the practices prohibited in chapter 72A, the following acts and practices are prohibited:\n(i) knowingly making any misleading representation or incomplete or fraudulent comparison of any insurance policies or issuers for the purpose of inducing, or tending to induce, any person to lapse, forfeit, surrender, terminate, retain, pledge, assign, borrow on, or convert any insurance policy or to take out a policy of insurance with another insurer;\n(ii) employing any method of marketing having the effect of or tending to induce the purchase of insurance through force, fright, threat, whether explicit or implied, or undue pressure to purchase or recommend the purchase of insurance;\n(iii) making use directly or indirectly of any method of marketing which fails to disclose in a conspicuous manner that a purpose of the method of marketing is solicitation of insurance and that contact will be made by an insurance agent or insurance company;\n(3) the terms \"Medicare supplement,\" \"medigap,\" and words of similar import shall not be used unless the policy or certificate is issued in compliance with this subdivision.\nEach health maintenance organization, health service plan corporation, insurer, or fraternal benefit society that sells Medicare-related coverage shall establish a separate community rate for that coverage. Beginning January 1, 1993, no Medicare-related coverage may be offered, issued, sold, or renewed to a Minnesota resident, except at the community rate required by this subdivision. The same community rate must apply to newly issued coverage and to renewal coverage.\nFor coverage that supplements Medicare and for the Part A rate calculation for plans governed by section 1833 of the federal Social Security Act, United States Code, title 42, section 1395, et seq., the community rate may take into account only the following factors:\n(1) actuarially valid differences in benefit designs or provider networks;\n(2) geographic variations in rates if preapproved by the commissioner of commerce; and\n(3) premium reductions in recognition of healthy lifestyle behaviors, including but not limited to, refraining from the use of tobacco. Premium reductions must be actuarially valid and must relate only to those healthy lifestyle behaviors that have a proven positive impact on health. Factors used by the health carrier making this premium reduction must be filed with and approved by the commissioner of commerce.\nFor insureds not residing in Anoka, Carver, Chisago, Dakota, Hennepin, Ramsey, Scott, or Washington County, a health plan may, at the option of the health carrier, phase in compliance under the following timetable:\n(i) a premium adjustment as of March 1, 1993, that consists of one-half of the difference between the community rate that would be applicable to the person as of March 1, 1993, and the premium rate that would be applicable to the person as of March 1, 1993, under the rate schedule permitted on December 31, 1992. A health plan may, at the option of the health carrier, implement the entire premium difference described in this clause for any person as of March 1, 1993, if the premium difference would be 15 percent or less of the premium rate that would be applicable to the person as of March 1, 1993, under the rate schedule permitted on December 31, 1992, if the health plan does so uniformly regardless of whether the premium difference causes premiums to rise or to fall. The premium difference described in this clause is in addition to any premium adjustment attributable to medical cost inflation or any other lawful factor and is intended to describe only the premium difference attributable to the transition to the community rate; and\n(ii) with respect to any person whose premium adjustment was constrained under clause (i), a premium adjustment as of January 1, 1994, that consists of the remaining one-half of the premium difference attributable to the transition to the community rate, as described in clause (i).\nA health plan that initially follows the phase-in timetable may at any subsequent time comply on a more rapid timetable. A health plan that is in full compliance as of January 1, 1993, may not use the phase-in timetable and must remain in full compliance. Health plans that follow the phase-in timetable must charge the same premium rate for newly issued coverage that they charge for renewal coverage. A health plan whose premiums are constrained by clause (i) may take the constraint into account in establishing its community rate.\nFrom January 1, 1993 to February 28, 1993, a health plan may, at the health carrier's option, charge the community rate under this paragraph or may instead charge premiums permitted as of December 31, 1992.\n(a) Subject to subdivisions 1k, 1m, 1n, and 1p, a Medicare supplement policy with benefits for outpatient prescription drugs, in existence prior to January 1, 2006, must be renewed, at the option of the policyholder, for current policyholders who do not enroll in Medicare Part D.\n(b) A Medicare supplement policy with benefits for outpatient prescription drugs must not be issued after December 31, 2005.\n(c) After December 31, 2005, a Medicare supplement policy with benefits for outpatient prescription drugs must not be renewed after the policyholder enrolls in Medicare Part D unless:\n(1) the policy is modified to eliminate outpatient prescription drug coverage for expenses of outpatient prescription drugs incurred on or after the effective date of the individual's coverage under Medicare Part D; and\n(2) premiums are adjusted to reflect the elimination of outpatient prescription drug coverage at the time of Medicare Part D enrollment, accounting for any claims paid, if applicable.\n(d) An issuer of a Medicare supplement policy or certificate must comply with the federal Medicare Prescription Drug, Improvement, and Modernization Act of 2003, as amended, including any federal regulations, as amended, adopted under that act. This paragraph does not require compliance with any provision of that act until the date upon which that act requires compliance with that provision. The commissioner has authority to enforce this paragraph.\nEach policy or contract issued without prescription drug coverage by any insurer, health service plan corporation, health maintenance organization, or fraternal benefit society must contain, displayed prominently by type or other appropriate means, on the first page of the contract, the following:\n\"Notice to buyer: This contract does not cover prescription drugs. Prescription drugs can be a very high percentage of your medical expenses. Coverage for prescription drugs may be available to you by retaining existing coverage you may have or by enrolling in Medicare Part D. Please ask for further details.\"\n(a)(1) Eligible persons are those individuals described in paragraph (b) who seek to enroll under the policy during the period specified in paragraph (c) and who submit evidence of the date of termination or disenrollment described in paragraph (b), or of the date of Medicare Part D enrollment, with the application for a Medicare supplement policy.\n(2) With respect to eligible persons, an issuer shall not: deny or condition the issuance or effectiveness of a Medicare supplement policy described in paragraph (c) that is offered and is available for issuance to new enrollees by the issuer; discriminate in the pricing of such a Medicare supplement policy because of health status, claims experience, receipt of health care, medical condition, or age; or impose an exclusion of benefits based upon a preexisting condition under such a Medicare supplement policy.\n(b) An eligible person is an individual described in any of the following:\n(1) the individual is enrolled under an employee welfare benefit plan that provides health benefits that supplement the benefits under Medicare; and the plan terminates, or the plan ceases to provide all such supplemental health benefits to the individual;\n(2) the individual is enrolled with a Medicare Advantage organization under a Medicare Advantage plan under Medicare Part C, and any of the following circumstances apply, or the individual is 65 years of age or older and is enrolled with a Program of All-Inclusive Care for the Elderly (PACE) provider under section 1894 of the federal Social Security Act, and there are circumstances similar to those described in this clause that would permit discontinuance of the individual's enrollment with the provider if the individual were enrolled in a Medicare Advantage plan:\n(i) the organization's or plan's certification under Medicare Part C has been terminated or the organization has terminated or otherwise discontinued providing the plan in the area in which the individual resides;\n(ii) the individual is no longer eligible to elect the plan because of a change in the individual's place of residence or other change in circumstances specified by the secretary, but not including termination of the individual's enrollment on the basis described in section 1851(g)(3)(B) of the federal Social Security Act, United States Code, title 42, section 1395w-21(g)(3)(b) (where the individual has not paid premiums on a timely basis or has engaged in disruptive behavior as specified in standards under section 1856 of the federal Social Security Act, United States Code, title 42, section 1395w-26), or the plan is terminated for all individuals within a residence area;\n(iii) the individual demonstrates, in accordance with guidelines established by the Secretary, that:\n(A) the organization offering the plan substantially violated a material provision of the organization's contract in relation to the individual, including the failure to provide an enrollee on a timely basis medically necessary care for which benefits are available under the plan or the failure to provide such covered care in accordance with applicable quality standards; or\n(B) the organization, or agent or other entity acting on the organization's behalf, materially misrepresented the plan's provisions in marketing the plan to the individual; or\n(iv) the individual meets such other exceptional conditions as the secretary may provide;\n(3)(i) the individual is enrolled with:\n(A) an eligible organization under a contract under section 1876 of the federal Social Security Act, United States Code, title 42, section 1395mm (Medicare cost);\n(B) a similar organization operating under demonstration project authority, effective for periods before April 1, 1999;\n(C) an organization under an agreement under section 1833(a)(1)(A) of the federal Social Security Act, United States Code, title 42, section 1395l(a)(1)(A) (health care prepayment plan); or\n(D) an organization under a Medicare Select policy under section 62A.318 or the similar law of another state; and\n(ii) the enrollment ceases under the same circumstances that would permit discontinuance of an individual's election of coverage under clause (2);\n(4) the individual is enrolled under a Medicare supplement policy, and the enrollment ceases because:\n(i)(A) of the insolvency of the issuer or bankruptcy of the nonissuer organization; or\n(B) of other involuntary termination of coverage or enrollment under the policy;\n(ii) the issuer of the policy substantially violated a material provision of the policy; or\n(iii) the issuer, or an agent or other entity acting on the issuer's behalf, materially misrepresented the policy's provisions in marketing the policy to the individual;\n(5)(i) the individual was enrolled under a Medicare supplement policy and terminates that enrollment and subsequently enrolls, for the first time, with any Medicare Advantage organization under a Medicare Advantage plan under Medicare Part C; any eligible organization under a contract under section 1876 of the federal Social Security Act, United States Code, title 42, section 1395mm (Medicare cost); any similar organization operating under demonstration project authority; any PACE provider under section 1894 of the federal Social Security Act, or a Medicare Select policy under section 62A.318 or the similar law of another state; and\n(ii) the subsequent enrollment under item (i) is terminated by the enrollee during any period within the first 12 months of the subsequent enrollment during which the enrollee is permitted to terminate the subsequent enrollment under section 1851(e) of the federal Social Security Act;\n(6) the individual, upon first enrolling for benefits under Medicare Part B, enrolls in a Medicare Advantage plan under Medicare Part C, or with a PACE provider under section 1894 of the federal Social Security Act, and disenrolls from the plan by not later than 12 months after the effective date of enrollment;\n(7) the individual enrolls in a Medicare Part D plan during the initial Part D enrollment period, as defined under United States Code, title 42, section 1395ss(v)(6)(D), and, at the time of enrollment in Part D, was enrolled under a Medicare supplement policy that covers outpatient prescription drugs and the individual terminates enrollment in the Medicare supplement policy and submits evidence of enrollment in Medicare Part D along with the application for a policy described in paragraph (e), clause (4); or\n(8) the individual was enrolled in a state public program and is losing coverage due to the unwinding of the Medicaid continuous enrollment conditions, as provided by Code of Federal Regulations, title 45, section 155.420 (d)(9) and (d)(1), and Public Law 117-328, section 5131 (2022).\n(c)(1) In the case of an individual described in paragraph (b), clause (1), the guaranteed issue period begins on the later of: (i) the date the individual receives a notice of termination or cessation of all supplemental health benefits or, if a notice is not received, notice that a claim has been denied because of a termination or cessation; or (ii) the date that the applicable coverage terminates or ceases; and ends 63 days after the later of those two dates.\n(2) In the case of an individual described in paragraph (b), clause (2), (3), (5), or (6), whose enrollment is terminated involuntarily, the guaranteed issue period begins on the date that the individual receives a notice of termination and ends 63 days after the date the applicable coverage is terminated.\n(3) In the case of an individual described in paragraph (b), clause (4), item (i), the guaranteed issue period begins on the earlier of: (i) the date that the individual receives a notice of termination, a notice of the issuer's bankruptcy or insolvency, or other such similar notice if any; and (ii) the date that the applicable coverage is terminated, and ends on the date that is 63 days after the date the coverage is terminated.\n(4) In the case of an individual described in paragraph (b), clause (2), (4), (5), or (6), who disenrolls voluntarily, the guaranteed issue period begins on the date that is 60 days before the effective date of the disenrollment and ends on the date that is 63 days after the effective date.\n(5) In the case of an individual described in paragraph (b), clause (7), the guaranteed issue period begins on the date the individual receives notice pursuant to section 1882(v)(2)(B) of the Social Security Act from the Medicare supplement issuer during the 60-day period immediately preceding the initial Part D enrollment period and ends on the date that is 63 days after the effective date of the individual's coverage under Medicare Part D.\n(6) In the case of an individual described in paragraph (b) but not described in this paragraph, the guaranteed issue period begins on the effective date of disenrollment and ends on the date that is 63 days after the effective date.\n(7) For all individuals described in paragraph (b), the open enrollment period is a guaranteed issue period.\n(d)(1) In the case of an individual described in paragraph (b), clause (5), or deemed to be so described, pursuant to this paragraph, whose enrollment with an organization or provider described in paragraph (b), clause (5), item (i), is involuntarily terminated within the first 12 months of enrollment, and who, without an intervening enrollment, enrolls with another such organization or provider, the subsequent enrollment is deemed to be an initial enrollment described in paragraph (b), clause (5).\n(2) In the case of an individual described in paragraph (b), clause (6), or deemed to be so described, pursuant to this paragraph, whose enrollment with a plan or in a program described in paragraph (b), clause (6), is involuntarily terminated within the first 12 months of enrollment, and who, without an intervening enrollment, enrolls in another such plan or program, the subsequent enrollment is deemed to be an initial enrollment described in paragraph (b), clause (6).\n(3) For purposes of paragraph (b), clauses (5) and (6), no enrollment of an individual with an organization or provider described in paragraph (b), clause (5), item (i), or with a plan or in a program described in paragraph (b), clause (6), may be deemed to be an initial enrollment under this paragraph after the two-year period beginning on the date on which the individual first enrolled with the organization, provider, plan, or program.\n(e) The Medicare supplement policy to which eligible persons are entitled under:\n(1) paragraph (b), clauses (1) to (4), is any Medicare supplement policy that has a benefit package consisting of the basic Medicare supplement plan described in section 62A.316, paragraph (a), plus any combination of the three optional riders described in section 62A.316, paragraph (b), clauses (1) to (3), offered by any issuer;\n(2) paragraph (b), clause (5), is the same Medicare supplement policy in which the individual was most recently previously enrolled, if available from the same issuer, or, if not so available, any policy described in clause (1) offered by any issuer, except that after December 31, 2005, if the individual was most recently enrolled in a Medicare supplement policy with an outpatient prescription drug benefit, a Medicare supplement policy to which the individual is entitled under paragraph (b), clause (5), is:\n(i) the policy available from the same issuer but modified to remove outpatient prescription drug coverage; or\n(ii) at the election of the policyholder, a policy described in clause (4), except that the policy may be one that is offered and available for issuance to new enrollees that is offered by any issuer;\n(3) paragraph (b), clause (6), is any Medicare supplement policy offered by any issuer;\n(4) paragraph (b), clause (7), is a Medicare supplement policy that has a benefit package classified as a basic plan under section 62A.316 if the enrollee's existing Medicare supplement policy is a basic plan or, if the enrollee's existing Medicare supplement policy is an extended basic plan under section 62A.315, a basic or extended basic plan at the option of the enrollee, provided that the policy is offered and is available for issuance to new enrollees by the same issuer that issued the individual's Medicare supplement policy with outpatient prescription drug coverage. The issuer must permit the enrollee to retain all optional benefits contained in the enrollee's existing coverage, other than outpatient prescription drugs, subject to the provision that the coverage be offered and available for issuance to new enrollees by the same issuer.\n(f)(1) At the time of an event described in paragraph (b), because of which an individual loses coverage or benefits due to the termination of a contract or agreement, policy, or plan, the organization that terminates the contract or agreement, the issuer terminating the policy, or the administrator of the plan being terminated, respectively, shall notify the individual of the individual's rights under this subdivision, and of the obligations of issuers of Medicare supplement policies under paragraph (a). The notice must be communicated contemporaneously with the notification of termination.\n(2) At the time of an event described in paragraph (b), because of which an individual ceases enrollment under a contract or agreement, policy, or plan, the organization that offers the contract or agreement, regardless of the basis for the cessation of enrollment, the issuer offering the policy, or the administrator of the plan, respectively, shall notify the individual of the individual's rights under this subdivision, and of the obligations of issuers of Medicare supplement policies under paragraph (a). The notice must be communicated within ten working days of the issuer receiving notification of disenrollment.\n(g) Reference in this subdivision to a situation in which, or to a basis upon which, an individual's coverage has been terminated does not provide authority under the laws of this state for the termination in that situation or upon that basis.\n(h) An individual's rights under this subdivision are in addition to, and do not modify or limit, the individual's rights under subdivision 1h.\n[See Note.]\nA Medicare supplemental policy or certificate must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual.\nA medicare supplement policy or certificate must not be sold or issued to an eligible individual outside of the time periods described in subdivision 1u.\n[See Note.]\nFor a policy to meet the requirements of this section and section 62A.3099 it must contain (1) a designation specifying whether the policy is an extended basic Medicare supplement plan or a basic Medicare supplement plan, (2) a caption stating that the commissioner has established two categories of Medicare supplement insurance and minimum standards for each, with the extended basic Medicare supplement being the most comprehensive and the basic Medicare supplement being the least comprehensive, and (3) the policy must provide the coverage prescribed in sections 62A.315 and 62A.316.\n[Renumbered 62A.3099]\n(a) A Medicare supplement policy or certificate in force in the state shall not contain benefits that duplicate benefits provided by Medicare or contain exclusions on coverage that are more restrictive than those of Medicare. Duplication of benefits is permitted to the extent permitted under subdivision 1s, paragraph (a), for benefits provided by Medicare Part D.\n(b) No Medicare supplement policy or certificate may use waivers to exclude, limit, or reduce coverage or benefits for specifically named or described preexisting diseases or physical conditions.\n[See Note.]\nAn issuer shall provide a copy of any Medicare supplement advertisement intended for use in this state whether through printed or electronic medium to the commissioner for review or approval to the extent it may be required.\nThe requirements of sections 62A.3099 to 62A.44 shall not apply to disability income protection insurance policies, long-term care policies issued pursuant to sections 62A.46 to 62A.56 or chapter 62S, or group policies of accident and health insurance which do not purport to supplement Medicare issued to any of the following groups:\n(a) A policy issued to an employer or employers or to the trustee of a fund established by an employer where only employees or retirees, and dependents of employees or retirees, are eligible for coverage.\n(b) A policy issued to a labor union or similar employee organization.\n(c) A policy issued to an association, a trust or the trustee of a fund established, created or maintained for the benefit of members of one or more associations. The association or associations shall have at the outset a minimum of 100 persons; shall have been organized and maintained in good faith for purposes other than that of obtaining insurance; shall have a constitution and bylaws which provide that (1) the association or associations hold regular meetings not less frequently than annually to further purposes of the members, (2) except for credit unions, the association or associations collect dues or solicit contributions from members, (3) the members have voting privileges and representation on the governing board and committees, and (4) the members are not, within the first 30 days of membership, directly solicited, offered, or sold a long-term care policy or Medicare supplement policy if the policy is available as an association benefit. This clause does not prohibit direct solicitations, offers, or sales made exclusively by mail.\nAn association may apply to the commissioner for a waiver of the 30-day waiting period as to that association. The commissioner may grant the waiver upon a finding of all of the following: (1) that the association is in full compliance with this section; (2) that sanctions have not been imposed against the association as a result of significant disciplinary action by the Department of Commerce; and (3) that at least 90 percent of the association's income comes from dues, contributions, or sources other than income from the sale of insurance.\nIf Congress enacts legislation creating a prescription drug benefit in the Medicare program, nothing in this section or any other section shall prohibit an issuer of a Medicare supplement policy from offering this prescription drug benefit consistent with the applicable federal law or regulations.\nThis subdivision applies to all policies with policy years beginning on or after May 21, 2009.\n(a) An issuer of a Medicare supplement policy or certificate:\n(1) shall not deny or condition the issuance or effectiveness of the policy or certificate, including the imposition of any exclusion of benefits under the policy based on a preexisting condition, on the basis of the genetic information with respect to such individual; and\n(2) shall not discriminate in the pricing of the policy or certificate, including the adjustment of premium rates, of an individual on the basis of the genetic information with respect to such individual.\n(b) Nothing in paragraph (a) shall be construed to limit the ability of an issuer, to the extent otherwise permitted by law, from:\n(1) denying or conditioning the issuance or effectiveness of the policy or certificate or increasing the premium for a group based on the manifestation of a disease or disorder of an insured or applicant; or\n(2) increasing the premium for any policy issued to an individual based on the manifestation of a disease or disorder of an individual who is covered under the policy. In such case, the manifestation of a disease or disorder in one individual cannot also be used as genetic information about other group members and to further increase the premium for the group.\n(c) An issuer of a Medicare supplement policy or certificate shall not request or require an individual or a family member of such individual to undergo a genetic test.\n(d) Paragraph (c) shall not be construed to preclude an issuer of a Medicare supplement policy or certificate from obtaining and using the results of a genetic test in making a determination regarding payment, as defined for the purposes of applying the regulations promulgated under Part C of title XI and section 264 of the Health Insurance Portability and Accountability Act of 1996 as they may be revised from time to time, and consistent with paragraph (a).\n(e) For purposes of carrying out paragraph (d), an issuer of a Medicare supplement policy or certificate may request only the minimum amount of information necessary to accomplish the intended purpose.\n(f) Notwithstanding paragraph (c), an issuer of a Medicare supplement policy may request, but not require, that an individual or a family member of such individual undergo a genetic test if each of the following conditions are met:\n(1) the request is made pursuant to research that complies with Code of Federal Regulations, title 45, part 46, or equivalent federal regulations, and any applicable state or local law or regulations for the protection of human subjects in research;\n(2) the issuer clearly indicates to each individual, or in the case of a minor child, to the legal guardian of such child, to whom the request is made that:\n(i) compliance with the request is voluntary; and\n(ii) noncompliance will have no effect on enrollment status or premium or contribution amounts;\n(3) no genetic information collected or acquired under this paragraph shall be used for underwriting, determination of eligibility to enroll or maintain enrollment status, premium rates, or the issuance, renewal, or replacement of a policy or certificate;\n(4) the issuer notifies the secretary in writing that the issuer is conducting activities pursuant to the exception provided for under this paragraph, including a description of the activities conducted; and\n(5) the issuer complies with such other conditions as the secretary may by regulation require for activities under this paragraph.\n(g) An issuer of a Medicare supplement policy or certificate shall not request, require, or purchase genetic information for underwriting purposes.\n(h) An issuer of a Medicare supplement policy or certificate shall not request, require, or purchase genetic information with respect to any individual prior to such individual's enrollment under the policy in connection with such enrollment.\n(i) An issuer of a Medicare supplement policy or certificate that obtains genetic information incidental to the requesting, requiring, or purchasing of other information concerning any individual, such request, requirement, or purchase shall not be considered a violation of paragraph (h) if such request, requirement, or purchase is not in violation of paragraph (g).\n(j) For purposes of this subdivision only:\n(1) \"family member\" means, with respect to an individual, any other individual who is a first-degree, second-degree, third-degree, or fourth-degree relative of such individual;\n(2) \"genetic information\" means, with respect to any individual, information about such individual's genetic tests, the genetic test of family members of such individual, and the manifestation of a disease or disorder in family members of such individual. Such terms include, with respect to any individual, any request for, or receipt of, genetic services, or participation in clinical research that includes genetic services, by such individual or any family member of such individual. Any reference to genetic information concerning an individual or family member of an individual who is a pregnant woman, includes genetic information of any fetus carried by such pregnant woman, or with respect to an individual or family member utilizing reproductive technology, includes genetic information of any embryo legally held by an individual or family member. The term genetic information does not include information about the sex or age of any individual;\n(3) \"genetic services\" means a genetic test or genetic counseling, including obtaining, interpreting, or assessing genetic information or genetic education;\n(4) \"genetic test\" means an analysis of human DNA, RNA, chromosomes, proteins, or metabolites, that detect genotypes, mutations, or chromosomal changes. The term genetic test does not mean an analysis of proteins or metabolites that does not detect genotypes, mutations, or chromosomal changes; or an analysis of proteins or metabolites that is directly related to a manifested disease, disorder, or pathological condition that could reasonably be detected by a health care professional with appropriate training and expertise in the field of medicine involved;\n(5) \"issuer of a Medicare supplement policy or certificate\" includes a third-party administrator or other person acting for or on behalf of such issuer; and\n(6) \"underwriting purposes\" means:\n(i) rules for, or determination of, eligibility including enrollment and continued eligibility, for benefits under the policy;\n(ii) the computation of premium or contribution amounts under the policy;\n(iii) the application of any preexisting condition exclusion under the policy; and\n(iv) other activities related to the creation, renewal, or replacement of a contract of health insurance or health benefits.",
	"repealed": false
}