{
	"id": "47.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.601",
	"title": "47.601 CONSUMER SHORT-TERM LOANS.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Annual percentage rate\" has the meaning given in section 47.60, subdivision 1.\n(c) \"Borrower\" means an individual who obtains a consumer short-term loan primarily for personal, family, or household purposes.\n(d) \"Commissioner\" means the commissioner of commerce.\n(e) \"Consumer short-term loan\" means a loan to a borrower which has a principal amount, or an advance on a credit limit, of $1,300 or less and requires a minimum payment within 60 days of loan origination or credit advance of more than 25 percent of the principal balance or credit advance. For the purposes of this section, each new advance of money to a borrower under a consumer short-term loan agreement constitutes a new consumer short-term loan. A \"consumer short-term loan\" does not include any transaction made under chapter 325J or a loan made by a consumer short-term lender where, in the event of default on the loan, the sole recourse for recovery of the amount owed, other than a lawsuit for damages for the debt, is to proceed against physical goods pledged by the borrower as collateral for the loan.\n(f) \"Consumer short-term lender\" means an individual or entity engaged in the business of making or arranging consumer short-term loans, other than a state or federally chartered bank, savings bank, or credit union. For the purposes of this paragraph, arranging consumer short-term loans includes but is not limited to any substantial involvement in facilitating, marketing, lead-generating, underwriting, servicing, or collecting consumer short-term loans.\n(a) No contract or agreement between a consumer short-term loan lender and a borrower residing in Minnesota may contain the following:\n(1) a provision selecting a law other than Minnesota law under which the contract is construed or enforced;\n(2) a provision choosing a forum for dispute resolution other than the state of Minnesota; or\n(3) a provision limiting class actions against a consumer short-term lender for violations of subdivision 3 or for making consumer short-term loans:\n(i) without a required license issued by the commissioner; or\n(ii) in which interest rates, fees, charges, or loan amounts exceed those allowable under section 47.60, subdivision 2.\n(b) Any provision prohibited by paragraph (a) is void and unenforceable.\n(c) A consumer short-term loan lender must furnish a copy of the written loan contract to each borrower. The contract and disclosures must be written in the language in which the loan was negotiated with the borrower and must contain:\n(1) the name; address, which may not be a post office box; and telephone number of the lender making the consumer short-term loan;\n(2) the name and title of the individual employee or representative who signs the contract on behalf of the lender;\n(3) an itemization of the fees and interest charges to be paid by the borrower;\n(4) in bold, 24-point type, the annual percentage rate as computed under United States Code, chapter 15, section 1606; and\n(5) a description of the borrower's payment obligations under the loan.\n(d) The holder or assignee of a check or other instrument evidencing an obligation of a borrower in connection with a consumer short-term loan takes the instrument subject to all claims by and defenses of the borrower against the consumer short-term lender.\n(e) In connection with a consumer short-term loan, a consumer short-term loan lender may charge an annual percentage rate of up to 50 percent. No other charges or payments are permitted or may be received by the lender in connection with a consumer short-term loan.\n(f) A loan made under this section with an annual percentage rate that exceeds 36 percent must comply with section 47.603.\nA consumer short-term lender collecting or attempting to collect on an indebtedness in connection with a consumer short-term loan must not engage in the prohibited debt collection practices referenced in section 332.37.\nIn addition to any other information required to be filed under chapters 45 through 56, a consumer short-term lender must annually file a report with the commissioner that contains the following information for each calendar year:\n(1) the total dollar amount, over and above principal, collected on consumer short-term loans;\n(2) the average annual percentage rate and range of annual percentage rates for consumer short-term loans;\n(3) the number of individual borrowers who obtained one or more consumer short-term loans;\n(4) a breakdown of the number of individual borrowers identified in clause (3) by the number of individual borrowers who obtained:\n(i) five or more loans;\n(ii) ten or more loans;\n(iii) 15 or more loans; and\n(iv) 20 or more loans; and\n(5) the total number and dollar amount of loans charged off or written off.\nFor the purposes of this section, a consumer short-term loan transaction is deemed to take place in the state of Minnesota if the borrower is a Minnesota resident and the borrower completes the transaction, either personally or electronically, while physically located in the state of Minnesota.\n(a) A person must not engage in any device, subterfuge, or pretense to evade the requirements of this section, including but not limited to:\n(1) making loans disguised as a personal property sale and leaseback transaction;\n(2) disguising loan proceeds as a cash rebate for the pretextual installment sale of goods or services; or\n(3) making, offering, assisting, or arranging for a debtor to obtain a loan with a greater rate or amount of interest, consideration, charge, or payment than is permitted by this section through any method, including mail, telephone, Internet, or any electronic means, regardless of whether a person has a physical location in Minnesota.\n(b) A person is a consumer short-term loan lender subject to the requirements of this section notwithstanding the fact that a person purports to act as an agent or service provider, or acts in another capacity for another person that is not subject to this section, if a person:\n(1) directly or indirectly holds, acquires, or maintains the predominant economic interest, risk, or reward in a loan or lending business; or\n(2) both: (i) markets, solicits, brokers, arranges, or facilitates a loan; and (ii) holds or holds the right, requirement, or first right of refusal to acquire loans, receivables, or other direct or interest in a loan.\n(c) A person is a consumer short-term loan lender subject to the requirements of this section if the totality of the circumstances indicate that a person is a lender and the transaction is structured to evade the requirements of this section. Circumstances that weigh in favor of a person being a lender in a transaction include but are not limited to instances where a person:\n(1) indemnifies, insures, or protects a person not subject to this section from any costs or risks related to a loan;\n(2) predominantly designs, controls, or operates lending activity;\n(3) holds the trademark or intellectual property rights in the brand, underwriting system, or other core aspects of a lending business; or\n(4) purports to act as an agent or service provider, or acts in another capacity, for a person not subject to this section while acting directly as a lender in one or more states.\n(a) Except for a \"bona fide error\" as set forth under United States Code, chapter 15, section 1640, subsection (c), an individual or entity who violates subdivision 2, 3, or 5a is liable to the borrower for:\n(1) all money collected or received in connection with the loan;\n(2) actual, incidental, and consequential damages;\n(3) statutory damages of up to $1,000 per violation;\n(4) costs, disbursements, and reasonable attorney fees; and\n(5) injunctive relief.\n(b) In addition to the remedies provided in paragraph (a), a loan is void, and the borrower is not obligated to pay any amounts owing if the loan is made:\n(1) by a consumer short-term lender who has not obtained an applicable license from the commissioner;\n(2) in violation of any provision of subdivision 2 or 3; or\n(3) in which interest, fees, charges, or loan amounts exceed the interest, fees, charges, or loan amounts allowable under section 47.60, subdivision 2.\nThe attorney general shall enforce this section under section 8.31.\nThe remedies provided in this section are cumulative and do not restrict any remedy that is otherwise available. The provisions of this section are not exclusive and are in addition to any other requirements, rights, remedies, and penalties provided by law.",
	"repealed": false
}