{
	"id": "256F.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/256F.13",
	"title": "256F.13 FAMILY SERVICES COLLABORATIVE.",
	"text": "(a) The commissioner of human services may enter into an agreement with one or more family services collaboratives to enhance federal reimbursement under title IV-E of the Social Security Act and federal administrative reimbursement under title XIX of the Social Security Act. The commissioner may contract with the Department of Education for purposes of transferring the federal reimbursement to the commissioner of education to be distributed to the collaboratives according to clause (2). The commissioner shall have the following authority and responsibilities regarding family services collaboratives:\n(1) the commissioner shall submit amendments to state plans and seek waivers as necessary to implement the provisions of this section;\n(2) the commissioner shall pay the federal reimbursement earned under this subdivision to each collaborative based on their earnings. Payments to collaboratives for expenditures under this subdivision will only be made of federal earnings from services provided by the collaborative;\n(3) the commissioner shall review expenditures of family services collaboratives using reports specified in the agreement with the collaborative to ensure new federal reimbursement is used to expand education, social, health, or health-related services to young children and their families;\n(4) the commissioner shall not use the federal reimbursement earned under this subdivision in determining the allocation or distribution of other funds to counties or collaboratives;\n(5) the commissioner may suspend, reduce, or terminate the federal reimbursement to a provider that does not meet the reporting or other requirements of this subdivision;\n(6) the commissioner shall recover from the family services collaborative any federal fiscal disallowances or sanctions for audit exceptions directly attributable to the family services collaborative's actions in the integrated fund, or the proportional share if federal fiscal disallowances or sanctions are based on a statewide random sample; and\n(7) the commissioner shall establish criteria for the family services collaborative for the accounting and financial management system that will support claims for federal reimbursement.\n(b) The family services collaborative shall have the following authority and responsibilities regarding federal revenue enhancement:\n(1) the family services collaborative shall be the party with which the commissioner contracts. A lead county shall be designated as the fiscal agency for reporting, claiming, and receiving payments;\n(2) the family services collaboratives may enter into subcontracts with other counties, school districts, special education cooperatives, municipalities, and other public and nonprofit entities for purposes of identifying and claiming eligible expenditures to enhance federal reimbursement, or to expand education, social, health, or health-related services to families and children;\n(3) the family services collaborative must use all new federal reimbursement resulting from federal revenue enhancement to expand expenditures for education, social, health, or health-related services to families and children beyond the base level;\n(4) the family services collaborative must ensure that expenditures submitted for federal reimbursement are not made from federal funds or funds used to match other federal funds. Notwithstanding section 256B.19, subdivision 1, for the purposes of family services collaborative expenditures under agreement with the department, the nonfederal share of costs shall be provided by the family services collaborative from sources other than federal funds or funds used to match other federal funds;\n(5) the family services collaborative must develop and maintain an accounting and financial management system adequate to support all claims for federal reimbursement, including a clear audit trail and any provisions specified in the agreement; and\n(6) the family services collaborative shall submit an annual report to the commissioner as specified in the agreement.\nAt a minimum, the agreement between the commissioner and the family services collaborative shall include the following provisions:\n(1) specific documentation of the expenditures eligible for federal reimbursement;\n(2) the process for developing and submitting claims to the commissioner;\n(3) specific identification of the education, social, health, or health-related services to families and children which are to be expanded with the federal reimbursement;\n(4) reporting and review procedures ensuring that the family services collaborative must continue the base level of expenditures for the education, social, health, or health-related services for families and children as specified in clause (3);\n(5) reporting and review procedures to ensure that federal revenue earned under this section is spent specifically to expand education, social, health, or health-related services for families and children as specified in clause (4);\n(6) the period of time, not to exceed three years, governing the terms of the agreement and provisions for amendments to, and renewal of the agreement; and\n(7) an annual report prepared by the family services collaborative.\n(a) Local family services collaboratives, including collaboratives in Becker, Cass, and Ramsey Counties, shall be encouraged to seek waivers of state or federal rules, as necessary to carry out the purposes of this section.\n(b) In order to receive a waiver of the requirements of any state rule, the collaborative shall submit a request for a variance to the appropriate commissioner. The request shall contain assurances that the waiver will not affect client entitlements to services, will not abridge any rights guaranteed to the client by state or federal law, and will not jeopardize the health or safety of the client. The commissioner shall grant or deny all waiver requests within 30 days of receiving those requests, by notice to the collaborative and published notice in the State Register.\n(c) A local collaborative seeking a waiver from a federal rule shall submit a request, in writing, to the appropriate commissioner who shall submit the waiver request to the relevant policy committees of the legislature. If the legislative committees approve the request, they shall direct the appropriate state agency to make a reasonable effort to negotiate a waiver of the federal rule. If the legislative committees deny the request for a waiver, they shall jointly notify the local collaborative of the reason for denying the waiver. If a waiver request is approved for submission to federal authorities, the commissioner shall submit all necessary materials to the appropriate federal authorities. The commissioner shall notify the collaborative and the legislative committees of the outcome of the federal waiver request. In every instance in which a federal waiver is granted, the commissioner shall publish notice of receipt of the waiver in the State Register.",
	"repealed": false
}