{
	"id": "52.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.02",
	"title": "52.02 RESOLUTIONS, AMENDMENT OF BYLAWS AND CERTIFICATE OF ORGANIZATION, APPROVAL.",
	"text": "(a) If three percent or more of all members propose a resolution for action by the members to adopt, amend, or repeal bylaws adopted, amended, or repealed by the board and the resolution sets forth the provisions proposed for adoption, amendment, or repeal, the resolution must be submitted to the members for a vote in the following manner:\n(1) if balloting by mail, or other electronic means, has not been authorized by the board of directors, then a statement of intent to amend which identifies the proposed amendments shall be set forth in the notice of the meeting; or\n(2) if balloting by mail or other electronic means, has been authorized by the board of directors as either the exclusive means of voting or in conjunction with voting in person, a statement of intent to amend which identifies the proposed amendments shall be set forth in a notice mailed to all members eligible to vote at least 30 days prior to the close of balloting by mail. Any amendments to the certificate of organization or bylaws shall be approved by two-thirds vote of the members actually voting, if the members actually voting constitute a quorum.\n(b) A member receiving notice of a proposed bylaw amendment pursuant to this subdivision may request a written copy of the proposed bylaw amendment. This request must be made no later than ten days prior to the close of balloting by mail or the date set for the meeting. The credit union shall provide the member with a written copy of the proposed bylaw amendment upon receipt of a timely request and the original notice must inform the member of the right to make a request. A copy of the proposed amendments shall be posted in the credit union's office for member review 30 days prior to the close of balloting or the date of the meeting.\nThe bylaws and certificate of organization may be amended by a two-thirds vote of the number of directors authorized at any duly convened meeting of the board, but only after the members of the board have been given at least 30 days' notice of the meeting and the notice includes a copy of the proposed amendment or amendments. The board of directors shall not adopt, amend, or repeal a bylaw fixing a quorum for meetings of members, prescribing procedures for removing directors or filling vacancies in the board, or fixing the number of directors or their classifications, qualifications, or terms of office, but may adopt or amend a bylaw to increase the number of directors.\nAmendments to the certificate of organization or bylaws, other than the addition to the field of membership of a small group or a group determined by the commissioner under section 52.05 to be too small to form its own credit union, must be approved by the commissioner of commerce before they become operative. The commissioner shall not unreasonably withhold approval if the amendments do not violate any provision of this chapter or other state law. In any event, the commissioner shall approve or disapprove the proposed amendment within 60 days of the date the proposed amendment is submitted to the commissioner by the credit union. In case of disapproval the credit union shall have the right to appeal to a court of competent jurisdiction within the time limits stated in section 52.01, clause (6). In case any amendment to the certificate of organization is adopted, the resolution, containing a full text of the amendment and verified by its president or treasurer and approved by the commissioner of commerce, shall be recorded in the Office of the Secretary of State. Upon addition to the field of membership of a small group or a group determined by the commissioner under section 52.05 to be too small to form its own credit union, a credit union must provide timely written notice to the commissioner, and the commissioner shall have 30 days from receipt of the notice to reject the addition of that group; if the commissioner does not reject the addition within that period, it is deemed approved.",
	"repealed": false
}