{
	"id": "103E.741",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.741",
	"title": "103E.741 PROPERTY NOT ASSESSED BENEFITS; HEARING.",
	"text": "In a proceeding to repair a drainage system, if the engineer determines or is made aware that property that was not assessed for benefits for construction of the drainage system has been drained into the drainage system or has otherwise benefited from the drainage system, the engineer shall submit a map with the repair report. The map must show all public and private main ditches and drains that drain into the drainage system, all property affected or otherwise benefited by the drainage system, and the names of the property owners to the extent practicable. The property owners must be notified of the hearing on the repair report at least ten days before the hearing. The auditor must give notice of the time and location of the hearing by mail.\nAt the hearing on the repair report, if the drainage authority determines that property not assessed for benefits for the construction of the drainage system has been benefited by the drainage system, the drainage authority shall appoint viewers as provided by section 103E.305 before the repair contract is awarded. The viewers shall determine the benefits to all property and entities benefited by the original construction of the drainage system and not assessed for benefits arising from its construction. The viewers shall make a viewers' repair report to the drainage authority as provided by section 103E.315. When the viewers' repair report is filed, the auditor shall give notice of a hearing as required by section 103E.325 and the drainage authority has jurisdiction of each tract of property described in the viewers' report as provided in section 103E.331.\nAt the hearing on the viewers' repair report, the drainage authority shall hear all interested parties and determine the benefits to property and entities benefited by the original construction of the drainage system and not assessed for benefits.\nA person may appeal from the order determining the assessments as provided by section 103E.091.\nFor the repair of the drainage system under this section that included the property that was not assessed and in all future proceedings relating to repairing, cleaning, improving, or altering the drainage system, the property benefited in the viewers' report hearing is part of the property benefited by the drainage system and must be assessed, in the same manner provided for the assessment of the property originally assessed for and included in the drainage system.",
	"repealed": false
}