{
	"id": "72B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.02",
	"title": "72B.02 DEFINITIONS.",
	"text": "For the purposes of sections 72B.01 to 72B.136 the terms defined in this section have the meanings ascribed to them unless the context otherwise requires.\n\"Person\" means an individual or business entity.\n\"Commissioner\" means the commissioner of commerce or any other person properly acting for the commissioner.\n\"Adjuster\" means a person who on behalf of an insurer or an insured, for compensation as an independent contractor or as an employee of such independent contractor, or as an employee of an insurer, or for a fee or commission, investigates and evaluates claims arising under insurance contracts and negotiates the settlement of such claims.\n\"Independent adjuster\" means a person who:\n(1) is an individual, a business entity, an independent contractor, or an employee of a contractor, who contracts for compensation with insurers or self-insurers;\n(2) is treated for tax purposes by the insurer or self-insurer in a manner that is consistent with the tax treatment of an independent contractor rather than the tax treatment of an employee, as defined in the Internal Revenue Code, United States Code, title 26, subtitle C; and\n(3) investigates, negotiates, or settles property, casualty, or workers' compensation claims for insurers or for self-insurers.\n\"Public adjuster\" means any person who, for compensation or any other thing of value on behalf of the insured:\n(1) acts or aids, solely in relation to first-party claims arising under insurance contracts that insure the real or personal property of the insured, on behalf of an insured in negotiating for, or effecting the settlement of, a claim for loss or damage covered by an insurance contract;\n(2) advertises for employment as a public adjuster of insurance claims or solicits business or represents to the public as a public adjuster of first-party insurance claims for losses or damages arising out of policies of insurance that insure real or personal property; or\n(3) directly or indirectly solicits business, investigates or adjusts losses, or advises an insured about first-party claims for losses or damages arising out of policies of insurance that insure real or personal property for another person engaged in the business of adjusting losses or damages covered by an insurance policy, for the insured.\n\"Staff adjuster\" means an adjuster who is a salaried employee of an insurance company or an affiliate of an insurance company and who is engaged in adjusting insured losses solely for that company or other companies under common control or ownership.\n[Repealed, 2014 c 222 art 1 s 58]\n\"Appraiser\" means any person engaged independently, for hire by the public or on the staff of an insurer, in the process of evaluating motor vehicle physical damage, who does not endeavor to determine liability or negotiate the settlement of claims arising under automobile insurance contracts.\n[Repealed, 1979 c 141 s 9]\n[Repealed, 2010 c 384 s 104]\n[Repealed, 2009 c 63 s 77]\n\"Appraiser identification\" means a writing including the appraiser's name, place of business, business telephone number, and the name of the insurer or other business entity employing the appraiser, if any.\n\"Crop hail adjuster\" means a person who for money, commission, or other thing of value acts as an adjuster in regard to insurance policies against crop damage by hail.\n\"Business entity\" means a corporation, association, partnership, limited liability company, limited liability partnership, or other legal entity.\n\"Fingerprint\" means an impression of the lines on the finger taken for purpose of identification.\n\"Home state\" means the District of Columbia and any state or territory of the United States in which an adjuster maintains the adjuster's principal place of residence or business and is licensed to act as a resident adjuster. If the resident state does not license adjusters for the line of authority sought, the adjuster shall designate as the adjuster's home state any state in which the adjuster is licensed and in good standing.\n\"Individual\" means a natural person.\n\"Insurer\" means an insurance company.\n\"Uniform Individual Application\" means the current version of the National Association of Insurance Commissioners (NAIC) Uniform Individual Application for resident and nonresident individuals.\n\"Uniform Business Entity Application\" means the current version of the National Association of Insurance Commissioners (NAIC) Uniform Business Entity Application for resident and nonresident business entities.\nAn \"emergency situation\" means the occurrence of insured losses of such a number or severity that the ordinary staff adjuster personnel complement of the insurer and the available independent adjusters could not adjust all of the losses resulting from a common cause or related causes in reasonable time.\n\"Automated claims adjudication system\" means a preprogrammed computer system designed for the collection, data entry, calculation, and final resolution of portable electronics insurance claims relating to coverage regulated by section 60K.381, which:\n(1) may be utilized only by a licensed independent adjuster; licensed insurance producer as defined in section 60K.31, subdivision 6; or a supervised individual operating under section 72B.03, subdivision 1, paragraph (a), clause (14); and\n(2) must comply with all claims payment requirements of the insurance laws of this state.",
	"repealed": false
}