{
	"id": "176.194",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.194",
	"title": "176.194 PROHIBITED PRACTICES.",
	"text": "This section applies to insurers, self-insurers, group self-insurers, political subdivisions of the state, and the administrator of state employees' claims.\nThis section also applies to adjusters and third-party administrators who act on behalf of an insurer, self-insurer, group self-insurer, the assigned risk plan, the Minnesota Insurance Guaranty Association, a political subdivision, or any other entity.\nThis section shall be enforceable only by the commissioner of labor and industry. Evidence of violations under this section shall not be admissible in any civil action.\nThis section is not intended to replace existing requirements of this chapter which govern the same or similar conduct; these requirements and penalties are in addition to any others provided by this chapter.\nThe following conduct is prohibited:\n(1) failing to reply, within 30 calendar days after receipt, to all written communication about a claim from a claimant that requests a response;\n(2) failing, within 45 calendar days after receipt of a written request, to commence benefits or to advise the claimant of the acceptance or denial of the claim by the insurer;\n(3) failing to pay or deny medical bills within 45 days after the receipt of all information requested from medical providers that is necessary to make a payment determination;\n(4) filing a denial of liability for workers' compensation benefits without conducting an investigation;\n(5) failing to regularly pay weekly benefits in a timely manner as prescribed by rules adopted by the commissioner once weekly benefits have begun. Failure to regularly pay weekly benefits means failure to pay an employee on more than three occasions in any 12-month period within three business days of when payment was due;\n(6) failing to respond to the department within 30 calendar days after receipt of a written inquiry from the department about a matter related to benefits. Responses must be substantive and address the question;\n(7) failing to pay pursuant to an order of the department, compensation judge, court of appeals, or the supreme court, within 45 days from the filing of the order unless the order is under appeal;\n(8) advising a claimant not to obtain the services of an attorney or representing that payment will be delayed if an attorney is retained by the claimant;\n(9) altering information on a document to be filed with the department without the notice and consent of any person who previously signed the document and who would be adversely affected by the alteration;\n(10) providing fraudulent written information to the department or an employee pertaining to a workers' compensation matter; or\n(11) failing to pay a claim, or otherwise correct behavior on a claim, for which a penalty assessed has been paid or has become a final order.\nThe penalties for violations of subdivision 3, clauses (1) to (6), are as follows:\nFor violations of subdivision 3, clauses (7) to (11), the penalties are:\nThe penalties under this section may be imposed in addition to other penalties under this chapter that might apply for the same violation. The penalties under this section are assessed by the commissioner and are payable to the commissioner for deposit in the assigned risk safety account. A party may object to the penalty and request a formal hearing under section 176.85. If an entity has more than 30 violations within any 12-month period, in addition to the monetary penalties provided, the commissioner may refer the matter to the commissioner of commerce with recommendation for suspension or revocation of the entity's (a) license to write workers' compensation insurance; (b) license to administer claims on behalf of a self-insured, the assigned risk plan, or the Minnesota Insurance Guaranty Association; (c) authority to self-insure; or (d) license to adjust claims. The commissioner of commerce shall follow the procedures specified in section 176.195.\nThe commissioner may, by rules adopted in accordance with chapter 14, specify additional illegal, misleading, deceptive, fraudulent practices or conduct which are subject to the penalties under this section.",
	"repealed": false
}