{
	"id": "145.867",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.867",
	"title": "145.867 PERSONS REQUIRING SPECIAL DIETS.",
	"text": "\"Public facility\" means an auditorium, concert hall, sports stadium, sports arena, or theater.\nThe commissioner of health shall make special diet identification cards available to physicians, advanced practice registered nurses, physician assistants, and persons with diabetes and other conditions requiring special diets. The identification card must contain spaces for: (1) the person's name, address, and signature; (2) the physician's, advanced practice registered nurse's, or physician assistant's name, telephone number, and signature; (3) a description of the person's medical condition; and (4) an expiration date. The card must also contain the following provision, in identical or substantially similar language: \"The owner of this card is exempted by the commissioner of health from prohibitions on bringing outside food and drink into a public facility.\" Persons with medical conditions requiring a special diet may ask their physician, advanced practice registered nurse, or physician assistant to fill out and sign the card. The physician, advanced practice registered nurse, or physician assistant shall fill out and sign the card if, in the physician's, advanced practice registered nurse's, or physician assistant's medical judgment, the person has a medical condition that requires a special diet. Persons with diabetes shall be automatically assumed by physicians, advanced practice registered nurses, and physician assistants to require special diets. Special diet identification cards shall be valid for five years. Persons with a medical condition requiring a special diet may request a new card from their physician, advanced practice registered nurse, or physician assistant up to six months before the expiration date.\nPersons with medical conditions requiring a special diet who present a valid special diet identification card to any employee of a public facility shall be allowed to bring in outside food and drink, subject to the limitations in subdivision 4. To be valid, the card must be filled out according to subdivision 2 and must be current. Persons with special diet identification cards must obey all other food and drink regulations established by a public facility including prohibitions on eating or drinking in certain areas of the public facility.\nPublic facilities may limit the amount of food and drink that may be brought into a public facility by a person with a special diet identification card to the amount that can reasonably be consumed by a single individual. Public facilities may also place limits on the size of any food or drink container carried in, if the container would be a safety hazard or interfere with other patrons or customers. Public facilities may also require persons displaying a special diet identification card to show some other form of identification.",
	"repealed": false
}