{
	"id": "253B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.07",
	"title": "253B.07 JUDICIAL COMMITMENT; PRELIMINARY PROCEDURES.",
	"text": "(a) Prior to filing a petition for commitment of a proposed patient, an interested person shall apply to the designated agency in the county of financial responsibility or the county where the proposed patient is present for conduct of a preliminary investigation as provided in section 253B.23, subdivision 1b, except when the proposed patient has been acquitted of a crime under section 611.026 and the county attorney is required to file a petition for commitment. The designated agency shall appoint a screening team to conduct an investigation. The petitioner may not be a member of the screening team. The investigation must include:\n(1) an interview with the proposed patient and other individuals who appear to have knowledge of the condition of the proposed patient, if practicable. In-person interviews with the proposed patient are preferred. If the proposed patient is not interviewed, specific reasons must be documented;\n(2) identification and investigation of specific alleged conduct which is the basis for application;\n(3) identification, exploration, and listing of the specific reasons for rejecting or recommending alternatives to involuntary placement;\n(4) in the case of a commitment based on mental illness, information that may be relevant to the administration of neuroleptic medications, including the existence of a declaration under section 253B.03, subdivision 6d, or a health care directive under chapter 145C or a guardian, conservator, proxy, or agent with authority to make health care decisions for the proposed patient; information regarding the capacity of the proposed patient to make decisions regarding administration of neuroleptic medication; and whether the proposed patient is likely to consent or refuse consent to administration of the medication;\n(5) seeking input from the proposed patient's health plan company to provide the court with information about the patient's relevant treatment history and current treatment providers; and\n(6) in the case of a commitment based on mental illness, information listed in clause (4) for other purposes relevant to treatment.\n(b) In conducting the investigation required by this subdivision, the screening team shall have access to all relevant medical records of proposed patients currently in treatment facilities, state-operated treatment programs, or community-based treatment programs. The interviewer shall inform the proposed patient that any information provided by the proposed patient may be included in the prepetition screening report and may be considered in the commitment proceedings. Data collected pursuant to this clause shall be considered private data on individuals. The prepetition screening report is not admissible as evidence except by agreement of counsel or as permitted by this chapter or the rules of court and is not admissible in any court proceedings unrelated to the commitment proceedings.\n(c) The prepetition screening team shall provide a notice, written in easily understood language, to the proposed patient, the petitioner, persons named in a declaration under chapter 145C or section 253B.03, subdivision 6d, and, with the proposed patient's consent, other interested parties. The team shall ask the patient if the patient wants the notice read and shall read the notice to the patient upon request. The notice must contain information regarding the process, purpose, and legal effects of civil commitment. The notice must inform the proposed patient that:\n(1) if a petition is filed, the patient has certain rights, including the right to a court-appointed attorney, the right to request a second court examiner, the right to attend hearings, and the right to oppose the proceeding and to present and contest evidence; and\n(2) if the proposed patient is committed to a state-operated treatment program, the patient may be billed for the cost of care and the state has the right to make a claim against the patient's estate for this cost.\nThe ombudsman for mental health and developmental disabilities shall develop a form for the notice which includes the requirements of this paragraph.\n(d) When the prepetition screening team recommends commitment, a written report shall be sent to the county attorney for the county in which the petition is to be filed. The statement of facts contained in the written report must meet the requirements of subdivision 2, paragraph (b).\n(e) The prepetition screening team shall refuse to support a petition if the investigation does not disclose evidence sufficient to support commitment. Notice of the prepetition screening team's decision shall be provided to the prospective petitioner, any specific individuals identified in the examiner's statement, and to the proposed patient.\n(f) If the interested person wishes to proceed with a petition contrary to the recommendation of the prepetition screening team, application may be made directly to the county attorney, who shall determine whether or not to proceed with the petition. Notice of the county attorney's determination shall be provided to the interested party.\n(g) If the proposed patient has been acquitted of a crime under section 611.026, the county attorney shall apply to the designated county agency in the county in which the acquittal took place for a preliminary investigation unless substantially the same information relevant to the proposed patient's current mental condition, as could be obtained by a preliminary investigation, is part of the court record in the criminal proceeding or is contained in the report of a mental examination conducted in connection with the criminal proceeding. If a court petitions for commitment pursuant to the Rules of Criminal or Juvenile Procedure or a county attorney petitions pursuant to acquittal of a criminal charge under section 611.026, the prepetition investigation, if required by this section, shall be completed within seven days after the filing of the petition.\n(a) Any interested person, except a member of the prepetition screening team, may file a petition for commitment in the district court of the county of financial responsibility or the county where the proposed patient is present. If the head of the treatment facility, state-operated treatment program, or community-based treatment program believes that commitment is required and no petition has been filed, that person shall petition for the commitment of the proposed patient.\n(b) The petition shall set forth the name and address of the proposed patient, the name and address of the patient's nearest relatives, and the reasons for the petition. The petition must contain factual descriptions of the proposed patient's recent behavior, including a description of the behavior, where it occurred, and the time period over which it occurred. Each factual allegation must be supported by observations of witnesses named in the petition. Petitions shall be stated in behavioral terms and shall not contain judgmental or conclusory statements.\n(c) The petition shall be accompanied by a written statement by an examiner stating that the examiner has examined the proposed patient within the 15 days preceding the filing of the petition and is of the opinion that the proposed patient has a designated disability and should be committed to a treatment facility, state-operated treatment program, or community-based treatment program. The statement shall include the reasons for the opinion. In the case of a commitment based on mental illness, the petition and the examiner's statement shall include a statement and opinion regarding the proposed patient's need for treatment with neuroleptic medication and the patient's capacity to make decisions regarding the administration of neuroleptic medications, and the reasons for the opinion. If use of neuroleptic medications is recommended by the treating medical practitioner or other qualified medical provider, the petition for commitment must, if applicable, include or be accompanied by a request for proceedings under section 253B.092. Failure to include the required information regarding neuroleptic medications in the examiner's statement, or to include a request for an order regarding neuroleptic medications with the commitment petition, is not a basis for dismissing the commitment petition. If a petitioner has been unable to secure a statement from an examiner, the petition shall include documentation that a reasonable effort has been made to secure the supporting statement.\n(a) If criminal charges are pending against a defendant, the court shall order simultaneous competency and civil commitment examinations in accordance with Minnesota Rules of Criminal Procedure, rule 20.04, when the following conditions are met:\n(1) the prosecutor or defense counsel doubts the defendant's competency and a motion is made challenging competency, or the court on its initiative raises the issue under section 611.42 or Minnesota Rules of Criminal Procedure, rule 20.01; and\n(2) the prosecutor and defense counsel agree simultaneous examinations are appropriate.\nNo additional examination under subdivision 3 is required in a subsequent civil commitment proceeding unless a second examination is requested by defense counsel appointed following the filing of any petition for commitment.\n(b) Only a court examiner may conduct an assessment as described in section 611.43 or Minnesota Rules of Criminal Procedure, rules 20.01, subdivision 4, and 20.02, subdivision 2.\n(c) Where a county is ordered to consider civil commitment following a determination of incompetency under section 611.45 or Minnesota Rules of Criminal Procedure, rule 20.01, the county in which the criminal matter is pending is responsible to conduct prepetition screening and, if statutory conditions for commitment are satisfied, to file the commitment petition in that county. By agreement between county attorneys, prepetition screening and filing the petition may be handled in the county of financial responsibility or the county where the proposed patient is present.\n(d) Following an acquittal of a person of a criminal charge under section 611.026, the petition shall be filed by the county attorney of the county in which the acquittal took place and the petition shall be filed with the court in which the acquittal took place, and that court shall be the committing court for purposes of this chapter. When a petition is filed pursuant to subdivision 2 with the court in which acquittal of a criminal charge took place, the court shall assign the judge before whom the acquittal took place to hear the commitment proceedings unless that judge is unavailable.\n(a) The court may order the treatment facility or state-operated treatment program to hold the proposed patient or direct a health officer, peace officer, or other person to take the proposed patient into custody and transport the proposed patient to a treatment facility or state-operated treatment program for observation, evaluation, diagnosis, care, treatment, and, if necessary, confinement, when:\n(1) there has been a particularized showing by the petitioner that serious physical harm to the proposed patient or others is likely unless the proposed patient is immediately apprehended;\n(2) the proposed patient has not voluntarily appeared for the examination or the commitment hearing pursuant to the summons; or\n(3) a person is held pursuant to section 253B.051 and a request for a petition for commitment has been filed.\n(b) The order of the court may be executed on any day and at any time by the use of all necessary means including the imposition of necessary restraint upon the proposed patient. Where possible, a peace officer taking the proposed patient into custody pursuant to this subdivision shall not be in uniform and shall not use a vehicle visibly marked as a law enforcement vehicle. Except as provided in section 253D.10, subdivision 2, in the case of an individual on a judicial hold due to a petition for civil commitment under chapter 253D, assignment of custody during the hold is to the commissioner. The commissioner is responsible for determining the appropriate placement within a secure treatment facility under the authority of the commissioner.\n(c) A proposed patient must not be allowed or required to consent to nor participate in a clinical drug trial while an order is in effect under this subdivision. A consent given while an order is in effect is void and unenforceable. This paragraph does not prohibit a patient from continuing participation in a clinical drug trial if the patient was participating in the clinical drug trial at the time the order was issued under this subdivision.\nA patient has the right to be represented by counsel at any proceeding under this chapter. The court shall appoint a qualified attorney to represent the proposed patient if neither the proposed patient nor others provide counsel. The attorney shall be appointed at the time a petition for commitment is filed or when simultaneous competency and civil commitment examinations are ordered under subdivision 2a, whichever is sooner. In all proceedings under this chapter, the attorney shall:\n(1) consult with the person prior to any hearing;\n(2) be given adequate time and access to records to prepare for all hearings;\n(3) continue to represent the person throughout any proceedings under this chapter unless released as counsel by the court; and\n(4) be a vigorous advocate on behalf of the person.\nEither party may move to have the venue of the petition changed to the district court of the Minnesota county where the person currently lives, whether independently or pursuant to a placement. The county attorney of the proposed county of venue must be notified of the motion and provided the opportunity to respond before the court rules on the motion. The court shall grant the motion if it determines that the transfer is appropriate and is in the interests of justice. If the petition has been filed pursuant to the Rules of Criminal or Juvenile Procedure, venue may not be changed without the agreement of the county attorney of the proposed county of venue and the approval of the court in which the juvenile or criminal proceedings are pending.\nAfter a petition has been filed, the court shall appoint a court examiner. Prior to the hearing, the court shall inform the proposed patient of the right to an independent second examination. At the proposed patient's request, the court shall appoint a second court examiner of the patient's choosing to be paid for by the county at a rate of compensation fixed by the court.\n(a) A summons to appear for a prehearing examination and the commitment hearing shall be served upon the proposed patient. A plain language notice of the proceedings and notice of the filing of the petition shall be given to the proposed patient, patient's counsel, the petitioner, any interested person, and any other persons as the court directs.\n(b) The prepetition screening report, the petition, and the examiner's supporting statement shall be distributed to the petitioner, the proposed patient, the patient's counsel, the county attorney, any person authorized by the patient, and any other person as the court directs.\n(c) All papers shall be served personally on the proposed patient. Unless otherwise ordered by the court, the notice shall be served on the proposed patient by a nonuniformed person.\nThe examination shall be held at a treatment facility or other suitable place the court determines is not likely to harm the health of the proposed patient. The county attorney and the patient's attorney may be present during the examination. Either party may waive this right. Unless otherwise agreed by the parties, a court examiner shall file the report with the court not less than 48 hours prior to the commitment hearing. The court shall ensure that copies of the court examiner's report are provided to the county attorney, the proposed patient, and the patient's counsel.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) No proposed patient may be held in a treatment facility or state-operated treatment program under a judicial hold pursuant to subdivision 2b longer than 72 hours, exclusive of Saturdays, Sundays, and legal holidays, unless the court holds a preliminary hearing and determines that the standard is met to hold the proposed patient.\n(b) The proposed patient, patient's counsel, the petitioner, the county attorney, and any other persons as the court directs shall be given at least 24 hours written notice of the preliminary hearing. The notice shall include the alleged grounds for confinement. The proposed patient shall be represented at the preliminary hearing by counsel. The court may admit reliable hearsay evidence, including written reports, for the purpose of the preliminary hearing.\n(c) The court, on its motion or on the motion of any party, may exclude or excuse a proposed patient who is seriously disruptive or who is incapable of comprehending and participating in the proceedings. In such instances, the court shall, with specificity on the record, state the behavior of the proposed patient or other circumstances which justify proceeding in the absence of the proposed patient.\n(d) The court may continue the judicial hold of the proposed patient if it finds, by a preponderance of the evidence, that serious physical harm to the proposed patient or others is likely if the proposed patient is not immediately confined. If a proposed patient was acquitted of a crime against the person under section 611.026 immediately preceding the filing of the petition, the court may presume that serious physical harm to the patient or others is likely if the proposed patient is not immediately confined.\n(e) Upon a showing that a proposed patient subject to a petition for commitment may need treatment with neuroleptic medications and that the proposed patient may lack capacity to make decisions regarding that treatment, the court may appoint a substitute decision-maker as provided in section 253B.092, subdivision 6. The substitute decision-maker shall meet with the proposed patient and provider and make a report to the court at the hearing under section 253B.08 regarding whether the administration of neuroleptic medications is appropriate under the criteria of section 253B.092, subdivision 7. If the substitute decision-maker consents to treatment with neuroleptic medications and the proposed patient does not refuse the medication, neuroleptic medication may be administered to the proposed patient. If the substitute decision-maker does not consent or the proposed patient refuses, neuroleptic medication may not be administered without a court order, or in an emergency as set forth in section 253B.092, subdivision 3.",
	"repealed": false
}