{
	"id": "524.2-106",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-106",
	"title": "524.2-106 REPRESENTATION.",
	"text": "(a) Application. If representation is called for by this article, paragraphs (b) and (c) apply.\n(b) Decedent's descendants. In the case of descendants of the decedent, the estate is divided into as many shares as there are surviving children of the decedent and deceased children who left descendants who survive the decedent, each surviving child receiving one share and the share of each deceased child being divided among its descendants in the same manner.\n(c) Descendants of parents or grandparents. If, under section 524.2-103, clause (3) or (4), a decedent's intestate estate or a part thereof passes by \"representation\" to the descendants of the decedent's deceased parents or either of them or to the descendants of the decedent's deceased paternal or maternal grandparents or either of them, the estate or part thereof is divided in the following manner:\n(1) In the case of descendants of the decedent's deceased parents or either of them, the estate or part thereof is divided into as many equal shares as there are (i) surviving descendants in the generation nearest the deceased parents or either of them, and (ii) deceased descendants in the same generation who left surviving descendants, if any. Each surviving descendant in the nearest generation is allocated one share, and the surviving descendants of each deceased descendant in the same generation are allocated one share, to be divided in the same manner as specified in paragraph (b).\n(2) In the case of descendants of the decedent's deceased paternal or maternal grandparents or either of them, the estate or part thereof is divided into as many equal shares as there are surviving descendants in the generation nearest the deceased grandparents or either of them that contains one or more surviving descendants. Each surviving descendant in the nearest generation is allocated one share.",
	"repealed": false
}