{
	"id": "103E.721",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.721",
	"title": "103E.721 REPLACEMENT AND HYDRAULIC CAPACITY OF BRIDGES AND CULVERTS.",
	"text": "If the engineer determines in a drainage system repair proceeding that because of added property under section 103E.741 or otherwise, a bridge constructed or replaced or culvert installed or replaced as a part of a drainage system provides inadequate hydraulic capacity for the efficient operation of the drainage system to serve its original purpose, the engineer shall make a hydraulic capacity report to the drainage authority. The hydraulic capacity report must include plans and specifications for the recommended replacement of bridges and culverts, the necessary details to make and award a contract, and the estimated cost.\nWhen the hydraulic capacity report is filed, the auditor shall promptly notify the drainage authority. The drainage authority in consultation with the auditor shall, by order, set a time not more than 30 days after the date of the order, for a hearing on the report. At least ten days before the hearing, the auditor shall give notice by mail of the time and location of the hearing to the petitioners, owners of property, and political subdivisions likely to be affected by the repair proposed in the repair report. The notice may be given in conjunction with and as a part of the repair report notice, but the notice must specifically state that increasing the hydraulic capacity will be considered by the drainage authority at the hearing.\nAt the hearing on the hydraulic capacity report, the drainage authority shall hear all interested parties. If the drainage authority finds that existing bridges and culverts provide insufficient hydraulic capacity for the efficient operation of the drainage system as originally constructed or subsequently improved, the drainage authority shall make findings accordingly, and may order that the hydraulic capacity be increased by constructing bridges or installing culverts of a sufficient capacity. The drainage authority shall determine and include in the order the type and plans for the replacement bridges or culverts. The order must direct the state, political subdivision, railroad company, or other entity to construct bridges or culverts required by the order for its road or right-of-way within a reasonable time stated in the order. The auditor shall notify the state, political subdivision, railroad company, or other entity to construct the bridges and culverts in accordance with the order.\nIf the work is not done within the time specified, the drainage authority may order the bridges and culverts built and the cost collected as an assessment for benefits.\nIf a political subdivision, railroad company, or other entity, at the hearing or when notified to construct a bridge or install a culvert, requests that the bridge or culvert be installed as part of the repair of the drainage system, the drainage authority may, by order, direct the cost of the construction and installation be assessed and collected from the political subdivision, railroad company, or other entity in the manner provided by section 103E.731.",
	"repealed": false
}