{
	"id": "216B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.23",
	"title": "216B.23 LAWFUL RATE; REASONABLE SERVICE.",
	"text": "Whenever upon an investigation made under the provisions of Laws 1974, chapter 429, the commission shall find rates, tolls, charges, schedules or joint rates to be unjust, unreasonable, insufficient, or unjustly discriminatory or preferential or otherwise unreasonable or unlawful, the commission shall determine and by order fix reasonable rates, tolls, charges, schedules, or joint rates to be imposed, observed, and followed in the future in lieu of those found to be unreasonable or unlawful.\n(a) On determining that a public utility has charged a rate in violation of this chapter, a commission rule, or a commission order, the commission, after conducting a proceeding, may require the public utility to refund to its customers, in a manner approved by the commission, any revenues the commission finds were collected as a result of the unlawful conduct. Any refund authorized by this section is permitted in addition to any remedies authorized by section 216B.16 or any other law governing rates. Exercising authority under this section does not preclude the commission from pursuing penalties under sections 216B.57 to 216B.61 for the same conduct.\n(b) This section must not be construed as allowing:\n(1) retroactive ratemaking;\n(2) refunds based on claims that prior or current approved rates have been unjust, unreasonable, unreasonably preferential, discriminatory, insufficient, inequitable, or inconsistent in application to a class of customers; or\n(3) refunds based on claims that approved rates have not encouraged energy conservation or renewable energy use, or have not furthered the goals of section 216B.164, 216B.241, or 216C.05.\n(c) A refund under this subdivision does not apply to revenues collected more than six years before the date of the notice of the commission proceeding required under this subdivision.\nWhenever the commission shall find any regulations, measurements, practices, acts, or service to be unjust, unreasonable, insufficient, preferential, unjustly discriminatory, or otherwise unreasonable or unlawful, or shall find that any service which can be reasonably demanded cannot be obtained, the commission shall determine and by order fix reasonable measurements, regulations, acts, practices, or service to be furnished, imposed, observed and followed in the future in lieu of those found to be unreasonable, inadequate, or otherwise unlawful, and shall make any other order respecting the measurement, regulation, act, practice, or service as shall be just and reasonable.\nA copy of the order shall be served upon the person against whom it runs or the person's attorney, and notice thereof shall be given to the other parties to the proceedings or their attorneys.",
	"repealed": false
}