{
	"id": "135A.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.161",
	"title": "135A.161 INCLUSIVE HIGHER EDUCATION TECHNICAL ASSISTANCE CENTER.",
	"text": "(a) For purposes of this section and section 135A.162, the following terms have the meanings given.\n(b) \"Center\" means the Inclusive Higher Education Technical Assistance Center.\n(c) \"Commissioner\" means the commissioner of the Office of Higher Education.\n(d) \"Comprehensive transition and postsecondary program for students with intellectual disabilities\" means a degree, certificate, or nondegree program that is offered by an institution of higher education for students with intellectual disabilities and approved by the United States Department of Education.\n(e) \"Director\" means the director of the Inclusive Higher Education Technical Assistance Center.\n(f) \"Inclusive higher education\" means institution-approved access to higher education for students with an intellectual disability that allows for the same rights, privileges, experiences, benefits, and outcomes that result from a college experience the same as a matriculating student, resulting in a meaningful credential conferred by the institution of higher education. Inclusive higher education includes:\n(1) academic access and inclusive instruction;\n(2) person-centered planning;\n(3) career development;\n(4) campus engagement;\n(5) self-determination;\n(6) paid internships and employment;\n(7) on- or off-campus living, when available to other students;\n(8) campus community clubs, events, and activity participation;\n(9) peer mentors and support; and\n(10) a degree, certificate, or nondegree credential.\n(g) \"National Coordinating Center\" means the federally funded National Coordinating Center, as identified in United States Code, title 20, section 1140q, that provides training and technical assistance supporting evidence-based and student-centered research and practice for inclusive higher education initiatives for students with intellectual disabilities.\n(h) \"Office\" means the Office of Higher Education.\n(i) \"Student with an intellectual disability\" means a student with an intellectual disability as defined in Code of Federal Regulations, title 34, section 668.231.\nThe commissioner must contract with the Institute on Community Integration at the University of Minnesota to establish the Inclusive Higher Education Technical Assistance Center. The purpose of the center is to increase access to self-sustaining postsecondary education options across Minnesota for students with an intellectual disability to earn meaningful credentials through degree, certificate, and nondegree initiatives leading to competitive integrated employment, genuine community membership, and more independent living. The center must:\n(1) coordinate and facilitate the statewide initiative to expand and enhance inclusive higher education opportunities;\n(2) provide expertise in inclusive higher education for students with an intellectual disability;\n(3) provide technical assistance:\n(i) to Minnesota institutions of higher education;\n(ii) to local education agencies; and\n(iii) as requested by the commissioner; and\n(4) provide information to students with intellectual disabilities and their families.\n(a) The center must name a director.\n(b) The center must make hiring decisions based on the Institute on Community Integration's values of diversity and inclusion of staff with disabilities.\n(c) The director must appoint an advisory committee and seek the committee's review and recommendations on broad programmatic direction. The advisory committee must be composed of 50 percent students with an intellectual disability. The remaining positions must be filled by family members, key stakeholders, and allies. The director must convene the advisory committee at least quarterly. The advisory committee shall:\n(1) review and recommend inclusive higher education offerings;\n(2) review and recommend updates to state policy and practice;\n(3) document existing and potential funding sources; and\n(4) identify obstacles and barriers to students with an intellectual disability to access inclusive higher education opportunities.\n(a) The center must advise and offer technical assistance to all Minnesota institutions of higher education planning or offering an inclusive higher education initiative to operate in accordance with federal requirements, the model Program Accreditation Standards for Postsecondary Education Programs for Students with Intellectual Disabilities, and guiding principles for inclusive higher education as developed by the National Coordinating Center.\n(b) The center must monitor federal and state law related to inclusive higher education and notify the governor, the legislature, and the Office of Higher Education of any change in law which may impact inclusive higher education.\n(c) The center must provide technical assistance to institutions of higher education, administrators, faculty, and staff by:\n(1) offering institution faculty and staff training and professional development to start, operate, or enhance their inclusive higher education initiative;\n(2) providing faculty and staff with information, training, and consultation on the comprehensive transition and postsecondary program requirements, model Program Accreditation Standards for Postsecondary Education Programs for Students with Intellectual Disabilities, and guiding principles;\n(3) organizing and offering learning community events, an annual inclusive higher education conference and community of practice events to share best practices, provide access to national experts, and address challenges and concerns;\n(4) assisting institutions of higher education with identifying existing or potential funding sources for the institution of higher education, student financial aid, and funding for students with an intellectual disability; and\n(5) advising faculty and staff with an inclusive higher education option of specific grant applications and funding opportunities.\n(d) The center must disseminate information to students with an intellectual disability, their parents, and local education agencies, including but not limited to information about:\n(1) postsecondary education options, services, and resources that are available at inclusive institutions of higher education;\n(2) technical assistance and training provided by the center, the National Coordinating Center, and key stakeholder organizations and agencies; and\n(3) mentoring, networking, and employment opportunities.\nThe director must evaluate the development and implementation of the Minnesota inclusive higher education initiatives receiving a grant under section 135A.162. The director must submit an annual report by October 1 on the progress to expand Minnesota inclusive higher education options for students with intellectual disabilities to the commissioner and chairs and ranking minority members of the legislative committees with jurisdiction over higher education policy and finance. The report must include statutory and budget recommendations.",
	"repealed": false
}