{
	"id": "144A.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.071",
	"title": "144A.071 MORATORIUM ON CERTIFICATION OF NURSING HOME BEDS.",
	"text": "The legislature declares that a moratorium on the licensure and medical assistance certification of new nursing home beds and construction projects that exceed $1,000,000 is necessary to control nursing home expenditure growth and enable the state to meet the needs of its elderly by providing high quality services in the most appropriate manner along a continuum of care.\nFor purposes of sections 144A.071 to 144A.073, the following terms have the meanings given them:\n(a) \"Attached fixtures\" has the meaning given in Minnesota Rules, part 9549.0020, subpart 6.\n(b) \"Building\" has the meaning given in section 256R.261, subdivision 4.\n(c) \"Capital assets\" has the meaning given in section 256R.02, subdivision 8.\n(d) \"Commenced construction\" means that all of the following conditions were met: the final working drawings and specifications were approved by the commissioner of health; the construction contracts were let; a timely construction schedule was developed, stipulating dates for beginning, achieving various stages, and completing construction; and all zoning and building permits were applied for.\n(e) \"Completion date\" means the date on which clearance for the construction project is issued, or if a clearance for the construction project is not required, the date on which the construction project assets are available for facility use.\n(f) \"Construction\" means any erection, building, alteration, reconstruction, modernization, or improvement necessary to comply with the nursing home licensure rules.\n(g) \"Construction project\" means:\n(1) a capital asset addition to, or replacement of a nursing home or certified boarding care home that results in new space or the remodeling of or renovations to existing facility space; and\n(2) the remodeling or renovation of existing facility space the use of which is modified as a result of the project described in clause (1). This existing space and the project described in clause (1) must be used for the functions as designated on the construction plans on completion of the project described in clause (1) for a period of not less than 24 months.\n(h) \"Depreciation guidelines\" has the meaning given in section 256R.261, subdivision 11.\n(i) \"New licensed\" or \"new certified beds\" means:\n(1) newly constructed beds in a facility or the construction of a new facility that would increase the total number of licensed nursing home beds or certified boarding care or nursing home beds in the state; or\n(2) newly licensed nursing home beds or newly certified boarding care or nursing home beds that result from remodeling of the facility that involves relocation of beds but does not result in an increase in the total number of beds, except when the project involves the upgrade of boarding care beds to nursing home beds, as defined in section 144A.073, subdivision 1. \"Remodeling\" includes any of the type of conversion, renovation, replacement, or upgrading projects as defined in section 144A.073, subdivision 1.\n(a) The commissioner of health, in coordination with the commissioner of human services, shall deny each request for new licensed or certified nursing home or certified boarding care beds except as provided in subdivision 3 or 4a, or section 144A.073. \"Certified bed\" means a nursing home bed or a boarding care bed certified by the commissioner of health for the purposes of the medical assistance program, under United States Code, title 42, sections 1396 et seq. Certified beds in facilities which do not allow medical assistance intake shall be deemed to be decertified for purposes of this section only.\n(b) The commissioner of human services, in coordination with the commissioner of health, shall deny any request to issue a license under section 252.28 and chapter 245A to a nursing home or boarding care home, if that license would result in an increase in the medical assistance reimbursement amount.\n(c) In addition, the commissioner of health must not approve any construction project whose cost exceeds $1,000,000, unless:\n(1) any construction costs exceeding $1,000,000 are not added to the facility's appraised value and are not included in the facility's payment rate for reimbursement under the medical assistance program; or\n(2) the project:\n(i) has been approved through the process described in section 144A.073;\n(ii) meets an exception in subdivision 3 or 4a;\n(iii) is necessary to correct violations of state or federal law issued by the commissioner of health;\n(iv) is necessary to repair or replace a portion of the facility that was damaged by fire, lightning, ground shifts, or other such hazards, including environmental hazards, provided that the provisions of subdivision 4a, clause (a), are met; or\n(v) is being proposed by a licensed nursing facility that is not certified to participate in the medical assistance program and will not result in new licensed or certified beds.\n(d) Prior to the final plan approval of any construction project, the commissioners of health and human services shall be provided with an itemized cost estimate for the project construction costs. If a construction project is anticipated to be completed in phases, the total estimated cost of all phases of the project shall be submitted to the commissioners and shall be considered as one construction project. Once the construction project is completed and prior to the final clearance by the commissioners, the total project construction costs for the construction project shall be submitted to the commissioners. If the final project construction cost exceeds the dollar threshold in this subdivision, the commissioner of human services shall not recognize any of the project construction costs or the related financing costs in excess of this threshold in establishing the facility's property-related payment rate.\n(e) The dollar thresholds for construction projects are as follows: for construction projects other than those authorized in paragraph (c), clause (2), items (i) to (v), the dollar threshold is $1,000,000. For projects authorized after July 1, 1993, under paragraph (c), clause (2), item (i), the dollar threshold is the cost estimate submitted with a proposal for an exception under section 144A.073, plus inflation as calculated according to section 256B.431, subdivision 3f, paragraph (a). For projects authorized under paragraph (c), clause (2), items (ii) to (iv), the dollar threshold is the itemized estimate project construction costs submitted to the commissioner of health at the time of final plan approval, plus inflation as calculated according to section 256B.431, subdivision 3f, paragraph (a).\n(f) The commissioner of health shall adopt rules to implement this section or to amend the emergency rules for granting exceptions to the moratorium on nursing homes under section 144A.073.\n(g) All construction projects approved through section 144A.073, subdivision 3, after March 1, 2020, are subject to the fair rental value property rate as described in section 256R.26.\n(a) The commissioner of health, in coordination with the commissioner of human services, may approve the addition of new licensed and Medicare and Medicaid certified nursing home beds, using the criteria and process set forth in this subdivision.\n(b) The commissioner, in cooperation with the commissioner of human services, shall consider the following criteria when determining that an area of the state is a hardship area with regard to access to nursing facility services:\n(1) a low number of beds per thousand in a specified area using as a standard the beds per thousand people age 65 and older, in five year age groups, using data from the most recent census and population projections, weighted by each group's most recent nursing home utilization, of the county at the 20th percentile, as determined by the commissioner of human services;\n(2) a high level of out-migration for nursing facility services associated with a described area from the county or counties of residence to other Minnesota counties, as determined by the commissioner of human services, using as a standard an amount greater than the out-migration of the county ranked at the 50th percentile;\n(3) an adequate level of availability of noninstitutional long-term care services measured as public spending for home and community-based long-term care services per individual age 65 and older, in five year age groups, using data from the most recent census and population projections, weighted by each group's most recent nursing home utilization, as determined by the commissioner of human services using as a standard an amount greater than the 50th percentile of counties;\n(4) there must be a declaration of hardship resulting from insufficient access to nursing home beds by local county agencies and area agencies on aging; and\n(5) other factors that may demonstrate the need to add new nursing facility beds.\n(c) On August 15 of odd-numbered years, the commissioner, in cooperation with the commissioner of human services, may publish in the State Register a request for information in which interested parties, using the data provided under section 144A.351, along with any other relevant data, demonstrate that a specified area is a hardship area with regard to access to nursing facility services. For a response to be considered, the commissioner must receive it by November 15. The commissioner shall make responses to the request for information available to the public and shall allow 30 days for comment. The commissioner shall review responses and comments and determine if any areas of the state are to be declared hardship areas.\n(d) For each designated hardship area determined in paragraph (c), the commissioner shall publish a request for proposals in accordance with section 144A.073 and Minnesota Rules, parts 4655.1070 to 4655.1098. The request for proposals must be published in the State Register by March 15 following receipt of responses to the request for information. The request for proposals must specify the number of new beds which may be added in the designated hardship area, which must not exceed the number which, if added to the existing number of beds in the area, including beds in layaway status, would have prevented it from being determined to be a hardship area under paragraph (b), clause (1). Beginning July 1, 2011, the number of new beds approved must not exceed 200 beds statewide per biennium. After June 30, 2019, the number of new beds that may be approved in a biennium must not exceed 300 statewide. For a proposal to be considered, the commissioner must receive it within six months of the publication of the request for proposals. The commissioner shall review responses to the request for proposals and shall approve or disapprove each proposal by the following July 15, in accordance with section 144A.073 and Minnesota Rules, parts 4655.1070 to 4655.1098. The commissioner shall base approvals or disapprovals on a comparison and ranking of proposals using only the criteria in subdivision 4a. Approval of a proposal expires after 18 months unless the facility has added the new beds using existing space, subject to approval by the commissioner, or has commenced construction as defined in subdivision 1a, paragraph (d). If, after the approved beds have been added, fewer than 50 percent of the beds in a facility are newly licensed, the operating payment rates previously in effect shall remain. If, after the approved beds have been added, 50 percent or more of the beds in a facility are newly licensed, operating and external fixed payment rates shall be determined according to section 256R.21, subdivision 5. Property payment rates for facilities with beds added under this subdivision must be determined under section 256R.26.\n(e) The commissioner may:\n(1) certify or license new beds in a new facility that is to be operated by the commissioner of veterans affairs or when the costs of constructing and operating the new beds are to be reimbursed by the commissioner of veterans affairs or the United States Veterans Administration; and\n(2) license or certify beds in a facility that has been involuntarily delicensed or decertified for participation in the medical assistance program, provided that an application for relicensure or recertification is submitted to the commissioner by an organization that is not a related organization as defined in section 256R.02, subdivision 43, to the prior licensee within 120 days after delicensure or decertification.\n[Repealed, 1992 c 513 art 7 s 135]\nThe commissioner of health, in coordination with the commissioner of human services, shall implement mechanisms to monitor and analyze the effect of the moratorium in the different geographic areas of the state. The commissioner of health shall submit to the legislature, no later than January 15, 1984, and annually thereafter, an assessment of the impact of the moratorium by geographic area, with particular attention to service deficits or problems and a corrective action plan.\nIt is in the best interest of the state to ensure that nursing homes and boarding care homes continue to meet the physical plant licensing and certification requirements by permitting certain construction projects. Facilities should be maintained in condition to satisfy the physical and emotional needs of residents while allowing the state to maintain control over nursing home expenditure growth.\nThe commissioner of health in coordination with the commissioner of human services, may approve the renovation, replacement, upgrading, or relocation of a nursing home or boarding care home, under the following conditions:\n(a) to license or certify beds in a new facility constructed to replace a facility or to make repairs in an existing facility that was destroyed or damaged after June 30, 1987, by fire, lightning, or other hazard provided:\n(i) destruction was not caused by the intentional act of or at the direction of a controlling person of the facility;\n(ii) at the time the facility was destroyed or damaged the controlling persons of the facility maintained insurance coverage for the type of hazard that occurred in an amount that a reasonable person would conclude was adequate;\n(iii) the net proceeds from an insurance settlement for the damages caused by the hazard are applied to the cost of the new facility or repairs;\n(iv) the number of licensed and certified beds in the new facility does not exceed the number of licensed and certified beds in the destroyed facility; and\n(v) the commissioner determines that the replacement beds are needed to prevent an inadequate supply of beds.\nProject construction costs incurred for repairs authorized under this clause shall not be considered in the dollar threshold amount defined in subdivision 2;\n(b) to license or certify beds that are moved from one location to another within a nursing home facility, provided the total costs of remodeling performed in conjunction with the relocation of beds does not exceed $1,000,000;\n(c) to license or certify beds in a project recommended for approval under section 144A.073;\n(d) to license or certify beds that are moved from an existing state nursing home to a different state facility, provided there is no net increase in the number of state nursing home beds;\n(e) to certify and license as nursing home beds boarding care beds in a certified boarding care facility if the beds meet the standards for nursing home licensure, or in a facility that was granted an exception to the moratorium under section 144A.073, and if the cost of any remodeling of the facility does not exceed $1,000,000. If boarding care beds are licensed as nursing home beds, the number of boarding care beds in the facility must not increase beyond the number remaining at the time of the upgrade in licensure. The provisions contained in section 144A.073 regarding the upgrading of the facilities do not apply to facilities that satisfy these requirements;\n(f) to license and certify up to 40 beds transferred from an existing facility owned and operated by the Amherst H. Wilder Foundation in the city of St. Paul to a new unit at the same location as the existing facility that will serve persons with Alzheimer's disease and other related disorders. The transfer of beds may occur gradually or in stages, provided the total number of beds transferred does not exceed 40. At the time of licensure and certification of a bed or beds in the new unit, the commissioner of health shall delicense and decertify the same number of beds in the existing facility. As a condition of receiving a license or certification under this clause, the facility must make a written commitment to the commissioner of human services that it will not seek to receive an increase in its property-related payment rate as a result of the transfers allowed under this paragraph;\n(g) to license and certify nursing home beds to replace currently licensed and certified boarding care beds which may be located either in a remodeled or renovated boarding care or nursing home facility or in a remodeled, renovated, newly constructed, or replacement nursing home facility within the identifiable complex of health care facilities in which the currently licensed boarding care beds are presently located, provided that the number of boarding care beds in the facility or complex are decreased by the number to be licensed as nursing home beds and further provided that, if the total costs of new construction, replacement, remodeling, or renovation exceed ten percent of the appraised value of the facility or $200,000, whichever is less, the facility makes a written commitment to the commissioner of human services that it will not seek to receive an increase in its property-related payment rate by reason of the new construction, replacement, remodeling, or renovation. The provisions contained in section 144A.073 regarding the upgrading of facilities do not apply to facilities that satisfy these requirements;\n(h) to license as a nursing home and certify as a nursing facility a facility that is licensed as a boarding care facility but not certified under the medical assistance program, but only if the commissioner of human services certifies to the commissioner of health that licensing the facility as a nursing home and certifying the facility as a nursing facility will result in a net annual savings to the state general fund of $200,000 or more;\n(i) to certify, after September 30, 1992, and prior to July 1, 1993, existing nursing home beds in a facility that was licensed and in operation prior to January 1, 1992;\n(j) to license and certify new nursing home beds to replace beds in a facility acquired by the Minneapolis Community Development Agency as part of redevelopment activities in a city of the first class, provided the new facility is located within three miles of the site of the old facility. Operating and property costs for the new facility must be determined and allowed under section 256B.431 or 256B.434 or chapter 256R;\n(k) to license and certify up to 20 new nursing home beds in a community-operated hospital and attached convalescent and nursing care facility with 40 beds on April 21, 1991, that suspended operation of the hospital in April 1986. The commissioner of human services shall provide the facility with the same per diem property-related payment rate for each additional licensed and certified bed as it will receive for its existing 40 beds;\n(l) to license or certify beds in renovation, replacement, or upgrading projects as defined in section 144A.073, subdivision 1, so long as the cumulative total costs of the facility's remodeling projects do not exceed $1,000,000;\n(m) to license and certify beds that are moved from one location to another for the purposes of converting up to five four-bed wards to single or double occupancy rooms in a nursing home that, as of January 1, 1993, was county-owned and had a licensed capacity of 115 beds;\n(n) to allow a facility that on April 16, 1993, was a 106-bed licensed and certified nursing facility located in Minneapolis to layaway all of its licensed and certified nursing home beds. These beds may be relicensed and recertified in a newly constructed teaching nursing home facility affiliated with a teaching hospital upon approval by the legislature. The proposal must be developed in consultation with the interagency committee on long-term care planning. The beds on layaway status shall have the same status as voluntarily delicensed and decertified beds, except that beds on layaway status remain subject to the surcharge in section 256.9657. This layaway provision expires July 1, 1998;\n(o) to allow a project which will be completed in conjunction with an approved moratorium exception project for a nursing home in southern Cass County and which is directly related to that portion of the facility that must be repaired, renovated, or replaced, to correct an emergency plumbing problem for which a state correction order has been issued and which must be corrected by August 31, 1993;\n(p) to allow a facility that on April 16, 1993, was a 368-bed licensed and certified nursing facility located in Minneapolis to layaway, upon 30 days prior written notice to the commissioner, up to 30 of the facility's licensed and certified beds by converting three-bed wards to single or double occupancy. Beds on layaway status shall have the same status as voluntarily delicensed and decertified beds except that beds on layaway status remain subject to the surcharge in section 256.9657, remain subject to the license application and renewal fees under section 144A.07 and shall be subject to a $100 per bed reactivation fee. In addition, at any time within three years of the effective date of the layaway, the beds on layaway status may be:\n(1) relicensed and recertified upon relocation and reactivation of some or all of the beds to an existing licensed and certified facility or facilities located in Pine River, Brainerd, or International Falls; provided that the total project construction costs related to the relocation of beds from layaway status for any facility receiving relocated beds may not exceed the dollar threshold provided in subdivision 2 unless the construction project has been approved through the moratorium exception process under section 144A.073;\n(2) relicensed and recertified, upon reactivation of some or all of the beds within the facility which placed the beds in layaway status, if the commissioner has determined a need for the reactivation of the beds on layaway status.\nThe property-related payment rate of a facility placing beds on layaway status must be adjusted by the incremental change in its rental per diem after recalculating the rental per diem as provided in section 256B.431, subdivision 3a, paragraph (c). The property-related payment rate for a facility relicensing and recertifying beds from layaway status must be adjusted by the incremental change in its rental per diem after recalculating its rental per diem using the number of beds after the relicensing to establish the facility's capacity day divisor, which shall be effective the first day of the month following the month in which the relicensing and recertification became effective. Any beds remaining on layaway status more than three years after the date the layaway status became effective must be removed from layaway status and immediately delicensed and decertified;\n(q) to license and certify beds in a renovation and remodeling project to convert 12 four-bed wards into 24 two-bed rooms, expand space, and add improvements in a nursing home that, as of January 1, 1994, met the following conditions: the nursing home was located in Ramsey County; had a licensed capacity of 154 beds; and had been ranked among the top 15 applicants by the 1993 moratorium exceptions advisory review panel. The total project construction cost estimate for this project must not exceed the cost estimate submitted in connection with the 1993 moratorium exception process;\n(r) to license and certify up to 117 beds that are relocated from a licensed and certified 138-bed nursing facility located in St. Paul to a hospital with 130 licensed hospital beds located in South St. Paul, provided that the nursing facility and hospital are owned by the same or a related organization and that prior to the date the relocation is completed the hospital ceases operation of its inpatient hospital services at that hospital. After relocation, the nursing facility's status shall be the same as it was prior to relocation. The nursing facility's property-related payment rate resulting from the project authorized in this paragraph shall become effective no earlier than April 1, 1996. For purposes of calculating the incremental change in the facility's rental per diem resulting from this project, the allowable appraised value of the nursing facility portion of the existing health care facility physical plant prior to the renovation and relocation may not exceed $2,490,000;\n(s) to license and certify two beds in a facility to replace beds that were voluntarily delicensed and decertified on June 28, 1991;\n(t) to allow 16 licensed and certified beds located on July 1, 1994, in a 142-bed nursing home and 21-bed boarding care home facility in Minneapolis, notwithstanding the licensure and certification after July 1, 1995, of the Minneapolis facility as a 147-bed nursing home facility after completion of a construction project approved in 1993 under section 144A.073, to be laid away upon 30 days' prior written notice to the commissioner. Beds on layaway status shall have the same status as voluntarily delicensed or decertified beds except that they shall remain subject to the surcharge in section 256.9657. The 16 beds on layaway status may be relicensed as nursing home beds and recertified at any time within five years of the effective date of the layaway upon relocation of some or all of the beds to a licensed and certified facility located in Watertown, provided that the total project construction costs related to the relocation of beds from layaway status for the Watertown facility may not exceed the dollar threshold provided in subdivision 2 unless the construction project has been approved through the moratorium exception process under section 144A.073.\nThe property-related payment rate of the facility placing beds on layaway status must be adjusted by the incremental change in its rental per diem after recalculating the rental per diem as provided in section 256B.431, subdivision 3a, paragraph (c). The property-related payment rate for the facility relicensing and recertifying beds from layaway status must be adjusted by the incremental change in its rental per diem after recalculating its rental per diem using the number of beds after the relicensing to establish the facility's capacity day divisor, which shall be effective the first day of the month following the month in which the relicensing and recertification became effective. Any beds remaining on layaway status more than five years after the date the layaway status became effective must be removed from layaway status and immediately delicensed and decertified;\n(u) to license and certify beds that are moved within an existing area of a facility or to a newly constructed addition which is built for the purpose of eliminating three- and four-bed rooms and adding space for dining, lounge areas, bathing rooms, and ancillary service areas in a nursing home that, as of January 1, 1995, was located in Fridley and had a licensed capacity of 129 beds;\n(v) to relocate 36 beds in Crow Wing County and four beds from Hennepin County to a 160-bed facility in Crow Wing County, provided all the affected beds are under common ownership;\n(w) to license and certify a total replacement project of up to 49 beds located in Norman County that are relocated from a nursing home destroyed by flood and whose residents were relocated to other nursing homes. The operating cost payment rates for the new nursing facility shall be determined based on the interim and settle-up payment provisions of section 256R.27 and the reimbursement provisions of chapter 256R. Property-related reimbursement rates shall be determined under section 256R.26, taking into account any federal or state flood-related loans or grants provided to the facility;\n(x) to license and certify to the licensee of a nursing home in Polk County that was destroyed by flood in 1997 replacement projects with a total of up to 129 beds, with at least 25 beds to be located in Polk County and up to 104 beds distributed among up to three other counties. These beds may only be distributed to counties with fewer than the median number of age intensity adjusted beds per thousand, as most recently published by the commissioner of human services. If the licensee chooses to distribute beds outside of Polk County under this paragraph, prior to distributing the beds, the commissioner of health must approve the location in which the licensee plans to distribute the beds. The commissioner of health shall consult with the commissioner of human services prior to approving the location of the proposed beds. The licensee may combine these beds with beds relocated from other nursing facilities as provided in section 144A.073, subdivision 3c. The operating payment rates for the new nursing facilities shall be determined based on the interim and settle-up payment provisions of Minnesota Rules, parts 9549.0010 to 9549.0080. Property-related reimbursement rates shall be determined under section 256R.26. If the replacement beds permitted under this paragraph are combined with beds from other nursing facilities, the rates shall be calculated as the weighted average of rates determined as provided in this paragraph and section 256R.50;\n(y) to license and certify beds in a renovation and remodeling project to convert 13 three-bed wards into 13 two-bed rooms and 13 single-bed rooms, expand space, and add improvements in a nursing home that, as of January 1, 1994, met the following conditions: the nursing home was located in Ramsey County, was not owned by a hospital corporation, had a licensed capacity of 64 beds, and had been ranked among the top 15 applicants by the 1993 moratorium exceptions advisory review panel. The total project construction cost estimate for this project must not exceed the cost estimate submitted in connection with the 1993 moratorium exception process;\n(z) to license and certify up to 150 nursing home beds to replace an existing 285 bed nursing facility located in St. Paul. The replacement project shall include both the renovation of existing buildings and the construction of new facilities at the existing site. The reduction in the licensed capacity of the existing facility shall occur during the construction project as beds are taken out of service due to the construction process. Prior to the start of the construction process, the facility shall provide written information to the commissioner of health describing the process for bed reduction, plans for the relocation of residents, and the estimated construction schedule. The relocation of residents shall be in accordance with the provisions of law and rule;\n(aa) to allow the commissioner of human services to license an additional 36 beds to provide residential services for the physically disabled under Minnesota Rules, parts 9570.2000 to 9570.3400, in a 198-bed nursing home located in Red Wing, provided that the total number of licensed and certified beds at the facility does not increase;\n(bb) to license and certify a new facility in St. Louis County with 44 beds constructed to replace an existing facility in St. Louis County with 31 beds, which has resident rooms on two separate floors and an antiquated elevator that creates safety concerns for residents and prevents nonambulatory residents from residing on the second floor. The project shall include the elimination of three- and four-bed rooms;\n(cc) to license and certify four beds in a 16-bed certified boarding care home in Minneapolis to replace beds that were voluntarily delicensed and decertified on or before March 31, 1992. The licensure and certification is conditional upon the facility periodically assessing and adjusting its resident mix and other factors which may contribute to a potential institution for mental disease declaration. The commissioner of human services shall retain the authority to audit the facility at any time and shall require the facility to comply with any requirements necessary to prevent an institution for mental disease declaration, including delicensure and decertification of beds, if necessary;\n(dd) to license and certify 72 beds in an existing facility in Mille Lacs County with 80 beds as part of a renovation project. The renovation must include construction of an addition to accommodate ten residents with beginning and midstage dementia in a self-contained living unit; creation of three resident households where dining, activities, and support spaces are located near resident living quarters; designation of four beds for rehabilitation in a self-contained area; designation of 30 private rooms; and other improvements;\n(ee) to license and certify beds in a facility that has undergone replacement or remodeling as part of a planned closure under section 256R.40;\n(ff) to license and certify a total replacement project of up to 124 beds located in Wilkin County that are in need of relocation from a nursing home significantly damaged by flood. The operating cost payment rates for the new nursing facility shall be determined based on the interim and settle-up payment provisions of section 256R.27 and the reimbursement provisions of chapter 256R. Property-related reimbursement rates shall be determined under section 256R.26, taking into account any federal or state flood-related loans or grants provided to the facility;\n(gg) to allow the commissioner of human services to license an additional nine beds to provide residential services for the physically disabled under Minnesota Rules, parts 9570.2000 to 9570.3400, in a 240-bed nursing home located in Duluth, provided that the total number of licensed and certified beds at the facility does not increase;\n(hh) to license and certify up to 120 new nursing facility beds to replace beds in a facility in Anoka County, which was licensed for 98 beds as of July 1, 2000, provided the new facility is located within four miles of the existing facility and is in Anoka County. Operating and property rates shall be determined and allowed under chapter 256R and Minnesota Rules, parts 9549.0010 to 9549.0080; or\n(ii) to transfer up to 98 beds of a 129-licensed bed facility located in Anoka County that, as of March 25, 2001, is in the active process of closing, to a 122-licensed bed nonprofit nursing facility located in the city of Columbia Heights or its affiliate. The transfer is effective when the receiving facility notifies the commissioner in writing of the number of beds accepted. The commissioner shall place all transferred beds on layaway status held in the name of the receiving facility. The layaway adjustment provisions of section 256B.431, subdivision 30, do not apply to this layaway. The receiving facility may only remove the beds from layaway for recertification and relicensure at the receiving facility's current site, or at a newly constructed facility located in Anoka County. The receiving facility must receive statutory authorization before removing these beds from layaway status, or may remove these beds from layaway status if removal from layaway status is part of a moratorium exception project approved by the commissioner under section 144A.073.\nA licensed and certified nursing facility may lay away, upon prior written notice to the commissioner of health, licensed and certified beds. A nursing facility may not discharge a resident in order to lay away a bed. Notice to the commissioner shall be given 60 days prior to the effective date of the layaway. Beds on layaway shall have the same status as voluntarily delicensed and decertified beds and shall not be subject to license fees and license surcharge fees. In addition, beds on layaway may be removed from layaway at any time on or after six months after the effective date of layaway in the facility of origin, with a 60-day notice to the commissioner. A nursing facility that removes beds from layaway may not place beds on layaway status for six months after the effective date of the removal from layaway. The commissioner may approve the immediate removal of beds from layaway if necessary to provide access to those nursing home beds to residents relocated from other nursing homes due to emergency situations or closure. In the event approval is granted, the six-month restriction on placing beds on layaway after a removal of beds from layaway shall not apply. Beds may remain on layaway for up to ten years. The commissioner may approve placing and removing beds on layaway at any time during renovation or construction related to a moratorium project approved under this section or section 144A.073. Nursing facilities are not required to comply with any licensure or certification requirements for beds on layaway status.\n(a) The commissioner of health, in coordination with the commissioner of human services, may approve the renovation, replacement, upgrading, or relocation of a nursing home or boarding care home, under the following conditions:\n(1) to license and certify an 80-bed city-owned facility in Nicollet County to be constructed on the site of a new city-owned hospital to replace an existing 85-bed facility attached to a hospital that is also being replaced. The threshold allowed for this project under section 144A.073 shall be the maximum amount available to pay the additional medical assistance costs of the new facility;\n(2) to license and certify 29 beds to be added to an existing 69-bed facility in St. Louis County, provided that the 29 beds must be transferred from active or layaway status at an existing facility in St. Louis County that had 235 beds on April 1, 2003.\nThe licensed capacity at the 235-bed facility must be reduced to 206 beds, but the payment rate at that facility shall not be adjusted as a result of this transfer. The operating payment rate of the facility adding beds after completion of this project shall be the same as it was on the day prior to the day the beds are licensed and certified. This project shall not proceed unless it is approved and financed under the provisions of section 144A.073;\n(3) to license and certify a new 60-bed facility in Austin, provided that: (i) 45 of the new beds are transferred from a 45-bed facility in Austin under common ownership that is closed and 15 of the new beds are transferred from a 182-bed facility in Albert Lea under common ownership; (ii) the commissioner of human services is authorized by the 2004 legislature to negotiate budget-neutral planned nursing facility closures; and (iii) money is available from planned closures of facilities under common ownership to make implementation of this clause budget-neutral to the state. The bed capacity of the Albert Lea facility shall be reduced to 167 beds following the transfer. Of the 60 beds at the new facility, 20 beds shall be used for a special care unit for persons with Alzheimer's disease or related dementias;\n(4) to license and certify up to 80 beds transferred from an existing state-owned nursing facility in Cass County to a new facility located on the grounds of the Ah-Gwah-Ching campus. The operating cost payment rates for the new facility shall be determined based on the interim and settle-up payment provisions of section 256R.27 and the reimbursement provisions of chapter 256R. The property payment rate for the first three years of operation shall be $35 per day. For subsequent years, the property payment rate of $35 per day shall be adjusted for inflation as provided in section 256B.434, subdivision 4, paragraph (c), as long as the facility has a contract under section 256B.434;\n(5) to initiate a pilot program to license and certify up to 80 beds transferred from an existing county-owned nursing facility in Steele County relocated to the site of a new acute care facility as part of the county's Communities for a Lifetime comprehensive plan to create innovative responses to the aging of its population. Upon relocation to the new site, the nursing facility shall delicense 28 beds. The payment rate for external fixed costs for the new facility shall be increased by an amount as calculated according to items (i) to (v):\n(i) compute the estimated decrease in medical assistance residents served by the nursing facility by multiplying the decrease in licensed beds by the historical percentage of medical assistance resident days;\n(ii) compute the annual savings to the medical assistance program from the delicensure of 28 beds by multiplying the anticipated decrease in medical assistance residents, determined in item (i), by the existing facility's weighted average payment rate multiplied by 365;\n(iii) compute the anticipated annual costs for community-based services by multiplying the anticipated decrease in medical assistance residents served by the nursing facility, determined in item (i), by the average monthly elderly waiver service costs for individuals in Steele County multiplied by 12;\n(iv) subtract the amount in item (iii) from the amount in item (ii);\n(v) divide the amount in item (iv) by an amount equal to the relocated nursing facility's occupancy factor under section 256B.431, subdivision 3f, paragraph (c), multiplied by the historical percentage of medical assistance resident days; and\n(6) to consolidate and relocate nursing facility beds to a new site in Goodhue County and to integrate these services with other community-based programs and services under a communities for a lifetime pilot program and comprehensive plan to create innovative responses to the aging of its population. Two nursing facilities, one for 84 beds and one for 65 beds, in the city of Red Wing licensed on July 1, 2015, shall be consolidated into a newly renovated 64-bed nursing facility resulting in the delicensure of 85 beds. Notwithstanding the carryforward of the approval authority in section 144A.073, subdivision 11, the funding approved in April 2009 by the commissioner of health for a project in Goodhue County shall not carry forward. The closure of the 85 beds shall not be eligible for a planned closure rate adjustment under section 256R.40. The construction project permitted in this clause shall not be eligible for a threshold project rate adjustment under section 256B.434, subdivision 4f. The payment rate for external fixed costs for the new facility shall be increased by an amount as calculated according to items (i) to (vi):\n(i) compute the estimated decrease in medical assistance residents served by both nursing facilities by multiplying the difference between the occupied beds of the two nursing facilities for the reporting year ending September 30, 2009, and the projected occupancy of the facility at 95 percent occupancy by the historical percentage of medical assistance resident days;\n(ii) compute the annual savings to the medical assistance program from the delicensure by multiplying the anticipated decrease in the medical assistance residents, determined in item (i), by the hospital-owned nursing facility weighted average payment rate multiplied by 365;\n(iii) compute the anticipated annual costs for community-based services by multiplying the anticipated decrease in medical assistance residents served by the facilities, determined in item (i), by the average monthly elderly waiver service costs for individuals in Goodhue County multiplied by 12;\n(iv) subtract the amount in item (iii) from the amount in item (ii);\n(v) multiply the amount in item (iv) by 57.2 percent; and\n(vi) divide the difference of the amount in item (iv) and the amount in item (v) by an amount equal to the relocated nursing facility's occupancy factor under section 256B.431, subdivision 3f, paragraph (c), multiplied by the historical percentage of medical assistance resident days.\n(b) Projects approved under this subdivision shall be treated in a manner equivalent to projects approved under subdivision 4a.\n(a) The commissioner of health, in consultation with the commissioner of human services, may approve a request for consolidation of nursing facilities which includes the closure of one or more facilities and the upgrading of the physical plant of the remaining nursing facility or facilities, the costs of which exceed the threshold project limit under subdivision 2, clause (a). The commissioners shall consider the criteria in this section, section 144A.073, and section 256R.40, in approving or rejecting a consolidation proposal. In the event the commissioners approve the request, the commissioner of human services shall calculate an external fixed costs rate adjustment according to clauses (1) to (3):\n(1) the closure of beds shall not be eligible for a planned closure rate adjustment under section 256R.40, subdivision 5;\n(2) the construction project permitted in this clause shall not be eligible for a threshold project rate adjustment under section 256B.434, subdivision 4f, or a moratorium exception adjustment under section 144A.073; and\n(3) the payment rate for external fixed costs for a remaining facility or facilities shall be increased by an amount equal to 65 percent of the projected net cost savings to the state calculated in paragraph (b), divided by the state's medical assistance percentage of medical assistance dollars, and then divided by estimated medical assistance resident days, as determined in paragraph (c), of the remaining nursing facility or facilities in the request in this paragraph. The rate adjustment is effective on the first day of the month of January or July, whichever date occurs first following both the completion of the construction upgrades in the consolidation plan and the complete closure of the facility or facilities designated for closure in the consolidation plan. If more than one facility is receiving upgrades in the consolidation plan, each facility's date of construction completion must be evaluated separately.\n(b) For purposes of calculating the net cost savings to the state, the commissioner shall consider clauses (1) to (7):\n(1) the annual savings from estimated medical assistance payments from the net number of beds closed taking into consideration only beds that are in active service on the date of the request and that have been in active service for at least three years;\n(2) the estimated annual cost of increased case load of individuals receiving services under the elderly waiver;\n(3) the estimated annual cost of elderly waiver recipients receiving support under housing support under chapter 256I;\n(4) the estimated annual cost of increased case load of individuals receiving services under the alternative care program;\n(5) the annual loss of license surcharge payments on closed beds;\n(6) the savings from not paying planned closure rate adjustments that the facilities would otherwise be eligible for under section 256R.40; and\n(7) the savings from not paying external fixed costs payment rate adjustments from submission of renovation costs that would otherwise be eligible as threshold projects under section 256B.434, subdivision 4f.\n(c) For purposes of the calculation in paragraph (a), clause (3), the estimated medical assistance resident days of the remaining facility or facilities shall be computed assuming 95 percent occupancy multiplied by the historical percentage of medical assistance resident days of the remaining facility or facilities, as reported on the facility's or facilities' most recent nursing facility statistical and cost report filed before the plan of closure is submitted, multiplied by 365.\n(d) For purposes of net cost of savings to the state in paragraph (b), the average occupancy percentages will be those reported on the facility's or facilities' most recent nursing facility statistical and cost report filed before the plan of closure is submitted, and the average payment rates shall be calculated based on the approved payment rates in effect at the time the consolidation request is submitted.\n(e) To qualify for the external fixed costs payment rate adjustment under this subdivision, the closing facilities shall:\n(1) submit an application for closure according to section 256R.40, subdivision 2; and\n(2) follow the resident relocation provisions of section 144A.161.\n(f) The county or counties in which a facility or facilities are closed under this subdivision shall not be eligible for designation as a hardship area under subdivision 3 for five years from the date of the approval of the proposed consolidation. The applicant shall notify the county of this limitation and the county shall acknowledge this in a letter of support.\n(g) Projects approved on or after March 1, 2020, are not subject to paragraph (a), clauses (2) and (3), and paragraph (c). The 65 percent projected net cost savings to the state calculated in paragraph (b) must be applied to the moratorium cost of the project and the remainder must be added to the moratorium funding under section 144A.073, subdivision 11.\n(h) Consolidation project applications not approved by the commissioner prior to March 1, 2020, are subject to the moratorium process under section 144A.073, subdivision 2. Upon request by the applicant, the commissioner may extend this deadline to August 1, 2020, so long as the facilities, bed numbers, and counties specified in the original application are not altered. Proposals from facilities seeking approval for a consolidation project prior to March 1, 2020, must be received by the commissioner no later than January 1, 2020. This paragraph expires August 1, 2020.\n[Repealed, 1Sp2003 c 14 art 2 s 57]\nFor the purposes of this section and section 144A.073, the cost estimate of a moratorium exception project shall include the effects of the proposed project on the costs of the state subsidy for community-based services, nursing services, and housing in institutional and noninstitutional settings. The commissioner of health, in cooperation with the commissioner of human services, shall define the method for estimating these costs in the permanent rule implementing section 144A.073. The commissioner of human services shall prepare an estimate of the property payment rate to be established upon completion of the project and the total state annual long-term costs of each moratorium exception proposal. The property payment rate estimate shall be based upon the estimated costs and total building valuation to be used in the total property payment rate calculation under section 256R.26. For the purposes of determining the actual total property payment rate under section 256R.26 upon completion of the project, the final building valuation is the lesser of the limited depreciated replacement cost as determined under section 256R.26, subdivision 3, following a physical building appraisal or 105 percent of the estimated total building valuation from the moratorium application.\nThe property-related payment rates of nursing home or boarding care home beds certified or recertified under subdivision 3 or 4a, shall be adjusted according to Minnesota nursing facility reimbursement laws and rules unless the facility has made a commitment in writing to the commissioner of human services not to seek adjustments to these rates due to property-related expenses incurred as a result of the certification or recertification. Any licensure or certification action authorized under repealed statutes which were approved by the commissioner of health prior to July 1, 1993, shall remain in effect. Any conditions pertaining to property rate reimbursement covered by these repealed statutes prior to July 1, 1993, remain in effect.\nBefore approval of final construction plans for a nursing home or a certified boarding care home construction project, the licensee shall submit to the commissioner of health an itemized statement of the project construction cost estimates.\nIf the construction project includes a capital asset addition, replacement, remodeling, or renovation of space such as a hospital, apartment, or shared or common areas, the facility must submit to the commissioner an allocation of capital asset costs, soft costs, and debt information prepared according to Minnesota Rules, chapter 9549.\nProject construction cost estimates must be prepared by a contractor or architect and other licensed participants in the development of the project.\nBefore conducting the final inspection of the construction project required by Minnesota Rules, part 4660.0100, and issuing final clearances for use, the licensee shall provide to the commissioner of health the total project construction costs of the construction project. If total costs are not available, the most recent cost figures shall be provided. Final cost figures shall be submitted to the commissioner when available. The commissioner shall provide a copy of this information to the commissioner of human services.",
	"repealed": false
}