{
	"id": "243.166",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.166",
	"title": "243.166 REGISTRATION OF PREDATORY OFFENDERS.",
	"text": "[Repealed, 2005 c 136 art 3 s 31]\n(a) As used in this section, unless the context clearly indicates otherwise, the following terms have the meanings given them.\n(b) \"Bureau\" means the Bureau of Criminal Apprehension.\n(c) \"Conservator\" has the meaning given in chapter 524.\n(d) \"Corrections agent\" means a county or state probation agent or other corrections employee. The term also includes United States Probation and Pretrial Services System employees who work with a person subject to this section.\n(e) \"Dwelling\" means the building where the person lives under a formal or informal agreement to do so. However, dwelling does not include a supervised publicly or privately operated shelter or facility designed to provide temporary living accommodations for homeless individuals as defined in section 116L.361, subdivision 5.\n(f) \"Guardian\" has the meaning given in chapter 524.\n(g) \"Incarceration\" and \"confinement\" do not include electronic home monitoring.\n(h) \"Law enforcement authority\" or \"authority\" means the chief of police of a home rule charter or statutory city and the county sheriff of an unincorporated area in that county. An authority must be located in Minnesota.\n(i) \"Motor vehicle\" has the meaning given in section 169.011, subdivision 92.\n(j) \"Power of attorney\" has the meaning given in chapter 523.\n(k) \"Primary address\" means the mailing address of the person's dwelling. If the mailing address is different from the actual location of the dwelling, primary address also includes the physical location of the dwelling described with as much specificity as possible.\n(l) \"School\" includes any public or private educational institution, including any secondary school, trade, or professional institution, or institution of higher education, that the person is enrolled in on a full-time or part-time basis.\n(m) \"Secondary address\" means the mailing address of any place where the person regularly or occasionally stays overnight when not staying at the person's primary address. If the mailing address is different from the actual location of the place, secondary address also includes the physical location of the place described with as much specificity as possible. However, the location of a supervised publicly or privately operated shelter or facility designated to provide temporary living accommodations for homeless individuals as defined in section 116L.361, subdivision 5, does not constitute a secondary address.\n(n) \"Treatment facility\" means a residential facility, as defined in section 244.052, subdivision 1, and residential substance use disorder treatment programs and halfway houses licensed under chapter 245A, including, but not limited to, those facilities directly or indirectly assisted by any department or agency of the United States.\n(o) \"Work\" includes employment that is full time or part time for a period of time exceeding 14 days or for an aggregate period of time exceeding 30 days during any calendar year, whether financially compensated, volunteered, or for the purpose of government or educational benefit.\n(a) A person shall register under this section if:\n(1) the person was charged with or petitioned for a felony violation of or attempt to violate, or aiding, abetting, or conspiracy to commit, any of the following, and convicted of or adjudicated delinquent for that offense or another offense arising out of the same set of circumstances:\n(i) murder under section 609.185, paragraph (a), clause (2);\n(ii) kidnapping under section 609.25;\n(iii) criminal sexual conduct under section 609.342; 609.343; 609.344; 609.345; 609.3451, subdivision 3, paragraph (b); or 609.3453;\n(iv) indecent exposure under section 617.23, subdivision 3; or\n(v) surreptitious intrusion under the circumstances described in section 609.746, subdivision 1, paragraph (h);\n(2) the person was charged with or petitioned for a violation of, or attempt to violate, or aiding, abetting, or conspiring to commit any of the following and convicted of or adjudicated delinquent for that offense or another offense arising out of the same set of circumstances:\n(i) criminal abuse in violation of Minnesota Statutes 2020, section 609.2325, subdivision 1, paragraph (b);\n(ii) solicitation, inducement, or promotion of the prostitution of a minor or engaging in the sex trafficking of a minor in violation of section 609.322;\n(iii) a prostitution offense in violation of section 609.324, subdivision 1, paragraph (a);\n(iv) soliciting a minor to engage in sexual conduct in violation of section 609.352, subdivision 2 or 2a, clause (1);\n(v) using a minor in a sexual performance in violation of section 617.246; or\n(vi) possessing or disseminating a pornographic work involving a minor in violation of section 617.247;\n(3) the person was sentenced as a patterned sex offender under section 609.3455, subdivision 3a; or\n(4) the person was charged with or petitioned for, including pursuant to a court martial, violating a law of the United States, including the Uniform Code of Military Justice, similar to an offense or involving similar circumstances to an offense described in clause (1), (2), or (3), and convicted of or adjudicated delinquent for that offense or another offense arising out of the same set of circumstances.\n(b) A person also shall register under this section if:\n(1) the person was charged with or petitioned for an offense in another state similar to an offense or involving similar circumstances to an offense described in paragraph (a), clause (1), (2), or (3), and convicted of or adjudicated delinquent for that offense or another offense arising out of the same set of circumstances;\n(2) the person enters this state to reside, work, or attend school, or enters this state and remains for 14 days or longer or for an aggregate period of time exceeding 30 days during any calendar year; and\n(3) ten years have not elapsed since the person was released from confinement or, if the person was not confined, since the person was convicted of or adjudicated delinquent for the offense that triggers registration, unless the person is subject to a longer registration period under the laws of another state in which the person has been convicted or adjudicated, or is subject to lifetime registration.\nIf a person described in this paragraph is subject to a longer registration period in another state or is subject to lifetime registration, the person shall register for that time period regardless of when the person was released from confinement, convicted, or adjudicated delinquent.\n(c) A person also shall register under this section if the person was committed pursuant to a court commitment order under Minnesota Statutes 2012, section 253B.185, chapter 253D, Minnesota Statutes 1992, section 526.10, or a similar law of another state or the United States, regardless of whether the person was convicted of any offense.\n(d) A person also shall register under this section if:\n(1) the person was charged with or petitioned for a felony violation or attempt to violate any of the offenses listed in paragraph (a), clause (1), or a similar law of another state or the United States, or the person was charged with or petitioned for a violation of any of the offenses listed in paragraph (a), clause (2), or a similar law of another state or the United States;\n(2) the person was found not guilty by reason of mental illness or mental deficiency after a trial for that offense, or found guilty but mentally ill after a trial for that offense, in states with a guilty but mentally ill verdict; and\n(3) the person was committed pursuant to a court commitment order under section 253B.18 or a similar law of another state or the United States.\nWhen a person who is required to register under subdivision 1b, paragraph (a), is sentenced or becomes subject to a juvenile court disposition order, the court shall tell the person of the duty to register under this section and that, if the person fails to comply with the registration requirements, information about the offender may be made available to the public through electronic, computerized, or other accessible means. The court may not modify the person's duty to register in the pronounced sentence or disposition order. The court shall require the person to read and sign a form stating that the duty of the person to register under this section has been explained. The court shall make available the signed court notification form, the complaint, and sentencing documents to the bureau. If a person required to register under subdivision 1b, paragraph (a), was not notified by the court of the registration requirement at the time of sentencing or disposition, the assigned corrections agent shall notify the person of the requirements of this section. If a person required to register under subdivision 1b, paragraph (a), was not notified by the court of the registration requirement at the time of sentencing or disposition and does not have a corrections agent, the law enforcement authority with jurisdiction over the person's primary address shall notify the person of the requirements. When a person who is required to register under subdivision 1b, paragraph (c) or (d), is released from commitment, the treatment facility shall notify the person of the requirements of this section. The treatment facility shall also obtain the registration information required under this section and forward it to the bureau.\n(a) Except as provided in subdivision 3a, a person required to register under this section shall register with the corrections agent as soon as the agent is assigned to the person. If the person does not have an assigned corrections agent or is unable to locate the assigned corrections agent, the person shall register with the law enforcement authority that has jurisdiction in the area of the person's primary address.\n(b) Except as provided in subdivision 3a, at least five days before the person starts living at a new primary address, including living in another state, the person shall give written notice of the new primary address to the assigned corrections agent or to the law enforcement authority with which the person currently is registered. If the person will be living in a new state and that state has a registration requirement, the person shall also give written notice of the new address to the designated registration agency in the new state. A person required to register under this section shall also give written notice to the assigned corrections agent or to the law enforcement authority that has jurisdiction in the area of the person's primary address that the person is no longer living or staying at an address, immediately after the person is no longer living or staying at that address. The written notice required by this paragraph must be provided in person. The corrections agent or law enforcement authority shall, within two business days after receipt of this information, forward it to the bureau. The bureau shall, if it has not already been done, notify the law enforcement authority having primary jurisdiction in the community where the person will live of the new address. If the person is leaving the state, the bureau shall notify the registration authority in the new state of the new address. The person's registration requirements under this section are suspended after the person begins living in the new state and the bureau has confirmed the address in the other state through the annual verification process on at least one occasion. The bureau may also attempt to confirm the person's address in the other state by the following methods:\n(1) receipt of a verification letter from the law enforcement authority having primary jurisdiction in the community where the person is now living, acknowledging the person's address;\n(2) receipt of a written communication or verification letter from a criminal justice agency confirming the person's location;\n(3) confirmation of the individual's compliance with registration requirements or incarceration status in the new state via an online registry or website, if applicable; or\n(4) confirmation of the individual's motor vehicle records under United States Code, title 18, section 2721, in the new state via the new state's documentation.\nThe bureau is the sole determinant as to whether the information provided by any of the methods in clauses (1) to (3) is sufficient for verification purposes and may use more than one of these methods to satisfy the verification requirement. For purposes of this subdivision, \"criminal justice agency\" means an agency of a state, a political subdivision, a federally recognized Tribe, a United States territory, or the federal government charged with detection, enforcement, prosecution, adjudication, or incarceration with respect to federal or state criminal laws. The person's registration requirements under this section are reactivated if the person resumes living in Minnesota and the registration time period described in subdivision 6 has not expired.\n(c) A person required to register under subdivision 1b, paragraph (b), because the person is working or attending school in Minnesota shall register with the law enforcement authority that has jurisdiction in the area where the person works or attends school. In addition to other information required by this section, the person shall provide the address of the school or of the location where the person is employed. A person shall comply with this paragraph within five days of beginning employment or school. A person's obligation to register under this paragraph terminates when the person is no longer working or attending school in Minnesota.\n(d) A person required to register under this section who works or attends school outside of Minnesota shall register as a predatory offender in the state where the person works or attends school. The person's corrections agent, or if the person does not have an assigned corrections agent, the law enforcement authority that has jurisdiction in the area of the person's primary address shall notify the person of this requirement.\n(a) If a person leaves a primary address and does not have a new primary address, the person shall register with the law enforcement authority that has jurisdiction in the area where the person is staying within 24 hours of the time the person no longer has a primary address.\n(b) Notwithstanding the time period for registration in paragraphs (a) and (c), a person with a primary address of a correctional facility who is scheduled to be released from the facility and who does not have a new primary address shall register with the law enforcement authority that has jurisdiction in the area where the person will be staying at least three days before the person is released from the correctional facility.\n(c) A person who lacks a primary address shall register with the law enforcement authority that has jurisdiction in the area where the person is staying within 24 hours after entering the jurisdiction. Each time a person who lacks a primary address moves to a new jurisdiction without acquiring a new primary address, the person shall register with the law enforcement authority that has jurisdiction in the area where the person is staying within 24 hours after entering the jurisdiction.\n(d) Upon registering under this subdivision, the person shall provide the law enforcement authority with all of the information the individual is required to provide under subdivision 4a. However, instead of reporting the person's primary address, the person shall describe the location of where the person is staying with as much specificity as possible.\n(e) Except as otherwise provided in paragraph (f), if a person continues to lack a primary address, the person shall report in person on a weekly basis to the law enforcement authority with jurisdiction in the area where the person is staying. This weekly report shall occur between the hours of 9:00 a.m. and 5:00 p.m. The person is not required to provide the registration information required under subdivision 4a each time the offender reports to an authority, but the person shall inform the authority of changes to any information provided under this subdivision or subdivision 4a and shall otherwise comply with this subdivision.\n(f) If the law enforcement authority determines that it is impractical, due to the person's unique circumstances, to require a person lacking a primary address to report weekly and in person as required under paragraph (e), the authority may authorize the person to follow an alternative reporting procedure. The authority shall consult with the person's corrections agent, if the person has one, in establishing the specific criteria of this alternative procedure, subject to the following requirements:\n(1) the authority shall document, in the person's registration record, the specific reasons why the weekly in-person reporting process is impractical for the person to follow;\n(2) the authority shall explain how the alternative reporting procedure furthers the public safety objectives of this section;\n(3) the authority shall require the person lacking a primary address to report in person at least monthly to the authority or the person's corrections agent and shall specify the location where the person shall report. If the authority determines it would be more practical and would further public safety for the person to report to another law enforcement authority with jurisdiction where the person is staying, it may, after consulting with the other law enforcement authority, include this requirement in the person's alternative reporting process;\n(4) the authority shall require the person to comply with the weekly, in-person reporting process required under paragraph (e), if the person moves to a new area where this process would be practical;\n(5) the authority shall require the person to report any changes to the registration information provided under subdivision 4a and to comply with the periodic registration requirements specified under paragraph (g); and\n(6) the authority shall require the person to comply with the requirements of subdivision 3, paragraphs (b) and (c), if the person moves to a primary address.\n(g) If a person continues to lack a primary address and continues to report to the same law enforcement authority, the person shall provide the authority with all of the information the individual is required to provide under this subdivision and subdivision 4a at least annually, unless the person is required to register under subdivision 1b, paragraph (c), following commitment pursuant to a court commitment under Minnesota Statutes 2012, section 253B.185, chapter 253D, Minnesota Statutes 1992, section 526.10, or a similar law of another state or the United States. If the person is required to register under subdivision 1b, paragraph (c), the person shall provide the law enforcement authority with all of the information the individual is required to report under this subdivision and subdivision 4a at least once every three months.\n(h) A law enforcement authority receiving information under this subdivision shall forward registration information and changes to that information to the bureau within two business days of receipt of the information.\n(i) For purposes of this subdivision, a person who fails to report a primary address will be deemed to be a person who lacks a primary address, and the person shall comply with the requirements for a person who lacks a primary address.\n(a) The registration provided to the corrections agent or law enforcement authority, must consist of a statement in writing signed by the person, giving information required by the bureau, fingerprints, biological specimen for DNA analysis as defined under section 299C.155, subdivision 1, and photograph of the person taken at the time of the person's release from incarceration or, if the person was not incarcerated, at the time the person initially registered under this section. The registration information also must include a written consent form signed by the person allowing a treatment facility or residential housing unit or shelter to release information to a law enforcement officer about the person's admission to, or residence in, a treatment facility or residential housing unit or shelter. Registration information on adults and juveniles may be maintained together notwithstanding section 260B.171, subdivision 3.\n(b) For persons required to register under subdivision 1b, paragraph (c), following commitment pursuant to a court commitment under Minnesota Statutes 2012, section 253B.185, chapter 253D, Minnesota Statutes 1992, section 526.10, or a similar law of another state or the United States, in addition to other information required by this section, the registration provided to the corrections agent or law enforcement authority must include the person's offense history and documentation of treatment received during the person's commitment. This documentation is limited to a statement of how far the person progressed in treatment during commitment.\n(c) Within three days of receipt, the corrections agent or law enforcement authority shall forward the registration information to the bureau. The bureau shall ascertain whether the person has registered with the law enforcement authority in the area of the person's primary address, if any, or if the person lacks a primary address, where the person is staying, as required by subdivision 3a. If the person has not registered with the law enforcement authority, the bureau shall notify that authority.\n(d) The corrections agent or law enforcement authority may require that a person required to register under this section appear before the agent or authority to be photographed. The agent or authority shall submit the photograph to the bureau.\n(1) Except as provided in clause (2), the agent or authority may photograph any offender at a time and frequency chosen by the agent or authority.\n(2) The requirements of this paragraph shall not apply during any period where the person to be photographed is: (i) committed to the commissioner of corrections and incarcerated, (ii) incarcerated in a regional jail or county jail, or (iii) committed to the Direct Care and Treatment executive board and receiving treatment in a secure treatment facility.\n(e) During the period a person is required to register under this section, the following provisions apply:\n(1) Except for persons registering under subdivision 3a, the bureau shall mail a verification form to the person's last reported primary address. This verification form must provide notice to the offender that, if the offender does not return the verification form as required, information about the offender may be made available to the public through electronic, computerized, or other accessible means. For persons who are registered under subdivision 3a, the bureau shall mail an annual verification form to the law enforcement authority where the offender most recently reported. The authority shall provide the verification form to the person at the next weekly meeting and ensure that the person completes and signs the form and returns it to the bureau. Notice is sufficient under this paragraph if the verification form is sent by first class mail to the person's last reported primary address, or for persons registered under subdivision 3a, to the law enforcement authority where the offender most recently reported.\n(2) The person shall mail the signed verification form back to the bureau within ten days after receipt of the form, stating on the form the current and last address of the person's residence and the other information required under subdivision 4a.\n(3) In addition to the requirements listed in this section, an offender who is no longer under correctional supervision for a registration offense, or a failure to register offense, but who resides, works, or attends school in Minnesota, shall have an in-person contact with a law enforcement authority as provided in this section. If the person resides in Minnesota, the in-person contact shall be with the law enforcement authority that has jurisdiction over the person's primary address or, if the person has no address, the location where the person is staying. If the person does not reside in Minnesota but works or attends school in this state, the person shall have an in-person contact with the law enforcement authority or authorities with jurisdiction over the person's school or workplace. During the month of the person's birth date, the person shall report to the authority to verify the accuracy of the registration information and to be photographed. Within three days of this contact, the authority shall enter information as required by the bureau into the predatory offender registration database and submit an updated photograph of the person to the bureau's predatory offender registration unit.\n(4) If the person fails to mail the completed and signed verification form to the bureau within ten days after receipt of the form, or if the person fails to report to the law enforcement authority during the month of the person's birth date, the person is in violation of this section.\n(5) For any person who fails to mail the completed and signed verification form to the bureau within ten days after receipt of the form and who has been determined to be subject to community notification pursuant to section 253D.32 or is a risk level III offender under section 244.052, the bureau shall immediately investigate and notify local law enforcement authorities to investigate the person's location and to ensure compliance with this section. The bureau also shall immediately give notice of the person's violation of this section to the law enforcement authority having jurisdiction over the person's last registered primary address.\nFor persons required to register under subdivision 1b, paragraph (c), following commitment pursuant to a court commitment under Minnesota Statutes 2012, section 253B.185, chapter 253D, Minnesota Statutes 1992, section 526.10, or a similar law of another state or the United States, the bureau shall comply with clause (1) at least two times each year. For persons who, under section 244.052, are assigned to risk level III and who are no longer under correctional supervision for a registration offense or a failure to register offense, the bureau shall comply with clause (1) at least two times each year. For all other persons required to register under this section, the bureau shall comply with clause (1) each year within 30 days of the anniversary date of the person's initial registration.\n(f) For persons registered under this section on July 1, 2019, each person, on or before one year from that date, must provide a biological specimen for the purpose of DNA analysis to the probation agency or law enforcement authority where that person is registered. A person who provides or has provided a biological specimen for the purpose of DNA analysis under chapter 299C or section 609.117 meets the requirements of this paragraph.\n(g) For persons registered under this section on July 1, 2019, each person, on or before one year from that date, must provide fingerprints to the probation agency or law enforcement authority where that person is registered.\n(a) A person required to register under this section shall provide to the corrections agent or law enforcement authority the following information:\n(1) the person's primary address;\n(2) all of the person's secondary addresses in Minnesota, including all addresses used for residential or recreational purposes;\n(3) the addresses of all Minnesota property owned, leased, or rented by the person;\n(4) the addresses of all locations where the person is employed;\n(5) the addresses of all schools where the person is enrolled;\n(6) the year, model, make, license plate number, and color of all motor vehicles owned or regularly driven by the person;\n(7) the expiration year for the motor vehicle license plate tabs of all motor vehicles owned by the person; and\n(8) all telephone numbers including work, school, and home and any cellular telephone service.\n(b) The person shall report to the agent or authority the information required to be provided under paragraph (a), clauses (2) to (8), within five days of the date the clause becomes applicable. If because of a change in circumstances any information reported under paragraph (a), clauses (1) to (8), no longer applies, the person shall immediately inform the agent or authority that the information is no longer valid. If the person leaves a primary address and does not have a new primary address, the person shall register as provided in subdivision 3a.\n(a) For the purposes of this subdivision:\n(1) \"health care facility\" means a facility:\n(i) licensed by the commissioner of health as a hospital, boarding care home or supervised living facility under sections 144.50 to 144.58, or a nursing home under chapter 144A;\n(ii) licensed by the commissioner of health as an assisted living facility as defined in section 144G.01; or\n(iii) licensed by the commissioner of human services as a residential facility under chapter 245A to provide adult foster care, adult mental health treatment, substance use disorder treatment to adults, or residential services to persons with disabilities;\n(2) \"home care provider\" has the meaning given in section 144A.43; and\n(3) \"hospice provider\" has the meaning given in section 144A.75.\n(b) Prior to admission to a health care facility or home care services from a home care provider or hospice services from a hospice provider, a person required to register under this section shall disclose to:\n(1) the health care facility employee or the home care provider or hospice provider processing the admission the person's status as a registered predatory offender under this section; and\n(2) the person's corrections agent, or if the person does not have an assigned corrections agent, the law enforcement authority with whom the person is currently required to register, that admission will occur.\n(c) A law enforcement authority or corrections agent who receives notice under paragraph (b) or who knows that a person required to register under this section is planning to be admitted and receive, or has been admitted and is receiving health care at a health care facility or home care services from a home care provider or hospice services from a hospice provider, shall notify the administrator of the facility or the home care provider or the hospice provider and deliver a fact sheet to the administrator or provider containing the following information: (1) name and physical description of the offender; (2) the offender's conviction history, including the dates of conviction; (3) the risk level classification assigned to the offender under section 244.052, if any; and (4) the profile of likely victims.\n(d) Except for a hospital licensed under sections 144.50 to 144.58, if a health care facility receives a fact sheet under paragraph (c) that includes a risk level classification for the offender, and if the facility admits the offender, the facility shall distribute the fact sheet to all residents at the facility. If the facility determines that distribution to a resident is not appropriate given the resident's medical, emotional, or mental status, the facility shall distribute the fact sheet to the patient's next of kin or emergency contact.\n(e) If a home care provider or hospice provider receives a fact sheet under paragraph (c) that includes a risk level classification for the offender, the provider shall distribute the fact sheet to any individual who will provide direct services to the offender before the individual begins to provide the service.\nAll notices required by this section must be in writing and signed by the person required to register. For purposes of this section, a signature is as defined in section 645.44, subdivision 14, by an electronic method established by the bureau, or by use of a biometric for the person. If a biometric is used, the person must provide a sample that is forwarded to the bureau so that it can be maintained for comparison purposes to verify the person's identity. The bureau shall determine the signature methods available for use and post this determination on the bureau's website.\nGuardians and conservators of persons required to register shall have the authority to complete all verification and registration paperwork under this section and section 243.167 on the person's behalf. A validly executed power of attorney under chapter 523 grants the attorney in fact the authority to complete all verification and registration paperwork under this section and section 243.167 on behalf of a person required to register.\n(a) A person required to register under this section who was given notice, knows, or reasonably should know of the duty to register and who:\n(1) knowingly commits an act or fails to fulfill a requirement that violates any provision of this section; or\n(2) intentionally provides false information to a corrections agent, law enforcement authority, or the bureau is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) Except as provided in paragraph (c), a person convicted of violating paragraph (a) shall be committed to the custody of the commissioner of corrections for not less than a year and a day, nor more than five years.\n(c) A person convicted of violating paragraph (a), who has previously been convicted of or adjudicated delinquent for violating this section or a similar statute of another state or the United States, shall be committed to the custody of the commissioner of corrections for not less than two years, nor more than five years.\n(d) Prior to the time of sentencing, the prosecutor may file a motion to have the person sentenced without regard to the mandatory minimum sentence established by this subdivision. The motion must be accompanied by a statement on the record of the reasons for it. When presented with the motion, or on its own motion, the court may sentence the person without regard to the mandatory minimum sentence if the court finds substantial and compelling reasons to do so. Sentencing a person in the manner described in this paragraph is a departure from the Sentencing Guidelines.\n(e) A person convicted and sentenced as required by this subdivision is not eligible for probation, parole, discharge, work release, conditional release, or supervised release, until that person has served the full term of imprisonment as provided by law, notwithstanding the provisions of sections 241.26, 242.19, 243.05, 244.04, 609.12, and 609.135.\nNotwithstanding the statutory maximum sentence otherwise applicable to the offense or any provision of the sentencing guidelines, when a court commits a person to the custody of the commissioner of corrections for violating subdivision 5 and, at the time of the violation, the person was assigned to risk level III under section 244.052, the court shall provide that after the person has been released from prison, the commissioner shall place the person on conditional release for ten years. The terms of conditional release are governed by section 609.3455, subdivision 8.\n(a) Notwithstanding the provisions of section 609.165, subdivision 1, and except as provided in paragraphs (b), (c), and (d), a person required to register under this section shall continue to comply with this section until ten years have elapsed since the person initially registered in connection with the offense, or until the probation, supervised release, or conditional release period expires, whichever occurs later. For a person required to register under this section who is committed under section 253B.18, Minnesota Statutes 2012, section 253B.185, or chapter 253D, the ten-year registration period does not include the period of commitment.\n(b) If a person required to register under this section fails to provide the person's primary address as required by subdivision 3, paragraph (b), fails to comply with the requirements of subdivision 3a, fails to provide information as required by subdivision 4a, or fails to return the verification form referenced in subdivision 4 within ten days, the commissioner of public safety shall require the person to continue to register for an additional period of five years. This five-year period is added to the end of the offender's registration period.\n(c) If a person required to register under this section is incarcerated due to a conviction for a new offense that requires registration under this section or section 243.167 or following a revocation of probation, supervised release, or conditional release for an offense that requires registration under this section or section 243.167, the person shall continue to register until ten years have elapsed since the person was last released from incarceration or until the person's probation, supervised release, or conditional release period expires, whichever occurs later.\n(d) A person shall continue to comply with this section for the life of that person:\n(1) if the person is convicted of or adjudicated delinquent for any offense for which registration is required under subdivision 1b, or any offense from another state or any federal offense similar to the offenses described in subdivision 1b, and the person has a prior conviction or adjudication for an offense for which registration was or would have been required under subdivision 1b, or an offense from another state or a federal offense similar to an offense described in subdivision 1b;\n(2) if the person is required to register based upon a conviction or delinquency adjudication for an offense under section 609.185, paragraph (a), clause (2), or a similar statute from another state or the United States;\n(3) if the person is required to register based upon a conviction for an offense under section 609.342, subdivision 1, clause (a) to (c) or (e), or subdivision 1a, clause (a) to (e) or (h); 609.343, subdivision 1, clause (a) to (c) or (e), or subdivision 1a, clause (a) to (e) or (h); 609.344, subdivision 1, clause (a) or (c), or subdivision 1a, clause (a), (c), (g), or (h); or 609.345, subdivision 1, clause (a) or (c), or subdivision 1a, clause (a), (c), (g), or (h); or a statute from another state or the United States similar to the offenses described in this clause; or\n(4) if the person is required to register under subdivision 1b, paragraph (c), following commitment pursuant to a court commitment under Minnesota Statutes 2012, section 253B.185, chapter 253D, Minnesota Statutes 1992, section 526.10, or a similar law of another state or the United States.\n(e) A person described in subdivision 1b, paragraph (b), who is required to register under the laws of a state in which the person has been previously convicted or adjudicated delinquent, shall register under this section for the time period required by the state of conviction or adjudication unless a longer time period is required elsewhere in this section.\n(a) Except as otherwise provided in subdivision 4b or 7a or sections 244.052 and 299C.093, the data provided under this section is private data on individuals under section 13.02, subdivision 12.\n(b) The data may be used only by law enforcement and corrections agencies for law enforcement and corrections purposes. Law enforcement or a corrections agent may disclose the status of an individual as a predatory offender to a child protection worker with a local welfare agency for purposes of doing an investigation or family assessment under chapter 260E. A corrections agent may also disclose the status of an individual as a predatory offender to comply with section 244.057.\n(c) The commissioner of human services is authorized to have access to the data for purposes of completing background studies under chapter 245C.\n(d) The Direct Care and Treatment executive board is authorized to have access to data for any service, program, or facility owned or operated by the state of Minnesota and under the programmatic direction and fiscal control of the executive board for purposes described in section 246.13, subdivision 2, paragraph (b).\n(a) The bureau may make information available to the public about offenders who are 16 years of age or older and who are out of compliance with this section for 30 days or longer for failure to provide the offenders' primary or secondary addresses. This information may be made available to the public through electronic, computerized, or other accessible means. The amount and type of information made available is limited to the information necessary for the public to assist law enforcement in locating the offender.\n(b) An offender who comes into compliance with this section after the bureau discloses information about the offender to the public may send a written request to the bureau requesting the bureau to treat information about the offender as private data, consistent with subdivision 7. The bureau shall review the request and promptly take reasonable action to treat the data as private, if the offender has complied with the requirement that the offender provide the offender's primary and secondary addresses, or promptly notify the offender that the information will continue to be treated as public information and the reasons for the bureau's decision.\n(c) If an offender believes the information made public about the offender is inaccurate or incomplete, the offender may challenge the data under section 13.04, subdivision 4.\n(d) The bureau is immune from any civil or criminal liability that might otherwise arise, based on the accuracy or completeness of any information made public under this subdivision, if the bureau acts in good faith.\n[Repealed, 2005 c 136 art 3 s 31]\n(a) When the state accepts an offender from another state under a reciprocal agreement under the interstate compact authorized by section 243.1605, or under any authorized interstate agreement, the acceptance is conditional on the offender agreeing to register under this section when the offender is living in Minnesota.\n(b) The Bureau of Criminal Apprehension shall notify the commissioner of corrections:\n(1) when the bureau receives notice from a local law enforcement authority that a person from another state who is subject to this section has registered with the authority, unless the bureau previously received information about the offender from the commissioner of corrections;\n(2) when a registration authority, corrections agent, or law enforcement agency in another state notifies the bureau that a person from another state who is subject to this section is moving to Minnesota; and\n(3) when the bureau learns that a person from another state is in Minnesota and allegedly in violation of subdivision 5 for failure to register.\n(c) When a local law enforcement agency notifies the bureau of an out-of-state offender's registration, the agency shall provide the bureau with information on whether the person is subject to community notification in another state and the risk level the person was assigned, if any.\n(d) The bureau must forward all information it receives regarding offenders covered under this subdivision from sources other than the commissioner of corrections to the commissioner.\n(e) When the bureau receives information directly from a registration authority, corrections agent, or law enforcement agency in another state that a person who may be subject to this section is moving to Minnesota, the bureau must ask whether the person entering the state is subject to community notification in another state and the risk level the person has been assigned, if any.\n(f) When the bureau learns that a person subject to this section intends to move into Minnesota from another state or has moved into Minnesota from another state, the bureau shall notify the law enforcement authority with jurisdiction in the area of the person's primary address and provide all information concerning the person that is available to the bureau.\n(g) The commissioner of corrections must determine the parole, supervised release, or conditional release status of persons who are referred to the commissioner under this subdivision. If the commissioner determines that a person is subject to parole, supervised release, or conditional release in another state and is not registered in Minnesota under the applicable interstate compact, the commissioner shall inform the local law enforcement agency that the person is in violation of section 243.161. If the person is not subject to supervised release, the commissioner shall notify the bureau and the local law enforcement agency of the person's status.\n[Repealed, 1Sp2001 c 8 art 9 s 8]\n(a) A violation of this section may be prosecuted in any jurisdiction where an offense takes place. However, the prosecutorial agency in the jurisdiction where the person last registered a primary address is initially responsible to review the case for prosecution.\n(b) When a person commits two or more offenses in two or more counties, the accused may be prosecuted for all of the offenses in any county in which one of the offenses was committed.\nCertified copies of predatory offender registration records are admissible as substantive evidence when necessary to prove the commission of a violation of this section.",
	"repealed": false
}