{
	"id": "554.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/554.08",
	"title": "554.08 SCOPE.",
	"text": "(a) For the purposes of sections 554.07 to 554.19, the terms in this section have the meanings given them.\n(1) \"Goods or services\" does not include the creation, dissemination, exhibition, or advertisement or similar promotion of a dramatic, literary, musical, political, journalistic, or artistic work.\n(2) \"Governmental unit\" means a public corporation or government or governmental subdivision, agency, or instrumentality.\n(3) \"Person\" means an individual, estate, trust, partnership, business or nonprofit entity, governmental unit, or other legal entity.\n(b) Except as otherwise provided in paragraph (c), sections 554.07 to 554.19 apply to a cause of action asserted in a civil action against a person based on the person's:\n(1) communication in a legislative, executive, judicial, administrative, or other governmental proceeding;\n(2) communication on an issue under consideration or review in a legislative, executive, judicial, administrative, or other governmental proceeding; or\n(3) exercise of the right of freedom of speech or of the press, the right to assemble or petition, or the right of association, guaranteed by the United States Constitution or the Minnesota Constitution on a matter of public concern.\n(c) Sections 554.07 to 554.19 do not apply to a cause of action:\n(1) against a governmental unit or an employee or agent of a governmental unit acting or purporting to act in an official capacity;\n(2) by a governmental unit or an employee or agent of a governmental unit acting in an official capacity to enforce a law to protect against an imminent threat to public health or safety;\n(3) against a person primarily engaged in the business of selling or leasing goods or services if the cause of action arises out of a communication related to the person's sale or lease of the goods or services;\n(4) against a person named in a civil suit brought by a victim of a crime against a perpetrator;\n(5) against a person named in a civil suit brought to establish or declare real property possessory rights, use of real property, recovery of real property, quiet title to real property, or related claims relating to real property;\n(6) seeking recovery for bodily injury, wrongful death, or survival or to statements made regarding that legal action, unless the claims involve damage to reputation;\n(7) brought under the insurance code or arising out of an insurance contract;\n(8) based on a common law fraud claim;\n(9) brought under chapters 517 to 519A; or counterclaims based on a criminal no-contact order pursuant to section 629.72 or 629.75; for or based on an antiharassment order or a sexual assault protection order under section 518B.01; or for or based on a vulnerable adult protection order for crimes against the vulnerable adult under sections 609.232, 609.2325, 609.233, 609.2335, and 609.234;\n(10) brought under chapters 175, 177, 178, 179, and 179A; negligent supervision, retention, or infliction of emotional distress unless the claims involve damage to reputation; wrongful discharge in violation of public policy; whistleblowing; or enforcement of employee rights under civil service, collective bargaining, or handbooks and policies;\n(11) brought under consumer protection, chapter 325F or 325G; or\n(12) for any claim brought under federal law.\n(d) Sections 554.07 to 554.19 apply to a cause of action asserted under paragraph (c), clause (3), (8), or (11), when the cause of action is:\n(1) a legal action against a person arising from any act of that person, whether public or private, related to the gathering, receiving, posting, or processing of information for communication to the public, whether or not the information is actually communicated to the public, for the creation, dissemination, exhibition, or advertisement or other similar promotion of a dramatic, literary, musical, political, journalistic, or otherwise artistic work, including audiovisual work regardless of the means of distribution, a motion picture, a television or radio program, or an article published in a newspaper, website, magazine, or other platform, no matter the method or extent of distribution; or\n(2) a legal action against a person related to the communication, gathering, receiving, posting, or processing of consumer opinions or commentary, evaluations of consumer complaints, or reviews or ratings of businesses.",
	"repealed": false
}