{
	"id": "190.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.08",
	"title": "190.08 MILITARY STAFF; ACTIVE DUTY ORDERS; PAY AND ALLOWANCES.",
	"text": "The adjutant general, with the approval of the governor, may appoint from among the field officers and general officers of the National Guard two assistant adjutants general for Army National Guard and one assistant adjutant general for Air National Guard who, if otherwise qualified, may be appointed to general officer grade. An assistant adjutant general serves at the pleasure of the adjutant general. An assistant adjutant general shall also cease to serve upon withdrawal of federal recognition or when otherwise removed in accordance with the military laws of this state.\nThe adjutant general may appoint an executive director of the Department of Military Affairs. The executive director shall serve at the pleasure of the adjutant general.\nThe adjutant general also may appoint from among the officers of the National Guard a state quartermaster, a commander for each state-owned military reservation or military installation, and such other officers as may be required for the state staff.\nThe adjutant general may order to state active service, with their consent, current or former officers, warrant officers, and enlisted personnel of the National Guard of the state required for the full time administration of the Military Department. Except for those appointed under subdivisions 1 and 2, they may not be removed from office after one year of active service except for cause, reduction in force, or withdrawal of federal recognition, as long as they remain active members of the military forces of the state.\nIn case of war, riot, insurrection, emergency, or when otherwise authorized by the governor, the adjutant general may order to temporary active service additional officers, warrant officers, and enlisted personnel of the National Guard, including retired personnel, as may be necessary. Personnel do not acquire any of the rights to office under subdivision 3 while performing temporary active service. When their services are no longer required they shall be relieved from active service.\nIn addition to the officers, warrant officers, and enlisted members ordered to active service the adjutant general may employ such civilian administrative, clerical, maintenance, and caretaker personnel as are necessary for administration of the Military Department.\nThe adjutant general shall receive the pay and allowances provided by law for an officer of similar rank and length of service in the armed forces of the United States. All other officers, warrant officers, and enlisted members in active service on the staff of the adjutant general shall receive the pay and allowances prescribed for personnel of similar grade and length of service in the armed forces of the United States subject to the following provisions: (1) the adjutant general by general orders may establish for pay purposes the grade authorized for any staff position; and (2) members may be paid any additional pay authorized by section 192.49.\nThe adjutant general may order to temporary state active service, with their consent, current or former officers, warrant officers, and enlisted personnel of the National Guard of the state required for the rental of an armory under chapter 193. This service does not accrue rights under any other subdivision. The adjutant general shall establish pay rates and policy for service authorized under this subdivision, and is not required to pay for such service in accordance with section 190.08, subdivision 6, or section 192.49.",
	"repealed": false
}