{
	"id": "398.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.16",
	"title": "398.16 TAX LEVY, BUDGET.",
	"text": "The park district board, as soon after organization as practicable and on or before the first day of July of each year thereafter, shall prepare a detailed budget of its proposed expenditures during the next fiscal year, other than those to be met by bond issues or by revenues described in section 398.17 and section 398.09, paragraph (d), which budgets shall in no year exceed 18 cents per person in the district as determined by the last federal decennial census. But no such assessment shall be made upon the people or property of a city of the first class.\nAs soon after organization as practicable, and on the first day of July each year thereafter, the park district board shall certify to the governing body of each township, town or city included in the district, the budget adopted pursuant to this section, together with a statement of the proportion of the budget to be provided by such governmental subdivision. The budget shall be apportioned among such subdivisions within the district in the same proportion as their respective populations bear to the total population of the district, population figures to be based on the last federal decennial census.\nFor the purpose of this section, the governing body of any city means that board, council, commission, or officer authorized by law or charter to levy taxes for park and recreation purposes and the governing body of each unorganized township means the county board. It shall be the duty of each such governing body in the district to provide the funds necessary to meet its proportionate share of such budget, such funds to be raised by tax levies or other means within the authority of said governing bodies, and to pay the same over to the treasurer of the district in such amounts and at such times as may fairly be required by the park district board.\nAny such governing body is hereby authorized to levy annually upon all taxable property within its boundaries a tax at the rate necessary to raise, at 98 percent collection, its proportionate share of the park district's budget, which tax, except in the case of cities of the first class, may be levied in excess of and over and above all charter tax limitations.\nAll money received from said levies shall be turned over by the county treasurer collecting the same to the treasurer of the park district. All money received by the park district shall be used to carry out the powers and duties imposed on the park district board by this chapter and shall not be subject to review or reduction by other boards, commissions, or councils.\nIf the governing body of any subdivision fails before September 15 of any year to pay its proportionate share of the park district budget for the next fiscal year or to certify to the county auditor a tax levy specifically designated for said purpose, the park district board shall, on or before September 15, certify to the county auditor of each county in which such governmental subdivision is located such amount of taxes as is deemed necessary to raise such subdivision's proportionate share of the budget, for collection with and as a part of other taxes on taxable property within such subdivision, which tax, may be levied in excess of and over and above all other tax limitations.\nThe park district board may, by resolution, submit to the electors of the park district at a general or primary state election the question of raising the limit on the park district's budget from 18 cents to not to exceed 35 cents per person in the district. Any resolution providing for an election on raising the budgetary limit shall specify the proposed additional amount per person in the district to be authorized and the number of consecutive years such increase in the limit shall be effective. The resolution shall be certified to the county auditor of each county wherein lies any part of the territory of the district, and the county auditor or auditors shall cause the same to be submitted to the electors residing within such territory at the next ensuing general or primary election on a ballot setting forth the proposed additional amount per person and the number of years such increase shall be effective as provided in the resolution, and shall forward the official returns of the judges of election in the precincts voting on such ballot to the park district board for canvass, and the increase shall be authorized if approved by a majority of the electors of the district voting on such ballot.\nThe board may borrow money in anticipation of the collection of all taxes levied in its behalf and issue the negotiable notes of the district in an amount not in excess of 90 percent of the amount so levied which has not been received by the district at the time of the borrowing. Such notes shall mature not later than March 1 of the year following the year in which the tax levies are to be collected and shall be payable primarily from the proceeds of the levies anticipated thereby, but the full faith and credit of the district shall be pledged to the payment of the notes, and if such levies are not sufficient to pay all principal due and interest accrued thereon the park district board shall levy for the repayment of the principal and interest on such notes an ad valorem tax in the next ensuing year and for so long thereafter as may be necessary upon all of the taxable property within its corporate limits, which levy may be made without limitation as to rate or amount.",
	"repealed": false
}