{
	"id": "144.0752",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0752",
	"title": "144.0752 CULTURAL COMMUNICATIONS.",
	"text": "The commissioner of health shall establish:\n(1) a cultural communications program that advances culturally and linguistically appropriate communication services for communities most impacted by health disparities that include limited English proficient (LEP) populations, refugees, immigrant communities, American Indians, populations of color, LGBTQ+ populations, persons who are deaf, deafblind, or hard of hearing and who use American Sign Language, and people living with disabilities; and\n(2) a position that works with department and division leadership to ensure that the department follows the National Standards for Culturally and Linguistically Appropriate Services (CLAS) Standards.\nThe commissioner of health shall oversee a program to:\n(1) align the department services, policies, procedures, and governance with the National CLAS Standards, establish culturally and linguistically appropriate goals, policies, and management accountability, and apply them throughout the organization's planning and operations;\n(2) ensure the department services respond to the cultural and linguistic diversity of Minnesotans and that the department partners with the community to design, implement, and evaluate policies, practices, and services that are aligned with the national cultural and linguistic appropriateness standard; and\n(3) ensure the department leadership, workforce, and partners embed culturally and linguistically appropriate policies and practices into leadership and public health program planning, intervention, evaluation, and dissemination.\nThe commissioner may enter into contracts to implement this section. Organizations eligible to receive contract funding under this section include:\n(1) master contractors that are selected through the state to provide language and communication services; and\n(2) organizations that are able to provide services for languages that master contractors are unable to cover.",
	"repealed": false
}