{
	"id": "254B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.03",
	"title": "254B.03 RESPONSIBILITY TO PROVIDE SUBSTANCE USE DISORDER TREATMENT.",
	"text": "(a) Every local agency must determine financial eligibility for substance use disorder services and provide substance use disorder services to persons residing within its jurisdiction who meet criteria established by the commissioner. Substance use disorder money must be administered by the local agencies according to law and rules adopted by the commissioner under sections 14.001 to 14.69.\n(b) In order to contain costs, the commissioner of human services shall select eligible vendors of substance use disorder services who can provide economical and appropriate treatment. Unless the local agency is a social services department directly administered by a county or human services board, the local agency shall not be an eligible vendor under section 254B.05. The commissioner may approve proposals from county boards to provide services in an economical manner or to control utilization, with safeguards to ensure that necessary services are provided. If a county implements a demonstration or experimental medical services funding plan, the commissioner shall transfer the money as appropriate.\n(c) An individual may choose to obtain a comprehensive assessment as provided in section 245G.05. Individuals obtaining a comprehensive assessment may access any enrolled provider that is licensed to provide the level of service authorized pursuant to section 254A.19, subdivision 3. If the individual is enrolled in a prepaid health plan, the individual must comply with any provider network requirements or limitations.\n(d) Beginning July 1, 2022, local agencies shall not make placement location determinations.\n(a) Payment from the behavioral health fund is limited to payments for services identified in section 254B.05, other than detoxification licensed under Minnesota Rules, parts 9530.6510 to 9530.6590, and detoxification provided in another state that would be required to be licensed as a substance use disorder program if the program were in the state. Out of state vendors must also provide the commissioner with assurances that the program complies substantially with state licensing requirements and possesses all licenses and certifications required by the host state to provide substance use disorder treatment. Vendors receiving payments from the behavioral health fund must not require co-payment from a recipient of benefits for services provided under this subdivision. The vendor is prohibited from using the client's public benefits to offset the cost of services paid under this section. The vendor shall not require the client to use public benefits for room or board costs. This includes but is not limited to cash assistance benefits under chapters 142E, 142G, and 256D, or SNAP benefits. Retention of SNAP benefits is a right of a client receiving services through the behavioral health fund or through state contracted managed care entities. Payment from the behavioral health fund shall be made for necessary room and board costs provided by vendors meeting the criteria under section 254B.05, subdivision 1a, or in a community hospital licensed by the commissioner of health according to sections 144.50 to 144.56 to a client who is:\n(1) determined to meet the criteria for placement in a residential substance use disorder treatment program according to rules adopted under section 254A.03, subdivision 3; and\n(2) concurrently receiving a substance use disorder treatment service in a program licensed by the commissioner and reimbursed by the behavioral health fund.\n(b) The commissioner shall coordinate substance use disorder services and determine whether there is a need for any proposed expansion of substance use disorder treatment services. The commissioner shall deny vendor certification to any provider that has not received prior approval from the commissioner for the creation of new programs or the expansion of existing program capacity. The commissioner shall consider the provider's capacity to obtain clients from outside the state based on plans, agreements, and previous utilization history, when determining the need for new treatment services.\n(c) At least 60 days prior to submitting an application for new licensure under chapter 245G, the applicant must notify the county human services director in writing of the applicant's intent to open a new treatment program. The written notification must include, at a minimum:\n(1) a description of the proposed treatment program; and\n(2) a description of the target population to be served by the treatment program.\n(d) The county human services director may submit a written statement to the commissioner, within 60 days of receiving notice from the applicant, regarding the county's support of or opposition to the opening of the new treatment program. The written statement must include documentation of the rationale for the county's determination. The commissioner shall consider the county's written statement when determining whether there is a need for the treatment program as required by paragraph (c).\nLocal agencies shall pay the state for the county share of the services authorized by the local agency, except when the payment is made according to section 254B.09, subdivision 8.\n(a) Except for services provided by a county under section 254B.09, subdivision 1, or services provided under section 256B.69, the county shall, out of local money, pay the state for 22.95 percent of the cost of substance use disorder services, except for those services provided to persons enrolled in medical assistance under chapter 256B and room and board services under section 254B.05, subdivision 5, paragraph (b). Counties may use the indigent hospitalization levy for treatment and hospital payments made under this section.\n(b) 22.95 percent of any state collections from private or third-party pay, less 15 percent for the cost of payment and collections, must be distributed to the county that paid for a portion of the treatment under this section.\nMS 2018 [Repealed, 1Sp2019 c 9 art 6 s 81; 2020 c 74 art 3 s 13]\nThe commissioner shall adopt rules as necessary to implement this chapter.\n[Repealed, 1989 c 155 s 5]\nThe commissioner shall:\n(1) provide training and assistance to counties on procedures for processing placements and making payments;\n(2) visit facilities and review records as necessary to determine compliance with procedures established by law and rule;\n(3) take complaints from vendors and recipients and investigate county placement activities as needed to determine compliance with law and rule.\nCounties and vendors shall make regular reports as required by the commissioner to facilitate commissioner review.\n[Repealed, 1997 c 7 art 2 s 67]\n(a) Effective July 1, 2011, the commissioner shall:\n(1) enter into agreements with eligible vendors that:\n(i) meet the standards in section 254B.05, subdivision 1;\n(ii) have good standing in all applicable licensure; and\n(iii) have a current approved provider agreement as a Minnesota health care program provider that contains program standards for each rate and rate enhancement defined by the commissioner; and\n(2) set rates for services reimbursed under this chapter.\n(b) When setting rates, the commissioner shall consider the complexity and the acuity of the problems presented by the client.\n(c) When rates set under this section and rates set under section 254B.09, subdivision 8, apply to the same treatment placement, section 254B.09, subdivision 8, supersedes.",
	"repealed": false
}