{
	"id": "342.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.46",
	"title": "342.46 LOWER-POTENCY HEMP EDIBLE RETAILER.",
	"text": "(a) A lower-potency hemp edible retailer may only sell lower-potency hemp edibles to individuals who are at least 21 years of age.\n(b) A lower-potency hemp edible retailer may sell lower-potency hemp edibles that:\n(1) are obtained from a licensed Minnesota cannabis microbusiness, cannabis mezzobusiness, cannabis manufacturer, cannabis wholesaler, or lower-potency hemp edible manufacturer; and\n(2) meet all applicable packaging and labeling requirements.\nA lower-potency hemp edible retailer may sell other products or items for which the lower-potency hemp edible retailer has a license or authorization or that do not require a license or authorization.\nPrior to initiating a sale, an employee of the lower-potency hemp edible retailer must verify that the customer is at least 21 years of age. Section 342.27, subdivision 4, applies to the verification of a customer's age.\nA lower-potency hemp edible retailer shall ensure that all lower-potency hemp edibles, other than lower-potency hemp edibles that are intended to be consumed as a beverage, are displayed behind a checkout counter where the public is not permitted or in a locked case. All lower-potency hemp edibles that are not displayed must be stored in a secure area.\n(a) A lower-potency hemp edible retailer may transport lower-potency hemp edibles on public roadways provided:\n(1) the lower-potency hemp edibles are in final packaging;\n(2) the lower-potency hemp edibles are packaged in tamper-evident containers that are not visible or recognizable from outside the transporting vehicle;\n(3) the lower-potency hemp edible retailer has a shipping manifest in the lower-potency hemp edible retailer's possession that describes the contents of all tamper-evident containers;\n(4) all departures, arrivals, and stops are appropriately documented;\n(5) no person other than a designated employee enters a vehicle at any time that the vehicle is transporting lower-potency hemp edibles; and\n(6) the lower-potency hemp edible retailer complies with any other rules adopted by the office.\n(b) Any vehicle assigned for the purposes of transporting lower-potency hemp edibles is subject to inspection at any time.\n(a) A lower-potency hemp edible retailer shall ensure that all lower-potency hemp edibles offered for sale comply with the limits on the amount and types of cannabinoids that a lower-potency hemp edible can contain, including but not limited to the requirement that lower-potency hemp edibles:\n(1) consist of servings that contain no more than five milligrams of delta-9 tetrahydrocannabinol, no more than 25 milligrams of cannabidiol, no more than 25 milligrams of cannabigerol, or any combination of those cannabinoids that does not exceed the identified amounts;\n(2) do not contain more than a combined total of 0.5 milligrams of all other cannabinoids per serving; and\n(3) do not contain an artificially derived cannabinoid other than delta-9 tetrahydrocannabinol.\n(b) If a lower-potency hemp edible is packaged in a manner that includes more than a single serving, the lower-potency hemp edible must indicate each serving by scoring, wrapping, or other indicators that appear on the lower-potency hemp edible designating the individual serving size. If it is not possible to indicate a single serving by scoring or use of another indicator that appears on the product, the lower-potency hemp edible may not be packaged in a manner that includes more than a single serving in each container, except that a calibrated dropper, measuring spoon, or similar device for measuring a single serving may be used for any edible cannabinoid products that are intended to be combined with food or beverage products prior to consumption. If the lower-potency hemp edible is meant to be consumed as a beverage, the beverage container may not contain more than two servings per container.\n(c) A single package containing multiple servings of a lower-potency hemp edible must contain no more than 50 milligrams of delta-9 tetrahydrocannabinol, 250 milligrams of cannabidiol, 250 milligrams of cannabigerol, or any combination of those cannabinoids that does not exceed the identified amounts.\nA lower-potency hemp edible retailer may not:\n(1) sell lower-potency hemp edibles to an individual who is under 21 years of age;\n(2) sell a lower-potency hemp edible to a person who is visibly intoxicated;\n(3) sell cannabis flower, cannabis products, or hemp-derived consumer products;\n(4) allow for the dispensing of lower-potency hemp edibles in vending machines; or\n(5) distribute or allow free samples of lower-potency hemp edibles except when the business is licensed to permit on-site consumption and samples are consumed within its licensed premises.\n(a) A lower-potency hemp edible retailer may permit on-site consumption of lower-potency hemp edibles on a portion of its premises if it has an on-site consumption endorsement.\n(b) The office shall issue an on-site consumption endorsement to any lower-potency hemp edible retailer that also holds an on-sale license issued under chapter 340A.\n(c) A lower-potency hemp edible retailer must ensure that lower-potency hemp edibles sold for on-site consumption comply with this chapter and rules adopted pursuant to this chapter regarding testing.\n(d) Lower-potency hemp edibles sold for on-site consumption, other than lower-potency hemp edibles that are intended to be consumed as a beverage, must be served in the required packaging, but may be removed from the products' packaging by customers and consumed on site.\n(e) Lower-potency hemp edibles that are intended to be consumed as a beverage may be served outside of the edibles' packaging if the information that is required to be contained on the label of a lower-potency hemp edible is posted or otherwise displayed by the lower-potency hemp edible retailer. Hemp workers who serve beverages under this paragraph are not required to obtain an edible cannabinoid product handler endorsement under section 342.07, subdivision 3.\n(f) Food and beverages not otherwise prohibited by this subdivision may be prepared and sold on site if the lower-potency hemp edible retailer complies with all relevant state and local laws, ordinances, licensing requirements, and zoning requirements.\n(g) A lower-potency hemp edible retailer may offer recorded or live entertainment if the lower-potency hemp edible retailer complies with all relevant state and local laws, ordinances, licensing requirements, and zoning requirements.\n(h) In addition to the prohibitions under subdivision 7, a lower-potency hemp edible retailer with an on-site consumption endorsement may not:\n(1) sell, give, furnish, or in any way procure for another lower-potency hemp edibles for the use of an obviously intoxicated person;\n(2) sell lower-potency hemp edibles that are designed or reasonably expected to be mixed with an alcoholic beverage; or\n(3) permit lower-potency hemp edibles that have been removed from the products' packaging to be removed from the premises of the lower-potency hemp edible retailer.\nA lower-potency hemp edible retailer must post all notices as provided in section 342.27, subdivision 6.\n(a) A lower-potency hemp edible retailer shall maintain compliance with state and local building, fire, and zoning codes, requirements, or regulations.\n(b) A lower-potency hemp edible retailer shall ensure that the licensed premises is maintained in a clean and sanitary condition, free from infestation by insects, rodents, or other pests.\nThe office shall inspect lower-potency hemp edible retailers and take enforcement action as provided in sections 342.19 and 342.21.",
	"repealed": false
}