{
	"id": "260C.150",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.150",
	"title": "260C.150 DILIGENT EFFORTS TO IDENTIFY PARENTS OF A CHILD; PROCEDURES FOR REVIEW; REASONABLE EFFORTS.",
	"text": "A parent and child relationship may be established under this chapter according to the requirements of section 257.54 and the Minnesota Rules of Juvenile Protection Procedure.\n(a) For purposes of proceedings under this chapter, a positive test result under section 257.62, subdivision 5, shall be used by the court to treat a person determined to be the biological father of a child by a positive test as if the individual were a presumed father under section 257.55, including giving the biological father the right to notice of proceedings and the right to be assessed and considered for day-to-day care of his child under section 260C.219.\n(b) Nothing in this subdivision relieves a person determined to be the biological father of the child by a positive test from the duty to cooperate with paternity establishment proceedings under section 260C.219.\n(a) The responsible social services agency shall make diligent efforts to identify and locate both parents of any child who is the subject of proceedings under this chapter. Diligent efforts include:\n(1) asking the custodial or known parent to identify any nonresident parent of the child and provide information that can be used to verify the nonresident parent's identity including the dates and locations of marriages and divorces; dates and locations of any legal proceedings regarding paternity; date and place of the child's birth; nonresident parent's full legal name; nonresident parent's date of birth, or if the nonresident parent's date of birth is unknown, an approximate age; the nonresident parent's Social Security number; the nonresident parent's whereabouts including last known whereabouts; and the whereabouts of relatives of the nonresident parent. For purposes of this subdivision, \"nonresident parent\" means a parent who does not reside in the same household as the child or did not reside in the same household as the child at the time the child was removed when the child is in foster care;\n(2) obtaining information that will identify and locate the nonresident parent from the county and state of Minnesota child support enforcement information system;\n(3) requesting a search of the Minnesota Fathers' Adoption Registry 30 days after the child's birth; and\n(4) using any other reasonable means to identify and locate the nonresident parent.\n(b) The agency may disclose data which is otherwise private under section 13.46 or chapter 260E in order to carry out its duties under this subdivision.\n(c) Upon the filing of a petition alleging the child to be in need of protection or services, the responsible social services agency may contact a putative father who registered with the Minnesota Fathers' Adoption Registry more than 30 days after the child's birth. The social service agency may consider a putative father for the day-to-day care of the child under section 260C.219 if the putative father cooperates with genetic testing and there is a positive test result under section 257.62, subdivision 5. Nothing in this paragraph:\n(1) relieves a putative father who registered with the Minnesota Fathers' Adoption Registry more than 30 days after the child's birth of the duty to cooperate with paternity establishment proceedings under section 260C.219;\n(2) gives a putative father who registered with the Minnesota Fathers' Adoption Registry more than 30 days after the child's birth the right to notice under section 260C.151 unless the putative father is entitled to notice under sections 259.24 and 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7); or\n(3) establishes a right to assert an interest in the child in a termination of parental rights proceeding contrary to section 259.52, subdivision 6, unless the putative father is entitled to notice under sections 259.24 and 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7).\nAt the first hearing regarding the petition and at any subsequent hearings, as appropriate, the court shall inquire of the parties whether the identities and whereabouts of both parents of the child are known and correctly reflected in the petition filed with the court. If either the identity or whereabouts of both parents is not known, the court shall make inquiry on the record of any party or participant present regarding the identity and whereabouts of the unknown parent of the child.\nWhen the county attorney requests, the court shall have the custodial or known parent of the child sworn for the purpose of answering questions relevant to the identity of a child's other parent in any proceeding under this chapter. The county attorney may request this information at any point in the proceedings if the custodial or known parent has not been cooperative in providing information to identify and locate the nonresident parent or information that may lead to identifying and locating the nonresident parent. If the child's custodial or known parent testifies that disclosure of identifying information regarding the identity of the nonresident parent would cause either the custodial or known parent, the child, or another family member to be endangered, the court may make a protective order regarding any information necessary to protect the custodial or known parent, the child, or family member. Consistent with section 260C.219, if the child remains in the care of the known or custodial parent and the court finds it in the child's best interests, the court may waive notice to the nonresident parent of the child if such notice would endanger the known or custodial parent, the child, or another family member.\nAs soon as possible, but not later than the first review hearing required under the Minnesota Rules of Juvenile Protection Procedure, unless the responsible social services agency has identified and located both parents of the child, the agency shall include in its report to the court required under the Minnesota Rules of Juvenile Protection Procedure a description of its diligent efforts to locate any parent who remains unknown or who the agency has been unable to locate. The court shall determine whether (1) diligent efforts have been made by the agency to identify both parents of the child, (2) both parents have been located, and (3) both parents have been served with the summons or notice of the proceedings required by section 260C.151 or 260C.152 and the Minnesota Rules of Juvenile Protection Procedure. If the court determines the agency has not made diligent efforts to locate both parents of the child or if both parents of the child have not been served as required by the rules, the court shall order the agency to take further steps to identify and locate both parents of the child identifying what further specific efforts are appropriate. If the summons has not been served on the parent as required by section 260C.151, subdivision 1, the court shall order further efforts to complete service.\nWhen the court finds the agency has made diligent efforts to identify and locate both parents of the child and one or both parents remain unknown or cannot be located, the court may find that the agency has made reasonable efforts under sections 260.012, 260C.178, 260C.201, and 260C.301, subdivision 8, regarding any parent who remains unknown or cannot be located. The court may also find that further reasonable efforts for reunification with the parent who cannot be identified or located would be futile.\nNeither the requirements of this subdivision nor the search requirements of section 259.52, subdivision 2, apply when the agency is proceeding under section 260C.139. When the agency is proceeding under section 260C.139, the agency has no duty to identify and locate either parent of the newborn and no notice or service of summons on either parent is required under section 260C.151 or 260C.152 or the Minnesota Rules of Juvenile Protection Procedure.",
	"repealed": false
}