{
	"id": "383B.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.38",
	"title": "383B.38 REMOVALS, SUSPENSIONS, AND DEMOTIONS.",
	"text": "No permanent employee in the classified service shall be suspended, demoted, or discharged except for just cause.\nIn case of any action under this section, the employee shall, before the action is taken, be furnished with a written statement, setting forth the reasons for the disciplinary action. The employee shall be permitted five workdays' time to reply in writing or to meet with the department head or designee. A copy of the statement charging the employee shall be filed with the director along with the employee's reply, if any.\n(a) Any permanent employee in the classified service who is discharged, demoted or suspended pursuant to rules promulgated hereunder, shall be notified by the effective date of the action of the right to appeal as provided for by the rules to the chief administrative law judge of the Office of Administrative Hearings. Action of the department head shall be final if no written notice of appeal is filed with the chief administrative law judge of the office of administrative hearings and served upon the director and the department head within 14 calendar days after the effective date of the action.\n(b) A permanent employee who elects to challenge a discharge, demotion, or suspension through a grievance procedure under a collective bargaining agreement under sections 179.35 to 179.39 or 179A.20 and 179A.21, may not also challenge the same action through an appeal to the chief administrative law judge of the Office of Administrative Hearings. Except as provided by section 197.46, a permanent employee may challenge a discharge or demotion through either a grievance procedure under a collective bargaining agreement, or an appeal to the chief administrative law judge of the Office of Administrative Hearings, but not through both procedures.\n(c) Within ten days of receipt of the employee's written notice of appeal, the chief administrative law judge shall assign an administrative law judge to hear the appeal. The employee or department head or their attorney may, within ten days after receipt of the notice of assignment, make and serve on the other party and file with the office of administrative hearings a notice to remove as provided in rule 63.03 of the Rules of Civil Procedure. Upon the filing of a notice to remove, the chief administrative law judge shall assign another administrative law judge to hear the appeal.\n(d) The hearing shall be conducted under the contested case provisions of chapter 14 and the procedural rules adopted by the chief administrative law judge, except that Minnesota Rules, part 1400.6700, subparts 2 and 3, do not apply and discovery is limited to the exchange of relevant documentation, witness lists, and proposed exhibits.\n(e) If the administrative law judge finds, based on the record, that the action appealed was not taken by the department head for just cause, the employee shall be reinstated to the position, or an equal position within the same department, without loss of pay. If the administrative law judge finds that just cause exists for the disciplinary action, it shall affirm or uphold the action of the department head, or, if the employee has asserted and the hearing record establishes extenuating circumstances, the administrative law judge may reinstate the employee, with full, partial, or no pay, or may modify the department head's action by substituting a lesser disciplinary action. The administrative law judge's order is the final decision. The administrative law judge's order may be appealed according to sections 14.63 to 14.68 by the employee, or by the department head upon approval of the county board. Settlement of the entire dispute by mutual agreement is encouraged at any stage of the proceedings. Any settlement agreement is final and binding when agreed to by all parties. If an appeal to the office of administrative hearings has been made, the settlement agreement shall be submitted to the administrative law judge. Except as provided in collective bargaining agreements, the operating department shall bear the costs of the administrative law judge for hearings provided for in this section.\nMS 1992 [Repealed, 1994 c 596 s 13]\nMS 1992 [Repealed, 1994 c 596 s 13]\nMS 1992 [Repealed, 1994 c 596 s 13]",
	"repealed": false
}