{
	"id": "103E.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.801",
	"title": "103E.801 CONSOLIDATING OR DIVIDING DRAINAGE SYSTEMS.",
	"text": "After the benefited area of a drainage system has been redetermined by the drainage authority under section 103E.351 or in connection with drainage proceedings, the drainage authority may divide one system into two or more separate systems, consolidate two or more systems, transfer part of one system to another, or attach a part of a system that has been abandoned as provided in section 103E.805 or 103E.811 to another system to provide for the efficient administration of the system consistent with the redetermination of the benefited area.\nThe consolidation or division may be initiated by the drainage authority on its own motion or by any party interested in or affected by the drainage system filing a petition. If the system is under the jurisdiction of a drainage authority, the petition must be filed with the auditor. If the system is under the jurisdiction of a watershed board, the petition must be filed with the secretary of the board.\n(a) When a drainage authority or watershed board directs by resolution or a petition is filed, the drainage authority in consultation with the auditor or secretary shall set a time and location for a hearing. The auditor or secretary shall give notice by publication to all persons interested in the drainage system. The drainage authority may consolidate or divide drainage systems, by order, if it determines that the division of one system into two or more separate systems, the consolidation of two or more systems, the transfer of part of one system to another, or the attachment of a previously abandoned part of a system to another system:\n(1) is consistent with the redetermination of the benefited areas of the drainage system;\n(2) would provide for the efficient administration of the drainage system; and\n(3) would be fair and equitable.\n(b) An order to consolidate or divide drainage systems does not release property from a drainage lien or assessment filed for costs incurred on account of a drainage system before the date of the order.",
	"repealed": false
}