{
	"id": "469.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.012",
	"title": "469.012 PUBLIC BODY; POWERS, DUTIES, PROGRAMS; TAXES LIMITED.",
	"text": "MS 2002 [Renumbered subds 1 to 2j]\n(a) An authority shall be a public body corporate and politic and shall have all the powers necessary or convenient to carry out the purposes of sections 469.001 to 469.047, except that the power to levy and collect taxes or special assessments is limited to the power provided in sections 469.027 to 469.033.\n(b) Its powers include the powers in subdivisions 1a through 2j, in addition to others granted in sections 469.001 to 469.047.\nAn authority may:\n(1) sue and be sued;\n(2) have a seal, which shall be judicially noticed, and may alter it;\n(3) have perpetual succession; and\n(4) make, amend, and repeal rules consistent with sections 469.001 to 469.047.\nAn authority may employ an executive director, technical experts, and officers, agents, and employees, permanent and temporary, that it requires, and determine their qualifications, duties, and compensation; for legal services it requires, call upon the chief law officer of the city or employ its own counsel and legal staff; and, so far as practicable, use the services of local public bodies in its area of operation, provided that those local public bodies, if requested, shall make the services available.\nAn authority may delegate to one or more of its agents or employees the powers or duties it deems proper.\nAn authority may, within its area of operation, undertake, prepare, carry out, and operate projects and provide for the construction, reconstruction, improvement, extension, alteration, or repair of any project or part thereof.\nAn authority may, subject to the provisions of section 469.026, give, sell, transfer, convey, or otherwise dispose of real or personal property or any interest therein and execute leases, deeds, conveyances, negotiable instruments, purchase agreements, and other contracts or instruments.\nAn authority may take action that is necessary or convenient to carry out the purposes of these sections.\n(a) An authority may, within its area of operation, acquire real or personal property or any interest therein by gifts, grant, purchase, exchange, lease, transfer, bequest, devise, or otherwise, and by the exercise of the power of eminent domain, in the manner provided by chapter 117, acquire real property which it may deem necessary for its purposes, after the adoption by it of a resolution declaring that the acquisition of the real property is necessary:\n(1) to eliminate one or more of the conditions found to exist in the resolution adopted pursuant to section 469.003 or to provide decent, safe, and sanitary housing for persons of low and moderate income; or\n(2) to carry out a redevelopment project.\n(b) Real property needed or convenient for a project may be acquired by the authority for the project by condemnation pursuant to this section.\n(c) Prior to adoption of a resolution authorizing acquisition of property by condemnation, the governing body of the authority must hold a public hearing on the proposed acquisition after published notice in a newspaper of general circulation in the municipality, which must be made at least one time not less than ten days nor more than 30 days prior to the date of the hearing. The notice must reasonably describe the property to be acquired and state that the purpose of the hearing is to consider acquisition by exercise of the authority's powers of eminent domain. Not less than ten days before the hearing, notice of the hearing must also be mailed to the owner of each parcel proposed to be acquired, but failure to give mailed notice or any defects in the notice does not invalidate the acquisition. For the purpose of giving mailed notice, owners are determined in accordance with section 429.031, subdivision 1, paragraph (a).\n(d) Property acquired by condemnation under this section may include any property devoted to a public use, whether or not held in trust, notwithstanding that the property may have been previously acquired by condemnation or is owned by a public utility corporation, because the public use in conformity with the provisions of sections 469.001 to 469.047 shall be deemed a superior public use. Property devoted to a public use may be so acquired only if the governing body of the municipality has approved its acquisition by the authority.\n(e) An award of compensation shall not be increased by reason of any increase in the value of the real property caused by the assembly, clearance or reconstruction, or proposed assembly, clearance or reconstruction for the purposes of sections 469.001 to 469.047 of the real property in an area.\n(a) An authority may, within its area of operation, and without the adoption of an urban renewal plan, acquire, by all means as set forth in subdivision 1g but without the adoption of a resolution provided for in subdivision 1g, real property, and demolish, remove, rehabilitate, or reconstruct the buildings and improvements or construct new buildings and improvements thereon, or so provide through other means as set forth in Laws 1974, chapter 228, or grade, fill, and construct foundations or otherwise prepare the site for improvements.\n(b) The authority may dispose of the property pursuant to section 469.029, provided that the provisions of section 469.029 requiring conformance to an urban renewal plan shall not apply.\n(c) The authority may finance these activities by means of the redevelopment project fund or by means of tax increments or tax increment bonds or by the methods of financing provided for in section 469.033 or by means of contributions from the municipality provided for in section 469.041, clause (9), or by any combination of those means.\n(d) Real property with buildings or improvements thereon shall only be acquired under this subdivision when the buildings or improvements are substandard.\n(e) The exercise of the power of eminent domain under this subdivision shall be limited to real property which contains, or has contained within the three years immediately preceding the exercise of the power of eminent domain and is currently vacant, buildings and improvements which are vacated and substandard. Notwithstanding the prior sentence, in cities of the first class the exercise of the power of eminent domain under this subdivision shall be limited to real property which contains, or has contained within the three years immediately preceding the exercise of the power of eminent domain, buildings and improvements which are substandard.\n(f) For the purpose of this subdivision, substandard buildings or improvements mean hazardous buildings as defined in section 463.15, subdivision 3, or buildings or improvements that are dilapidated or obsolescent, faultily designed, lack adequate ventilation, light, or sanitary facilities, or any combination of these or other factors that are detrimental to the safety or health of the community.\n(g) The exercise of the power of eminent domain under this subdivision is subject to the notice and hearing requirements described in subdivision 1g.\nAn authority may, within its area of operation, determine the level of income constituting low or moderate family income. The authority may establish various income levels for various family sizes. In making its determination, the authority may consider income levels that may be established by the Department of Housing and Urban Development or a similar or successor federal agency for the purpose of federal loan guarantees or subsidies for persons of low or moderate income. The authority may use that determination as a basis for the maximum amount of income for admissions to housing development projects or housing projects owned or operated by it.\nAn authority may provide in federally assisted projects any relocation payments and assistance necessary to comply with the requirements of the federal Uniform Relocation Assistance and Real Property Acquisition Policies Act of 1970, and any amendments or supplements thereto.\n(a) An authority may make an agreement with the governing body or bodies creating the authority which provides exemption from all ad valorem real and personal property taxes levied or imposed by the body or bodies creating the authority. In the case of low-rent public housing that received financial assistance under the United States Housing Act of 1937, or successor federal legislation, an authority may make an agreement with the governing body or bodies creating the authority to provide exemption from all real and personal property taxes levied or imposed by the state, city, county, or other political subdivision, for which the authority shall make payments in lieu of taxes to the state, city, county, or other political subdivisions as provided in section 469.040.\n(b) The governing body shall agree on behalf of all the applicable governing bodies affected that local cooperation as required by the federal government shall be provided by the local governing body or bodies in whose jurisdiction the project is to be located, at no cost or at no greater cost than the same public services and facilities furnished to other residents.\nAn authority may cooperate with or act as agent for the federal government, the state or any state public body, or any agency or instrumentality of the foregoing, in carrying out any of the provisions of sections 469.001 to 469.047 or of any other related federal, state, or local legislation, and upon the consent of the governing body of the city purchase, lease, manage, or otherwise take over any housing project already owned and operated by the federal government.\nAn authority may make plans for carrying out a program of voluntary repair and rehabilitation of buildings and improvements and plans for the enforcement of laws, codes, and regulations relating to:\n(1) the use of land and the use and occupancy of buildings and improvements, and\n(2) the compulsory repair, rehabilitation, demolition, or removal of buildings and improvements.\nThe authority may develop, test, and report methods and techniques, and carry out demonstrations and other activities for the prevention and elimination of slums and blight.\nAn authority may borrow money or other property and accept contributions, grants, gifts, services, or other assistance from the federal government, the state government, state public bodies, or from any other public or private sources.\nAn authority may:\n(1) include in any contract for financial assistance with the federal government any conditions that the federal government may attach to its financial aid of a project, not inconsistent with purposes of sections 469.001 to 469.047, including obligating itself (which obligation shall be specifically enforceable and not constitute a mortgage, notwithstanding any other laws) to convey to the federal government the project to which the contract relates upon the occurrence of a substantial default with respect to the covenants or conditions to which the authority is subject; and\n(2) provide in the contract that, in case of such conveyance, the federal government may complete, operate, manage, lease, convey, or otherwise deal with the project until the defaults are cured if the federal government agrees in the contract to reconvey to the authority the project as then constituted when the defaults have been cured.\nAn authority may issue bonds for any of its corporate purposes and to secure the bonds by mortgages upon property held or to be held by it or by pledge of its revenues, including grants or contributions.\nAn authority may invest any funds held in reserves or sinking funds, or any funds not required for immediate disbursement, in property or securities in which savings banks may legally invest funds subject to their control or in the manner and subject to the conditions provided in section 118A.04 for the deposit and investment of public funds.\nAn authority may, within its area of operation, determine where blight exists or where there is unsafe, unsanitary, or overcrowded housing.\n(a) An authority may:\n(1) carry out studies of the housing and redevelopment needs within its area of operation and of the meeting of those needs; and\n(2) make the results of those studies and analyses available to the public and to building, housing, and supply industries.\n(b) Studies under paragraph (a) include the study of data on population and family groups and their distribution according to income groups, the amount and quality of available housing and its distribution according to rentals and sales prices, employment, wages, desirable patterns for land use and community growth, and other factors affecting the local housing and redevelopment needs and the meeting of those needs.\nAn authority may, if a local public body does not have a planning agency or the planning agency has not produced a comprehensive or general community development plan, make or cause to be made a plan to be used as a guide in the more detailed planning of housing and redevelopment areas.\nAn authority may lease or rent any dwellings, accommodations, lands, buildings, structures, or facilities included in any project and, subject to the limitations contained in sections 469.001 to 469.047 with respect to the rental of dwellings in housing projects, to establish and revise the rents or charges therefor.\nAn authority may:\n(1) own, hold, and improve real or personal property, and\n(2) sell, lease, exchange, transfer, assign, pledge, or dispose of any real or personal property or any interest therein.\nAn authority may insure or provide for the insurance of any real or personal property or operations of the authority against any risks or hazards.\n[Reserved]\n[Reserved]\nAn authority may procure or agree to the procurement of government insurance or guarantees of the payment of any bonds or parts thereof issued by an authority and to pay premiums on the insurance.\nAn authority may make expenditures necessary to carry out the purposes of sections 469.001 to 469.047.\nAn authority may enter into an agreement or agreements with any state public body to provide informational service and relocation assistance to families, individuals, business concerns, and nonprofit organizations displaced or to be displaced by the activities of any state public body.\nAn authority may:\n(1) compile and maintain a catalog of all vacant, open and undeveloped land, or land which contains substandard buildings and improvements as that term is defined in subdivision 1g, that is owned or controlled by the authority or by the governing body within its area of operation; and\n(2) compile and maintain a catalog of all authority owned real property that is in excess of the foreseeable needs of the authority,\nin order to determine and recommend if the real property compiled in either catalog is appropriate for disposal pursuant to the provisions of section 469.029, subdivisions 9 and 10.\nAn authority may recommend to the city concerning the enforcement of the applicable health, housing, building, fire prevention, and housing maintenance code requirements as they relate to residential dwelling structures that are being rehabilitated by low- or moderate-income persons pursuant to section 469.029, subdivision 9, for the period of time necessary to complete the rehabilitation, as determined by the authority.\nAn authority may recommend to the city the initiation of municipal powers, against certain real properties, relating to repair, closing, condemnation, or demolition of unsafe, unsanitary, hazardous, and unfit buildings, as provided in section 469.041, clause (5).\nAn authority may sell, at private or public sale, at the price or prices determined by the authority, any note, mortgage, lease, sublease, lease purchase, or other instrument or obligation evidencing or securing a loan made for the purpose of economic development, job creation, redevelopment, or community revitalization by a public agency to a business, for-profit or nonprofit organization, or an individual.\nAn authority may, within its area of operation, acquire and sell real property that is benefited by federal housing assistance payments, other rental subsidies, interest reduction payments, or interest reduction contracts for the purpose of preserving the affordability of low- and moderate-income multifamily housing.\n(a) An authority may apply for, enter into contracts with the federal government, administer, and carry out a Section 8 program.\n(b) Authorization by the governing body creating the authority to administer the program at the authority's initial application is sufficient to authorize operation of the program in its area of operation for which it was created without additional local governing body approval.\n(c) Approval by the governing body or bodies creating the authority constitutes approval of a housing program for purposes of any special or general law requiring local approval of Section 8 programs undertaken by city, county, or multicounty authorities.\nAn authority may secure a mortgage or loan for a rental housing project by obtaining the appointment of receivers or assignments of rents and profits under sections 559.17 and 576.25, subdivision 5, except that the limitation relating to the minimum amounts of the original principal balances of mortgages specified in sections 559.17, subdivision 2, clause (2); and 576.25, subdivision 5, paragraph (a), clause (1), does not apply.\nAn authority may become a member or shareholder in and enter into or form limited partnerships, limited liability companies, or corporations for the purpose of developing, constructing, rehabilitating, managing, supporting, or preserving housing projects and housing development projects, including low-income housing tax credit projects. These limited partnerships, limited liability companies, or corporations are subject to all of the provisions of sections 469.001 to 469.047 and other laws that apply to housing and redevelopment authorities, as if the limited partnership, limited liability company, or corporation were a housing and redevelopment authority.\n(a) An authority may exercise all or any part or combination of the powers granted by sections 469.001 to 469.047 within its area of operation.\n(b) Any two or more authorities may join with one another in the exercise, either jointly or otherwise, of any or all of their powers for the purpose of financing, including the issuance of bonds and giving security therefor, planning, undertaking, owning, constructing, operating, or contracting with respect to a housing project located within the area of operation of any one or more of the authorities. For this purpose an authority may by resolution prescribe and authorize any other housing authority, so joining with it, to act on its behalf with respect to any or all powers, as its agent or otherwise, in the name of the authority so joining or in its own name.\n(c) A city, county, or multicounty authority may by resolution authorize another housing authority to exercise its powers within the authorizing authority's area of operation at the same time that the authorizing authority is exercising the same powers.\n(d) A county or city may join with any authority to permit the authority, on behalf of the county, town within the county, or city, to plan, undertake, administer, and carry out a leased existing housing assistance payments program, pursuant to Section 8 of the United States Housing Act of 1937 as amended, 42 United States Code, section 1437f.\n(e) A city may so join with an authority unless there is an authority in the city which has been authorized by resolution under section 469.003 to transact business or exercise powers.\n(f) A county may so join with an authority unless:\n(1) there is a county authority which has been authorized by resolution under section 469.004 to exercise powers, or the county is a member of a multicounty authority, and\n(2) the authority has initiated or has in progress an active program or has applied for federal assistance in a public housing, Section 8, or redevelopment program within 12 months after its establishment.\n(g) Notwithstanding the other provisions of this subdivision, an authority administering and carrying out a leased existing housing assistance payments program, under Section 8 of the United States Housing Act of 1937, United States Code, title 42, section 1437f, as amended, may administer the leased existing housing assistance payments program under the statutory and regulatory portability provisions of the federal Section 8 existing housing assistance payments program, United States Code, title 42, section 1437f(r), as amended.\nAll projects shall be subject to the planning, zoning, sanitary, and building laws, ordinances, and regulations applicable to the locality in which the project is situated.\nAn authority may include in any contract with the federal government provision for veterans' and service persons' preferences that may be required by any federal law or regulation as a condition of federal financial assistance for a project.\nMS 1988 [Repealed, 1989 c 335 art 1 s 270]\nAn authority may develop and administer a housing rehabilitation loan and grant program with respect to property located anywhere within its boundaries which is owned by persons of low and moderate income, on the terms and conditions it determines.\n(a) An authority may develop and administer an interest reduction program to assist the financing of the construction, rehabilitation, and purchase of housing units which are intended primarily for occupancy by individuals of low or moderate income and related and subordinate facilities.\n(b) An authority may:\n(1) pay in periodic payments or in a lump-sum payment any or all of the interest on loans made pursuant to chapter 462C or subdivision 6;\n(2) pay any or all of the interest on bonds issued pursuant to chapter 462C, or pursuant to sections 469.001 to 469.047 for the purpose of making loans authorized by subdivision 6;\n(3) pay in periodic payments or in a lump-sum payment any or all of the interest on loans made by private lenders to purchasers of housing units;\n(4) pay any or all of the interest due on loans made by private lenders to a developer for the construction or rehabilitation of housing units;\n(5) pay in periodic payments or in a lump-sum payment any or all of the interest on loans made by any person to a developer for the construction, rehabilitation, and purchase of commercial facilities which are related and subordinate to the construction, rehabilitation, or purchase of housing units that receive interest reduction assistance provided that the entire development is composed primarily of housing units;\n(6) pay any or all of the interest on bonds issued pursuant to sections 469.152 to 469.165, when the bonds are issued for a project that is related and subordinate to the construction, rehabilitation, or purchase of housing units that receive interest reduction assistance provided that the entire development is composed primarily of housing units;\n(7) pay in periodic payments or in a lump-sum payment any or all of the interest on loans made pursuant to section 469.184 for the rehabilitation or preservation of small- and medium-sized commercial buildings; and\n(8) pay any or all of the interest on bonds issued pursuant to section 469.184.\n(a) In developing the interest reduction program authorized by subdivision 7 the authority shall consider:\n(1) the availability and affordability of other governmental programs;\n(2) the availability and affordability of private market financing; and\n(3) the need for additional affordable mortgage credit to encourage the construction and enable the purchase of housing units within the jurisdiction of the authority.\n(b) The authority shall adopt rules for the interest reduction program. Interest reduction assistance shall not be provided if the authority determines that financing for the purchase of a housing unit or for the construction or rehabilitation of housing units is otherwise available from private lenders upon terms and conditions that are affordable by the applicant, as provided by the authority in its rules.\n(c) For the purposes of this subdivision an \"assisted housing unit\" is a housing unit which is rented or to be rented and which is a part of a rental housing development where the financing for the rental housing development is assisted with interest reduction assistance provided by the authority during the calendar year.\n(d) If interest reduction assistance is provided for construction period interest for a rental housing development, the housing units in the housing development shall be considered assisted housing units for a period after occupancy of the housing units which is equal to the period during which interest reduction assistance is provided to assist the construction financing of the rental housing development.\n(e) In any calendar year when an authority provides interest reduction assistance for assisted housing units:\n(1) at least 20 percent of the total assisted housing units within the jurisdiction of the authority shall be held available for rental to families or individuals with an adjusted gross income which is equal to or less than 80 percent of the median family income; and\n(2) at least an additional 55 percent of the total assisted housing units within the jurisdiction of the authority shall be held available for rental to individuals or families with an annual adjusted gross income which is equal to or less than 66 times 120 percent of the monthly fair market rent for the unit established by the United States Department of Housing and Urban Development.\n(f) At least 80 percent of the aggregate dollar amount of funds appropriated by an authority within any calendar year to provide interest reduction assistance for financing of construction, rehabilitation, or purchase of single-family housing, as that term is defined in section 462C.02, subdivision 4, shall be appropriated for housing units that are to be sold to or occupied by families or individuals with an adjusted gross income which is equal to or less than 110 percent of median family income.\n(g) For the purposes of this subdivision, \"median family income\" means the median family income established by the United States Department of Housing and Urban Development for the nonmetropolitan county or the standard metropolitan statistical area, as the case may be.\n(h) The adjusted gross income must be adjusted by the authority for family size.\n(i) The limitations imposed upon assisted housing units by this subdivision do not apply to interest reduction assistance for a rental housing development located in a targeted area as defined in section 462C.02.\n(j) An authority that establishes a program pursuant to this subdivision shall by January 2 each year report to the commissioner of employment and economic development a description of the program established and a description of the recipients of interest reduction assistance.\n(a) Under any interest reduction program authorized by subdivision 7 which provides interest reduction assistance pursuant to paragraph (b), clauses (1) to (6), the authority shall obtain an agreement from the developer or other benefited owner of the property. The agreement shall provide that, upon the benefited owner's sale or transfer of the property, the authority shall be paid in an amount determined under paragraph (c) and that this obligation is secured by an interest in the property. The interest in the property shall consist of either a right of co-ownership or a lien or mortgage against the property and may be subordinate to other interests in the property.\n(b) For purposes of this subdivision, \"property\" means property the construction, acquisition, or improvement of which is financed in whole or part with the proceeds of a loan upon which the interest payments are reduced under an interest reduction program.\n(c) The amount required to be paid to the authority under paragraph (a) shall equal at least:\n(1) the sale price of the property,\n(2) less the downpayment, any payments of principal, other payments made to construct, acquire, or improve the property and any outstanding liens or mortgages securing loans, advances, or goods and services provided for the construction, acquisition, or improvement of the property,\n(3) less the amount, if any, which the authority determines should be allowed for the developer or other benefited property owner as a return on the developer's or other benefited property owner's investment in the property,\n(4) multiplied by a fraction, the numerator of which is the interest reduction payments made by the authority and the denominator of which is the total of the downpayment, all principal and interest payments including any portion paid by the authority, and other payments made to construct, acquire, or improve the property. In the case of a transfer, other than an arm's-length sale, an appraisal shall be substituted for the sale price.\n(d) If the interest reduction payments are made for a bond issue, or other obligation, the proceeds of which are lent to five or more purchasers of separate housing units, the fraction under paragraph (c), clause (4), may be determined on the basis of an estimate of the aggregate factors for all the borrowers of the proceeds, of the bonds or other obligations participating in the interest reduction program.\n(e) The provisions of this subdivision shall not apply to interest reduction assistance provided for construction period interest for housing units which are to be sold upon completion to purchasers who intend at the time of purchase to occupy the housing units as their principal place of residence.\nMS 1987 Supp [Repealed, 1988 c 551 s 1]\nExcept as expressly limited by the special law establishing the authority, an authority created pursuant to special law shall have the powers granted by any statute to any authority created pursuant to this chapter.\nAn authority may operate and maintain public parking facilities in connection with any of its projects.\n(a) An authority may develop and administer a down payment assistance loan and grant program with respect to property located within its boundaries on terms and conditions it determines.\n(b) Before carrying out a down payment assistance loan and grant program, an authority must find that the program is necessary in the areas in which it is made available in furtherance of a policy of the authority to promote economic integration or to encourage owner occupancy of single family residences.",
	"repealed": false
}