{
	"id": "401.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.08",
	"title": "401.08 CORRECTIONS ADVISORY BOARD.",
	"text": "A corrections advisory board must consist of at least nine members who must be representative of law enforcement, prosecution, the judiciary, education, corrections, different ethnicities, the social services, and the general public.\n(a) The members of a corrections advisory board must:\n(1) be appointed by the board of county commissioners, respective Tribal Nation government, or the joint board in the case of multiple counties or Tribal Nations;\n(2) serve for terms of two years; and\n(3) remain in office until their successors are duly appointed.\n(b) A board may elect its own officers.\nIf two or more counties or Tribal Nations combine to become a CCA jurisdiction, the joint corrections advisory board must contain representation as provided under subdivision 1, but the board members may come from each of the participating counties or Tribal Nations as may be determined by agreement of the counties or Tribal Nations.\nA corrections advisory board must:\n(1) actively participate in formulating the comprehensive plan for developing, implementing, and operating correctional programming and services under this chapter; and\n(2) make a formal recommendation to the CCA jurisdiction at least annually on the comprehensive plan and its implementation during the ensuing year.\n(a) If a corrections advisory board carries out its duties with a committee structure, the composition of each committee or subgroup should reflect the membership of the entire board.\n(b) All proceedings of the corrections advisory board and any board committee or other subgroup of the board must be open to the public, and all votes taken of board members must be recorded and become matters of public record.\nA corrections advisory board must adopt and implement rules on member attendance at board meetings. A rule under this subdivision does not meet the definition of a rule under section 14.02, subdivision 4.",
	"repealed": false
}