{
	"id": "245C.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.21",
	"title": "245C.21 REQUESTING RECONSIDERATION OF DISQUALIFICATION.",
	"text": "An individual who is the subject of a disqualification may request a reconsideration of the disqualification pursuant to this section. The individual must submit the request for reconsideration to the commissioner in writing.\n(a) For disqualifications related to studies conducted by county agencies for family child care, and for disqualifications related to studies conducted by the commissioner for child foster care, adult foster care, and family adult day services when the applicant or license holder resides in the home where services are provided, the individual shall submit the request for reconsideration to the county agency that initiated the background study.\n(b) For disqualifications related to studies conducted by the commissioner for child foster care providers monitored by private licensing agencies under section 245A.16, the individual shall submit the request for reconsideration to the private agency that initiated the background study.\n(c) A reconsideration request shall be submitted within 30 days of the individual's receipt of the disqualification notice.\n(d) The county or private agency shall forward the individual's request for reconsideration and provide the commissioner with a recommendation whether to set aside the individual's disqualification.\n(a) When the commissioner sends an individual a notice of disqualification based on a finding under section 245C.16, subdivision 2, paragraph (a), clause (1) or (2), the disqualified individual must submit the request for a reconsideration within 30 calendar days of the individual's receipt of the notice of disqualification. If mailed, the request for reconsideration must be postmarked and sent to the commissioner within 30 calendar days of the individual's receipt of the notice of disqualification. If a request for reconsideration is made by personal service, it must be received by the commissioner within 30 calendar days after the individual's receipt of the notice of disqualification. Upon showing that the information under subdivision 3 cannot be obtained within 30 days, the disqualified individual may request additional time, not to exceed 30 days, to obtain the information.\n(b) When the commissioner sends an individual a notice of disqualification based on a finding under section 245C.16, subdivision 2, paragraph (a), clause (3), the disqualified individual must submit the request for reconsideration within 30 calendar days of the individual's receipt of the notice of disqualification. If mailed, the request for reconsideration must be postmarked and sent to the commissioner within 30 calendar days of the individual's receipt of the notice of disqualification. If a request for reconsideration is made by personal service, it must be received by the commissioner within 30 calendar days after the individual's receipt of the notice of disqualification.\n(c) An individual who was determined to have maltreated a child under chapter 260E or a vulnerable adult under section 626.557, and who is disqualified on the basis of serious or recurring maltreatment, may request a reconsideration of both the maltreatment and the disqualification determinations. The request must be submitted within 30 calendar days of the individual's receipt of the notice of disqualification. If mailed, the request for reconsideration must be postmarked and sent to the commissioner within 30 calendar days of the individual's receipt of the notice of disqualification. If a request for reconsideration is made by personal service, it must be received by the commissioner within 30 calendar days after the individual's receipt of the notice of disqualification.\n(d) Except for family child care and child foster care, reconsideration of a maltreatment determination under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of a disqualification under section 245C.22, shall not be conducted when:\n(1) a denial of a license under section 245A.05, or a licensing sanction under section 245A.07, is based on a determination that the license holder is responsible for maltreatment or the disqualification of a license holder based on serious or recurring maltreatment;\n(2) the denial of a license or licensing sanction is issued at the same time as the maltreatment determination or disqualification; and\n(3) the license holder appeals the maltreatment determination, disqualification, and denial of a license or licensing sanction. In such cases, a fair hearing under section 256.045 must not be conducted under sections 245C.27, 260E.33, and 626.557, subdivision 9d. Under section 245A.08, subdivision 2a, the scope of the consolidated contested case hearing must include the maltreatment determination, disqualification, and denial of a license or licensing sanction.\nNotwithstanding clauses (1) to (3), if the license holder appeals the maltreatment determination or disqualification, but does not appeal the denial of a license or a licensing sanction, reconsideration of the maltreatment determination shall be conducted under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of the disqualification shall be conducted under section 245C.22. In such cases, a fair hearing shall also be conducted as provided under sections 245C.27, 260E.33, and 626.557, subdivision 9d.\n(a) The disqualified individual requesting reconsideration must submit information showing that:\n(1) the information the commissioner relied upon in determining the underlying conduct that gave rise to the disqualification is incorrect;\n(2) for maltreatment, the information the commissioner relied upon in determining that maltreatment was serious or recurring is incorrect; or\n(3) the subject of the study does not pose a risk of harm to any person served by the applicant, license holder, or other entities as provided in this chapter, by addressing the information required under section 245C.22, subdivision 4.\n(b) In order to determine the individual's risk of harm, the commissioner may require additional information from the disqualified individual as part of the reconsideration process. If the individual fails to provide the required information, the commissioner may deny the individual's request.\nUpon request, the commissioner may inform the applicant, license holder, or other entities as provided in this chapter who received a notice of the individual's disqualification under section 245C.17, subdivision 3, or has the consent of the disqualified individual, whether the disqualified individual has requested reconsideration.",
	"repealed": false
}