{
	"id": "571.931",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.931",
	"title": "571.931 PREJUDGMENT GARNISHMENT BEFORE NOTICE AND HEARING.",
	"text": "A creditor seeking a prejudgment garnishment order in extraordinary circumstances to secure property before the hearing specified in section 571.932 shall proceed by written application. The application must be accompanied by affidavits or by oral testimony, or both, setting forth in detail:\n(1) the basis and the amount of the claim in the civil action;\n(2) the facts which constitute the conditions for prejudgment garnishment as specified in section 571.93, subdivision 1; and\n(3) a good faith estimate, based on facts known to the creditor, of any harm that would be suffered by the debtor if a prejudgment garnishment order is entered without notice and hearing.\nA prejudgment garnishment order may be issued before the hearing specified in subdivision 4 only if the following conditions are met:\n(1) the creditor has made a good faith effort to inform the debtor of the application for a prejudgment garnishment order or that informing the debtor would endanger the ability of the creditor to recover upon a judgment subsequently awarded;\n(2) the creditor has demonstrated the probability of success on the merits;\n(3) the creditor has demonstrated the existence of one or more of the grounds specified in section 571.93, subdivision 1; and\n(4) due to extraordinary circumstances, the creditor's interests cannot be protected pending a hearing by an appropriate order of the court, other than by directing a prehearing seizure of property.\nAll prejudgment garnishment orders must:\n(1) state the names and addresses of all persons whose affidavits were submitted to the court and of all witnesses who gave oral testimony;\n(2) contain specific findings of fact, based upon competent evidence presented either in the form of affidavits or oral testimony, supporting the conclusion that each of the conditions in subdivision 1 have been met;\n(3) be narrowly drafted to minimize any harm to the debtor as a result of the seizure of the debtor's property; and\n(4) provide for the bond required by section 571.932, subdivision 6.\nIf the court issues a prejudgment garnishment order, the order must establish a date for a hearing at which the debtor may be heard. The subsequent hearing must be conducted at the earliest practicable time. At the hearing, the burden of proof is on the creditor to establish the grounds justifying the prejudgment garnishment order.\nThe hearing held pursuant to subdivision 4 must be conducted in accordance with the standards established in section 571.932. In addition, if the court finds that the motion for a prejudgment garnishment order was made in bad faith, the court shall award debtor the actual damages, costs, and reasonable attorney's fees, suffered by reason of the prejudgment garnishment.\nThe debtor shall be served with a copy of the prejudgment garnishment order issued pursuant to this section together with a copy of all pleadings and other documents not previously served, including any affidavits upon which the claimant intends to rely at the subsequent hearing and a transcript of any oral testimony given at the prejudgment garnishment hearing upon which the creditor intends to rely and a notice of hearing. Service must be in the manner prescribed for personal service of a summons unless that service is impracticable or would be ineffective and the court prescribes an alternative method of service calculated to provide actual notice to the debtor.\nThe notice of hearing served upon the debtor must be signed by the creditor or the attorney for the creditor and must be accompanied by an exemption notice. The notice of hearing must be accompanied by an exemption notice, and both notices must provide, at a minimum, the following information in substantially the following language:\nNOTICE OF HEARING\nTO: (the debtor)\nThe (insert the name of court) Court has ordered the prejudgment garnishment of some of your property in the possession or control of a third party. Some of your property may be exempt from seizure. See the exemption notice below.\nThe Court issued this Order based upon the claim of (insert name of creditor) that (insert name of creditor) is entitled to a court order for garnishment of your property to secure your payment of any money judgment that (insert name of creditor) may later be obtained against you and that immediate action was necessary.\nYou have the legal right to challenge (insert name of creditor) claims at a court hearing before a judge. The hearing will be held at the (insert place) on (insert date) at (insert time). You may attend the court hearing alone or with an attorney. After you have presented your side of the matter, the court will decide what should be done with your property until the lawsuit against you is finally decided.\nIF YOU DO NOT ATTEND THIS HEARING, THE COURT MAY ORDER GARNISHMENT OF YOUR PROPERTY.\nEXEMPTION NOTICE\nSome of your property may be exempt and cannot be garnished. The following is a list of some of the more common exemptions. It is not complete and is subject to section 550.37, and other state and federal laws. If you have questions about an exemption, you should obtain competent legal advice.\n(1) A homestead or the proceeds from the sale of a homestead.\n(2) Household furniture, appliances, phonographs, radios, and televisions up to a total current value of $4,500 at the time of attachment.\n(3) A manufactured (mobile) home used as your home.\n(4) One motor vehicle currently worth less than $2,000 after deducting any security interests.\n(5) Farm machinery used by someone principally engaged in farming, or tools, machines, or office furniture used in your business or trade. This exemption is limited to $10,000.\n(6) Relief based on need. This includes the Minnesota Family Investment Program (MFIP), Emergency Assistance (EA), Work First Program, Medical Assistance (MA), General Assistance (GA), Emergency General Assistance (EGA), Minnesota Supplemental Aid (MSA), MSA Emergency Assistance (MSA-EA), Supplemental Security Income (SSI), and Energy Assistance.\n(7) Social Security benefits.\n(8) Unemployment benefits, workers' compensation, or veterans' benefits.\n(9) An accident, disability or retirement pension or annuity.\n(10) Life insurance proceeds.\n(11) The earnings of your minor child.\n(12) Money from a claim for damage or destruction of exempt property (such as household goods, farm tools, business equipment, a manufactured (mobile) home, or a car).",
	"repealed": false
}