{
	"id": "62S.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.26",
	"title": "62S.26 LOSS RATIO.",
	"text": "The minimum loss ratio must be at least 60 percent, calculated in a manner which provides for adequate reserving of the long-term care insurance risk. In evaluating the expected loss ratio, the commissioner shall give consideration to all relevant factors, including:\n(1) statistical credibility of incurred claims experience and earned premiums;\n(2) the period for which rates are computed to provide coverage;\n(3) experienced and projected trends;\n(4) concentration of experience within early policy duration;\n(5) expected claim fluctuation;\n(6) experience refunds, adjustments, or dividends;\n(7) renewability features;\n(8) all appropriate expense factors;\n(9) interest;\n(10) experimental nature of the coverage;\n(11) policy reserves;\n(12) mix of business by risk classification; and\n(13) product features such as long elimination periods, high deductibles, and high maximum limits.\nSubdivision 1 shall not apply to life insurance policies that accelerate benefits for long-term care. A life insurance policy that funds long-term care benefits entirely by accelerating the death benefit is considered to provide reasonable benefits in relation to premiums paid, if the policy complies with all of the following provisions:\n(1) the interest credited internally to determine cash value accumulations, including long-term care, if any, are guaranteed not to be less than the minimum guaranteed interest rate for cash value accumulations without long-term care set forth in the policy;\n(2) the portion of the policy that provides life insurance benefits meets the nonforfeiture requirements of section 61A.24;\n(3) the policy meets the disclosure requirements of sections 62S.09, 62S.10, and 62S.11;\n(4) any policy illustration that meets the applicable requirements of the NAIC Life Insurance Illustrations Model Regulation; and\n(5) an actuarial memorandum is filed with the commissioner that includes:\n(i) a description of the basis on which the long-term care rates were determined;\n(ii) a description of the basis for the reserves;\n(iii) a summary of the type of policy, benefits, renewability, general marketing method, and limits on ages of issuance;\n(iv) a description and a table of each actuarial assumption used. For expenses, an insurer must include percentage of premium dollars per policy and dollars per unit of benefits, if any;\n(v) a description and a table of the anticipated policy reserves and additional reserves to be held in each future year for active lives;\n(vi) the estimated average annual premium per policy and the average issue age;\n(vii) a statement as to whether underwriting is performed at the time of application. The statement shall indicate whether underwriting is used and, if used, the statement shall include a description of the type or types of underwriting used, such as medical underwriting or functional assessment underwriting. Concerning a group policy, the statement shall indicate whether the enrollee or any dependent will be underwritten and when underwriting occurs; and\n(viii) a description of the effect of the long-term care policy provision on the required premiums, nonforfeiture values, and reserves on the underlying life insurance policy, both for active lives and those in long-term care claim status.\nThis section does not apply to policies or certificates that are subject to sections 62S.021, 62S.081, and 62S.265, and that comply with those sections.",
	"repealed": false
}