{
	"id": "346.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.40",
	"title": "346.40 PET BIRDS.",
	"text": "Birds must be fed at least once each day except as otherwise required to provide adequate health care. The food must be wholesome, palatable, and of sufficient quantity and nutritive value to meet the normal daily requirements for the condition and size of the bird, and must be free from contamination.\nExcept for birds in shipment for less than four hours, all birds must be provided with clean, potable water in sufficient quantity to satisfy the bird's needs or supplied by free choice. Snow or ice is not an adequate water source.\nBirds may be transported only in containers constructed of a smooth, durable material. Containers must:\n(a) be suitable for the species being shipped;\n(b) be constructed to prevent escape or chewing of the container by the bird that may be injurious to the health of the bird;\n(c) have ventilation on only one side to prevent cross drafts;\n(d) provide enough space for the bird to stand up, turn around, and obtain necessary food, water, and roosting space;\n(e) have fresh food and water available to the bird at all times if the shipping period exceeds four hours.\nA shelter or cage for a bird must be constructed of materials that are impervious to moisture and can be readily cleaned. Perches or other space must be provided to allow the bird to roost without physical harassment from other birds.\nRoom must be provided for a bird to obtain exercise to maintain itself in good health.\nA confinement area must be maintained at a temperature suitable for the bird involved.\nA bird shelter or cage must provide ventilation with minimized drafts, odors, and moisture condensation.\nShelters or cages for birds must have at least eight hours of either natural or artificial light to allow for intake of food and water. Lighting must be of sufficient intensity and distribution to permit routine inspection and cleaning on a regular basis.\nExcreta must be removed from the bottom of a bird cage on a regular basis to prevent the contamination of the caged bird. The cage, perches, and food and water receptacles must be cleaned on a regular basis.",
	"repealed": false
}