{
	"id": "268B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.11",
	"title": "268B.11 SELF-EMPLOYED AND INDEPENDENT CONTRACTOR ELECTION OF COVERAGE.",
	"text": "(a) A self-employed individual or independent contractor may file with the commissioner by electronic transmission in a format prescribed by the commissioner an application to be entitled to benefits under this chapter for a period not less than 104 consecutive calendar weeks. Upon the approval of the commissioner, sent by United States mail or electronic transmission, the individual is entitled to benefits under this chapter beginning the calendar quarter after the date of approval or beginning in a later calendar quarter if requested by the self-employed individual or independent contractor. The individual ceases to be entitled to benefits as of the first day of January of any calendar year only if, at least 30 calendar days before the first day of January, the individual has filed with the commissioner by electronic transmission in a format prescribed by the commissioner a notice to that effect.\n(b) The commissioner may terminate any application approved under this section with 30 calendar days' notice sent by United States mail or electronic transmission if the self-employed individual is delinquent on any premiums due under this chapter. If an approved application is terminated in this manner during the first 104 consecutive calendar weeks of election, the self-employed individual remains obligated to pay the premium under subdivision 3 for the remainder of that 104-week period.\nA self-employed individual who applies for coverage under this section must provide the commissioner with (1) the amount of the individual's net earnings from self-employment, if any, from the most recent taxable year and all tax documents necessary to prove the accuracy of the amounts reported, and (2) any other documentation the commissioner requires. A self-employed individual who is covered under this chapter must annually provide the commissioner with the amount of the individual's net earnings from self-employment within 30 days of filing a federal income tax return.\nA self-employed individual who elects to receive coverage under this chapter must annually pay a premium as provided in section 268B.14, subdivision 6, clause (1), times the lesser of:\n(1) the individual's self-employment premium base; or\n(2) the maximum earnings subject to the FICA Old-Age, Survivors, and Disability Insurance tax.\nNotwithstanding anything to the contrary, a self-employed individual who has applied to and been approved for coverage by the commissioner under this section is entitled to benefits on the same basis as an employee under this chapter, except that a self-employed individual's weekly benefit amount under section 268B.04, subdivision 1, must be calculated as a percentage of the self-employed individual's self-employment premium base, rather than wages.",
	"repealed": false
}