{
	"id": "256G.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256G.01",
	"title": "256G.01 APPLICATION; CITATION; COVERAGE.",
	"text": "This chapter governs the Minnesota human services system. The system includes the Department of Human Services, Direct Care and Treatment, local social services agencies, county welfare agencies, human service boards, community mental health center boards, state hospitals, state nursing homes, and persons, agencies, institutions, organizations, and other entities under contract to any of those agencies to the extent specified in the contract.\nThis chapter may be cited as the \"Minnesota Unitary Residence and Financial Responsibility Act.\"\nThis chapter applies to all social service programs administered by the commissioner of human services or the Direct Care and Treatment executive board in which residence is the determining factor in establishing financial responsibility. These include, but are not limited to: commitment proceedings, including voluntary admissions; emergency holds; poor relief funded wholly through local agencies; social services, including title XX, IV-E and section 256K.10; social services programs funded wholly through the resources of county agencies; social services provided under the Minnesota Indian Family Preservation Act, sections 260.751 to 260.781; costs for delinquency confinement under section 393.07, subdivision 2; service responsibility for these programs; and housing support under chapter 256I.\nThe provisions in sections 256G.02, subdivision 4, paragraphs (a) to (d); 256G.02, subdivisions 5 to 8; 256G.03; 256G.04; 256G.05; and 256G.07, subdivisions 1 to 3, apply to the following programs: the aid to families with dependent children program formerly codified in sections 256.72 to 256.87, Minnesota family investment program; medical assistance; general assistance; the family general assistance program formerly codified in sections 256D.01 to 256D.23; general assistance medical care formerly codified in chapter 256D; and Minnesota supplemental aid.\nUnless stated otherwise, the provisions of this chapter also apply to disputes involving financial responsibility for social services when another definition of the county of financial responsibility has been created in Minnesota Statutes.",
	"repealed": false
}