{
	"id": "51A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.04",
	"title": "51A.04 ORGANIZATION OF MUTUAL ASSOCIATIONS.",
	"text": "The incorporators of a mutual association shall appoint one of their number as chair of the incorporators. The incorporators, before a certificate of incorporation is issued, shall pay in cash to the chair, as subscriptions to the savings accounts of the proposed association, including that part of the original subscription paid by the chair, an aggregate amount, not less than $100,000; provided the commissioner may require a larger amount to be paid in.\nThe chair of the incorporators shall procure from a surety company or other surety acceptable to the commissioner, a surety bond in form approved by the commissioner in an amount at least equal to the amount subscribed by the incorporators plus the expense fund. The bond shall name the commissioner as obligee and shall be delivered to the commissioner. It shall assure the safekeeping of the funds subscribed and their delivery to the association after the issuance of the certificate of incorporation and after the bonding of the officers. In the event of the failure to complete organization, the bond shall assure the return of the amounts collected to the respective subscribers or their assigns, less reasonable expense which shall be deducted from the expense fund.\nThe incorporators, in addition to their subscriptions to savings accounts, shall create an expense fund in an amount not less than one-half of the minimum amount of savings account subscriptions required to be paid in under sections 51A.01 to 51A.57, from which expense fund the expense of organizing the association and its operating expenses may be paid until the time its net income is sufficient to pay the earnings declared and paid or credited to its savings account holders from sources available for payment of earnings. The incorporators and others, before a certificate of incorporation is issued, shall deposit to the credit of the chair of the incorporators and others shall not constitute a liability of the association except as hereinafter provided.\nContributions made by the incorporators and others to the expense fund may be repaid pro rata to the contributors from the net income of the association after provision for statutory reserves and declaration of earnings of not less than two percent on savings accounts. In case of the liquidation of an association before contributions to the expense fund have been repaid, any contributions to the expense fund remaining unexpended, after the payment of expenses of liquidation, all creditors, and the withdrawal value of all savings accounts, shall be repaid to the contributors pro rata. The books of the association shall reflect the expense fund. Contributors to the expense fund shall at the times earnings regularly are distributed to savings account holders be paid earnings on the amounts paid in by them and for this purpose the contributions shall in all respects be considered as savings accounts of the association.\nWithin 30 days after the corporate existence of an association begins, the directors of the association shall hold an organization meeting and shall elect officers pursuant to the provisions of sections 51A.01 to 51A.57 and the bylaws. At the organization meeting the directors shall take other action as appropriate in connection with beginning the transaction of business by the association. The commissioner may extend by order the time within which the organization meeting shall be held.",
	"repealed": false
}