{
	"id": "124E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.02",
	"title": "124E.02 DEFINITIONS.",
	"text": "(a) For purposes of this chapter, the terms defined in this section have the meanings given them.\n(b) \"Affidavit\" means a written statement the authorizer submits to the commissioner for approval to establish a charter school under section 124E.06, subdivision 4, attesting to its review and approval process before chartering a school.\n(c) \"Affiliate\" means a person that directly or indirectly, through one or more intermediaries, controls, is controlled by, or is under common control with another person.\n(d) \"Charter management organization\" or \"CMO\" means a nonprofit entity or organization that operates or manages a charter school or a network of charter schools or can control all or substantially all of a school's education program or a school's administrative, financial, business, or operational functions.\n(e) \"Control\" means the ability to affect the management, operations, or policy actions or decisions of a person, whether by owning voting securities, by contract, or otherwise.\n(f) \"Educational management organization\" or \"EMO\" means a for-profit entity or organization that operates or manages a charter school or a network of charter schools or can control all or substantially all of a school's education program, or a school's administrative, financial, business, or operational functions.\n(g) \"Immediate family member\" means any relationship by blood, marriage, adoption, or partnership of spouses, parents, grandparents, siblings, children, first cousins, aunts, uncles, grandchildren, nieces, and nephews.\n(h) \"Market need and demand study\" means a study that includes the following for the proposed locations of the school or additional site:\n(1) current and projected demographic information;\n(2) student enrollment patterns;\n(3) information on existing schools and types of educational programs currently available;\n(4) characteristics of proposed students and families;\n(5) availability of properly zoned and classified facilities; and\n(6) quantification of existing demand for the school or site.\n(i) \"Person\" means an individual or entity of any kind.\n(j) \"Related party\" means an affiliate or immediate family member of the other interested party, an affiliate of an immediate family member who is the other interested party, or an immediate family member of an affiliate who is the other interested party.\n(k) For purposes of this chapter, the terms defined in section 120A.05 have the same meanings.",
	"repealed": false
}