{
	"id": "15B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.11",
	"title": "15B.11 ADVISORY COMMITTEE ON ARCHITECTURE AND PLANNING.",
	"text": "The board must not approve a plan for a new public building under section 15B.10 or 15B.13 unless it first receives the comments and criticism of the advisory committee established under subdivision 2 or unless the plan is excepted from the consideration of the advisory committee under section 15B.10, subdivision 4, paragraph (c).\n(a) A three-member advisory committee to the CAAPB is established. Each of the three must be either an architect or a planner. One must be appointed by the CAAPB; one, by the State Board of the Arts; and one, by the Minnesota Society of the American Institute of Architects.\n(b) The advisory committee must advise the CAAPB on all architectural and planning matters.\n(c) An advisory committee member must not be a contestant in a CAAPB competition.\n(a) The advisory committee's comments and criticism under subdivision 1 are public data under section 13.03, subdivision 1.\n(b) To advise the board on all architectural and planning matters, the advisory committee must be kept current about, and have access to, all data relating to the Capitol Area as the data is developed or being prepared. Some examples of these types of data are plans, studies, reports, and proposals.\n(c) The obligation under paragraph (b) extends to data developed or being prepared by (1) the commissioner of administration; (2) the commissioner of employment and economic development; (3) the Metropolitan Council; (4) the city of St. Paul; or (5) one who is an architect, planner, agency, or organization and who is engaged in any work or planning relating to the Capitol Area.\n(d) Paragraph (c), clause (5), applies to all the developers or preparers whether they are public or private and whether or not they are retained by the board.\n(e) If the data described in paragraph (b) is from a public employee or public agency it must be filed with the board promptly after it is prepared.\n(f) The board may employ a reasonable amount of clerical and technical help to assist the committee to do its duties.\n(g) When directed by the board, the advisory committee may serve as, or any of its members may serve on, the jury for a competition or as the architectural advisor for a competition under section 15B.10.\n(h) The board must get the advice of its advisory committee before selecting the architectural advisor or jurors for a competition.",
	"repealed": false
}