{
	"id": "115D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/115D.07",
	"title": "115D.07 TOXIC POLLUTION PREVENTION PLANS.",
	"text": "(a) Persons who operate a facility required by United States Code, title 42, section 11023, or section 299K.08, subdivision 3, to submit a toxic chemical release form shall prepare a toxic pollution prevention plan for that facility. A facility that is required to submit a toxic chemical release form but does not release a toxic chemical is exempt from the requirements of this subdivision. The plan must contain the information listed in subdivision 2.\n(b) Except as provided in paragraphs (d) and (e), for facilities that release a total of 10,000 pounds or more of toxic pollutants annually, the plan must be completed as follows:\n(1) on or before July 1, 1991, for facilities having a two-digit standard industrial classification of 35 to 39;\n(2) by January 1, 1992, for facilities having a two-digit standard industrial classification of 28 to 34; and\n(3) by July 1, 1992, for all other persons required to prepare a plan under this subdivision.\n(c) Except as provided in paragraphs (d) and (e), facilities that release less than a total of 10,000 pounds of toxic pollutants annually must complete their plans by July 1, 1992.\n(d) For the following facilities, the plan must be completed as follows:\n(1) by January 1, 1995, for facilities required to report under section 299K.08, subdivision 3, that have a two-digit standard industrial classification of 01 to 50; and\n(2) by January 1, 1996, for facilities required to report under section 299K.08, subdivision 3, that have a two-digit standard industrial classification of 51 to 99.\n(e) For facilities that become subject to this subdivision after July 1, 1993, the plan must be completed by six months after the first submittal for the facility under United States Code, title 42, section 11023, or section 299K.08, subdivision 3.\n(f) Each plan must be updated by January 1 of every even-numbered year and must be maintained at the facility to which it pertains.\n(a) Each toxic pollution prevention plan must establish a program identifying the specific technically and economically practicable steps that could be taken during at least the three years following the date the plan is due, to eliminate or reduce the generation or release of toxic pollutants reported by the facility. Toxic pollutants resulting solely from research and development activities need not be included in the plan.\n(b) At a minimum, each plan must include:\n(1) a policy statement articulating upper management support for eliminating or reducing the generation or release of toxic pollutants at the facility;\n(2) a description of the current processes generating or releasing toxic pollutants that specifically describes the types, sources, and quantities of toxic pollutants currently being generated or released by the facility;\n(3) a description of the current and past practices used to eliminate or reduce the generation or release of toxic pollutants at the facility and an evaluation of the effectiveness of these practices;\n(4) an assessment of technically and economically practicable options available to eliminate or reduce the generation or release of toxic pollutants at the facility, including options such as changing the raw materials, operating techniques, equipment and technology, personnel training, and other practices used at the facility. The assessment may include a cost-benefit analysis of the available options;\n(5) a statement of objectives based on the assessment in clause (4) and a schedule for achieving those objectives. Wherever technically and economically practicable, the objectives for eliminating or reducing the generation or release of each toxic pollutant at the facility must be expressed in numeric terms based on a specified base year that is no earlier than 1987. Otherwise, the objectives must include a clearly stated list of actions designed to lead to the establishment of numeric objectives as soon as practicable;\n(6) an explanation of the rationale for each objective established for the facility;\n(7) a listing of options that were considered not to be economically and technically practicable; and\n(8) a certification, signed and dated by the facility manager and an officer of the company under penalty of section 609.63, attesting to the accuracy of the information in the plan.",
	"repealed": false
}