{
	"id": "214.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.035",
	"title": "214.035 LICENSING DISQUALIFICATIONS; PRELIMINARY APPLICATIONS; REPORTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Conviction\" has the meaning given in section 609.02, subdivision 5.\n(c) \"Criminal record\" means a record of an arrest, prosecution, criminal proceeding, or conviction.\n(d) \"State licensor\" or \"licensor\" means a state agency or examining and licensing board that issues an occupational or professional license, registration, or certificate and considers before issuing the license, registration, or certificate any criminal record or conviction of an applicant that may make an applicant ineligible to receive the license, registration, or certificate.\n(a) This section does not apply to a license, registration, or certificate issued by a state licensor if the license, registration, or certificate does not require an applicant to report to the state licensor as part of the application process the applicant's criminal record or does not require an applicant to obtain a criminal background check or study as part of the application process to obtain the license, registration, or certificate.\n(b) This section does not apply to a license, registration, or certificate issued by the Professional Educator Licensing and Standards Board, the Department of Health, Department of Human Services, or any health-related licensing board, as defined in section 214.01, subdivision 2.\n(c) The preliminary application process described under this section may only be utilized by an individual who has a criminal record.\n(a) Notwithstanding any law to the contrary, all state licensors shall permit an individual to submit a preliminary application for a determination pursuant to this section as to whether a criminal record or conviction that may be considered by the state licensor under state law would make the individual ineligible to receive an occupational or professional license, registration, or certificate issued by the state licensor.\n(b) An applicant shall submit a preliminary application and any other supporting documents to the appropriate state licensor in a form and manner approved by the licensor. The state licensor may require that the applicant provide information about the applicant's criminal record in the form and manner approved by the licensor.\n(c) A state licensor may charge a fee to cover any expenses incurred in connection with processing a preliminary application, provided the fee does not exceed the actual cost to the state licensor of processing the application or the initial fee for the applicable license, registration, or certificate. If the applicant subsequently applies for the license, registration, or certificate, the amount of the preliminary application fee paid by the applicant must be credited toward the applicant's initial fee for the license, registration, or certificate. An applicant may request a waiver of this fee. A fee collected under this paragraph for the expenses incurred by the state licensor shall be deposited in the fund in the state treasury in which the state licensor deposits fees collected for issuing occupational or professional licenses, registrations, or certificates. If the state licensor does not collect a fee for issuing occupational or professional licenses, registrations, or certificates, any fee collected under this paragraph shall be deposited pursuant to section 214.06, subdivision 1.\n(d) Upon receipt of a completed preliminary application and any necessary supporting documents, the state licensor must determine under state law whether a criminal record or conviction that may be considered under state law would make the applicant ineligible to receive a professional or occupational license, registration, or certificate from the licensor. The state licensor must issue a written decision within 60 days of receiving a completed preliminary application. If the state licensor determines that a criminal record or conviction would make the applicant ineligible to receive a professional or occupational license, registration, or certificate, the written decision must:\n(1) state all reasons the professional or occupational license, registration, or certificate would be denied, including the standard used to make the decision; and\n(2) inform the applicant of any action or additional steps the applicant could take to qualify for a professional or occupational license, registration, or certificate.\n(e) If a state licensor determines that no criminal records or convictions would make the applicant ineligible to receive a professional or occupational license, registration, or certificate, that decision is binding on the licensor unless the decision is clearly erroneous under state law or:\n(1) the applicant is convicted of a crime or commits any other disqualifying act that may be considered by the state licensor under state law after submission of the preliminary application;\n(2) the applicant provided incomplete information in the preliminary application;\n(3) the applicant provided inaccurate or fraudulent information in the preliminary application; or\n(4) changes to state law were enacted after the date the decision was issued, making the applicant ineligible under state law to receive a license, registration, or certificate.\n(f) Nothing in this section precludes a licensor from issuing a license, registration, or certificate to an applicant that includes limitations or conditions on the license, registration, or certificate based on a criminal conviction or the alleged misconduct of the applicant.\n(g) By August 1 of each year, each state licensor shall submit to the commissioner of management and budget the number of applicants who submitted preliminary applications to the licensor in accordance with this section and the number of applicants who subsequently applied for a license, registration, or certificate for the previous fiscal year. The state licensor shall also submit the total amount of initial application fees that were not paid by these applicants pursuant to paragraph (c), or, if the licensor does not collect a fee for issuing a license, registration, or certificate, the cost of processing the preliminary application fee that was not covered pursuant to paragraph (c). Each fiscal year, an amount necessary to pay each state licensor the rest of each initial application fee or the rest of the cost of processing each preliminary application if an initial application fee was not collected by the licensor is appropriated from the general fund to the appropriate state licensor.\n(a) By January 15 of each year, every state licensor shall report to the Department of Employment and Economic Development on:\n(1) the number of individuals who applied for a professional or occupational license, registration, or certificate from the licensor;\n(2) the number of individuals described in clause (1) who were found to be ineligible due to a criminal record or conviction;\n(3) the number of individuals who submitted a preliminary application under this section; and\n(4) the number of individuals described in clause (3) who were found to be ineligible due to a criminal record or conviction.\n(b) On or before February 15 of each year, the commissioner of employment and economic development shall compile the reports received under paragraph (a) and provide the compiled reports to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over employment. The commissioner of employment and economic development must make the report readily available on the department's public website.",
	"repealed": false
}