{
	"id": "117.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.075",
	"title": "117.075 HEARING; COMMISSIONERS; ORDER FOR TAKING.",
	"text": "(a) Upon proof being filed of the service of such notice, the court, at the time and place therein fixed or to which the hearing may be adjourned, shall hear all competent evidence offered for or against the granting of the petition, regulating the order of proof as it may deem best.\n(b) If the taking is for the mitigation of a blighted area, remediation of an environmentally contaminated area, reducing abandoned property, or removing a public nuisance, then, notwithstanding any other provision of general or special law, a condemning authority must show the district court by preponderance of the evidence that the taking is necessary and for the designated public use.\n(c) A court order approving the public use or public purpose, necessity, and authority for the taking is final unless an appeal is brought within 60 days after service of the order on the party.\n(a) If the proposed taking shall appear to be necessary and such as is authorized by law, the court by an order shall appoint three disinterested commissioners, and at least two alternates, to ascertain and report the amount of damages that will be sustained by the several owners on account of such taking.\n(b) All disinterested commissioners or alternates appointed under this subdivision must reside in Minnesota.\nThe court shall inquire whether each prospective commissioner has any relationship, business or otherwise, to any of the parties in the proceeding, or any interest in the proceeding which may constitute a conflict of interest, or which may create the appearance of impropriety should that person be appointed. Responses to this inquiry must be either written or on the record and made available by the court to any party in the proceeding. No person who might have difficulty in rendering an unbiased decision may be appointed to serve. The court, in its discretion, may appoint one registered, practicing attorney to the commission who is knowledgeable in eminent domain matters. All other commissioners appointed must be persons actively engaged in the occupation of real estate sales or real estate appraising or persons knowledgeable in real estate values.\nThe order shall fix the time and place of the first meeting of the three commissioners and prescribe their compensation. At the first meeting at the office of the court administrator of district court the appointees must be sworn by the court administrator or an authorized deputy and shall take and sign the following oath before assuming their duties as commissioners:\n(TITLE OF PROCEEDING)\n................................. does swear under penalty of perjury as follows:\nI will faithfully and justly perform to the best of my ability, all the duties of the office and trust which I now assume as commissioner in the above entitled proceeding. I further swear that, except as disclosed in writing or on the record, I have no interest in any of the lands in the above proceeding or any present or past relationship, business or personal, with any of the parties to the above proceeding or any other actual or potential conflict of interest, and that I will render fair and impartial decisions, so help me God.\nThe order may, in the discretion of the court, limit the title or easement to be acquired by the petitioner by defining the rights and privileges which the owner of any of the lands may exercise therein in subordination to the public uses to which it is appropriated.\nIn case any commissioner fails to act or fails to meet the qualifications required by this section, the court without further notice may appoint another in that commissioner's place.\nThe court administrator of court in each county shall post in the courthouse in a prominent place a notice that a qualified person may apply to have the person's name placed upon a list of potential commission appointees for eminent domain proceedings. The notice must contain the language of the oath which the commissioners are required to take upon appointment and shall list the other qualifications set forth in this section. The court shall give due consideration to the names appearing on the list, but is not bound to make appointments from the list.",
	"repealed": false
}