{
	"id": "473.8441",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.8441",
	"title": "473.8441 LOCAL RECYCLING DEVELOPMENT PROGRAM.",
	"text": "\"Number of households\" has the meaning given in Minnesota Statutes 1992, section 477A.011, subdivision 3a.\nThe commissioner shall encourage the development of permanent local recycling programs throughout the metropolitan area. The commissioner shall make grants to qualifying metropolitan counties as provided in this section.\nGrants may be used to pay for planning, developing, and operating yard waste composting and recycling programs.\nThe commissioner shall administer grants so that the following conditions are met:\n(a) A county must apply for a grant in the manner determined by the commissioner. The application must describe the activities for which the grant will be used.\n(b) The activities funded must be consistent with the metropolitan policy plan and the county plan.\n(c) A grant must be matched by equal local expenditures for the activities for which the grant is made. A local expenditure may include, but is not limited to, an expenditure by a local unit of government, tribal government, or private sector or nonprofit organization.\n(d) All grant funds must be used for new activities or to enhance or increase the effectiveness of existing activities in the county. Grant funds shall not be used for research or development of a product that would be patented, copyrighted, or a subject of trade secrets.\n(e) Counties shall provide support to maintain effective municipal recycling where it is already established.\n(a) The commissioner shall distribute the funds annually so that each qualifying county receives an equal share of 50 percent of the allocation to the program described in this section, plus a proportionate share of the remaining funds available for the program. A county's proportionate share is an amount that has the same proportion to the total remaining funds as the number of households in the county has to the total number of households in all metropolitan counties.\n(b) To qualify for distribution of funds, a county, by April 1 of each year, must submit to the commissioner for approval a report on expenditures and activities under the program during the preceding fiscal year and any proposed changes in its recycling implementation strategy or performance funding system. The report shall be included in the county report required by section 473.803, subdivision 3.",
	"repealed": false
}