{
	"id": "256B.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.092",
	"title": "256B.092 SERVICES FOR PERSONS WITH DEVELOPMENTAL DISABILITIES.",
	"text": "Before any services shall be rendered to persons with developmental disabilities who are in need of social service and medical assistance, the county of financial responsibility shall conduct or arrange for a diagnostic evaluation in order to determine whether the person has or may have a developmental disability or has or may have a related condition. If the county of financial responsibility determines that the person has a developmental disability, the county shall inform the person of case management services available under this section. Except as provided in subdivision 1g or 4b, if a person is diagnosed as having a developmental disability, the county of financial responsibility shall conduct or arrange for a needs assessment by a certified assessor, and develop an assessment summary according to section 256B.0911, and authorize services identified in the person's support plan developed according to subdivision 1b. Diagnostic information, obtained by other providers or agencies, may be used by the county agency in determining eligibility for case management. Nothing in this section shall be construed as requiring: (1) assessment in areas agreed to as unnecessary by a certified assessor and the person, or the person's legal guardian or conservator, or the parent if the person is a minor, or (2) assessments in areas where there has been a functional assessment completed in the previous 12 months for which the certified assessor and the person or person's guardian or conservator, or the parent if the person is a minor, agree that further assessment is not necessary. For persons under state guardianship, the certified assessor shall seek authorization from the public guardianship office for waiving any assessment requirements. Assessments related to health, safety, and protection of the person for the purpose of identifying service type, amount, and frequency or assessments required to authorize services may not be waived. To the extent possible, for wards of the commissioner the county shall consider the opinions of the parent of the person with a developmental disability when developing the person's assessment summary and support plan.\n(a) Each recipient of a home and community-based waiver shall be provided case management services by qualified vendors as described in the federally approved waiver application.\n(b) Case management service activities provided to or arranged for a person include:\n(1) development of the person-centered support plan under subdivision 1b;\n(2) informing the individual or the individual's legal guardian or conservator, or parent if the person is a minor, of service options, including all service options available under the waiver plan;\n(3) consulting with relevant medical experts or service providers;\n(4) assisting the person in the identification of potential providers of chosen services, including:\n(i) providers of services provided in a non-disability-specific setting;\n(ii) employment service providers;\n(iii) providers of services provided in settings that are not controlled by a provider; and\n(iv) providers of financial management services;\n(5) assisting the person to access services and assisting in appeals under section 256.045;\n(6) coordination of services, if coordination is not provided by another service provider;\n(7) evaluation and monitoring of the services identified in the support plan, which must incorporate at least one annual face-to-face visit by the case manager with each person; and\n(8) reviewing support plans and providing the lead agency with recommendations for service authorization based upon the individual's needs identified in the support plan.\n(c) Case management service activities that are provided to the person with a developmental disability shall be provided directly by county agencies or under contract. If a county agency contracts for case management services, the county agency must provide each recipient of home and community-based services who is receiving contracted case management services with the contact information the recipient may use to file a grievance with the county agency about the quality of the contracted services the recipient is receiving from a county-contracted case manager. If a county agency provides case management under contracts with other individuals or agencies and the county agency utilizes a competitive proposal process for the procurement of contracted case management services, the competitive proposal process must include evaluation criteria to ensure that the county maintains a culturally responsive program for case management services adequate to meet the needs of the population of the county. For the purposes of this section, \"culturally responsive program\" means a case management services program that: (1) ensures effective, equitable, comprehensive, and respectful quality care services that are responsive to individuals within a specific population's values, beliefs, practices, health literacy, preferred language, and other communication needs; and (2) is designed to address the unique needs of individuals who share a common language or racial, ethnic, or social background.\n(d) Case management services must be provided by a public or private agency that is enrolled as a medical assistance provider determined by the commissioner to meet all of the requirements in the approved federal waiver plans. Case management services must not be provided to a recipient by a private agency that has a financial interest in the provision of any other services included in the recipient's support plan. For purposes of this section, \"private agency\" means any agency that is not identified as a lead agency under section 256B.0911, subdivision 10.\n(e) Case managers are responsible for service provisions listed in paragraphs (a) and (b). Case managers shall collaborate with consumers, families, legal representatives, and relevant medical experts and service providers in the development and annual review of the person-centered support plan and habilitation plan.\n(f) For persons who need a positive support transition plan as required in chapter 245D, the case manager shall participate in the development and ongoing evaluation of the plan with the expanded support team. At least quarterly, the case manager, in consultation with the expanded support team, shall evaluate the effectiveness of the plan based on progress evaluation data submitted by the licensed provider to the case manager. The evaluation must identify whether the plan has been developed and implemented in a manner to achieve the following within the required timelines:\n(1) phasing out the use of prohibited procedures;\n(2) acquisition of skills needed to eliminate the prohibited procedures within the plan's timeline; and\n(3) accomplishment of identified outcomes.\nIf adequate progress is not being made, the case manager shall consult with the person's expanded support team to identify needed modifications and whether additional professional support is required to provide consultation.\n(g) The Department of Human Services shall offer ongoing education in case management to case managers. Case managers shall receive no less than 20 hours of case management education and disability-related training each year. The education and training must include person-centered planning, informed choice, cultural competency, employment planning, community living planning, self-direction options, and use of technology supports. By August 1, 2024, all case managers must complete an employment support training course identified by the commissioner of human services. For case managers hired after August 1, 2024, this training must be completed within the first six months of providing case management services. For the purposes of this section, \"person-centered planning\" or \"person-centered\" has the meaning given in section 256B.0911, subdivision 10. Case managers must document completion of training in a system identified by the commissioner.\n(a) Each recipient of home and community-based waivered services shall be provided a copy of the written person-centered support plan that:\n(1) is developed with and signed by the recipient within the timelines established by the commissioner and section 256B.0911, subdivision 29;\n(2) includes the person's need for service, including identification of service needs that will be or that are met by the person's relatives, friends, and others, as well as community services used by the general public;\n(3) reasonably ensures the health and welfare of the recipient;\n(4) identifies the person's preferences for services as stated by the person, the person's legal guardian or conservator, or the parent if the person is a minor, including the person's choices made on self-directed options, services and supports to achieve employment goals, and living arrangements;\n(5) provides for an informed choice, as defined in section 256B.77, subdivision 2, paragraph (o), of service and support providers, and identifies all available options for case management services and providers;\n(6) identifies long-range and short-range goals for the person;\n(7) identifies specific services and the amount and frequency of the services to be provided to the person based on assessed needs, preferences, and available resources. The person-centered support plan shall also specify other services the person needs that are not available;\n(8) identifies the need for an individual program plan to be developed by the provider according to the respective state and federal licensing and certification standards, and additional assessments to be completed or arranged by the provider after service initiation;\n(9) identifies provider responsibilities to implement and make recommendations for modification to the support plan;\n(10) includes notice of the right to request a conciliation conference or a hearing under section 256.045;\n(11) is agreed upon and signed by the person, the person's legal guardian or conservator, or the parent if the person is a minor, and the authorized county representative;\n(12) is reviewed by a health professional if the person has overriding medical needs that impact the delivery of services; and\n(13) includes the authorized annual and monthly amounts for the services.\n(b) In developing the person-centered support plan, the case manager is encouraged to include the use of volunteers, religious organizations, social clubs, and civic and service organizations to support the individual in the community. The lead agency must be held harmless for damages or injuries sustained through the use of volunteers and agencies under this paragraph, including workers' compensation liability.\n(c) Approved, written, and signed changes to a consumer's services that meet the criteria in this subdivision shall be an addendum to that consumer's individual service plan.\n[Repealed, 1991 c 94 s 25; c 292 art 6 s 47]\n[Repealed, 1991 c 94 s 25; c 292 art 6 s 47]\n[Renumbered subd 1f]\n(a) If the support plan identifies the need for individual program plans for authorized services, the case manager shall assure that individual program plans are developed by the providers according to clauses (2) to (5). The providers shall assure that the individual program plans:\n(1) are developed according to the respective state and federal licensing and certification requirements;\n(2) are designed to achieve the goals of the support plan;\n(3) are consistent with other aspects of the support plan;\n(4) assure the health and welfare of the person; and\n(5) are developed with consistent and coordinated approaches to services among the various service providers.\n(b) The case manager shall monitor the provision of services:\n(1) to assure that the support plan is being followed according to paragraph (a);\n(2) to identify any changes or modifications that might be needed in the support plan, including changes resulting from recommendations of current service providers;\n(3) to determine if the person's legal rights are protected, and if not, notify the person's legal guardian or conservator, or the parent if the person is a minor, protection services, or licensing agencies as appropriate; and\n(4) to determine if the person, the person's legal guardian or conservator, or the parent if the person is a minor, is satisfied with the services provided.\n(c) If the provider fails to develop or carry out the individual program plan according to paragraph (a), the case manager shall notify the person's legal guardian or conservator, or the parent if the person is a minor, the provider, the respective licensing and certification agencies, and the county board where the services are being provided. In addition, the case manager shall identify other steps needed to assure the person receives the services identified in the support plan.\nThe county agency shall maintain a waiting list of persons with developmental disabilities specifying the services needed but not provided. This waiting list shall be used by county agencies to assist them in developing needed services or amending their children and community service agreements.\nUnless otherwise required by federal law, the county agency is not required to complete a support plan as defined in subdivision 1b for:\n(1) persons whose families are requesting respite care for their family member who resides with them, or whose families are requesting a family support grant and are not requesting purchase or arrangement of habilitative services; and\n(2) persons with developmental disabilities, living independently without authorized services or receiving funding for services at a rehabilitation facility as defined in section 268A.01, subdivision 6, and not in need of or requesting additional services.\nTo assure quality case management to those persons who are eligible for medical assistance, the commissioner shall, upon request:\n(1) provide consultation on the case management process;\n(2) assist county agencies in the annual reviews of clients review process to assure that appropriate levels of service are provided to persons;\n(3) provide consultation on service planning and development of services with appropriate options;\n(4) provide training and technical assistance to county case managers; and\n(5) authorize payment for medical assistance services according to this chapter and rules implementing it.\nUpon receipt of federal approval, the commissioner shall make payments to approved vendors of case management services participating in the medical assistance program to reimburse costs for providing case management service activities to medical assistance eligible persons with developmental disabilities, in accordance with the state Medicaid plan and federal requirements and limitations.\nCounty agency case managers, under rules of the commissioner, shall authorize and terminate services of community and regional treatment center providers according to support plans. Services provided to persons with developmental disabilities may only be authorized and terminated by case managers or certified assessors according to (1) rules of the commissioner and (2) the support plan as defined in subdivision 1b. Medical assistance services not needed shall not be authorized by county agencies or funded by the commissioner. When purchasing or arranging for unlicensed respite care services for persons with overriding health needs, the county agency shall seek the advice of a health care professional in assessing provider staff training needs and skills necessary to meet the medical needs of the person.\n(a) Lead agencies must not implement additional requirements, in addition to those required by the commissioner, that could result in the delay of approval or implementation of technology.\n(b) For individuals receiving waiver services under this section, approval or denial of technology must occur within 30 business days of the receipt of the initial request. If denied, the lead agency must submit a notice of action form clearly stating the reason for the denial, including information describing why the technology is not appropriate to meet the individual's assessed need.\n(a) The commissioner shall make payments to approved vendors participating in the medical assistance program to pay costs of providing home and community-based services, including case management service activities provided as an approved home and community-based service, to medical assistance eligible persons with developmental disabilities who have been screened under subdivision 7 and according to federal requirements. Federal requirements include those services and limitations included in the federally approved application for home and community-based services for persons with developmental disabilities and subsequent amendments.\n(b) The commissioner shall comply with the requirements in the federally approved transition plan for the home and community-based services waivers for the elderly authorized under this section.\n[See Note.]\nThe commissioner may waive state rules governing home and community-based services in order to demonstrate other methods of administering these services and to improve efficiency and responsiveness to individual needs of persons with developmental disabilities, notwithstanding sections 14.055 and 14.056. All demonstration projects approved by the commissioner must comply with state laws and federal regulations, must remain within the fiscal limitations of the home and community-based services program for persons with developmental disabilities, and must assure the health and welfare of the persons receiving services.\nPersons authorized for and receiving home and community-based services may select from vendors of case management which have provider agreements with the state to provide home and community-based case management service activities. This subdivision becomes effective July 1, 1992, only if the state agency is unable to secure federal approval for limiting choice of case management vendors to the county of financial responsibility.\n(a) Notwithstanding the requirements for licensure under Minnesota Rules, part 9525.1860, subpart 6, item D, and upon federal approval of an amendment to the home and community-based services waiver for persons with developmental disabilities, a person receiving home and community-based services may choose to live in their own home without requiring that the living arrangement be licensed under Minnesota Rules, parts 9555.5050 to 9555.6265, provided the following conditions are met:\n(1) the person receiving home and community-based services has chosen to live in their own home;\n(2) home and community-based services are provided by a qualified vendor who meets the provider standards as approved in the Minnesota home and community-based services waiver plan for persons with developmental disabilities;\n(3) the person, or their legal representative, individually or with others has purchased or rents the home and the person's service provider has no financial interest in the home; and\n(4) the service planning team, as defined in Minnesota Rules, part 9525.0004, subpart 24, has determined that the planned services, the 24-hour plan of care, and the housing arrangement are appropriate to address the health, safety, and welfare of the person.\n(b) The county agency may require safety inspections of the selected housing as part of their determination of the adequacy of the living arrangement.\nMedicaid reimbursement for the provision of supported living services to a related individual is allowed when the conditions specified in section 245A.03, subdivision 9, are met.\n(a) The commissioner shall apply for any federal waivers necessary to secure, to the extent allowed by law, federal financial participation under United States Code, title 42, sections 1396 et seq., as amended, for the provision of services to persons who, in the absence of the services, would need the level of care provided in a regional treatment center or a community intermediate care facility for persons with developmental disabilities. The commissioner may seek amendments to the waivers or apply for additional waivers under United States Code, title 42, sections 1396 et seq., as amended, to contain costs. The commissioner shall ensure that payment for the cost of providing home and community-based alternative services under the federal waiver plan shall not exceed the cost of intermediate care services including day training and habilitation services that would have been provided without the waivered services.\nThe commissioner shall seek an amendment to the 1915(c) home and community-based waiver to allow properly licensed adult foster care homes to provide residential services to up to five individuals with developmental disabilities. If the amendment to the waiver is approved, adult foster care providers that can accommodate five individuals shall increase their capacity to five beds, provided the providers continue to meet all applicable licensing requirements.\n(b) The commissioner, in administering home and community-based waivers for persons with developmental disabilities, shall ensure that day services for eligible persons are not provided by the person's residential service provider, unless the person or the person's legal representative is offered a choice of providers and agrees in writing to provision of day services by the residential service provider. The support plan for individuals who choose to have their residential service provider provide their day services must describe how health, safety, protection, and habilitation needs will be met, including how frequent and regular contact with persons other than the residential service provider will occur. The support plan must address the provision of services during the day outside the residence on weekdays.\n(c) When a lead agency is evaluating denials, reductions, or terminations of home and community-based services under section 256B.0916 for an individual, the lead agency shall offer to meet with the individual or the individual's guardian in order to discuss the prioritization of service needs within the support plan. The reduction in the authorized services for an individual due to changes in funding for waivered services may not exceed the amount needed to ensure medically necessary services to meet the individual's health, safety, and welfare.\n(d) The commissioner shall seek federal approval to allow for the reconfiguration of the 1915(c) home and community-based waivers in this section, as authorized under section 1915(c) of the federal Social Security Act, to implement a two-waiver program structure.\n(e) The transition to two disability home and community-based services waiver programs must align with the independent living first policy under section 256B.4905. Unless superseded by any other state or federal law, waiver eligibility criteria shall be the same for each waiver. The waiver program that a person uses shall be determined by the support planning process and whether the person chooses to live in a provider-controlled setting or in the person's own home.\n(f) Prior to July 1, 2024, the commissioner shall seek federal approval for the 1915(c) home and community-based waivers in this section, as authorized under section 1915(c) of the federal Social Security Act, to implement an individual resource allocation methodology.\n[See Note.]\n[Repealed, 2009 c 79 art 1 s 21]\nNotwithstanding section 252.28, subdivision 3, paragraph (d), if the 2009 legislature adopts a rate reduction that impacts payment to providers of adult foster care services, the commissioner may issue adult foster care licenses that permit a capacity of five adults. The application for a five-bed license must meet the requirements of section 245A.11, subdivision 2a. Prior to admission of the fifth recipient of adult foster care services, the county must negotiate a revised per diem rate for room and board and waiver services that reflects the legislated rate reduction and results in an overall average per diem reduction for all foster care recipients in that home. The revised per diem must allow the provider to maintain, as much as possible, the level of services or enhanced services provided in the residence, while mitigating the losses of the legislated rate reduction.\nThe commissioner shall adopt rules to establish required controls, documentation, and reporting of services provided in order to assure proper administration of the approved waiver plan, and to establish policy and procedures to reduce duplicative efforts and unnecessary paperwork on the part of case managers.\n(a) Assessments and reassessments shall be conducted by certified assessors according to section 256B.0911, and must incorporate appropriate referrals to determine eligibility for case management under subdivision 1a.\n(b) For persons with developmental disabilities, a certified assessor shall evaluate the need for an institutional level of care. The assessment shall address whether home and community-based services are appropriate for persons who are at risk of placement in an intermediate care facility for persons with developmental disabilities, or for whom there is reasonable indication that they might require this level of care. The certified assessor shall make an evaluation of need within five working days of an emergency admission of a person to an intermediate care facility for persons with developmental disabilities.\n(c) The certified assessor, with the concurrence of the person, the person's legal guardian or conservator, or the parent if the person is a minor, may invite other individuals to attend the assessment. With the permission of the person being assessed or the person's designated legal representative, the person's current provider of services may submit a written report outlining their recommendations regarding the person's care needs prepared by a direct service employee with at least 20 hours of service to that client. The assessor must notify the provider of the date by which this information is to be submitted. This information must be provided to the assessor and the person or the person's legal representative and must be considered prior to the finalization of the assessment.\n(d) Upon federal approval, if during an assessment or reassessment the recipient is determined to be able to have the recipient's needs met through alternative services in a less restrictive setting, the case manager shall help the recipient develop a plan to transition to an appropriate less restrictive setting.\nIn addition to the responsibilities of certified assessors described in section 256B.0911, for persons with developmental disabilities, the certified assessor shall:\n(1) identify other noninstitutional public assistance or social service that may prevent or delay long-term residential placement;\n(2) assess whether a person is in need of long-term residential care;\n(3) make recommendations regarding placement and payment for:\n(i) social service or public assistance support, or both, to maintain a person in the person's own home or other place of residence;\n(ii) training and habilitation service, vocational rehabilitation, and employment training activities;\n(iii) community residential service placement;\n(iv) regional treatment center placement; or\n(v) a home and community-based service alternative to community residential service or regional treatment center placement including self-directed service options;\n(4) evaluate the availability, location, and quality of the services listed in clause (3), including the impact of placement alternatives on the person's ability to maintain or improve existing patterns of contact and involvement with parents and other family members;\n(5) identify the cost implications of recommendations in clause (3); and\n(6) make recommendations to a court as may be needed to assist the court in making decisions regarding commitment of persons with developmental disabilities.\n(a) If the county of financial responsibility wishes to place a person in another county for services, the county of financial responsibility shall notify the proposed county of service and the placement shall be made cooperatively between the two counties. Arrangements shall be made between the two counties for ongoing social service, including annual reviews of the person's support plan. The county where services are provided may not make changes in the person's support plan without approval by the county of financial responsibility.\n(b) The county of service shall notify the county of financial responsibility if, in the case of an intermediate care facility for persons with developmental disabilities, there has been no authorization for admission by the admission review team as required in section 256B.0926.\n(c) The county of service shall notify the county of financial responsibility of any concerns about the chosen provider's capacity to meet the needs of the person seeking to move to residential services in another county no later than 20 working days following receipt of the written notification. Unless other mutually acceptable arrangements are made by the involved county agencies, the county of financial responsibility is responsible for costs of social services and the costs associated with the development and maintenance of the placement. The county of service may request that the county of financial responsibility purchase case management services from the county of service or from a contracted provider of case management when the county of financial responsibility is not providing case management as defined in this section and rules adopted under this section, unless other mutually acceptable arrangements are made by the involved county agencies. Standards for payment limits under this section may be established by the commissioner. Financial disputes between counties shall be resolved as provided in section 256G.09. This subdivision also applies to home and community-based waiver services provided under section 256B.49.\nPayment for services shall not be provided to a service provider for any person placed in an intermediate care facility for persons with developmental disabilities prior to the person receiving an assessment by a certified assessor. The commissioner shall not deny reimbursement for: (1) a person admitted to an intermediate care facility for persons with developmental disabilities who is assessed to need long-term supportive services, if long-term supportive services other than intermediate care are not available in that community; (2) any person admitted to an intermediate care facility for persons with developmental disabilities under emergency circumstances; (3) any eligible person placed in the intermediate care facility for persons with developmental disabilities pending an appeal of the certified assessor's decision; or (4) any medical assistance recipient when, after full discussion of all appropriate alternatives including those that are expected to be less costly than intermediate care for persons with developmental disabilities, the person or the person's legal guardian or conservator, or the parent if the person is a minor, insists on intermediate care placement. The certified assessor shall provide documentation that the most cost-effective alternatives available were offered to this individual or the individual's legal guardian or conservator.\n(a) Prior to the admission of a person to a regional treatment center program for persons with developmental disabilities, the case manager shall make efforts to secure community-based alternatives. If these alternatives are rejected by the person, the person's legal guardian or conservator, or the county agency in favor of a regional treatment center placement, the case manager shall document the reasons why the alternatives were rejected.\n(b) Assessment and support planning must be completed in accordance with requirements identified in section 256B.0911.\n(c) No discharge shall take place until disputes are resolved under section 256.045, subdivision 4a, or until a review by the commissioner is completed upon request of the chief executive officer or program director of the regional treatment center, or the county agency. For persons under public guardianship, the ombudsman may request a review or hearing under section 256.045.\n(a) Upon federal approval, there is established a new service called residential support that is available on the community alternative care, community access for disability inclusion, developmental disabilities, and brain injury waivers. Existing waiver service descriptions must be modified to the extent necessary to ensure there is no duplication between other services. Residential support services must be provided by vendors licensed as a community residential setting as defined in section 245A.11, subdivision 8, a foster care setting licensed under Minnesota Rules, parts 2960.3000 to 2960.3340, or an adult foster care setting licensed under Minnesota Rules, parts 9555.5105 to 9555.6265.\n(b) Residential support services must meet the following criteria:\n(1) the residential site must have a designated person responsible for program management, oversight, development, and implementation of policies and procedures;\n(2) the provider of residential support services must provide supervision, training, and assistance as described in the person's support plan; and\n(3) the provider of residential support services must meet the requirements of licensure and additional requirements of the person's support plan.\n(c) Providers of residential support services that meet the definition in paragraph (a) must be licensed according to chapter 245D. Providers licensed to provide child foster care under Minnesota Rules, parts 2960.3000 to 2960.3340, or adult foster care licensed under Minnesota Rules, parts 9555.5105 to 9555.6265, and that meet the requirements in section 245A.03, subdivision 7, paragraph (f), are considered registered under this section.\n(a) For the purposes of this subdivision, \"residential support services\" means the following residential support services reimbursed under section 256B.4914: community residential services, customized living services, and 24-hour customized living services.\n(b) In order to increase independent living options for people with disabilities and in accordance with section 256B.4905, subdivisions 3 and 4, and consistent with section 245A.03, subdivision 7, the commissioner must establish and implement criteria to access residential support services. The criteria for accessing residential support services must prohibit the commissioner from authorizing residential support services unless at least all of the following conditions are met:\n(1) the individual has complex behavioral health or complex medical needs; and\n(2) the individual's service planning team has considered all other available residential service options and determined that those options are inappropriate to meet the individual's support needs.\n(c) Nothing in this subdivision shall be construed as permitting the commissioner to establish criteria prohibiting the authorization of residential support services for individuals described in the statewide priorities established in subdivision 12, the transition populations in subdivision 13, and the licensing moratorium exception criteria under section 245A.03, subdivision 7, paragraph (a).\n(d) Individuals with active service agreements for residential support services on the date that the criteria for accessing residential support services become effective are exempt from the requirements of this subdivision, and the exemption from the criteria for accessing residential support services continues to apply for renewals of those service agreements.\n[See Note.]\n(a) The commissioner shall establish statewide priorities for individuals on the waiting list for developmental disabilities (DD) waiver services, as of January 1, 2010. The statewide priorities must include, but are not limited to, individuals who continue to have a need for waiver services after they have maximized the use of state plan services and other funding resources, including natural supports, prior to accessing waiver services, and who meet at least one of the following criteria:\n(1) no longer require the intensity of services provided where they are currently living; or\n(2) make a request to move from an institutional setting.\n(b) After the priorities in paragraph (a) are met, priority must also be given to individuals who meet at least one of the following criteria:\n(1) have unstable living situations due to the age, incapacity, or sudden loss of the primary caregivers;\n(2) are moving from an institution due to bed closures;\n(3) experience a sudden closure of their current living arrangement;\n(4) require protection from confirmed abuse, neglect, or exploitation;\n(5) experience a sudden change in need that can no longer be met through state plan services or other funding resources alone; or\n(6) meet other priorities established by the department.\n(c) When allocating new enrollment resources to lead agencies, the commissioner must take into consideration the number of individuals waiting who meet statewide priorities.\n[See Note.]\n(a) The commissioner shall make available additional waiver allocations and additional necessary resources to assure timely discharges from the Anoka-Metro Regional Treatment Center and the Minnesota Security Hospital in St. Peter for individuals who meet the following criteria:\n(1) are otherwise eligible for the developmental disabilities waiver under this section;\n(2) who would otherwise remain at the Anoka-Metro Regional Treatment Center or the Minnesota Security Hospital;\n(3) whose discharge would be significantly delayed without the available waiver allocation; and\n(4) who have met treatment objectives and no longer meet hospital level of care.\n(b) Additional waiver allocations under this subdivision must meet cost-effectiveness requirements of the federal approved waiver plan.\n(c) Any corporate foster care home developed under this subdivision must be considered an exception under section 245A.03, subdivision 7, paragraph (a).\n(a) Persons receiving home and community-based services authorized under this section who have had two or more admissions within a calendar year to an emergency room, psychiatric unit, or institution must receive consultation from a mental health professional as defined in section 245.462, subdivision 18, or a behavioral professional as defined in the home and community-based services state plan within 30 days of discharge. The mental health professional or behavioral professional must:\n(1) conduct a functional assessment of the crisis incident as defined in section 245D.02, subdivision 11, which led to the hospitalization with the goal of developing proactive strategies as well as necessary reactive strategies to reduce the likelihood of future avoidable hospitalizations due to a behavioral crisis;\n(2) use the results of the functional assessment to amend the support plan set forth in section 245D.02, subdivision 4b, to address the potential need for additional staff training, increased staffing, access to crisis mobility services, mental health services, use of technology, and crisis stabilization services in section 256B.0624, subdivision 7; and\n(3) identify the need for additional consultation, testing, and mental health crisis intervention team services as defined in section 245D.02, subdivision 20, psychotropic medication use and monitoring under section 245D.051, and the frequency and duration of ongoing consultation.\n(b) For the purposes of this subdivision, \"institution\" includes, but is not limited to, the Anoka-Metro Regional Treatment Center and the Minnesota Security Hospital.",
	"repealed": false
}