{
	"id": "298.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.25",
	"title": "298.25 TAXES ADDITIONAL TO OCCUPATION TAX; IN LIEU OF OTHER TAXES.",
	"text": "The taxes imposed under section 298.24 shall be in addition to the occupation tax imposed upon the business of mining and producing iron ore. Except as herein otherwise provided, such taxes shall be in lieu of all other taxes upon taconite, iron sulphides, direct reduced ore, and other iron-bearing material or the lands in which they are contained, or upon the mining or quarrying thereof, or the production of concentrate or direct reduced ore therefrom, or upon the concentrate or direct reduced ore produced, or upon the machinery, equipment, tools, supplies and buildings used in such mining, quarrying or production, or upon the lands occupied by, or used in connection with, such mining, quarrying or production facilities. If electric or steam power for the mining, transportation or concentration of taconite, concentrates, direct reduced ore, or other iron-bearing material produced therefrom is generated in plants principally devoted to the generation of power for such purposes, the plants in which such power is generated and all machinery, equipment, tools, supplies, transmission and distribution lines used in the generation and distribution of such power, shall not be considered to be machinery, equipment, tools, supplies and buildings used in the mining, quarrying, or production of taconite, taconite concentrates or direct reduced ore within the meaning of this section, and shall be subject to general property taxation. Nothing in this section prevents the assessment and taxation under the general property tax law of:\n(1) the surface of reserve land containing taconite or other iron-bearing material and not occupied by such facilities or used in connection with them at the value of the land without regard to the taconite, iron sulphides, or other iron-bearing materials in the land;\n(2) merchantable iron ore or other minerals, or iron-bearing materials other than taconite or iron sulphides in the lands;\n(3) facilities used in producing sulphur or sulphur products from iron sulphide concentrates, or in refining sulphur products; or\n(4) any property used for residential or townsite purposes, including utility services to that property.\nThis section does not provide an exemption from general property taxation for ore docks even if located at the site of a taconite production facility.",
	"repealed": false
}