{
	"id": "53.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.04",
	"title": "53.04 SPECIAL POWERS.",
	"text": "Industrial loan and thrift companies, in addition to the general and usual powers incidental to ordinary corporations in this state, which are not specifically restricted in this chapter, shall have the special powers enumerated in subdivisions 2 to 5.\nThe right to discount or purchase notes, bills of exchange, acceptances or other choses in action.\n[Repealed, 1981 c 258 s 23]\n(a) The right to make loans, secured or unsecured, at the rates and on the terms and other conditions permitted under chapters 47 and 334. Loans made under this authority must be in amounts in compliance with section 53.05, clause (7). A licensee making a loan under this chapter secured by a lien on real estate shall comply with the requirements of section 47.20, subdivision 8. A licensee making a loan that is a consumer small loan, as defined in section 47.60, subdivision 1, paragraph (a), must comply with section 47.60. A licensee making a loan that is a consumer short-term loan, as defined in section 47.601, subdivision 1, paragraph (d), must comply with section 47.601.\n(b) Loans made under this subdivision may be secured by real or personal property, or both. If the proceeds of a loan secured by a first lien on the borrower's primary residence are used to finance the purchase of the borrower's primary residence, the loan must comply with the provisions of section 47.20.\n(c) An agency or instrumentality of the United States government or a corporation otherwise created by an act of the United States Congress or a lender approved or certified by the secretary of housing and urban development, or approved or certified by the administrator of veterans affairs, or approved or certified by the administrator of the Farmers Home Administration, or approved or certified by the Federal Home Loan Mortgage Corporation, or approved or certified by the Federal National Mortgage Association, that engages in the business of purchasing or taking assignments of mortgage loans and undertakes direct collection of payments from or enforcement of rights against borrowers arising from mortgage loans, is not required to obtain a certificate of authorization under this chapter in order to purchase or take assignments of mortgage loans from persons holding a certificate of authorization under this chapter.\n(d) This subdivision does not authorize an industrial loan and thrift company to make loans under an overdraft checking plan.\n[Repealed, 1996 c 414 art 2 s 15]\n[Repealed, 1996 c 414 art 2 s 15]\n[Repealed, 1981 c 258 s 23]\n[Repealed, 1996 c 414 art 2 s 15]\nThe right, with the consent of the Department of Commerce, to (1) sell and issue for investment certificates of indebtedness, under any descriptive name, which may bear interest, if any, as their terms provide, and which may require the payment to the company of amounts, from time to time as their terms provide, and permit the withdrawal of amounts paid on them, in whole or in part, from time to time, and the credit of amounts thereon upon conditions set forth therein; and (2) receive savings accounts or savings deposits.\nA person may enter into a credit sale or service contract for sale to an industrial loan and thrift company operating under this chapter in this state, and an industrial loan and thrift company may purchase and enforce the contract under the terms and conditions set forth in section 47.59, subdivisions 2 and 4 to 14.\nNotwithstanding section 53.05, clause (1), and consistent with United States Code, title 12, section 1832, issue negotiable order of withdrawal accounts, which may not be referred to as checking accounts and may include the following transactions:\n(1) automatic (preauthorized) transfers for the purpose of paying loans at the same institution;\n(2) transfers or withdrawals made by mail, messenger, automated teller machine, or in person as withdrawals or transfers to another account of the depositor at the same institution;\n(3) withdrawals initiated by telephone and consummated by an official check mailed to the depository;\n(4) automated clearinghouse debits;\n(5) transfers from a customer's account under a preauthorized agreement to cover overdrafts on another transaction account;\n(6) drafts payable to third parties; and\n(7) debit card transactions.\nAgreements establishing negotiable order of withdrawal accounts must include a prominent disclosure of the following:\n\"We reserve the right to at any time require not less than seven days' notice in writing before each withdrawal from this account.\"\nA negotiable order of withdrawal account may be with or without interest and is considered a transaction account for purposes of section 48.512.\nBefore exercising this power, the company must submit a plan to the commissioner detailing implementation of the power.\n[Repealed, 1981 c 258 s 23]\n[Repealed, 1981 c 258 s 23]",
	"repealed": false
}