{
	"id": "60H.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/60H.05",
	"title": "60H.05 DUTIES OF INSURERS.",
	"text": "The insurer shall have on file an independent financial examination, in a form acceptable to the commissioner, of each managing general agent with which it has done business.\nThe insurer shall periodically, at least semiannually, conduct an on-site review of the underwriting and claims processing operation of the managing general agent and maintain on its records the results of that review.\nExcept as authorized under section 60H.04, paragraph (j), clause (1), binding authority for all reinsurance contracts or participation in insurance or reinsurance syndicates shall rest with an officer of the insurer not affiliated with the managing general agent.\nWithin 30 days of entering into or termination of a contract with a managing general agent, the insurer shall provide written notification of the appointment or termination to the commissioner. Notices of appointment of a managing general agent must include a statement of duties which the managing general agent is expected to perform on behalf of the insurer, the lines of insurance for which the managing general agent is to be authorized to act, and any other information the commissioner may request.\nAn insurer shall review its books and records each quarter to determine if a licensed agent has become a managing general agent as defined in section 60H.02, subdivision 4. If the insurer determines that an agent has become a managing general agent, the insurer shall promptly notify the agent and the commissioner of the determination and the insurer and agent must fully comply with this chapter within 30 days.\nAn insurer shall not appoint to its board of directors an officer, director, employee, subagent, or controlling shareholder of its managing general agents. This section does not apply to relationships governed by the Insurance Holding Company Act, chapter 60D, or, if applicable, the Business Transacted With Producer Controlled Insurer Act, chapter 60J.",
	"repealed": false
}