{
	"id": "471.666",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.666",
	"title": "471.666 PERSONAL USE OF PUBLICLY OWNED AUTOMOBILES PROHIBITED.",
	"text": "For purposes of this section, the following definitions shall apply:\n(a) \"Local government vehicle\" means a vehicle owned or leased by a political subdivision of the state of Minnesota or loaned to a political subdivision.\n(b) \"Political subdivision\" means a statutory or home rule charter city, county, town, school district, metropolitan or regional agency, or other special purpose district of this state.\n(c) \"Local government employee\" or \"employee\" means an individual who is appointed or employed by a political subdivision, including all elected officials of political subdivisions.\nA local government vehicle may be used only for authorized local government business, including personal use that is clearly incidental to the use of the vehicle for local government business. A local government vehicle may not be used for transportation to or from the residence of a local government employee, except as provided in subdivision 3.\nA local government vehicle may be used by a local government employee to travel to or from the employee's residence:\n(1) in connection with work-related activities during hours when the employee is not working;\n(2) if the employee has been assigned the use of a local government vehicle for authorized local government business on an extended basis, and the employee's primary place of work is not the local government work station to which the employee is permanently assigned; or\n(3) if the employee has been assigned the use of a local government vehicle for authorized local government business away from the work station to which the employee is permanently assigned, and the number of miles traveled, or the time needed to conduct the business, will be minimized if the employee uses a local government vehicle to travel to the employee's residence before or after traveling to the place of local government business.\nThis section does not apply to public safety vehicles that are owned or leased by a political subdivision.",
	"repealed": false
}