{
	"id": "571.914",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.914",
	"title": "571.914 OBJECTION TO EXEMPTION CLAIM.",
	"text": "(a) The Notice of Objection and Notice of Hearing form must be substantially in the form set out in subdivision 2.\n(b) The court administrator may charge a fee of $1 for the filing of a Notice of Objection and Notice of Hearing. Upon the filing of a Notice of Objection and Notice of Hearing, the court administrator shall schedule the matter for hearing no sooner than five business days but no later than seven business days from the date of filing. A debtor may request continuance of the hearing by notifying the creditor and the court. The court shall schedule the continued hearing within seven days of the original hearing date.\n(c) An order stating whether the debtor's funds are exempt shall be issued by the court within three days of the date of the hearing.\nThe Written Objection and Notice of Hearing must be in substantially the following form:\nThe creditor objects to your claim of exemption from garnishment for the following reason(s):\n(Note: Bring with you to the hearing all documents and materials supporting your exemption claim. Failure to do so could delay the court's decision.)\nIf the creditor receives all documents and materials supporting your exemption claim before the hearing date, the creditor may agree with your claim and you can avoid a hearing.\nBecause a court hearing will be held on your claim that your funds are protected, your financial institution will retain the funds until it receives an order from the court.\nMS 2008 [Repealed by amendment, 2009 c 31 s 10]\nUpon receipt of a Notice of Objection and Notice of Hearing from the creditor within the specified six-day period, the financial institution shall retain the funds claimed to be exempt. The financial institution shall retain the funds claimed to be exempt until otherwise ordered by the court, upon mutual agreement of the parties, or until the garnishment lapses pursuant to section 571.79.",
	"repealed": false
}