{
	"id": "327.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.16",
	"title": "327.16 PLAN REVIEW APPLICATION.",
	"text": "The plan review application for a manufactured home park or recreational camping area shall be made to the state Department of Health, at such office and in such manner as may be prescribed by that department.\nThe plan review application shall be made upon a form provided by the state Department of Health setting forth:\n(1) The full name and address of the applicant or applicants, or names and addresses of the partners if the applicant is a partnership, or the names and addresses of the officers if the applicant is a corporation.\n(2) A legal description of the site, lot, field, or tract of land upon which the applicant proposes to operate and maintain a manufactured home park or recreational camping area.\n(3) The proposed and existing facilities on and about the site, lot, field, or tract of land for the proposed construction or alteration and maintaining of a sanitary community building for toilets, urinals, sinks, wash basins, slop sinks, showers, drains, laundry facilities, source of water supply, sewage, garbage and waste disposal; except that no toilet facilities shall be required in any manufactured home park which permits only manufactured homes equipped with toilet facilities discharging to water carried sewage disposal systems; and method of fire and storm protection.\n(4) The proposed method of lighting the structures and site, lot, field, or tract of land upon which the manufactured home park or recreational camping area is to be located.\n(5) The calendar months of the year which the applicant will operate the manufactured home park or recreational camping area.\n(6) Plans and drawings for new construction or alteration, including buildings, wells, plumbing and sewage disposal systems.\nThe application for plan review shall be submitted with all plans and specifications enumerated in subdivision 2, and shall be accompanied by an approved zoning permit from the municipality or county wherein the park is to be located, or a statement from the municipality or county that it does not require an approved zoning permit. The fee submitted for the plan review shall be retained by the state even though the proposed project is not approved and a license is denied.\nWhen construction has been completed in accordance with approved plans and specifications the state commissioner of health shall promptly cause the manufactured home park or recreational camping area and appurtenances thereto to be inspected. When the inspection and report has been made and the state commissioner of health finds that all requirements of sections 327.10, 327.11, 327.14 to 327.28, and such conditions of health and safety as the state commissioner of health may require, have been met by the applicant, the state commissioner of health shall forthwith issue the license in the name of the state.\nAny manufactured home park or recreational camping area must be constructed and operated according to all applicable state electrical, fire, plumbing, and building codes.\nWhen the plans and specifications have been approved, the state Department of Health shall issue an approval report permitting the applicant to construct or make alterations upon a manufactured home park or recreational camping area and the appurtenances thereto according to the plans and specifications presented.\nSuch approval does not relieve the applicant from securing building permits in municipalities that require permits or from complying with any other municipal ordinance or ordinances, applicable thereto, not in conflict with this statute.\nIf the application to construct or make alterations upon a manufactured home park or recreational camping area and the appurtenances thereto or a license to operate and maintain the same is denied by the state commissioner of health, the commissioner shall so state in writing giving the reason or reasons for denying the application. If the objections can be corrected the applicant may amend the application and resubmit it for approval, and if denied the applicant may appeal from the decision of the state commissioner of health as provided in section 144.99, subdivision 10.",
	"repealed": false
}