{
	"id": "116V.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/116V.01",
	"title": "116V.01 AGRICULTURAL UTILIZATION RESEARCH INSTITUTE.",
	"text": "The Agricultural Utilization Research Institute is established as a nonprofit corporation under section 501(c)(3) of the Internal Revenue Code of 1986, as amended. The Agricultural Utilization Research Institute shall conduct onsite and applied research, promote the establishment of new products and product uses and the expansion of existing markets for the state's agricultural commodities and products, including direct financial and technical assistance for entrepreneurs in Minnesota and bordering states. The institute must establish or maintain facilities and work with private and public entities to leverage the resources available to achieve maximum results for Minnesota agriculture.\nThe board of directors of the Agricultural Utilization Research Institute is comprised of:\n(1) the chairs of the senate and the house of representatives standing committees with jurisdiction over agriculture finance or the chair's designee;\n(2) two representatives of statewide farm organizations;\n(3) two representatives of agribusiness;\n(4) three representatives of the commodity promotion councils; and\n(5) two at-large representatives.\n(a) The Agricultural Utilization Research Institute shall:\n(1) identify development opportunities for agricultural products;\n(2) implement a program that identifies techniques to meet those opportunities;\n(3) monitor and coordinate research among the public and private organizations and individuals specifically addressing procedures to transfer new technology to businesses, farmers, and individuals;\n(4) assist organizations and individuals with market analysis and product marketing implementations;\n(5) to the extent possible earn and receive revenue from contracts, patents, licenses, royalties, grants, fees-for-service, and memberships;\n(6) work with the Department of Agriculture, the United States Department of Agriculture, the Department of Employment and Economic Development, and other agencies to maximize marketing opportunities locally, nationally, and internationally; and\n(7) leverage available funds from federal, state, and private sources to develop new markets and value added opportunities for Minnesota agricultural products.\n(b) The Agricultural Utilization Research Institute board of directors shall have the sole approval authority for establishing agricultural utilization research priorities, requests for proposals to meet those priorities, awarding of grants, hiring and direction of personnel, and other expenditures of funds consistent with the adopted and approved mission and goals of the Agricultural Utilization Research Institute. The actions and expenditures of the Agricultural Utilization Research Institute are subject to audit. The institute shall annually report by February 1 to the senate and house of representatives standing committees with jurisdiction over agricultural policy and funding. The report must list projects initiated, progress on projects, and financial information relating to expenditures, income from other sources, and other information to allow the committees to evaluate the effectiveness of the institute's activities.\n(c) The Agricultural Utilization Research Institute shall convene a Renewable Energy Roundtable, the purpose of which shall be to further the state's leadership on bioenergy issues.\n(i) The Renewable Energy Roundtable shall consist of one representative appointed by the commissioner of the Minnesota Department of Agriculture, one appointed by the commissioner of the Minnesota Department of Commerce, one appointed by the chancellor of the Minnesota State Colleges and Universities, and one appointed by the president of the University of Minnesota. The appointees must have expertise relevant to bioenergy.\n(ii) The board shall oversee the activities and shall provide staff to assist the Renewable Energy Roundtable.\n(iii) The Renewable Energy Roundtable will engage professionals and experts from private, government, academic, and nonprofit entities across the state to identify bioenergy opportunities and collaborate with a broad group of interested parties to identify future alternative courses of action the state can take to sustain a long-term competitive position in renewable energy through the year 2025. The Renewable Energy Roundtable will consult, advise, and review projects and initiatives funded by the state as directed by the administration and the legislature.\nThe board of directors shall hire an executive director for the Agricultural Utilization Research Institute. Persons employed by the Agricultural Utilization Research Institute are not state employees and may participate in state retirement, deferred compensation, insurance, or other plans that apply to state employees generally and are subject to regulation by the state Campaign Finance and Public Disclosure Board.\nThe institute may make matching grants for agricultural product utilization research to the University of Minnesota, the Minnesota State Colleges and Universities, a Minnesota private college or university, a private corporation, or a person. Grants may be matched from private sources, including farm commodity groups and farm organizations.\n(a) A 26-member advisory board may be established to identify priorities for the Agricultural Utilization Research Institute. Members of the advisory board are appointed by the board. The advisory board consists of: the chair of the Minnesota House of Representatives Agricultural Committee; the chair of the Minnesota Senate Agricultural Committee; a representative from each of the ten largest agricultural-related businesses in the state as determined by the corporation; a member from each of the appropriate trade organizations representing producers of beef cattle, dairy, corn, soybeans, pork, wheat, turkey, barley, wild rice, edible beans, eggs, and potatoes; a member of the Farmers's Union; and a member of the Farm Bureau. Terms and removal of members must be set by the board and members of the advisory board serve without compensation but shall receive their necessary and actual expenses.\n(b) The advisory board shall annually provide a list of priorities and suggested research and marketing studies that should be performed by the Agricultural Utilization Research Institute.\nThe board of directors shall adopt bylaws necessary for the conduct of the business of the institute consistent with this section. The corporation must publish bylaws and amendments to the bylaws on the board's website.\nThe board of directors shall locate and maintain the institute's place of business within the state.\nThe board of directors shall annually elect from among its members a chair and other officers necessary for the performance of its duties.\nThe board of directors shall meet at least twice each year and may hold additional meetings upon giving notice in accordance with the bylaws of the institute. Board meetings are subject to chapter 13D, except section 13D.01, subdivision 6, as it pertains to financial information, business plans, income and expense projections, customer lists, market and feasibility studies, and trade secret information as defined by section 13.37, subdivision 1, paragraph (b). For the purposes of section 13D.015, the board of directors is a state board.\nA director, employee, or officer of the institute may not advocate for or vote on a decision of the board relating to an organization in which the director, employee, or officer has either a direct or indirect financial interest.\nThis institute shall not afford pecuniary gain, incidental or otherwise, to any private individual, firm, or corporation, except the payment of reasonable fees for goods and services provided and approved in accordance with the bylaws of the corporation. No part of the net income or net earnings of the institute shall, directly or indirectly, be distributable to or otherwise inure to the benefit of any individual.\nThe institute may accept and use gifts, grants, or contributions from any source. Unless otherwise restricted by the terms of a gift or bequest, the board may sell, exchange, or otherwise dispose of and invest or reinvest the money, securities, or other property given or bequested to it. The principal of these funds, the income from them, and all other revenues received by it from any nonstate source are subject to expenditure for the board's purposes. Receipts and expenditures of more than $50,000 must be approved by the board.\nThe institute may establish funds and accounts that it finds convenient. The board shall provide for and pay the cost of an audit of its official books and records by the legislative auditor subject to sections 3.971 and 3.972. In addition, the board shall provide and pay for the cost of an annual financial audit of its official books and records by a CPA firm licensed under chapter 326A. A copy of the annual financial audit shall be filed with the Office of the Attorney General, Charities Division.\nFor purposes of this section, \"institute\" means the Agricultural Utilization Research Institute established under this section and \"board of directors\" means the board of directors of the Agricultural Utilization Research Institute.",
	"repealed": false
}