{
	"id": "353.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.95",
	"title": "353.95 ACCOUNT FOR DULUTH POSTEMPLOYMENT BENEFITS.",
	"text": "The Public Employees Retirement Association may administer an account representing the irrevocable trust fund established by the city of Duluth to be used only to fund and pay for the postemployment benefits owed to retired employees in accordance with language contained in labor agreements between the city and its employee bargaining units, or between participating subgroups in the city's health plan and their retirees. The city of Duluth investment committee shall serve as trustee of the irrevocable trust.\nFor purposes of this section, \"postemployment benefit\" means a benefit giving rise to a liability under Statement 45 of the Governmental Accounting Standards Board, and therefore does not include benefits to be paid by a Minnesota public pension plan listed in section 356.20, subdivision 2, or 356.30, subdivision 3, and benefits provided on a defined contribution individual account basis.\n(a) The Public Employees Retirement Association may charge the city fees for reasonable administrative costs, and the amount of those fees is appropriated to the association from the account. The Public Employees Retirement Association may establish other terms and conditions for participation in the account.\n(b) The Public Employees Retirement Association must certify all money in the account to the State Board of Investment for investment in the combined investment funds established in section 11A.14, subject to the policies and procedures established by the State Board of Investment. Investment earnings must be credited to the account of the city. At least quarterly, the State Board of Investment shall provide to the city of Duluth the total rate of return for the assets invested by the board for the city of Duluth under this section. The State Board of Investment shall also include in its annual report the annual total rate of return results for those assets.\nThe city may deposit money in the account and may withdraw money from the account as needed for postemployment benefits owed on behalf of retired employees of the city or its subgroups. Such transactions must be at a time and in a manner required by the executive director of the Public Employees Retirement Association. The city of Duluth must ensure that the investment and management of the assets complies with the prudent investor rule in section 501C.0901 and that withdrawals comply with the requirements of this section. The account may be terminated only to the extent the city's postemployment benefit actuarial liability is satisfied or otherwise defeased. The city shall file with the state auditor an investment policy statement under section 356.219, subdivision 3, paragraph (a).\n(a) All money in the account representing the irrevocable fund created in this section is held in trust for the exclusive benefit of retired employees of the city and of subgroups participating in the city's health plan, and is not subject to claims by creditors of the state, the city, the city's subgroups, or the current and former employees of the city or its subgroups.\n(b) The irrevocable trust fund underlying the account created in this section must be deemed an arrangement equivalent to a trust for all legal purposes.",
	"repealed": false
}