{
	"id": "168.053",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.053",
	"title": "168.053 DRIVE-AWAY IN-TRANSIT LICENSE.",
	"text": "Any person, firm, or corporation with a business located in Minnesota engaged in the business of transporting motor vehicles owned by another, by delivering, by drive-away or towing methods, either singly or by means of the full mount method, the saddle mount method, the tow bar method, or any other combination thereof, and under their own power, vehicles over the highways of the state from the manufacturer or any other point of origin, to any point of destination, within or without the state, shall make application to the registrar for a drive-away in-transit license. This application for annual license shall be accompanied by a registration fee of $250 and contain information the registrar may require. Upon the filing of the application and the payment of the fee, the registrar shall issue to each drive-away operator a drive-away in-transit license plate, which must be carried and displayed on the power unit consistent with section 169.79 and the plate shall remain on the vehicle while being transported. The license plate issued under this subdivision is not valid for the purpose of permanent vehicle registration. Additional drive-away in-transit license plates desired by any drive-away operator may be secured from the registrar of motor vehicles upon the payment of a fee of $5 for each set of additional license plates. Any person, firm, or corporation engaging in the business as a drive-away operator, of transporting and delivering by means of full mount method, the saddle mount method, the tow bar method, or any combination thereof, and under their own power, motor vehicles, who fails or refuses to file or cause to be filed an application, as is required by law, and to pay the fees therefor as the law requires, shall be found guilty of violating the provisions of sections 168.053 to 168.057; and, upon conviction, fined not less than $50, and not more than $100, and all costs of court. Each day so operating without securing the license and plates as required shall constitute a separate offense.\nNotwithstanding any provisions of subdivision 1 inconsistent herewith the provisions of sections 168.053 to 168.057 shall also apply to the delivery of new travel trailers, park trailers, manufactured homes, sectional buildings, and semitrailers by towing methods whether or not the power unit is a part of the combination being delivered.",
	"repealed": false
}