{
	"id": "16A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.011",
	"title": "16A.011 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\nExcept when otherwise modified, \"agency\" includes an office, department, board, council, committee, authority, or commission of state government.\n\"Allotment\" means a limit placed by the commissioner on the amount to be spent or encumbered during a period of time pursuant to an appropriation.\n\"Appropriation\" means an authorization by law to expend or encumber an amount in the treasury.\n[Renumbered subd 17]\n\"Biennium\" means a period of two consecutive fiscal years beginning in an odd-numbered calendar year and ending in the next odd-numbered calendar year.\n\"Commissioner\" means the commissioner of management and budget unless a different commissioner is specified.\n\"Constitution\" means the state constitution.\nExcept in subdivision 2, \"department\" means the Department of Management and Budget unless a different department is specified.\n\"Employee\" includes elected officials, officers, and employees of the state, or agency, as the context requires.\n\"Encumbrance\" means the commitment of a portion or all of an allotment in order to meet an obligation that is expected to be incurred to pay for goods or services received by the state or to pay a grant.\n\"Executive agency\" means an agency in the executive branch of state government.\n\"Executive branch state agency\" means an agency in the executive branch of state government, but does not include constitutional officers.\n\"Finance Committee\" means the Finance Committee of the senate.\n\"Fiscal year\" means the period beginning at midnight between June 30 and July 1 and ending 12 months later.\nA statutory appropriation is one which sets apart a specified or unspecified and open amount of public money or funds of the state general fund for expenditure for a purpose and makes the amount, or a part of it, available for use continuously for a period of time beyond the end of the second fiscal year after the session of the legislature at which the appropriation is made.\nEvery appropriation stated to be an \"annual appropriation,\" \"payable annually,\" \"appropriated annually,\" or \"annually appropriated,\" and every appropriation described by equivalent terms or language is a statutory appropriation as defined in this subdivision.\n[Obsolete, 2003 c 112 art 2 s 50]\nA \"transfer\" means the authorization to move state money from one fund, account, or agency to another fund, account, or agency within the state treasury. When authorized by law, a transfer must reduce money in one fund, account, or agency and increase the same amount to a separate fund, account, or agency.\nUnless otherwise modified, \"treasury\" means the state treasury.\n\"Ways and Means Committee\" means the chief fiscal committee of the house of representatives.",
	"repealed": false
}