{
	"id": "245A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.10",
	"title": "245A.10 FEES.",
	"text": "(a) Unless exempt under paragraph (b), the commissioner shall charge a fee for evaluation of applications and inspection of programs which are licensed under this chapter.\n(b) Except as provided under subdivision 2, no application or license fee shall be charged for a child foster residence setting, adult foster care, or a community residential setting.\n(a) For purposes of adult foster care and child foster residence setting licensing and licensing the physical plant of a community residential setting, under this chapter, a county agency may charge a fee to a corporate applicant or corporate license holder to recover the actual cost of licensing inspections, not to exceed $500 annually.\n(b) Counties may elect to reduce or waive the fees in paragraph (a) under the following circumstances:\n(1) in cases of financial hardship;\n(2) if the county has a shortage of providers in the county's area; or\n(3) for new providers.\n(a) For fees required under subdivision 1, an applicant for an initial license or certification issued by the commissioner shall submit a $500 application fee with each new application required under this subdivision. An applicant for an initial day services facility license under chapter 245D shall submit a $250 application fee with each new application. The application fee shall not be prorated, is nonrefundable, and is in lieu of the annual license or certification fee that expires on December 31. The commissioner shall not process an application until the application fee is paid.\n(b) Except as provided in paragraph (c), an applicant shall apply for a license to provide services at a specific location.\n(c) For a license to provide home and community-based services to persons with disabilities or age 65 and older under chapter 245D, an applicant shall submit an application to provide services statewide.\n(a)(1) A program licensed to provide one or more of the home and community-based services and supports identified under chapter 245D to persons with disabilities or age 65 and older, shall pay an annual nonrefundable license fee based on revenues derived from the provision of services that would require licensure under chapter 245D during the calendar year immediately preceding the year in which the license fee is paid, according to the following schedule:\n(2) If requested, the license holder shall provide the commissioner information to verify the license holder's annual revenues or other information as needed, including copies of documents submitted to the Department of Revenue.\n(3) At each annual renewal, a license holder may elect to pay the highest renewal fee, and not provide annual revenue information to the commissioner.\n(4) A license holder that knowingly provides the commissioner incorrect revenue amounts for the purpose of paying a lower license fee shall be subject to a civil penalty in the amount of double the fee the provider should have paid.\n(b) A substance use disorder treatment program licensed under chapter 245G, to provide substance use disorder treatment shall pay an annual nonrefundable license fee based on the following schedule:\n(c) A detoxification program licensed under Minnesota Rules, parts 9530.6510 to 9530.6590, or a withdrawal management program licensed under chapter 245F shall pay an annual nonrefundable license fee based on the following schedule:\nA detoxification program that also operates a withdrawal management program at the same location shall only pay one fee based upon the licensed capacity of the program with the higher overall capacity.\n(d) A children's residential facility licensed under Minnesota Rules, chapter 2960, to serve children shall pay an annual nonrefundable license fee based on the following schedule:\n(e) A residential facility licensed under section 245I.23 or Minnesota Rules, parts 9520.0500 to 9520.0670, to serve persons with mental illness shall pay an annual nonrefundable license fee based on the following schedule:\n(f) A residential facility licensed under Minnesota Rules, parts 9570.2000 to 9570.3400, to serve persons with physical disabilities shall pay an annual nonrefundable license fee based on the following schedule:\n(g) A program licensed as an adult day care center licensed under Minnesota Rules, parts 9555.9600 to 9555.9730, shall pay an annual nonrefundable license fee based on the following schedule:\n(h) A program licensed to provide treatment services to persons with sexual psychopathic personalities or sexually dangerous persons under Minnesota Rules, parts 9515.3000 to 9515.3110, shall pay an annual nonrefundable license fee of $20,000.\n(i) A mental health clinic certified under section 245I.20 shall pay an annual nonrefundable certification fee of $1,550. If the mental health clinic provides services at a primary location with satellite facilities, the satellite facilities shall be certified with the primary location without an additional charge.\n[Repealed, 1Sp2011 c 9 art 4 s 10]\nThe commissioner shall not issue or reissue a license or certification until the license or certification fee is paid. The commissioner shall send a bill for the license or certification fee to the billing address identified by the license holder. If the license holder does not submit the license or certification fee payment by the due date, the commissioner shall send the license holder a past due notice. If the license holder fails to pay the license or certification fee by the due date on the past due notice, the commissioner shall send a final notice to the license holder informing the license holder that the program license will expire on December 31 unless the license fee is paid before December 31. If a license expires, the program is no longer licensed and, unless exempt from licensure under section 245A.03, subdivision 2, must not operate after the expiration date. After a license expires, if the former license holder wishes to provide licensed services, the former license holder must submit a new license application and application fee under subdivision 3.\nNotwithstanding section 16A.1285, subdivision 2, related to activities for which the commissioner charges a fee, the commissioner must plan to fully recover direct expenditures for licensing activities under this chapter over a five-year period. The commissioner may have anticipated expenditures in excess of anticipated revenues in a biennium by using surplus revenues accumulated in previous bienniums.\nA human services licensing account is created in the state government special revenue fund. Fees collected under subdivisions 3 and 4 must be deposited in the human services licensing account and are annually appropriated to the commissioner for licensing activities authorized under this chapter.\nThe commissioner shall not reissue a license or certification until the license holder has paid all outstanding debts related to a licensing fine or settlement agreement for which payment is delinquent. If the payment is past due, the commissioner shall send a past due notice informing the license holder that the program license will expire on December 31 unless the outstanding debt is paid before December 31. If a license expires, the program is no longer licensed and must not operate after the expiration date. After a license expires, if the former license holder wishes to provide licensed services, the former license holder must submit a new license application and application fee under subdivision 3.",
	"repealed": false
}