{
	"id": "118A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/118A.05",
	"title": "118A.05 CONTRACTS AND AGREEMENTS.",
	"text": "In addition to other authority granted in sections 118A.01 to 118A.06, government entities may enter into contracts and agreements as follows.\nRepurchase agreements consisting of collateral allowable in section 118A.04, and reverse repurchase agreements may be entered into with any of the following entities:\n(1) a financial institution qualified as a \"depository\" of public funds of the government entity;\n(2) any other financial institution which is a member of the Federal Reserve System and whose combined capital and surplus equals or exceeds $10,000,000;\n(3) a primary reporting dealer in United States government securities to the Federal Reserve Bank of New York; or\n(4) a securities broker-dealer licensed pursuant to chapter 80A, or an affiliate of it, regulated by the Securities and Exchange Commission and maintaining a combined capital and surplus of $40,000,000 or more, exclusive of subordinated debt.\nReverse agreements may only be entered into for a period of 90 days or less and only to meet short-term cash flow needs. In no event may reverse repurchase agreements be entered into for the purpose of generating cash for investments, except as stated in subdivision 3.\nSecurities lending agreements, including custody agreements, may be entered into with a financial institution meeting the qualifications of subdivision 2, clause (1) or (2), and having an office located in Minnesota. Securities lending transactions may be entered into with entities meeting the qualifications of subdivision 2 and the collateral for such transactions shall be restricted to the securities described in this section and section 118A.04.\nGovernment entities may enter into agreements or contracts for:\n(1) shares of a Minnesota joint powers investment trust whose investments are restricted to securities described in this section, section 118A.04, and section 118A.07, subdivision 7;\n(2) units of a short-term investment fund established and administered pursuant to regulation 9 of the Office of the Comptroller of the Currency, in which investments are restricted to securities described in this section and section 118A.04;\n(3) shares of an investment company which is registered under the Federal Investment Company Act of 1940 and which holds itself out as a money market fund meeting the conditions of rule 2a-7 of the Securities and Exchange Commission and is rated in one of the two highest rating categories for money market funds by at least one nationally recognized statistical rating organization; or\n(4) shares of an investment company which is registered under the Federal Investment Company Act of 1940, and whose shares are registered under the Federal Securities Act of 1933, as long as the investment company's fund receives the highest credit rating and is rated in one of the two highest risk rating categories by at least one nationally recognized statistical rating organization and is invested in financial instruments with a final maturity no longer than 13 months.\nAgreements or contracts for guaranteed investment contracts may be entered into if they are issued or guaranteed by United States commercial banks, domestic branches of foreign banks, United States insurance companies, or their Canadian subsidiaries, or the domestic affiliates of any of the foregoing. The credit quality of the issuer's or guarantor's short- and long-term unsecured debt must be rated in one of the two highest categories by a nationally recognized rating agency. Agreements or contracts for guaranteed investment contracts with a term of 18 months or less may be entered into regardless of the credit quality of the issuer's or guarantor's long-term unsecured debt, provided that the credit quality of the issuer's short-term unsecured debt is rated in the highest category by a nationally recognized rating agency. Should the issuer's or guarantor's credit quality be downgraded below \"A\", the government entity must have withdrawal rights.",
	"repealed": false
}