{
	"id": "147A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.02",
	"title": "147A.02 QUALIFICATIONS FOR LICENSURE.",
	"text": "(a) The board may grant a license as a physician assistant to an applicant who:\n(1) submits an application on forms approved by the board;\n(2) pays the appropriate fee as determined by the board;\n(3) has current certification from the National Commission on Certification of Physician Assistants, or its successor agency as approved by the board;\n(4) certifies that the applicant is mentally and physically able to engage safely in practice as a physician assistant;\n(5) has no licensure, certification, or registration as a physician assistant under current discipline, revocation, suspension, or probation for cause resulting from the applicant's practice as a physician assistant, unless the board considers the condition and agrees to licensure;\n(6) submits any other information the board deems necessary to evaluate the applicant's qualifications; and\n(7) has been approved by the board.\n(b) All persons registered as physician assistants as of June 30, 1995, are eligible for continuing license renewal. All persons applying for licensure after that date shall be licensed according to this chapter.\n(c) A physician assistant who qualifies for licensure must practice for at least 2,080 hours, within the context of a collaborative agreement, within a hospital or integrated clinical setting where physician assistants and physicians work together to provide patient care. The physician assistant shall submit written evidence to the board with the application, or upon completion of the required collaborative practice experience. For purposes of this paragraph, a collaborative agreement is a mutually agreed upon plan for the overall working relationship and collaborative arrangement between a physician assistant, and one or more physicians licensed under chapter 147, that designates the scope of services that can be provided to manage the care of patients. The physician assistant and one of the collaborative physicians must have experience in providing care to patients with the same or similar medical conditions. The collaborating physician is not required to be physically present so long as the collaborating physician and physician assistant are or can be easily in contact with each other by radio, telephone, or other telecommunication device.",
	"repealed": false
}