{
	"id": "116.064",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.064",
	"title": "116.064 ODOR MANAGEMENT.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Objectionable odor\" means pollution of the ambient air beyond the property line of a facility consisting of an odor that, considering its characteristics, intensity, frequency, and duration:\n(1) is, or can reasonably be expected to be, injurious to public health or welfare; or\n(2) unreasonably interferes with the enjoyment of life or the use of property of persons exposed to the odor.\n(c) \"Odor complaint\" means a notification received and recorded by the agency or by a political subdivision from an identifiable person that describes the nature, duration, and location of the odor.\nThis section applies to facilities that are located in the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington.\nNo person may cause or allow emission into the ambient air of any substance or combination of substances in quantities that produce an objectionable odor beyond the property line of the facility that is the source of the odor.\n(a) The agency must conduct a site investigation of any facility against which ten or more verifiable odor complaints have been submitted to the agency or to local government officials within 48 hours. The investigation must include:\n(1) an interview with the owner or operator of the facility against which the complaint was made;\n(2) a physical examination of the facilities, equipment, operations, conditions, methods, storage areas for material inputs, chemicals and waste, and any other factors that may contribute to or are designed to mitigate the emission of odors; and\n(3) testing at locations identified in the odor complaints and at other locations beyond the property line of the facility that is the source of the odor using a precision instrument capable of measuring odors in ambient air.\n(b) The commissioner, based upon the agency's site investigation and the results of odor testing and considering the nature, intensity, frequency, and duration of the odor and other relevant factors, shall determine whether the odor emitted from the facility constitutes an objectionable odor. In making the determination, the commissioner may consider the opinions of a random sample of persons exposed to samples of the odor taken from ambient air beyond the property line of the facility that is the source of the odor.\n(c) The agency must notify officials in local jurisdictions:\n(1) of odor complaints filed with the agency regarding properties within the local jurisdiction;\n(2) of any investigation of an odor complaint conducted by the agency at a facility within the local jurisdiction and the results of the investigation;\n(3) that odor complaints filed with respect to properties located within those jurisdictions must be forwarded to the agency within three business days of being filed; and\n(4) of any additional actions taken by the agency with respect to the complaints.\n(a) If the commissioner determines under subdivision 4 that the odor emitted from a facility is an objectionable odor, the commissioner shall require the owner of the facility to develop and submit to the agency for review within 90 days an odor management plan designed to mitigate odor emissions. The agency must provide technical assistance to the property owner in developing a management plan, including:\n(1) identifying odor control technology and equipment that may reduce odor emissions; and\n(2) identifying alternative methods of operation or alternative materials that may reduce odor emissions.\nThe commissioner may grant an extension for submission of the odor management plan for up to an additional 90 days for good cause.\n(b) An odor management plan must contain, at a minimum, for each odor source contributing to odor emissions:\n(1) a description of plant operations and materials that generate odors;\n(2) proposed changes in equipment, operations, or materials that are designed to mitigate odor emissions;\n(3) the estimated effectiveness of the plan in reducing odor emissions;\n(4) the estimated cost of implementing the plan; and\n(5) a schedule of plan implementation activities.\n(c) The commissioner may accept, reject, or modify an odor management plan submitted under this subdivision.\n(d) If the commissioner, based upon the same factors considered under subdivision 4, paragraph (b), determines that implementation of the odor management plan has failed to reduce the facility's odor emissions to a level where they are no longer objectionable odors, the commissioner shall order the facility owner to revise the odor management plan within 90 days of receipt of the commissioner's order. If the revised odor management plan is not acceptable to the commissioner or is implemented but fails to reduce the property's odor emissions to a level where they are no longer objectionable odors, the commissioner may impose penalties under section 115.071 or may modify or revoke the facility's permit under section 116.07, subdivision 4a, paragraph (d).\nThis section does not apply to:\n(1) on-farm animal and agricultural operations;\n(2) motor vehicles and transportation facilities;\n(3) municipal wastewater treatment plants;\n(4) single-family dwellings not used for commercial purposes;\n(5) materials odorized for safety purposes;\n(6) painting and coating operations that are not required to be licensed;\n(7) restaurants;\n(8) temporary activities and operations;\n(9) refineries; and\n(10) Metropolitan Council wastewater systems.\n(a) The commissioner must adopt rules to implement this section, and section 14.125 does not apply.\n(b) The commissioner must comply with chapter 14 and must complete the statement of need and reasonableness according to chapter 14 and section 116.07, subdivision 2, paragraph (f).\n(c) The rules must include:\n(1) an odor standard or standards for air pollution that may qualify as an objectionable odor under subdivision 1, paragraph (b), clause (2);\n(2) a process for determining if an odor is objectionable;\n(3) a process for investigating and addressing odor complaints;\n(4) guidance for developing odor-management plans; and\n(5) procedures and criteria for determining the success or failure of an odor-management plan.",
	"repealed": false
}