{
	"id": "15A.083",
	"url": "https://www.revisor.mn.gov/statutes/cite/15A.083",
	"title": "15A.083 SALARIES FOR POSITIONS IN THE JUDICIAL BRANCH.",
	"text": "[Repealed, 1987 c 404 s 191]\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1996 c 310 s 1]\nSalaries or salary ranges are provided for the following positions in the judicial branch of government. The appointing authority of any position for which a salary range has been provided shall fix the individual salary within the prescribed range, considering the qualifications and overall performance of the employee. If district court administrators die, the amounts of their unpaid salaries for the months in which their deaths occur must be paid to their estates. The salary of the state public defender shall be fixed by the State Board of Public Defense but must not exceed the salary of a district court judge.\n[Repealed, 1979 c 332 art 2 s 7]\nThe salary of a judge of the Tax Court is 98.52 percent of the salary for a district court judge. The salary of the chief Tax Court judge is 98.52 percent of the salary for a chief district court judge.\nNotwithstanding any other law or ordinance to the contrary, no referee or administrative law judge employed by a court in this state shall receive a salary which is in excess of 90 percent of the salary paid a judge of the employing court.\nThe salary of the chief administrative law judge is 98.52 percent of the salary of a chief district court judge. The salaries of the deputy chief judge and judge supervisors employed by the Office of Administrative Hearings are 100 percent of the salary of a district court judge. The salary of an administrative law judge employed by the Office of Administrative Hearings is 98.52 percent of the salary of a district court judge as set under section 15A.082, subdivision 3.\nSalaries of judges of the Workers' Compensation Court of Appeals are 105 percent of the salary for workers' compensation judges of the Office of Administrative Hearings. The salary of the chief judge of the Workers' Compensation Court of Appeals is 107 percent of the salary for workers' compensation judges of the Office of Administrative Hearings. Salaries of compensation judges are 98.52 percent of the salary of district court judges.",
	"repealed": false
}