{
	"id": "120A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/120A.24",
	"title": "120A.24 REPORTING.",
	"text": "(a) The person or nonpublic school in charge of providing instruction to a child must submit to the superintendent of the district in which the child resides the name, birth date, and address of the child; the annual tests intended to be used under section 120A.22, subdivision 11, if required; the name of each instructor; and evidence of compliance with one of the requirements specified in section 120A.22, subdivision 10:\n(1) by October 1 of the first school year the child receives instruction after reaching the age of seven;\n(2) within 15 days of when a parent withdraws a child from public school after age seven to provide instruction in a nonpublic school that is not accredited by a state-recognized accredited agency;\n(3) within 15 days of moving out of a district; and\n(4) by October 1 after a new resident district is established.\n(b) The person or nonpublic school in charge of providing instruction to a child between the ages of seven and 16 and every child ages 16 through 17 for which an initial report was filed pursuant to this subdivision after the child is 16 must submit, by October 1 of each school year, a letter of intent to continue to provide instruction under this section for all students under the person's or school's supervision and any changes to the information required in paragraph (a) for each student.\n(c) The superintendent may collect the required information under this section through an electronic or web-based format, but must not require electronic submission of information under this section from the person in charge of reporting under this subdivision.\n(a) The person or nonpublic school in charge of providing instruction to a child must maintain documentation indicating that the subjects required in section 120A.22, subdivision 9, are being taught and proof that the tests under section 120A.22, subdivision 11, have been administered. This documentation must include class schedules, copies of materials used for instruction, and descriptions of methods used to assess student achievement.\n(b) The parent of a child who enrolls full time in public school after having been enrolled in a nonpublic school that is not accredited by a state-recognized accrediting agency must provide the enrolling public school or school district with the child's scores on any tests administered to the child under section 120A.22, subdivision 11, and other education-related documents the enrolling school or district requires to determine where the child is placed in school and what course requirements apply. This paragraph does not apply to a shared time student who does not seek a public school diploma.\n(c) The person or nonpublic school in charge of providing instruction to a child must make the documentation in this subdivision available to the county attorney when a case is commenced under section 120A.26, subdivision 5; chapter 260C; or when diverted under chapter 260A.\nA nonpublic school, person, or other institution that is accredited by an accrediting agency, recognized according to section 123B.445, or recognized by the commissioner, is exempt from the requirements in subdivision 2.\nA superintendent must make an annual report to the commissioner of education by December 1 of the total number of nonpublic children reported as residing in the district. The report must include the following information:\n(1) the number of children residing in the district attending nonpublic schools or receiving instruction from persons or institutions other than a public school;\n(2) the number of children in clause (1) who are in compliance with section 120A.22 and this section; and\n(3) the number of children in clause (1) who the superintendent has determined are not in compliance with section 120A.22 and this section.\nNothing in this section alleviates the obligations under section 120A.22.",
	"repealed": false
}