{
	"id": "62J.824",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.824",
	"title": "62J.824 FACILITY FEE DISCLOSURE.",
	"text": "(a) Prior to the delivery of nonemergency services, a provider-based clinic that charges a facility fee shall provide notice to any patient, including patients served by telehealth as defined in section 62A.673, subdivision 2, paragraph (h), stating that the clinic is part of a hospital and the patient may receive a separate charge or billing for the facility component, which may result in a higher out-of-pocket expense.\n(b) Each health care facility must post prominently in locations easily accessible to and visible by patients, including on its website, a statement that the provider-based clinic is part of a hospital and the patient may receive a separate charge or billing for the facility, which may result in a higher out-of-pocket expense.\n(c) This section does not apply to laboratory services, imaging services, or other ancillary health services that are provided by staff who are not employed by the health care facility or clinic.\n(d) For purposes of this section:\n(1) \"facility fee\" means any separate charge or billing by a provider-based clinic in addition to a professional fee for physicians' services that is intended to cover building, electronic medical records systems, billing, and other administrative and operational expenses; and\n(2) \"provider-based clinic\" means the site of an off-campus clinic or provider office, located at least 250 yards from the main hospital buildings or as determined by the Centers for Medicare and Medicaid Services, that is owned by a hospital licensed under chapter 144 or a health system that operates one or more hospitals licensed under chapter 144, and is primarily engaged in providing diagnostic and therapeutic care, including medical history, physical examinations, assessment of health status, and treatment monitoring. This definition does not include clinics that are exclusively providing laboratory, x-ray, testing, therapy, pharmacy, or educational services and does not include facilities designated as rural health clinics.",
	"repealed": false
}