{
	"id": "84.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.94",
	"title": "84.94 AGGREGATE PLANNING AND PROTECTION.",
	"text": "It is the purpose of this section to protect aggregate resources; to promote orderly and environmentally sound development; to spread the burden of development; and to introduce aggregate resource protection into local comprehensive planning and land use controls.\nFor the purpose of this section, \"municipality\" means a home rule charter or statutory city, or a town.\n(a) The Department of Natural Resources, with the cooperation of the state Geological Survey, the Department of Transportation, and the Department of Employment and Economic Development, outside of the metropolitan area as defined in section 473.121, shall conduct a program of identification and classification of potentially valuable publicly or privately owned aggregate lands located outside of urban or developed areas where aggregate mining is restricted, without consideration of their present land use. The program shall give priority to identification and classification in areas of the state where urbanization or other factors are or may be resulting in a loss of aggregate resources to development. Lands shall be classified as:\n(1) identified resources, being those containing significant aggregate deposits;\n(2) potential resources, being those containing potentially significant deposits and meriting further evaluation; or\n(3) subeconomic resources, being those containing no significant deposits.\n(b) As lands are classified, the information on the classification shall be transmitted to each of the departments and agencies named in this subdivision, to the planning authority of the appropriate county and municipality, and to the appropriate county engineer. The county planning authority shall notify owners of land classified under this subdivision by publication in a newspaper of general circulation in the county or by mail.\nEach planning authority of a county or municipality receiving information pursuant to subdivision 3 shall consider the protection of identified and important aggregate resources in their land use decisions.",
	"repealed": false
}