{
	"id": "219.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.01",
	"title": "219.01 TRACK SAFETY STANDARDS; SAFETY TECHNOLOGY GRANTS.",
	"text": "(a) The track safety standards of the United States Department of Transportation and Federal Railroad Administration apply to railroad trackage and are the standards for the determination of unsafe trackage within the state.\n(b) The commissioner of transportation shall apply to the Federal Railroad Administration under Public Law 110-432, the Rail Safety Improvement Act of 2008 (the act), for (1) railroad safety technology grant funding available under section 105 of the act and (2) development and installation of rail safety technology, including provision for switch position indicator signals in nonsignalized main track territory, under section 406 of the act. The commissioner shall respond and make application to the Federal Railroad Administration notice of funds availability under the Rail Safety Improvement Act in a timely manner and before the date of the program deadline to assure full consideration of the application. The commissioner shall (i) prioritize grant requests for the installation of switch indicator signals on all segments of nonsignalized track where posted speeds are in excess of 20 miles per hour and (ii) apply for grant funding in each year after 2010 until all nonsignalized track territory in the state has switch indicator signals installed and in operation.\n(c) Prior to applying for funds under paragraph (b), the commissioner shall solicit grant requests from all eligible railroads. The commissioner shall submit written notice to the chairs of the legislative committees with jurisdiction over transportation policy and finance of an acceptance by a Class I or Class II railroad of federal grant program funding for switch point indicator monitor systems.\n(d) Participating railroads shall provide the 20 percent nonfederal match. Railroads shall provide all technical documentation requested by the commissioner and required by the Federal Railroad Administration for the applications under paragraph (b). Railroads are responsible for developing, acquiring, and installing all rail safety technology obtained under this section in accordance with requirements established by the Federal Railroad Administration.",
	"repealed": false
}