{
	"id": "136A.1791",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1791",
	"title": "136A.1791 TEACHER SHORTAGE LOAN REPAYMENT PROGRAM.",
	"text": "(a) The terms used in this section have the meanings given them in this subdivision.\n(b) \"Qualified educational loan\" means a government, commercial, or foundation loan for actual costs paid for tuition and reasonable educational and living expenses related to a teacher's preparation or further education, only if the further education will result in the teacher decreasing the gap in a new shortage area.\n(c) \"School district\" means an independent school district, special school district, intermediate district, education district, special education cooperative, service cooperative, a cooperative center for vocational education, or a charter school located in Minnesota.\n(d) \"Teacher\" means an individual holding a teaching license issued by the Professional Educator Licensing and Standards Board who is employed by a school district to provide classroom instruction.\n(e) \"Commissioner\" means the commissioner of the Office of Higher Education unless indicated otherwise.\n(f) \"License shortage area\" has the meaning given in section 136A.1275, subdivision 1, paragraph (b).\n(g) \"Racial or ethnic group underrepresented in the teacher workforce\" means a racial or ethnic group for which the aggregate percentage of Minnesota teachers of that racial or ethnic group is lower than the aggregate percentage of Minnesota kindergarten through grade 12 students of that racial or ethnic group.\n(h) \"Rural school district\" means a school district with fewer than 30 resident pupil units under section 126C.05, subdivision 6, per square mile.\nThe commissioner shall establish and administer a teacher shortage loan repayment program.\n[Repealed by amendment, 1Sp2021 c 2 art 2 s 15]\nTo be eligible for a disbursement under this section, a teacher must belong to a racial or ethnic group underrepresented in the Minnesota teacher workforce. To the extent that funds are available, eligibility extends to teachers who teach in a rural school district or teach in a license shortage area.\nEach applicant for loan repayment, according to rules adopted by the commissioner, shall:\n(1) apply for teacher shortage loan repayment and promptly submit any additional information required by the commissioner; and\n(2) submit to the commissioner a completed affidavit, prescribed by the commissioner, affirming the teacher is teaching in: (i) a license shortage area; or (ii) a rural school district.\n(a) To the extent funding is available, the annual amount of teacher shortage loan repayment for an approved applicant shall not exceed $1,000 or the cumulative balance of the applicant's qualified educational loans, including principal and interest, whichever amount is less.\n(b) Recipients must secure their own qualified educational loans. Teachers who graduate from an approved teacher preparation program or teachers who add a licensure field, consistent with the teacher shortage requirements of this section, are eligible to apply for the loan repayment program.\n(c) No teacher shall receive more than five annual awards.\n(a) The commissioner must make annual disbursements directly to the participant of the amount for which a participant is eligible, for each year that a participant is eligible.\n(b) Within 60 days of the disbursement date, the participant must provide the commissioner with verification that the full amount of loan repayment disbursement has been applied toward the designated loans. A participant that previously received funds under this section but has not provided the commissioner with such verification is not eligible to receive additional funds.\n(a) A teacher who submits a false or misleading application or other false or misleading information to the commissioner may:\n(1) have his or her teaching license suspended or revoked under section 122A.20;\n(2) be disciplined by the teacher's employing school district; or\n(3) be required by the commissioner to repay the total amount of the loan repayment he or she received under this program, plus interest at a rate established under section 270C.40.\n(b) The commissioner must deposit any repayments received under paragraph (a) in the fund established in subdivision 8.\nA teacher shortage loan repayment account is created in the special revenue fund for depositing money appropriated to or received by the commissioner for the program. Money deposited in the account is appropriated to the commissioner, does not cancel, and is continuously available for loan repayment under this section.\nBy February 1 of each year, the commissioner must report to the chairs of the kindergarten through grade 12 and higher education committees of the legislature on the number of individuals who received loan repayment under this section, the race or ethnicity of the teachers participating in the program, the licensure areas and school districts in which the teachers taught, the average amount paid to a teacher participating in the program, and other summary data identified by the commissioner as outcome indicators.\nThe commissioner shall adopt rules under chapter 14 to administer this section.",
	"repealed": false
}