{
	"id": "458D.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.21",
	"title": "458D.21 CONSTRUCTION CONTRACTS.",
	"text": "When the board orders a project involving the acquisition or betterment of a part of the district disposal system, it shall cause plans and specifications of the project to be made, or if previously made, to be modified, if necessary, and to be approved by the agency if required, and after any required approval by the agency, one or more contracts for work and materials called for by such plans and specifications may be awarded as provided in this section.\nNo contract for any construction work, or for the purchase of materials, supplies, or equipment, estimated to cost more than $5,000 shall be made by the board without publishing once in a newspaper having general circulation in the district and once in a trade paper or legal newspaper published in any city of the first class, not less than 14 days before the last day for submission of bids, notice that bids or proposals will be received. Such notice shall state the nature of the work or purchase and the terms and conditions upon which the contract is to be awarded, and the time and place where such bids will be received, opened, and read publicly. After such bids have been duly received, opened, read publicly, and recorded, the board shall within a reasonable time award such contract to the lowest responsible bidder or it may reject all bids and readvertise. Each contract shall be duly executed in writing and the party to whom the contract is awarded shall give sufficient bond or security to the board for the faithful performance of the contract as required by law. If the board by resolution determines that an emergency exists requiring the immediate purchase of materials or supplies or in making emergency repairs, at a cost estimated to be in excess of $5,000, it shall not be necessary to advertise for bids.\nAs an alternative to the procurement method described in subdivision 2, the board may issue a request for proposals and award the contract to the vendor or contractor offering the best value as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nThe board may, without advertising for bids, enter into any contract or purchase any materials, supplies or equipment of the type referred to in subdivision 2 the costs of which is estimated to be $5,000 or less, or it may in the alternative authorize the executive director to enter into a contract on behalf of the board for such work or to make such purchases without prior approval of the board and without advertising for bids.\nExcept as otherwise provided in this section, section 471.345 shall apply.",
	"repealed": false
}