{
	"id": "383A.284",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.284",
	"title": "383A.284 GENERAL; HUMAN RESOURCES POWERS OF DEPARTMENT AND COUNTY BOARD.",
	"text": "The human resources director shall prepare rules to implement the provisions of sections 383A.281 to 383A.301. The rules shall be effective upon approval by the county board. Prior to approval, the county board shall hold a public hearing on the proposed rules after giving notice to county departments, employees, affected labor organizations, and the public. The rules approved by the county board shall have the force and effect of law. The rules may be amended or repealed in the same manner as originally adopted.\nThe executive director or the director's designee shall be the chief labor negotiator for the county. The executive director may, as necessary and at discretion, include department heads of affected departments in the labor negotiation process. The executive director shall recommend to the county board for its final approval all collective bargaining agreements. To the extent they are covered by a collective bargaining agreement, the compensation, term, and conditions of employment for all employees represented by an exclusive representative certified pursuant to chapter 179A shall be governed by the collective bargaining agreement executed by the county board and the parties and it shall supersede any rule or administrative procedure adopted pursuant to sections 383A.281 to 383A.301, unless a provision of the agreement is found to violate other state or federal law.\nThe director of human resources or the director's authorized agent shall be responsible for certification of the payroll vouchers that the persons named in them have been appointed and employed in accordance with the provisions of sections 383A.281 to 383A.301 and the rules under sections 383A.281 to 383A.301. No Ramsey County disbursing or auditing officer shall make or approve or take part in making or approving payment for personal service to a person holding a position in county service unless the payroll voucher or account for the amount bears the certification of the director or the authorized agent.\nThe county board shall establish performance indicators and annually monitor the performance of the personnel management system in the county. The human resources director shall periodically review and evaluate current and future staff needs of all county departments, job classes and descriptions, training and development, and internal and market comparability of all classification and salary schedules and report to the county board on these and other personnel management areas, as requested.\nPrior to each new appointment to the county personnel system, the human resources director shall certify that the person has been appointed in accordance with sections 383A.281 to 383A.301 and applicable rules and regulations.",
	"repealed": false
}