{
	"id": "256B.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.48",
	"title": "256B.48 CONDITIONS FOR PARTICIPATION.",
	"text": "[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n(a) No later than December 31 of each year, an intermediate care facility, including boarding care facilities, which receives medical assistance payments or other reimbursements from the state agency shall:\n(1) provide the state agency with a copy of its audited financial statements;\n(2) provide the state agency with a statement of ownership for the facility;\n(3) provide the state agency with separate, audited financial statements for every other facility owned in whole or part by an individual or entity which has an ownership interest in the facility;\n(4) upon request, provide the state agency with separate, audited financial statements for every organization with which the facility conducts business and which is owned in whole or in part by an individual or entity which has an ownership interest in the facility;\n(5) provide the state agency with copies of leases, purchase agreements, and other documents related to the lease or purchase of the facility; and\n(6) upon request, provide the state agency with copies of leases, purchase agreements, and other documents related to the acquisition of equipment, goods, and services which are claimed as allowable costs.\n(b) Audited financial statements submitted under paragraph (a) must include a balance sheet, income statement, statement of the rate or rates charged to private paying residents, statement of retained earnings, statement of cash flows, notes to the financial statements, audited applicable supplemental information, and the certified public accountant's report. Certified public accountants must conduct audits in accordance with chapter 326A. The cost of an audit shall not be an allowable cost unless the intermediate care facility submits its audited financial statements in the manner otherwise specified in this subdivision. An intermediate care facility must permit access by the state agency to the certified public accountant's work papers that support the audited financial statements submitted under paragraph (a).\n(c) Documents or information provided to the state agency pursuant to this subdivision shall be public.\n(d) If the requirements of paragraphs (a) and (b) are not met, the reimbursement rate may be reduced to 80 percent of the rate in effect on the first day of the fourth calendar month after the close of the reporting period and the reduction shall continue until the requirements are met.\n(e) Intermediate care facilities for the developmentally disabled must maintain statistical and accounting records in sufficient detail to support information contained in the facility's cost report for at least six years, including the year following the submission of the cost report. For computerized accounting systems, the records must include copies of electronically generated media such as magnetic discs and tapes.\n[Repealed, 2016 c 99 art 1 s 43]\nIf the commissioner requests supporting documentation during an audit for an item of cost reported by an intermediate care facility, and the facility's response does not adequately document the item of cost, the commissioner may make reasoned assumptions considered appropriate in the absence of the requested documentation to reasonably establish a payment rate rather than disallow the entire item of cost. This provision shall not diminish the facility's appeal rights.\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2012 c 247 art 4 s 51]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2000 c 449 s 15]",
	"repealed": false
}