{
	"id": "518A.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.68",
	"title": "518A.68 RECREATIONAL LICENSE SUSPENSION.",
	"text": "(a) Upon motion of an obligee or the public authority, and if the court finds that (1) the obligor is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than six times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment agreement pursuant to section 518A.69, or (2) has failed, after receiving notice, to comply with a subpoena relating to a paternity or child support proceeding, the court may direct the commissioner of natural resources to suspend or bar receipt of the obligor's recreational license or licenses. Prior to utilizing this section, the court must find that other substantial enforcement mechanisms have been attempted but have not resulted in compliance.\n(b) For purposes of this section, a recreational license includes all licenses, permits, and stamps issued centrally by the commissioner of natural resources under sections 97B.301, 97B.401, 97B.501, 97B.515, 97B.601, 97B.715, 97B.721, 97B.801, 97C.301, and 97C.305.\n(c) A motion to reinstate a recreational license by the obligor, obligee, or public authority may be granted if the court finds:\n(1) the reason for the suspension was accrual of arrears and the obligor is in compliance with all written payment agreements pursuant to section 518A.69 or has paid the arrears in full;\n(2) the reason for the suspension was failure to comply with a subpoena and the obligor has complied with the subpoena; or\n(3) the original motion to suspend was brought by the public authority and the public authority attests that the IV-D case is eligible for closure.\nWithin 15 days of issuance of an order to reinstate the recreational license, the court shall notify the commissioner of natural resources that the obligor's recreational license or licenses should no longer be suspended nor should receipt be barred.",
	"repealed": false
}