{
	"id": "181.723",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.723",
	"title": "181.723 MISCLASSIFICATION OF CONSTRUCTION EMPLOYEES.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Person\" means any individual, sole proprietor, limited liability company, limited liability partnership, corporation, partnership, incorporated or unincorporated association, joint stock company, or any other legal or commercial entity.\n(b) \"Department\" means the Department of Labor and Industry.\n(c) \"Commissioner\" means the commissioner of labor and industry or a duly designated representative of the commissioner who is either an employee of the Department of Labor and Industry or person working under contract with the Department of Labor and Industry.\n(d) \"Individual\" means a human being.\n(e) \"Day\" means calendar day unless otherwise provided.\n(f) \"Knowingly\" means knew or could have known with the exercise of reasonable diligence.\n(g) \"Business entity\" means a person as that term is defined in paragraph (a), except the term does not include an individual.\n(h) \"Independent contractor\" means a business entity that meets all the requirements under subdivision 4, paragraph (a).\nThis section only applies to persons providing or performing building construction or improvement services. Building construction or improvement services include all public or private sector commercial or residential building construction or improvement services except for: (1) the manufacture, supply, or sale of products, materials, or merchandise; (2) landscaping services for the maintenance or removal of existing plants, shrubs, trees, and other vegetation, whether or not the services are provided as part of a contract for the building construction or improvement services; and (3) all other landscaping services, unless the other landscaping services are provided as part of a contract for the building construction or improvement services.\nExcept as provided in subdivision 4, for purposes of chapters 176, 177, 181, 181A, 182, 268, and 326B, an individual who provides or performs building construction or improvement services for a person that are in the course of the person's trade, business, profession, or occupation is an employee of that person and that person is an employer of the individual.\n(a) An individual is an independent contractor and not an employee of the person for whom the individual is providing or performing services in the course of the person's trade, business, profession, or occupation only if the individual is operating as a business entity that meets all of the following requirements at the time the services were provided or performed:\n(1) was established and maintained separately from and independently of the person for whom the services were provided or performed;\n(2) owns, rents, or leases equipment, tools, vehicles, materials, supplies, office space, or other facilities that are used by the business entity to provide or perform building construction or improvement services;\n(3) provides or performs, or offers to provide or perform, the same or similar building construction or improvement services for multiple persons or the general public;\n(4) is in compliance with all of the following:\n(i) holds a federal employer identification number if required by federal law;\n(ii) holds a Minnesota tax identification number if required by Minnesota law;\n(iii) has received and retained 1099 forms for income received for building construction or improvement services provided or performed, if required by Minnesota or federal law;\n(iv) has filed business or self-employment income tax returns, including estimated tax filings, with the federal Internal Revenue Service and the Department of Revenue, as the business entity or as a self-employed individual reporting income earned, for providing or performing building construction or improvement services, if any, in the previous 12 months; and\n(v) has completed and provided a W-9 federal income tax form to the person for whom the services were provided or performed if required by federal law;\n(5) is in good standing as defined by section 5.26, if applicable;\n(6) has a Minnesota unemployment insurance account if required by chapter 268;\n(7) has obtained required workers' compensation insurance coverage if required by chapter 176;\n(8) holds current business licenses, registrations, and certifications if required by chapter 326B and sections 327.31 to 327.36;\n(9) is operating under a written contract to provide or perform the specific services for the person that:\n(i) is signed and dated by both an authorized representative of the business entity and of the person for whom the services are being provided or performed;\n(ii) is fully executed no later than 30 days after the date work commences;\n(iii) identifies the specific services to be provided or performed under the contract;\n(iv) provides for compensation from the person for the services provided or performed under the contract on a commission or per-job or competitive bid basis and not on any other basis; and\n(v) the requirements of item (ii) shall not apply to change orders;\n(10) submits invoices and receives payments for completion of the specific services provided or performed under the written proposal, contract, or change order in the name of the business entity. Payments made in cash do not meet this requirement;\n(11) the terms of the written proposal, contract, or change order provide the business entity control over the means of providing or performing the specific services, and the business entity in fact controls the provision or performance of the specific services;\n(12) incurs the main expenses and costs related to providing or performing the specific services under the written proposal, contract, or change order;\n(13) is responsible for the completion of the specific services to be provided or performed under the written proposal, contract, or change order and is responsible, as provided under the written proposal, contract, or change order, for failure to complete the specific services; and\n(14) may realize additional profit or suffer a loss, if costs and expenses to provide or perform the specific services under the written proposal, contract, or change order are less than or greater than the compensation provided under the written proposal, contract, or change order.\n(b)(1) Any individual providing or performing the services as or for a business entity is an employee of the person who engaged the business entity, unless the business entity meets all of the requirements under subdivision 4, paragraph (a).\n(2) Any individual who is determined to be the person's employee is acting as an agent of and in the interest of the person when engaging any other individual or business entity to provide or perform any portion of the services that the business entity was engaged by the person to provide or perform.\n(3) Any individual engaged by an employee of the person, at any tier under the person, is also the person's employee, unless the individual is providing or performing the services as or for a business entity that meets the requirements of subdivision 4, paragraph (a).\n(4) Clauses (1) to (3) do not create an employee-employer relationship between a person and an individual if: (i) there is an intervening business entity in the contractual chain between the person and the individual that meets the requirements of subdivision 4, paragraph (a); or (ii) the person establishes that an intervening business entity treats and classifies the individual as an employee for purposes of, and in compliance with, chapters 176, 177, 181, 181A, 268, 268B, 270C, and 290.\n[See Note.]\nMS 2012 [Renumbered 326B.701, subd 2]\nMS 2012 [Renumbered 326B.701, subd 3]\nMS 2012 [Renumbered 326B.701, subd 4]\n[Repealed, 2012 c 295 art 2 s 13]\n(a) The prohibited activities in paragraphs (b) and (c) are in addition to the activities prohibited in sections 326B.081 to 326B.085.\n(b) An individual providing or performing building construction or improvement services shall not represent themselves as an independent contractor unless the individual is operating as a business entity that meets all the requirements of subdivision 4, paragraph (a).\n(c) A person who provides or performs building construction or improvement services in the course of the person's trade, business, occupation, or profession shall not:\n(1) as a condition of payment for services provided or performed, require an individual, who is an employee pursuant to this section, to register as a construction contractor under section 326B.701, or to adopt or agree to being classified, represented, or treated as an independent contractor or form a business entity. Each instance of conditioning payment to an individual who is an employee on one of these conditions shall constitute a separate violation of this provision;\n(2) fail to classify, represent, or treat an individual who is an employee pursuant to this section as an employee in accordance with the requirements of any of the chapters listed in subdivision 3. Failure to classify, represent, or treat an individual who is an employee pursuant to this section as an employee in accordance with each requirement of a chapter listed in subdivision 3 shall constitute a separate violation of this provision;\n(3) fail to report or disclose to any person or to any local, state, or federal government agency an individual who is an employee pursuant to subdivision 3, as an employee when required to do so under any applicable local, state, or federal law. Each failure to report or disclose an individual as an employee shall constitute a separate violation of this provision;\n(4) require or request an individual who is an employee pursuant to this section to enter into any agreement or complete any document that misclassifies, misrepresents, or treats the individual as an independent contractor or otherwise does not reflect that the individual is an employee pursuant to this section. Each agreement or completed document shall constitute a separate violation of this provision; or\n(5) require an individual who is an employee under this section to register under section 326B.701.\n(d) In addition to the person providing or performing building construction or improvement services in the course of the person's trade, business, occupation, or profession, any owner, partner, principal, member, officer, or agent who engaged in any of the prohibited activities in this subdivision knowingly or repeatedly may be held individually liable.\n(e) An order issued by the commissioner to a person for engaging in any of the prohibited activities in this subdivision is in effect against any successor person. A person is a successor person if the person shares three or more of the following with the person to whom the order was issued:\n(1) has one or more of the same owners, members, principals, officers, or managers;\n(2) performs similar work within the state of Minnesota;\n(3) has one or more of the same telephone or fax numbers;\n(4) has one or more of the same email addresses or websites;\n(5) employs or engages substantially the same individuals to provide or perform building construction or improvement services;\n(6) utilizes substantially the same vehicles, facilities, or equipment; or\n(7) lists or advertises substantially the same project experience and portfolio of work.\n(f) If a person who has engaged an individual to provide or perform building construction or improvement services that are in the course of the person's trade, business, profession, or occupation, classifies, represents, treats, reports, or discloses the individual as an independent contractor, the person shall maintain, for at least three years, and in a manner that may be readily produced to the commissioner upon demand, all the information and documentation upon which the person based the determination that the individual met all the requirements under subdivision 4, paragraph (a), at the time the individual was engaged and at the time the services were provided or performed.\n(g) The following damages and penalties may be imposed for a violation of this section:\n(1) compensatory damages to the individual the person failed to classify, represent, or treat as an employee pursuant to this section. Compensatory damages include but are not limited to the value of supplemental pay including minimum wage; overtime; shift differentials; vacation pay; sick pay; and other forms of paid time off; health insurance; life and disability insurance; retirement plans; saving plans and any other form of benefit; employer contributions to unemployment insurance; Social Security and Medicare and any costs and expenses incurred by the individual resulting from the person's failure to classify, represent, or treat the individual as an employee;\n(2) a penalty of up to $10,000 for each individual the person failed to classify, represent, or treat as an employee pursuant to this section;\n(3) a penalty of up to $10,000 for each violation of this subdivision; and\n(4) a penalty of $1,000 for any person who delays, obstructs, or otherwise fails to cooperate with the commissioner's investigation. Each day of delay, obstruction, or failure to cooperate constitutes a separate violation.\n(h) This section may be investigated and enforced under the commissioner's authority under state law.\nMS 2012 [Renumbered 326B.701, subd 5]\n[Repealed, 2012 c 295 art 2 s 13]\nMS 2012 [Renumbered 326B.701, subd 6]\n[Repealed, 2012 c 295 art 2 s 13]\n[Repealed, 2012 c 295 art 2 s 13]\nMS 2012 [Renumbered 326B.701, subd 7]\n[Repealed, 2012 c 295 art 2 s 13]\n[Repealed, 2012 c 295 art 2 s 13]\nThe commissioner may, in consultation with the commissioner of revenue and the commissioner of employment and economic development, adopt, amend, suspend, and repeal rules under the rulemaking provisions of chapter 14 that relate to the commissioner's responsibilities under this section.\n[Repealed, 2012 c 295 art 2 s 13]\nWhen the commissioner has reason to believe that a person has violated subdivision 7, the commissioner must notify the commissioner of revenue and the commissioner of employment and economic development. Upon receipt of notification from the commissioner, the commissioner of revenue must review the information returns required under section 6041A of the Internal Revenue Code. The commissioner of revenue shall also review the submitted certification that is applicable to returns audited or investigated under section 289A.35.\nMS 2012 [Renumbered 326B.701, subd 8]\n[Repealed, 2012 c 295 art 2 s 13]",
	"repealed": false
}