{
	"id": "204B.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.35",
	"title": "204B.35 PREPARATION OF BALLOTS.",
	"text": "All ballots for every election shall be prepared in accordance with sections 204B.35 to 204B.44 and chapter 204D, except for voting machine ballots or as otherwise provided by law.\nBallots shall be prepared in a manner that enables the voters to understand which questions are to be voted upon and the identity and number of candidates to be voted for in each office and to designate their choices easily and accurately. The name of a candidate shall not appear on a ballot in any way that gives the candidate an advantage over an opponent, including words descriptive of the candidate's occupation, qualifications, principles, or opinions, except as otherwise provided by law.\nThe official in charge of preparing ballots shall prepare a sufficient number of ballots:\n(1) to fill applications of absentee voters; and\n(2) to provide each precinct with a sufficient number of ballots of each kind as required by section 204B.29, subdivision 1.\nAt least 46 days before an election, ballots necessary to fill applications of absentee voters shall be prepared and delivered to the officials who administer the provisions of chapter 203B, except as provided in this subdivision. Ballots necessary to fill applications of absentee voters for a town general election held in March shall be prepared and delivered to the town clerk at least 30 days before the election.\nThis section applies to school district elections held on the same day as a statewide election or an election for a county or municipality located partially or wholly within the school district.\nMunicipalities shall determine the voting method in combined local elections when other election jurisdictions located wholly or partially within the municipality schedule elections on the same date as the regular municipal primary or general election.\nNotwithstanding sections 204B.35 to 204B.44 and chapter 204D, a jurisdiction may prepare blank paper ballots, if the jurisdiction employs an electronic voting system and the required information is instead displayed on a touch screen or other electronic device in a format that substantially meets the requirements of law.",
	"repealed": false
}