{
	"id": "473.857",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.857",
	"title": "473.857 SYSTEM STATEMENTS; RECONCILIATION PROCEDURES.",
	"text": "If a local governmental unit and the council are unable to resolve disagreements over the content of a system statement, the unit may by resolution request that a hearing be conducted by the advisory committee or by the state Office of Administrative Hearings for the purpose of considering amendments to the system statement. The request shall be made by the unit within 60 days after receipt of the system statement and shall be accompanied by a description of the disagreement together with specified proposed amendments to the system statement. If no request for a hearing is received by the council within 60 days, the statement shall be final.\nA hearing shall be conducted within 60 days after the request, provided that the advisory committee or the administrative law judge shall consolidate hearings on related requests. The 60-day period within which the hearing shall be conducted may be extended or suspended by mutual agreement of the council and the local governmental unit. The hearing may consider the need for or reasonableness of the metropolitan system plans or parts thereof. The hearing shall afford all interested persons an opportunity to testify and present evidence. The advisory committee or administrative law judge may employ the appropriate technical and professional services of the office of dispute resolution for the purpose of evaluating disputes of fact. The proceedings shall not be deemed a contested case. Within 30 days after the hearing, the advisory committee or the administrative law judge shall report to the council respecting the proposed amendments to the system statements. The report shall contain findings of fact, conclusions, and recommendations and shall apportion the costs of the proceedings among the parties.\nWithin 30 days of receipt of the report, the council, by resolution containing findings of fact and conclusions, shall make a final determination respecting the proposed amendments. At any point in the reconciliation procedure established by this section, the council and a local governmental unit may resolve their disagreement by stipulation.",
	"repealed": false
}