{
	"id": "142A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.09",
	"title": "142A.09 BACKGROUND STUDIES ON LICENSEES AND OTHER PERSONNEL.",
	"text": "The commissioner of children, youth, and families shall contract with the commissioner of human services to conduct background studies of individuals specified in section 245C.03, subdivision 1, affiliated with:\n(1) a facility or program licensed or seeking a license under chapter 142B;\n(2) a license-exempt child care center certified under chapter 142C; or\n(3) a legal nonlicensed child care provider authorized under chapter 142E.\n(a) The commissioner of human services shall conduct the background studies required by subdivision 1 in compliance with the provisions of chapter 245C. The commissioner of human services shall provide necessary forms and instructions, shall conduct the necessary background studies of individuals, and shall provide notification of the results of the studies to the facilities, individuals, and the commissioner of children, youth, and families.\n(b) If the commissioner of human services determines that an individual is disqualified pursuant to chapter 245C, the commissioner of human services shall notify the license holder; the commissioner of children, youth, and families; and the individual and shall inform the individual of the right to request a reconsideration of the disqualification.\n(a) Notwithstanding any provision of chapter 245C, the commissioner of children, youth, and families shall review and decide reconsideration requests, including requests for variances, for all background studies of individuals in subdivision 1, paragraph (a), except for facilities or programs that are also licensed by the commissioner of human services. The commissioner of children, youth, and families must review and decide reconsideration requests in accordance with the procedures and criteria contained in chapter 245C.\n(b) The commissioner of human services is solely responsible for reviewing and deciding a reconsideration request for a background study of an individual affiliated with a facility or program licensed or certified by both the commissioner of children, youth, and families and the commissioner of human services.\n(c) The commissioner of children, youth, and family's decision must be provided to the individual and to the commissioner of human services. The commissioner's decision to grant or deny a reconsideration of disqualification is the final administrative agency action, except under the circumstances described in sections 245C.25, 245C.27, and 245C.28, subdivision 3.\nFacilities and programs described in subdivision 1 shall be responsible for cooperating with the departments in implementing the provisions of this section. The responsibilities imposed on applicants, certification holders, and licensees under chapters 142B and 245C shall apply to these facilities. The provision of section 245C.09 shall apply to the refusal to cooperate with the completion of the background studies by an applicant, a licensee, a registrant, or an individual.",
	"repealed": false
}