{
	"id": "245C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.10",
	"title": "245C.10 BACKGROUND STUDY; FEES.",
	"text": "[Repealed, 2009 c 142 art 2 s 49]\nSection 181.645 does not apply to background studies completed under this chapter.\n(a) The commissioner shall recover the cost of background studies. Except as otherwise provided in subdivisions 1c and 1d, the fees collected under this section shall be appropriated to the commissioner for the purpose of conducting background studies under this chapter. Fees under this section are charges under section 16A.1283, paragraph (b), clause (3).\n(b) Background study fees may include:\n(1) a fee to compensate the commissioner's authorized fingerprint collection vendor or vendors for obtaining and processing a background study subject's classifiable fingerprints and photograph pursuant to subdivision 1c; and\n(2) a separate fee under subdivision 1c to complete a review of background-study-related records as authorized under this chapter.\n(c) Fees charged under paragraph (b) may be paid in whole or in part when authorized by law by a state agency or board; by state court administration; by a service provider, employer, license holder, or other organization that initiates the background study; by the commissioner or other organization with duly appropriated funds; by a background study subject; or by some combination of these sources.\nThe commissioner shall enter into a contract with a qualified vendor or vendors to obtain and process a background study subject's classifiable fingerprints and photograph as required by section 245C.05. The commissioner may, at their discretion, directly collect fees and reimburse the commissioner's authorized fingerprint collection vendor for the vendor's services or require the vendor to collect the fees. The authorized vendor is responsible for reimbursing the vendor's subcontractors at a rate specified in the contract with the commissioner.\nThe commissioner may increase background study fees as necessary, commensurate with an increase in state Bureau of Criminal Apprehension or the national criminal history record check fees.\nThe commissioner shall recover the cost of the background studies initiated by supplemental nursing services agencies registered under section 144A.71, subdivision 1, through a fee of no more than $44 per study charged to the agency. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall set fees to recover the cost of combined background studies and criminal background checks initiated by applicants, licensees, and certified practitioners regulated under sections 148.511 to 148.5198 and chapter 153A through a fee of no more than $44 per study charged to the entity. The fees collected under this subdivision shall be deposited in the special revenue fund and are appropriated to the commissioner for the purpose of conducting background studies and criminal background checks.\nThe commissioner shall recover the cost of background studies initiated by a personal care provider organization under sections 256B.0651 to 256B.0654 and 256B.0659 through a fee of no more than $44 per study charged to the organization responsible for submitting the background study form. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of the background studies initiated by temporary personnel agencies, personnel pool agencies, educational programs, and professional services agencies that initiate background studies under section 245C.03, subdivision 4, through a fee of no more than $44 per study charged to the agency. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies required under section 245C.03, subdivision 1, for the purposes of adult foster care and family adult day services licensing, through a fee of no more than $44 per study charged to the license holder. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by unlicensed home and community-based waiver providers of service to seniors and individuals with disabilities under section 256B.4912 through a fee of no more than $44 per study.\nThe commissioner shall recover the cost of conducting background studies under section 245C.33 for studies initiated by private agencies for the purpose of adoption through a fee of no more than $70 per study charged to the private agency. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies required under section 245C.03, subdivision 7, for the purposes of children's therapeutic services and supports under section 256B.0943, through a fee of no more than $44 per study charged to the license holder. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies required under section 245C.03, subdivision 1, for all programs that are licensed by the commissioner, except child foster care when the applicant or license holder resides in the home where child foster care services are provided, family child care, child care centers, certified license-exempt child care centers, and legal nonlicensed child care authorized under chapter 142E, through a fee of no more than $44 per study charged to the license holder. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of a background study required for family child care, certified license-exempt child care centers, licensed child care centers, and legal nonlicensed child care providers authorized under chapter 142E through a fee of no more than $44 per study charged to the license holder. A fee of no more than $44 per study shall be charged for studies conducted under section 245C.05, subdivision 5a, paragraph (a). The fees collected under this subdivision are appropriated to the commissioner to conduct background studies.\nThe commissioner shall recover the cost of background studies initiated by an agency-provider delivering services under section 256B.85, subdivision 11, or a financial management services provider providing service functions under section 256B.85, subdivision 13, through a fee of no more than $44 per study, charged to the organization responsible for submitting the background study form. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by providers of housing support under section 256I.04 through a fee of no more than $44 per study. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by county social services agencies and local welfare agencies for individuals who are required to have a background study under section 260E.36, subdivision 3, through a fee of no more than $44 per study. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by providers of special transportation service under section 174.30 through a fee of no more than $44 per study. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by a licensed children's residential facility through a fee of no more than $53 per study. Fees collected under this subdivision are appropriated to the commissioner for purposes of conducting background studies.\n(a) The commissioner shall recover the cost of conducting maltreatment and state licensing agency checks for guardians and conservators under section 245C.033 through a fee of no more than $50. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting maltreatment and state licensing agency checks.\n(b) The fee must be paid directly to and in the manner prescribed by the commissioner before any maltreatment and state licensing agency checks under section 245C.033 may be conducted.\n(c) Notwithstanding paragraph (b), the court shall pay the fee for an applicant who has been granted in forma pauperis status upon receipt of the invoice from the commissioner.\nThe commissioner shall recover the cost of background studies initiated by providers of housing stabilization services under section 256B.051 through a fee of no more than $44 per study. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe commissioner shall recover the cost of background studies required under section 245C.03, subdivision 15, for the purposes of early intensive developmental and behavioral intervention under section 256B.0949, through a fee of no more than $44 per study charged to the enrolled agency. The fees collected under this subdivision are appropriated to the commissioner for the purpose of conducting background studies.\nThe applicant or license holder is responsible for paying to the Department of Human Services all fees associated with the preparation of the fingerprints, the criminal records check consent form, and, through a fee of no more than $44 per study, the criminal background check.\nThe commissioner shall set fees to recover the cost of background studies and criminal background checks initiated by MNsure under sections 62V.05 and 245C.031. The fee amount shall be established through interagency agreement between the commissioner and the board of MNsure or its designee. The fees collected under this subdivision shall be deposited in the special revenue fund and are appropriated to the commissioner for the purpose of conducting background studies and criminal background checks.\nThe commissioner shall recover the cost of background studies initiated by the Professional Educators Licensing Standards Board through a fee of no more than $53 per study. Fees collected under this subdivision are appropriated to the commissioner for purposes of conducting background studies.\nThe commissioner shall recover the cost of background studies initiated by the Board of School Administrators through a fee of no more than $53 per study. Fees collected under this subdivision are appropriated to the commissioner for purposes of conducting background studies.",
	"repealed": false
}