{
	"id": "458A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.26",
	"title": "458A.26 ADMINISTRATION.",
	"text": "The authority shall have the power:\n(a) To adopt and alter all bylaws and rules and regulations which it shall from time to time deem best for the conduct of the business of the authority, and for the use and operation of the bus transportation system and the facilities of the authority, and for the purposes of carrying out the objects of sections 458A.21 to 458A.37; but such bylaws, rules and regulations shall not be in conflict with the terms of sections 458A.21 to 458A.37.\n(b) To appoint and remove an executive director, and such other executive and administrative employees as the authority may deem necessary, including the appointment of consultants, except attorneys; and to prescribe the duties and fix the compensation of such executive director and other executive and administrative employees or consultants. Neither the executive director nor any executive or administrative employees of the authority shall be within the civil service classifications of the city of Duluth, whether such employees were employees of the system acquired, or were appointed by the authority after the system was acquired by the authority. The provisions of sections 197.455 through 197.46, shall not be applicable to any such employees of the authority under this section.\n(c) To prescribe or provide for a policy or policies of insurance for the defense and indemnification of the city of Duluth, its officers and employees, and directors, executive director, and administrative employees of the authority, against claims arising against them out of the performance of duty, whether such claims be groundless, or otherwise. Premiums for any policies of insurance required by sections 458A.21 to 458A.37 shall be paid for out of the funds of the Duluth Transit Authority.\n(d) To utilize the services and facilities of the Department of Management and Budget and the city treasurer of the city of Duluth in the implementation of sections 458A.21 to 458A.37; and to pay the city for all charges and costs for such services. The city attorney and the purchasing agent shall be the attorney and the purchasing agent, respectively, for the authority; and the authority shall reimburse the city for all charges and costs incurred by the city therefor.\n(e) To authorize and direct the city treasurer to invest, in the manner provided by law, any funds held in reserve, or sinking funds, or any funds not required for immediate disbursement.\n(f) To establish and determine routes, and the scheduling of service, for the transportation system.\n(g) To fix, alter, change, and collect fares, fees, rentals, and all other charges to be made for all services or facilities furnished by the authority to the public, or to any persons, or public or private agencies; provided, however, that no change in fares shall be made except upon public hearing before the city council, and approval by the city council, of any such change in fares.",
	"repealed": false
}