{
	"id": "375A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.02",
	"title": "375A.02 ELECTED EXECUTIVE PLAN.",
	"text": "In a county adopting the elected executive plan, the chief executive officer shall be known as county executive. The first county executive shall be elected at the county general election following the adoption of the elected executive plan and every four years thereafter. The county executive shall hold office for a term of four years commencing on the first Monday of January following election. Only a voter of a county shall be eligible for election as county executive. The county executive shall be nominated and elected by all the voters of the county in the manner provided by law for the election of county officers. In case the office of county executive is or becomes vacant by reason of death, resignation or removal, it shall be filled by the board of county commissioners for the unexpired term.\nThe salary of the county executive for the first year of the term shall be set by the county board not less than 30 days before the first day candidates may file for the office; thereafter, the salary of the county executive shall be set annually by the county board at the January meeting of the board; provided that the salary of the county executive shall not be less than 150 percent of the salary of the highest paid member of the board of county commissioners. A minimum salary for such subsequent term of the county executive shall be fixed by the county board not less than 30 days before the first day candidates may file for the office in an amount not less than the minimum provided in this section.\n(a) The county executive shall be the administrative head of the county and shall have all the powers and shall perform all the duties of an administrative or executive nature vested in or imposed upon the board of county commissioners by law or by agreement with any municipality or other subdivision of government and such additional powers as are granted or imposed by the board.\n(b) The county executive shall be responsible for the proper administration of the affairs of the county placed in the county executive's charge.\n(c) By resolution of the county board the county executive may serve as the head of any county department created by law or established by the board provided the county executive has the qualifications required by law.\n(d) Responsibilities of the county executive shall include, but are not limited to, the following duties:\n(1) appoint an administrative assistant who shall be qualified by education and training in governmental or business administration and who will be responsible to the executive for the orderly and efficient operation and coordination of the various departments of county government;\n(2) appoint and hire qualified staff to assist the executive;\n(3) provide for the execution of all ordinances and resolutions of the board and all laws of the state subject to enforcement by the county executive or by officers who are under the county executive's direction and supervision;\n(4) exercise all authority of the board of county commissioners to appoint, suspend, and remove all county personnel whose appointment, suspension, or removal was a function of the county board under general law, make such nominations and appointments to additional offices as the county board may determine and make appointments to such advisory boards and committees as the executive may create;\n(5) provide for all county purchases including purchases of services pursuant to purchasing regulations established by the county board, but county purchasing services may be made available for use by other counties and governmental subdivisions;\n(6) prepare and submit, if directed by the board to do so, an administrative code incorporating the details of administrative procedure for the operation of the county and from time to time suggest amendments to such code;\n(7) attend any meetings of the board of county commissioners with the right to take part in any discussion, but not to vote; and may recommend to the board such action as the county executive deems advisable; and\n(8) prepare and submit to the county board an annual budget and a long-range capital expenditure program covering a period not less than the five ensuing years each of which shall include detailed estimates of revenue and expenditures and enforce the provisions of the budget when adopted by the county board.\nThe county executive shall have the power to veto any ordinance or resolution adopted by the board of county commissioners. A veto by the county executive may apply to all or any items of an ordinance or resolution appropriating money. Certification of a veto must be made by the executive within ten days of the adoption of the ordinance or resolution by the county board and the county board may override the veto by a two-thirds vote of all its members. An ordinance or resolution shall become effective upon approval by the county executive, the expiration of ten days after the adoption of the ordinance or resolution without approval or veto, or the overriding of a veto.\nThe county board shall elect from its numbers a chair of the board who shall preside at all meetings of the board.",
	"repealed": false
}