{
	"id": "62V.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62V.04",
	"title": "62V.04 GOVERNANCE.",
	"text": "MNsure is governed by a board of directors with seven members.\n(a) Board membership of MNsure consists of the following:\n(1) three members appointed by the governor with the advice and consent of both the senate and the house of representatives acting separately in accordance with paragraph (d), with one member representing the interests of individual consumers eligible for individual market coverage, one member representing individual consumers eligible for public health care program coverage, and one member representing small employers. Members are appointed to serve four-year terms following the initial staggered-term lot determination;\n(2) three members appointed by the governor with the advice and consent of both the senate and the house of representatives acting separately in accordance with paragraph (d) who have demonstrated expertise, leadership, and innovation in the following areas: one member representing the areas of health administration, health care finance, health plan purchasing, and health care delivery systems; one member representing the areas of public health, health disparities, public health care programs, and the uninsured; and one member representing health policy issues related to the small group and individual markets. Members are appointed to serve four-year terms following the initial staggered-term lot determination; and\n(3) the commissioner of human services or a designee.\n(b) Section 15.0597 shall apply to all appointments, except for the commissioner.\n(c) The governor shall make appointments to the board that are consistent with federal law and regulations regarding its composition and structure. All board members appointed by the governor must be legal residents of Minnesota.\n(d) Upon appointment by the governor, a board member shall exercise duties of office immediately. If both the house of representatives and the senate vote not to confirm an appointment, the appointment terminates on the day following the vote not to confirm in the second body to vote.\n(e) Initial appointments shall be made by April 30, 2013.\n(f) One of the six members appointed under paragraph (a), clause (1) or (2), must have experience in representing the needs of vulnerable populations and persons with disabilities.\n(g) Membership on the board must include representation from outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2.\n(a) Board members may serve no more than two consecutive terms, except for the commissioner or the commissioner's designee, who shall serve until replaced by the governor.\n(b) A board member may resign at any time by giving written notice to the board.\n(c) The appointed members under subdivision 2, paragraph (a), clauses (1) and (2), shall have an initial term of two, three, or four years, determined by lot by the secretary of state.\n(a) Within one year prior to or at any time during their appointed term, board members appointed under subdivision 2, paragraph (a), clauses (1) and (2), shall not be employed by, be a member of the board of directors of, or otherwise be a representative of a health carrier, institutional health care provider or other entity providing health care, navigator, insurance producer, or other entity in the business of selling items or services of significant value to or through MNsure. For purposes of this paragraph, \"health care provider or entity\" does not include an academic institution.\n(b) Board members must recuse themselves from discussion of and voting on an official matter if the board member has a conflict of interest. A conflict of interest means an association including a financial or personal association that has the potential to bias or have the appearance of biasing a board member's decisions in matters related to MNsure or the conduct of activities under this chapter.\n(c) No board member shall have a spouse who is an executive of a health carrier.\n(d) No member of the board may currently serve as a lobbyist, as defined under section 10A.01, subdivision 21.\n(a) The governor shall designate as acting chair one of the appointees described in subdivision 2.\n(b) The board shall hold its first meeting within 60 days of enactment.\n(c) The board shall elect a chair to replace the acting chair at the first meeting.\nThe board shall have a chair, elected by a majority of members. The chair shall serve for one year.\nThe members of the board shall elect officers by a majority of members. The officers shall serve for one year.\nIf a vacancy occurs, the governor shall appoint a new member within 90 days, and the newly appointed member shall be subject to the same confirmation process described in subdivision 2.\n(a) A board member may be removed by the appointing authority and a majority vote of the board following notice and hearing before the board. For purposes of this subdivision, the appointing authority or a designee of the appointing authority shall be a voting member of the board for purposes of constituting a quorum.\n(b) A conflict of interest as defined in subdivision 4, shall be cause for removal from the board.\nThe board shall meet at least quarterly.\nA majority of the members of the board constitutes a quorum, and the affirmative vote of a majority of members of the board is necessary and sufficient for action taken by the board.\nBeginning January 1, 2016, the board members may be compensated in accordance with section 15.0575.\n(a) The board shall establish and maintain advisory committees to provide insurance producers, health care providers, the health care industry, consumers, and other stakeholders with the opportunity to advise the board regarding the operation of MNsure as required under section 1311(d)(6) of the Affordable Care Act, Public Law 111-148. The board shall regularly consult with the advisory committees. The advisory committees established under this paragraph shall not expire.\n(b) The board may establish additional advisory committees, as necessary, to gather and provide information to the board in order to facilitate the operation of MNsure. The advisory committees established under this paragraph shall not expire, except by action of the board.\n(c) Section 15.0597 shall not apply to any advisory committee established by the board under this subdivision.\n(d) The board may provide compensation and expense reimbursement under section 15.059, subdivision 3, to members of the advisory committees.",
	"repealed": false
}