{
	"id": "353.371",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.371",
	"title": "353.371 POSTRETIREMENT OPTION.",
	"text": "This section applies to a basic or coordinated member of the general employees retirement plan of the Public Employees Retirement Association who:\n(1) for at least the five years immediately preceding separation under clause (2), was regularly scheduled to work 1,044 or more hours per year in a position covered by the general employees retirement plan of the Public Employees Retirement Association not including positions that are elected offices;\n(2) has a termination of membership as defined under section 353.01, subdivision 11b;\n(3) at the time of termination under clause (2), was at least age 62 and met the age and service requirements necessary to receive a retirement annuity from the plan and satisfied requirements for the commencement of the retirement annuity in the month following termination;\n(4) accepts a phased retirement agreement to continue employment in the same position with the same governmental subdivision that the member held before the date of the member's termination of membership and to work a reduced schedule that is both:\n(i) a reduction of at least 25 percent from the employee's number of previously regularly scheduled work hours per pay period; and\n(ii) 1,044 hours per year or less in public service; and\n(5) is not eligible for participation in the state employee postretirement option program under section 43A.346.\nNotwithstanding sections 353.29 and 353.30, an employee covered by a phased retirement agreement need not have a termination of public service to be eligible for a retirement annuity. The provisions of section 353.37 governing annuities of reemployed annuitants do not apply to employment under a phased retirement agreement.\nThe governmental subdivision has sole discretion to determine if and the extent to which a phased retirement position under this section is available to an employee. Any offer of such a position must be made in writing to the employee by the governmental subdivision in a manner prescribed by the executive director.\nThe term of employment under a phased retirement agreement must not exceed five years. If the term of a phased retirement agreement is less than five years, the agreement may be renewed for a period not to exceed a combined total of five years. The governmental subdivision has sole discretion to determine if a phased retirement agreement will be renewed, renewed with modifications, or terminated.\nThe governmental subdivision shall provide the executive director with documentation, as prescribed by the executive director, of the terms of any agreement entered into with an employee who accepts continuing employment with the governmental subdivision under the terms of this section. The documentation must be provided before the employee's termination of membership.\n(a) Notwithstanding any law to the contrary, a person may not earn allowable service in the general employees retirement plan of the Public Employees Retirement Association for employment covered under this section, and employer contributions and payroll deductions for the retirement fund must not be made based on earnings of a person working under an agreement covered by this section. No change may be made to a monthly annuity or retirement allowance based on employment under this section.\n(b) The governmental subdivision shall report to the executive director the salary earned by an employee in a phased retirement position. The report must include the number of compensated hours the employee worked and must be made on a pay period basis in a manner prescribed by the executive director. Reports must be submitted no later than 14 calendar days following the last day of each pay period.\n(a) Upon termination of employment under a phased retirement agreement, the governmental subdivision and employee must inform the executive director, in a manner prescribed by the executive director, of the effective date of the employee's termination of public service. The termination from public service must meet the termination and length of separation requirements under section 353.01, subdivisions 11a and 28.\n(b) If a person previously employed under a phased retirement agreement subsequently accepts employment with any other governmental subdivision, the person may not earn allowable service in the general employees retirement plan of the Public Employees Retirement Association, no employer contributions or payroll deductions for the retirement fund may be made, and the provisions of section 353.37 apply to the subsequent employment.\nMS 2018 [Repealed, 1Sp2019 c 8 art 2 s 13]\nIf an employee works more hours under a phased retirement agreement than is permitted under subdivision 1, paragraph (a), clause (4), then, effective on the first of the month following the date on which the permitted number of hours was exceeded:\n(1) the phased retirement agreement is terminated; and\n(2) the employee's retirement annuity is suspended until the employee meets the termination and length of service requirement in section 353.01, subdivisions 11a and 28.",
	"repealed": false
}