{
	"id": "260.774",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.774",
	"title": "260.774 IMPROPER REMOVAL OF CHILD, DECLINATION OF JURISDICTION, INVALIDATION, RETURN OF CUSTODY.",
	"text": "In any proceeding where custody of the Indian child was improperly removed from the parent or Indian custodian or where the petitioner has improperly retained custody after a visit or other temporary relinquishment of custody, the court shall decline jurisdiction over the petition and shall immediately return the Indian child to the Indian child's parent or Indian custodian unless returning the Indian child to the Indian child's parent or Indian custodian would subject the Indian child to a substantial and immediate danger or threat of such danger.\n(a) Any order for child placement, transfer of custody, termination of parental rights, or other permanent change in custody of an Indian child shall be invalidated upon a showing, by a preponderance of the evidence, that a violation of any one of the provisions in section 260.761, 260.762, 260.763, 260.765, 260.771, 260.773, or 260.7745 has occurred.\n(b) The Indian child, the Indian child's parent or parents, guardian, Indian custodian, or Indian Tribe may file a petition or motion to invalidate under this subdivision.\n(c) Upon a finding that a violation of one of the provisions in section 260.761, 260.762, 260.763, 260.765, 260.771, 260.773, or 260.7745 has occurred, the court shall:\n(1) dismiss the petition without prejudice;\n(2) return the Indian child to the care, custody, and control of the parent or parents or Indian custodian, unless the Indian child would be subjected to imminent physical damage or harm; and\n(3) determine whether the Indian child's parent or Indian custodian has been assessed placement costs and order reimbursement of those costs.\n(d) Upon a finding that a willful, intentional, knowing, or reckless violation of one of the provisions in section 260.761, 260.762, 260.763, 260.765, 260.771, 260.773, or 260.7745 has occurred, the court may consider whether sanctions, reasonable costs, and attorney fees should be imposed against the offending party.\n(a) Whenever a final decree of adoption of an Indian child has been vacated, set aside, or there is a termination of the parental rights of the adoptive parents to the Indian child, a biological parent or prior Indian custodian may petition for return of custody and the court shall grant the petition unless there is a showing, in proceedings subject to the provision of sections 260.751 to 260.835, that the return of custody is not in the best interests of the Indian child.\n(b) The county attorney, Indian child, Indian child's Tribe, Indian custodian, or an Indian child's parent whose parental rights were terminated under a previous order of the court may file a petition for the return of custody.\n(c) A petition for return of custody may be filed in court when:\n(1) the parent or Indian custodian has corrected the conditions that led to an order terminating parental rights;\n(2) the parent or Indian custodian is willing and has the capability to provide day-to-day care and maintain the health, safety, and welfare of the Indian child; and\n(3) the adoption has been vacated, set aside, or termination of the parental rights of the adoptive parents to the Indian child has occurred.\n(d) A petition for reestablishment of the legal parent and child relationship for an Indian child who has not been adopted must meet the requirements in section 260C.329.",
	"repealed": false
}