{
	"id": "260E.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.33",
	"title": "260E.33 RECONSIDERATION AND APPEAL OF MALTREATMENT DETERMINATION FOLLOWING INVESTIGATION.",
	"text": "Administrative reconsideration is not applicable to a family assessment or noncaregiver human trafficking assessment since no determination concerning maltreatment is made.\n[See Note.]\n(a) Except as provided under subdivision 5, an individual or facility that the commissioner of human services; commissioner of children, youth, and families; a local welfare agency; or the commissioner of education determines has maltreated a child, an interested person acting on behalf of the child, regardless of the determination, who contests the investigating agency's final determination regarding maltreatment may request the investigating agency to reconsider its final determination regarding maltreatment. The request for reconsideration must be submitted in writing or submitted in the provider licensing and reporting hub to the investigating agency within 15 calendar days after receipt of notice of the final determination regarding maltreatment or, if the request is made by an interested person who is not entitled to notice, within 15 days after receipt of the notice by the parent or guardian of the child. If mailed, the request for reconsideration must be postmarked and sent to the investigating agency within 15 calendar days of the individual's or facility's receipt of the final determination. If the request for reconsideration is made by personal service, it must be received by the investigating agency within 15 calendar days after the individual's or facility's receipt of the final determination. Upon implementation of the provider licensing and reporting hub, the individual or facility must use the hub to request reconsideration. The reconsideration must be received by the commissioner within 15 calendar days of the individual's receipt of the notice of disqualification.\n(b) An individual who was determined to have maltreated a child under this chapter and who was disqualified on the basis of serious or recurring maltreatment under sections 245C.14 and 245C.15 may request reconsideration of the maltreatment determination and the disqualification. The request for reconsideration of the maltreatment determination and the disqualification must be submitted within 30 calendar days of the individual's receipt of the notice of disqualification under sections 245C.16 and 245C.17. If mailed, the request for reconsideration of the maltreatment determination and the disqualification must be postmarked and sent to the investigating agency within 30 calendar days of the individual's receipt of the maltreatment determination and notice of disqualification. If the request for reconsideration is made by personal service, it must be received by the investigating agency within 30 calendar days after the individual's receipt of the notice of disqualification.\n(a) Except as provided under subdivisions 5 and 6, if the investigating agency denies the request or fails to act upon the request within 15 working days after receiving the request for reconsideration, the person or facility entitled to a fair hearing under section 142A.20 or 256.045 may submit to the commissioner of human services; the commissioner of children, youth, and families; or the commissioner of education a written request for a hearing under section 142A.20 or 256.045. Section 256.045 also governs hearings requested to contest a final determination of the commissioner of education. Section 142A.20 governs hearings requested to contest a final determination of the commissioner of children, youth, and families. The investigating agency shall notify persons who request reconsideration of their rights under this paragraph. The hearings specified under this section are the only administrative appeal of a decision issued under subdivision 2. Determinations under this section are not subject to accuracy and completeness challenges under section 13.04.\n(b) Except as provided under subdivision 6, if an individual or facility contests the investigating agency's final determination regarding maltreatment by requesting a fair hearing under section 142A.20 or 256.045, the commissioner of human services or children, youth, and families shall ensure that the hearing is conducted and a decision is reached within 90 days of receipt of the request for a hearing. The time for action on the decision may be extended for as many days as the hearing is postponed or the record is held open for the benefit of either party.\nIf, as a result of a reconsideration or fair hearing, the investigating agency changes the determination of maltreatment, that agency shall notify every parent, guardian, or legal custodian previously notified of the investigation, the commissioner of the agency responsible for assessing or investigating the report, the local welfare agency, and, if applicable, the director of the facility and the private licensing agency.\nIf an individual was disqualified under sections 245C.14 and 245C.15 on the basis of a determination of maltreatment which was serious or recurring, and the individual requested reconsideration of the maltreatment determination under subdivision 2 and requested reconsideration of the disqualification under sections 245C.21 to 245C.27, reconsideration of the maltreatment determination and reconsideration of the disqualification shall be consolidated into a single fair hearing. If reconsideration of the maltreatment determination is denied and the individual remains disqualified following a reconsideration decision, the individual may request a fair hearing under section 142A.20 or 256.045. If an individual requests a fair hearing on the maltreatment determination and the disqualification, the scope of the fair hearing shall include both the maltreatment determination and the disqualification.\nIf a maltreatment determination or a disqualification based on serious or recurring maltreatment is the basis for a denial of a license under section 245A.05 or a licensing sanction under section 245A.07, the license holder has the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. As provided for under section 245A.08, subdivision 2a, the scope of the contested case hearing shall include the maltreatment determination, disqualification, and licensing sanction or denial of a license. In such cases, a fair hearing regarding the maltreatment determination and disqualification shall not be conducted under section 256.045. Except for family child care and child foster care, reconsideration of a maltreatment determination as provided under this subdivision and reconsideration of a disqualification as provided under section 245C.22 shall also not be conducted when:\n(1) a denial of a license under section 245A.05 or a licensing sanction under section 245A.07 is based on a determination that the license holder is responsible for maltreatment or the disqualification of a license holder based on serious or recurring maltreatment;\n(2) the denial of a license or licensing sanction is issued at the same time as the maltreatment determination or disqualification; and\n(3) the license holder appeals the maltreatment determination or disqualification and denial of a license or licensing sanction.\nNotwithstanding clauses (1) to (3), if the license holder appeals the maltreatment determination or disqualification but does not appeal the denial of a license or a licensing sanction, reconsideration of the maltreatment determination shall be conducted under subdivision 2 and section 626.557, subdivision 9d, and reconsideration of the disqualification shall be conducted under section 245C.22. In such cases, a fair hearing shall also be conducted as provided under subdivision 2 and sections 245C.27 and 626.557, subdivision 9d.\nIf the disqualified subject is an individual other than the license holder and upon whom a background study must be conducted under chapter 245C, the hearings of all parties may be consolidated into a single contested case hearing upon consent of all parties and the administrative law judge.\nWhen an appeal of a lead investigative agency determination results in a contested case hearing under chapter 245A or 245C, the administrative law judge shall notify the parent, legal custodian, or guardian of the child who is the subject of the maltreatment determination. The notice must be sent by certified mail and inform the parent, legal custodian, or guardian of the child of the right to file a signed written statement in the proceedings and the right to attend and participate in the hearing. The parent, legal custodian, or guardian of the child may file a written statement with the administrative law judge hearing the case no later than five business days before commencement of the hearing. The administrative law judge shall include the written statement in the hearing record and consider the statement in deciding the appeal. The lead investigative agency shall provide to the administrative law judge the address of the parent, legal custodian, or guardian of the child. If the lead investigative agency is not reasonably able to determine the address of the parent, legal custodian, or guardian of the child, the administrative law judge is not required to send a hearing notice under this subdivision.\nIf a maltreatment determination is the basis for a correction order under section 142C.06 or decertification under section 142C.07, the certification holder has the right to request reconsideration under sections 142C.06 and 142C.07. If the certification holder appeals the maltreatment determination or disqualification, but does not appeal the correction order or decertification, reconsideration of the maltreatment determination shall be conducted under subdivision 2 and reconsideration of the disqualification shall be conducted under section 245C.22.",
	"repealed": false
}