{
	"id": "317A.439",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.439",
	"title": "317A.439 MEMBERS' LIST FOR MEETING.",
	"text": "After fixing a record date for notice of and voting at a meeting, a corporation shall prepare an alphabetical list of the names of its members who are entitled to notice and to vote. The list must show the address and number of votes each member is entitled to vote at the meeting.\nThe list of members must be available for inspection by a member with voting rights for the purpose of communication with other members concerning the meeting, beginning two business days after the meeting notice is given and continuing through the meeting, at the corporation's registered office or at a reasonable place identified in the meeting notice in the city where the meeting will be held. The list also must be available at the meeting. A member, a member's agent, or attorney is entitled on written demand to inspect and to copy the list, at a reasonable time and at the member's expense, during the period it is available for inspection and at any time during the meeting or an adjournment.\nIf the corporation refuses to allow a member with voting rights, the member's agent, or attorney to inspect the list of members before or at the meeting, the district court of the county where a corporation's registered office is located, on application of the member, may:\n(1) order the inspection or copying at the corporation's expense;\n(2) postpone the meeting until the inspection or copying is complete; or\n(3) order the corporation to pay the member's costs, including reasonable attorneys fees, incurred to obtain the order.\nUnless a written demand to inspect and copy a membership list has been made under subdivision 2 before the membership meeting and a corporation improperly refuses to comply with the demand, refusal, or failure to comply with this section does not affect the validity of action taken at the meeting.\nA member, agent, or attorney who gains access to a membership list under this section may not use or give to another for use the membership list for any purpose other than a proper purpose. Upon application of the corporation, the district court may issue a protective order or order other relief necessary to enforce this subdivision.\nA neighborhood organization as defined in section 317A.435, subdivision 4, is not required to prepare a membership list under this section, if it has chosen to be governed by this subdivision by so providing in its articles or bylaws.",
	"repealed": false
}