{
	"id": "611.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.43",
	"title": "611.43 COMPETENCY EXAMINATION AND REPORT.",
	"text": "(a) If the court orders an examination pursuant to section 611.42, subdivision 3, the court shall appoint a court examiner to examine the defendant and report to the court on the defendant's competency to proceed. A court examiner may obtain from court administration and review the report of any prior or subsequent examination under this section or under Minnesota Rules of Criminal Procedure, rule 20.\n(b) If the defendant is not entitled to release, the court shall order the defendant to participate in an examination where the defendant is being held, or the court may order that the defendant be confined in a treatment facility, locked treatment facility, or a state-operated treatment facility until the examination is completed.\n(c) If the defendant is entitled to release, the court shall order the defendant to appear for an examination. If the defendant fails to appear at an examination, the court may amend the conditions of release and bail.\n(d) A competency examination ordered under Minnesota Rules of Criminal Procedure, rule 20.04, shall proceed under this section.\n(a) The court examiner's written report shall be filed with the court and provided to the prosecutor and defense counsel by the court. The report shall be filed no more than 30 days after the order for examination of a defendant in custody unless extended by the court for good cause. If the defendant is out of custody or confined in a state-operated treatment program or treatment facility, the report shall be filed no more than 60 days after the order for examination, unless extended by the court for good cause. The report shall not include opinions concerning the defendant's mental condition at the time of the alleged offense or any statements made by the defendant regarding the alleged criminal conduct, unless necessary to support the examiner's opinion regarding competence or incompetence.\n(b) The report shall include an evaluation of the defendant's mental health, cognition, and the factual basis for opinions about:\n(1) any diagnoses made, and the results of any testing conducted with the defendant;\n(2) the defendant's competency to stand trial;\n(3) the level of care and education required for the defendant to attain, be restored to, or maintain competency;\n(4) a recommendation of the least restrictive setting appropriate to meet the defendant's needs for attaining competency and immediate safety;\n(5) the impact of any substance use disorder on the defendant, including the defendant's competency, and any recommendations for treatment;\n(6) the likelihood the defendant will attain competency in the reasonably foreseeable future;\n(7) whether the defendant poses a substantial likelihood of physical harm to self or others; and\n(8) if the court examiner's opinion is that the defendant is incompetent to proceed, whether the defendant possesses capacity to make decisions regarding neuroleptic medication unless the examiner is unable to render an opinion on capacity. If the examiner is unable to render an opinion on capacity, the report must document the reasons why the examiner is unable to render that opinion.\n(c) If the court examiner determines that the defendant presents an imminent risk of serious danger to another, is imminently suicidal, or otherwise needs emergency intervention, the examiner must promptly notify the court, prosecutor, defense counsel, and those responsible for the care and custody of the defendant.\n(d) If the defendant appears for the examination but does not participate, the court examiner shall submit a report and, if sufficient information is available, may render an opinion on competency and an opinion as to whether the unwillingness to participate resulted from a mental illness, cognitive impairment, or other factors.\n(e) If the court examiner determines the defendant would benefit from services for engagement in mental health treatment under section 253B.041 or any other referral to social services, the court examiner may recommend referral of the defendant to services where available.\nIf either the prosecutor or defense counsel intends to retain an independent examiner, the party shall provide notice to the court and opposing counsel no later than ten days after the date of receipt of the court examiner's report. If an independent examiner is retained, the independent examiner's report shall be filed no more than 30 days after the date a party files notice of intent to retain an independent examiner, unless extended by the court for good cause.\nWhen a defendant is examined under this section, any statement made by the defendant for the purpose of the examination and any evidence derived from the examination is admissible in the competency proceedings, but not in the criminal proceedings.",
	"repealed": false
}