{
	"id": "156.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.16",
	"title": "156.16 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 156.16 to 156.20.\n\"Client\" means the owner or caretaker of an animal who arranges for the animal's veterinary care.\n\"Dispensing\" means distribution of veterinary prescription drugs or over-the-counter drugs, human drugs for extra-label use, for extra-label use by a person licensed as a pharmacist by the Board of Pharmacy or a person licensed by the Board of Veterinary Medicine.\n\"Extra-label use\" means the actual or intended use of a human or veterinary drug in an animal in a manner that is not in accordance with the drug's labeling.\n\"Food-producing animals\" means livestock or poultry raised commercially for human consumption.\n\"Over-the-counter drug\" means a veterinary drug labeled \"for veterinary use only\" or \"for animal use only\" that does not require a prescription or is not required to have the restrictive legend: \"Caution: federal law restricts this drug to use by or on the order of a licensed veterinarian.\"\n\"Patient\" means an animal for which a veterinary prescription drug is used or intended to be used.\n\"Person\" means an individual, or a firm, partnership, company, corporation, trustee, association, agency, or other public or private entity.\n\"Pharmacist\" means an individual with a valid Minnesota license to practice pharmacy.\n\"Prescription\" means an order from a veterinarian to a pharmacist or another veterinarian authorizing the dispensing of veterinary prescription drugs, human drugs for extra-label use, or over-the-counter drugs for extra-label use to a client for use on or in a patient.\n\"Veterinarian\" means an individual with a valid Minnesota license to practice veterinary medicine.\n\"Veterinarian-client-patient relationship\" means a relationship in which the conditions in paragraphs (a) to (d) have been met.\n(a) The veterinarian has assumed the responsibility for making medical judgments regarding the health of the animal and the need for medical treatment, and the client has agreed to follow the instructions of the veterinarian.\n(b) The veterinarian has sufficient knowledge of the animal to initiate at least a general, preliminary, or tentative diagnosis of the medical condition of the animal. The veterinarian must be acquainted with the keeping and care of the animal by virtue of an examination of the animal or medically appropriate and timely visits to the premises where the animal is kept.\n(c) The veterinarian is available for consultation in case of adverse reactions or failure of the regimen of therapy.\n(d) The veterinarian maintains records documenting patient visits, diagnosis, treatments, and drugs prescribed, dispensed, or administered, and other relevant information.\n\"Veterinary drug\" means:\n(1) a drug for animal use recognized in the official United States Pharmacopoeia or National Formulary of the United States;\n(2) a drug intended for use in the diagnosis, cure, mitigation, treatment, or prevention of disease in animals;\n(3) a drug, other than feed, medicated feed, or a growth promoting implant intended to affect the structure or function of the body of an animal; or\n(4) a drug intended for use as a component of a drug in clause (1), (2), or (3).\n\"Veterinary prescription drug\" means:\n(1) a drug that is not safe for animal use except under the supervision of a veterinarian, and that is required by federal law to bear the following statement: \"Caution: federal law restricts this drug to use by or on the order of a licensed veterinarian\";\n(2) a drug that is required by state law to be dispensed only on order or prescription of a licensed veterinarian;\n(3) the extra-label use of an over-the-counter animal drug or human drugs; and\n(4) a medicament compounded by mixing two or more legally obtained over-the-counter or prescription drugs.",
	"repealed": false
}