{
	"id": "298.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.016",
	"title": "298.016 GROSS PROCEEDS.",
	"text": "When a metal or mineral product is sold by the producer in an arm's-length transaction, the gross proceeds are equal to the proceeds from the sale of the product. This subdivision applies to sales realized on all metal or mineral products produced from mining, including reduction, beneficiation, or any treatment used by a producer to obtain a metal or mineral product which is commercially marketable.\nWhen a metal or mineral product is used by the producer or disposed of in a non-arm's-length transaction, the gross proceeds must be determined using the alternative computation in subdivision 3. Transactions subject to this subdivision include, but are not limited to, shipments to a wholly owned smelter, transactions with associated or affiliated companies, and any other transactions which are not at arm's length.\n(a) The commissioner of revenue shall determine the alternative computation of gross proceeds using the following procedure:\n(1) Metal and mineral prices shall be determined by using the average annual market price as published in the Engineering and Mining Journal;\n(2) For metals or mineral products with a monthly or weekly price quotation in the Engineering and Mining Journal, but for which no average annual price has been published, an arithmetic average of the monthly or weekly prices published in the Engineering and Mining Journal shall be used;\n(3) If the price of a particular metal or mineral product is not published in the Engineering and Mining Journal, another recognized published price, as established by the commissioner of revenue will be used.\n(b) The quantity of each particular metal or mineral product recovered and paid or credited for by the smelter will be multiplied by the average annual market price as determined in clause (a). Special smelter charges for particular metals will be allowed as a deduction from this price. The resulting amount will be the gross proceeds for calculating the tax in section 298.015.\nFor the purposes of this section, \"metal or mineral products\" means all those ores, metals, and minerals subject to the tax provided in section 298.015.",
	"repealed": false
}