{
	"id": "197.6091",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.6091",
	"title": "197.6091 VETERANS BENEFITS SERVICES; DISCLOSURE REQUIREMENTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b)(1) \"Advertising\" or \"advertisement\" means any of the following:\n(i) any written or printed communication made for the purpose of soliciting business for veterans benefits appeal services, including but not limited to a brochure, letter, pamphlet, newspaper, telephone listing, periodical, or other writing;\n(ii) any directory listing caused or permitted by a person and made available by that person indicating that veterans benefits appeal services are being offered; or\n(iii) any radio, television, computer network, or similar airwave or electronic transmission that solicits business for or promotes a person offering veterans benefits appeal services.\n(2) \"Advertising\" or \"advertisement\" does not include any of the following:\n(i) any printing or writing used on buildings, uniforms, or badges, where the purpose of the writing is for identification; or\n(ii) any printing or writing in a memorandum or other communication used in the ordinary course of business where the sole purpose of the writing is other than soliciting business for veterans benefits appeal services.\n(c) \"Veterans benefits appeal services\" means services that a veteran might reasonably require in order to appeal a denial of federal or state veterans benefits, including but not limited to denials of disability, limited income, home loan, insurance, education and training, burial and memorial, and dependent and survivor benefits.\n(d) \"Veterans benefits services\" means services that a veteran or a family member of a veteran might reasonably use in order to obtain federal, state, or county veterans benefits.\n(e) \"Written disclosure statement\" means the written disclosure statement developed by the commissioner of veterans affairs pursuant to section 196.05, subdivision 1.\nA person advertising veterans benefits appeal services must conspicuously disclose in the advertisement, in similar type size or voice-over, that veterans benefits appeal services are also offered at no cost by county veterans service officers under sections 197.603 and 197.604.\nA person who provides veterans benefits services in exchange for compensation shall provide a written disclosure statement to each client or prospective client. Before a person enters into an agreement to provide veterans benefits services or accepts money or any other thing of value for the provision of veterans benefits services, the person must obtain the signature of the client on a written disclosure statement containing an attestation by the client that the client has read and understands the written disclosure statement.\nA person who fails to comply with this section is subject to a civil penalty not to exceed $1,000 for each violation. Civil penalties shall be assessed by the district court in an action initiated by the attorney general. For the purposes of computing the amount of each civil penalty, each day of a continuing violation constitutes a separate violation. Additionally, the attorney general may accept a civil penalty as determined by the attorney general in settlement of an investigation of a violation of this section regardless of whether an action has been filed under this section. Any civil penalty recovered shall be deposited in the Support Our Troops account established under section 190.19.\nThis section does not apply to the owner or personnel of any medium in which an advertisement appears or through which an advertisement is disseminated.",
	"repealed": false
}