{
	"id": "469.058",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.058",
	"title": "469.058 INDUSTRIAL DEVELOPMENT DISTRICTS.",
	"text": "A port authority may create and define the boundaries of industrial development districts in their port districts after holding a public hearing on the matter. At least ten days before the hearing, the authority shall publish notice of the hearing in a daily newspaper of general circulation in the port district. The development district may be created if the authority finds that a development district is proper and desirable to establish and develop a system of harbor and river improvements and industrial developments in its port district. In this section, \"development\" includes redevelopment, and \"developing\" includes redeveloping.\nIt is state policy in the public interest to have a port authority exercise the power of eminent domain, and advance and spend public money for the purposes in sections 469.048 to 469.068, and to provide the means to develop marginal property according to the findings in subdivision 3.\nThe legislature makes the findings in this subdivision about the purposes of this section.\n(a) Sound development of the economic security of the people in port authority cities depends on proper development of marginal property. The general welfare of the residents of port districts requires remedies for the injurious conditions of marginal property by appropriate means.\n(b) Marginal property cannot be developed without public participation and assistance in: (1) acquiring land, (2) planning, (3) financing of land assembly in the work of clearance and development, and (4) making necessary improvements for developing.\nWhen the development of marginal property cannot be done by private enterprise alone, it is in the public interest to exercise the power of eminent domain, to advance and spend public money, and to provide the means to develop marginal property.\n(c) The decline of marginal lands often cannot be reversed except by developing all or most of those lands. Private development may be uneconomic and practically impossible because of costs and lack of legal power. The public may have to acquire sizable areas of marginal property at fair prices to remedy the conditions on the marginal property, and to develop the areas under proper supervision, with appropriate planning and continuing land use. The development of land acquired under sections 469.048 to 469.068 is a public necessity and use and a governmental function. The sale or lease of the land after development is incidental to the real purpose: to remove the condition making the property marginal.\n(d) The development of marginal property and its continuing use are public uses, public purposes, and government functions that justify spending or advancing public money and acquiring private property. The development is a state concern in the interest of health, safety, and welfare of the people of the state and of all residents and property owners in communities having marginal property. Marginal property causes problems beyond control of police power alone.",
	"repealed": false
}