{
	"id": "326A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.14",
	"title": "326A.14 SUBSTANTIAL EQUIVALENCY.",
	"text": "(a) An individual whose principal place of business is not in this state and who holds a valid license in good standing as a certified public accountant from any state which, upon verification, is in substantial equivalence with the certified public accountant licensure requirements of section 326A.03, subdivisions 3, 4, and 6, shall be presumed to have qualifications substantially equivalent to this state's requirements and shall have all the privileges of licensees of this state without the need to obtain a license. Notwithstanding any contrary provision of this chapter, an individual who offers or renders professional services, whether in person, by mail, telephone, or electronic means, under this paragraph: (1) shall be granted practice privileges in this state; (2) is subject to the requirements in paragraph (c); and (3) is not required to provide any notice or other submission.\n(b) An individual whose principal place of business is not in this state and who holds a valid license in good standing as a certified public accountant from any state whose certified public accountant licensure qualifications, upon verification, are not substantially equivalent with the licensure requirements of section 326A.03, subdivisions 3, 4, and 6, shall be presumed to have qualifications substantially equivalent to this state's requirements and shall have all the privileges of licensees of this state without the need to obtain a license if the individual obtains verification, as specified in board rule, that the individual's qualifications are substantially equivalent to the licensure requirements of section 326A.03, subdivisions 3, 4, and 6. For purposes of this paragraph, any individual who passed the Uniform CPA Examination and holds a valid license issued by any other state prior to January 1, 2009, is exempt from the education requirement in section 326A.03, subdivision 6, paragraph (a), provided the individual meets the education requirement in section 326A.03, subdivision 3. Notwithstanding any contrary provision of this chapter, an individual who offers or renders professional services, whether in person, by mail, telephone, or electronic means, under this paragraph: (1) shall, after the verification specified by adopted rules, be granted practice privileges in this state; (2) is subject to the requirements in paragraph (c); and (3) is not required to provide any notice or other submission.\n(c) An individual licensee of another state exercising the privilege afforded under this section and the firm which employs that licensee are deemed to have consented, as a condition of the grant of this privilege:\n(1) to the personal and subject matter jurisdiction and disciplinary authority of the board;\n(2) to comply with this chapter and the board's rules;\n(3) to the appointment of the state board that issued the license as the licensee's agent upon whom process may be served in any action or proceeding by this board against the licensee; and\n(4) to cease offering or rendering professional services in this state individually and on behalf of a firm in the event the license issued by the state of the individual's principal place of business is no longer valid or in good standing.\n(d) An individual who has been granted practice privileges under this section who performs attest services as defined in section 326A.01, subdivision 2, clause (1), (4), or (5), for any entity with its headquarters in this state, may only do so through a firm which has obtained a permit under section 326A.05.\nA licensee of this state offering or rendering services or using the CPA title in another state is subject to the same disciplinary action in this state for which the licensee would be subject to discipline for an act committed in the other state. The board shall investigate any complaint made by the board of accountancy of another state.",
	"repealed": false
}