{
	"id": "89A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/89A.03",
	"title": "89A.03 MINNESOTA FOREST RESOURCES COUNCIL.",
	"text": "The governor must appoint a chair and 15 other members to the Minnesota Forest Resources Council. The Indian Affairs Council will appoint one additional member. When making appointments to the council, the governor must appoint knowledgeable individuals with an understanding of state forest resource issues who reflect a balance of the various interests in the sustainable management, use, and protection of the state's forest resources in order to achieve the purpose and policies specified in subdivision 2 and section 89A.02. The council membership must include the following individuals:\n(1) two representatives from organizations representing environmental interests within the state;\n(2) a representative from an organization representing the interests of management of game species;\n(3) a representative from a conservation organization;\n(4) a representative from an association representing forest products industry within the state;\n(5) a commercial logging contractor active in a forest product association;\n(6) a representative from a statewide association representing the resort and tourism industry;\n(7) a faculty or researcher of a Minnesota research or higher educational institution;\n(8) a representative from an association representing family forest woodlands who is an owner of nonindustrial, private forest land of 40 acres or more;\n(9) an owner of nonindustrial, private forest land;\n(10) a representative from the department;\n(11) a county land commissioner who is a member of the Minnesota Association of County Land Commissioners;\n(12) a representative from the United States Department of Agriculture Forest Service unit with land management responsibility in Minnesota;\n(13) a representative from a labor organization with membership having an interest in forest resource issues;\n(14) an individual representing a secondary wood products manufacturing organization;\n(15) a chair; and\n(16) an individual representing the Minnesota Indian Affairs Council.\nThe council must develop recommendations to the governor and to federal, state, county, and local governments with respect to forest resource policies and practices that result in the sustainable management, use, and protection of the state's forest resources. The policies and practices must:\n(1) acknowledge the interactions of complex sustainable forest resources, multiple ownership patterns, and local to international economic forces;\n(2) give equal consideration to the long-term economic, ecological, and social needs and limits of the state's forest resources;\n(3) foster the productivity of the state's forests to provide a diversity of sustainable benefits at site levels and landscape levels;\n(4) enhance the ability of the state's forest resources to provide future benefits and services;\n(5) foster no net loss of forest land in Minnesota;\n(6) encourage appropriate mixes of forest cover types and age classes within landscapes to promote biological diversity and viable forest-dependent fish and wildlife habitats;\n(7) encourage collaboration and coordination with multiple constituencies in planning and managing the state's forest resources; and\n(8) address the environmental impacts and implement mitigations as recommended in the generic environmental impact statement on timber harvesting.\nAt a minimum, meetings of the council and all of the committees, task forces, technical teams, regional committees, and other groups the council may establish must be conducted in accordance with chapter 13D. Except where prohibited by law, the council must establish additional processes to broaden public involvement in all aspects of its deliberations.\nThe council shall employ an executive director who shall have the authority to employ staff. Technical expertise that will enable the council to carry out its functions must be provided to the council by those interests represented on the council.\nTerms, compensation, nomination, appointment, and removal of council members are governed by section 15.059, except that a council member may be compensated at the rate of up to $125 a day.\nThe council must report to the governor and to the legislative committees and divisions with jurisdiction over environment and natural resource policy and finance by February 1 of each odd-numbered year. The report must describe the progress and accomplishments made by the council during the preceding two years.\n[Repealed by amendment, 1999 c 231 s 116]",
	"repealed": false
}