{
	"id": "14.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.22",
	"title": "14.22 NOTICE OF PROPOSED ADOPTION OF RULES.",
	"text": "(a) Unless an agency proceeds directly to a public hearing on a proposed rule and gives the notice prescribed in section 14.14, subdivision 1a, the agency shall give notice of its intention to adopt a rule without public hearing. The notice must be given by publication in the State Register and by United States mail or electronic mail to persons who have registered their names with the agency under section 14.14, subdivision 1a. The mailed notice must include either a copy of the proposed rule or an easily readable and understandable description of its nature and effect and an announcement that a free copy of the proposed rule is available on request from the agency. In addition, each agency shall make reasonable efforts to notify persons or classes of persons who may be significantly affected by the rule by giving notice of its intention in newsletters, newspapers, or other publications, or through other means of communication. The notice in the State Register must include the proposed rule or the amended rule in the form required by the revisor under section 14.07, an easily readable and understandable summary of the overall nature and effect of the proposed rule, a citation to the most specific statutory authority for the proposed rule, a statement that persons may register with the agency for the purpose of receiving notice of rule proceedings and notice that a rule has been submitted to the chief administrative law judge, and other information required by law or rule. When an entire rule is proposed to be repealed, the notice need only state that fact, along with an easily readable and understandable summary of the overall nature of the rules proposed for repeal, and a citation to the rule to be repealed. The notice must include a statement advising the public:\n(1) that the public has 30 days in which to submit comment in support of or in opposition to the proposed rule and that comment is encouraged;\n(2) that each comment should identify the portion of the proposed rule addressed, the reason for the comment, and any change proposed;\n(3) that if 25 or more persons submit a written request for a public hearing within the 30-day comment period, a public hearing will be held;\n(4) of the manner in which persons must request a public hearing on the proposed rule;\n(5) of the requirements contained in section 14.25 relating to a written request for a public hearing, and that the requester is encouraged to propose any change desired;\n(6) that the proposed rule may be modified if the modifications are supported by the data and views submitted; and\n(7) that if a hearing is not required, notice of the date of submission of the proposed rule to the chief administrative law judge for review will be mailed to any person requesting to receive the notice.\nIn connection with the statements required in clauses (1) and (3), the notice must also include the date on which the 30-day comment period ends.\n(b) The chief administrative law judge may authorize an agency to omit from the notice of intent to adopt the text of any proposed rule, the publication of which would be unduly cumbersome, expensive, or otherwise inexpedient if:\n(1) knowledge of the rule is likely to be important to only a small class of persons;\n(2) the notice of intent to adopt states that a free copy of the entire rule is available upon request to the agency; and\n(3) the notice of intent to adopt states in detail the specific subject matter of the omitted rule, cites the statutory authority for the proposed rule, and details the proposed rule's purpose and motivation.\nThe agency may, at the same time notice is given under subdivision 1, give notice of a public hearing and of its intention to proceed under sections 14.14 to 14.20, if one is required under section 14.25. The notice must include a statement advising the public of its intention to cancel the public hearing if 25 or more persons do not request one. If a hearing is required, there must be at least ten calendar days between the last day for requesting a hearing and the day of the hearing.",
	"repealed": false
}