{
	"id": "244.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.05",
	"title": "244.05 SUPERVISED RELEASE TERM.",
	"text": "Except as provided in subdivisions 1b, 4, and 5, every inmate shall serve a supervised release term upon completion of the inmate's term of imprisonment as reduced by any good time earned by the inmate or extended by confinement in punitive segregation pursuant to section 244.04, subdivision 2. Except for a sex offender conditionally released under Minnesota Statutes 2004, section 609.108, subdivision 5, the supervised release term shall be equal to the period of good time the inmate has earned, and shall not exceed the length of time remaining in the inmate's sentence.\nNotwithstanding the amount of good time earned by an inmate whose crime was committed before August 1, 1992, if the inmate's scheduled release date occurs on a Friday, Saturday, Sunday, or holiday, the inmate's supervised release term shall begin on the last day before the inmate's scheduled release date that is not a Friday, Saturday, Sunday, or holiday. For an inmate whose crime was committed on or after August 1, 1992, if the inmate's scheduled release date occurs on a Friday, Saturday, Sunday, or holiday, the inmate's supervised release term shall begin on the first day after the inmate's scheduled release date that is not a Friday, Saturday, Sunday, or holiday.\n(a) Except as provided in subdivisions 4, 4a, and 5, every inmate sentenced to prison for a felony offense committed on or after August 1, 1993, shall serve a supervised release term upon completion of the inmate's term of imprisonment and any disciplinary confinement period imposed by the commissioner due to the inmate's violation of any disciplinary rule adopted by the commissioner or refusal to participate in a rehabilitative program required under section 244.03. The amount of time the inmate serves on supervised release is equal to one-third of the inmate's fixed executed sentence, less any disciplinary confinement period imposed by the commissioner and regardless of any earned incentive release credit applied toward the individual's term of imprisonment under section 244.44.\n(b) No inmate who violates a disciplinary rule or refuses to participate in a rehabilitative program as required under section 244.03 shall be placed on supervised release until the inmate has served the disciplinary confinement period for that disciplinary sanction or until the inmate is discharged or released from punitive restrictive-housing confinement, whichever is later. The imposition of a disciplinary confinement period shall be considered to be a disciplinary sanction imposed upon an inmate, and the procedure for imposing the disciplinary confinement period and the rights of the inmate in the procedure shall be those in effect for the imposition of other disciplinary sanctions at each state correctional institution.\n(c) For purposes of this subdivision, \"earned incentive release credit\" has the meaning given in section 244.41, subdivision 7.\nThe commissioner shall provide an escort for any inmate on parole or supervised release status who is released to a halfway house or other residential community program. The escort shall be an employee of the commissioner or a person acting as the commissioner's agent for this purpose.\n(a) If the commissioner orders electronic surveillance of an inmate placed on supervised release, the commissioner may require that the inmate be kept in custody, or that the inmate's probation agent, or the agent's designee, directly supervise the offender until electronic surveillance is activated.\n(b) It is the responsibility of the inmate placed on electronic surveillance to ensure that the inmate's residence is properly equipped and the inmate's telecommunications system is properly configured to support electronic surveillance prior to being released from custody or the direct supervision of a probation agent. An inmate who fails to comply with this paragraph may be found in violation of the inmate's conditions of release after a revocation hearing.\n(a) The commissioner of corrections shall adopt by rule standards and procedures for the establishment of conditions of release and the revocation of supervised or conditional release, and shall specify the period of revocation for each violation of release. Procedures for the revocation of release shall provide due process of law for the inmate.\n(b) The commissioner may prohibit an inmate placed on parole, supervised release, or conditional release from using adult-use cannabis flower as defined in section 342.01, subdivision 3, or adult-use cannabis products as defined in section 342.01, subdivision 3, hemp-derived consumer products as defined in section 342.01, subdivision 35, or lower-potency hemp edibles as defined in section 342.01, subdivision 48, if the inmate undergoes a chemical use assessment and abstinence is consistent with a recommended level of care for the defendant in accordance with the criteria under section 254B.04, subdivision 4.\n(c) The commissioner of corrections shall not prohibit an inmate placed on parole, supervised release, or conditional release from participating in the registry program as defined in section 342.01, subdivision 61, as a condition of release or revoke a patient's parole, supervised release, or conditional release or otherwise sanction a patient on parole, supervised release, or conditional release solely for participating in the registry program or for a positive drug test for cannabis components or metabolites.\n(a) If a supervised individual violates the conditions of supervised release imposed on that individual by the commissioner, the commissioner may:\n(1) continue the individual's supervised release term with or without:\n(i) modifying or enlarging the conditions imposed on the individual; or\n(ii) transferring the individual's case to a specialized caseload; or\n(2) revoke the supervised individual's supervised release and reimprison that individual for the appropriate period.\n(b) Before revoking an individual's supervised release because of a technical violation that would result in reimprisonment, the commissioner must identify alternative interventions to address and correct the violation only if:\n(1) the individual does not present a risk to the public; and\n(2) the individual is amenable to continued supervision in the community.\n(c) If alternative interventions are appropriate and available, the commissioner must restructure the supervised individual's terms of release to incorporate the alternative interventions.\n(d) The period for which supervised release may be revoked may not exceed the period remaining in the supervised individual's sentence, but if a sex offender is sentenced and conditionally released under Minnesota Statutes 2004, section 609.108, subdivision 5, the period for which conditional release may be revoked may not exceed the balance of the conditional release term.\n(e) For purposes of this subdivision:\n(1) \"supervised individual\" has the meaning given to \"inmate\" in section 244.01; and\n(2) \"technical violation\" means a violation of a condition of supervised release, except an allegation of a subsequent criminal act that is alleged in a formal complaint, citation, or petition.\n(a) An inmate serving a mandatory life sentence under section 609.106, subdivision 2, or 609.3455, subdivision 2, paragraph (a), must not be given supervised release under this section.\n(b) Except as provided in paragraph (f), an inmate serving a mandatory life sentence under section 609.185, paragraph (a), clause (3), (5), or (6), or section 609.2661, clause (3); or Minnesota Statutes 2004, section 609.109, subdivision 3, must not be given supervised release under this section without having served a minimum term of 30 years.\n(c) Except as provided in paragraph (f), an inmate serving a mandatory life sentence under section 609.385 must not be given supervised release under this section without having served a minimum term of imprisonment of 17 years.\n(d) An inmate serving a mandatory life sentence under section 609.3455, subdivision 3 or 4, must not be given supervised release under this section without having served the minimum term of imprisonment specified by the court in its sentence.\n(e) An inmate serving a mandatory life sentence under section 609.106, subdivision 3, or 609.3455, subdivision 2, paragraph (c), must not be given supervised release under this section without having served a minimum term of imprisonment specified in subdivision 4b.\n(f) An inmate serving a mandatory life sentence for a crime described in paragraph (b) or (c) who was under 18 years of age at the time of the commission of the offense must not be given supervised release under this section without having served a minimum term of imprisonment specified in subdivision 4b.\nNotwithstanding any other provision of law, any person who was under the age of 18 at the time of the commission of an offense is eligible for early supervised release if the person is serving an executed sentence that exceeds the minimum term of imprisonment specified in subdivision 4b.\nAny person serving one or more mandatory life sentences or any combination of sentences that include combined terms of imprisonment that exceed the applicable minimum term specified in this section is eligible for supervised release if the person was under the age of 18 at the time of the commission of the relevant offenses and has served a minimum of:\n(1) 15 years if the person:\n(i) received a determinate sentence with a period of imprisonment of more than 15 years;\n(ii) received separate, consecutive, executed determinate sentences for two or more crimes that include combined terms of imprisonment that total more than 15 years and do not involve separate victims; or\n(iii) was sentenced to one mandatory life sentence that is not consecutive to any other sentence involving a separate victim and to which no other sentence involving a separate victim is consecutive;\n(2) 20 years if the person:\n(i) received separate, consecutive, executed determinate sentences for two or more crimes that include combined terms of imprisonment that total more than 20 years and involved separate victims;\n(ii) was sentenced to one mandatory life sentence that is consecutive to any determinate sentence involving a separate victim or to which a determinate sentence involving a separate victim is consecutive; or\n(iii) was sentenced to two consecutive mandatory life sentences; or\n(3) 30 years if the person was sentenced to three or more consecutive life sentences.\n(a) The board may, under rules adopted by the commissioner, grant supervised release or parole as follows:\n(1) to an inmate serving a mandatory life sentence after the inmate has served the minimum term of imprisonment specified in subdivision 4 or section 243.05, subdivision 1, paragraph (a);\n(2) at any time for an inmate serving a nonlife indeterminate sentence for a crime committed on or before April 30, 1980; or\n(3) to an inmate eligible for early supervised release under subdivision 4a after the inmate has served the minimum term of imprisonment.\n(b) For cases involving multiple sentences, the board must grant or deny supervised release as follows:\n(1) if an inmate is serving multiple sentences that are concurrent to one another, the board must grant or deny supervised release on all unexpired sentences; and\n(2) notwithstanding any other law to the contrary, if an inmate who was under the age of 18 at the time of the commission of the relevant offenses and has served the minimum term of imprisonment specified in subdivision 4b is serving multiple sentences that are consecutive to one another, the board may grant or deny supervised release on one or more sentences.\n(c) No less than three years before an inmate has served the applicable minimum term of imprisonment, the board must assess the inmate's status and make programming recommendations relevant to the inmate's release review. The commissioner must ensure that any board programming recommendations are followed and implemented.\n(d) The board must conduct a supervised release review hearing as soon as practicable before an inmate has served the applicable minimum term of imprisonment.\n(e) The board shall require the preparation of a community investigation report. The report shall:\n(1) reflect the sentiment of the various elements of the community toward the inmate, both at the time of the offense and at the present time;\n(2) include the views of the sentencing judge, the prosecutor, any law enforcement personnel who may have been involved in the case, and any successors to these individuals who may have information relevant to the supervised release decision; and\n(3) include the views of the victim and the victim's family unless the victim or the victim's family chooses not to participate.\n(f) The board shall require the preparation of a development report when making a supervised release decision regarding an inmate who was under 18 years of age at the time of the commission of the offense. The report must be prepared by a mental health professional qualified to provide services to a client under section 245I.04, subdivision 2, clause (1) to (4) or (6), and must address the inmate's cognitive, emotional, and social maturity. The board may use a previous report that was prepared within 12 months immediately preceding the hearing.\n(g) The board shall make reasonable efforts to notify the victim, in advance, of the time and place of the inmate's release review hearing. The victim has a right to submit an oral or written statement at the review hearing. Notwithstanding chapter 13D, the board may meet in closed session to receive and review a victim's statement, at the request of the victim. The statement may summarize the harm suffered by the victim as a result of the crime and give the victim's recommendation on whether the inmate should be given supervised release at this time.\n(h) The board shall permit a prosecutor from the office that prosecuted the case to submit a written statement in advance of the review hearing.\n(i) When considering whether to grant supervised release or parole to an inmate serving a life sentence or indeterminate sentence, the board shall consider, at a minimum, the following:\n(1) the report prepared pursuant to paragraph (e);\n(2) the report prepared pursuant to paragraph (f), if applicable;\n(3) a victim statement under paragraph (g), if submitted;\n(4) the statement of a prosecutor under paragraph (h), if submitted;\n(5) the risk the inmate poses to the community if released;\n(6) the inmate's progress in treatment, if applicable;\n(7) the inmate's behavior while incarcerated;\n(8) psychological or other diagnostic evaluations of the inmate;\n(9) information on the inmate's rehabilitation while incarcerated;\n(10) the inmate's criminal history;\n(11) if the inmate was under 18 years of age at the time of the commission of the offense, relevant science on the neurological development of juveniles and information on the inmate's maturity and development while incarcerated; and\n(12) any other relevant conduct of the inmate while incarcerated or before incarceration.\n(j) The board may not grant supervised release or parole to an inmate unless:\n(1) while in prison:\n(i) the inmate has successfully completed appropriate sex offender treatment, if applicable;\n(ii) the inmate has been assessed for substance use disorder needs and, if appropriate, has successfully completed substance use disorder treatment; and\n(iii) the inmate has been assessed for mental health needs and, if appropriate, has successfully completed mental health treatment; and\n(2) a comprehensive individual release plan is in place for the inmate that:\n(i) ensures that, after release, the inmate will have suitable housing and receive appropriate aftercare and community-based treatment; and\n(ii) includes a postprison employment or education plan for the inmate.\n(k) Supervised release or parole must be granted with a majority vote of the quorum required under section 244.049, subdivision 3. If there is a tie vote, supervised release or parole is granted only if the commissioner votes in favor of granting supervised release or parole.\n(l) Within 30 days after a supervised release review hearing, the board must issue a decision on granting release, including an explanation for the decision. If an inmate is serving multiple sentences that are concurrent to one another, the board must grant or deny supervised release on all sentences.\n(m) If the board does not grant supervised release, upon request of the inmate, the board shall conduct a subsequent supervised release hearing within three years of the initial hearing. If release is denied at the subsequent hearing, upon request of the inmate, the board shall continue to hold hearings at least once every three years. If the board denies an inmate's release under this paragraph, the explanation of that decision must identify specific steps that the inmate can take to increase the likelihood that release will be granted at a future hearing.\n(n) When granting supervised release under this subdivision, the board must set prerelease conditions to be followed by the inmate, if time permits, before their actual release or before constructive parole becomes effective. If the inmate violates any of the prerelease conditions, the commissioner may rescind the grant of supervised release without a hearing at any time before the inmate's release or before constructive parole becomes effective. A grant of constructive parole becomes effective once the inmate begins serving the consecutive sentence.\n(o) If the commissioner rescinds a grant of supervised release or parole, the board:\n(1) must set a release review date that occurs within 90 days of the commissioner's rescission; and\n(2) by majority vote, may set a new supervised release date or set another review date.\n(p) If the commissioner revokes supervised release or parole for an inmate serving a life sentence, the revocation is not subject to the limitations under section 244.30 and the board:\n(1) must set a release review date that occurs within one year of the commissioner's final revocation decision; and\n(2) by majority vote, may set a new supervised release date or set another review date.\n(q) The board may, by a majority vote, grant a person on supervised release or parole for a life or indeterminate sentence a final discharge from their sentence in accordance with section 243.05, subdivision 3. In no case, however, may a person subject to a mandatory lifetime conditional release term under section 609.3455, subdivision 7, be discharged from that term.\n(r) For purposes of this subdivision:\n(1) \"board\" means the Supervised Release Board under section 244.049;\n(2) \"constructive parole\" means the status of an inmate who has been paroled from an indeterminate sentence to begin serving a consecutive sentence in prison; and\n(3) \"victim\" has the meaning given in section 611A.01, paragraph (b).\n(a) The commissioner may order that an inmate be placed on intensive supervised release for:\n(1) all or part of the inmate's supervised release or parole term; or\n(2) all of the inmate's conditional or supervised release term if the inmate was:\n(i) convicted of a sex offense under section 609.342, 609.343, 609.344, 609.345, or 609.3453; or\n(ii) sentenced under section 609.3455, subdivision 3a.\n(b) The commissioner must order that all level III predatory offenders be placed on intensive supervised release for the entire supervised release, conditional release, or parole term.\n(c) The commissioner may impose appropriate conditions of release on an inmate, including but not limited to:\n(1) unannounced searches by an intensive supervision agent of the inmate's person, vehicle, premises, computer, or other electronic devices capable of accessing the Internet;\n(2) compliance with court-ordered restitution, if any;\n(3) random drug testing;\n(4) house arrest;\n(5) daily curfews;\n(6) frequent face-to-face contacts with an assigned intensive supervision agent;\n(7) work, education, or treatment requirements; and\n(8) electronic surveillance.\n(d) A sex offender placed on intensive supervised release may be ordered to participate in an appropriate sex offender program as a condition of release.\n(e) If electronic surveillance is directed for an inmate on intensive supervised release, the commissioner must require that until electronic surveillance is activated:\n(1) the inmate be kept in custody; or\n(2) the inmate's intensive supervision agent, or the agent's designee, directly supervise the inmate.\n(f) Before being released from custody or the direct supervision of an intensive supervision agent, an inmate placed on electronic surveillance must ensure that:\n(1) the inmate's residence is properly equipped to support electronic surveillance; and\n(2) the inmate's telecommunications system is properly configured to support electronic surveillance.\n(g) An inmate who fails to comply with paragraph (f) may be found in violation of the inmate's conditions of release after a revocation hearing.\n(h) As a condition of release for an inmate required to register under section 243.166 who is placed on intensive supervised release under this subdivision, the commissioner shall prohibit the inmate from accessing, creating, or maintaining a personal web page, profile, account, password, or username for (1) a social networking website, or (2) an instant messaging or chat room program, any of which permits persons under the age of 18 to become a member or to create or maintain a personal web page.\n(i) An intensive supervision agent may modify the prohibition under paragraph (h) if:\n(1) the modification would not jeopardize public safety; and\n(2) the modification is specifically described and agreed to in advance by the agent.\n(j) If an inmate violates the conditions of intensive supervised release, the commissioner may impose sanctions as provided in subdivision 3 and section 609.3455.\n(a) Before the commissioner releases from prison any inmate convicted under section 609.342, 609.343, 609.344, 609.345, or 609.3453, or sentenced as a patterned offender under section 609.3455, subdivision 3a, and determined by the commissioner to be in a high risk category, the commissioner shall make a preliminary determination whether, in the commissioner's opinion, a petition under chapter 253D may be appropriate. The commissioner's opinion must be based on a recommendation of a Department of Corrections screening committee and a legal review and recommendation from independent counsel knowledgeable in the legal requirements of the civil commitment process. The commissioner may retain a retired judge or other attorney to serve as independent counsel.\n(b) In making this decision, the commissioner shall have access to the following data only for the purposes of the assessment and referral decision:\n(1) private medical data under section 13.384 or sections 144.291 to 144.298, or welfare data under section 13.46 that relate to medical treatment of the offender;\n(2) private and confidential court services data under section 13.84;\n(3) private and confidential corrections data under section 13.85; and\n(4) private criminal history data under section 13.87.\n(c) If the commissioner determines that a petition may be appropriate, the commissioner shall forward this determination, along with a summary of the reasons for the determination, to the county attorney in the county where the inmate was convicted no later than 12 months before the inmate's release date. If the inmate is received for incarceration with fewer than 12 months remaining in the inmate's term of imprisonment, or if the commissioner receives additional information less than 12 months before release that makes the inmate's case appropriate for referral, the commissioner shall forward the determination as soon as is practicable. Upon receiving the commissioner's preliminary determination, the county attorney shall proceed in the manner provided in chapter 253D. The commissioner shall release to the county attorney all requested documentation maintained by the department.\n(a) Notwithstanding subdivisions 4 and 5, the commissioner may order that an inmate be placed on conditional medical release before their scheduled supervised release date or target release date if:\n(1) the inmate suffers from a grave illness or medical condition; and\n(2) the release poses no threat to the public.\n(b) If there is an epidemic of any potentially fatal infectious or contagious disease in the community or in a state correctional facility, the commissioner may also release an inmate to home confinement before the inmate's scheduled supervised release date or target release date if:\n(1) the inmate has a medical condition or state of health that would make the inmate particularly vulnerable to the disease; and\n(2) release to home confinement poses no threat to the public.\n(c) When deciding whether to release an inmate according to this subdivision, the commissioner must consider:\n(1) the inmate's age and medical condition, health care needs, and custody classification and level of risk of violence;\n(2) the appropriate level of community supervision; and\n(3) alternative placements that may be available for the inmate.\n(d) An inmate may not be released under this subdivision unless the commissioner has determined that the inmate's health costs are likely to be borne by:\n(1) the inmate; or\n(2) medical assistance, Medicaid, veteran's benefits, or any other federal or state medical assistance programs.\n(e) The commissioner may rescind conditional medical release without a hearing if the commissioner considers that the inmate's medical condition has improved to the extent that:\n(1) the illness or condition is no longer grave or can be managed by correctional health care options; or\n(2) the epidemic that precipitated release has subsided or effective vaccines or other treatments have become available.\n(f) Release under this subdivision may also be revoked in accordance with subdivisions 2 and 3 if the inmate violates any conditions of release imposed by the commissioner.\n(a) At least 30 days before a hearing to consider the release of an inmate sentenced to life imprisonment for committing murder in the first degree involving the killing of a peace officer or a guard employed at a Minnesota or local correctional facility, the commissioner shall post on the department's website information about the hearing. The information posted may include only public information about the inmate, the circumstances of the case, and the scheduled hearing.\n(b) A member of the public may submit a written statement at the review hearing. Nothing in this subdivision may be interpreted to circumvent or limit the rights of the victim, the victim's family, the inmate, or the criminal justice community specified elsewhere in law to notice of the hearing or the right to participate in it.",
	"repealed": false
}