{
	"id": "518.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.14",
	"title": "518.14 COSTS AND DISBURSEMENTS; ATTORNEY FEES; COLLECTION COSTS.",
	"text": "Except as provided in section 518A.735, in a proceeding under this chapter or chapter 518A, the court shall award attorney fees, costs, and disbursements in an amount necessary to enable a party to carry on or contest the proceeding, provided it finds:\n(1) that the fees are necessary for the good faith assertion of the party's rights in the proceeding and will not contribute unnecessarily to the length and expense of the proceeding;\n(2) that the party from whom fees, costs, and disbursements are sought has the means to pay them; and\n(3) that the party to whom fees, costs, and disbursements are awarded does not have the means to pay them.\nThe court may award, in its discretion, additional fees, costs, and disbursements against a party who unreasonably contributes to the length or expense of the proceeding or whose unreasonable failure to comply with an order or decree causes the other party to seek enforcement or other relief, including the reimbursement of fees and costs incurred before filing a motion. In determining whether to award fees, the court must consider the circumstances and any other factors that contributed to the length or expense of the proceeding. Fees, costs, and disbursements provided for in this section and section 518A.735 may be awarded at any point in the proceeding, including a modification proceeding under sections 518.18 and 518A.39. The court may adjudge costs and disbursements against either party. The court may authorize the collection of money awarded by execution, or out of property sequestered, or in any other manner within the power of the court. An award of attorney's fees made by the court during the pendency of the proceeding or in the final judgment survives the proceeding and if not paid by the party directed to pay the same may be enforced as above provided or by a separate civil action brought in the attorney's own name. If the proceeding is dismissed or abandoned prior to determination and award of attorney's fees, the court may nevertheless award attorney's fees upon the attorney's motion. The award shall also survive the proceeding and may be enforced in the same manner as last above provided.\n[Renumbered 518A.735]",
	"repealed": false
}