{
	"id": "60A.763",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.763",
	"title": "60A.763 CLAIM RESERVES.",
	"text": "(a) Claim reserves are required for all incurred but unpaid claims on all health insurance policies.\n(b) Appropriate claim expense reserves are required with respect to the estimated expense of settlement of all incurred but unpaid claims.\n(c) Claim reserves for prior valuation years are to be tested for adequacy and reasonableness along the lines of claim runoff schedules in accordance with the statutory financial statement including consideration of any residual unpaid liability.\n(a) The maximum interest rate for claim reserves is specified in section 60A.768.\n(b) Minimum standards with respect to morbidity are those specified in section 60A.768, except that, at the option of the insurer:\n(1) for claims with a duration from date of disablement of less than two years, reserves may be based on the insurer's experience, if such experience is considered credible, or upon other assumptions designed to place a sound value on the liabilities; and\n(2) for group disability income claims with a duration from date of disablement of more than two years but less than five years, reserves may, with the approval of the commissioner, be based on the insurer's experience for which the insurer maintains underwriting and claim administration control. The request for approval of a plan of modification to the reserve basis must include:\n(i) an analysis of the credibility of the experience;\n(ii) a description of how all of the insurer's experience is proposed to be used in setting reserves;\n(iii) a description and quantification of the margins to be included;\n(iv) a summary of the financial impact that the proposed plan of modification would have had on the insurer's last filed annual statement;\n(v) a copy of the approval of the proposed plan of modification by the commissioner of the state of domicile; and\n(vi) any other information deemed necessary by the commissioner.\n(c) For contracts with an elimination period, the duration of disablement must be measured as dating from the time that benefits would have begun to accrue had there been no elimination period.\n(a) The maximum interest rate for claim reserves is specified in section 60A.768.\n(b) The reserve must be based on the insurer's experience, if the experience is considered credible, or upon other assumptions designed to place a sound value on the liabilities.\nA generally accepted actuarial reserving method or other reasonable method if the method is approved by the commissioner before the statement date, or a combination of methods as described in this section, may be used to estimate all claim liabilities. The methods used for estimating liabilities generally may be aggregate methods, or various reserve items may be separately valued. Approximations based on groupings and averages may also be employed. Adequacy of the claim reserves, however, must be determined in the aggregate.",
	"repealed": false
}