{
	"id": "144.7022",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.7022",
	"title": "144.7022 REPORTING ORGANIZATIONS; PENALTY ORDERS.",
	"text": "The commissioner may issue an order to the voluntary, nonprofit reporting organization requiring violations to be corrected and administratively assess monetary penalties for violations of sections 144.695 to 144.703 or rules, written operating requirements, orders, stipulation agreements, settlements, or compliance agreements adopted, enforced, or issued by the commissioner.\nAn order assessing an administrative penalty under this section must include:\n(1) a concise statement of the facts alleged to constitute a violation;\n(2) a reference to the section of law, rule, written operating requirement, order, stipulation agreement, settlement, or compliance agreement that has been violated;\n(3) a statement of the amount of the administrative penalty to be imposed and the factors upon which the penalty is based;\n(4) a statement of the corrective actions necessary to correct the violation; and\n(5) a statement of the right to request a hearing according to sections 14.57 to 14.62.\nThe commissioner may issue an order assessing an administrative penalty and requiring the violations cited in the order be corrected within 30 calendar days from the date the order is received. Before the 31st day after the order was received, the voluntary, nonprofit reporting organization that is subject to the order shall provide the commissioner with information demonstrating that the violation has been corrected or that a corrective plan acceptable to the commissioner has been developed. The commissioner shall determine whether the violation has been corrected and notify the voluntary, nonprofit reporting organization of the commissioner's determination.\nIf the commissioner determines that the violation has been corrected or an acceptable corrective plan has been developed, the penalty may be forgiven, except where there are repeated or serious violations. The commissioner may issue an order with a penalty that will not be forgiven after corrective action is taken. Unless there is a request for review of the order under subdivision 6 before the penalty is due, the penalty is due and payable:\n(1) on the 31st calendar day after the order was received, if the voluntary, nonprofit reporting organization fails to provide information to the commissioner showing that the violation has been corrected or that appropriate steps have been taken toward correcting the violation;\n(2) on the 20th day after the voluntary, nonprofit reporting organization receives the commissioner's determination that the information provided is not sufficient to show that either the violation has been corrected or that appropriate steps have been taken toward correcting the violation; or\n(3) on the 31st day after the order was received where the penalty is for repeated or serious violations and according to the order issued, the penalty will not be forgiven after corrective action is taken.\nAll penalties due under this section are payable to the commissioner of management and budget, state of Minnesota, and shall be deposited in the general fund.\n(a) The maximum amount of an administrative penalty order is $5,000 for each specific violation identified in an inspection, investigation, or compliance review, up to an annual maximum total for all violations of ten percent of the fees collected by the voluntary, nonprofit reporting organization under section 144.702, subdivision 1. The annual maximum is based on a reporting year.\n(b) In determining the amount of the administrative penalty, the commissioner shall consider the following:\n(1) the willfulness of the violation;\n(2) the gravity of the violation;\n(3) the history of past violations;\n(4) the number of violations;\n(5) the economic benefit gained by the person allowing or committing the violation; and\n(6) other factors as justice may require, if the commissioner specifically identifies the additional factors in the commissioner's order.\n(c) In determining the amount of a penalty for a violation subsequent to an initial violation under paragraph (a), the commissioner shall also consider:\n(1) the similarity of the most recent previous violation and the violation to be penalized;\n(2) the time elapsed since the last violation; and\n(3) the response of the voluntary, nonprofit reporting organization to the most recent previous violation.\nA request for hearing must be in writing, delivered to the commissioner by certified mail within 20 calendar days after the receipt of the order, and specifically state the reasons for seeking review of the order. The commissioner must initiate a hearing within 30 calendar days from the date of receipt of the written request for hearing. The hearing shall be conducted pursuant to the contested case procedures in sections 14.57 to 14.62. No earlier than ten calendar days after and within 30 calendar days of receipt of the presiding administrative law judge's report, the commissioner shall, based on all relevant facts, issue a final order modifying, vacating, or making the original order permanent. If, within 20 calendar days of receipt of the original order, the voluntary, nonprofit reporting organization fails to request a hearing in writing, the order becomes the final order of the commissioner.\nOnce the commissioner issues a final order, any penalty due under that order shall be paid within 30 calendar days after the date of the final order, unless review of the final order is requested. The final order of the commissioner may be appealed in the manner prescribed in sections 14.63 to 14.69. If the final order is reviewed and upheld, the penalty shall be paid 30 calendar days after the date of the decision of the reviewing court. Failure to request an administrative hearing pursuant to subdivision 6 shall constitute a waiver of the right to further agency or judicial review of the final order.\nIf, upon reinspection, or in the determination of the commissioner, it is found that any deficiency specified in the order has not been corrected or an acceptable corrective plan has not been developed, the voluntary, nonprofit reporting organization is in noncompliance. The commissioner shall issue a notice of noncompliance and may impose any additional remedy available under this chapter.\nThe attorney general may proceed on behalf of the commissioner to enforce penalties that are due and payable under this section in any manner provided by law for the collection of debts.\nThe commissioner may withdraw or not renew approval of any voluntary, nonprofit reporting organization for failure on the part of the voluntary, nonprofit reporting organization to pay penalties owed under this section.\nThe authority of the commissioner to issue an administrative penalty order is in addition to other lawfully available remedies.\nIn addition to review under subdivision 6, the commissioner is authorized to enter into mediation concerning an order issued under this section if the commissioner and the voluntary, nonprofit reporting organization agree to mediation.",
	"repealed": false
}