{
	"id": "144G.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.91",
	"title": "144G.91 ASSISTED LIVING BILL OF RIGHTS.",
	"text": "This section applies to residents living in assisted living facilities.\nThe rights established under this section for the benefit of residents do not limit any other rights available under law. No facility may request or require that any resident waive any of these rights at any time for any reason, including as a condition of admission to the facility.\nBefore receiving services, residents have the right to be informed by the facility of the rights granted under this section and the recourse residents have if rights are violated. The information must be in plain language and in terms residents can understand. The facility must make reasonable accommodations for residents who have communication disabilities and those who speak a language other than English.\n(a) Residents have the right to care and assisted living services that are appropriate based on the resident's needs and according to an up-to-date service plan subject to accepted health care standards.\n(b) Residents have the right to receive health care and other assisted living services with continuity from people who are properly trained and competent to perform their duties and in sufficient numbers to adequately provide the services agreed to in the assisted living contract and the service plan.\nResidents have the right to refuse care or assisted living services and to be informed by the facility of the medical, health-related, or psychological consequences of refusing care or services.\nResidents have the right to actively participate in the planning, modification, and evaluation of their care and services. This right includes:\n(1) the opportunity to discuss care, services, treatment, and alternatives with the appropriate caregivers;\n(2) the right to include the resident's legal and designated representatives and persons of the resident's choosing; and\n(3) the right to be told in advance of, and take an active part in decisions regarding, any recommended changes in the service plan.\nResidents have the right to be treated with courtesy and respect, and to have the resident's property treated with respect.\nResidents have the right to be free from physical, sexual, and emotional abuse; neglect; financial exploitation; and all forms of maltreatment covered under the Vulnerable Adults Act.\nResidents have the right to enter and leave the facility as they choose. This right may be restricted only as allowed by other law and consistent with a resident's service plan.\nResidents have the right to individual autonomy, initiative, and independence in making life choices, including establishing a daily schedule and choosing with whom to interact.\nResidents have the right to control personal resources.\n(a) Residents have the right to meet with or receive visits at any time by the resident's family, guardian, conservator, health care agent, attorney, advocate, or religious or social work counselor, or any person of the resident's choosing. This right may be restricted in certain circumstances if necessary for the resident's health and safety and if documented in the resident's service plan.\n(b) Residents have the right to engage in community life and in activities of their choice. This includes the right to participate in commercial, religious, social, community, and political activities without interference and at their discretion if the activities do not infringe on the rights of other residents.\n(a) Residents have the right to consideration of their privacy, individuality, and cultural identity as related to their social, religious, and psychological well-being. Staff must respect the privacy of a resident's space by knocking on the door and seeking consent before entering, except in an emergency or unless otherwise documented in the resident's service plan.\n(b) Residents have the right to have and use a lockable door to the resident's unit. The facility shall provide locks on the resident's unit. Only a staff member with a specific need to enter the unit shall have keys. This right may be restricted in certain circumstances if necessary for a resident's health and safety and documented in the resident's service plan.\n(c) Residents have the right to respect and privacy regarding the resident's service plan. Case discussion, consultation, examination, and treatment are confidential and must be conducted discreetly. Privacy must be respected during toileting, bathing, and other activities of personal hygiene, except as needed for resident safety or assistance.\n(a) Residents have the right to communicate privately with persons of their choice.\n(b) If an assisted living facility is sending or receiving mail on behalf of residents, the assisted living facility must do so without interference.\n(c) Residents must be provided access to a telephone to make and receive calls.\n(a) Residents have the right to have personal, financial, health, and medical information kept private, to approve or refuse release of information to any outside party, and to be advised of the assisted living facility's policies and procedures regarding disclosure of the information. Residents must be notified when personal records are requested by any outside party.\n(b) Residents have the right to access their own records.\nResidents have the right to furnish and decorate the resident's unit within the terms of the assisted living contract.\nResidents have the right to choose a roommate if sharing a unit.\nResidents have the right to access food at any time. This right may be restricted in certain circumstances if necessary for the resident's health and safety and if documented in the resident's service plan.\nResidents have the right to access Internet service at their expense.\nResidents have the right to make and receive a timely response to a complaint or inquiry, without limitation. Residents have the right to know and every facility must provide the name and contact information of the person representing the facility who is designated to handle and resolve complaints and inquiries.\nResidents have the right to the immediate access by:\n(1) the resident's legal counsel;\n(2) any representative of the protection and advocacy system designated by the state under Code of Federal Regulations, title 45, section 1326.21; or\n(3) any representative of the Office of Ombudsman for Long-Term Care or the Office of Ombudsman for Mental Health and Developmental Disabilities.\nBefore services are initiated, residents have the right to be notified:\n(1) of all charges for housing and assisted living services;\n(2) of any limits on housing and assisted living services available;\n(3) if known, whether and what amount of payment may be expected from health insurance, public programs, or other sources; and\n(4) what charges the resident may be responsible for paying.\nBefore receiving services identified in the service plan, residents have the right to be told the type and disciplines of staff who will be providing the services, the frequency of visits proposed to be furnished, and other choices that are available for addressing the resident's needs.\nResidents have the right to be informed by the assisted living facility, prior to executing an assisted living contract, that other public and private services may be available and that the resident has the right to purchase, contract for, or obtain services from a provider other than the assisted living facility.\nResidents have the right to organize and participate in resident councils as described in section 144G.41, subdivision 5.\nResidents have the right to participate in family councils formed by families or residents as described in section 144G.41, subdivision 6.",
	"repealed": false
}