{
	"id": "609.347",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.347",
	"title": "609.347 EVIDENCE IN CRIMINAL SEXUAL CONDUCT CASES.",
	"text": "In a prosecution under sections 609.342 to 609.3451; 609.3453; 609.3458; or Minnesota Statutes 2004, section 609.109, the testimony of a victim need not be corroborated.\nIn a prosecution under sections 609.342 to 609.3451; 609.3453; 609.3458; or Minnesota Statutes 2004, section 609.109, there is no need to show that the victim resisted the accused.\nIn a prosecution under sections 609.342 to 609.3451; 609.3453; 609.3458; 609.365; or Minnesota Statutes 2004, section 609.109, evidence of the victim's previous sexual conduct shall not be admitted nor shall any reference to such conduct be made in the presence of the jury, except by court order under the procedure provided in subdivision 4. The evidence can be admitted only if the probative value of the evidence is not substantially outweighed by its inflammatory or prejudicial nature and only in the circumstances set out in paragraphs (a) and (b). For the evidence to be admissible under paragraph (a), subsection (i), the judge must find by a preponderance of the evidence that the facts set out in the accused's offer of proof are true. For the evidence to be admissible under paragraph (a), subsection (ii) or paragraph (b), the judge must find that the evidence is sufficient to support a finding that the facts set out in the accused's offer of proof are true, as provided under Rule 901 of the Rules of Evidence.\n(a) When consent of the victim is a defense in the case, the following evidence is admissible:\n(i) evidence of the victim's previous sexual conduct tending to establish a common scheme or plan of similar sexual conduct under circumstances similar to the case at issue. In order to find a common scheme or plan, the judge must find that the victim made prior allegations of sexual assault which were fabricated; and\n(ii) evidence of the victim's previous sexual conduct with the accused.\n(b) When the prosecution's case includes evidence of semen, pregnancy, or disease at the time of the incident or, in the case of pregnancy, between the time of the incident and trial, evidence of specific instances of the victim's previous sexual conduct is admissible solely to show the source of the semen, pregnancy, or disease.\nThe accused may not offer evidence described in subdivision 3 except pursuant to the following procedure:\n(a) A motion shall be made by the accused at least three business days prior to trial, unless later for good cause shown, setting out with particularity the offer of proof of the evidence that the accused intends to offer, relative to the previous sexual conduct of the victim;\n(b) If the court deems the offer of proof sufficient, the court shall order a hearing out of the presence of the jury, if any, and in such hearing shall allow the accused to make a full presentation of the offer of proof;\n(c) At the conclusion of the hearing, if the court finds that the evidence proposed to be offered by the accused regarding the previous sexual conduct of the victim is admissible under subdivision 3 and that its probative value is not substantially outweighed by its inflammatory or prejudicial nature, the court shall make an order stating the extent to which evidence is admissible. The accused may then offer evidence pursuant to the order of the court;\n(d) If new information is discovered after the date of the hearing or during the course of trial, which may make evidence described in subdivision 3 admissible, the accused may make an offer of proof pursuant to clause (a) and the court shall order an in camera hearing to determine whether the proposed evidence is admissible by the standards herein.\nIn a prosecution under sections 609.342 to 609.3451; 609.3453; 609.3458; or Minnesota Statutes 2004, section 609.109, the court shall not instruct the jury to the effect that:\n(a) it may be inferred that a victim who has previously consented to sexual intercourse with persons other than the accused would be therefore more likely to consent to sexual intercourse again; or\n(b) the victim's previous or subsequent sexual conduct in and of itself may be considered in determining the credibility of the victim; or\n(c) criminal sexual conduct is a crime easily charged by a victim but very difficult to disprove by an accused because of the heinous nature of the crime; or\n(d) the jury should scrutinize the testimony of the victim any more closely than it should scrutinize the testimony of any witness in any felony prosecution.\n(a) In a prosecution under sections 609.342 to 609.3451; 609.3453; 609.3458; or Minnesota Statutes 2004, section 609.109, involving a psychotherapist and patient, evidence of the patient's personal or medical history is not admissible except when:\n(1) the accused requests a hearing at least three business days prior to trial and makes an offer of proof of the relevancy of the history; and\n(2) the court finds that the history is relevant and that the probative value of the history outweighs its prejudicial value.\n(b) The court shall allow the admission only of specific information or examples of conduct of the victim that are determined by the court to be relevant. The court's order shall detail the information or conduct that is admissible and no other evidence of the history may be introduced.\n(c) Violation of the terms of the order is grounds for mistrial but does not prevent the retrial of the accused.\nRule 412 of the Rules of Evidence is superseded to the extent of its conflict with this section.",
	"repealed": false
}