{
	"id": "142B.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.17",
	"title": "142B.17 CHILD CARE FIX-IT TICKET.",
	"text": "(a) In lieu of a correction order under section 142B.16, the commissioner shall issue a fix-it ticket to a family child care or child care center license holder if the commissioner finds that:\n(1) the license holder has failed to comply with a requirement in this chapter or Minnesota Rules, chapter 9502 or 9503, that the commissioner determines to be eligible for a fix-it ticket;\n(2) the violation does not imminently endanger the health, safety, or rights of the persons served by the program;\n(3) the license holder did not receive a fix-it ticket or correction order for the violation at the license holder's last licensing inspection;\n(4) the violation can be corrected at the time of inspection or within 48 hours, excluding Saturdays, Sundays, and holidays; and\n(5) the license holder corrects the violation at the time of inspection or agrees to correct the violation within 48 hours, excluding Saturdays, Sundays, and holidays.\n(b) The fix-it ticket must state:\n(1) the conditions that constitute a violation of the law or rule;\n(2) the specific law or rule violated; and\n(3) that the violation was corrected at the time of inspection or must be corrected within 48 hours, excluding Saturdays, Sundays, and holidays.\n(c) The commissioner shall not publicly publish a fix-it ticket on the department's website.\n(d) Within 48 hours, excluding Saturdays, Sundays, and holidays, of receiving a fix-it ticket, the license holder must correct the violation and within one week submit evidence to the licensing agency that the violation was corrected.\n(e) If the violation is not corrected at the time of inspection or within 48 hours, excluding Saturdays, Sundays, and holidays, or the evidence submitted is insufficient to establish that the license holder corrected the violation, the commissioner must issue a correction order for the violation of Minnesota law or rule identified in the fix-it ticket according to section 142B.16.\nThis section expires upon the implementation of the child care weighted risk system in section 142B.171. The commissioner of children, youth, and families shall notify the revisor of statutes when the system has been implemented.",
	"repealed": false
}