{
	"id": "136A.834",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.834",
	"title": "136A.834 EXEMPTION; RELIGIOUS SCHOOLS.",
	"text": "(a) A program is exempt from the provisions of sections 136A.821 to 136A.832 if it is:\n(1) offered by a private career school or any department or branch of a private career school that is substantially owned, operated, or supported by a bona fide church or religious organization;\n(2) primarily designed for, aimed at, and attended by persons who sincerely hold or seek to learn the particular religious faith or beliefs of that church or religious organization; and\n(3) primarily intended to prepare its students to become ministers of, to enter into some other vocation closely related to, or to conduct their lives in consonance with the particular faith of that church or religious organization.\n(b) Any private career school or any department or branch of a private career school is exempt from the provisions of sections 136A.821 to 136A.832 if all of its programs are exempt under paragraph (a).\n(a) An exemption shall not extend to any private career school, department or branch of a private career school, or program of a private career school that through advertisements or solicitations represents to any students or prospective students that the school, its aims, goals, missions, purposes, or programs are different from those described in subdivision 1.\n(b) An exemption shall not extend to any private career school or program that represents to any student or prospective student that the major purpose of its programs is to:\n(1) prepare the student for a vocation not closely related to that particular religious faith; or\n(2) provide the student with a general educational program recognized by other private career schools or the broader educational, business, or social community as being substantially equivalent to the educational programs offered by private career schools or departments or branches of private career schools which are not religious in nature and are not exempt from sections 136A.82 to 136A.834 and from rules adopted under sections 136A.82 to 136A.834.\n(c) This exemption shall not extend to any school that uses any publication or advertisement that is not truthful and gives any false, fraudulent, deceptive, inaccurate, or misleading impressions about the school or its personnel, programs, services, or occupational opportunities for graduates for promotion and student recruitment. Exemptions denied under this section are subject to appeal under section 136A.65, subdivision 8, paragraph (c). If an appeal is initiated, the denial of the exemption is not effective until the final determination of the appeal, unless immediate effect is ordered by the court.\nNothing in sections 136A.82 to 136A.834 or the rules adopted under them shall be interpreted as permitting the office to determine the truth or falsity of any particular set of religious beliefs.\nAny certificate, diploma, degree, or other formal recognition awarded upon completion of any religiously exempt program shall include such descriptive language as to make the religious nature of the award clear.\nA school that seeks an exemption from the provisions of sections 136A.82 to 136A.834 must apply to the office to establish that the school meets the requirements of an exemption. An exemption expires two years from the date of approval or when a school adds a new program or makes a modification equal to or greater than 25 percent to an existing educational program. If a school is reapplying for an exemption, the application must be submitted to the office 90 days before the current exemption expires.",
	"repealed": false
}