{
	"id": "115D.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/115D.04",
	"title": "115D.04 POLLUTION PREVENTION ASSISTANCE PROGRAM.",
	"text": "The commissioner shall establish a pollution prevention assistance program to assist eligible recipients in preventing pollution. The program must emphasize techniques and processes that minimize the transfer of pollutants from one environmental medium to another and must focus primarily on toxic pollutants.\nThe pollution prevention assistance program must include at least the following:\n(1) a program to assemble, catalog, and disseminate information on pollution prevention;\n(2) a program to provide technical research and assistance, including on-site consultations to identify alternative methods that may be applied to prevent pollution and to provide assistance for planning under section 115D.07, excluding design engineering services; and\n(3) outreach programs including seminars, workshops, training programs, and other similar activities designed to provide pollution prevention information and assistance to eligible recipients and other interested persons.\n(a) The pollution prevention assistance program must be coordinated with other public and private programs that provide management and technical assistance to eligible recipients.\n(b) The commissioner may make grants to public or private entities to operate elements of the program. Grantees shall provide periodic reports on their efforts to assist eligible recipients to reduce pollution.\n(c) A person, when operating or participating in elements of the technical assistance program pursuant to a grant or contract with the office under this section or other law, is an employee of the state, certified to be acting within the scope of employment, for purposes of the indemnification provisions of section 3.736, subdivision 9, for claims that arise out of the information, assistance, and recommendations covered by the grant or contract. The state is not obligated to defend or indemnify a grantee or contractor under this subdivision to the extent of the grantee's or contractor's liability insurance. The grantee's or contractor's right to indemnity is not a waiver of limitations, defenses, and immunities available to either the grantee or contractor or the state by law.",
	"repealed": false
}