{
	"id": "297A.9915",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.9915",
	"title": "297A.9915 REGIONAL TRANSPORTATION SALES AND USE TAX.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Metropolitan area\" means the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\n(c) \"Metropolitan Council\" or \"council\" means the Metropolitan Council established by section 473.123.\n(d) \"Regional transportation sales tax\" means the regional transportation sales and use tax imposed under this section.\nNotwithstanding section 473.123, subdivision 1, the Metropolitan Council must impose a regional transportation sales and use tax at a rate of three-quarters of one percent on retail sales and uses taxable under this chapter made in the metropolitan area or to a destination in the metropolitan area.\nExcept as otherwise provided in this section, the provisions of section 297A.99, subdivisions 4, and 6 to 12a, govern the administration, collection, and enforcement of the regional transportation sales tax.\nProceeds of the regional transportation sales tax must be allocated as follows:\n(1) 83 percent to the Metropolitan Council for the purposes specified under section 473.4465; and\n(2) 17 percent to metropolitan counties, as defined in section 174.49, subdivision 1, in the manner provided under section 174.49, subdivision 5.\n(a) In addition to other authority granted in this section, and notwithstanding section 473.39, subdivision 7, or any other law to the contrary, the council may, by resolution, authorize the sale and issuance of revenue bonds, notes, or obligations to provide funds to (1) implement the council's transit capital improvement program, and (2) refund bonds issued under this subdivision.\n(b) The bonds are payable from and secured by a pledge of all or part of the revenue received under subdivision 4, clause (1), and associated investment earnings on debt proceeds. The council may, by resolution, authorize the issuance of the bonds as general obligations of the council. The bonds must be sold, issued, and secured in the manner provided in chapter 475, and the council has the same powers and duties as a municipality and its governing body in issuing bonds under chapter 475, except that no election is required and the net debt limitations in chapter 475 do not apply to such bonds. The proceeds of the bonds may also be used to fund necessary reserves and to pay credit enhancement fees, issuance costs, and other financing costs during the life of the debt.\n(c) The bonds may be secured by a bond resolution, or a trust indenture entered into by the council with a corporate trustee within or outside the state, which must define the revenues and bond proceeds pledged for the payment and security of the bonds. The pledge must be a valid charge on the revenues received under section 297A.99, subdivision 11. Neither the state, nor any municipality or political subdivision except the council, nor any member or officer or employee of the council, is liable on the obligations. No mortgage or security interest in any tangible real or personal property is granted to the bondholders or the trustee, but they have a valid security interest in the revenues and bond proceeds received by the council and pledged to the payment of the bonds. In the bond resolution or trust indenture, the council may make such covenants as it determines to be reasonable for the protection of the bondholders.",
	"repealed": false
}