{
	"id": "245F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.04",
	"title": "245F.04 PROGRAM LICENSURE.",
	"text": "An applicant for licensure as a clinically managed withdrawal management program or medically monitored withdrawal management program must meet the following requirements, except where otherwise noted. All programs must comply with federal requirements and the general requirements in sections 626.557 and 626.5572 and chapters 245A, 245C, and 260E. A withdrawal management program must be located in a hospital licensed under sections 144.50 to 144.581, or must be a supervised living facility with a class A or B license from the Department of Health under Minnesota Rules, parts 4665.0100 to 4665.9900.\nPrior to the issuance of a license, an applicant must submit, on forms provided by the commissioner, documentation demonstrating the following:\n(1) compliance with this section;\n(2) compliance with applicable building, fire, and safety codes; health rules; zoning ordinances; and other applicable rules and regulations or documentation that a waiver has been granted. The granting of a waiver does not constitute modification of any requirement of this section; and\n(3) insurance coverage, including bonding, sufficient to cover all patient funds, property, and interests.\n(a) A license holder must notify the commissioner before one of the following occurs and the commissioner must determine the need for a new license:\n(1) a change in the Department of Health's licensure of the program;\n(2) a change in the medical services provided by the program that affects the program's capacity to provide services required by the program's license designation as a clinically managed program or medically monitored program;\n(3) a change in program capacity; or\n(4) a change in location.\n(b) A license holder must notify the commissioner and apply for a new license when a change in program ownership occurs.\nThe commissioner may grant variances to the requirements of this chapter under section 245A.04, subdivision 9.\nA license holder providing withdrawal management services may admit an individual when the individual meets the admission criteria in section 245F.05, subdivisions 1 and 2. Any assessor providing an additional assessment to an individual must follow the process established in section 245F.06. If an assessor identifies an individual's need for withdrawal management services while the individual is a resident of a substance use disorder treatment facility, the provisions of section 256G.02, subdivision 4, paragraphs (c) and (d), shall apply.",
	"repealed": false
}