{
	"id": "88.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.79",
	"title": "88.79 STATE FOREST SERVICE TO PRIVATE OWNERS.",
	"text": "The commissioner of natural resources may employ competent foresters to furnish owners of forest lands within the state of Minnesota who own not more than 1,000 acres of forest land, forest management services consisting of:\n(1) advice in management and protection of timber, including written stewardship and forest management plans;\n(2) selection and marking of timber to be cut;\n(3) measurement of products;\n(4) aid in marketing harvested products;\n(5) provision of tree-planting equipment;\n(6) advice in community forest management; and\n(7) such other services as the commissioner of natural resources deems necessary or advisable to promote maximum sustained yield of timber and other benefits upon such forest lands.\nNotwithstanding section 16A.1283, the commissioner of natural resources may, by written order published in the State Register, establish fees the commissioner determines to be fair and reasonable that are charged to owners receiving services under subdivision 1. The charges must account for differences in the value of timber and other benefits. The receipts from the services shall be credited to the special revenue fund and are annually appropriated to the commissioner for the purposes specified in subdivision 1.\nThe commissioner of natural resources may provide cost sharing of conservation practices to nonindustrial owners of less than 5,000 acres of private land within this state, provided that the landowners successfully complete conservation practices approved by the commissioner. The cost shared by the commissioner may not exceed 75 percent of the actual cost of the conservation practice.\nThe charge for forest management services and cost-sharing conservation practices under this section are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.",
	"repealed": false
}