{
	"id": "62Q.524",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.524",
	"title": "62Q.524 COVERAGE OF ABORTIONS AND ABORTION-RELATED SERVICES.",
	"text": "For purposes of this section, \"abortion\" means any medical treatment intended to induce the termination of a pregnancy with a purpose other than producing a live birth.\n(a) A health plan must provide coverage for abortions and abortion-related services, including preabortion services and follow-up services.\n(b) A health plan must not impose on the coverage under this section any co-payment, coinsurance, deductible, or other enrollee cost-sharing that is greater than the cost-sharing that applies to similar services covered under the health plan.\n(c) A health plan must not impose any limitation on the coverage under this section, including but not limited to any utilization review, prior authorization, referral requirements, restrictions, or delays, that is not generally applicable to other coverages under the plan.\nThis section does not apply to managed care organizations or county-based purchasing plans when the plan provides coverage to public health care program enrollees under chapter 256B or 256L.\n(a) The commissioner of commerce must reimburse health plan companies for coverage under this section. Reimbursement is available only for coverage that would not have been provided by the health plan without the requirements of this section. Treatments and services covered by the health plan as of January 1, 2024, are ineligible for payment under this subdivision by the commissioner of commerce.\n(b) Health plan companies must report to the commissioner of commerce quantified costs attributable to the additional benefit under this section in a format developed by the commissioner. A health plan's coverage as of January 1, 2024, must be used by the health plan company as the basis for determining whether coverage would not have been provided by the health plan for purposes of this subdivision.\n(c) The commissioner of commerce must evaluate submissions and make payments to health plan companies as provided in Code of Federal Regulations, title 45, section 155.170.\nEach fiscal year, an amount necessary to make payments to health plan companies to defray the cost of providing coverage under this section is appropriated to the commissioner of commerce.",
	"repealed": false
}