{
	"id": "60A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.23",
	"title": "60A.23 MISCELLANEOUS.",
	"text": "If a company be at any time under liability for losses exceeding its net assets, and the president and directors, or any of them, knowing it, directly or indirectly, issue or consent to the issue of further insurance, each shall be personally liable for any loss under this insurance; and if any of them insures or allows to be insured on a single risk a larger sum than is authorized by law, that person shall be personally liable for any loss thereon above the amount which might lawfully be insured.\nNo director or other officer of any mutual company shall, officially or privately, guarantee a policyholder thereof against an assessment to which the policyholder would otherwise be liable. When the directors of any mutual company fail for 30 days after entry of any judgment, or for six months after the accruing of any other indebtedness against it, to levy and deliver for collection any assessment required by law for payment thereof, or to apply the proceeds thereof in either case, each shall be personally liable for the amount thereof, and for all debts and claims then outstanding or which may accrue until the assessment shall be levied and put in process of collection. When the treasurer unreasonably fails to collect and properly apply the proceeds of any such assessment the treasurer shall be personally liable, not exceeding the total assessment, to any person entitled thereto, and shall be repaid only out of funds thereafter collected thereon.\nNo officer or other person employed to determine the character of a risk, and decide the question of its acceptance by any mutual fire company other than a town or farmers company, shall receive a commission or other payment therefrom, but that person's compensation shall be by fixed salary and such share, if any, of the net profits as the directors may determine; and such officer or person shall not be an employee of any other officer or agent of the company, nor interested in the officer's or agent's business.\nDomestic stock companies shall follow the dividend limitation and reporting requirements set forth in chapter 60D.\n(1) Requirements and acceptability. No company for guaranteeing the fidelity of persons in fiduciary positions, public or private, or for acting as surety, shall transact any business in this state until it shall have satisfied the commissioner that it has complied with all the provisions of law and obtained the commissioner's certificate to that effect. Thereupon it shall be authorized to execute as sole or joint surety any bond, undertaking, or recognizance which, by any municipal or other law, or by the rules or regulations of any municipal or other board, body, organization, or officer, is required or permitted to be made, given, tendered, or filed for the security or protection of any person, corporation, or municipality, or any department thereof, or of any other organization, conditioned for the doing or omitting of anything in such bond or other instrument specified or provided; and any and all courts, judges, officers, and heads of departments, boards, and municipalities required or permitted to accept or approve of the sufficiency of any such bond or instrument may in their discretion accept the same when executed, or the conditions thereof guaranteed solely or jointly by any such company, and the same shall be in all respects full compliance with every law or other provisions for the execution or guaranty by one surety or by two or more sureties, or that sureties shall be residents or householders, or landowners, or all or either.\n(2) Limits of risk. No fidelity or surety company shall insure or reinsure in a single risk, less any portion thereof reinsured, a larger sum than one-tenth of its net assets.\nWhen a company establishes any agency in a place other than that of its principal place of business, all signs, cards, pamphlets, or other printed matter issued shall designate such principal place.\n[Repealed, 1989 c 330 s 37]\n(1) Scope. This subdivision applies to any vendor of risk management services and to any entity which administers, for compensation, a self-insurance or insurance plan. This subdivision does not apply (a) to an insurance company authorized to transact insurance in this state, as defined by section 60A.06, subdivision 1, clauses (4) and (5); (b) to a service plan corporation, as defined by section 62C.02, subdivision 6; (c) to a health maintenance organization, as defined by section 62D.02, subdivision 4; (d) to an employer directly operating a self-insurance plan for its employees' benefits; (e) to an entity which administers a program of health benefits established pursuant to a collective bargaining agreement between an employer, or group or association of employers, and a union or unions; or (f) to an entity which administers a self-insurance or insurance plan if a licensed Minnesota insurer is providing insurance to the plan and if the licensed insurer has appointed the entity administering the plan as one of its licensed agents within this state.\n(2) Definitions. For purposes of this subdivision the following terms have the meanings given them.\n(a) \"Administering a self-insurance or insurance plan\" means (i) processing, reviewing or paying claims, (ii) establishing or operating funds and accounts, or (iii) otherwise providing necessary administrative services in connection with the operation of a self-insurance or insurance plan.\n(b) \"Employer\" means an employer, as defined by section 62E.02, subdivision 2.\n(c) \"Entity\" means any association, corporation, partnership, sole proprietorship, trust, or other business entity engaged in or transacting business in this state.\n(d) \"Self-insurance or insurance plan\" means a plan for the benefit of employees or members of an association providing life, medical or hospital care, accident, sickness or disability insurance, or pharmacy benefits, or a plan providing liability coverage for any other risk or hazard, which is or is not directly insured or provided by a licensed insurer, service plan corporation, or health maintenance organization.\n(e) \"Vendor of risk management services\" means an entity providing for compensation actuarial, financial management, accounting, legal or other services for the purpose of designing and establishing a self-insurance or insurance plan for an employer.\n(3) License. No vendor of risk management services or entity administering a self-insurance or insurance plan may transact this business in this state unless it is licensed to do so by the commissioner. An applicant for a license shall state in writing the type of activities it seeks authorization to engage in and the type of services it seeks authorization to provide. The license may be granted only when the commissioner is satisfied that the entity possesses the necessary organization, background, expertise, and financial integrity to supply the services sought to be offered. The commissioner may issue a license subject to restrictions or limitations upon the authorization, including the type of services which may be supplied or the activities which may be engaged in. The license fee is $1,500 for the initial application and $1,500 for each three-year renewal. All licenses are for a period of three years.\n(4) Regulatory restrictions; powers of the commissioner. To assure that self-insurance or insurance plans are financially solvent, are administered in a fair and equitable fashion, and are processing claims and paying benefits in a prompt, fair, and honest manner, vendors of risk management services and entities administering insurance or self-insurance plans are subject to the supervision and examination by the commissioner. Vendors of risk management services, entities administering insurance or self-insurance plans, and insurance or self-insurance plans established or operated by them are subject to the trade practice requirements of sections 72A.19 to 72A.30. In lieu of an unlimited guarantee from a parent corporation for a vendor of risk management services or an entity administering insurance or self-insurance plans, the commissioner may accept a surety bond in a form satisfactory to the commissioner in an amount equal to 120 percent of the total amount of claims handled by the applicant in the prior year. If at any time the total amount of claims handled during a year exceeds the amount upon which the bond was calculated, the administrator shall immediately notify the commissioner. The commissioner may require that the bond be increased accordingly.\nNo contract entered into after July 1, 2001, between a licensed vendor of risk management services and a group authorized to self-insure for workers' compensation liabilities under section 79A.03, subdivision 6, may take effect until it has been filed with the commissioner, and either (1) the commissioner has approved it or (2) 60 days have elapsed and the commissioner has not disapproved it as misleading or violative of public policy.\n(5) Rulemaking authority. To carry out the purposes of this subdivision, the commissioner may adopt rules pursuant to sections 14.001 to 14.69. These rules may:\n(a) establish reporting requirements for administrators of insurance or self-insurance plans;\n(b) establish standards and guidelines to assure the adequacy of financing, reinsuring, and administration of insurance or self-insurance plans;\n(c) establish bonding requirements or other provisions assuring the financial integrity of entities administering insurance or self-insurance plans; or\n(d) establish other reasonable requirements to further the purposes of this subdivision.",
	"repealed": false
}