{
	"id": "124D.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.59",
	"title": "124D.59 DEFINITIONS.",
	"text": "For purposes of sections 124D.58 to 124D.65, the terms defined in this section shall have the meanings given them.\n(a) \"English learner\" means a pupil in kindergarten through grade 12; an early childhood special education student under Part B, section 619, of the Individuals with Disabilities Education Act, United States Code, title 20, section 1419; or a prekindergarten student enrolled in an approved voluntary prekindergarten program under section 142D.08 or a school readiness plus program who meets the requirements under subdivision 2a or the following requirements:\n(1) the pupil, as declared by a parent or guardian first learned a language other than English, comes from a home where the language usually spoken is other than English, or usually speaks a language other than English; and\n(2) the pupil is determined by a valid assessment measuring the pupil's English language proficiency and by developmentally appropriate measures, which might include observations, teacher judgment, parent recommendations, or developmentally appropriate assessment instruments, to lack the necessary English skills to participate fully in academic classes taught in English.\n(b) A pupil enrolled in a Minnesota public school in any grade 4 through 12 who in the previous school year took a commissioner-provided assessment measuring the pupil's emerging academic English, shall be counted as an English learner in calculating English learner pupil units under section 126C.05, subdivision 17, and shall generate state English learner aid under section 124D.65, subdivision 5, if the pupil scored below the state cutoff score or is otherwise counted as a nonproficient participant on the assessment measuring the pupil's emerging academic English, or, in the judgment of the pupil's classroom teachers, consistent with section 124D.61, clause (1), the pupil is unable to demonstrate academic language proficiency in English, including oral academic language, sufficient to successfully and fully participate in the general core curriculum in the regular classroom.\n(c) Notwithstanding paragraphs (a) and (b), a pupil in early childhood special education or prekindergarten under section 142D.08, through grade 12 shall not be counted as an English learner in calculating English learner pupil units under section 126C.05, subdivision 17, and shall not generate state English learner aid under section 124D.65, subdivision 5, if:\n(1) the pupil is not enrolled during the current fiscal year in an educational program for English learners under sections 124D.58 to 124D.64; or\n(2) the pupil has generated seven or more years of average daily membership in Minnesota public schools since July 1, 1996.\nConsistent with subdivision 2, an English learner with limited or interrupted formal education is an English learner under subdivision 2 who has at least two fewer years of schooling than the English learner's peers when entering school in the United States.\n\"Essential instructional personnel\" means the following:\n(1) a teacher licensed by the Professional Educator Licensing and Standards Board to teach bilingual education or English as a second language;\n(2) any teacher as defined in section 122A.15 who holds a valid license from the Professional Educator Licensing and Standards Board, if the district assures the department that the teacher will obtain the preservice and in-service training the department considers necessary to enable the teacher to provide appropriate service to English learners.\n\"English as a second language program\" means a program for the instruction of English learners in the following English language skills: reading, writing, listening and speaking.\n\"Bilingual education program\" means an educational program in which instruction is given in both English and the primary language of the English learner to the extent necessary to allow the pupil to progress effectively through the educational system and to attain the basic skills of reading, writing, listening, and speaking in the English language so that the pupil will be able to perform ordinary classwork successfully in English.\n\"Primary language\" means a language other than English which is the language normally used by the child or the language which is spoken in the child's home environment.\n\"Parent\" includes a child's legal guardian.\n\"Educational program for English learners\" means an English as a second language program, bilingual education program, or both an English as a second language and a bilingual education program.\nWhen data on English learners are reported for purposes of educational accountability, English learner data must include all pupils enrolled in a Minnesota public school course or program who are currently or were previously counted as an English learner under this section. Reported data must be disaggregated by currently counted and previously counted English learners.",
	"repealed": false
}