{
	"id": "507.403",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.403",
	"title": "507.403 CERTIFICATE OF SATISFACTION; RELEASE OR PARTIAL RELEASE OF MORTGAGE BY ASSIGNEE.",
	"text": "A certificate that complies with this section is effective to satisfy or release the mortgage or release real estate described in the certificate from the lien of the mortgage even if one or more assignments of the mortgage have not been recorded.\nTo be effective, the certificate under this section must be executed and acknowledged as required by law in the case of a deed, and must contain substantially all of the following:\n(1) the name of the mortgagor, the name of the original mortgagee, the date of the mortgage, the date of recording, and the volume and page number or document number of the mortgage in the real property records where the mortgage is recorded; and\n(2) a statement that the entity or person executing the certificate is the current holder, owner, assignee, or successor of the mortgagee's interest in the mortgage; and\n(3) if a partial release, a legal description of the real property being released from the lien of the mortgage.\nMS 2012 [Repealed by amendment, 2013 c 10 s 2]\nFor purposes of satisfying, releasing, or partially releasing the lien of a mortgage under this section, a certificate that complies with subdivision 2 is prima facie evidence of the facts contained in it, is entitled to be recorded with the county recorder or registrar of titles, operates as a satisfaction or release or partial release of the lien of the mortgage as described in the certificate. The county recorder and the registrar of titles shall rely upon it to satisfy or release or partially release the lien of the mortgage.\nMS 2012 [Repealed by amendment, 2013 c 10 s 2]\nExecution or recording of a wrongful, erroneous, or unauthorized certificate under this section does not relieve the mortgagor or the mortgagor's successors or assigns from any personal liability on the obligations secured by the mortgage, and, in addition to any other remedies provided by law, a person or entity who wrongfully, erroneously, or without authority executes the certificate is liable to the mortgagee, the mortgagee's assigns, and any person or entity for actual damages sustained due to the execution or recording of the certificate, together with reasonable attorney fees, costs, and disbursements incurred by the damaged party as a result.\nThis section is effective March 22, 2013, and applies to any mortgage and any certificate under this section wherever or whenever executed, and whether recorded before, on, or after March 22, 2013.",
	"repealed": false
}