{
	"id": "43A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.33",
	"title": "43A.33 GRIEVANCES.",
	"text": "Managers and employees shall attempt to resolve disputes through informal means prior to the initiation of disciplinary action. No permanent employee in the classified service shall be reprimanded, discharged, suspended without pay, or demoted, except for just cause.\nFor purposes of this section, just cause includes, but is not limited to, consistent failure to perform assigned duties, substandard performance, insubordination, and serious violation of written policies and procedures, provided the policies and procedures are applied in a uniform, nondiscriminatory manner.\nIn an arbitration or hearing proceeding involving discipline of an employee for allegedly abusing a resident of a state hospital or a state nursing home, \"abuse\" includes but is not limited to:\n(1) conduct which constitutes abuse under policies or procedures adopted by state hospitals or state nursing homes; or\n(2) any act which constitutes a violation under sections 609.221 to 609.235, 609.322, 609.342, 609.343, 609.344, or 609.345; or\n(3) the intentional and nontherapeutic infliction of physical pain or injury, or any persistent course of conduct intended to produce mental or emotional distress.\n(a) Procedures for discipline and discharge of employees covered by collective bargaining agreements shall be governed by the agreements. Procedures for employees not covered by a collective bargaining agreement shall be governed by this subdivision and by the commissioner's and managerial plans.\n(b) For discharge, suspension without pay or demotion, no later than the effective date of such action, a permanent classified employee not covered by a collective bargaining agreement shall be given written notice by the appointing authority. The content of that notice as well as the employee's right to reply to the appointing authority shall be as prescribed in the grievance procedure contained in the applicable plan established pursuant to section 43A.18. The notice shall also include a statement that the employee may elect to appeal the action to the Bureau of Mediation Services within 30 calendar days following the effective date of the disciplinary action. A copy of the notice and the employee's reply, if any, shall be filed by the appointing authority with the commissioner no later than ten calendar days following the effective date of the disciplinary action. The commissioner shall have final authority to decide whether the appointing authority shall settle the dispute prior to the hearing provided under subdivision 4.\n(c) For discharge, suspension, or demotion of an employee serving an initial probationary period, and for noncertification in any subsequent probationary period, grievance procedures shall be as provided in the plan established pursuant to section 43A.18.\n(d) Within ten days of receipt of the employee's written notice of appeal, the commissioner of the Bureau of Mediation Services shall provide both parties with a list of potential arbitrators according to the rules of the Bureau of Mediation Services to hear the appeal. The process of selecting the arbitrator from the list shall be determined by the plan.\nThe hearing shall be conducted pursuant to the rules of the Bureau of Mediation Services. If the arbitrator finds, based on the hearing record, that the action appealed was not taken by the appointing authority for just cause, the employee shall be reinstated to the position, or an equal position in another division within the same agency, without loss of pay. If the arbitrator finds that there exists sufficient grounds for institution of the appointing authority's action but the hearing record establishes extenuating circumstances, the arbitrator may reinstate the employee, with full, partial, or no pay, or may modify the appointing authority's action. The appointing authority shall bear the costs of the arbitrator for hearings provided for in this section.\n[Repealed, 2005 c 114 s 3]",
	"repealed": false
}