{
	"id": "12.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.26",
	"title": "12.26 POLITICAL SUBDIVISIONS; TAXATION, APPROPRIATIONS.",
	"text": "Each political subdivision may make appropriations in the manner provided by law for making appropriations for the ordinary expenses of the political subdivision for the payment of expenses of its local organizations for emergency management, and any local contingent of the civil air patrol.\nTo provide money for the emergency management purposes authorized by this chapter, a political subdivision may levy annually upon all taxable property in the political subdivision, except as provided in subdivision 4, a tax in excess of and over and above all taxing limitations in an amount as may be necessary to pay expenditures incurred for emergency management purposes.\n(a) To provide money to purchase organizational equipment that is to be paid for in part by the federal government, a political subdivision may levy a tax upon all taxable property in the political subdivision, except as provided in subdivision 4, in excess of and over and above all taxing limitations, including those provided in subdivision 2, in an amount as may be necessary to pay its share of the cost of the organizational equipment, provided that the governor has approved the purchase.\n(b) Each political subdivision that has initiated the purchase of organizational equipment may:\n(1) pay into the state treasury, in trust, its share of the cost of organizational equipment required by the federal government to be paid in advance;\n(2) pay into the state treasury, in trust, its share of the reimbursement of the federal government by the state as part of its share of the cost of organizational equipment purchased for the political subdivision and initially wholly paid for from the federal treasury;\n(3) pay the entire cost of organizational equipment from funds derived from tax levies authorized by this section, but within the limitations of subdivision 2. Organizational equipment purchased entirely from funds of a political subdivision need not be in excess of equipment provided for normal operation of a political subdivision and may be of a type and kind usable for both local and emergency management purposes.\nWhen levied by a county, the taxes authorized in subdivisions 2 and 3, respectively, must be spread wholly and exclusively upon property within the portion of the county over which the county local organization for emergency management has jurisdiction as provided in section 12.25, subdivision 1; provided, however, that a county may levy annually a tax upon all taxable property within any city or town within the county that has a local emergency management organization.\nMS 1957 [Expired]\nNotwithstanding the limitation contained in subdivision 2, the limitation applicable to the city of Minneapolis continues at 20 cents per capita, and no levy may be made by Hennepin County on property within the city of Minneapolis pursuant to subdivision 4.",
	"repealed": false
}