{
	"id": "375A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/375A.05",
	"title": "375A.05 AT-LARGE CHAIR PLAN.",
	"text": "Subject to the exclusions cited in section 375A.01, subdivision 2, any county may provide for the office of chair of the board with candidates for the office nominated and elected by all the voters of the county separate and apart from other members of the board, except that the chair of the board selected by this method shall be a member of the county board in all other respects. This option shall be known as the at-large chair plan. Upon the adoption of the at-large chair plan, the county shall be redistricted to reflect the change in number of commissioners on the board. Unless a county had adopted either the at-large chair or the elected executive plan, each board shall elect a chair from among its membership pursuant to the provisions of section 375.13.\nThe at-large chair plan may be adopted only in those counties which have county boards of five or seven members. The change to a county board of five or seven members may be instituted concurrently with the change to the at-large chair plan in which case the county board resolution, the study commission recommendation or the petition by the voters initiating the plan shall indicate the number of members to be on the board including the at-large chair. If the resolution, the recommendation or the petition does not specify the number to be on the board, the board shall consist of the same number, including the at-large chair as before the adoption of an option, unless the number of the board is greater than seven. If the board is less than five, it shall be increased to five; and if greater than seven, it shall be reduced to seven.\nThe first at-large chair shall be elected at the county general election following the adoption of the at-large chair plan and every four years thereafter. The chair shall hold office for a term of four years commencing on the first Monday of January following election. The chair shall be a resident of the county and shall be nominated and elected by all the voters of the county in the manner provided by law for the election of county officers.\nThe salary of the at-large chair for the first year of the term shall be set by the county board not less than 30 days before the first day candidates may file for the office; thereafter, the salary of the at-large chair shall be set annually by the county board at the January meeting of the board; provided that the salary of the at-large chair shall not be less than 120 percent of the salary of the highest paid member of the board of county commissioners. A minimum salary for each subsequent term of the at-large chair shall be fixed by the county board not less than 30 days before the first day candidates may file for the office in an amount not less than the minimum provided in this section.",
	"repealed": false
}