{
	"id": "155A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.30",
	"title": "155A.30 SCHOOLS.",
	"text": "Any person who establishes or conducts a school in this state shall be licensed. A license issued to postsecondary licensed cosmetology schools meeting the provisions of subdivision 12 shall include the designation \"Postsecondary Cosmetology School License.\"\nThe board shall by rule establish minimum standards of course content and length specific to the educational preparation prerequisite to testing and licensing as cosmetologist, esthetician, and nail technician.\nApplication for a license shall be prepared on forms furnished by the board and shall contain the following and such other information as may be required:\n(1) the name of the school, together with ownership and controlling officers, members, and managing employees;\n(2) the specific fields of instruction which will be offered and reconciliation of the course content and length to meet the minimum standards, as prescribed in subdivision 2;\n(3) the place or places where instruction will be given;\n(4) a listing of the equipment available for instruction in each course offered;\n(5) the maximum enrollment to be accommodated;\n(6) a listing of instructors, all of whom shall be licensed as provided in section 155A.27, subdivision 2, except that any school may use occasional instructors or lecturers who would add to the general or specialized knowledge of the students but who need not be licensed;\n(7) a current balance sheet, income statement or documentation to show sufficient financial worth and responsibility to properly conduct a school and to assure financial resources ample to meet the school's financial obligations;\n(8) other financial guarantees which would assure protection of the public as determined by rule; and\n(9) a copy of all written material which the school uses to solicit prospective students, including but not limited to a tuition and fee schedule, and all catalogues, brochures and other recruitment advertisements. Each school shall annually, on a date determined by the board, file with the board any new or amended materials which it has distributed during the past year.\nEach application shall be signed and certified to under oath by the proprietor if the applicant is a proprietorship, by the managing partner if the applicant is a partnership, or by the authorized officers of the applicant if the applicant is a corporation, association, company, firm, society or trust.\nA license must not be issued unless the board first determines that the applicant has met the requirements in clauses (1) to (9):\n(1) the applicant must have a sound financial condition with sufficient resources available to meet the school's financial obligations; to refund all tuition and other charges, within a reasonable period of time, in the event of dissolution of the school or in the event of any justifiable claims for refund against the school; to provide adequate service to its students and prospective students; and to maintain proper use and support of the school;\n(2) the applicant must have satisfactory training facilities with sufficient tools and equipment and the necessary number of work stations to adequately train the students currently enrolled, and those proposed to be enrolled;\n(3) the applicant must employ a sufficient number of qualified instructors trained by experience and education to give the training contemplated;\n(4) the premises and conditions under which the students work and study must be sanitary, healthful, and safe according to modern standards;\n(5) each occupational course or program of instruction or study must be of such quality and content as to provide education and training that will adequately prepare enrolled students for testing, licensing, and entry level positions;\n(6) the school must have coverage by professional liability insurance of at least $25,000 per incident and an accumulation of $150,000 for each premium year;\n(7) the applicant shall provide evidence of the school's compliance with section 176.182;\n(8) the applicant, except the state and its political subdivisions as described in section 13.02, subdivision 11, must file with the board a continuous corporate surety bond in the amount of no less than ten percent of the preceding year's gross income from student tuition, fees, and other required institutional charges, but in no event less than $10,000, conditioned upon the faithful performance of all contracts and agreements with students made by the applicant. New schools must base the bond amount on the anticipated gross income from student tuition, fees, and other required institutional charges for the third year of operation, but in no event less than $10,000. The applicant must compute the amount of the surety bond and verify that the amount of the surety bond complies with this subdivision. The bond shall run to the board and to any person who may have a cause of action against the applicant arising at any time after the bond is filed and before it is canceled for breach of any contract or agreement made by the applicant with any student. The surety of the bond may cancel it upon giving 60 days' notice in writing to the board and shall be relieved of liability for any breach of condition occurring after the effective date of cancellation; and\n(9) the applicant must appoint a designated school manager.\n(a) Applications for initial license under sections 155A.21 to 155A.36 shall be accompanied by a nonrefundable application fee set forth in section 155A.25.\n(b) License duration shall be three years. Each renewal application shall be accompanied by a nonrefundable renewal fee set forth in section 155A.25.\n(c) Application for renewal of license shall be made as provided in rules adopted by the board and on forms supplied by the board.\nAll schools may be inspected as often as the board considers necessary to affirm compliance. The board shall have the authority to assess the cost of the inspection to the school.\nThe board shall maintain and make available to the public a list of licensed schools.\nA school shall display in the entrance reception room of its student section a sign prominently and conspicuously indicating that all work therein is done exclusively by students. Professional departments of a school shall be run as entirely separate and distinct businesses and shall have separate entrances.\nNothing contained in sections 155A.21 to 155A.36 shall prevent a school from charging for student work done in the school to cover the cost of materials used and expenses incurred in and for the operation of the school. All of the student work shall be prominently and conspicuously advertised and held forth as being student work and not otherwise.\nEach school must comply with the Minnesota Human Rights Act under chapter 363A.\n(a) Instruction may be offered for no more than ten hours per day per student.\n(b) Instruction must be given within a licensed school building. Online instruction is permitted for board-approved theory-based classes. Practice-based classes must not be given online.\nA cosmetology school licensed or applying for licensure under this section shall maintain recognition as an institution of postsecondary study by meeting the following conditions, in addition to Minnesota Rules, part 2110.0310:\n(1) the school must admit as regular students only those individuals who have a high school diploma or a diploma based on passing commissioner of education-selected high school equivalency tests or their equivalent, or who are beyond the age of compulsory education as prescribed by section 120A.22; and\n(2) the school must be licensed by name and authorized by the Office of Higher Education and the board to offer one or more training programs beyond the secondary level.",
	"repealed": false
}