{
	"id": "97A.420",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.420",
	"title": "97A.420 SEIZURE OR INVALIDATION OF LICENSES.",
	"text": "(a) An enforcement officer shall immediately seize or invalidate the license of a person who unlawfully takes, transports, or possesses wild animals when the restitution value of the wild animals exceeds $500. Except as provided in subdivisions 2, 4, and 5, the person may not use or obtain any license to take the same type of wild animals involved, including a duplicate license, until an action is taken under subdivision 6. If the license seized or invalidated under this paragraph was for a big game animal, the license seizure or invalidation applies to all licenses to take big game issued to the individual. If the license seized or invalidated under this paragraph was for small game animals, the license seizure or invalidation applies to all licenses to take small game issued to the individual.\n(b) In addition to the license seizure or invalidation under paragraph (a), if the restitution value of the wild animals unlawfully taken, possessed, or transported is $1,000 or more, all other game and fish licenses held by the person shall be immediately seized or invalidated. Except as provided in subdivision 2, 4, or 5, the person may not obtain any game or fish license or permit, including a duplicate license, until an action is taken under subdivision 6.\n(c) A person may not take wild animals covered by a license seized or invalidated under this subdivision until an action is taken under subdivision 6.\n(d) The commissioner must make a means of seizing or invalidating and releasing a paperless license under this section available to enforcement officers.\n[See Note.]\n(a) At any time after the seizure or invalidation of a license under subdivision 1 and before revocation under section 97A.421, a person may request in writing a review of the seizure or invalidation under this section. Upon receiving the request for review, the commissioner shall review the seizure or invalidation, the evidence upon which it was based, and other material information brought to the attention of the commissioner, and determine whether sufficient cause exists to sustain the seizure or invalidation.\n(b) Within 15 days after receiving the request for administrative review, the commissioner shall issue a written report of the review and shall order that the seizure or invalidation be either sustained or rescinded.\n(c) The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act under chapter 14. The availability of administrative review does not preclude judicial review under this section.\n(a) Within 30 days following the seizure or invalidation of a license under subdivision 1, a person may petition the court for review. The petition must be filed with the district court administrator in the county where the incident occurred, together with proof of service of a copy on the commissioner and the county attorney. A responsive pleading is not required of the commissioner of natural resources and court fees may not be charged for the appearance of the representative of the commissioner in the matter.\n(b) The petition must be captioned in the name of the person making the petition as petitioner and the commissioner as respondent. The petition must state specifically the grounds upon which the petitioner seeks rescission of the license seizure or invalidation.\n(c) The filing of the petition does not stay the license seizure or invalidation. The judicial review shall be conducted according to the Rules of Civil Procedure.\n(a) A hearing under subdivision 3 must be before a district court judge in the county where the incident occurred giving rise to the license seizure or invalidation. The hearing must be to the court and may be conducted at the same time as hearings upon pretrial motions in a related criminal prosecution. The commissioner must be represented by the county attorney.\n(b) The hearing must be held at the earliest practicable date and in any event no later than 60 days following the filing of the petition for review.\n(c) The scope of the hearing must be limited to the issue of whether there is probable cause to believe that the person had unlawfully taken, possessed, or transported wild animals with a restitution value over $500.\n(d) The court shall order that the license seizure or invalidation be either sustained or rescinded. Within 14 days following the hearing, the court shall forward a copy of the order to the commissioner.\n(e) Any party aggrieved by the decision of the reviewing court may appeal the decision as provided in the Rules of Civil Appellate Procedure.\nAt any time during the period that a game or fish license is seized or invalidated under subdivision 1, a person possessing a commercial license issued under the game and fish laws may make a written request to the commissioner to temporarily release the commercial license. If the commissioner determines that the public welfare will not be injured, the commissioner may temporarily reinstate the commercial license upon payment of a temporary reinstatement fee of $1,000 cash or bond in favor of the state for each commercial license to be released. An additional fee is not required for vehicles licensed under section 97A.475, subdivision 26, clause (2) or (4). If the license is returned under subdivision 6, paragraph (a), the temporary reinstatement fee shall be returned to the licensee. If the license is revoked under subdivision 6, paragraph (b), the temporary reinstatement fee shall be deposited in the game and fish fund and is not refundable.\n(a) Upon acquittal, dismissal, or determination not to charge a person for a violation, the license seizure or invalidation under subdivision 1 is immediately rescinded and any license seized or invalidated in connection with the incident must be returned to the licensee or reinstated.\n(b) Upon conviction of a violation when the restitution value of the wild animals exceeds $500, revocation of licenses and license privileges must be imposed as provided under section 97A.421, subdivision 2a.",
	"repealed": false
}