{
	"id": "62U.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.02",
	"title": "62U.02 PAYMENT RESTRUCTURING; QUALITY INCENTIVE PAYMENTS.",
	"text": "(a) The commissioner of health shall develop a standardized set of measures for use by health plan companies as specified in subdivision 5. As part of the standardized set of measures, the commissioner shall establish statewide measures by which to assess the quality of health care services offered by health care providers, including health care providers certified as health care homes under section 62U.03. The statewide measures shall be used for the quality incentive payment system developed in subdivision 2 and the quality transparency requirements in subdivision 3. The statewide measures must:\n(1) for purposes of assessing the quality of care provided at physician clinics, including clinics certified as health care homes under section 62U.03, be selected from the available measures as defined in Code of Federal Regulations, title 42, part 414 or 495, as amended, unless the stakeholders identified under paragraph (b) determine that a particular diagnosis, condition, service, or procedure is not reflected in any of the available measures in a way that meets identified needs;\n(2) be based on medical evidence;\n(3) be developed through a process in which providers participate and consumer and community input and perspectives are obtained;\n(4) include uniform definitions, measures, and forms for submission of data, to the greatest extent possible;\n(5) seek to avoid increasing the administrative burden on health care providers; and\n(6) place a priority on measures of health care outcomes, rather than process measures, wherever possible.\nThe measures may also include measures of care infrastructure and patient satisfaction.\n(b) By June 30, 2018, the commissioner shall develop a measurement framework that identifies the most important elements for assessing the quality of care, articulates statewide quality improvement goals, ensures clinical relevance, fosters alignment with other measurement efforts, and defines the roles of stakeholders. By December 15, 2018, the commissioner shall use the framework to update the statewide measures used to assess the quality of health care services offered by health care providers, including health care providers certified as health care homes under section 62U.03. No more than six statewide measures shall be required for single-specialty physician practices and no more than ten statewide measures shall be required for multispecialty physician practices. Measures in addition to the six statewide measures for single-specialty practices and the ten statewide measures for multispecialty practices may be included for a physician practice if derived from administrative claims data. Care infrastructure measures collected according to section 62J.495 shall not be counted toward the maximum number of measures specified in this paragraph. The commissioner shall develop the framework in consultation with stakeholders that include consumer, community, and advocacy organizations representing diverse communities and patients; health plan companies; health care providers whose quality is assessed, including providers who serve primarily socioeconomically complex patient populations; health care purchasers; community health boards; and quality improvement and measurement organizations. The commissioner, in consultation with stakeholders, shall review the framework at least once every three years. The commissioner shall also submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance by September 30, 2018, summarizing the development of the measurement framework and making recommendations on the type and appropriate maximum number of measures in the statewide measures set for implementation on January 1, 2020.\n(c) Effective July 1, 2016, the commissioner shall stratify quality measures by race, ethnicity, preferred language, and country of origin beginning with five measures, and stratifying additional measures to the extent resources are available. On or after January 1, 2018, the commissioner may require measures to be stratified by other sociodemographic factors or composite indices of multiple factors that according to reliable data are correlated with health disparities and have an impact on performance on quality or cost indicators. New methods of stratifying data under this paragraph must be tested and evaluated through pilot projects prior to adding them to the statewide system. In determining whether to add additional sociodemographic factors and developing the methodology to be used, the commissioner shall consider the reporting burden on providers and determine whether there are alternative sources of data that could be used. The commissioner shall ensure that categories and data collection methods are developed in consultation with those communities impacted by health disparities using culturally appropriate community engagement principles and methods. The commissioner shall implement this paragraph in coordination with the contracting entity retained under subdivision 4, in order to build upon the data stratification methodology that has been developed and tested by the entity. Nothing in this paragraph expands or changes the commissioner's authority to collect, analyze, or report health care data. Any data collected to implement this paragraph must be data that is available or is authorized to be collected under other laws. Nothing in this paragraph grants authority to the commissioner to collect or analyze patient-level or patient-specific data of the patient characteristics identified under this paragraph.\n(d) The statewide measures shall be reviewed at least annually by the commissioner.\n(a) By July 1, 2009, the commissioner shall develop a system of quality incentive payments under which providers are eligible for quality-based payments that are in addition to existing payment levels, based upon a comparison of provider performance against specified targets, and improvement over time. The targets must be based upon and consistent with the quality measures established under subdivision 1.\n(b) To the extent possible, the payment system must adjust for variations in patient population in order to reduce incentives to health care providers to avoid high-risk patients or populations, including those with risk factors related to race, ethnicity, language, country of origin, and sociodemographic factors.\n(c) The requirements of section 62Q.101 do not apply under this incentive payment system.\n(a) The commissioner shall establish standards for measuring health outcomes, establish a system for risk adjusting quality measures, and issue periodic public reports on trends in provider quality at the statewide, regional, or clinic levels.\n(b) Effective July 1, 2017, the risk adjustment system established under this subdivision shall adjust for patient characteristics identified under subdivision 1, paragraph (c), that are correlated with health disparities and have an impact on performance on cost and quality measures. The risk adjustment method may consist of reporting based on an actual-to-expected comparison that reflects the characteristics of the patient population served by the clinic or hospital. The commissioner shall implement this paragraph in coordination with any contracting entity retained under subdivision 4.\n(c) Physician clinics and hospitals shall submit standardized information for the identified statewide measures to the commissioner or the commissioner's designee in the formats specified by the commissioner, which must include alternative formats for clinics or hospitals experiencing technological or economic barriers to submission in standardized electronic form. The commissioner shall ensure that any quality data reporting requirements for physician clinics are aligned with the specifications and timelines for the selected measures as defined in subdivision 1, paragraph (a), clause (1). The commissioner may develop additional data on race, ethnicity, preferred language, country of origin, or other sociodemographic factors as identified under subdivision 1, paragraph (c), and as required for stratification or risk adjustment. None of the statewide measures selected shall require providers to use an external vendor to administer or collect data.\nThe commissioner may contract with a private entity or consortium of private entities to complete the tasks in subdivisions 1 to 3. The private entity or consortium must be nonprofit and have governance that includes representatives from the following stakeholder groups: health care providers, including providers serving high concentrations of patients and communities impacted by health disparities; health plan companies; consumers, including consumers representing groups who experience health disparities; employers or other health care purchasers; and state government. No one stakeholder group shall have a majority of the votes on any issue or hold extraordinary powers not granted to any other governance stakeholder.\nHealth plan companies shall use the standardized set of measures established under this section and shall not require providers to use and report health plan company-specific quality and outcome measures.",
	"repealed": false
}