{
	"id": "469.179",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.179",
	"title": "469.179 EXISTING PROJECTS; EFFECTIVE DATES OF AMENDMENTS.",
	"text": "The provisions of sections 469.174 to 469.178 shall not affect any project for which tax increment certification was requested pursuant to law prior to August 1, 1979, or any project carried on by an authority pursuant to section 469.033, subdivision 5, with respect to which the governing body has by resolution designated properties for inclusion in the district prior to August 1, 1979, except:\n(1) as otherwise expressly provided in sections 469.174 to 469.178; or\n(2) as an authority elects to proceed with an existing district, under the provisions of sections 469.174 to 469.178; or\n(3) as provided in subdivision 2; or\n(4) section 469.177, subdivision 3, paragraph (b), shall apply to all development districts created pursuant to Minnesota Statutes 1978, chapter 472A, or any special law, prior to August 1, 1979.\nIf the development or redevelopment activity within the project or district of a tax increment financing project certified prior to August 1, 1979, is extended beyond the scope of activity set forth in the district's redevelopment plan under chapter 462 or 472A, if applicable, after May 1, 1988, the authority must with regard to the new activity conform to the provisions of sections 469.174 to 469.178 with the following exceptions.\n(a) Section 469.175, subdivision 3, paragraph (b), clauses (1) and (5), shall not apply. Furthermore, the provisions of section 473F.02, subdivision 3, shall continue to apply to the entire district, if applicable.\n(b) Section 469.177, subdivision 3, shall not apply.\n(a) This subdivision establishes presumptions as to the effective dates of acts amending sections 469.174 to 469.178. These rules supplement the rules under section 645.02. The rules in paragraphs (b) and (c) apply unless the act specifies a different intent as to the time of its application.\n(b) If the act is effective on a date either specified by the act itself or under section 645.02, the act is effective for districts for which requests for certification are made after the specified date.\n(c) If the act is effective for districts for which requests for certification are made after a specified date either under paragraph (b) or the terms of the act, the following rules apply:\n(1) in the case of a district where the first request for certification is made after the specified date, the act applies in full and to the entire area of the district; and\n(2) in the case of a district where the first request for certification was made on or before the specified date, the act applies only to the area of the district added by tax increment financing plan amendments for which certification is requested after the specified date.",
	"repealed": false
}