{
	"id": "148.262",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.262",
	"title": "148.262 FORMS OF DISCIPLINARY ACTION; AUTOMATIC SUSPENSION; TEMPORARY SUSPENSION; REISSUANCE.",
	"text": "When the board finds that grounds for disciplinary action exist under section 148.261, subdivision 1, it may take one or more of the following actions:\n(1) deny the license, registration, or registration renewal;\n(2) revoke the license;\n(3) suspend the license;\n(4) impose limitations on the nurse's practice of advanced practice, professional, or practical nursing including, but not limited to, limitation of scope of practice or the requirement of practice under supervision;\n(5) impose conditions on the retention of the license including, but not limited to, the imposition of retraining or rehabilitation requirements or the conditioning of continued practice on demonstration of knowledge or skills by appropriate examination, monitoring, or other review;\n(6) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed as to deprive the nurse of any economic advantage gained by reason of the violation charged, to reimburse the board for the cost of counsel, investigation, and proceeding, and to discourage repeated violations;\n(7) order the nurse to provide unremunerated service;\n(8) censure or reprimand the nurse; or\n(9) any other action justified by the facts in the case.\nUnless the board orders otherwise, a license to practice advanced practice, professional, or practical nursing is automatically suspended if:\n(1) a guardian of a nurse is appointed by order of a court under sections 524.5-101 to 524.5-502;\n(2) the nurse is committed by order of a court under chapter 253B; or\n(3) the nurse is determined to be mentally incompetent, mentally ill, chemically dependent, or a person dangerous to the public by a court of competent jurisdiction within or without this state.\nThe license remains suspended until the nurse is restored to capacity by a court and, upon petition by the nurse, the suspension is terminated by the board after a hearing or upon agreement between the board and the nurse.\nIn addition to any other remedy provided by law, the board may, through its designated board member under section 214.10, subdivision 2, temporarily suspend the license of a nurse without a hearing if the board finds that there is probable cause to believe the nurse has violated a statute or rule the board is empowered to enforce and continued practice by the nurse would create a serious risk of harm to others. The suspension shall take effect upon written notice to the nurse, served by first-class mail, specifying the statute or rule violated. The suspension shall remain in effect until the board issues a temporary stay of suspension or a final order in the matter after a hearing or upon agreement between the board and the nurse. At the time it issues the suspension notice, the board shall schedule a disciplinary hearing to be held under the Administrative Procedure Act. The nurse shall be provided with at least 20 days' notice of any hearing held under this subdivision. The hearing shall be scheduled to begin no later than 30 days after the issuance of the suspension order.\nThe board may reinstate and reissue a license or registration certificate to practice advanced practice, professional, or practical nursing, but as a condition may impose any disciplinary or corrective measure that it might originally have imposed. Any person whose license or registration has been revoked, suspended, or limited may have the license reinstated and a new registration issued when, in the discretion of the board, the action is warranted, provided that the person shall be required by the board to pay the costs of the proceedings resulting in the revocation, suspension, or limitation of the license or registration certificate and reinstatement of the license or registration certificate, and to pay the fee for the current registration period. The cost of proceedings shall include, but not be limited to, the cost paid by the board to the Office of Administrative Hearings and the Office of the Attorney General for legal and investigative services, the costs of a court reporter and witnesses, reproduction of records, board staff time, travel, and expenses, and board members' per diem reimbursements, travel costs, and expenses.",
	"repealed": false
}