{
	"id": "543.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/543.19",
	"title": "543.19 PERSONAL JURISDICTION OVER NONRESIDENTS.",
	"text": "As to a cause of action arising from any acts enumerated in this subdivision, a court of this state with jurisdiction of the subject matter may exercise personal jurisdiction over any foreign corporation or any nonresident individual, or the individual's personal representative, in the same manner as if it were a domestic corporation or the individual were a resident of this state. This section applies if, in person or through an agent, the foreign corporation or nonresident individual:\n(1) owns, uses, or possesses any real or personal property situated in this state; or\n(2) transacts any business within the state; or\n(3) commits any act in Minnesota causing injury or property damage; or\n(4) commits any act outside Minnesota causing injury or property damage in Minnesota, subject to the following exceptions when no jurisdiction shall be found:\n(i) Minnesota has no substantial interest in providing a forum; or\n(ii) the burden placed on the defendant by being brought under the state's jurisdiction would violate fairness and substantial justice.\n[See Note.]\nThe service of process on any person who is subject to the jurisdiction of the courts of this state, as provided in this section, may be made by personally serving the summons upon the defendant outside this state with the same effect as though the summons had been personally served within this state.\nOnly causes of action arising from acts enumerated in subdivision 1 may be asserted against a defendant in an action in which jurisdiction over the defendant is based upon this section.\nNothing contained in this section shall limit or affect the right to serve any process in any other manner now or hereafter provided by law or the Minnesota Rules of Civil Procedure.\n\"Nonresident individual,\" as used in this section, means any individual, or the individual's personal representative, who is not domiciled or residing in the state when suit is commenced.",
	"repealed": false
}