{
	"id": "327A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/327A.01",
	"title": "327A.01 DEFINITIONS.",
	"text": "As used in sections 327A.01 to 327A.07, the terms in this section shall have the meanings assigned to them.\n\"Building standards\" means the materials and installation standards of the State Building Code, adopted by the commissioner of labor and industry pursuant to sections 326B.101 to 326B.194, in effect at the time of the construction or remodeling.\n\"Dwelling\" means a new building, not previously occupied, constructed for the purpose of habitation; but does not include appurtenant recreational facilities, detached garages, driveways, walkways, patios, boundary walls, retaining walls not necessary for the structural stability of the dwelling, landscaping, fences, nonpermanent construction materials, off-site improvements, and all other similar items.\n\"Initial vendee\" means a person who first contracts to purchase a dwelling from a vendor for the purpose of habitation and not for resale in the ordinary course of trade.\n\"Major construction defect\" means actual damage to the load-bearing portion of the dwelling or the home improvement, including damage due to subsidence, expansion or lateral movement of the soil, which affects the load-bearing function and which vitally affects or is imminently likely to vitally affect use of the dwelling or the home improvement for residential purposes. \"Major construction defect\" does not include damage due to movement of the soil caused by flood, earthquake or other natural disaster.\n\"Vendee\" means any purchaser of a dwelling and includes the initial vendee and any subsequent purchasers.\n\"Vendor\" means any person, firm, or corporation that constructs dwellings, including the construction of dwellings on land owned by vendees. Vendor does not include a subcontractor or material supplier involved in the construction of a dwelling.\n\"Warranty date\" means the date from and after which the statutory warranties provided in section 327A.02 shall be effective, and is the earliest of:\n(a) the date of the initial vendee's first occupancy of the dwelling; or\n(b) the date on which the initial vendee takes legal or equitable title in the dwelling.\nIn the case of a home improvement, the warranty date is the date on which the home improvement work was completed.\n\"Home improvement\" means the repairing, remodeling, altering, converting or modernizing of, or adding to a residential building. For the purpose of this definition, residential building does not include appurtenant recreational facilities, detached garages, driveways, walkways, patios, boundary walls, retaining walls not necessary for the structural stability of the building, landscaping, fences, nonpermanent construction materials, off-site improvements, and all other similar items.\n\"Home improvement contractor\" means a person who is engaged in the business of home improvement either full time or part time, and who holds out to the public as having knowledge or skill peculiar to the business of home improvement.\n\"Owner\" means any person who owns a residential building on which home improvement work is performed, and includes any subsequent owner of the residential building.\n\"Inspection\" means a visual or invasive examination of the alleged property damage.",
	"repealed": false
}