{
	"id": "473.4485",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4485",
	"title": "473.4485 METROPOLITAN AREA TRANSIT INVESTMENT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Busway\" means a form of bus service provided to the public on a regular and ongoing basis, including arterial or highway bus rapid transit, that (1) compared to other regular route bus service, provides reduced travel time and uses distinct bus stop or station amenities, and (2) does not primarily or substantially operate within separated rights-of-way.\n(c) \"Commissioner\" means the commissioner of transportation.\n(d) \"Guideway\" means a form of transportation service provided to the public on a regular and ongoing basis that primarily or substantially operates within separated rights-of-way or operates on rails, and includes:\n(1) each line for intercity passenger rail, commuter rail, light rail transit, and streetcars;\n(2) as applicable, each line for dedicated bus service, which may include arterial or highway bus rapid transit, limited stop bus service, and express bus service; and\n(3) any intermodal facility serving two or more lines identified in clauses (1) and (2).\nGuideway does not include a busway.\n(e) \"Local unit of government\" means a county, statutory or home rule charter city, town, or other political subdivision including, but not limited to, a regional railroad authority or joint powers board.\n(f) \"Separated rights-of-way\" includes exclusive, dedicated, or primary use of a right-of-way by the public transportation service. Separated rights-of-way does not include a shoulder, dynamic shoulder lane, or priced lane under section 160.93.\n(g) \"Sources of funds\" includes, but is not limited to, money from federal aid, state appropriations, the Metropolitan Council, special taxing districts, local units of government, farebox recovery, and nonpublic sources.\n(h) \"Budget activity\" includes, but is not limited to, environmental analysis, land acquisition, easements, design, preliminary and final engineering, acquisition of vehicles and rolling stock, track improvement and rehabilitation, and construction.\nA state agency or local unit of government that submits a request to the legislature to obtain state funds for a guideway project shall, as part of the request, provide a summary financial plan for the project that presents the following information as reflected by the data and level of detail available in the latest phase of project development:\n(1) capital expenditures and funding sources for the project, including expenditures to date and total projected or estimated expenditures, with a breakdown by committed and proposed sources of funds; and\n(2) estimated annual operations and maintenance expenditures for the project, with a breakdown by committed and proposed sources of funds.\n(a) By October 15 in every even-numbered year, the council must prepare, in collaboration with the commissioner, a report on comprehensive transit finance in the metropolitan area. The council must submit the report electronically to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance.\n(b) The report must be structured to provide financial information in six-month increments corresponding to state and local fiscal years, and must use consistent assumptions and methodologies. The report must comprehensively identify all funding sources and expenditures related to transit in the metropolitan area, including but not limited to:\n(1) sources and uses of funds from regional railroad authorities, joint powers agreements, counties, and cities;\n(2) expenditures for transit planning, feasibility studies, alternatives analysis, and other transit project development; and\n(3) expenditures for guideways, busways, regular route bus service, demand-response service, and special transportation service under section 473.386.\n(c) The report must include a section that summarizes the status of (1) guideways in revenue operation, and (2) guideway projects (i) currently in study, planning, development, or construction; (ii) identified in the transportation policy plan under section 473.146; or (iii) identified in the comprehensive statewide freight and passenger rail plan under section 174.03, subdivision 1b.\n(d) At a minimum, the guideways status section of the report must provide for each guideway project wholly or partially in the metropolitan area:\n(1) a brief description of the project, including projected ridership;\n(2) a summary of the overall status and current phase of the project;\n(3) a timeline that includes (i) project phases or milestones, including any federal approvals; (ii) expected and known dates of commencement of each phase or milestone; and (iii) expected and known dates of completion of each phase or milestone;\n(4) a brief progress update on specific project phases or milestones completed since the last previous submission of a report under this subdivision; and\n(5) a summary financial plan that identifies, as reflected by the data and level of detail available in the latest phase of project development and to the extent available:\n(i) capital expenditures, including expenditures to date and total projected expenditures, with a breakdown by committed and proposed sources of funds for the project;\n(ii) estimated annual operations and maintenance expenditures reflecting the level of detail available in the current phase of the project development, with a breakdown by committed and proposed sources of funds for the project; and\n(iii) if feasible, project expenditures by budget activity.\n(e) The report must include a section that summarizes the status of (1) busways in revenue operation, and (2) busway projects currently in study, planning, development, or construction.\n(f) The report must include a section that identifies the total ridership, farebox recovery ratio, and per-passenger operating subsidy for (1) each route and line in revenue operation by a transit provider, including guideways, busways, and regular route bus service; and (2) demand-response service and special transportation service. The section must provide data, as available on a per-passenger mile basis and must provide information for at least the previous three years. The section must identify performance standards for farebox recovery and identify each route and line that does not meet the standards.\n(g) The report must also include a systemwide capacity analysis for transit operations and investment in expansion and maintenance that:\n(1) provides a funding projection, annually over the ensuing ten years, and with a breakdown by committed and proposed sources of funds, of:\n(i) total capital expenditures for guideways and for busways;\n(ii) total operations and maintenance expenditures for guideways and for busways;\n(iii) total funding available for guideways and for busways, including from projected or estimated farebox recovery; and\n(iv) total funding available for transit service in the metropolitan area; and\n(2) evaluates the availability of funds and distribution of sources of funds for guideway and for busway investments.\n(h) The capacity analysis under paragraph (g) must include all guideway and busway lines for which public funds are reasonably expected to be expended in planning, development, construction, revenue operation, or capital maintenance during the ensuing ten years.\n(i) Local units of government must provide assistance and information in a timely manner as requested by the commissioner or council for completion of the report.",
	"repealed": false
}