{
	"id": "62L.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.15",
	"title": "62L.15 MEMBERS.",
	"text": "The association shall conduct an annual meeting of the members of the association for the purpose of electing directors and transacting any other appropriate business of the membership of the association. The board shall determine the date, time, and place of the annual meeting. The association shall conduct its first annual member meeting on or before December 1, 1992.\nSpecial meetings of the members must be held whenever called by any three of the directors. At least two categories must be represented among the directors calling a special meeting of the members. The categories are public directors, accident and health insurance companies, nonprofit health service plan corporations, and health maintenance organizations. Special meetings of the members must be held at a time and place designated in the notice of the meeting.\nEach member's vote is a weighted vote and is based on each member's total insurance premiums, subscriber contract charges, health maintenance contract payments, or other health benefit plan revenue derived from, or on behalf of, small employers during the preceding calendar year, as determined by the board and approved by the commissioner, based on annual statements and other reports considered necessary by the board of directors.\nAt least 60 days before the first annual meeting of the members, the commissioner shall give written notice to all members of the time and place of the member meeting. The members shall elect directors representing the members, approve the initial plan of operation of the association, and transact any other appropriate business of the membership of the association.\nAll members shall comply with the provisions of this chapter, the association's bylaws, the plan of operation developed by the board of directors, and any other operating, administrative, or other procedures established by the board of directors for the operation of the association. The board may request the commissioner to secure compliance with this chapter through the use of any enforcement action otherwise available to the commissioner.",
	"repealed": false
}