{
	"id": "502.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/502.88",
	"title": "502.88 RULE AGAINST PERPETUITIES AND ACCUMULATIONS AS AFFECTED BY POWERS OF APPOINTMENT.",
	"text": "Notwithstanding any provision of this section to the contrary, nothing in this section shall be construed, applied, or interpreted to be inconsistent with chapter 501A.\n(a) If an estate is created by an instrument exercising a power of appointment, the permissible period of the rule against perpetuities begins:\n(1) In the case of an instrument exercising either:\n(i) a general power which is presently exercisable; or\n(ii) any other power, whether presently exercisable, testamentary, or postponed, but only if the exercise of the power makes express reference to this item, section 502.88, subdivision 2, paragraph (a), clause (1), item (ii), in the instrument of exercise,\nthe period shall begin on the effective date of the instrument of exercise.\n(2) In all other cases, the period begins at the time of the creation of the power.\n(b) If the creator of a trust reserves an unqualified power to revoke, the permissible period of the rule against perpetuities begins when the power to revoke terminates by reason of the death of the creator, by a release of the power, or otherwise.\nIn all cases covered by subdivision 2, the permissible period of the rule against perpetuities is determined by the law in effect when the power is exercised or the unqualified power to revoke is terminated, and not by the law in effect when the power was created.\nWhen the permissible period of the rule against perpetuities must be computed from the time of the creation of the power of appointment, facts and circumstances existing on the effective date of the instrument exercising the power must be taken into account in determining the validity of interests created by the instrument exercising the power.\nWhen a direction for the accumulation of income is contained in an instrument exercising a power, whether the instrument is created before or after January 1, 2016, the validity of the direction is determined by the law in effect when the power is exercised or the unqualified power to revoke is terminated, and not by the law in effect when the power was created.",
	"repealed": false
}