{
	"id": "477A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.18",
	"title": "477A.18 PRODUCTION PROPERTY TRANSITION AID.",
	"text": "(a) When used in this section, the following terms have the meanings indicated in this subdivision.\n(b) \"Local unit\" means a home rule charter or statutory city, or a town.\n(c) \"Net tax capacity differential\" means the positive difference, if any, by which the local unit's net tax capacity was reduced from assessment year 2014 to assessment year 2015 due to the change in the definition of real property in section 272.03, subdivision 1, enacted by Laws 2014, chapter 308, article 2, section 9. For purposes of determining the net tax capacity differential, any property in a job opportunity building zone under section 469.314 may not be included when calculating a local unit's net tax capacity.\n(a) If the net tax capacity differential of the local unit exceeds five percent of its 2015 net tax capacity, the local unit is eligible for transition aid computed under paragraphs (b) to (f).\n(b) For aids payable in 2016, transition aid under this section for an eligible local unit equals (1) the net tax capacity differential, times (2) the jurisdiction's tax rate for taxes payable in 2015.\n(c) For aids payable in 2017, transition aid under this section for an eligible local unit equals 80 percent of (1) the net tax capacity differential, times (2) the jurisdiction's tax rate for taxes payable in 2016.\n(d) For aids payable in 2018, transition aid under this section for an eligible local unit equals 60 percent of (1) the net tax capacity differential, times (2) the jurisdiction's tax rate for taxes payable in 2017.\n(e) For aids payable in 2019, transition aid under this section for an eligible local unit equals 40 percent of (1) the net tax capacity differential, times (2) the jurisdiction's tax rate for taxes payable in 2018.\n(f) For aids payable in 2020, transition aid under this section for an eligible local unit equals 20 percent of (1) the net tax capacity differential, times (2) the jurisdiction's tax rate for taxes payable in 2019.\n(g) No aids shall be payable under this section in 2021 and thereafter.\n(h) The commissioner of revenue shall compute the amount of transition aid payable to each local unit under this section. On or before August 1 of each year, the commissioner shall certify the amount of transition aid computed for aids payable in the following year for each recipient local unit. The commissioner shall pay transition aid to local units annually at the times provided in section 477A.015.\n(i) The commissioner of revenue may require counties to provide any data that the commissioner deems necessary to administer this section.\nAn amount sufficient to pay transition aid under this section is annually appropriated to the commissioner of revenue from the general fund.",
	"repealed": false
}