{
	"id": "245I.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.11",
	"title": "245I.11 HEALTH SERVICES AND MEDICATIONS.",
	"text": "(a) If a license holder is licensed as a residential program, stores or administers client medications, or observes clients self-administer medications, the license holder must ensure that a staff person who is a registered nurse or licensed prescriber is responsible for overseeing storage and administration of client medications and observing as a client self-administers medications, including training according to section 245I.05, subdivision 6, and documenting the occurrence according to section 245I.08, subdivision 5.\n(b) For purposes of this section, \"observed self-administration\" means the preparation and administration of a medication by a client to themselves under the direct supervision of a registered nurse or a staff member to whom a registered nurse delegates supervision duty. Observed self-administration does not include a client's use of a medication that they keep in their own possession while participating in a program.\nIf a license holder is licensed as a residential program, the license holder must:\n(1) ensure that a client is screened for health issues within 72 hours of the client's admission;\n(2) monitor the physical health needs of each client on an ongoing basis;\n(3) offer referrals to clients and coordinate each client's care with psychiatric and medical services;\n(4) identify circumstances in which a staff person must notify a registered nurse or licensed prescriber of any of a client's health concerns and the process for providing notification of client health concerns; and\n(5) identify the circumstances in which the license holder must obtain medical care for a client and the process for obtaining medical care for a client.\n(a) If a license holder stores client medications, the license holder must:\n(1) store client medications in original containers in a locked location;\n(2) store refrigerated client medications in special trays or containers that are separate from food;\n(3) store client medications marked \"for external use only\" in a compartment that is separate from other client medications;\n(4) store Schedule II drugs listed in section 152.02, subdivision 3, in a compartment that is locked separately from other medications;\n(5) ensure that only authorized staff persons have access to stored client medications;\n(6) follow a documentation procedure to account for all Schedule II to V drugs listed in section 152.02, subdivisions 3 to 6; and\n(7) record each incident when a staff person accepts a supply of client medications and destroy discontinued, outdated, or deteriorated client medications.\n(b) If a license holder is licensed as a residential program, the license holder must allow clients who self-administer medications to keep a private medication supply. The license holder must ensure that the client stores all private medication in a locked container in the client's private living area, unless the private medication supply poses a health and safety risk to any clients. A client must not maintain a private medication supply of a prescription medication without a written medication order from a licensed prescriber and a prescription label that includes the client's name.\n(a) If a license holder stores, prescribes, or administers medications or observes a client self-administer medications, the license holder must:\n(1) ensure that a licensed prescriber writes all orders to accept, administer, or discontinue client medications;\n(2) accept nonwritten orders to administer client medications in emergency circumstances only;\n(3) establish a timeline and process for obtaining a written order with the licensed prescriber's signature when the license holder accepts a nonwritten order to administer client medications; and\n(4) maintain the client's right to privacy and dignity.\n(b) If a license holder employs a licensed prescriber, the license holder must inform the client about potential medication effects and side effects and obtain and document the client's informed consent before the licensed prescriber prescribes a medication.\nIf a license holder is licensed as a residential program, the license holder must:\n(1) assess and document each client's ability to self-administer medication. In the assessment, the license holder must evaluate the client's ability to: (i) comply with prescribed medication regimens; and (ii) store the client's medications safely and in a manner that protects other individuals in the facility. Through the assessment process, the license holder must assist the client in developing the skills necessary to safely self-administer medication;\n(2) monitor the effectiveness of medications, side effects of medications, and adverse reactions to medications for each client. The license holder must address and document any concerns about a client's medications;\n(3) ensure that no staff person or client gives a legend drug supply for one client to another client;\n(4) have policies and procedures for: (i) keeping a record of each client's medication orders; (ii) keeping a record of any incident of deferring a client's medications; (iii) documenting any incident when a client's medication is omitted; and (iv) documenting when a client refuses to take medications as prescribed; and\n(5) document and track medication errors, document whether the license holder notified anyone about the medication error, determine if the license holder must take any follow-up actions, and identify the staff persons who are responsible for taking follow-up actions.\n(a) For a program providing children's day treatment services under section 256B.0943, the license holder must maintain policies and procedures that state whether the program will store medication and administer or allow observed self-administration.\n(b) For a program providing children's day treatment services under section 256B.0943 that does not store medications but allows clients to use a medication that they keep in their own possession while participating in a program, the license holder must maintain documentation from a licensed prescriber regarding the safety of medications held by clients, including:\n(1) an evaluation that the client is capable of holding and administering the medication safely;\n(2) an evaluation of whether the medication is prone to diversion, misuse, or self-injury; and\n(3) any conditions under which the license holder should no longer allow the client to maintain the medication in their own possession.",
	"repealed": false
}