{
	"id": "62J.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.03",
	"title": "62J.03 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given.\n\"Clinically effective\" means that the use of a particular medical technology improves patient clinical status, as measured by medical condition, survival rates, and other variables, and that the use of the particular technology demonstrates a clinical advantage over alternative technologies.\n[Repealed, 1997 c 225 art 2 s 63]\n\"Commissioner\" means the commissioner of health, unless another commissioner is specified.\n\"Cost-effective\" means that the economic costs of using a particular technology to achieve improvement in a patient's health outcome are justified given a comparison to both the economic costs and the improvement in patient health outcome resulting from the use of alternative technologies.\n\"Group purchaser\" means a person or organization that purchases health care services on behalf of an identified group of persons, regardless of whether the cost of coverage or services is paid for by the purchaser or by the persons receiving coverage or services, as further defined in rules adopted by the commissioner. \"Group purchaser\" includes, but is not limited to, community integrated service networks; health insurance companies, health maintenance organizations, nonprofit health service plan corporations, and other health plan companies; employee health plans offered by self-insured employers; trusts established in a collective bargaining agreement under the federal Labor-Management Relations Act of 1947, United States Code, title 29, section 141, et seq.; the Minnesota Comprehensive Health Association; group health coverage offered by fraternal organizations, professional associations, or other organizations; state and federal health care programs; state and local public employee health plans; workers' compensation plans; and the medical component of automobile insurance coverage.\n\"Improvement in health outcome\" means an improvement in patient clinical status, and an improvement in patient quality-of-life status, as measured by ability to function, ability to return to work, and other variables.\n\"Provider\" or \"health care provider\" means a person or organization other than a nursing home that provides health care or medical care services within Minnesota for a fee and is eligible for reimbursement under the medical assistance program under chapter 256B. For purposes of this subdivision, \"for a fee\" includes traditional fee-for-service arrangements, capitation arrangements, and any other arrangement in which a provider receives compensation for providing health care services or has the authority to directly bill a group purchaser, health carrier, or individual for providing health care services. For purposes of this subdivision, \"eligible for reimbursement under the medical assistance program\" means that the provider's services would be reimbursed by the medical assistance program if the services were provided to medical assistance enrollees and the provider sought reimbursement, or that the services would be eligible for reimbursement under medical assistance except that those services are characterized as experimental, cosmetic, or voluntary.\n\"Safety\" means a judgment of the acceptability of risk of using a technology in a specified situation.\n\"Health plan company\" means a health plan company as defined in section 62Q.01, subdivision 4.\n\"Health care entity\" includes clinics, hospitals, ambulatory surgical centers, physician organizations, accountable care organizations, integrated provider and plan systems, county-based purchasing plans, health carriers, health care providers as defined under section 62J.03, subdivision 8, and entities required to report under section 62J.84.",
	"repealed": false
}