{
	"id": "169.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.67",
	"title": "169.67 BRAKES.",
	"text": "Every motor vehicle, other than a motorcycle, when operated upon a highway, shall be equipped with brakes adequate to control the movement of and to stop and hold such vehicle, including two separate means of applying the brakes, each of which means shall be effective to apply the brakes to at least two wheels. If these two separate means of applying the brakes are connected in any way, they shall be so constructed that failure of any one part of the operating mechanism shall not leave the motor vehicle without brakes on at least two wheels.\nEvery motorcycle, and bicycle with motor attached, when operated upon a highway, shall be equipped with at least one brake, which may be operated by hand or foot.\n(a) No trailer or semitrailer with a gross vehicle weight of 3,000 or more pounds, or a gross weight that exceeds the empty weight of the towing vehicle, may be drawn on a highway unless it is equipped with brakes that are adequate to control the movement of and to stop and hold the trailer or semitrailer. A surge brake on a trailer or semitrailer meets the requirement of this paragraph for brakes adequate to stop and hold the trailer or semitrailer.\n(b) No trailer or semitrailer with a gross vehicle weight of more than 3,000 pounds may be drawn on a highway unless it is equipped with brakes that are so constructed that they are adequate to stop and hold the trailer or semitrailer whenever it becomes detached from the towing vehicle.\n(c) Except as provided in paragraph (d), paragraph (a) does not apply to:\n(1) a towed custom service vehicle drawn by a motor vehicle that is equipped with brakes that meet the standards of subdivision 5, provided that such a towed custom service vehicle that exceeds 30,000 pounds gross weight may not be drawn at a speed of more than 45 miles per hour;\n(2) a motor vehicle drawn by another motor vehicle that is equipped with brakes that meet the standards of subdivision 5; and\n(3) a disabled vehicle while being towed to a place of repair.\n(d) Vehicles described in paragraph (c), clause (2), may be operated without complying with paragraph (a) only if the trailer or semitrailer does not exceed the following gross weights:\n(1) 3,000 pounds while being drawn by a vehicle registered as a passenger automobile, other than a pickup truck as defined in section 168.002, subdivision 26;\n(2) 12,000 pounds while being drawn by any other motor vehicle.\n(a) All motor vehicles, trailers, and semitrailers manufactured after June 30, 1988, must be equipped with foot brakes on all wheels.\n(b) Paragraph (a) does not apply to:\n(1) a mobile crane that is not operated at a speed of more than 45 miles per hour and is capable of stopping within the performance standards of subdivision 5;\n(2) a motorcycle;\n(3) a trailer or semitrailer with a gross weight of less than 3,000 pounds;\n(4) a swivel-type third wheel on a travel trailer; and\n(5) a temporary auxiliary axle attached to a motor vehicle during a period of vehicle weight restrictions for the purpose of relieving the weight on another axle, if the combined gross weight on the temporary axle and the axle being relieved does not exceed 18,000 pounds and the motor vehicle meets all brake requirements under this section.\n(c) Paragraph (a) does not require brakes on the front wheels of a vehicle having three or more axles and manufactured before July 1, 1988, if the brakes on the other wheels of the vehicle meet the standards of subdivision 5.\nEvery motor vehicle or combination of vehicles, at all times and under all conditions of loading, upon application of the service (foot) brake, shall be capable of (1) developing a braking force that is not less than the percentage of its gross weight tabulated herein for its classification, (2) decelerating in a stop from not more than 20 miles per hour at not less than the feet per second per second tabulated herein for its classification, and (3) stopping from a speed of 20 miles per hour in not more than the distance tabulated herein for its classification, such distance to be measured from the point at which movement of the service brake pedal or control begins. Tests for deceleration and stopping distance shall be made on a substantially level (not to exceed plus or minus one percent grade), dry, smooth, hard surface that is free from loose material.\nAll brakes shall be maintained in good working order and shall be so adjusted as to operate as equally as practicable with respect to the wheels on opposite sides of the vehicle.\n[Repealed, 2009 c 64 s 57]",
	"repealed": false
}