{
	"id": "82.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.641",
	"title": "82.641 REAL ESTATE CLOSING AGENT LICENSING.",
	"text": "Except as otherwise provided in subdivision 6, a person shall not act as a real estate closing agent unless licensed as provided in this section. The commissioner shall issue a license as a closing agent to a person who qualifies for the license under the terms of this chapter.\nAn applicant for a real estate closing agent license must be at least 18 years of age at the time of making application for the license.\n(a) An applicant for a real estate closing agent license shall make an application in the format prescribed by the commissioner. The application must be accompanied by the license fee required by this chapter.\n(b) An application for a real estate closing agent license must contain the information required by the commissioner consistent with this chapter.\n(c) An application for a real estate closing agent license shall give the applicant's legal name, age, residence address, and the name and place of business of the closing agent.\n(d) The commissioner may require further information the commissioner considers appropriate to administer this chapter.\nAn applicant for a real estate closing agent's license must successfully complete a course of study relating to closing services consisting of eight hours of instruction approved by the commissioner.\nThe commissioner must be notified in the format prescribed by the commissioner of a change of information contained in the license application on file with the commissioner within ten days of the change.\nThe following persons, when acting as closing agents, are exempt from the requirements of this section and sections 82.75 and 82.81 unless otherwise required in this chapter:\n(1) a direct employee of a title insurer authorized to do business in this state, or a direct employee of a title insurance agent, or a person who has an agency agreement with a title insurer or a title insurance agent in which the agent agrees to perform closing services on the title insurer's or title insurance agent's behalf and the title insurer or title insurance agent assumes responsibility for the actions of the agent as if the agent were a direct employee of the title insurer or title insurance agent;\n(2) a licensed attorney or a direct employee of a licensed attorney;\n(3) a licensed real estate broker or salesperson;\n(4) a direct employee of a licensed real estate broker if the broker maintains all funds received in connection with the closing services in the broker's trust account;\n(5) a bank, trust company, savings association, credit union, industrial loan and thrift company, regulated lender under chapter 56, public utility, or land mortgage or farm loan association organized under the laws of this state or the United States, when engaged in the transaction of businesses within the scope of its corporate powers as provided by law;\n(6) a title insurer authorized to do business in this state; and\n(7) a title insurance agent that has a contractual agency relationship with a title insurer authorized to do business in this state, where the title insurer assumes responsibility for the actions of the title insurance agent and its employees or agents as if they were employees or agents of the title insurer.",
	"repealed": false
}