{
	"id": "241.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.251",
	"title": "241.251 PRESS AND MEDIA ACCESS FOR INMATES.",
	"text": "Any inmate of a state correctional facility shall be permitted to speak in person or by phone at the inmate's own expense to any representative of the public news media, as defined in subdivision 4, on a daily basis between the hours of 8:00 a.m. and 9:00 p.m. except in emergency situations as defined in subdivision 5; provided that it does not interfere with the inmate's regularly assigned duties. The right to speak in person with a representative of the news media shall not constitute a regular facility visit.\nCorrectional authorities may limit the exercise of privileges conferred by this section by any individual inmate to one telephone call or interview per week.\nAny inmate or group of inmates of a state correctional facility shall be permitted to correspond by mail with any public news media or representatives thereof, as defined in subdivision 4, on a regular basis.\nSubject to the provisions of section 243.55 and the duty of the chief executive officer to take reasonable precautions to prevent the introduction of contraband into a correctional facility, representatives of the public news media shall, upon their own request, be permitted to interview any consenting inmate or representatives of a consenting group of inmates of the state at the times and under the circumstances described in subdivision 1. Any representative of the public news media who is denied access to a correctional facility must be given the reasons therefor in writing, and the representative may appeal such denial to the commissioner of corrections.\nA \"representative of the public news media\" means a person employed by and authorized to represent any television station licensed by the Federal Communications Commission, any radio station licensed by the Federal Communications Commission, national wire service, or any newspaper or periodical having a monthly statewide circulation of at least 1,000 copies.\nAn emergency shall be defined as a situation in which, in the best judgment of the correctional authorities, there is an imminent threat to life, security or property.",
	"repealed": false
}