{
	"id": "253B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.02",
	"title": "253B.02 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Case manager\" has the definition given in section 245.462, subdivision 4, for persons with mental illness.\n\"Chemically dependent person\" means any person (a) determined as being incapable of self-management or management of personal affairs by reason of the habitual and excessive use of alcohol, drugs, or other mind-altering substances; and (b) whose recent conduct as a result of habitual and excessive use of alcohol, drugs, or other mind-altering substances poses a substantial likelihood of physical harm to self or others as demonstrated by (i) a recent attempt or threat to physically harm self or others, (ii) evidence of recent serious physical problems, or (iii) a failure to obtain necessary food, clothing, shelter, or medical care. \"Chemically dependent person\" also means a pregnant woman who has engaged during the pregnancy in habitual or excessive use, for a nonmedical purpose, of any of the following substances or their derivatives: opium, cocaine, heroin, phencyclidine, methamphetamine, amphetamine, tetrahydrocannabinol, or alcohol.\n\"Commissioner\" means the commissioner of human services or the commissioner's designee.\n\"Committing court\" means the district court where a petition for commitment was decided. In a case where commitment proceedings are commenced following an acquittal of a crime or offense under section 611.026, \"committing court\" means the district court in which the acquittal took place.\nMS 2018 [Renumbered subd 4e]\n\"Community-based treatment program\" means non-state-operated treatment and services provided at the community level, including but not limited to community support services programs defined in section 245.462, subdivision 6; day treatment services defined in section 245.462, subdivision 8; outpatient services defined in section 245.462, subdivision 21; mental health crisis services under section 245.462, subdivision 14c; outpatient services defined in section 245.462, subdivision 21; assertive community treatment services under section 256B.0622; adult rehabilitation mental health services under section 256B.0623; home and community-based waivers; supportive housing; and residential treatment services as defined in section 245.462, subdivision 23.\n(a) \"County of financial responsibility\" has the meaning specified in chapter 256G. This definition does not require that the person qualifies for or receives any other form of financial, medical, or social service assistance in addition to the services under this chapter. Disputes about the county of financial responsibility shall be submitted for determination to the executive board through the commissioner of human services in the manner prescribed in section 256G.09.\n(b) For purposes of proper venue for filing a petition pursuant to section 253B.064, subdivision 1, paragraph (a); 253B.07, subdivision 1, paragraph (a); or 253D.07, where the designated agency of a county has determined that it is the county of financial responsibility, then that county is the county of financial responsibility until a different determination is made by the appropriate county agencies or the commissioner pursuant to chapter 256G.\n\"Court examiner\" means a person appointed to serve the court, and who is a physician or psychologist who has a doctoral degree in psychology, and is either licensed in Minnesota or who holds current authority to practice in Minnesota under an approved interstate compact.\n\"Crime against the person\" means a violation of or attempt to violate any of the following provisions: sections 609.185 (murder in the first degree); 609.19 (murder in the second degree); 609.195 (murder in the third degree); 609.20 (manslaughter in the first degree); 609.205 (manslaughter in the second degree); 609.2112, 609.2113, or 609.2114 (criminal vehicular homicide or injury); 609.215 (suicide); 609.221 (assault in the first degree); 609.222 (assault in the second degree); 609.223 (assault in the third degree); 609.224 (assault in the fifth degree); 609.2242 (domestic assault); 609.23 (mistreatment of persons confined); 609.231 (mistreatment of residents or patients); 609.2325 (criminal abuse); 609.233 (criminal neglect); 609.2335 (financial exploitation of a vulnerable adult); 609.235 (use of drugs to injure or facilitate crime); 609.24 (simple robbery); 609.245 (aggravated robbery); 609.247 (carjacking); 609.25 (kidnapping); 609.255 (false imprisonment); 609.265 (abduction); 609.27, subdivision 1, clause (1) or (2) (coercion); 609.28 (interfering with religious observance) if violence or threats of violence were used; 609.322, subdivision 1, paragraph (a), clause (2) (solicitation); 609.342 (criminal sexual conduct in the first degree); 609.343 (criminal sexual conduct in the second degree); 609.344 (criminal sexual conduct in the third degree); 609.345 (criminal sexual conduct in the fourth degree); 609.3458 (sexual extortion); 609.365 (incest); 609.498, subdivision 1 (tampering with a witness); 609.50, clause (1) (obstructing legal process, arrest, and firefighting); 609.561 (arson in the first degree); 609.562 (arson in the second degree); 609.595 (damage to property); and 609.72, subdivision 3 (disorderly conduct by a caregiver); and Minnesota Statutes 2012, section 609.21.\n\"Designated agency\" means an agency selected by the county board to provide the social services required under this chapter.\nMS 2018 [Repealed, 1Sp2020 c 2 art 6 s 124]\n\"Examiner\" means a person who is knowledgeable, trained, and practicing in the diagnosis and assessment or in the treatment of the alleged impairment, and who is a licensed physician; a mental health professional qualified under section 245I.04, subdivision 2; a licensed physician assistant; or an advanced practice registered nurse (APRN) as defined in section 148.171, subdivision 3, who is practicing in the emergency room of a hospital, so long as the hospital has a process for credentialing and recredentialing any APRN acting as an examiner in an emergency room.\nMS 2012 [Renumbered 253D.02, subd 8]\n\"Executive board\" has the meaning given in section 246C.015.\n\"Head of the facility or program\" means the person who is charged with overall responsibility for the professional program of care and treatment of the treatment facility, state-operated treatment program, or community-based treatment program.\n\"Health officer\" means:\n(1) a licensed physician;\n(2) a mental health professional qualified under section 245I.04, subdivision 2;\n(3) a licensed social worker;\n(4) a registered nurse working in an emergency room of a hospital;\n(5) an advanced practice registered nurse (APRN) as defined in section 148.171, subdivision 3;\n(6) a physician assistant as defined in section 147A.01, subdivision 18;\n(7) a mental health practitioner as defined in section 245.462, subdivision 17, providing mental health mobile crisis intervention services as described under section 256B.0624 with the consultation and approval by a mental health professional; or\n(8) a formally designated member of a prepetition screening unit established by section 253B.07.\n\"Interested person\" means:\n(1) an adult who has a specific interest in the patient or proposed patient, including but not limited to a public official, including a local welfare agency acting under section 260E.31; a health care or mental health provider or the provider's employee or agent; the legal guardian, spouse, parent, legal counsel, adult child, or next of kin; or other person designated by a patient or proposed patient; or\n(2) a health plan company that is providing coverage for a proposed patient.\n\"Licensed physician\" means a person licensed in Minnesota to practice medicine or a medical officer of the government of the United States in performance of official duties.\n\"Licensed psychologist\" means a person licensed by the Board of Psychology and possessing the qualifications for licensure provided in section 148.907.\nMS 2018 [Renumbered subd 10a]\nMS 2018 [Repealed, 1Sp2020 c 2 art 6 s 124]\n\"Pass\" means any authorized temporary, unsupervised absence from a state-operated treatment program.\nMS 2018 [Renumbered subd 17a]\n\"Pass plan\" means the part of a treatment plan for a patient who has been committed as a person who has a mental illness and is dangerous to the public that specifies the terms and conditions under which the patient may be released on a pass.\nMS 2018 [Renumbered subd 17b]\n\"Pass-eligible status\" means the status under which a patient committed as a person who has a mental illness and is dangerous to the public may be released on passes after approval of a pass plan by the head of a state-operated treatment program.\n\"Patient\" means any person who is receiving treatment or committed under this chapter.\n\"Peace officer\" means a sheriff or deputy sheriff, or municipal or other local police officer, or a State Patrol officer when engaged in the authorized duties of office.\nA \"person who has a mental illness and is dangerous to the public\" is a person:\n(1) who has an organic disorder of the brain or a substantial psychiatric disorder of thought, mood, perception, orientation, or memory that grossly impairs judgment, behavior, capacity to recognize reality, or to reason or understand, and is manifested by instances of grossly disturbed behavior or faulty perceptions; and\n(2) who as a result of that impairment presents a clear danger to the safety of others as demonstrated by the facts that (i) the person has engaged in an overt act causing or attempting to cause serious physical harm to another and (ii) there is a substantial likelihood that the person will engage in acts capable of inflicting serious physical harm on another.\n(a) A \"person who poses a risk of harm due to a mental illness\" means any person who has an organic disorder of the brain or a substantial psychiatric disorder of thought, mood, perception, orientation, or memory that grossly impairs judgment, behavior, capacity to recognize reality, or to reason or understand, that is manifested by instances of grossly disturbed behavior or faulty perceptions and who, due to this impairment, poses a substantial likelihood of physical harm to self or others as demonstrated by:\n(1) a failure to obtain necessary food, clothing, shelter, or medical care as a result of the impairment;\n(2) an inability for reasons other than indigence to obtain necessary food, clothing, shelter, or medical care as a result of the impairment and it is more probable than not that the person will suffer substantial harm, significant psychiatric deterioration or debilitation, or serious illness, unless appropriate treatment and services are provided;\n(3) a recent attempt or threat to physically harm self or others; or\n(4) recent and volitional conduct involving significant damage to substantial property.\n(b) A person does not pose a risk of harm due to mental illness under this section if the person's impairment is solely due to:\n(1) epilepsy;\n(2) developmental disability;\n(3) brief periods of intoxication caused by alcohol, drugs, or other mind-altering substances; or\n(4) dependence upon or addiction to any alcohol, drugs, or other mind-altering substances.\n\"Person with a developmental disability\" means any person:\n(1) who has been diagnosed as having significantly subaverage intellectual functioning existing concurrently with demonstrated deficits in adaptive behavior and who manifests these conditions prior to the person's 22nd birthday; and\n(2) whose recent conduct is a result of a developmental disability and poses a substantial likelihood of physical harm to self or others in that there has been (i) a recent attempt or threat to physically harm self or others, or (ii) a failure and inability to obtain necessary food, clothing, shelter, safety, or medical care.\nMS 2018 [Renumbered subd 18d]\n\"Secure treatment facility\" means the Minnesota Security Hospital but does not include services or programs administered by the Minnesota Security Hospital outside a secure environment.\nMS 2012 [Renumbered 253D.02, subd 15]\nMS 2012 [Renumbered 253D.02, subd 16]\n\"State-operated treatment program\" means any state-operated program including community behavioral health hospitals, crisis centers, residential facilities, outpatient services, and other community-based services developed and operated by the state and under the executive board's control for a person who has a mental illness, developmental disability, or chemical dependency.\n\"Treatment facility\" means a non-state-operated hospital, residential treatment provider, crisis residential withdrawal management center, or corporate foster care home qualified to provide care and treatment for persons who have a mental illness, developmental disability, or chemical dependency.\n\"Verdict\" means a jury verdict or a general finding by the trial court sitting without a jury pursuant to the Rules of Criminal Procedure.\nMS 2018 [Renumbered subd 12b]\nMS 2018 [Renumbered subd 13a]\nMS 2018 [Renumbered subd 14a]\nMS 2012 [Renumbered 253D.02, subd 2]\nMS 2012 [Renumbered 253D.02, subd 12]\nMS 2012 [Renumbered 253D.02, subd 14]",
	"repealed": false
}