{
	"id": "515A.2-110",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-110",
	"title": "515A.2-110 CONDOMINIUM PLATS.",
	"text": "(a) Condominium plats are a part of the declaration. The condominium plat shall contain a certification by a registered professional land surveyor or registered professional architect, as to the parts of the plat prepared by each, that the condominium plat accurately depicts all information required by this section. The portions of the condominium plat depicting the dimensions of the portions of the condominium described in paragraphs (b)(3), (8), (9), (10), and (11), may be prepared by either a land surveyor or an architect. The other portions of the plat must be prepared only by a land surveyor. All measurements must be undertaken in accordance with good professional practice. The certification must indicate that the work was undertaken by or under the supervision of the certifying architect or land surveyor. Certification by the architect or land surveyor does not constitute a guaranty or warranty of the nature, suitability, or quality of construction of the condominium.\n(b) Each condominium plat shall show:\n(1) the number of the condominium and the boundaries and dimensions of the land included in the condominium;\n(2) the dimensions and location of all existing structural improvements and roadways;\n(3) the intended location and dimensions of any contemplated common element improvements to be constructed within the condominium labeled either \"MUST BE BUILT\" or \"NEED NOT BE BUILT\";\n(4) the location and dimensions of any additional real estate, labeled as such;\n(5) the extent of any encroachments by or upon any portion of the condominium;\n(6) the location and dimensions of all recorded easements within the condominium serving or burdening any portion of the condominium;\n(7) the distance between noncontiguous parcels of real estate;\n(8) the location and dimensions of limited common elements, including porches, balconies and patios, other than limited common elements described in section 515A.2-102(2) and (4);\n(9) the location and dimensions of the vertical boundaries of each unit and that unit's identifying number;\n(10) the location and dimensions of the horizontal unit boundaries with reference to established or assumed datum and that unit's identifying number;\n(11) any units which may be converted by the declarant to create additional units or common elements (section 515A.2-115) identified separately.\n(c) When adding additional real estate (section 515A.2-111), the declarant shall record supplemental condominium plats for that real estate conforming to the requirements of subsection (b). If less than all additional real estate is being added, the supplemental condominium plats shall also show the location and dimensions of the remaining portion.\n(d) If a declarant subdivides or converts any unit into two or more units, common elements or limited common elements (section 515A.2-115), the declarant shall record an amendment to the condominium plat showing the location and dimensions of any new units, common elements and limited common elements thus created.",
	"repealed": false
}