{
	"id": "342.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.15",
	"title": "342.15 ADULT-USE CANNABIS BUSINESS; CRIMINAL HISTORY CHECK AND DISQUALIFICATIONS.",
	"text": "(a) Upon request by the office, every license applicant, license holder, or, in the case of a business entity, every individual responsible for conducting the affairs of the entity, including but not limited to every owner and every cooperative member or director, manager, and general partner of the business entity, for a cannabis business license, must submit a completed criminal history records check consent form, a full set of classifiable fingerprints, and the required fees to the office. Upon receipt of this information, the office must submit the completed criminal history records check consent form, full set of classifiable fingerprints, and required fees to the Bureau of Criminal Apprehension.\n(b) After receiving this information, the bureau must conduct a state criminal history records check of an individual identified in paragraph (a). The bureau may exchange an individual's fingerprints with the Federal Bureau of Investigation to obtain the national criminal history record information of the individual. The bureau must return the results of the state and federal criminal history records checks to the office to determine if the individual is disqualified under rules adopted pursuant to this section.\n(c) The office may, by rule, establish exceptions to the requirement under paragraphs (a) and (b) for members of a cooperative who hold less than a five percent ownership interest in the cooperative.\nA cannabis business background check account is established as a separate account in the special revenue fund. All fees received by the office under subdivision 1 must be deposited in the account and are appropriated to the office to pay for the criminal records checks conducted by the Bureau of Criminal Apprehension and Federal Bureau of Investigation.\n(a) The office may by rule determine whether any felony convictions, including but not limited to convictions for noncannabis controlled substance crimes in the first or second degree, human trafficking, labor trafficking, fraud, or financial crimes, disqualify an individual from holding or receiving a cannabis business license issued under this chapter or working for a cannabis business, and the length of any such disqualification. In adopting rules pursuant to this subdivision, the office shall not disqualify an individual for a violation of section 152.025.\n(b) The office must not issue a cannabis business license to any person or business who was convicted of illegally selling cannabis after August 1, 2023, unless five years have passed since the date of conviction.\n(c) The office must not issue a cannabis business license to any person or business who violated this chapter after August 1, 2023, unless five years have passed since the date of violation. The office may set aside the violation if the office finds that the violation occurred as a result of a mistake made in good faith and the violation did not involve gross negligence, an illegal sale of cannabis, or cause harm to the public. The office must not issue a license to any person or business who the office has assessed a fine to under section 342.09, subdivision 6.\nThe office may set aside a disqualification under subdivision 2 if the office finds that the person has submitted sufficient information to demonstrate that the person does not pose a risk of harm to any person served by the applicant, license holder, or other entities as provided in this chapter.\nThe background check requirements and disqualifications under this section do not apply to an applicant for a hemp business license or to hemp workers.\nThe office may determine whether any civil or regulatory violations, as determined by another state agency, local unit of government, or any other jurisdiction, disqualify an individual from holding or receiving a cannabis business license issued under this chapter or disqualify an individual from working for a cannabis business, and the length of the disqualification. Upon the office's request, a state agency, as defined in section 13.02, subdivision 17, except for the Department of Revenue, may release civil investigative data, including data classified as protected nonpublic or confidential under section 13.39, subdivision 2, if the request is related to a specific applicant and the data is necessary to make a determination under this section.",
	"repealed": false
}