{
	"id": "204B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.40",
	"title": "204B.40 BALLOTS; ELECTION RECORDS AND OTHER MATERIALS; DISPOSITION; INSPECTION OF BALLOTS.",
	"text": "The county auditors, municipal clerks, and school district clerks shall retain all election materials returned to them after any election for at least 22 months from the date of that election. All records and materials must be stored in a locked container or other secured and locked space. All election materials involved in a contested election must be retained for 22 months or until the contest has been finally determined, whichever is later. Abstracts filed by canvassing boards shall be retained permanently by any officer with whom those abstracts are filed. Election materials no longer required to be retained pursuant to this section shall be disposed of in accordance with sections 138.163 to 138.21. Sealed envelopes containing voted ballots must be retained unopened, except as provided in this section, in a secure location. The county auditor, municipal clerk, or school district clerk shall not permit any voted ballots to be tampered with or defaced.\nAfter the time for filing a notice of contest for an election has passed, the secretary of state may, for the purpose of monitoring and evaluating election procedures: (1) open the sealed ballot envelopes and inspect the ballots for that election maintained by the county auditors, municipal clerks, or school district clerks; (2) inspect the polling place rosters and completed voter registration applications; or (3) examine other forms required in the Minnesota election laws for use in the polling place. No inspected ballot or document may be marked or identified in any manner. After inspection, all ballots must be returned to the ballot envelope and the ballot envelope must be securely resealed. Any other election materials inspected or examined must be secured or resealed. No polling place roster may be inspected until the voting history for that precinct has been posted. No voter registration application may be inspected until the information on it has been entered into the statewide registration system.",
	"repealed": false
}