{
	"id": "16A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.11",
	"title": "16A.11 BUDGET TO LEGISLATURE.",
	"text": "The governor shall submit a three-part budget to the legislature. Parts one and two, the budget message and detailed operating budget, must be submitted by the fourth Tuesday in January in each odd-numbered year. However, in a year following the election of a governor who had not been governor the previous year, parts one and two must be submitted by the third Tuesday in February. Part three, the detailed recommendations as to capital expenditure, must be submitted as follows: agency capital budget requests by July 15 of each odd-numbered year, and governor's recommendations by January 15 of each even-numbered year. Detailed recommendations as to information technology expenditure must be submitted as part of the detailed operating budget. Information technology recommendations must include projects to be funded during the next biennium and planning estimates for an additional two bienniums. Information technology recommendations must specify purposes of the funding such as infrastructure, hardware, software, or training.\nPart one of the budget, the governor's message, shall include the governor's recommendations on the financial policy of the state for the coming biennium, describing the important features of the budget plan, embracing a general budget summary setting forth the aggregate figures of the budget so as to show the balanced relation between the total proposed expenditures and the total anticipated income, with the basis and factors on which the estimates are made, the amount to be borrowed, and other means of financing the budget for the coming biennium, compared with the corresponding figures for at least the last two completed fiscal years and the current year. The budget plan shall be supported by explanatory schedules or statements, classifying its expenditures by agencies and funds, and the income by agencies, sources, funds, and the proposed amount of new borrowing, as well as proposed new tax or revenue sources. The budget plan shall be submitted for all special and dedicated funds, as well as the general fund, and shall include the estimated amounts of federal aids, for whatever purpose provided, together with estimated expenditures from them.\n(a) Part two of the budget, the detailed budget estimates both of expenditures and revenues, must contain any statements on the financial plan which the governor believes desirable or which may be required by the legislature. The detailed estimates shall include the governor's budget arranged in tabular form.\n(b) Tables listing expenditures for the next biennium must show the appropriation base for each year. The appropriation base is the amount appropriated for the second year of the current biennium. The tables must separately show any adjustments to the base required by current law or policies of the commissioner of management and budget. For forecasted programs, the tables must also show the amount of the forecast adjustments, based on the most recent forecast prepared by the commissioner of management and budget under section 16A.103. For all programs, the tables must show the amount of appropriation changes recommended by the governor, after adjustments to the base and forecast adjustments, and the total recommendation of the governor for that year.\n(c) The detailed estimates must include a separate line listing the total cost of professional and technical service contracts for the prior biennium and the projected costs of those contracts for the current and upcoming biennium. They must also include a summary of the personnel employed by the agency, reflected as full-time equivalent positions.\n(d) The detailed estimates for internal service funds must include the number of full-time equivalents by program; detail on any loans from the general fund, including dollar amounts by program; proposed investments in technology or equipment of $100,000 or more; an explanation of any operating losses or increases in retained earnings; and a history of the rates that have been charged, with an explanation of any rate changes and the impact of the rate changes on affected agencies.\nThe detailed capital budget must include recommendations for capital projects to be funded during the next six fiscal years and, if applicable, must meet the requirements under section 473.4485, subdivision 1a. It must be submitted with projects recommended by the governor and in order of importance among that agency's requests as determined by the agency originating the request.\n[Repealed, 1998 c 366 s 90]\n[Repealed, 1998 c 366 s 90]\n(a) For purposes of this subdivision, \"commissioner\" means any commissioner of a state agency that proposes to spend funds out of the highway user tax distribution fund or the trunk highway fund.\n(b) A commissioner must include detailed information about proposed appropriations from the highway user tax distribution fund or the trunk highway fund. At a minimum, the commissioner must include a detailed narrative describing the specific purposes for which the funds will be spent and an estimated appropriation for each purpose.\nThe commissioner shall, on request, give the governor or the legislature information on the budget and attend legislative budget hearings.\nThe commissioner shall prepare a facilities note on each capital project, estimating program cost impacts and efficiencies stemming from the approval of that project.\nThe detailed operating budget and capital budget must include amounts necessary to maintain and better state buildings. The commissioner of management and budget, in consultation with the commissioner of administration, the Board of Trustees of the Minnesota State Colleges and Universities, and the regents of the University of Minnesota, shall establish budget guidelines for building maintenance and betterment appropriations. Unless otherwise provided by the commissioner of management and budget, the combined amount to be budgeted each year for building maintenance and betterment in the operating budget and capital budget is one percent of the replacement cost of the building, adjusted up or down depending on the age and condition of the building.\nThe detailed operating budget for each executive branch agency must include proposals for any new fees or any increases in existing fees. For purposes of this section, \"fees\" has the meaning given in section 16A.1283, but excludes charges listed in paragraph (b) of that section.",
	"repealed": false
}