{
	"id": "447.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.31",
	"title": "447.31 CREATION AND REORGANIZATION OF HOSPITAL DISTRICTS.",
	"text": "Any two or more cities and towns, however organized, except cities of the first class, may create a hospital district. They must do so by resolutions adopted by their respective governing bodies or electors. A hospital district may be reorganized according to sections 447.31 to 447.37. Reorganization must be by resolutions adopted by the district's hospital board and the governing body or voters of each city and town in the district.\nNo city or town shall be included in a hospital district created or reorganized under this section unless its entire territory is included in the district and the territory is contiguous at one or more points to the territory of one or more of the other cities or towns included.\nA resolution under subdivision 1 must state that a hospital district is authorized to be created under sections 447.31 to 447.37, or that an existing hospital district is authorized to be reorganized under sections 447.31 to 447.37, in order to acquire, improve, and run hospital and nursing home facilities that the hospital board decides are necessary and expedient in accordance with sections 447.31 to 447.37. The resolution must name the two or more cities or towns included in the district. The resolution must be adopted by a two-thirds majority of the members-elect of the governing body or board acting on it, or by the voters of the city or town as provided in this section.\nEach resolution adopted by the governing body of a city or town must be published in its official newspaper and takes effect 40 days after publication, unless a petition for referendum on the resolution is filed with the governing body within 40 days. A petition for referendum must be signed by at least five percent of the number of voters voting at the last election of officers. If a petition is filed, the resolution does not take effect until approved by a majority of voters voting on it at a regular municipal election or a special election which the governing body may call for that purpose.\nThe resolution may also be initiated by petition filed with the governing body of the city or town, signed by at least ten percent of the number of voters voting at the last general election. A petition must present the text of the proposed resolution and request an election on it. If the petition is filed, the governing body shall call a special election for the purpose, to be held within 30 days after the filing of the petition, or may submit the resolution to a vote at a regular municipal election that is to be held within the 30-day period. The resolution takes effect if approved by a majority of voters voting on it at the election. Only one election shall be held within any given 12-month period upon resolutions initiated by petition. The notice of the election and the ballot used must contain the text of the resolution, followed by the question: \"Shall the above resolution be approved?\"\nThe hospital district is created or reorganized on the effective date of the last resolution required to authorize it. However, certified copies of each resolution must be sent by the clerk or other recording officer of the governing body or board adopting it to the county auditor of each county containing territory in the hospital district. On receiving the required resolutions, each county auditor shall record certified copies of them as a public record with the county recorder of the auditor's county. The county auditor of the county containing most of the population of the district shall send a certified copy of each resolution to the secretary of state to be filed as a public record.\nAs soon as may be after the reorganization or creation of a hospital district, a special election for a new board must be called. The hospital board or, in the case of a new district, the governing body of the most populous city or town in the district, shall call the election. The election must be noticed, held, and canvassed like other hospital district elections. The members of the board qualify immediately on election and assume the powers and duties in this section.\nA hospital district created or reorganized under sections 447.31 to 447.37 is a municipal corporation and political subdivision of the state and has perpetual succession. It may contract and be contracted with and sue and be sued. It may use a corporate seal. It may acquire real and personal property as needed. It may hold, manage, control, sell, convey, or otherwise dispose of the property as its interests require.\nUpon reorganization of a district, real and personal assets of the preexisting district pass to the new reorganized district. \"Assets\" includes all property in which the county has held legal title for the use and benefit of the preexisting district. All legally valid and enforceable claims and contract obligations of the preexisting district must be assumed by the new reorganized district. Taxable property in the district is taxable to pay any bonded debt incurred by or on behalf of the preexisting district. Real, personal, or mixed properties that are acquired, owned, leased, controlled, used, or occupied by a district for the purposes of sections 447.31 to 447.37 are exempt from taxation by the state or its political subdivisions.",
	"repealed": false
}