{
	"id": "144E.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.19",
	"title": "144E.19 DISCIPLINARY ACTION.",
	"text": "The director may suspend, revoke, refuse to renew, or place conditions on the license of a licensee upon finding that the licensee has violated a provision of this chapter or rules adopted under this chapter or has ceased to provide the service for which the licensee is licensed.\n(a) Before taking action under subdivision 1, the director shall give notice to a licensee of the right to a contested case hearing under chapter 14. If a licensee requests a contested case hearing within 30 days after receiving notice, the director shall initiate a contested case hearing according to chapter 14.\n(b) The administrative law judge shall issue a report and recommendation within 30 days after closing the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.\n(a) In addition to any other remedy provided by law, the director may temporarily suspend the license of a licensee after conducting a preliminary inquiry to determine whether the director believes that the licensee has violated a statute or rule that the director is empowered to enforce and determining that the continued provision of service by the licensee would create an imminent risk to public health or harm to others.\n(b) A temporary suspension order prohibiting a licensee from providing ambulance service shall give notice of the right to a preliminary hearing according to paragraph (d) and shall state the reasons for the entry of the temporary suspension order.\n(c) Service of a temporary suspension order is effective when the order is served on the licensee personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address provided to the director for the licensee.\n(d) At the time the director issues a temporary suspension order, the director shall schedule a hearing that shall begin within 60 days after issuance of the temporary suspension order or within 15 working days of the date of the director's receipt of a request for a hearing from a licensee, whichever is sooner. The hearing shall be on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. A hearing under this paragraph is not subject to chapter 14.\n(e) Evidence presented by the director or licensee may be in the form of an affidavit. The licensee or the licensee's designee may appear for oral argument.\n(f) Within five working days of the hearing, the director shall issue its order and, if the suspension is continued, notify the licensee of the right to a contested case hearing under chapter 14.\n(g) If a licensee requests a contested case hearing within 30 days after receiving notice under paragraph (f), the director shall initiate a contested case hearing according to chapter 14. The administrative law judge shall issue a report and recommendation within 30 days after the closing of the contested case hearing record. The director shall issue a final order within 30 days after receipt of the administrative law judge's report.",
	"repealed": false
}