{
	"id": "268.0865",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.0865",
	"title": "268.0865 CONTINUED REQUEST FOR UNEMPLOYMENT BENEFITS.",
	"text": "A continued request for unemployment benefits is a certification by an applicant, done on a weekly basis, that the applicant is unemployed and meets the ongoing eligibility requirements for unemployment benefits under section 268.085. A continued request must include information on possible issues of ineligibility in accordance with section 268.101, subdivision 1, paragraph (c).\n(a) The commissioner must designate to each applicant one of the following methods for filing a continued request:\n(1) by electronic transmission under subdivision 3; or\n(2) by mail under subdivision 4.\n(b) The method designated by the commissioner is the only method allowed for filing a continued request by that applicant. An applicant may ask that the other allowed method be designated and the commissioner must consider inconvenience to the applicant as well as administrative capacity in determining whether to allow an applicant to change the designated method for filing a continued request for unemployment benefits.\n(a) A continued request for unemployment benefits by electronic transmission must be filed to that electronic mail address, telephone number, or Internet address prescribed by the commissioner for that applicant. In order to constitute a continued request, all information asked for, including information authenticating that the applicant is sending the transmission, must be provided in the format required. If all of the information asked for is not provided, the communication does not constitute a continued request for unemployment benefits.\n(b) The continued request by electronic transmission must be filed within four calendar weeks following the week for which payment is requested on the day of the week and during the time of day designated for the applicant.\n(c) If the continued request by electronic transmission is not filed within four calendar weeks following the week for which payment is requested, the electronic continued request will not be accepted and the applicant is ineligible for unemployment benefits for the period covered by the continued request, unless the applicant shows good cause for failing to file the continued request by electronic transmission within the time period required.\n(a) A continued request for unemployment benefits by mail must be on a form prescribed by the commissioner. The form, in order to constitute a continued request, must be totally completed and signed by the applicant. The form must be filed by mail, in an envelope with postage prepaid, and sent to the address designated within four calendar weeks following the week for which payment is requested.\n(b) If the continued request form is not filed within four calendar weeks following the week for which payment is requested, the form will not be accepted and the applicant is ineligible for unemployment benefits unless the applicant shows good cause for failing to file the form by mail within the time period required.\n(c) If the applicant has been designated to file a continued request for unemployment benefits by mail, an applicant may submit the form by facsimile transmission within four calendar weeks following the week for which payment is requested. A form submitted by facsimile transmission must be sent only to the telephone number assigned for that purpose.\n(d) An applicant who has been designated to file a continued request by mail may personally deliver a continued request form only to the location to which the form was otherwise designated to be mailed.\n(a) \"Good cause\" for purposes of this section is a reason that would have prevented a reasonable person acting with due diligence from filing a continued request for unemployment benefits within the time periods required.\n(b) \"Good cause\" does not include forgetfulness, loss of the continued request form if filing by mail, having returned to work, having an appeal pending, or inability to file a continued request for unemployment benefits by the method designated if the applicant was aware of the inability and did not make diligent effort to have the method of filing a continued request changed by the commissioner. \"Good cause\" does not include having previously made an attempt to file a continued request for unemployment benefits but where the communication was not considered a continued request because the applicant failed to submit all required information.",
	"repealed": false
}