{
	"id": "342.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.151",
	"title": "342.151 EMPLOYEES OF LICENSE HOLDERS.",
	"text": "For purposes of this section, a \"license holder\" includes a cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis retailer, cannabis wholesaler, cannabis transporter, cannabis testing facility, cannabis event organizer, cannabis delivery service, lower-potency hemp edible manufacturer, lower-potency hemp edible retailer, or medical cannabis combination business.\nA license holder may employ or contract with as many unlicensed individuals as may be necessary, provided that the license holder is at all times accountable for the good conduct of every individual employed by or contracted with the license holder. Before hiring an individual as a cannabis worker, the license holder must submit to the Bureau of Criminal Apprehension the individual's full set of fingerprints and written consent for the bureau to conduct a state and national criminal history check. The bureau may exchange an individual's fingerprints with the Federal Bureau of Investigation. The Bureau of Criminal Apprehension must determine whether the individual is qualified to be employed as a cannabis worker and must notify the license holder of the bureau's determination. The license holder must not employ an individual who is disqualified from being employed as a cannabis worker.\n(a) A license holder must not employ an individual as a cannabis worker if the individual has been convicted of any of the following crimes that would constitute a felony:\n(1) human trafficking;\n(2) noncannabis controlled substance crimes in the first or second degree;\n(3) labor trafficking;\n(4) fraud;\n(5) embezzlement;\n(6) extortion;\n(7) money laundering; or\n(8) insider trading;\nif committed in this state or any other jurisdiction for which a full pardon or similar relief has not been granted.\n(b) A license holder must not employ an individual as a cannabis worker if the individual made any false statement in an application for employment.",
	"repealed": false
}