{
	"id": "340A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.22",
	"title": "340A.22 MICRODISTILLERIES; DISTILLED SPIRIT MANUFACTURERS.",
	"text": "(a) A microdistillery licensed under this chapter may provide on its premises samples of distilled spirits manufactured on its premises, in an amount not to exceed 15 milliliters per variety per person. No more than 45 milliliters may be sampled under this paragraph by any person on any day.\n(b) A microdistillery or distilled spirits manufacturer can sell cocktails to the public, pursuant to subdivision 2.\n(c) A microdistillery or distilled spirits manufacturer may not operate a cocktail room under subdivision 2 or conduct sales at off-sale under subdivision 4 unless at least 50 percent of the annual production of the licensee is processed and distilled on premises.\n(d) For purposes of calculating annual production under paragraph (c), distilled spirits that are bottled by the licensee under a contract bottling agreement with a third party are excluded from the licensee's annual production if the:\n(1) third-party contractor is an independent entity that is not owned or controlled by the licensee;\n(2) distilled spirits bottled under a third-party contract are not available for sale or marketed by the licensee or the third party at any location licensed under subdivision 2 or 4; and\n(3) distilled spirits bottled under a third-party contract are available for distribution by wholesalers.\n(e) Distilled spirits produced or in production prior to July 1, 2017, are not counted as part of the calculations under paragraph (c).\n(a) A municipality, including a city with a municipal liquor store, may issue the holder of a microdistillery license or distilled spirits manufacturer license under this chapter a microdistillery or distilled spirits manufacturer cocktail room license. A microdistillery or distilled spirits manufacturer cocktail room license authorizes on-sale of distilled liquor produced by the distiller for consumption on the premises of or adjacent to one distillery location owned by the distiller. Notwithstanding section 340A.504, subdivision 3, a cocktail room may be open and may conduct on-sale business on Sundays if authorized by the municipality. Nothing in this subdivision precludes the holder of a microdistillery or distilled spirits manufacturer cocktail room license from also holding a license to operate a restaurant at the distillery. Section 340A.409 shall apply to a license issued under this subdivision. All provisions of this chapter that apply to a retail liquor license shall apply to a license issued under this subdivision unless the provision is explicitly inconsistent with this subdivision.\n(b) A distiller may only have one cocktail room license under this subdivision.\n(c) The municipality shall impose a licensing fee on a distiller holding a microdistillery or distilled spirits manufacturer cocktail room license under this subdivision, subject to limitations applicable to license fees under section 340A.408, subdivision 2, paragraph (a).\n(d) A municipality shall, within ten days of the issuance of a license under this subdivision, inform the commissioner of the licensee's name and address and trade name, and the effective date and expiration date of the license. The municipality shall also inform the commissioner of a license transfer, cancellation, suspension, or revocation during the license period.\n(e) No single entity may hold both a cocktail room and taproom license, and a cocktail room and taproom may not be colocated.\nThe commissioner shall establish a fee for licensing microdistilleries that adequately covers the cost of issuing the license and other inspection requirements. The fees shall be deposited in an account in the special revenue fund and are appropriated to the commissioner for the purposes of this subdivision. All other requirements of section 340A.301 apply to a license under this section.\n(a) A microdistillery may be issued a license by the local licensing authority for off-sale of distilled spirits, with the approval of the commissioner. The license may allow the sale of up to a total of 750 milliliters per customer per day of product manufactured on site, in any size container or combination of containers approved under paragraph (b), subject to the following requirements:\n(1) off-sale hours of sale must conform to hours of sale for retail off-sale licensees in the licensing municipality; and\n(2) no brand may be sold at the microdistillery unless it is also available for distribution by wholesalers.\n(b) The commissioner may approve any standard fill as approved by the Alcohol and Tobacco Tax and Trade Bureau.\n(c) The commissioner may by rule establish reporting requirements for microdistilleries making off-sales of distilled spirits under this subdivision to ensure compliance with the 750 milliliter limit in paragraph (a).",
	"repealed": false
}