{
	"id": "144A.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.75",
	"title": "144A.75 DEFINITIONS; SERVICE REQUIREMENTS.",
	"text": "For the purposes of sections 144A.75 to 144A.756, the following terms have the meanings given them.\n\"Commissioner\" means the commissioner of health.\n\"Core services\" means physician services, registered nursing services, advanced practice registered nurse services, physician assistant services, medical social services, and counseling services. A hospice must ensure that at least two core services are regularly provided directly by hospice employees. A hospice provider may use contracted staff if necessary to supplement hospice employees in order to meet the needs of patients during peak patient loads or under extraordinary circumstances.\n\"Counseling services\" includes bereavement counseling provided after the patient's death and spiritual and other counseling services for the individual and the family while enrolled in hospice care. Bereavement services must be provided according to a plan of care that reflects the needs of the family for up to one year following the death of the patient.\n\"Hospice provider\" means an individual, organization, association, corporation, unit of government, or other entity that is regularly engaged in the delivery, directly or by contractual arrangement, of hospice services for a fee to hospice patients. A hospice must provide all core services.\n\"Hospice patient\" means an individual whose illness has been documented by the individual's attending physician, advanced practice registered nurse, or physician assistant and hospice medical director, who alone or, when unable, through the individual's family has voluntarily consented to and received admission to a hospice provider, and who:\n(1) has been diagnosed as terminally ill, with a probable life expectancy of under one year; or\n(2) is 21 years of age or younger; has been diagnosed with a chronic, complex, and life-threatening illness contributing to a shortened life expectancy; and is not expected to survive to adulthood.\n\"Hospice patient's family\" means relatives of the hospice patient, the hospice patient's guardian or primary caregiver, or persons identified by the hospice patient as having significant personal ties.\n\"Hospice services\" or \"hospice care\" means palliative and supportive care and other services provided by an interdisciplinary team under the direction of an identifiable hospice administration to terminally ill hospice patients and their families to meet the physical, nutritional, emotional, social, spiritual, and special needs experienced during the final stages of illness, dying, and bereavement, or during a chronic, complex, and life-threatening illness contributing to a shortened life expectancy for hospice patients who meet the criteria in subdivision 6, clause (2). These services are provided through a centrally coordinated program that ensures continuity and consistency of home and inpatient care that is provided directly or through an agreement.\n\"Interdisciplinary team\" means a group of qualified individuals with expertise in meeting the special needs of hospice patients and their families, including, at a minimum, those individuals who are providers of core services.\n\"Medical director\" means a licensed physician who is knowledgeable about palliative medicine and assumes overall responsibility for the medical component of the hospice care program.\n\"Other services\" means physical therapy, occupational therapy, speech therapy, nutritional counseling, and volunteers.\n\"Palliative care\" means specialized medical care for individuals living with a serious illness or life-limiting condition. This type of care is focused on reducing the pain, symptoms, and stress of a serious illness or condition. Palliative care is a team-based approach to care, providing essential support at any age or stage of a serious illness or condition, and is often provided together with curative treatment. The goal of palliative care is to improve quality of life for both the patient and the patient's family or care partner.\n(a) \"Residential hospice facility\" means a facility that resembles a single-family home modified to address life safety, accessibility, and care needs, located in a residential area that directly provides 24-hour residential and support services in a home-like setting for hospice patients as an integral part of the continuum of home care provided by a hospice and that houses:\n(1) no more than eight hospice patients; or\n(2) at least nine and no more than 12 hospice patients with the approval of the local governing authority, notwithstanding section 462.357, subdivision 8.\n(b) Residential hospice facility also means a facility that directly provides 24-hour residential and support services for hospice patients and that:\n(1) houses no more than 21 hospice patients;\n(2) meets hospice certification regulations adopted pursuant to title XVIII of the federal Social Security Act, United States Code, title 42, section 1395, et seq.; and\n(3) is located on St. Anthony Avenue in St. Paul, Minnesota, and was licensed as a 40-bed non-Medicare certified nursing home as of January 1, 2015.\n\"Respite care\" means short-term care in an inpatient facility, such as a residential hospice facility, when necessary to relieve the hospice patient's family or other persons caring for the patient. Respite care may be provided on an occasional basis.\n\"Volunteer services\" means services by volunteers who provide a personal presence that augments a variety of professional and nonprofessional services available to the hospice patient, the hospice patient's family, and the hospice provider.",
	"repealed": false
}