{
	"id": "169.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.515",
	"title": "169.515 LIGHTS ON GRANT PROGRAM.",
	"text": "For purposes of this section, \"high poverty area\" means a census tract as reported in the most recently completed decennial census published by the United States Bureau of the Census that has a poverty area rate of at least 20 percent or in which the median family income does not exceed 80 percent of the greater of the statewide or metropolitan median family income.\nThe Lights On grant program is established under this section to provide drivers on Minnesota roads with vouchers of up to $250 to use at participating auto repair shops to repair or replace broken or malfunctioning lighting equipment required under sections 169.49 to 169.51.\nCounties, cities, towns, the State Patrol, and local law enforcement agencies, including law enforcement agencies of a federally recognized Tribe, as defined in United States Code, title 25, section 5304(e), are eligible to apply for grants under this section.\n(a) The commissioner of public safety must develop application materials and procedures for the Lights On grant program.\n(b) The application must describe the type or types of intended vouchers, the amount of money requested, and any other information deemed necessary by the commissioner.\n(c) Applicants must submit an application under this section in the form and manner prescribed by the commissioner.\n(d) Applicants must describe how grant money will be used to provide and distribute vouchers to drivers.\n(a) Applicants must keep records of vouchers distributed and records of all expenses associated with awarded grant money.\n(b) Applicants must not use awarded grant money for administrative costs. A nonstate organization that contracts with the commissioner to operate the program must not retain any of the grant money for administrative costs.\n(a) An applicant must not distribute more than one voucher per motor vehicle in a 90-day period.\n(b) A voucher that is distributed to a driver must contain the following information:\n(1) the motor vehicle license plate number;\n(2) the date of issuance; and\n(3) the badge number of the peace officer distributing the voucher.\nPreference for grant awards must be given to applicants whose proposals provide resources and vouchers to individuals residing in geographic areas that (1) have higher crash rates or higher numbers of tickets issued for broken or malfunctioning lighting equipment, or (2) are high poverty areas.\n(a) By February 1 each year, grant recipients must submit a report to the commissioner itemizing all expenditures made using grant money during the previous calendar year, the purpose of each expenditure, and the disposition of each contact made with drivers with malfunctioning or broken lighting equipment. The report must be in the form and manner prescribed by the commissioner.\n(b) By March 15 each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The report must list, for the previous calendar year:\n(1) the participating grant recipients and the total number and dollar amount of vouchers that each grant recipient distributed; and\n(2) the participating auto repair shops and the total number and dollar amount of vouchers that each received.\nGrant recipients and any program organization contracted by the commissioner must provide information as requested by the commissioner to complete the report required under this paragraph.",
	"repealed": false
}