{
	"id": "473.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.121",
	"title": "473.121 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them in this section, except as otherwise expressly provided or indicated by the context.\n\"Metropolitan area\" or \"area\" means the area over which the Metropolitan Council has jurisdiction, including only the counties of Anoka; Carver; Dakota excluding the cities of Northfield and Cannon Falls; Hennepin excluding the cities of Hanover and Rockford; Ramsey; Scott excluding the city of New Prague; and Washington.\n\"Metropolitan Council\" or \"council\" means the Metropolitan Council established by section 473.123.\n\"Metropolitan county\" means any one of the following counties: Anoka, Carver, Dakota, Hennepin, Ramsey, Scott or Washington.\n\"State agency\" means the state of Minnesota or any agency, board, commission, department or educational institution thereof.\n\"Metropolitan agency\" means the Metropolitan Parks and Open Space Commission, Metropolitan Airports Commission, and Metropolitan Sports Facilities Commission.\n\"Local governmental unit\" means any county, city, town, school district, special district or other political subdivisions or public corporation, other than the council or a metropolitan agency, lying in whole or part within the metropolitan area.\nMS 1984 [Repealed, 1986 c 460 s 59]\n\"Metropolitan significance\" means a status determined by the Metropolitan Council pursuant to the rules and procedures established by section 473.173.\nMS 1984 [Repealed, 1986 c 460 s 59]\n\"Policy plan\" means a long-range comprehensive plan of the Metropolitan Council.\n\"Independent commission, board or agency\" means governmental entities with jurisdictions lying in whole or in part within the metropolitan area.\n\"Metropolitan Parks and Open Space Commission\" means the commission established in sections 473.302 to 473.341.\n\"Park district\" means a park district created under chapter 398.\n\"Regional recreation open space\" means land and water areas, or interests therein, and facilities determined by the Metropolitan Council to be of regional importance in providing for a balanced system of public outdoor recreation for the metropolitan area, including but not limited to park reserves, major linear parks and trails, large recreation parks, and conservatories, zoos, and other special use facilities.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\n\"Metropolitan transit area\" means the metropolitan area.\nMS 1976 [Repealed, 1977 c 454 s 49]\n\"Operator\" means any person engaged or seeking to engage in the business of providing regular route public transit.\n\"Paratransit\" has the meaning given in section 174.22, subdivision 6.\n\"Public transportation\" or \"transit\" has the meaning given to \"public transportation\" in section 174.22, subdivision 7.\n\"Public transit system\" or \"transit system\" means, without limitation, a combination of property, structures, improvements, equipment, plants, parking or other facilities, and rights, or any thereof, used or useful for the purposes of public transit.\n\"Regular route transit\" has the meaning given in section 174.22, subdivision 8.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\n\"Acquisition\" and \"betterment\" shall have the meanings given to them in chapter 475.\n\"Interceptor\" means any sewer and necessary appurtenances thereto, including but not limited to mains, pumping stations, and sewage flow regulating and measuring stations, which is designed or used to conduct sewage originating in more than one local government unit, or which is designed or used to conduct all or substantially all of the sewage originating in a single local government unit from a point of collection in that unit to an interceptor or treatment works outside that unit.\n\"Metropolitan disposal system\" means any or all of the interceptors or treatment works owned or operated by the Metropolitan Council.\n\"Pollution,\" \"sewer system,\" \"treatment works,\" \"disposal system,\" and \"waters of the state\" shall have the meanings given them in section 115.01.\n\"Sewage\" means all liquid or water-carried waste products from whatever source derived, together with such groundwater infiltration and surface water as may be present.\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1975 Supp [Repealed, 1976 c 179 s 20]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\n\"Metropolitan Airports Commission\" means the commission established in sections 473.601 to 473.679.\n\"Major airport\" means any airport now or which may hereafter be operated by the Metropolitan Airports Commission as a terminal for regular, scheduled air passenger service.\n\"Aeronautics\" means the transportation by aircraft, the operation, construction, repair, or maintenance of aircraft, aircraft power plants and accessories, including the repair, packing and maintenance of parachutes; the design, establishment, construction, operation, improvement, repair, or maintenance of airports, restricted landing areas, or other air navigation facilities and air instruction, and powers incidental thereto.\n\"Airport\" means any locality, either of land or water, including intermediate landing fields, which is used or intended to be used for the landing and take off of aircraft, whether or not facilities are provided for the shelter, servicing, or repair of aircraft, or for receiving or discharging passengers or cargo, and also includes any facility used in, available for use in, or designed for use in, aid of air navigation, including, but without limitation, landing areas, lights, any apparatus or equipment for disseminating weather information, for signaling, for radio-directional finding, or for radio or other electrical communication, and any other structure or mechanism having a similar purpose for guiding or controlling flight in the air or the landing and take off of aircraft, and also includes, but without limitation, access roads, parking areas, railroad siding facilities, such land contiguous or not as may be required for installations necessary for safe and efficient operation, buildings, structures, hangars, shops and any personal property usually used in connection with the operations of such airports, including specifically, but not exclusively, snow removal or impacting equipment, fire and ambulance equipment, motor vehicles and equipment for buildings, structures, hangars, and shops. It includes any area heretofore in the statutes of this state termed an \"airport\" or a \"flying field.\"\nThe definitions of terms relating to waste in chapter 116 and section 115A.03, also apply to the same terms relating to waste used in this chapter.",
	"repealed": false
}