{
	"id": "176.1292",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.1292",
	"title": "176.1292 FORBEARANCE OF AMOUNTS OWED TO THE SPECIAL COMPENSATION FUND.",
	"text": "For purposes of this section, the following definitions apply.\n(a) \"Payer\" means a workers' compensation insurer, or an employer or group of employers that are self-insured for workers' compensation.\n(b) \"Retirement benefits\" means retirement benefits paid by any government retirement benefit program and received by employees, other than old age and survivor insurance benefits received under the federal Social Security Act, United States Code, title 42, sections 401 to 434. Retirement benefits include retirement annuities, optional annuities received in lieu of retirement benefits, and any other benefit or annuity paid by a government benefit program that is not clearly identified as a disability benefit or disability annuity in the applicable governing statute.\n(a) A payer is entitled to the relief described in subdivisions 3 and 4 only if the payer complies with all of the conditions in paragraphs (b) to (d) for all of the payer's permanently totally disabled employees and documents compliance according to the procedures and forms established by the commissioner under subdivision 7.\n(b) Except as provided in paragraph (e), the payer must:\n(1) recharacterize supplementary benefits paid to all employees as permanent total disability benefits if the supplementary benefits were paid because the permanent total disability benefits were reduced by retirement benefits received by the employee;\n(2) pay all permanently totally disabled employees, regardless of the date of injury, past and future permanent total disability benefits calculated without any reduction for retirement benefits received by the employees, from the date the employees' benefits were first reduced; and\n(3) for all deceased employees, pay the employees' dependents or, if none, the employees' legal heirs, the permanent total disability benefits the deceased employees would have received if the benefits had been calculated without any reduction for retirement benefits received by the employees.\n(c) A payer may take a credit against its obligations under paragraph (b), clauses (2) and (3), for:\n(1) supplementary benefits previously paid to an employee that have been recharacterized as permanent total disability benefits under paragraph (b), clause (1); and\n(2) permanent total disability benefits previously paid to an employee.\n(d) The payer must pay the permanent total disability benefits as provided in paragraphs (b) and (c) within the time frames described in clauses (1) to (4). More than one time frame may apply to a claim.\n(1) No later than 150 days following May 30, 2017, the payer must begin paying the recalculated permanent total disability benefit amounts to employees who are entitled to ongoing permanent total disability benefits.\n(2) No later than 210 days following May 30, 2017, the payer must pay employees the amounts that past permanent total disability benefits were underpaid.\n(3) No later than 270 days following May 30, 2017, the payer must pay the employees' dependents or legal heirs the amounts that permanent total disability benefits were underpaid.\n(4) The commissioner may waive payment under paragraphs (b) and (c) or extend these time frames if the payer, after making a good-faith effort, is unable to: locate an employee; identify or locate the dependents or legal heirs of a deceased employee; or locate documentation to determine the amount of an underpayment.\n(e) Paragraphs (a) to (d) do not apply if:\n(1) the employee died before January 1, 2008;\n(2) the employee's last permanent total disability benefit was paid before January 1, 2000;\n(3) the employee's last permanent total disability benefit would have been paid before January 1, 2000, if it had not been reduced by the employee's retirement benefits;\n(4) a stipulation for settlement, signed by the employee and approved by a compensation judge, provided for a full, final, and complete settlement of permanent total disability benefits under this chapter in exchange for a lump sum payment amount or a lump sum converted to a structured annuity;\n(5) a final court order, or a stipulation for settlement signed by the employee and approved by a compensation judge, explicitly states the employee's permanent total disability benefits may be reduced by specified retirement benefits. Paragraphs (a) to (d) apply if a court order or stipulation for settlement is ambiguous about whether the employee's permanent total disability benefits could be reduced by retirement benefits; or\n(6) a final court order or a stipulation for settlement described in clause (4) or (5) was vacated after May 31, 2017.\n(a) Except as provided in subdivision 9, paragraph (a), clause (2), a payer that has complied with the requirements of subdivision 2, paragraphs (a) to (d):\n(1) is not required to repay supplementary benefits for any claim that the special compensation fund over reimbursed due to the payer's reduction of any employee's permanent total disability benefits by retirement benefits received by the employee;\n(2) is entitled to reimbursement of supplementary benefits paid or payable before August 13, 2014, to the extent the special compensation fund denied reimbursement due to the payer's reduction of any employee's permanent total disability benefits by the employee's retirement benefits; and\n(3) is entitled to reimbursement of supplementary benefits the special compensation fund withheld under section 176.129, subdivision 13, paragraph (a), to offset supplementary benefits that were over reimbursed due to the payer's reduction of any employee's permanent total disability benefits by the employee's retirement benefits.\n(b) Paragraph (a) does not preclude the special compensation fund from denying reimbursement of supplementary benefits, or adjusting the reimbursement amount, for any reason other than reduction of permanent total disability benefits by the employee's retirement benefits.\n(a) Except as provided in subdivision 6, paragraph (b), clause (2), and subdivision 9, paragraph (a), clause (2), a payer that has complied with the requirements of subdivision 2, paragraphs (a) to (d), is not required to pay past or future assessments under section 176.129 on the amount of increased or additional permanent total disability benefits paid, or on supplementary benefits that are appropriately characterized as permanent total disability benefits, due to the elimination of the retirement benefit reduction.\n(b) The special compensation fund shall not recalculate assessments previously paid by any payer because of the assessment adjustments in paragraph (a).\n(c) The assessment adjustments described in paragraph (a) do not apply to permanent total disability benefits paid to employees with dates of injury on or after August 13, 2014. Payers must pay full assessments according to section 176.129 on permanent total disability benefits calculated without a reduction for retirement benefits for these employees.\n(a) A payer is entitled to a refund from the special compensation fund if:\n(1) the payer complies with the requirements of subdivision 2, paragraphs (a) to (d); and\n(2) due to the elimination of the retirement benefit reduction, the payer repaid the special compensation fund for over reimbursement of supplementary benefits, or paid assessments on the increased permanent total disability benefits for employees with dates of injury before August 13, 2014.\n(b) The special compensation fund must issue a refund within 30 days after receiving the payer's documentation of compliance with subdivision 2, paragraphs (a) to (d), and an itemization by claim of the amount repaid or paid to the special compensation fund as described in paragraph (a), clause (2).\n(c) The special compensation fund must pay interest on any refunded amount under this section to the payer at an annual rate of four percent, calculated from the date the payer repaid or paid the special compensation fund as described in paragraph (a), clause (2).\n(a) This section does not preclude any employee, dependent, or legal heir from pursuing additional benefits beyond those paid under subdivision 2, paragraphs (b) to (d); however, the payments under subdivision 2, paragraphs (b) to (d), are not to be construed as an admission of liability by the payer in any proceeding. The payments cannot be used to justify additional claims; they represent a compromise between the payer and the special compensation fund on supplementary benefits and assessments. Payers reserve any and all defenses to claims to which this section does not apply.\n(b) If an employee, dependent, or legal heir pursues additional benefits, claims, or penalties related to the benefits paid or payable under subdivision 2, paragraphs (b) to (d), payers may assert any and all defenses including, but not limited to, those specified in subdivision 2, paragraph (e), clauses (4) and (5), with respect to the additional benefits, claims, and penalties, and any future permanent total disability benefits payable, subject to the following conditions:\n(1) if it is determined by a compensation judge, the Workers' Compensation Court of Appeals, or the Minnesota Supreme Court that the payer is entitled to reduce the employee's permanent total disability benefits by retirement benefits received by the employee, the payer shall not recover any overpayment that results from benefits the employee, dependent, or legal heir has already received under subdivision 2, paragraphs (b) to (d). Notwithstanding section 176.129, the payer shall not take a credit against an employee's future benefits for any such overpayment; and\n(2) if it is determined by a compensation judge, the Workers' Compensation Court of Appeals, or the Minnesota Supreme Court that the payer is not entitled to reduce the employee's permanent total disability benefits by retirement benefits received by the employee, the payer is not entitled to the relief provided in subdivision 4 as applied to the claim of the specific employee, dependent, or legal heir.\n(c) A payer shall not assert defenses related to the offset of retirement benefits against an employee's future permanent total disability benefits if the only additional claims asserted by the employee under paragraph (b) are for attorney fees, costs and disbursements, and an additional award pursuant to section 176.081, subdivision 7.\nNo later than 60 days after May 30, 2017, in consultation with affected payers, the commissioner must establish a procedure, which may include forms, to implement this section.\nThis section does not affect a payer's obligation to report the full amount of permanent total disability benefits paid to the extent required by this chapter or other law. A payer must report supplementary benefits as permanent total disability benefits if the supplementary benefits were paid because the permanent total disability benefits were reduced by retirement benefits received by the employee.\n(a) If a payer reports to the department that it has complied with the requirements of subdivision 2, paragraphs (a) to (d), but the payer has not paid an employee, dependent, or legal heir, as required by subdivision 2, the payer is subject to the following:\n(1) the payer must issue payment to the employee, dependent, or legal heir within 14 days of the date the payer discovers the noncompliance or the date the department notifies the payer of the noncompliance;\n(2) the payer is not entitled to the relief provided in subdivisions 3 and 4 as applied to the claim of the specific employee, dependent, or legal heir who was not paid as required by subdivision 2;\n(3) the special compensation fund may immediately begin collection of any assessments or over-reimbursement owed for the claim;\n(4) if the commissioner determines that a payer's failure to comply under this subdivision was not in good faith, the commissioner may assess a penalty, payable to the employee, dependent, or legal heir, of up to 25 percent of the total permanent total disability benefits underpaid; and\n(5) if the payer is found after a hearing to be liable for increased or additional permanent total disability benefits because the employee's permanent total disability benefits were improperly reduced by the employee's retirement benefits, the compensation judge shall assess a penalty against the payer, payable to the employee or dependent, up to the total amount of the permanent total disability benefits that were not paid pursuant to subdivision 2. The compensation judge may issue a penalty against the payer, up to the total amount of the permanent total disability benefits underpaid, payable to a legal heir.\n(b) The penalties assessed under this subdivision are in addition to any other penalty that may be, or is required to be, assessed under this chapter; however, the commissioner shall not assess a penalty against a payer for late payment of permanent total disability benefits if the employee's benefits have been paid and documented in accordance with subdivision 2.\n(c) If a payer and the special compensation fund have agreed to a list of employees required to be paid under subdivision 2, this subdivision does not apply to any claim with a date of injury before October 1, 1995, that is not on the agreed-upon list.",
	"repealed": false
}