{
	"id": "13.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.15",
	"title": "13.15 COMPUTER DATA.",
	"text": "As used in this section, the following terms have the meanings given.\n(a) \"Electronic access data\" means data created, collected, or maintained about a person's access to a government entity's computer for the purpose of:\n(1) gaining access to data or information;\n(2) transferring data or information; or\n(3) using government services.\n(b) \"Cookie\" means any data that a government-operated computer electronically places on the computer of a person who has gained access to a government computer.\nElectronic access data are private data on individuals or nonpublic data.\n(a) A government entity that creates, collects, or maintains electronic access data or uses its computer to install a cookie on a person's computer must inform persons gaining access to the entity's computer of the creation, collection, or maintenance of electronic access data or the entity's use of cookies before requiring the person to provide any data about the person to the government entity. As part of that notice, the government entity must inform the person how the data will be used and disseminated, including the uses and disseminations in subdivision 4.\n(b) Notwithstanding a person's refusal to accept a cookie on the person's computer, a government entity must allow the person to gain access to data or information, transfer data or information, or use government services by the government entity's computer.\nElectronic access data may be disseminated:\n(1) to the commissioner for the purpose of evaluating electronic government services;\n(2) to another government entity or a federal law enforcement agency to prevent or report unlawful intrusions into government electronic systems; or\n(3) as otherwise provided by law.\nThis section does not apply to a cookie temporarily installed by a government entity on a person's computer during a single session on or visit to a government entity's website if the cookie is installed only in a computer's memory and is deleted from the memory when the website browser or website application is closed.",
	"repealed": false
}