{
	"id": "10.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/10.60",
	"title": "10.60 PUBLIC WEBSITES AND PUBLICATIONS.",
	"text": "For purposes of this section:\n(1) \"political subdivision\" means a county, statutory or home rule charter city, town, school district, or other municipal corporation, and the Metropolitan Council and a metropolitan or regional agency;\n(2) \"publication\" means a document printed with public money by an elected or appointed official of a state agency or political subdivision that is intended to be distributed publicly outside of the state agency or political subdivision;\n(3) \"state agency\" means an entity in the executive, judicial, or legislative branch of state government; and\n(4) \"website\" means a site maintained on the World Wide Web that is available for unrestricted public access and that is maintained with public money by an elected or appointed official of a state agency or political subdivision.\nThe purpose of a website and a publication must be to provide information about the duties and jurisdiction of a state agency or political subdivision or to facilitate access to public services and information related to the responsibilities or functions of the state agency or political subdivision.\n(a) A website or publication must not include pictures or other materials that tend to attribute the website or publication to an individual or group of individuals instead of to a public office, state agency, or political subdivision. A publication must not include the words \"with the compliments of\" or contain letters of personal greeting that promote an elected or appointed official of a state agency or political subdivision.\n(b) A website, other than a website maintained by a public library or the election-related website maintained by the Office of the Secretary of State or the Campaign Finance and Public Disclosure Board, may not contain a link to a weblog or site maintained by a candidate, a political committee, a political party or party unit, a principal campaign committee, or a state committee. Terms used in this paragraph have the meanings given them in chapter 10A, except that \"candidate\" also includes a candidate for an elected office of a political subdivision.\n(a) Material specified in this subdivision may be included on a website or in a publication, but only if the material complies with subdivision 2. This subdivision is not a comprehensive list of material that may be contained on a website or in a publication, if the material complies with subdivision 2.\n(b) A website or publication may include biographical information about an elected or appointed official, a single official photograph of the official, and photographs of the official performing functions related to the office. There is no limitation on photographs, webcasts, archives of webcasts, and audio or video files that facilitate access to information or services or inform the public about the duties and obligations of the office or that are intended to promote trade or tourism. A state website or publication may include photographs or information involving civic or charitable work done by the governor's spouse, provided that these activities relate to the functions of the governor's office.\n(c) A website or publication may include press releases, proposals, policy positions, and other information directly related to the legal functions, duties, and jurisdiction of a public official or organization.\n(d) The election-related website maintained by the Office of the Secretary of State shall provide links to:\n(1) the campaign website of any candidate for legislative, constitutional, judicial, or federal office who requests or whose campaign committee requests such a link and provides in writing a valid URL address to the Office of the Secretary of State; and\n(2) the website of any individual or group advocating for or against or providing neutral information with respect to any ballot question, where the individual or group requests such a link and provides in writing a valid website address and valid email address to the Office of the Secretary of State.\nThese links must be provided on the election-related website maintained by the Office of the Secretary of State from the opening of filing for the office in question until the business day following the day on which the State Canvassing Board has declared the results of the state general election, or November 30 of the year in which the election has taken place, whichever date is earlier. The link must be activated on the election-related website maintained by the Office of the Secretary of State within two business days of receipt of the request from a qualified candidate or committee.\nThis section does not prohibit a state agency or political subdivision from adopting more restrictive standards for the content of a website or publication maintained by the agency or political subdivision.\nViolation of this section is not a crime and is not subject to civil penalty.",
	"repealed": false
}