{
	"id": "44.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/44.03",
	"title": "44.03 MERIT SYSTEM.",
	"text": "In any municipality establishing the merit system under this chapter, every employee of the municipality shall be in the classified service except the following:\n(a) Any officer chosen by popular election or appointed to fill a vacancy in an elective office.\n(b) Any official reporter, bailiff, or other employee appointed by any court, or judge or justice thereof.\n(c) Members of any board or commission provided for by statute, charter, or ordinance.\n(d) The city manager.\n(e) Any other employee expressly excluded by the merit system ordinance.\nThe council may make the exclusions authorized in subdivision 1, clause (e), by entire departments, by class of position, or by individual positions; but no position under the jurisdiction of a police or firefighter's civil service commission at the time the merit system is adopted in any municipality shall be so excluded by the original merit system ordinance and no such position shall be thereafter excluded unless the ordinance proposing to do so is submitted to the voters as a separate proposition and approved by two-thirds of those voting on the proposition of its adoption. After the ordinance establishing the merit system has been approved by the voters in a municipality, the council may add to or subtract from the exclusions made under subdivision 1, clause (e), by an amendment to the original ordinance approved by the voters as in the case of the original ordinance. Any position established by the municipality after the original ordinance is approved by the voters shall be in the classified service without further action by the council unless the position is (1) excluded from the classified service by subdivision 1, clause (a), (b), (c), (d), or (e) in a department or class of positions excluded from the classified service by the merit system ordinance; but any such position may thereafter be excluded from the classified service by ordinance amendment adopted under subdivision 1, clause (e).",
	"repealed": false
}