{
	"id": "219.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.071",
	"title": "219.071 MAINTENANCE OF GRADE-CROSSING SURFACES.",
	"text": "It is the primary responsibility of the owner or lessee of railroad track to keep grade-crossing surfaces over public highways safe and passable for vehicular traffic in a manner consistent with appropriate federal track safety standards. The surfaces must extend the full width of the public highway within the railroad track structure.\nIf a grade-crossing surface, as defined in section 219.16, needs improvement, repair, or maintenance, the cost for the improvement, repair, or maintenance may be paid jointly by the owner or lessee of the track, the road authority having jurisdiction over the public highway involved and funds available to the department for grade-crossing surfaces from the following sources:\n(1) money appropriated to the department in the future for the purposes of this section;\n(2) available federal funds allocated for the grade-crossing program established by this section; and\n(3) money acquired by the department by gift, grant, or contribution from any source for purposes of this section.\nIf the owner or lessee of the railroad track and the road authority having jurisdiction over the public highway involved agree upon the allocation of the cost of repair or maintenance of the grade-crossing surface, a copy of the agreement must be filed with the commissioner. If the parties to the negotiations contemplate using funds described in subdivision 2, either party shall notify the commissioner before the conclusion of negotiations and the department may participate in the negotiations and may be a party to the agreement and participate in the costs incurred subsequent to agreement.\n(a) If the owner or lessee of the railroad track and the road authority having jurisdiction over the public highway at the grade crossing cannot reach an agreement under subdivision 3 regarding repair or maintenance of a grade-crossing surface, either party may invoke the jurisdiction of the department by (1) filing with the commissioner a statement setting forth the status of negotiations and (2) requesting the commissioner to make a final determination of the dispute.\n(b) The commissioner, after notifying in writing the parties involved in the negotiations and providing an opportunity for the parties to participate in a conference, may order the repair or maintenance of the grade-crossing surface within a reasonable time as needed to comply with the standards set forth in subdivision 1.\n(c) The order of the commissioner, in addition to enforcing the responsibility of the owner or lessee of the railroad track in question, may provide for participation in the costs of the project (1) by the road authority, (2) from the funds available to the department in subdivision 2, or (3) through other formulas as may be practical and reasonable under the circumstances.\n(d) A party failing to comply with an order of the commissioner is subject to a penalty of $50 for each day of noncompliance, to be recovered for the state in a civil action instituted by the department. Each day of noncompliance constitutes a separate offense.\nA party subject to an order issued under subdivision 4 may appeal the order of the commissioner to the district court of the county in which the grade crossing is located. In case of appeal, the same proceedings must be conducted as are now provided by law for an appeal from orders of the commissioner. Orders of the commissioner must be enforced by the attorney general.",
	"repealed": false
}