{
	"id": "161.164",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.164",
	"title": "161.164 FINAL LAYOUT APPROVAL PROCESS.",
	"text": "Before proceeding with the construction, reconstruction, or improvement of any route on the trunk highway system lying within any municipality, the commissioner shall submit to its governing body a final layout and project report covering the purpose, route location, and proposed design of the highway. The final layout must be submitted as part of a report containing any supporting data that the commissioner deems helpful to the governing body in reviewing the final layout submitted. The supporting data must include a good-faith cost estimate of all the costs in which the governing body is expected to participate. The final layout must be submitted before final decisions are reached so that meaningful early input can be obtained from the municipality.\n(a) Within 15 days of receiving a final layout from the commissioner, the governing body shall schedule a public hearing on the final layout. The governing body shall, within 60 days of receiving a final layout from the commissioner, conduct a public hearing at which the Department of Transportation shall present the final layout for the project. The governing body shall give at least 30 days' notice of the public hearing.\n(b) Within 90 days from the date of the public hearing, the governing body shall approve or disapprove the final layout in writing, as follows:\n(1) If the governing body approves the final layout or does not disapprove the final layout in writing within 90 days, in which case the final layout is deemed to be approved, the commissioner may continue the project development.\n(2) If the final construction plans contain changes in access, traffic capacity, or acquisition of permanent right-of-way from the final layout approved by the governing body, the commissioner shall resubmit the portion of the final construction plans where changes were made to the governing body. The governing body must approve or disapprove the changes, in writing, within 60 days from the date the commissioner submits them.\n(3) If the governing body disapproves the final layout, the commissioner may make modifications requested by the municipality, decide not to proceed with the project, or refer the final layout to an appeal board. The appeal board shall consist of one member appointed by the commissioner, one member appointed by the governing body, and a third member agreed upon by both the commissioner and the governing body. If the commissioner and the governing body cannot agree upon the third member, the chief justice of the supreme court shall appoint a third member within 14 days of the request of the commissioner to appoint the third member.\nWithin 30 days after referral of the final layout, the appeal board shall hold a hearing at which the commissioner and the governing body may present the case for or against approval of the final layout referred. Not later than 60 days after the hearing, the appeal board shall recommend approval, recommend approval with modifications, or recommend disapproval of the final layout, making additional recommendations consistent with state and federal requirements as it deems appropriate. It shall submit a written report containing its findings and recommendations to the commissioner and the governing body.",
	"repealed": false
}