{
	"id": "259.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.35",
	"title": "259.35 NOTICE TO ADOPTIVE PARENTS.",
	"text": "Prior to commencing an investigation of the suitability of proposed adoptive parents, a child-placing agency shall give the individuals the following written notice in all capital letters at least one-eighth inch high:\n\"Minnesota Statutes, section 259.59, provides that upon legally adopting a child, adoptive parents assume all the rights and responsibilities of birth parents. The responsibilities include providing for the child's financial support and caring for health, emotional, and behavioral problems. Except for subsidized adoptions under Minnesota Statutes, sections 142A.60 to 142A.612, or any other provisions of law that expressly apply to adoptive parents and children, adoptive parents are not eligible for state or federal financial subsidies besides those that a birth parent would be eligible to receive for a child. Adoptive parents may not terminate their parental rights to a legally adopted child for a reason that would not apply to a birth parent seeking to terminate rights to a child. An individual who takes guardianship of a child for the purpose of adopting the child shall, upon taking guardianship from the child's country of origin, assume all the rights and responsibilities of birth and adoptive parents as stated in this paragraph.\"\nAn agency in this state that refers individuals to an agency or individual in another country for the purpose of adopting a child located in that country shall provide the following information in writing at the time of making the referral:\n(1) the name of any government authority in the country where the adoption agency or individual is located that licenses or regulates the adoption agency or individual;\n(2) the name of the current director of the adoption agency;\n(3) whether the country in which the agency or individual is located requires a legal adoption to take place in that country before a child can be removed from the country; and\n(4) the notification required by subdivision 1.",
	"repealed": false
}