{
	"id": "246C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.11",
	"title": "246C.11 STATE-OPERATED, COMMUNITY-BASED PROGRAMS.",
	"text": "The executive board shall establish and maintain a system of state-operated, community-based programs for persons with developmental disabilities.\nFor purposes of this section, \"state-operated, community-based program\" means a program administered by the state to provide treatment and habilitation in noninstitutional community settings to a person with a developmental disability.\nThe establishment of state-operated, community-based programs must be within the context of a comprehensive definition of the role of state-operated services in the state. The role of state-operated services must be defined within the context of a comprehensive system of services for persons with developmental disability.\nState-operated, community-based programs may include but are not limited to community group homes, foster care, supportive living services, day training and habilitation programs, and respite care arrangements.\n(a) In conjunction with the discharge of persons from regional treatment centers and their admission to state-controlled and privately operated community-based programs, the executive board may provide technical training assistance to the community-based programs. The executive board may apply for and accept money from any source including reimbursement charges from the community-based programs for reasonable costs of training. Money received must be deposited in the general fund and is appropriated annually to the executive board for training under this section.\n(b) The executive board must coordinate with the commissioner of human services to provide technical training assistance to community-based programs under this section and section 245.073.\n(a) State-operated, community-based programs may be developed in conjunction with existing county responsibilities and authorities for persons with developmental disabilities. Assessment, placement, screening, case management responsibilities, and determination of need procedures must be consistent with county responsibilities established under law and rule.\n(b) Counties may enter into shared service agreements with state-operated programs.",
	"repealed": false
}