{
	"id": "245C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.03",
	"title": "245C.03 BACKGROUND STUDY; INDIVIDUALS TO BE STUDIED.",
	"text": "(a) The commissioner shall conduct a background study on:\n(1) the person or persons applying for a license;\n(2) an individual age 13 and over living in the household where the licensed program will be provided who is not receiving licensed services from the program;\n(3) current or prospective employees of the applicant or license holder who will have direct contact with persons served by the facility, agency, or program;\n(4) volunteers or student volunteers who will have direct contact with persons served by the program to provide program services if the contact is not under the continuous, direct supervision by an individual listed in clause (1) or (3);\n(5) an individual age ten to 12 living in the household where the licensed services will be provided when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15;\n(6) an individual who, without providing direct contact services at a licensed program, may have unsupervised access to children or vulnerable adults receiving services from a program, when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15; and\n(7) all controlling individuals as defined in section 245A.02, subdivision 5a;\n(8) notwithstanding clause (3), for children's residential facilities and foster residence settings, any adult working in the facility, whether or not the individual will have direct contact with persons served by the facility.\n(b) For child foster care when the license holder resides in the home where foster care services are provided, a short-term substitute caregiver providing direct contact services for a child for less than 72 hours of continuous care is not required to receive a background study under this chapter.\n(c) This subdivision applies to the following programs that must be licensed under chapter 245A:\n(1) adult foster care;\n(2) children's residential facilities;\n(3) licensed home and community-based services under chapter 245D;\n(4) residential mental health programs for adults;\n(5) substance use disorder treatment programs under chapter 245G;\n(6) withdrawal management programs under chapter 245F;\n(7) adult day care centers;\n(8) family adult day services;\n(9) detoxification programs;\n(10) community residential settings;\n(11) intensive residential treatment services and residential crisis stabilization under chapter 245I; and\n(12) treatment programs for persons with sexual psychopathic personality or sexually dangerous persons, licensed under chapter 245A and according to Minnesota Rules, parts 9515.3000 to 9515.3110.\n(a) Individuals and organizations that are required under this section to have or initiate background studies shall comply with the requirements of this chapter.\n(b) All studies conducted under this section shall be conducted according to sections 299C.60 to 299C.64, including the consent and self-disclosure required in section 299C.62, subdivision 2. This requirement does not apply to subdivisions 1, paragraph (c), clauses (2) to (5), and 6a.\n(c) All data obtained by the commissioner for a background study completed under this section is classified as private data on individuals, as defined in section 13.02, subdivision 12.\nThe commissioner shall conduct background studies on any individual required under sections 256B.0651 to 256B.0654 and 256B.0659 to have a background study completed under this chapter.\nThe commissioner shall conduct all background studies required under this chapter and initiated by supplemental nursing services agencies registered under section 144A.71, subdivision 1.\nPersonal care assistance provider agencies enrolled to provide personal care assistance services under the medical assistance program must meet the following requirements:\n(1) owners who have a five percent interest or more and all managing employees are subject to a background study as provided in this chapter. This requirement applies to currently enrolled personal care assistance provider agencies and agencies seeking enrollment as a personal care assistance provider agency. \"Managing employee\" has the same meaning as in Code of Federal Regulations, title 42, section 455.101. An organization is barred from enrollment if:\n(i) the organization has not initiated background studies of owners and managing employees; or\n(ii) the organization has initiated background studies of owners and managing employees and the commissioner has sent the organization a notice that an owner or managing employee of the organization has been disqualified under section 245C.14, and the owner or managing employee has not received a set aside of the disqualification under section 245C.22; and\n(2) a background study must be initiated and completed for all qualified professionals.\nThe personal care assistant for a recipient may be allowed to enroll with a different personal care assistance provider agency upon initiation of a new background study according to this chapter if:\n(1) the commissioner determines that a change in enrollment or affiliation of the personal care assistant is needed in order to ensure continuity of services and protect the health and safety of the recipient;\n(2) the chosen agency has been continuously enrolled as a personal care assistance provider agency for at least two years;\n(3) the recipient chooses to transfer to the personal care assistance provider agency;\n(4) the personal care assistant has been continuously enrolled with the former personal care assistance provider agency since the last background study was completed; and\n(5) the personal care assistant continues to meet requirements of section 256B.0659, subdivision 11, notwithstanding paragraph (a), clause (3).\n(a) The commissioner also may conduct studies on individuals specified in subdivision 1, paragraph (a), clauses (3) and (4), when the studies are initiated by:\n(1) personnel pool agencies;\n(2) temporary personnel agencies;\n(3) educational programs that train individuals by providing direct contact services in licensed programs; and\n(4) professional services agencies that are not licensed and that work with licensed programs to provide direct contact services or individuals who provide direct contact services.\n(b) Personnel pool agencies, temporary personnel agencies, and professional services agencies must employ the individuals providing direct care services for children, people with disabilities, or the elderly. Individuals must be affiliated in NETStudy 2.0 and subject to oversight by the entity, which includes but is not limited to continuous, direct supervision by the entity and being subject to immediate removal from providing direct care services when required.\nThe commissioner shall conduct background studies on applicants and license holders under the jurisdiction of other state agencies who are required in other statutory sections to initiate background studies under this chapter, including the applicant's or license holder's employees and volunteers when required under other statutory sections.\n(a) Except as specified in paragraph (b), the commissioner shall conduct background studies of:\n(1) individuals providing services who have direct contact, as defined under section 245C.02, subdivision 11, with patients and residents in hospitals, boarding care homes, outpatient surgical centers licensed under sections 144.50 to 144.58; nursing homes and home care agencies licensed under chapter 144A; assisted living facilities and assisted living facilities with dementia care licensed under chapter 144G; and board and lodging establishments that are registered to provide supportive or health supervision services under section 157.17;\n(2) individuals specified in subdivision 2 who provide direct contact services in a nursing home or a home care agency licensed under chapter 144A; an assisted living facility or assisted living facility with dementia care licensed under chapter 144G; or a boarding care home licensed under sections 144.50 to 144.58. If the individual undergoing a study resides outside of Minnesota, the study must include a check for substantiated findings of maltreatment of adults and children in the individual's state of residence when the state makes the information available;\n(3) all other employees in assisted living facilities or assisted living facilities with dementia care licensed under chapter 144G, nursing homes licensed under chapter 144A, and boarding care homes licensed under sections 144.50 to 144.58. A disqualification of an individual in this section shall disqualify the individual from positions allowing direct contact with or access to patients or residents receiving services. \"Access\" means physical access to a client or the client's personal property without continuous, direct supervision as defined in section 245C.02, subdivision 8, when the employee's employment responsibilities do not include providing direct contact services;\n(4) individuals employed by a supplemental nursing services agency, as defined under section 144A.70, who are providing services in health care facilities;\n(5) controlling persons of a supplemental nursing services agency, as defined by section 144A.70; and\n(6) license applicants, owners, managerial officials, and controlling individuals who are required under section 144A.476, subdivision 1, or 144G.13, subdivision 1, to undergo a background study under this chapter, regardless of the licensure status of the license applicant, owner, managerial official, or controlling individual.\n(b) An entity shall not initiate a background study on any individual identified in paragraph (a), clauses (1) to (5), if the individual has a valid license issued by a health-related licensing board as defined in section 214.01, subdivision 2, and has completed the criminal background check as required in section 214.075. An entity that is affiliated with individuals who meet the requirements of this paragraph must separate those individuals from the entity's roster for NETStudy 2.0. The Department of Human Services is not liable for conducting background studies that have been submitted or not removed from the roster in violation of this provision.\n(c) If a facility or program is licensed by the Department of Human Services and the Department of Health and is subject to the background study provisions of this chapter, the Department of Human Services is solely responsible for the background studies of individuals in the jointly licensed program.\n(d) The commissioner of health shall review and make decisions regarding reconsideration requests, including whether to grant variances, according to the procedures and criteria in this chapter. The commissioner of health shall inform the requesting individual and the Department of Human Services of the commissioner of health's decision regarding the reconsideration. The commissioner of health's decision to grant or deny a reconsideration of a disqualification is a final administrative agency action.\n(a) The commissioner shall conduct background studies of individuals working in secure and nonsecure children's residential facilities, juvenile detention facilities, and foster residence settings, whether or not the individual will have direct contact, as defined under section 245C.02, subdivision 11, with persons served in the facilities or settings.\n(b) A clerk or administrator of any court, the Bureau of Criminal Apprehension, a prosecuting attorney, a county sheriff, or a chief of a local police department shall assist in conducting background studies by providing the commissioner of human services or the commissioner's representative all criminal conviction data available from local and state criminal history record repositories related to applicants, operators, all persons living in a household, and all staff of any facility subject to background studies under this subdivision.\n(c) For the purpose of this subdivision, the term \"secure and nonsecure residential facility and detention facility\" includes programs licensed or certified under section 241.021, subdivision 2.\n(d) If an individual is disqualified, the Department of Human Services shall notify the disqualified individual and the facility in which the disqualified individual provides services of the disqualification and shall inform the disqualified individual of the right to request a reconsideration of the disqualification by submitting the request to the Department of Corrections.\n(e) The commissioner of corrections shall review and make decisions regarding reconsideration requests, including whether to grant variances, according to the procedures and criteria in this chapter. The commissioner of corrections shall inform the requesting individual and the Department of Human Services of the commissioner of corrections' decision regarding the reconsideration. The commissioner of corrections' decision to grant or deny a reconsideration of a disqualification is the final administrative agency action.\n(a) The commissioner shall conduct a background study on:\n(1) the person or persons applying for a license;\n(2) an individual age 13 and over, living in the household where the licensed program will be provided, who is not receiving licensed services from the program;\n(3) current or prospective employees of the applicant or license holder who will have direct contact with persons served by the facility, agency, or program;\n(4) volunteers or student volunteers who will have direct contact with persons served by the program to provide program services if the contact is not under the continuous, direct supervision by an individual listed in clause (1) or (3);\n(5) an individual age ten to 12 living in the household where the licensed services will be provided when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15;\n(6) an individual who, without providing direct contact services at a licensed program, may have unsupervised access to children receiving services from a program, when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15;\n(7) all controlling individuals as defined in section 142B.01, subdivision 11; and\n(8) notwithstanding the other requirements in this subdivision, child care background study subjects as defined in section 245C.02, subdivision 6a.\n(b) For child foster care when the license holder resides in the home where foster care services are provided, a short-term substitute caregiver providing direct contact services for a child for less than 72 hours of continuous care is not required to receive a background study under this chapter.\n(c) This subdivision applies to the following programs:\n(1) a child foster care program licensed or seeking a license under chapter 142B;\n(2) a child care center licensed or seeking a license under chapter 142B;\n(3) a license-exempt child care center certified under chapter 142C;\n(4) a legal nonlicensed child care provider authorized under chapter 142E; or\n(5) a Head Start program.\n(a) The commissioner shall conduct background studies of any individual who provides direct contact, as defined in section 245C.02, subdivision 11, for services specified in the federally approved home and community-based waiver plans under section 256B.4912. The individual studied must meet the requirements of this chapter prior to providing waiver services and as part of ongoing enrollment.\n(b) The requirements in paragraph (a) apply to consumer-directed community supports under section 256B.4911.\nThe commissioner shall conduct background studies for each child care background study subject as defined in section 245C.02, subdivision 6a, as required by sections 142C.09 and 142E.16.\nThe commissioner shall conduct background studies of all direct service providers and volunteers for children's therapeutic services and supports providers under section 256B.0943.\nMS 2020 [Repealed by amendment, 1Sp2021 c 7 art 2 s 17]\nIndividuals affiliated with Community First Services and Supports (CFSS) agency-providers and Financial Management Services (FMS) providers enrolled to provide CFSS services under the medical assistance program must meet the following requirements:\n(1) owners who have a five percent interest or more and all managing employees are subject to a background study under this chapter. This requirement applies to currently enrolled providers and agencies seeking enrollment. \"Managing employee\" has the meaning given in Code of Federal Regulations, title 42, section 455.101. An organization is barred from enrollment if:\n(i) the organization has not initiated background studies of owners and managing employees; or\n(ii) the organization has initiated background studies of owners and managing employees and the commissioner has sent the organization a notice that an owner or managing employee of the organization has been disqualified under section 245C.14 and the owner or managing employee has not received a set aside of the disqualification under section 245C.22;\n(2) a background study must be initiated and completed for all staff who will have direct contact with the participant to provide worker training and development; and\n(3) a background study must be initiated and completed for all support workers.\nThe support worker for a participant may enroll with a different Community First Services and Supports (CFSS) agency-provider or Financial Management Services (FMS) provider upon initiation, rather than completion, of a new background study according to this chapter if:\n(1) the commissioner determines that the support worker's change in enrollment or affiliation is necessary to ensure continuity of services and to protect the health and safety of the participant;\n(2) the chosen agency-provider or FMS provider has been continuously enrolled as a CFSS agency-provider or FMS provider for at least two years or since the inception of the CFSS program, whichever is shorter;\n(3) the participant served by the support worker chooses to transfer to the CFSS agency-provider or the FMS provider to which the support worker is transferring;\n(4) the support worker has been continuously enrolled with the former CFSS agency-provider or FMS provider since the support worker's last background study was completed; and\n(5) the support worker continues to meet the requirements of section 256B.85, subdivision 16, notwithstanding paragraph (a), clause (1).\n(a) The commissioner shall conduct background studies of the following individuals who provide services under section 256I.04:\n(1) controlling individuals as defined in section 245A.02;\n(2) managerial officials as defined in section 245A.02; and\n(3) all employees and volunteers of the establishment who have direct contact with recipients or who have unsupervised access to recipients, recipients' personal property, or recipients' private data.\n(b) The provider of housing support must comply with all requirements for entities initiating background studies under this chapter.\n(c) A provider of housing support must demonstrate that all individuals who are required to have a background study according to paragraph (a) have a notice stating that:\n(1) the individual is not disqualified under section 245C.14; or\n(2) the individual is disqualified and the individual has been issued a set aside of the disqualification for the setting under section 245C.22.\nMS 2020 [Repealed by amendment, 1Sp2021 c 7 art 2 s 17]\n(a) The commissioner shall conduct background studies of the following individuals who provide special transportation services under section 174.30:\n(1) each person with a direct or indirect ownership interest of five percent or higher in a transportation service provider;\n(2) each controlling individual as defined under section 245A.02;\n(3) a managerial official as defined in section 245A.02;\n(4) each driver employed by the transportation service provider;\n(5) each individual employed by the transportation service provider to assist a passenger during transport; and\n(6) each employee of the transportation service agency who provides administrative support, including an employee who:\n(i) may have face-to-face contact with or access to passengers, passengers' personal property, or passengers' private data;\n(ii) performs any scheduling or dispatching tasks; or\n(iii) performs any billing activities.\n(b) When a local or contracted agency is authorizing a ride under section 256B.0625, subdivision 17, by a volunteer driver, and the agency authorizing the ride has a reason to believe that the volunteer driver has a history that would disqualify the volunteer driver or that may pose a risk to the health or safety of passengers, the agency may initiate a background study that shall be completed according to this chapter using the commissioner of human services' online NETStudy system, or by contacting the Department of Human Services background study division for assistance. The agency that initiates the background study under this paragraph shall be responsible for providing the volunteer driver with the privacy notice required by section 245C.05, subdivision 2c, and with the payment for the background study required by section 245C.10 before the background study is completed.\nThe commissioner shall conduct background studies of any provider of housing stabilization services required by section 256B.051 to have a background study completed under this chapter.\nFor completed background studies to comply with a Tribal organization's licensing requirements for individuals affiliated with a Tribally licensed nursing facility, the commissioner shall obtain state and national criminal history data.\nThe commissioner shall conduct background studies according to this chapter when initiated by an early intensive developmental and behavioral intervention provider under section 256B.0949.",
	"repealed": false
}