{
	"id": "260C.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.635",
	"title": "260C.635 EFFECT OF ADOPTION.",
	"text": "(a) Upon adoption, the adopted child becomes the legal child of the adopting parent and the adopting parent becomes the legal parent of the child with all the rights and duties between them of a birth parent and child.\n(b) The child shall inherit from the adoptive parent and the adoptive parent's relatives the same as though the child were the birth child of the parent, and in case of the child's death intestate, the adoptive parent and the adoptive parent's relatives shall inherit the child's estate as if the child had been the adoptive parent's birth child.\n(c) After a decree of adoption is entered, the birth parents or previous legal parents of the child shall be relieved of all parental responsibilities for the child except child support that has accrued to the date of the order for guardianship to the commissioner which continues to be due and owing. The child's birth or previous legal parent shall not exercise or have any rights over the adopted child or the adopted child's property, person, privacy, or reputation.\n(d) The adopted child shall not owe the birth parents or the birth parent's relatives any legal duty nor shall the adopted child inherit from the birth parents or kindred unless otherwise provided for in a will of the birth parent or kindred.\n(e) Upon adoption, the court shall complete a certificate of adoption form and mail the form to the Office of Vital Records at the Minnesota Department of Health. Upon receiving the certificate of adoption, the state registrar shall register a replacement vital record in the new name of the adopted child as required under section 144.218.\nNotwithstanding the provisions of subdivision 1, the adoption of a child whose birth parent or parents are enrolled in an American Indian tribe shall not change the child's enrollment in that tribe.\nThis section does not prohibit birth parents, relatives, birth or legal siblings, and adoptive parents from entering a communication or contact agreement under section 260C.619.",
	"repealed": false
}