{
	"id": "256B.0561",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0561",
	"title": "256B.0561 PERIODIC DATA MATCHING TO EVALUATE CONTINUED ELIGIBILITY.",
	"text": "For the purposes of this section, \"periodic data matching\" means obtaining updated electronic information about medical assistance and MinnesotaCare recipients on the MNsure information system from federal and state data sources accessible to the MNsure information system and using that data to evaluate continued eligibility between regularly scheduled renewals.\n(a) The commissioner shall conduct periodic data matching to identify recipients who, based on available electronic data, may not meet eligibility criteria for the public health care program in which the recipient is enrolled. The commissioner shall conduct data matching for medical assistance or MinnesotaCare recipients at least once during a recipient's 12-month period of eligibility.\n(b) If data matching indicates a recipient may no longer qualify for medical assistance or MinnesotaCare, the commissioner must notify the recipient and allow the recipient no more than 30 days to confirm the information obtained through the periodic data matching or provide a reasonable explanation for the discrepancy to the state or county agency directly responsible for the recipient's case. If a recipient does not respond within the advance notice period or does not respond with information that demonstrates eligibility or provides a reasonable explanation for the discrepancy within the 30-day time period, the commissioner shall terminate the recipient's eligibility in the manner provided for by the laws and regulations governing the health care program for which the recipient has been identified as being ineligible.\n(c) The commissioner shall not terminate eligibility for a recipient who is cooperating with the requirements of paragraph (b) and needs additional time to provide information in response to the notification.\n(d) A recipient whose eligibility was terminated according to paragraph (b) may be eligible for medical assistance no earlier than the first day of the month in which the recipient provides information that demonstrates the recipient's eligibility.\n(e) Any termination of eligibility for benefits under this section may be appealed as provided for in sections 256.045 to 256.0451, and the laws governing the health care programs for which eligibility is terminated.\nThe commissioner shall include in all communications with recipients affected by the periodic data matching the following contact information for: (1) the state or county agency directly responsible for the recipient's case; and (2) consumer assistance partners who may be able to assist the recipient in the periodic data matching process.\n(a) By September 1, 2019, and each September 1 thereafter, the commissioner shall submit a report to the chairs and ranking minority members of the house and senate committees with jurisdiction over human services finance that includes the number of cases affected by periodic data matching under this section, the number of recipients identified as possibly ineligible as a result of a periodic data match, and the number of recipients whose eligibility was terminated as a result of a periodic data match. The report must also specify, for recipients whose eligibility was terminated, how many cases were closed due to failure to cooperate.\n(b) This subdivision expires January 1, 2027.\nThe commissioner shall ensure that the implementation of this section complies with the Affordable Care Act, including the state's maintenance of effort requirements. The commissioner shall not terminate eligibility under this section if eligibility terminations would not conform with federal requirements, including requirements not yet codified in Minnesota Statutes.",
	"repealed": false
}