{
	"id": "466.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/466.04",
	"title": "466.04 MAXIMUM LIABILITY.",
	"text": "(a) Liability of any municipality on any claim within the scope of sections 466.01 to 466.15 shall not exceed:\n(1) $300,000 when the claim is one for death by wrongful act or omission and $300,000 to any claimant in any other case, for claims arising before January 1, 2008;\n(2) $400,000 when the claim is one for death by wrongful act or omission and $400,000 to any claimant in any other case, for claims arising on or after January 1, 2008, and before July 1, 2009;\n(3) $500,000 when the claim is one for death by wrongful act or omission and $500,000 to any claimant in any other case, for claims arising on or after July 1, 2009;\n(4) $750,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 1998, and before January 1, 2000;\n(5) $1,000,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 2000, and before January 1, 2008;\n(6) $1,200,000 for any number of claims arising out of a single occurrence, for claims arising on or after January 1, 2008, and before July 1, 2009;\n(7) $1,500,000 for any number of claims arising out of a single occurrence, for claims arising on or after July 1, 2009;\n(8) twice the limits provided in clauses (1) to (7) when the claim arises out of the release or threatened release of a hazardous substance, whether the claim is brought under sections 115B.01 to 115B.15 or under any other law; or\n(9) $1,000,000 for any number of claims arising out of a single occurrence, if the claim involves a nonprofit organization engaged in or administering outdoor recreational activities funded in whole or in part by a municipality or operating under the authorization of a permit issued by a municipality.\n(b) No award for damages on any such claim shall include punitive damages.\nThe liability of an officer or an employee of any municipality for a tort arising out of an alleged act or omission occurring in the performance of duty shall not exceed the limits set forth in subdivision 1, unless the officer or employee provides professional services and also is employed in the profession for compensation by a person or persons other than the municipality.\nThe total liability of the municipality on a claim against it and against its officers or employees arising out of a single occurrence shall not exceed the limits set forth in subdivision 1.\nThe limitation imposed by this section on individual claimants includes damages claimed for loss of services or loss of support arising out of the same tort.\nWhere the amount awarded to or settled upon multiple claimants exceeds the applicable limit under subdivision 1, paragraph (a), clauses (4) to (9), any party may apply to any district court to apportion to each claimant a proper share of the total amount limited by subdivision 1. The share apportioned each claimant shall be in the proportion that the ratio of the award or settlement made to each bears to the aggregate awards and settlements for all claims arising out of the occurrence.",
	"repealed": false
}