{
	"id": "446.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/446.04",
	"title": "446.04 FIRST CLASS CITIES; LOCAL IMPROVEMENT CERTIFICATES.",
	"text": "The council of each city of the first class may, for the purposes designated in subdivision 4, issue from time to time, as needed, the negotiable certificates of indebtedness of such city to an amount not exceeding $300,000 in any one year. The certificates of indebtedness shall be made in such denomination and payable at such places and at such times, not more than five years from the date thereof, as may be deemed best, and shall bear interest at a rate not to exceed the maximum rate specified in chapter 475 payable semiannually with interest coupons attached, payable at such place or places as shall be designated therein. The council may negotiate and sell such negotiable certificates of indebtedness, from time to time as needed, at private or public sale, as the council determines. No such certificates shall be sold for a less amount than the par value thereof and accrued interest thereon.\nNot more than $100,000 of any yearly issue of such certificates shall be made payable in any one year.\nThe negotiable certificates of indebtedness authorized by subdivision 1 may be issued and sold by any such city notwithstanding any limitation contained in the charter of such city, or in any law of this state prescribing or fixing any limit upon the bonded indebtedness of such city, but the full faith and credit of any such city shall at all times be pledged for the payment of any negotiable certificates of indebtedness issued under Laws 1921, chapter 299, as amended, and for the payment of current interest thereon, and the said city council or common council, shall each year include in the tax levy a sufficient amount for the payment of such interest as it accrues, and for the accumulation of a sinking fund for the redemption of such certificates of indebtedness at their maturity.\nAll negotiable certificates of indebtedness issued under authority of Laws 1921, chapter 299, as amended, shall be sealed with the seal of the city issuing the same, signed by the mayor and attested by the city clerk and countersigned by the city comptroller or city auditor of such city, except that the signature to the coupons attached to such negotiable certificates of indebtedness, if any, may be lithographed thereon. The sale of such negotiable certificates of indebtedness shall be made in the manner and in the proportion of the whole amount authorized to be issued in any one year by Laws 1921, chapter 299, as amended, and at such times, as may be determined by said city council or common council.\nThe proceeds of any and all of the negotiable certificates of indebtedness issued and sold under authority of Laws 1921, chapter 299, as amended, shall be placed in the city treasury of the city issuing the same, and shall constitute a special fund, and shall be issued only for the purpose of paying such portion of local public improvements in such city, as will not sustain a special assessment, to-wit:\n(1) laying, relaying or extending any main trunk or storm sewer, or constructing, reconstructing, or replacing any main trunk, storm sewer or culvert;\n(2) paving, repaving or macadamizing any street, lane, alley or street intersection;\n(3) constructing, reconstructing, laying and place of any curb;\n(4) constructing or reconstructing any gutter or gutters;\n(5) constructing, reconstructing, replacing, decking, redecking, or repairing any railroad bridge, railroad viaduct, railroad underpass, or the installation of any safety device at any railroad grade crossing, whenever the cost thereof is apportioned against such city under any statute or rule of law of this state making it obligatory upon such city to pay such apportionment;\n(6) installing automatic traffic-control signals for street intersections.\nThe proceeds of said negotiable certificates of indebtedness or any thereof shall not be issued for any other purpose than those herein specified.\nThe authority conferred by Laws 1921, chapter 299, as amended, with respect to the issuance, sale, negotiation and delivery of certificates in the amount of not exceeding $300,000 in any one year, shall continue until and unless otherwise hereafter provided by law.\nLaws 1921, chapter 299, as amended, shall only apply to such cities as are or may be governed by a charter adopted pursuant to Section 36, Article 4 of the constitution of this state; except that it shall not apply to any city of the first class having a board of estimate and taxation authorized to issue bonds as provided by Chapter 252, Laws of Minnesota for 1919.\nThe powers granted in Laws 1921, chapter 299, as amended, are in addition to all existing powers of such cities.",
	"repealed": false
}