{
	"id": "325F.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.60",
	"title": "325F.60 INVOICE.",
	"text": "Notwithstanding the provisions of section 325F.56, subdivision 2, for the purpose of this section \"repair\" means work of any value performed under a manufacturer's warranty, a service contract, or an insurance policy; or any repair work performed for a total value of more than $50, including the price of parts and materials, to restore a malfunctioning, defective, or worn motor vehicle, appliance, or dwelling place used primarily for personal, family, or household purposes and not primarily for business or agricultural purposes. \"Repairs\" do not include service calls or estimates. Upon completion of repairs, a shop shall provide the customer with a copy of a dated invoice for the repairs performed. If the customer receives a repaired motor vehicle or appliance without face to face contact with the shop, the shop shall mail the invoice to the customer within two business days after the shop has knowledge of removal of the item. The invoice shall contain the following information:\n(a) the date of repair;\n(b) the name and address of the shop;\n(c) a description of all repairs performed;\n(d) an itemization of the charges for parts, materials, labor, tax, delivery, storage or care, and any other charges assessed against the customer;\n(e) a notation specifying which parts, if any, are new, used, rebuilt, reconditioned, or replated if that information is known by the shop. If parts, other than window glass, used in the repair are new parts, the invoice must indicate whether or not those parts are original equipment parts;\n(f) a statement of any charge for storage or care, a service call or for making an estimate;\n(g) a statement of the odometer reading at the time a motor vehicle is presented for repairs; and\n(h) a statement of the symptoms, as described by the customer, for which the repairs were sought.\nA written estimate may be used as an invoice if the required invoice information is written on the face of the estimate.",
	"repealed": false
}