{
	"id": "469.1734",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1734",
	"title": "469.1734 TAX INCENTIVES OUTSIDE ZONES.",
	"text": "A city with authority to establish a border city development zone under section 469.1731 may grant the tax incentives provided by this section. This authority applies only to projects located outside of a zone, except as provided in subdivision 6.\nFor purposes of this section, \"qualifying business\" means the business conducted by a corporation, partnership, or individual doing business from a fixed location within the border city but located outside of the border city development zone.\n(a) A city may grant a partial or complete exemption from property taxation of all buildings, structures, fixtures, and improvements used in or necessary to a qualifying business for a period not exceeding five taxes payable years. A partial exemption must be stated as a percentage of the total ad valorem taxes assessed against the property.\n(b) In addition to, or in lieu of, a property tax exemption under paragraph (a), a city may establish an amount due as payments in lieu of ad valorem taxes on buildings, structures, fixtures, and improvements used by the qualifying business. The city council shall designate the amount of the payments for each year and the beginning year and the concluding year for payments in lieu of taxes. The option to make payments in lieu of taxes under this section is limited to 20 consecutive taxes payable years for any qualifying business. To establish the amount of payments in lieu of taxes, the city council may use actual or estimated levels of assessment and taxation or may designate different amounts of payments in lieu of other taxes in different years to recognize future expansion plans of a qualifying business or other considerations. The payments in lieu shall be collected and distributed in the same manner as ad valorem taxes.\n(c) The city council must determine whether granting the exemption or payments in lieu of taxes, or both, is necessary to enable a business to expand in the city or to attract a business to the city and is in the best interest of the city. If it so determines, the city must give its approval.\nMS 2000 [Repealed, 1Sp2001 c 5 art 9 s 30]\n(a) To provide a tax incentive for new industry in border cities, a corporation may be allowed a credit against the tax imposed by section 290.02. The commissioner shall prescribe the method in which the credit may be claimed. This may include allowing the credit only as a separately processed claim for refund.\n(b) The credit equals one percent of the wages and salaries paid by the taxpayer during the taxable year for employees whose principal place of work is located in a border city but outside of a zone designated under section 469.1731. The credit applies for the first three taxable years of the operation of the corporation in the border city. In the fourth and fifth taxable years of the operation of the corporation in the border city, the credit equals 0.5 percent of the wages and salaries. After the fifth year, no credit is allowed. The city shall determine the amount of wages that qualify for the credit and issue tax credit certificates in the correct amount.\n(c) The credit under this subdivision applies only to a corporate enterprise engaged in assembling, fabricating, manufacturing, mixing, or processing of any agricultural, mineral, or manufactured product or combinations of them.\n(d) The credit allowed under this subdivision may not exceed the lesser of:\n(1) the tax liability of the taxpayer for the taxable year; or\n(2) the amount of the tax credit certificates received by the taxpayer from the city, less any tax credit certificates used under subdivision 6.\n(a) The gross receipts from the sale of machinery and equipment and repair parts are exempt from taxation under chapter 297A, if the machinery and equipment:\n(1) are used in connection with a trade or business;\n(2) are placed in service in a city that is authorized to designate a zone under section 469.1731, regardless of whether the machinery and equipment are used in a zone; and\n(3) have a useful life of 12 months or more.\n(b) The gross receipts from the sale of construction materials are exempt, if they are used to construct:\n(1) a facility for use in a trade or business located in a city that is authorized to designate a zone under section 469.1731, regardless of whether the facility is located in a zone; or\n(2) housing that is located in a zone.\nThe exemptions under this paragraph apply regardless of whether the purchase is made by the owner, the user, or a contractor.\n(c) A purchaser may claim an exemption under this subdivision for tax on the purchases up to, but not exceeding:\n(1) the amount of the tax credit certificates received from the city, less\n(2) any tax credit certificates used under the provisions of subdivision 5.\n(d) The tax on sales of items exempted under this subdivision shall be imposed and collected as if the applicable rate under section 297A.62 applied. Upon application by the purchaser, on forms prescribed by the commissioner, a refund equal to the tax paid shall be paid to the purchaser. The application must include sufficient information to permit the commissioner to verify the sales tax paid and the eligibility of the claimant to receive the credit. No more than two applications for refunds may be filed under this subdivision in a calendar year. The provisions of section 289A.40 apply to the refunds payable under this subdivision. There is annually appropriated to the commissioner of revenue the amount required to make the refunds, which must be deducted from the amount of the city's allocation under section 469.169, subdivision 12, that remains available and its limitation under section 469.1735.\n(e) The amount to be refunded shall bear interest at the rate in section 270C.405 from 90 days after the refund claim is filed with the commissioner.\n(a) Before an exemption or other concession is granted under subdivision 3, the procedure under this subdivision applies.\n(b) Unless the city council determines that no existing business within the city would be a potential competitor of the project, the project operator shall publish two notices to competitors of the application of the tax exemption or payments in lieu in the official newspaper of the city. The city shall prescribe the form of the notice. The two notices must be published at least one week apart. The publications must be completed not less than 15 days nor more than 30 days before the city council approves the tax exemption or payments in lieu of taxes.",
	"repealed": false
}