{
	"id": "136A.653",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.653",
	"title": "136A.653 EXEMPTIONS.",
	"text": "A school that seeks an exemption under this section from the provisions of sections 136A.61 to 136A.71 must apply to the office to establish that the school meets the requirements of an exemption. An exemption expires two years from the date of approval or when a school adds a new program or makes a modification equal to or greater than 25 percent to an existing educational program. If a school is reapplying for an exemption, the application must be submitted to the office 90 days before the current exemption expires. This exemption shall not extend to any school that uses any publication or advertisement that is not truthful and gives any false, fraudulent, deceptive, inaccurate, or misleading impressions about the school or its personnel, programs, services, or occupational opportunities for graduates for promotion and student recruitment. Exemptions denied under this section are subject to appeal under section 136A.65, subdivision 8, paragraph (c). If an appeal is initiated, the denial of the exemption is not effective until the final determination of the appeal, unless immediate effect is ordered by the court.\nA school that is subject to licensing by the office under sections 136A.82 to 136A.834 is exempt from the provisions of sections 136A.61 to 136A.71. The determination of the office as to whether a particular school is subject to regulation under sections 136A.82 to 136A.834 is final for the purposes of this exemption.\nA Tribal college is exempted from the provisions of sections 136A.61 to 136A.71. A Tribal college that is exempt may voluntarily waive its exception by registering under section 136A.63. Upon registration, the Tribal college is subject to all applicable requirements of sections 136A.61 to 136A.71.\nEducational programs which are sponsored by a bona fide and nonprofit trade, labor, business, professional or fraternal organization, which programs are conducted solely for that organization's membership or for the members of the particular industries or professions served by that organization, and which are not available to the public on a fee basis, are exempted from the provisions of sections 136A.61 to 136A.71.\nEducational programs which are sponsored by a business firm for the training of its employees or the employees of other business firms with which it has contracted to provide educational services at no cost to the employees are exempted from the provisions of sections 136A.61 to 136A.71.\nA school, including a school using an online platform service, offering training, courses, or programs is exempt from sections 136A.61 to 136A.71, to the extent tuition, fees, and any other charges for a student to participate do not exceed two percent of the most recent average undergraduate tuition and required fees as of January 1 of the current year charged for full-time students at all degree-granting institutions as published annually by the United States Department of Education as of January 1 of each year. To qualify for an exemption, a school or online platform service must prominently display a notice comparable to the following: \"IMPORTANT: Each educational institution makes its own decision regarding whether to accept completed coursework for credit. Check with your university or college.\"\nAny school or program exempted from the provisions of sections 136A.61 to 136A.71 by the provisions of this section may voluntarily submit to the provisions of those sections.\n(a) A postsecondary institution accredited by the Higher Learning Commission or its successor with its primary physical location in Minnesota is exempt from the provisions of sections 136A.61 to 136A.71, including related fees, when it creates new or modifies existing:\n(1) majors, minors, concentrations, specializations, and areas of emphasis within approved degrees;\n(2) nondegree programs within approved degrees;\n(3) underlying curriculum or courses;\n(4) modes of delivery; and\n(5) locations.\n(b) The institution must annually notify the commissioner of the exempt actions listed in paragraph (a) and, upon the commissioner's request, must provide additional information about the action.\n(c) The institution must notify the commissioner within 60 days of a program closing.\n(d) Nothing in this subdivision exempts an institution from the annual registration and degree approval requirements of sections 136A.61 to 136A.71.",
	"repealed": false
}