{
	"id": "383B.903",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.903",
	"title": "383B.903 BOARD.",
	"text": "The corporation shall be governed by a board of directors consisting of between 11 and 15 directors. Two of the directors on the board of the corporation must be county commissioners currently serving as elected officials on the county board who are chosen and may be removed by a majority vote of the county board.\nThe term of office for directors, rules governing quorum, and manner of acting for the board of directors must be specified in the bylaws of the corporation which shall be approved by the county board, except that:\n(1) a vote of a majority of the board shall be required to hire or discharge the corporation's administrator, to approve the annual budget, and for any action which requires subsequent approval by the county board as specified in section 383B.908; and\n(2) directors of the board of directors or any committee or advisory assembly or council appointed by the board of directors may participate in a meeting by means of telephone conference or similar communications equipment which enables all persons participating in the meeting to hear each other during the conduct of that meeting. Participation shall be considered presence in person at the meeting for purposes of notice and quorum requirements as specified in the bylaws.\nThe county board shall appoint the initial board of the corporation. Thereafter, the county board shall appoint directors of the corporation by slate to open positions due to the completion of a director's term as specified in the bylaws of the corporation. The slate shall be nominated by a committee of the board of the corporation. The board of the corporation may by majority vote appoint a board member to fill a vacancy on the board occurring prior to the completion of the term, provided the newly appointed board member is submitted to the county board for approval when the next slate of directors is submitted to the county board for approval.\nMembers of the board shall possess a high degree of experience and knowledge in relevant fields and possess a high degree of interest in the corporation and support for its mission. Members shall be appointed based in part on the objective of ensuring that the corporation includes diverse and beneficial perspectives and experience including, but not limited to, those of medical or other health professionals, urban, cultural and ethnic perspectives of the population served by the corporation, business management, law, finance, health sector employees, public health, serving the uninsured, health professional training, and the patient or consumer perspective. The corporation shall provide a public announcement of vacancies on the board of the corporation in the manner normally used by Hennepin County to provide public notice of open appointments.\nA director who is not a county commissioner may be removed without cause by a two-thirds majority vote of the board of the corporation. The county board may remove any board member for violation of the director's ethical and legal duties as a board member as specified in section 383B.905 or for the repeated failure to act in the best interests of the corporation. In addition, the county board may remove the corporate board in its entirety as specified in section 383B.908, subdivision 7.",
	"repealed": false
}