{
	"id": "629.342",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.342",
	"title": "629.342 LAW ENFORCEMENT POLICIES; DOMESTIC ABUSE ARRESTS.",
	"text": "For purposes of this section, \"domestic abuse\" has the meaning given in section 518B.01, subdivision 2.\n(a) Each law enforcement agency shall develop, adopt, and implement a written policy regarding arrest procedures for domestic abuse incidents. In the development of a policy, each law enforcement agency shall consult with domestic abuse advocates, community organizations, and other law enforcement agencies with expertise in the recognition and handling of domestic abuse incidents. The policy shall discourage dual arrests, include consideration of whether one of the parties acted in self defense, and provide guidance to officers concerning instances in which officers should remain at the scene of a domestic abuse incident until the likelihood of further imminent violence has been eliminated.\n(b) The Bureau of Criminal Apprehension and the Board of Peace Officer Standards and Training, in consultation with the Minnesota Chiefs of Police Association, the Minnesota Sheriffs Association, the Minnesota Police and Peace Officers Association, and a domestic violence statewide coalition shall update the written policy regarding arrest procedures for domestic abuse incidents for use by local law enforcement agencies. Each law enforcement agency may adopt the model policy in lieu of developing its own policy under the provisions of paragraph (a).\nIf a law enforcement officer does not make an arrest when the officer has probable cause to believe that a person is committing or has committed domestic abuse or violated an order for protection, the officer shall provide immediate assistance to the victim. Assistance includes:\n(1) assisting the victim in obtaining necessary medical treatment; and\n(2) providing the victim with the notice of rights under section 629.341, subdivision 3.\nA peace officer acting in good faith and exercising due care in providing assistance to a victim pursuant to subdivision 3 is immune from civil liability that might result from the officer's action.",
	"repealed": false
}