{
	"id": "204C.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.28",
	"title": "204C.28 ELECTION NIGHT; DUTIES OF COUNTY AUDITORS AND MUNICIPAL CLERKS.",
	"text": "(a) Every county auditor must remain at the auditor's office to receive delivery of the returns, to permit public inspection of the summary statements, and to tabulate the votes until all have been tabulated and the results made known, or until 24 hours have elapsed since the end of the hours for voting, whichever occurs first. Every county auditor must, in the presence of the municipal clerk or the election judges who deliver the returns, make a record of all materials delivered, the time of delivery, and the names of the municipal clerk or election judges who made delivery. The record must include the number of ballots delivered to the precinct, as certified by section 204B.28, and the total number of ballots returned, as certified by the election judges under section 204C.24. A discrepancy between the number of ballots delivered to the precinct and the number of total ballots returned by election judges that cannot be reconciled by taking into account the adjustments made by the election judge counts and any unofficial ballots must be noted, but does not necessarily require disqualification of the votes from that precinct or invalidation of the election. The county auditor must file the record and all envelopes containing ballots in a safe and secure place with envelope seals unbroken. Access to the record and ballots must be strictly controlled. Accountability and a record of access must be maintained by the county auditor during the period for contesting elections or, if a contest is filed, until the contest has been finally determined. Thereafter, the record must be retained in the auditor's office for the same period as the ballots as provided in section 204B.40.\n(b) The county auditor must file all envelopes containing ballots in a safe place with seals unbroken. If the envelopes are opened by proper authority for examination or recount as specifically authorized by a court or statute, the county auditor must have the envelopes sealed again and signed by the individuals who made the inspection or recount. The envelopes may be opened by the county auditor if necessary to procure election returns that the election judges inadvertently may have sealed in the envelopes with the ballots. In that case, the envelopes must be sealed again and signed in the same manner as otherwise provided in this subdivision.\nThe clerk of every first, second, and third class city shall remain at the clerk's office to receive delivery of returns, or until 24 hours have elapsed since the end of the hours for voting, whichever occurs first. The clerk of every first class city shall keep a book in which, in the presence of the election judges or other individuals who deliver the returns, the clerk shall make a record of all materials delivered, the time of delivery, and the names of the election judges or other individuals who made delivery. The record must include the number of ballots delivered to the precinct, as certified by section 204B.28, and the total number of ballots returned, as certified by the election judges under section 204C.24. A discrepancy between the number of ballots delivered to the precinct and the number of total ballots returned by election judges that cannot be reconciled by taking into account the adjustments made by the election judge counts and any unofficial ballots must be noted, but does not necessarily require disqualification of the votes from that precinct or invalidation of the election. The book shall be retained in the clerk's office for the same period as the ballots as provided in section 204B.40.\nAt a school district election held in conjunction with a state election, the county auditor or municipal clerk shall deliver the summary statements of the school district election returns, all unused and spoiled school district ballots, and the envelope containing the school district ballots from each precinct to the clerk of the appropriate school district within 48 hours after the polls close.",
	"repealed": false
}