{
	"id": "169.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.011",
	"title": "169.011 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section shall have the meanings ascribed to them.\n(a) \"All-electric vehicle\" means an electric vehicle that is solely able to be powered by an electric motor drawing current from rechargeable storage batteries, fuel cells, or other portable sources of electrical current.\n(b) All-electric vehicle excludes a plug-in hybrid electric vehicle.\n\"Alleyway\" means a private or public passage or way located in a municipality and which (1) is less than the usual width of a street, (2) may be open to but is not designed primarily for general vehicular traffic, (3) intersects or opens to a street, and (4) is primarily used for the ingress and egress or other convenience of two or more owners of abutting real properties.\n\"Authorized emergency vehicle\" means any of the following vehicles when equipped and identified according to law: (1) a vehicle of a fire department; (2) a publicly owned police vehicle or a privately owned vehicle used by a police officer for police work under agreement, express or implied, with the local authority to which the officer is responsible; (3) a vehicle of a licensed land emergency ambulance service, whether publicly or privately owned; (4) an emergency vehicle of a municipal department or a public service corporation, approved by the commissioner of public safety or the chief of police of a municipality; (5) any volunteer rescue squad operating pursuant to Laws 1959, chapter 53; (6) a vehicle designated as an authorized emergency vehicle upon a finding by the commissioner of public safety that designation of that vehicle is necessary to the preservation of life or property or to the execution of emergency governmental functions.\n(a) \"Autocycle\" means a motorcycle that:\n(1) has three wheels in contact with the ground;\n(2) is designed with seating that does not require operators or any occupants to straddle or sit astride it;\n(3) has a steering wheel;\n(4) is equipped with antilock brakes; and\n(5) is originally manufactured to meet federal motor vehicle safety standards for motorcycles in Code of Federal Regulations, title 49, part 571, and successor requirements.\n(b) An autocycle does not include a roadable aircraft as defined in subdivision 67a.\n(a) \"Bicycle\" means every device capable of being propelled solely by human power upon which any person may ride, having two tandem wheels, and including any device generally recognized as a bicycle though equipped with two front or rear wheels. Bicycle includes an electric-assisted bicycle, as defined in subdivision 27.\n(b) \"Bicycle\" does not include scooters, motorized foot scooters, or similar devices.\n\"Bicycle lane\" means a portion of a roadway designed for exclusive or preferential use by persons using bicycles. Bicycle lanes are to be distinguished from the portion of the roadway used for motor vehicle traffic by physical barrier, striping, marking, or other similar device.\n\"Bicycle path\" means a bicycle facility designed for exclusive or preferential use by persons using bicycles and constructed or developed separately from the roadway or shoulder.\nThe term \"bicycle route\" means a roadway or shoulder signed to encourage bicycle use.\n\"Bicycle trail\" means a bicycle route or bicycle path developed by the commissioner of natural resources under section 85.016.\n\"Bikeway\" means a bicycle lane, bicycle path, bicycle route, shared use path, or similar bicycle facility, regardless of whether it is designed for the exclusive use of bicycles or for shared use with other transportation modes.\n\"Bug deflector\" means a nonilluminated, transparent device attached to the hood of a motor vehicle so as to deflect the air stream.\n\"Bus\" means every motor vehicle designed for carrying more than 15 passengers including the driver and used for the transportation of persons.\n\"Bus pool\" means a prearranged ride-sharing arrangement in which a group of persons travel together on a regular basis in a bus, especially to and from their place of employment or to and from a transit stop authorized by a local transit authority.\n\"Business district\" means the territory contiguous to and including a highway when 50 percent or more of the frontage thereon for a distance of 300 feet or more is occupied by buildings in use for business.\n\"Car pool\" means a prearranged ride-sharing arrangement in which two or more persons travel together on a regular basis in an automobile, especially to and from their place of employment or to and from a transit stop authorized by a local transit authority.\n\"Cellular phone\" means a cellular, analog, wireless, or digital telephone capable of sending or receiving telephone or text messages without an access line for service.\n\"Class 1 electric-assisted bicycle\" means an electric-assisted bicycle equipped with an electric motor that provides assistance only when the rider is pedaling and ceases to provide assistance when the bicycle reaches the speed of 20 miles per hour.\n\"Class 2 electric-assisted bicycle\" means an electric-assisted bicycle equipped with an electric motor that is capable of propelling the bicycle without the rider pedaling and ceases to provide assistance when the bicycle reaches the speed of 20 miles per hour.\n\"Class 3 electric-assisted bicycle\" means an electric-assisted bicycle equipped with an electric motor that provides assistance only when the rider is pedaling and ceases to provide assistance when the bicycle reaches the speed of 28 miles per hour.\n(a) \"Commercial motor vehicle\" means a motor vehicle or combination of motor vehicles used to transport passengers or property if the motor vehicle:\n(1) has a gross vehicle weight of more than 26,000 pounds;\n(2) has a towed unit with a gross vehicle weight of more than 10,000 pounds and the combination of vehicles has a combined gross vehicle weight of more than 26,000 pounds;\n(3) is a bus;\n(4) is of any size and is used in the transportation of hazardous materials that are required to be placarded under Code of Federal Regulations, title 49, parts 100-185; or\n(5) is outwardly equipped and identified as a school bus, except for type A-I and type III vehicles as defined in subdivision 71.\n(b) For purposes of chapter 169A:\n(1) a commercial motor vehicle does not include a farm truck, an authorized emergency vehicle, or a recreational vehicle being operated by a person within the scope of section 171.02, subdivision 2, paragraph (b); and\n(2) a commercial motor vehicle includes a vehicle capable of or designed to meet the standards described in paragraph (a), clause (2), whether or not the towed unit is attached to the truck-tractor at the time of the violation or stop.\nUnless stated otherwise, \"commissioner\" means the commissioner of transportation of this state. Regardless of the commissioner referred to, however, the commissioner is to be considered as acting directly or through the commissioner's duly authorized officers and agents.\n\"Commuter vanpool\" means a prearranged ride-sharing arrangement in which seven to 16 persons travel together on a regular basis in a commuter van, especially to and from their place of employment or to and from a transit stop authorized by a local transit authority.\n\"Controlled-access highway\" means, in this chapter, every highway, street, or roadway in respect to which the right of access of the owners or occupants of abutting lands and other persons has been acquired and to which the owners or occupants of abutting lands and other persons have no legal right of access to or from the same except at such points only and in such manner as may be determined by the public authority having jurisdiction over such highway, street or roadway.\n\"Crosswalk\" means (1) that portion of a roadway ordinarily included with the prolongation or connection of the lateral lines of sidewalks at intersections; (2) any portion of a roadway distinctly indicated for pedestrian crossing by lines or other markings on the surface.\n\"Custom service vehicles\" means all vehicles used as well-drilling machine, wood-sawing machine, cement mixer, rock crusher, road grader, ditch digger, or elevating grader, and similar service equipment.\nFor purposes of regulating the operation of a motor vehicle, \"daytime\" means the time from one-half hour before sunrise to one-half hour after sunset.\nUnless stated otherwise, \"department\" means the Department of Transportation of this state. Regardless of the department referred to, however, it is to be considered as acting directly or through its duly authorized officers and agents.\n\"Driver\" means every person who drives or is in actual physical control of a vehicle.\n\"Dynamic shoulder lane\" has the meaning given in section 160.02, subdivision 18a.\n\"Electric personal assistive mobility device\" means a self-balancing device with two nontandem wheels, designed to transport not more than one person, and operated by an electric propulsion system that limits the maximum speed of the device to 15 miles per hour.\n(a) \"Electric vehicle\" means a motor vehicle that is able to be powered by an electric motor drawing current from rechargeable storage batteries, fuel cells, or other portable sources of electrical current, and meets or exceeds applicable regulations in Code of Federal Regulations, title 49, part 571, and successor requirements.\n(b) Electric vehicle includes:\n(1) a neighborhood electric vehicle;\n(2) a medium-speed electric vehicle; and\n(3) a plug-in hybrid electric vehicle.\n(a) \"Electric-assisted bicycle\" means a bicycle with two or three wheels that:\n(1) has a saddle and fully operable pedals for human propulsion;\n(2) meets the requirements for bicycles under Code of Federal Regulations, title 16, part 1512, or successor requirements;\n(3) is equipped with an electric motor that has a power output of not more than 750 watts;\n(4) meets the requirements of a class 1, class 2, class 3, or multiple mode electric-assisted bicycle; and\n(5) has a battery or electric drive system that has been tested to an applicable safety standard by a third-party testing laboratory.\n(b) A vehicle is not an electric-assisted bicycle if it is designed, manufactured, or intended by the manufacturer or seller to be configured or modified to not meet the requirements for an electric-assisted bicycle or operate within the requirements for an electric-assisted bicycle class.\n(c) For purposes of this subdivision, \"configured or modified\" includes any of the following changes:\n(1) a mechanical switch or button;\n(2) a modification or change to the electric motor or the electric drive system;\n(3) the use of an application to increase or override the electric drive system; or\n(4) through any other means represented or intended by the manufacturer or seller to modify the vehicle to no longer meet the requirements or classification of an electric-assisted bicycle.\n\"Explosives\" has the meaning given in Code of Federal Regulations, title 49, section 173.50.\n\"Farm tractor\" means every motor vehicle designed and used primarily as a farm implement for drawing plows, mowing machines, and other implements of husbandry.\n\"Flammable liquid\" has the meaning given in Code of Federal Regulations, title 49, section 173.120.\n\"Full-size pickup truck\" means any truck with a manufacturer's nominal rated carrying capacity of one ton or less and commonly known as or resembling a pickup truck.\n\"Gross vehicle weight\" means the greater of:\n(1) the unloaded weight of a vehicle or the unloaded weight of a truck-tractor and semitrailer combination, plus the weight of the load; or\n(2) the value specified by the manufacturer as the maximum gross weight or gross vehicle weight rating.\n\"Hazardous materials\" means any material that has been designated as hazardous under United States Code, title 49, section 5103, and is required to be placarded under Code of Federal Regulations, title 49, part 172, subpart F, or any quantity of a material listed as a select agent or toxin in Code of Federal Regulations, title 42, part 73.\n(a) \"Head Start bus\" means a motor vehicle used to transport children and parents to or from a Head Start facility, or to or from Head Start-related activities, by the Head Start grantee, or by someone under an agreement with the Head Start grantee. A Head Start bus does not include a motor vehicle transporting children or parents to or from a Head Start facility for which parents or guardians receive direct compensation from a Head Start grantee, a motor coach operating under charter carrier authority, or a transit bus providing services as defined in section 174.22, subdivision 7. A Head Start bus may be a type A, B, C, or D bus.\n(b) A Head Start bus manufactured after December 31, 1994, must meet the same standards as a type A, B, C, or D school bus, except that a Head Start bus is not required to be equipped with the warning signals required for a school bus under section 169.442, subdivision 1. A Head Start bus that is not equipped as a school bus must be painted colors other than national school bus yellow.\n\"Implement of husbandry\" means a self-propelled or towed vehicle designed or adapted to be used exclusively for timber-harvesting, agricultural, horticultural, or livestock-raising operations.\n(a) \"Intersection\" means the area embraced within the prolongation or connection of the lateral curb lines or, if none, then the lateral boundary lines of the roadways of two highways which join one another at, or approximately at, right angles or the area within which vehicles traveling upon different highways joining at any other angle may come in conflict.\n(b) Where a highway includes two roadways 30 feet or more apart, then every crossing of each roadway of such divided highway by an intersecting highway shall be regarded as a separate intersection. In the event such intersecting highway also includes two roadways 30 feet or more apart, then every crossing of two roadways of such highways shall be regarded as a separate intersection.\n\"Laned highway\" means a highway the roadway of which is divided into two or more clearly marked lanes for vehicular traffic.\n\"Local authorities\" means every county, municipal, and other local board or body having authority to adopt local police regulations under the constitution and laws of this state, and the Regents of the University of Minnesota, with reference to property owned, leased, or occupied by the Regents of the University of Minnesota or the University of Minnesota.\n\"Medium-speed electric vehicle\" means an electrically powered four-wheeled motor vehicle, equipped with a roll cage or crushproof body design, that can attain a maximum speed of 35 miles per hour on a paved level surface, is fully enclosed and has at least one door for entry, has a wheelbase of 40 inches or greater and a wheel diameter of ten inches or greater, and except with respect to maximum speed, otherwise meets or exceeds regulations in the Code of Federal Regulations, title 49, section 571.500, and successor requirements.\n\"Metal tire\" means every tire the surface of which in contact with the highway is wholly or partly of metal or other hard nonresilient material.\n(a) \"Mini truck\" means a motor vehicle that has four wheels; is propelled by an electric motor with a rated power of 7,500 watts or less or an internal combustion engine with a piston displacement capacity of 660 cubic centimeters or less; has a total dry weight of 900 to 2,200 pounds; contains an enclosed cabin and a seat for the vehicle operator; commonly resembles a pickup truck or van, including a cargo area or bed located at the rear of the vehicle; and was not originally manufactured to meet federal motor vehicle safety standards required of motor vehicles in the Code of Federal Regulations, title 49, sections 571.101 to 571.404, and successor requirements.\n(b) A mini truck does not include:\n(1) a neighborhood electric vehicle or a medium-speed electric vehicle; or\n(2) a motor vehicle that meets or exceeds the regulations in the Code of Federal Regulations, title 49, section 571.500, and successor requirements.\n(a) \"Micromobility device\" means a vehicle that:\n(1) is capable of: (i) being propelled solely by human power; (ii) being powered solely by an electric motor drawing current from rechargeable storage batteries, fuel cells, or other portable sources of electrical current; or (iii) both (i) and (ii);\n(2) when solely powered by an electric motor, is not capable of propelling the vehicle at a speed greater than 30 miles per hour on a paved level surface; and\n(3) has an unloaded weight of up to 500 pounds.\n(b) Micromobility device includes a bicycle, a motorized foot scooter, and an electric personal assistive mobility device. Micromobility device includes a motorized bicycle that meets the requirements under paragraph (a).\n\"Mobile crane\" means a vehicle (1) not designed or used to transport persons or property, (2) operated only incidentally on the highway and not subject to vehicle registration under chapter 168, and (3) comprising a boom and hoisting mechanism used in the construction industry. Mobile crane does not include a motor vehicle, designed to transport persons or property, to which a boom, hoist, crane, or other machinery has been attached.\n(a) \"Motor vehicle\" means every vehicle which is self-propelled and every vehicle which is propelled by electric power obtained from overhead trolley wires.\n(b) Motor vehicle does not include an electric-assisted bicycle, an electric personal assistive mobility device, or a vehicle moved solely by human power.\n\"Motor vehicle dealer\" means any person engaged in the business of manufacturing or selling new and unused motor vehicles, or used motor vehicles, or both, having an established place of business for the sale, trade, and display of such motor vehicles, and having in possession motor vehicles for the purpose of sale or trade.\n\"Motorcycle\" means every motor vehicle having a seat or saddle for the use of the rider and designed to travel on not more than three wheels in contact with the ground, including motor scooters and autocycles. Motorcycle does not include (1) motorized bicycles as defined in subdivision 45, (2) electric-assisted bicycles as defined in subdivision 27, (3) a tractor, or (4) roadable aircraft.\n\"Motorized bicycle\" means a bicycle that is propelled by an electric or a liquid fuel motor of a piston displacement capacity of 50 cubic centimeters or less, and a maximum of two brake horsepower, which is capable of a maximum speed of not more than 30 miles per hour on a flat surface with not more than one percent grade in any direction when the motor is engaged. Motorized bicycle does not include an electric-assisted bicycle as defined in subdivision 27.\n\"Multiple mode electric-assisted bicycle\" means an electric-assisted bicycle equipped with switchable or programmable modes that provide for operation as two or more of a class 1, class 2, or class 3 electric-assisted bicycle in conformance with the definition and requirements under this chapter for each respective class.\n\"Motorized foot scooter\" means a device with handlebars designed to be stood or sat upon by the operator, and powered by an internal combustion engine or electric motor that is capable of propelling the device with or without human propulsion, and that has no more than two 12-inch or smaller diameter wheels and has an engine or motor that is capable of a maximum speed of 15 miles per hour on a flat surface with not more than one percent grade in any direction when the motor is engaged. An electric personal assistive mobility device, a motorized bicycle, an electric-assisted bicycle, or a motorcycle is not a motorized foot scooter.\n\"Natural gas vehicle\" or \"NGV\" means a motor vehicle under subdivision 42 that is capable of being propelled by natural gas, including compressed natural gas and liquefied natural gas.\n\"Narrow-width lane\" means a traffic lane that is too narrow to allow persons operating a bicycle and persons operating a motor vehicle within the same lane to operate side by side in compliance with the minimum safe passing clearance set forth in section 169.18.\n\"Neighborhood electric vehicle\" means an electrically powered motor vehicle that has three or four wheels, and has a speed attainable in one mile of at least 20 miles per hour but not more than 25 miles per hour on a paved level surface.\nFor purposes of regulating the operation of a motor vehicle, \"nighttime\" means the time from one-half hour after sunset to one-half hour before sunrise.\n\"Nondivisible load\" or \"nondivisible vehicle\" means any load or vehicle exceeding the applicable length, width, height, or weight limits set forth in this chapter which, if separated into smaller loads or vehicles, would:\n(1) compromise the intended use of the load or vehicle;\n(2) destroy the value of the load or vehicle; or\n(3) require more than eight work hours to dismantle using appropriate equipment.\n\"Official traffic-control devices\" means all signs, signals, markings, and devices not inconsistent with this chapter placed or erected by authority of a public body or official having jurisdiction, for the purpose of regulating, warning, or guiding traffic.\n\"One-way roadway\" means a street or roadway designated and signposted for one-way traffic and on which all vehicles are required to move in one indicated direction.\n\"Owner\" means a person who holds the legal title of a vehicle, or in the event a vehicle is the subject of an agreement for the conditional sale or lease thereof with the right of purchase upon performance of the conditions stated in the agreement and with an immediate right of possession vested in the conditional vendee or lessee, or in the event a mortgagor of a vehicle is entitled to possession, then such conditional vendee or lessee or mortgagor shall be deemed the owner for the purpose of this chapter.\n\"Passenger vehicle\" means a passenger automobile defined in section 168.002, subdivision 24; a pickup truck defined in section 168.002, subdivision 26; a van defined in section 168.002, subdivision 40; and a self-propelled, recreational vehicle licensed under chapter 168 to use the public streets or highways. \"Passenger vehicle\" does not include a motorcycle, motorized bicycle, bus, school bus, a vehicle designed to operate exclusively on railroad tracks, a farm truck defined in section 168.002, subdivision 8, or special mobile equipment defined in section 168.002, subdivision 31.\n\"Pedestrian\" means any person afoot or in a wheelchair.\n\"Person\" means every natural person, firm, copartnership, association, or corporation.\n\"Plug-in hybrid electric vehicle\" means an electric vehicle that (1) contains an internal combustion engine and also allows power to be delivered to the drive wheels by a battery-powered electric motor; (2) when connected to the electrical grid via an electrical outlet, is able to recharge its battery; and (3) has the ability to travel at least 20 miles powered substantially by electricity.\n\"Platooning system\" means driver-assisted vehicle-to-vehicle technology that integrates electronic communications between and among multiple vehicles to synchronize speed, acceleration, and braking while leaving system monitoring and intervention in the control of each vehicle's human operator.\n\"Pneumatic tire\" means every tire in which compressed air is designed to support the load.\n\"Police officer\" means every officer authorized to direct or regulate traffic or to make arrests for violations of traffic rules.\n\"Private road or driveway\" means every way or place in private ownership and used for vehicular travel by the owner and those having express or implied permission from the owner, but not by other persons.\n(a) \"Pupil transport entity\" means (1) a school, as defined in section 120A.22, subdivision 4; (2) a charter school operated under chapter 124E; and (3) a private transportation contractor that operates under an agreement with an entity identified in clause (1) or (2).\n(b) \"Pupil transport entity\" does not include a Head Start grantee or someone operating under an agreement with a Head Start grantee.\n\"Railroad\" means a carrier of persons or property upon cars, other than streetcars, operated upon stationary rails.\n\"Railroad sign or signal\" means any sign, signal, or device erected by authority of a public body or official or by a railroad and intended to give notice of the presence of railroad tracks or the approach of a railroad train.\n\"Railroad train\" means a steam engine, electric or other motor, with or without cars coupled thereto, operated upon rails, except streetcars.\n\"Recreational truck-tractor\" means a truck-tractor with a gross vehicle weight rating of not more than 24,000 pounds, that is designed exclusively or adapted specifically to tow a semitrailer coupled by means of a fifth-wheel plate and kingpin assembly.\n(a) \"Recreational vehicle combination\" means a combination of vehicles consisting of a full-size pickup truck or a recreational truck-tractor attached by means of a kingpin and fifth-wheel coupling to a middle vehicle which has hitched to it a trailer.\n(b) For purposes of this subdivision, a \"kingpin and fifth-wheel coupling\" is a coupling between a middle vehicle and a towing full-size pickup truck or a recreational truck-tractor in which a portion of the weight of the towed middle vehicle is carried over or forward of the rear axle of the towing pickup.\n\"Recycling vehicle\" means a vehicle hauling recyclable materials as authorized by section 115A.93, subdivision 1.\n\"Red light camera system\" means an electronic system of one or more cameras or other motor vehicle sensors that is specifically designed to automatically produce recorded images of a motor vehicle operated in violation of a traffic-control signal, including related information technology for recorded image storage, retrieval, and transmission.\n\"Residence district\" means the territory contiguous to and including a highway not comprising a business district when the property on such highway for a distance of 300 feet or more is in the main improved with residences or residences and buildings in use for business.\n\"Residential roadway\" means a city street or town road that is either (1) less than one-half mile in total length, or (2) in an area zoned exclusively for housing that is not a collector or arterial street.\n\"Ride-sharing arrangement\" means the transportation of persons, for a fee or otherwise, in a motor vehicle when the transportation is incidental to another purpose of the driver. The term includes the forms of shared transportation known as car pools, commuter vanpools, and bus pools, whether or not furnished by an employer. A \"ride-sharing arrangement\" does not include transportation of employees by an employer from one place of employment to another.\n\"Right-of-way\" means the privilege of the immediate use of highway.\n\"Road tractor\" means every motor vehicle designed and used for drawing other vehicles and not so constructed as to carry any load thereon either independently or any part of the weight of a vehicle or load so drawn.\n\"Roadable aircraft\" means any aircraft capable of taking off and landing from a suitable airfield and that is also designed to be operated on a public highway as a motor vehicle.\n\"Roadway\" means that portion of a highway improved, designed, or ordinarily used for vehicular travel, exclusive of the sidewalk or shoulder. During periods when the commissioner allows the use of dynamic shoulder lanes as defined in subdivision 25, roadway includes that shoulder. In the event a highway includes two or more separate roadways, the term \"roadway\" as used herein shall refer to any such roadway separately but not to all such roadways collectively.\n\"Rural mail carrier vehicle\" is a motor vehicle operated by a rural mail carrier on a rural mail route.\n(a) \"Rural residential district\" means the territory contiguous to and including any city street or town road that is built up with visible dwelling houses situated at intervals averaging 300 feet or less for a distance of a quarter of a mile or more.\n(b) For purposes of this subdivision, \"interval\" means the distance, measured along the centerline of the roadway, between the primary access points for adjacent dwelling houses, regardless of whether the dwelling houses are located on the same side of the road.\nMS 2022 [Repealed, 2024 c 104 art 1 s 110]\n(a) \"School bus\" means a motor vehicle used to transport pupils to or from a school defined in section 120A.22, or to or from school-related activities, by the school or a school district, or by someone under an agreement with the school or a school district. A school bus does not include a motor vehicle transporting children to or from school for which parents or guardians receive direct compensation from a school district, a motor coach operating under charter carrier authority, a transit bus providing services as defined in section 174.22, subdivision 7, or a vehicle otherwise qualifying as a type III vehicle under paragraph (h), when the vehicle is properly registered and insured and being driven by an employee or agent of a school district for nonscheduled or nonregular transportation.\n(b) A school bus may be type A, type B, type C, or type D, multifunction school activity bus, or type III as provided in paragraphs (c) to (h).\n(c) A \"type A school bus\" is a van conversion or bus constructed utilizing a cutaway front section vehicle with a left-side driver's door. This definition includes two classifications: type A-I, with a gross vehicle weight rating (GVWR) less than or equal to 14,500 pounds; and type A-II, with a GVWR greater than 14,500 pounds and less than or equal to 21,500 pounds.\n(d) A \"type B school bus\" is constructed utilizing a stripped chassis. The entrance door is behind the front wheels. This definition includes two classifications: type B-I, with a GVWR less than or equal to 10,000 pounds; and type B-II, with a GVWR greater than 10,000 pounds.\n(e) A \"type C school bus\" is constructed utilizing a chassis with a hood and front fender assembly. The entrance door is behind the front wheels. A \"type C school bus\" also includes a cutaway truck chassis or truck chassis with cab, with or without a left side door, and with a GVWR greater than 21,500 pounds.\n(f) A \"type D school bus\" is constructed utilizing a stripped chassis. The entrance door is ahead of the front wheels.\n(g) A \"multifunction school activity bus\" is a school bus that meets the definition of a multifunction school activity bus in Code of Federal Regulations, title 49, section 571.3. A vehicle that meets the definition of a type III vehicle is not a multifunction school activity bus.\n(h) A \"type III vehicle\" is restricted to passenger vehicles and buses having a maximum manufacturer's rated seating capacity of ten or fewer people, including the driver, and a gross vehicle weight rating of 10,000 pounds or less. A \"type III vehicle\" must not be outwardly equipped and identified as a type A, B, C, or D school bus or type A, B, C, or D Head Start bus. A van or bus converted to a seating capacity of ten or fewer and placed in service on or after August 1, 1999, must have been originally manufactured to comply with the passenger safety standards.\n(i) In this subdivision, \"gross vehicle weight rating\" means the value specified by the manufacturer as the loaded weight of a single vehicle.\n\"Semitrailer\" means a vehicle of the trailer type so designed and used in conjunction with a truck-tractor that a considerable part of its own weight or that of its load rests upon and is carried by the truck-tractor and includes a trailer drawn by a truck-tractor semitrailer combination.\n\"Service vehicle\" means a motor vehicle owned and operated by a person, firm or corporation engaged in a business which includes the repairing or servicing of vehicles. The term also includes snow removal and road maintenance equipment not operated by or under contract to the state or a governmental subdivision.\n\"Shared use path\" means a bicycle facility that is (1) physically separated from motorized vehicular traffic by an open space or barrier, (2) located within either the highway right-of-way or an independent right-of-way, and (3) available for use by other nonmotorized users.\n\"Shoulder\" means that part of a highway which is contiguous to the regularly traveled portion of the highway and is on the same level as the highway. The shoulder may be pavement, gravel, or earth.\n\"Sidewalk\" means that portion of a street between the curb lines, or the lateral lines of a roadway, and the adjacent property lines intended for the use of pedestrians.\n\"Solid tire\" means every tire of rubber or other resilient material which does not depend upon compressed air for the support of the load.\n\"Solid waste vehicle\" means a vehicle hauling solid waste as authorized by section 115A.93, subdivision 1.\nMS 2012 [Expired, 2008 c 350 art 1 s 25; 2008 c 366 art 9 s 6]\n\"Speed safety camera system\" means an electronic system of one or more cameras or other motor vehicle sensors that is specifically designed to automatically produce recorded images of a motor vehicle operated in violation of the speed limit, including related information technology for recorded image storage, retrieval, and transmission.\n\"Stand or standing\" means the halting of a vehicle, whether occupied or not, otherwise than temporarily for the purpose of and while actually engaged in receiving or discharging passengers.\n\"Stop\" means complete cessation from movement.\n\"Stopping\" means any halting even momentarily of a vehicle, whether occupied or not, except when necessary to avoid conflict with other traffic or in compliance with the directions of a police officer or traffic-control sign or signal.\n\"Street or highway\" means the entire width between boundary lines of any way or place when any part thereof is open to the use of the public, as a matter of right, for the purposes of vehicular traffic.\n\"Through highway\" means every highway or portion thereof at the entrances to which vehicular traffic from intersecting highways is required by law to stop before entering or crossing the same and when stop signs are erected as provided in this chapter.\nMS 2010 [Renumbered 168B.011, subd 12a]\n\"Tow truck\" or \"towing vehicle\" has the meaning given in section 168B.011, subdivision 12a.\n\"Traffic\" means pedestrians, ridden or herded animals, vehicles, streetcars, and other conveyances, either singly or together, while using any highway for purposes of travel.\n\"Traffic-control signal\" means any device, whether manually, electrically or mechanically operated, by which traffic is alternately directed to stop and permitted to proceed.\n\"Traffic safety camera system\" means a red light camera system, a speed safety camera system, or both in combination.\n\"Trailer\" means any vehicle designed for carrying property or passengers on its own structure and for being drawn by a motor vehicle but does not include a trailer drawn by a truck-tractor semitrailer combination or an auxiliary axle on a motor vehicle which carries a portion of the weight of the motor vehicle to which it is attached.\n\"Transit bus\" means a bus engaged in regular route transit as defined in section 174.22, subdivision 8.\n\"Truck\" means every motor vehicle designed, used or maintained primarily for the transportation of property.\n\"Truck-tractor\" means:\n(1) a motor vehicle designed and used primarily for drawing other vehicles and not constructed to carry a load other than a part of the weight of the vehicle and load drawn; and\n(2) a motor vehicle designed and used primarily for drawing other vehicles used exclusively for transporting motor vehicles or boats and capable of carrying motor vehicles or boats on its own structure.\n\"Urban district\" means the territory contiguous to and including any city street or town road that is built up with structures devoted to business, industry, or dwelling houses situated at intervals of less than 100 feet for a distance of a quarter of a mile or more.\n\"Valid license,\" \"valid driver's license,\" \"valid Minnesota driver's license,\" \"valid standard driver's license,\" or other similar term, has the meaning given in section 171.01, subdivision 49a.\n\"Vehicle\" means every device in, upon, or by which any person or property is or may be transported or drawn upon a highway, excepting devices used exclusively upon stationary rails or tracks.\n\"Vehicle platoon\" means a group of commercial vehicles traveling in a unified manner through use of a platooning system or systems. A vehicle platoon consists of a lead vehicle and following vehicles. A vehicle platoon is not a combination vehicle under this chapter.\n\"Vulnerable road user\" means a person in the right-of-way of a highway, including but not limited to a bikeway and an adjacent sidewalk or trail, who is:\n(1) a pedestrian;\n(2) on a bicycle, including an electric-assisted bicycle, or on another nonmotorized vehicle or device;\n(3) on an electric personal assistive mobility device;\n(4) on an implement of husbandry; or\n(5) riding an animal.\nVulnerable road user includes the operator and any passengers for a vehicle, device, or personal conveyance identified in this subdivision.\nFor the purposes of this chapter, \"wheelchair\" is defined to include any manual or motorized wheelchair, scooter, tricycle, or similar device used by a disabled person as a substitute for walking.\n(a) \"Wireless communications device\" means (1) a cellular phone, or (2) a portable electronic device that is capable of receiving and transmitting data, including but not limited to text messages and email, without an access line for service.\n(b) A wireless communications device does not include: (1) a device or feature that is permanently physically integrated into the vehicle; (2) a global positioning system or navigation system that is only capable of being used for navigation purposes; or (3) a two-way radio, citizens band radio, or amateur radio equipment used in accordance with Federal Communications Commission rules and regulations.\n\"Work zone\" means a segment of street or highway for which:\n(1) a road authority or its agent is constructing, reconstructing, or maintaining the physical structure of the roadway, which may include, but is not limited to, shoulders, features adjacent to the roadway, and utilities and highway appurtenances, whether underground or overhead; and\n(2) any of the following applies:\n(i) official traffic-control devices that indicate the segment of street or highway under construction, reconstruction, or maintenance, are erected;\n(ii) one or more lanes of traffic are closed;\n(iii) a flagger under section 169.06, subdivision 4a, is present;\n(iv) a construction zone speed limit under section 169.14, subdivision 4, is established; or\n(v) a workers present speed limit under section 169.14, subdivision 5d, is in effect.",
	"repealed": false
}