{
	"id": "507.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.45",
	"title": "507.45 RESIDENTIAL REAL ESTATE CLOSINGS.",
	"text": "Residential real estate closing services may be provided and a fee charged by a licensed attorney, real estate broker, real estate salesperson, and real estate closing agent.\nNo charge for closing services, except a charge disclosed under Regulation Z, Code of Federal Regulations, title 12, part 226, and except a charge for which an estimate has been given pursuant to the federal Real Estate Settlement Procedures Act, and regulations thereunder, may be made by a closing agent unless the party to be charged is informed of the charge in writing at least five business days before the closing by or on behalf of the party charging for the closing services.\nIf the closing services are to be provided by a real estate broker, real estate salesperson, or real estate closing agent, the following regulations shall apply.\n(a) The written contract for closing services shall state in at least 10-point type that the real estate broker, real estate salesperson, or real estate closing agent has not and, under applicable state law, may not express opinions regarding the legal effect of the closing documents or of the closing itself.\n(b) No closing fee may be charged in connection with the transfer of the legal or equitable ownership of a property if a closing is performed without either a mortgagee's or owner's title insurance commitment or a legal opinion regarding the status of title.\n(a) No real estate salesperson, broker, attorney, auctioneer, builder, title agent, financial institution, or other person making a mortgage loan may require a person to use any particular licensed attorney, real estate broker, real estate salesperson, or real estate closing agent in connection with a residential real estate closing.\n(b) All listing agreements must include a notice informing sellers of their rights under this subdivision. The notice must require the seller to indicate in writing whether it is acceptable to the seller to have the licensee arrange for closing services or whether the seller wishes to arrange for others to conduct the closing. The notice must also include the disclosure of any controlled business arrangement, as the term is defined in United States Code, title 12, section 1602, between the licensee and the real estate closing agent through which the licensee proposes to arrange closing services.",
	"repealed": false
}