{
	"id": "309.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.53",
	"title": "309.53 ANNUAL REPORT.",
	"text": "Every charitable organization that is required to file or that files a registration statement pursuant to section 309.52 shall file an annual report with the attorney general upon forms provided by the attorney general or on forms identical thereto on or before July 15 of each year if its books are kept on a calendar year basis, or on or before the 15th day of the seventh month following the close of its fiscal year if its books are kept on a fiscal year basis. For cause shown the attorney general may extend the time for filing the annual report for a period not to exceed four months.\n[Repealed, 1995 c 235 s 17]\nSuch annual report shall include a financial statement covering the immediately preceding 12-month period of operation, shall be executed by any two duly constituted officers of the charitable organization, and shall be executed pursuant to resolution of the board of directors or trustees, or if there be no such board, then by its managing group which has approved the content of the annual report. Except as provided in section 309.55, subdivision 1, the annual report shall also include a copy of all tax or information returns, including all schedules and amendments, submitted by the charitable organization to the Internal Revenue Service for the period covered by the annual report except any schedules of contributors to the organization.\nA charitable organization which files the annual report required under this subdivision with the attorney general is not required to file the tax return with the commissioner of revenue. An organization which fails to file the annual report on or before the date required or allowed under this section shall pay a late fee of $50. This late fee shall be in addition to all other fees, costs, and penalties which may be imposed pursuant to this section or section 309.57.\nThe financial statement shall include a balance sheet, statement of income and expense, and statement of functional expenses, shall be consistent with forms furnished by the attorney general, and shall be prepared in accordance with generally accepted accounting principles so as to make a full disclosure of the following, including necessary allocations between each item and the basis of such allocations:\n(a) total receipts and total income from all sources;\n(b) cost of management and general;\n(c) program services;\n(d) cost of fundraising;\n(e) cost of public education;\n(f) funds or properties transferred out of state, with explanation as to recipient and purpose;\n(g) total net amount disbursed or dedicated within this state, broken down into total amounts disbursed or dedicated for each major purpose, charitable or otherwise;\n(h) names of professional fundraisers used during the accounting year and the financial compensation and profit resulting to each professional fundraiser; and\n(i) a list of the five highest paid directors, officers, and employees of the organization and its related organizations, as that term is defined by section 317A.011, subdivision 18, that receive total compensation of more than $100,000, together with the compensation paid to each. For purposes of this subdivision, \"compensation\" is defined as the total amount reported on Form W-2 (Box 5) or Form 1099-MISC (Box 7) issued by the organization and its related organizations to the individual. The value of fringe benefits and deferred compensation paid by the charitable organization and all related organizations as that term is defined by section 317A.011, subdivision 18, shall also be reported as a separate item for each person whose compensation is required to be reported pursuant to this subdivision.\nUnless otherwise required by this subdivision, the financial statement need not be certified.\nA financial statement of a charitable organization which has received total revenue in excess of $750,000 for the 12 months of operation covered by the statement shall be accompanied by an audited financial statement prepared in accordance with generally accepted accounting principles that has been examined by an independent certified public accountant for the purpose of expressing an opinion. In preparing the audit the certified public accountant shall take into consideration capital, endowment or other reserve funds, if any, controlled by the charitable organization. For purposes of calculating the $750,000 total revenue threshold provided by this subdivision, the value of donated food to a nonprofit food shelf may not be included if the food is donated for subsequent distribution at no charge, and not for resale.\nThe federal tax return may be filed in lieu of other financial statements if it is prepared in accordance with generally accepted accounting principles and meets the requirements for financial statements set forth in subdivisions 2, 3, and 4.\nWhere a registration statement has been filed by a parent organization or affiliate as provided in section 309.52, subdivision 4, the registered parent organization may file the annual report required under this section on behalf of the chapter, branch, area office, similar affiliate, or person in addition to or as part of its own report or the registered affiliate may file the annual report required under this section on behalf of the parent organization in addition to or as part of its own report. The accounting information required under this section shall be set forth separately and not in consolidated form with respect to every chapter, branch, area office, similar affiliate, or person within the state which raises or expends more than $25,000, exclusive of the direct cost of prizes given to the public by the charitable organization in connection with lawful gambling conducted in compliance with chapter 349. The attorney general may permit any chapter, branch, area office, similar affiliate, or person to file a consolidated statement with any other chapter, branch, area office, similar affiliate, or person or parent organization if the interests of the charitable beneficiaries will not be prejudiced thereby and separate accounting information is not required for proper supervision.\n[Repealed, 1978 c 601 s 29]\nA charitable organization that is organized and operated primarily for the purpose of offering and paying rewards for information leading to the apprehension or conviction of criminal suspects and that satisfies subdivision 7 shall not be required to include in its annual report the financial statement described in subdivisions 2 and 3, and notwithstanding subdivision 2, its annual report may be executed by the mayor, city manager, or chief of police of the municipality, if any, with which the organization is primarily associated.\nSubdivision 6 applies to an organization whose financial statement described in subdivisions 2 and 3 has been audited and reported on by a certified public accountant and made available with the accountant's report for inspection by its members and by the mayor, city manager, or chief of police of the municipality, if any, with which the organization is primarily associated, and whose annual report contains a certificate of compliance with this subdivision.\nA reregistration fee of $25 shall be paid by every charitable organization submitting the annual report required by this section.",
	"repealed": false
}