{
	"id": "259.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.21",
	"title": "259.21 DEFINITIONS.",
	"text": "For the purposes of sections 259.21 to 259.63 the terms defined in this section shall have the meanings respectively ascribed to them.\n\"Child\" means a person under the age of 18 years.\n\"Adult adoption\" means the adoption of a person at least 18 years of age.\n\"Parent\" means the natural or adoptive parent of a child.\n\"Guardian\" means a guardian of the ward appointed by a court of competent jurisdiction.\n\"Commissioner\" means the commissioner of children, youth, and families of the state of Minnesota.\n\"Agency\" means an organization or department of government designated or authorized by law to place children for adoption or any person, group of persons, organization, association or society licensed or certified by the commissioner of children, youth, and families to place children for adoption, including a Minnesota federally recognized tribe.\n\"Petitioner\" means a person with spouse, if there be one, petitioning for the adoption of any person or persons pursuant to sections 259.21 to 259.63. In the case of adoption by a stepparent, the parent who is the stepparent's spouse shall not be required to join the petition.\n\"Placement\" means the transfer of physical custody of a child from a birth parent or legal guardian to a prospective adoptive home.\n\"Placement activities\" means any of the following:\n(1) placement;\n(2) arranging or providing short-term foster care pending an adoptive placement;\n(3) facilitating placement by maintaining a list in any form of birth parents or prospective adoptive parents;\n(4) collecting health and social histories of a birth family;\n(5) conducting an adoption study;\n(6) witnessing consents to an adoption; or\n(7) engaging in any activity listed in clauses (1) to (6) for purposes of fulfilling any requirements of the interstate compact on the placement of children.\n\"Direct adoptive placement\" means the placement of a child by a birth parent or legal guardian other than an agency under the procedure for adoption authorized by section 259.47.\n\"Working day\" means Monday through Friday, excluding any holiday as defined under section 645.44, subdivision 5.\n\"Putative father\" means a man who may be a child's father, but who:\n(1) is not married to the child's mother on or before the date that the child was or is to be born; and\n(2) has not established paternity of the child according to section 257.57 in a court proceeding before the filing of a petition for the adoption of the child.\n\"Putative father\" includes a male who is less than 18 years old.",
	"repealed": false
}