{
	"id": "86B.825",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.825",
	"title": "86B.825 CERTIFICATE OF TITLE REQUIRED.",
	"text": "Except as provided in subdivision 2, a watercraft used on the waters of the state must have a certificate of title if the watercraft is kept in the state for more than 90 consecutive days.\nA watercraft is not required to have a certificate of title if the watercraft is:\n(1) owned by a manufacturer or dealer and held for sale;\n(2) used by a manufacturer solely for testing;\n(3) from a jurisdiction other than this state, temporarily using the waters of this state;\n(4) owned by the United States, a state, this state, or a political subdivision;\n(5) a waterfowl boat used only during waterfowl-hunting season;\n(6) a rice boat used only during the wild-rice-harvesting season;\n(7) owned by a person, firm, or corporation operating a resort as defined in section 157.15 or a recreational camping area as defined in section 327.14, subdivision 8, except with respect to a previously titled watercraft; or\n(8) watercraft manufactured prior to August 1, 1979.\nThe owner of a device used or designed for navigation on water and used on the waters of this state may obtain a certificate of title for the device, even though it is not a watercraft as defined in section 86B.820, subdivision 14, in the same manner and with the same effect as the owner of a watercraft required to be titled under sections 86B.820 to 86B.920. Once titled, the device is a titled watercraft as defined in section 86B.820, subdivision 13, and is and remains subject to sections 86B.820 to 86B.920, to the same extent as a watercraft required to be titled.\nA person may not sell or otherwise transfer a titled watercraft without delivering to the person acquiring the watercraft a certificate of title with an assignment on it to show title in the person acquiring the watercraft. A person may not acquire a watercraft required to have a certificate of title without obtaining a certificate of title for the watercraft in the person's name.\nA person acquiring a watercraft, required to have a certificate of title under this section, through a sale or gift does not acquire a right, title, claim, or interest in the watercraft until the person has been issued a certificate of title to the watercraft or has received a manufacturer's or importer's certificate. A waiver or estoppel does not operate in favor of that person against another person who has obtained possession of the certificate of title or manufacturer's or importer's certificate for the watercraft for valuable consideration.\nThe commissioner may not issue or renew a watercraft license to an owner of a titled watercraft unless the owner has been issued or has applied for a certificate of title for the watercraft.",
	"repealed": false
}