{
	"id": "252.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.292",
	"title": "252.292 COMMUNITY SERVICES CONVERSION PROJECT.",
	"text": "For the purposes of section 252.291, subdivision 3, the commissioner of human services shall ask counties to present proposals for the voluntary conversion of services provided by community intermediate care facilities for persons with developmental disabilities to services provided under home and community-based services.\nThe commissioner shall report to the legislature by March 1, 1988, on the status of the community services conversion project. The report must include the project's cost, the number of counties and facilities participating, the number and location of decertified community intermediate care beds, and the project's effect on residents, former residents, and employees of community intermediate care facilities for persons with developmental disabilities.\n(a) The commissioner may approve county proposals within the limitations of this section. To be considered for approval, county proposals must contain the following information:\n(1) specific plans for the development and provision of alternative services for residents moved from intermediate care facilities for persons with developmental disabilities;\n(2) time lines and expected beginning dates for resident relocation and facility closure; and\n(3) projected caseloads and expenditures for intermediate care facilities for persons with developmental disabilities and for home and community-based services.\n(b) Counties must ensure that residents discharged from facilities participating in the project are moved to their home communities whenever possible. For the purposes of this section, \"home community\" means the county of financial responsibility or a county adjacent to the county of financial responsibility. The commissioner shall have the sole authority to waive this requirement based on the choice of the person or the person's legal representative, if any.\n(c) County proposals must comply with the need determination procedures in sections 252.28 and 252.291, the responsibility for persons with developmental disabilities specified in section 256B.092, the requirements under United States Code, title 42, sections 1396 et seq., and section 256B.501, and the rules adopted under these laws.\n(d) The commissioner shall give first priority to proposals that:\n(1) respond to the emergency relocation of a facility's residents;\n(2) result in the closing of a facility;\n(3) demonstrate that alternative placements will be developed based on individual resident needs and applicable federal and state rules; and\n(4) demonstrate savings of medical assistance expenditures. The commissioner shall give second priority to proposals that meet all of the above criteria except clause (1).\n(e) The commissioner shall select proposals that best meet the criteria established in this subdivision within the appropriations made available for home and community-based services. The commissioner shall notify counties and facilities of the selections made and approved by the commissioner.\n(f) For each proposal approved by the commissioner, a contract must be established between the commissioner, the county where the facility is located, and the participating facility. The contract must address the items in this subdivision and must be consistent with the requirements of this section.\nHome and community-based services shall be allocated to participating counties to replace intermediate care facility services for persons with developmental disabilities that are decertified through the project. One additional home and community-based services placement shall be provided for each current resident of an intermediate care facility for persons with developmental disabilities who chooses and is eligible for home and community-based services. The placement must meet applicable federal and state laws and rules. Additional home and community-based services placements will not be authorized for persons transferred to other intermediate care facilities for persons with developmental disabilities, including state hospitals, or to nursing homes licensed under chapter 144A, or for persons determined ineligible for home and community-based services.\nThe county must provide quarterly reports to the commissioner regarding the number of people moving out of participating facilities each month and their alternative placement. County actions that result in a denial of services, failure to act with reasonable promptness, suspension, reduction, or termination of services may be appealed by affected persons under section 256.045.\nFor purposes of this section, the commissioner shall establish payment rates under section 256B.501 and Minnesota Rules, parts 9553.0010 to 9553.0080, except that, in order to facilitate an orderly transition of residents from community intermediate care facilities for persons with developmental disabilities to services provided under the home and community-based services program, the commissioner may, in a contract with the provider, modify the effect of provisions in Minnesota Rules, parts 9553.0010 to 9553.0080, as stated in clauses (1) to (9):\n(1) extend the interim and settle-up rate provisions to include facilities covered by this section;\n(2) extend the length of the interim period but not to exceed 12 months. The commissioner may grant a variance to exceed the 12-month interim period, as necessary, for facilities which are licensed and certified to serve more than 99 persons. In no case shall the commissioner approve an interim period which exceeds 24 months;\n(3) waive the investment per bed limitations for the interim period and the settle-up rate;\n(4) limit the amount of reimbursable expenses related to the acquisition of new capital assets;\n(5) prohibit the acquisition of additional capital debt or refinancing of existing capital debt unless prior approval is obtained from the commissioner;\n(6) establish an administrative operating cost limitation for the interim period and the settle-up rate;\n(7) require the retention of financial and statistical records until the commissioner has audited the interim period and the settle-up rate;\n(8) require that the interim period be audited by a certified or licensed public accounting firm; or\n(9) change any other provision to which all parties to the contract agree.",
	"repealed": false
}