{
	"id": "299A.802",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.802",
	"title": "299A.802 ADMINISTRATIVE PENALTY ORDER.",
	"text": "The commissioner may issue an administrative penalty order for a violation of statute, rule, or other authority if an administrative agent has failed to comply with a corrective order issued under section 299A.801 related to that violation. The maximum amount of an administrative penalty order is $10,000 for each administrative agent for all violations identified in an inspection or review of compliance. In addition to service by certified mail on the administrative agent, a copy of the administrative penalty order must be given to the county auditor in the county where the administrative agent is located.\n(a) In determining the amount of a penalty to be assessed under this section, the commissioner may consider:\n(1) the willfulness of the violation;\n(2) the gravity of the violation, including damage to consumers or the state;\n(3) the history of past violations;\n(4) the number of violations;\n(5) the economic benefit gained by the administrative agent by allowing or committing the violation; and\n(6) other factors as justice may require, if the commissioner specifically identifies the additional factors in the commissioner's order.\n(b) If an administrative agent violates a corrective order after a violation of a previous corrective order, the commissioner, in determining the amount of a penalty, must consider the factors in paragraph (a) and the following factors:\n(1) similarity of the most recent previous violation of a corrective order and the violation to be penalized;\n(2) time elapsed since the last violation of a corrective order;\n(3) number of previous violations; and\n(4) response of the administrative agent to the most recent previous violation identified.\nAn administrative penalty order under this section must include:\n(1) a concise statement of the facts alleged to constitute a violation;\n(2) a reference to the portion of the statute, rule, variance, order, or stipulation agreement or the term or condition of a permit that has been violated;\n(3) a description of the violation of the corrective order that forms the basis for issuance of the administrative penalty order;\n(4) a statement of the amount of the administrative penalty to be imposed and the factors upon which the penalty is based; and\n(5) a statement of the administrative agent's right to review and appeal of the administrative penalty order.\n(a) Unless the administrative agent requests review of the administrative penalty order under subdivision 5 before the penalty is due, the penalty in the order is due and payable on the 31st day after the administrative penalty order was received, if the administrative agent subject to the order fails to provide information to the commissioner showing that the violation has been corrected or that appropriate steps have been taken toward correcting the violation. These requirements may be waived or extended by the commissioner.\n(b) Interest at the rate established in section 549.09 begins to accrue on penalties under this subdivision on the 31st day after the order with the penalty was received, unless waived by the commissioner.\n(a) Within 30 days after receiving an administrative penalty order, the administrative agent subject to an order under this section may request an expedited hearing, using the procedures of Minnesota Rules, parts 1400.8510 to 1400.8612, or their successor rules, to review the commissioner's action. The hearing request must specifically state the reasons for seeking review of the administrative penalty order. The administrative agent to whom the administrative penalty order is directed and the commissioner are the parties to the expedited hearing. At least 15 days before the hearing, the commissioner shall notify the administrative agent to whom the administrative penalty order is directed of the time and place of the hearing. The expedited hearing must be held within 30 days after a request for hearing has been filed with the commissioner unless the parties agree to a later date.\n(b) All written arguments must be submitted within ten days following the close of the hearing. The hearing must be conducted under Minnesota Rules, parts 1400.8510 to 1400.8612, or their successor rules, as modified by this subdivision. The Office of Administrative Hearings, in consultation with the agency, may adopt rules specifically applicable to cases under this section.\n(c) Within 30 days following the close of the record, the administrative law judge shall issue a report making recommendations about the commissioner's action to the commissioner. The administrative law judge may not recommend a change in the amount of the proposed administrative penalty unless the administrative law judge determines that, based on the factors in subdivision 1, the amount of the administrative penalty is unreasonable.\n(d) If the administrative law judge makes a finding that the hearing was requested solely for purposes of delay or that the hearing request was frivolous, the commissioner may add to the amount of the administrative penalty the costs charged to the agency by the Office of Administrative Hearings for the hearing.\n(e) If a hearing has been held, the commissioner may not issue a final order until at least five days after receipt of the report of the administrative law judge. Within those five days, the administrative agent to whom an administrative penalty order is issued may comment to the commissioner on the recommendations and the commissioner shall consider the comments. The final administrative penalty order may be appealed to the district court for a de novo review of the order.\n(f) If a hearing has been held and a final administrative penalty order issued by the commissioner, the administrative penalty must be paid by 30 days after the date the final order is received unless it is appealed to the district court. If an appeal is not taken or the administrative penalty order is upheld on appeal, the amount due is the administrative penalty, together with interest accruing from 31 days after the original order was received, at the rate established in section 549.09.\nIn addition to review under subdivision 5, the commissioner may enter into mediation concerning an order issued under this section if the commissioner and the administrative agent to whom the order is issued both agree to mediation.",
	"repealed": false
}