{
	"id": "245A.143",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.143",
	"title": "245A.143 FAMILY ADULT DAY SERVICES.",
	"text": "(a) The licensing standards in this section must be met to obtain and maintain a license to provide family adult day services. For the purposes of this section, family adult day services means a program operating fewer than 24 hours per day that provides functionally impaired adults age 18 or older with an individualized and coordinated set of services including health services, social services, and nutritional services that are directed at maintaining or improving the participants' capabilities for self-care.\n(b) A family adult day services license shall only be issued when the services are provided in the license holder's primary residence, and the license holder is the primary provider of care. The license holder may not serve more than eight adults at one time, including residents, if any, served under a license issued under Minnesota Rules, parts 9555.5105 to 9555.6265.\n(c) An adult foster care license holder may provide family adult day services under the license holder's adult foster care license if the license holder meets the requirements of this section.\n(a) For the purposes of this section, the terms defined in this subdivision have the following meanings unless otherwise provided for by text.\n(b) \"Caregiver\" means a spouse, adult child, parent, relative, friend, or others who normally provide unpaid support or care to the individual needing assistance. For the purpose of this section, the caregiver may or may not have legal or financial responsibility for the participant.\n(c) \"Participant\" means a functionally impaired adult receiving family adult day services.\n(d) \"Consultation by a health care professional\" means the review and oversight of the participant's health-related services by a registered nurse, physician, physician assistant, or mental health professional.\n(a) The license holder shall have available for review, and shall distribute to participants and their caregivers upon admission, written information about:\n(1) the scope of the programs, services, and care offered by the license holder;\n(2) a description of the population to be served by the license holder;\n(3) a description of individual conditions which the license holder is not prepared to accept, such as a communicable disease requiring isolation, a history of violence to self or others, unmanageable incontinence, or uncontrollable wandering;\n(4) the participants' rights and procedure for presenting grievances, including the name, address, and telephone number of the Office of Ombudsman for Long-Term Care and the county licensing department, to which a participant or participant's caregiver may submit an oral or written complaint;\n(5) the license holder's policy on and arrangements for providing transportation;\n(6) the license holder's policy on providing meals and snacks;\n(7) the license holder's fees, billing arrangements, and plans for payment;\n(8) the license holder's policy governing the presence of pets in the home;\n(9) the license holder's policy on smoking in the home;\n(10) types of insurance coverage carried by the license holder;\n(11) information on orientation requirements under section 245A.65, subdivisions 1, paragraph (c), and 2, paragraph (a), clause (4);\n(12) the terms and conditions of the license holder's license issued by the department;\n(13) the license holder's plan for emergency evacuation of participants involving fire, weather, and other disasters. The plan must include instructions for evacuation or rescue of participants, identification of an emergency shelter area, quarterly fire drill schedule, and staff responsibilities; and\n(14) the license holder's policy for handling harmful objects, materials, or equipment including the storage of poisonous chemicals, use of appliances, sharp instruments, matches, or any other potentially harmful materials.\n(b) The information in paragraph (a) must be provided in writing to the commissioner's representative upon request and must be available for inspection by the commissioner's representative at the home.\n(a) Before admitting an individual into the family adult day services program, the license holder shall screen the individual to determine how or whether the license holder can serve the individual, based on the license holder's policies, services, expertise, and the individual's needs and condition. If possible, the screening shall include an interview with the individual and with the individual's caregiver.\n(b) The screening required under paragraph (a) shall include an evaluation of the health, nutritional, and social services needs of the individual.\nBefore providing family adult day services, an individual, the individual's caregiver, the legal representative if there is one, the county or private case manager, if applicable, and the license holder shall develop a service delivery plan. At a minimum, the service delivery plan shall include:\n(1) a description of the health services, nutritional services, and social services to be arranged or provided by the license holder and the frequency of those services and that the services will be based on the needs of the individual;\n(2) scheduled days and hours of participant's attendance at the license holder's home;\n(3) transportation arrangements for getting the participant to and from the license holder's home;\n(4) contingency plans if scheduled services cannot be provided by the license holder;\n(5) identification of responsibilities of the participant and the license holder with respect to payment for the services;\n(6) circumstances when emergency services will be called; and\n(7) identification of the license holder's discharge policy when services are no longer needed or when the participant's needs can no longer be met by the license holder.\n(a) The service plan must be coordinated with other plans of services for the participant, as appropriate.\n(b) The service plan must be dated and revised when there is a change in the needs of the participant or annually, whichever occurs sooner.\n(a) The license holder shall provide health services as specified in the service delivery plan under the direction of the designated caregiver or county or private case manager. Health services must include:\n(1) monitoring the participant's level of function and health while participating; taking appropriate action for a change in condition including immediately reporting changes to the participant's caregiver, physician, physician assistant, mental health professional, or registered nurse; and seeking consultation;\n(2) offering information to participants and caregivers on good health and safety practices; and\n(3) maintaining a listing of health resources available for referrals as needed by participants and caregivers.\n(b) Unless the person is a licensed health care practitioner qualified to administer medications, the person responsible for medication administration or assistance shall provide a certificate verifying successful completion of a trained medication aid program for unlicensed personnel approved by the Minnesota Department of Health or comparable program, or biennially provide evidence of competency as demonstrated to a registered nurse, physician, or physician assistant.\n(c) The license holder must have secure storage and safeguarding of all medications with storage of medications in their original container, know what information regarding medication administration must be reported to a health care professional, and must maintain a record of all medications administered.\n(a) The license holder shall ensure that food served is nutritious and meets any special dietary needs of the participants as prescribed by the participant's physician, advanced practice registered nurse, physician assistant, or dietitian as specified in the service delivery plan.\n(b) Food and beverages must be obtained, handled, and properly stored to prevent contamination, spoilage, or a threat to the health of a resident.\nThe license holder, in consultation with the county or private case manager, when appropriate, shall actively assist the participant in identifying and achieving personal goals, support the participant in maintaining personal support networks and socially valued roles, provide assistance to the participant to enable community participation, and refer participants to the Office of Ombudsman for Long-Term Care and other advocacy organizations for assistance when there is a potential conflict of interest between the license holder and the participant.\n(a) The license holder shall adopt and comply with a participant bill of rights. The rights shall include the participants' right to:\n(1) participate in the development of the service plan;\n(2) refuse services or participation;\n(3) privacy;\n(4) confidentiality of participant information; and\n(5) present grievances regarding treatment or services to the Office of Ombudsman for Long-Term Care or the county licensing department. The license holder's policies shall include a procedure for addressing participant grievances, including the name, address, and telephone number of the county licensing department, to which a participant or participant caregiver may submit an oral or written complaint.\n(b) The license holder shall post the participant rights in the home and shall provide a copy to the participant and the participant's primary caregiver and legal representative if the participant has one.\nWhenever participants are in the home, there must be present at least one individual who is trained in basic first aid and certified in cardiopulmonary resuscitation and the treatment of obstructed airways. Whenever there are six, seven, or eight participants present, there must be a second staff person present.\nThe license holder and license holder's staff must annually complete 12 hours of training related to the health, nutritional, and social needs of the license holder's target population. License holders with six or more years of licensure under this section or as an adult foster care provider must annually complete six hours of training. The annual training must include training on the reporting of maltreatment of vulnerable adults under sections 626.557 and 626.5572; license holder requirements governing maltreatment of vulnerable adults under section 245A.65; and, when a license holder serves participants who rely on medical monitoring equipment to sustain life or monitor a medical condition, training on medical equipment as required under section 245A.155 for foster care providers. A record of all training must be maintained in the home.\n(a) The home where family adult day services are to be provided shall be classified as a residential group R-3 occupancy under the State Building Code and State Fire Code for purposes of building code and fire code inspections. A building code inspection is not required for licensure under this section. The state or local fire marshal must inspect the family adult day services home operating in the residence for compliance with the residential group R-3 occupancy provisions of the State Fire Code.\n(b) The licensed capacity of the home shall be limited by the amount of indoor space available for use by participants. The total indoor space available for use by participants must equal at least 35 square feet for each participant, the license holder, and each staff member present in the home. In determining the square footage of usable indoor space available, the following must not be counted: hallways, stairways, closets, offices, restrooms, and utility and storage areas. The usable indoor space available must include a room or an area that can be used as private space for providing personal hygiene services or social services to participants.\n(c) The residence must comply with all applicable local ordinances.\nThe commissioner may grant a variance to any of the requirements in this section if the conditions in section 245A.04, subdivision 9, are met.",
	"repealed": false
}