{
	"id": "144.1222",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1222",
	"title": "144.1222 PUBLIC POOLS; ENCLOSED SPORTS ARENAS.",
	"text": "The commissioner of health shall be responsible for the adoption of rules and enforcement of applicable laws and rules relating to the operation, maintenance, design, installation, and construction of public pools and facilities related to them. The commissioner shall adopt rules governing the collection of fees under section 144.122 to cover the cost of pool construction plan review, monitoring, and inspections.\nAll plans and specifications for public pool and spa construction, installation, or alteration or requests for a variance that are submitted to the commissioner according to Minnesota Rules, part 4717.3975, shall be accompanied by the appropriate fees. All public pool construction plans submitted for review after January 1, 2009, must be certified by a professional engineer registered in the state of Minnesota. If the commissioner determines, upon review of the plans, that inadequate fees were paid, the necessary additional fees shall be paid before plan approval. For purposes of determining fees, a project is defined as a proposal to construct or install a public pool, spa, special purpose pool, or wading pool and all associated water treatment equipment and drains, gutters, decks, water recreation features, spray pads, and those design and safety features that are within five feet of any pool or spa. The commissioner shall charge the following fees for plan review and inspection of public pools and spas and for requests for variance from the public pool and spa rules:\n(1) each pool, $1,500;\n(2) each spa pool, $800;\n(3) each slide, $600;\n(4) projects valued at $250,000 or more, the greater of the sum of the fees in clauses (1), (2), and (3) or 0.5 percent of the documented estimated project cost to a maximum fee of $15,000;\n(5) alterations to an existing pool without changing the size or configuration of the pool, $600;\n(6) removal or replacement of pool disinfection equipment only, $100; and\n(7) request for variance from the public pool and spa rules, $500.\nFor all public pools constructed after January 1, 2009, without a gravity outlet or drain, each pump must be connected to at least two suction outlets, connected in parallel with suction outlet covers that meet ASME/ANSI standards.\n(a) Beginning January 1, 2009, all public pools with the deepest water being less than four feet deep must have:\n(1) an unblockable suction outlet or drain;\n(2) at least two suction outlets, connected in parallel with suction outlet covers that meet ASME/ANSI standards; or\n(3) a gravity outlet or drain.\n(b) Beginning January 1, 2011, all other existing public pools must have:\n(1) an unblockable suction outlet or drain;\n(2) at least two suction outlets, connected in parallel with suction outlet covers that meet ASME/ANSI standards;\n(3) a gravity outlet or drain; or\n(4) any other system determined by the commissioner to be equally effective as, or better than, the systems listed in this paragraph at preventing or eliminating the risk of injury or death associated with pool drainage systems.\n(c) By June 1, 2008, all drain covers and grates must be installed with screws that meet the manufacturer's specifications.\n(d) By July 1, 2008, and annually thereafter, all public pool owners must certify to the commissioner on a form prescribed by the commissioner that:\n(1) all outlets except for unblockable drains are equipped with covers that have been stamped by the manufacturer that they are in compliance with ASME/ANSI standards; and\n(2) all covers and grates, including mounting rings, have been inspected to ensure that they have been properly installed and are not broken or loose.\n(a) The pool operator is required to conduct a physical inspection of the drain covers and grates on a daily basis. The record required under Minnesota Rules, part 4717.0750, must indicate that this inspection was completed every day the pool is open for use.\n(b) If at any time an outlet cover or grate is missing, broken, or loose, the pool must be closed immediately. The pool must not be reopened until the missing or broken cover or grate has been replaced according to the manufacturer's specifications, or the loose cover or grate has been reattached to the manufacturer's specifications.\nA pool used by a medical or rehabilitation facility to facilitate treatment or therapy, to which only authorized access is allowed and which is not open for any other public use, is exempt from the requirements of Minnesota Rules, part 4717.1050, regarding warning signs, and Minnesota Rules, part 4717.1650, subpart 1, regarding placards.\nA portable wading pool that is located at a family day care or group family day care home licensed under Minnesota Rules, chapter 9502, or at a home at which child care services are provided under section 142B.05, subdivision 2, paragraph (a), clause (2), shall be defined as a private residential pool and not as a public pool for purposes of public swimming pool regulations under Minnesota Rules, chapter 4717, provided that the portable wading pool has a maximum depth of 24 inches and is capable of being manually emptied and moved.\nNotwithstanding Minnesota Rules, part 4717.0250, subpart 8, a swimming pool that is located at a family day care or group family day care home licensed under Minnesota Rules, chapter 9502, shall not be considered a public pool, and is exempt from the requirements for public pools in Minnesota Rules, parts 4717.0150 to 4717.3975. If the provider chooses to allow children cared for at the family day care or group family day care home to use the swimming pool located at the home, the provider must satisfy the requirements in section 142B.41, subdivision 9.\nNotwithstanding Minnesota Rules, part 4717.1850, a pool with a zero-depth area may be used without a lifeguard present if access to the pool area is prohibited to individuals under the age of 18 years during the time a lifeguard is not present.\n(a) A hot water pool intended for seated recreational use, including a hot tub or whirlpool, that is located on a houseboat that is rented to the public is not a public pool and is exempt from the requirements for public pools under Minnesota Rules, chapter 4717.\n(b) A hot water pool under this subdivision must be conspicuously posted with the following notice to renters:\n\"NOTICE\nThis spa is exempt from state and local sanitary requirements that prevent disease transmission.\nUSE AT YOUR OWN RISK\nThis notice is required under Minnesota Statutes, section 144.1222, subdivision 2d.\"\nThe commissioner of health shall be responsible for the adoption of rules and enforcement of applicable laws and rules relating to indoor air quality in the operation and maintenance of enclosed sports arenas.\n(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"ASME/ANSI standard\" means a safety standard accredited by the American National Standards Institute and published by the American Society of Mechanical Engineers.\n(c) \"ASTM standard\" means a safety standard issued by ASTM International, formerly known as the American Society for Testing and Materials.\n(d) \"Public pool\" means any pool other than a private residential pool, that is: (1) open to the public generally, whether for a fee or free of charge; (2) open exclusively to members of an organization and their guests; (3) open to residents of a multiunit apartment building, apartment complex, residential real estate development, or other multifamily residential area; (4) open to patrons of a hotel or lodging or other public accommodation facility; or (5) operated by a person in a park, school, licensed child care facility, group home, motel, camp, resort, club, condominium, manufactured home park, or political subdivision with the exception of swimming pools at family day care homes licensed under section 142B.41, subdivision 9, paragraph (a).\n(e) \"Unblockable suction outlet or drain\" means a drain of any size and shape that a human body cannot sufficiently block to create a suction entrapment hazard and meets ASME/ANSI standards.\n(a) A public swimming pond in existence before January 1, 2008, is not a public pool for purposes of this section and section 157.16, and is exempt from the requirements for public swimming pools under Minnesota Rules, chapter 4717.\n(b) A naturally treated swimming pool located in the city of Minneapolis is not a public pool for purposes of this section and section 157.16, and is exempt from the requirements for public swimming pools under Minnesota Rules, chapter 4717.\n(c) Notwithstanding paragraphs (a) and (b), a public swimming pond and a naturally treated swimming pool must meet the requirements for public pools described in subdivisions 1c and 1d.\n(d) For purposes of this subdivision, a \"public swimming pond\" means an artificial body of water contained within a lined, sand-bottom basin, intended for public swimming, relaxation, or recreational use that includes a water circulation system for maintaining water quality and does not include any portion of a naturally occurring lake or stream.\n(e) For purposes of this subdivision, a \"naturally treated swimming pool\" means an artificial body of water contained in a basin, intended for public swimming, relaxation, or recreational use that uses a chemical free filtration system for maintaining water quality through natural processes, including the use of plants, beneficial bacteria, and microbes.",
	"repealed": false
}