{
	"id": "248.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/248.11",
	"title": "248.11 RECOUPMENT OF SERVICES AND EQUIPMENT.",
	"text": "If a recipient receives monetary assistance as a rehabilitation service from services for the blind in excess of that to which the recipient is entitled by law, State Services for the Blind shall, as soon as it discovers the amount of the erroneous payment, notify the recipient to return the same in accordance with rules adopted by the commissioner. Unless the recipient files an appeal under section 248.07, subdivision 15, within 15 days after the notice to return is personally delivered to the recipient or mailed to the recipient's last known address, the determination of overpayment shall be considered final. If the recipient files a timely appeal, the determination shall not be considered final until the recipient's administrative appeal remedies are exhausted. State Services for the Blind may recoup overpayments considered final under this subdivision by deducting the amount or a part of the overpayment from future monetary assistance payments to the recipient or by civil action in the name of the commissioner. Overpayments made more than three years prior to discovery of the error are not recoverable under this subdivision.\nIf a recipient retains equipment to which State Services for the Blind has title after the recipient's right to possess the equipment has expired, State Services for the Blind shall notify the recipient to return the same or execute a new lease to the equipment if the equipment is still necessary to the recipient's rehabilitation. Unless the recipient returns the equipment, executes and complies with a new lease to the equipment or appeals under section 248.07, subdivision 15, within 15 days after the notice to return is personally delivered to the recipient or mailed to the recipient's last known address, State Services for the Blind may institute a civil action to recover the equipment or the reasonable value of the equipment.",
	"repealed": false
}