{
	"id": "12.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.31",
	"title": "12.31 NATIONAL SECURITY OR PEACETIME EMERGENCY; DECLARATION.",
	"text": "When information from the President of the United States, the Federal Emergency Management Agency, the Department of Defense, or the National Warning System indicates the imminence of a national security emergency within the United States, which means the several states, the District of Columbia, and the Commonwealth of Puerto Rico, or the occurrence within the state of Minnesota of a major disaster from enemy sabotage or other hostile action, the governor may, by proclamation, declare that a national security emergency exists in all or any part of the state. If the legislature is then in regular session or, if it is not, if the governor concurrently with the proclamation declaring the emergency issues a call convening immediately both houses of the legislature, the governor may exercise for a period not to exceed 30 days the powers and duties conferred and imposed by sections 12.31 to 12.37 and 12.381. The lapse of these emergency powers does not, as regards any act occurring or committed within the 30-day period, deprive any person, political subdivision, municipal corporation, or body politic of any right to compensation or reimbursement that it may have under this chapter.\n(a) The governor may declare a peacetime emergency. A peacetime declaration of emergency may be declared only when any of the following endangers life and property and local government resources are inadequate to handle the situation:\n(1) an act of nature;\n(2) a technological failure or malfunction;\n(3) a terrorist incident;\n(4) a cyber attack, including a physical or electronic attack on the state's information and telecommunications technology infrastructure, systems, or services;\n(5) an industrial accident;\n(6) a hazardous materials accident; or\n(7) a civil disturbance.\nIf the peacetime emergency occurs on Indian lands, the governor or state director of emergency management shall consult with tribal authorities before the governor makes such a declaration. Nothing in this section shall be construed to limit the governor's authority to act without such consultation when the situation calls for prompt and timely action. When the governor declares a peacetime emergency, the governor must immediately notify the majority and minority leaders of the senate and the speaker and majority and minority leaders of the house of representatives. A peacetime emergency must not be continued for more than five days unless extended by resolution of the Executive Council up to 30 days. An order, or proclamation declaring, continuing, or terminating an emergency must be given prompt and general publicity and filed with the secretary of state.\n(b) By majority vote of each house of the legislature, the legislature may terminate a peacetime emergency extending beyond 30 days. If the governor determines a need to extend the peacetime emergency declaration beyond 30 days and the legislature is not sitting in session, the governor must issue a call immediately convening both houses of the legislature. Nothing in this section limits the governor's authority over or command of the National Guard as described in the Military Code, chapters 190 to 192A, and required by the Minnesota Constitution, article V, section 3.\nA declaration of a peacetime emergency in accordance with this section authorizes the governor to exercise for a period not to exceed the time specified in this section the powers and duties conferred and imposed by this chapter for a peacetime emergency and invokes the necessary portions of the state emergency operations plan developed pursuant to section 12.21, subdivision 3, relating to response and recovery aspects and may authorize aid and assistance under the plan.",
	"repealed": false
}