{
	"id": "241.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.17",
	"title": "241.17 REBURIAL.",
	"text": "The commissioner of corrections may remove the body of any person now buried in a cemetery situated upon the land belonging to the state for public institution purposes and rebury it in a cemetery created under the provisions of section 241.16 by complying with the provisions set forth in the following subdivisions of this section.\nThe commissioner shall petition the district court of the county wherein the present cemetery is situated setting forth the reasons for such removal, the place to which the body is to be removed, and praying for an order of the court authorizing such removal. Upon the presentation of such petition, the court shall make its order setting the time, which shall not be less than 60 days from the date of the order, and the place for hearing the same. The commissioner shall serve the nearest relative or, if the commissioner cannot locate any relative, some friend of the person whose body is to be removed by mailing to the friend or relative a copy of the petition and court's order 30 days before the date of hearing and file the commissioner's affidavit of mailing with the court administrator of district court. If the commissioner is unable to locate a relative or friend, the commissioner shall make an affidavit to that effect and file the same with the court administrator of district court.\nUpon the hearing of such petition, if the court determines that it is for the best interests of the public, the relatives and friends that such body be removed and that the same will be conducted in a manner commensurate with the methods commonly employed for the reburial of the dead in the community, the court shall make its order authorizing such removal, setting forth the time within which such removal shall be accomplished and the place to which the body is to be removed. Upon completion of such removal, the director shall cause the name of the person so removed to be entered in the register, together with the number of the lot in the cemetery and file an affidavit thereof with the court administrator of district court.",
	"repealed": false
}