{
	"id": "246.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.16",
	"title": "246.16 UNCLAIMED MONEY OR PERSONAL PROPERTY.",
	"text": "When a patient or resident in a state-operated services facility under the jurisdiction of the executive board dies or is absent without authorization leaving money in the control of the head of the facility or a designee, and there is no claimant or person entitled to the money known to the head of the facility or designee the money may at the discretion of the head of the facility or designee, be expended under the direction of the head of the facility or designee for the benefit of the patients or residents of the facility. The head of the facility or designee must not spend any such unclaimed money until it has remained unclaimed for at least five years. If, at any time after the expiration of the five years, the legal heirs of the patients or residents appear and make proper proof of heirship, they are entitled to receive from the state the sum of money expended by the head of the state-operated services facility or designee belonging to the patient or resident.\nWhen a patient or resident of a state-operated services facility under the jurisdiction of the executive board dies or is absent without authorization, leaving personal property exclusive of money in the custody of the head of the state-operated services facility or designee and the property remains unclaimed for a period of two years, with no person entitled to the property known to the head of the state-operated services or designee, the head of the state-operated services facility or designee may sell the property at public auction. Notice of the sale must be published for two consecutive weeks in a legal newspaper in the county where the state-operated services facility is located and must state the time and place of the sale. The proceeds of the sale, after deduction of the costs of publication and auction, may be expended, at the discretion of the head of the state-operated services facility or designee, for the benefit of the patients or residents of the state-operated services facility. Any patient or resident, or heir or representative of the patient or resident, may file with, and make proof of ownership to, the head of the state-operated services facility or designee of the state-operated services facility disposing of the personal property within four years after the sale. Upon satisfactory proof to the head of the state-operated services or designee, the head of the state-operated services or designee shall certify for payment to the commissioner of management and budget the amount received by the sale of the property.\nNo suit shall be brought for damages consequent to the disposal of personal property or use of money in accordance with this section against the state or any official, employee, or agent thereof.",
	"repealed": false
}