{
	"id": "169.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.771",
	"title": "169.771 SPOT-CHECK OF MOTOR VEHICLE.",
	"text": "The intent of this section is to establish a motor vehicle inspection program administered by the commissioner of public safety evidencing substantial compliance with the federal Highway Safety Act of 1966, Public Law 89-564.\n(a) The commissioner of public safety is directed to accelerate spot-check inspections for unsafe motor vehicles and motor vehicle equipment. Such inspections shall be conducted by the personnel of the State Patrol who shall give the operator of a commercial motor vehicle a signed and dated document as evidence of the inspection.\n(b) However, personnel of the State Patrol may not conduct another spot inspection of a commercial motor vehicle if (1) the operator of the vehicle can show evidence of an inspection, which is free of critical defects, conducted in Minnesota according to this section or section 169.781 within the previous 90 days and (2) a state trooper does not have probable cause to believe the vehicle or its equipment is unsafe or that the operator has engaged in illegal activity. In addition, if the operator shows the state trooper evidence that the commercial motor vehicle has been inspected within the previous 90 days, but the officer has probable cause to believe the vehicle or its equipment is unsafe or to suspect illegal activity, then the vehicle may be inspected to confirm the existence or absence of an unsafe condition or of the suspected illegal activity.\n(c) A vehicle stopped under this section and determined to be a covered farm vehicle as defined in Code of Federal Regulations, title 49, section 390.5, and not carrying hazardous materials of a type or quantity that requires the vehicle to be placarded in accordance with Code of Federal Regulations, title 49, section 172.504, is exempt from further inspection under this section. If probable cause exists to believe the vehicle or its equipment is unsafe or illegal activity is suspected, enforcement action may be initiated.\nThe commissioner of public safety may establish such reasonable rules as are necessary to carry out the provisions of this section, but all spot-check inspections shall be held in compliance with subdivision 2 and in such a manner that the motor vehicle operators, either private or commercial, shall not be unnecessarily inconvenienced either by extended detours, unnecessary delays, or any other unreasonable cause.\nUse of the highways and streets of this state shall constitute consent to spot-check inspections as provided herein.",
	"repealed": false
}