{
	"id": "142B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.05",
	"title": "142B.05 WHO MUST BE LICENSED.",
	"text": "Unless licensed by the commissioner under this chapter, an individual, organization, or government entity must not:\n(1) operate a residential or a nonresidential program;\n(2) receive a child or youth for care, supervision, or placement in foster care or adoption;\n(3) help plan the placement of a child or youth in foster care or adoption or engage in placement activities as defined in section 259.21, subdivision 9, in this state, whether or not the adoption occurs in this state; or\n(4) advertise a residential or nonresidential program.\n(a) This chapter does not apply to:\n(1) residential or nonresidential programs that are provided to a person by an individual who is related unless the residential program is a child foster care placement made by a local social services agency or a licensed child-placing agency, except as provided in subdivision 3;\n(2) nonresidential programs that are provided by an unrelated individual to persons from a single related family;\n(3) programs operated by a public school for children 33 months or older;\n(4) nonresidential programs primarily for children that provide care or supervision for periods of less than three hours a day while the child's parent or legal guardian is in the same building as the nonresidential program or present within another building that is directly contiguous to the building in which the nonresidential program is located;\n(5) homes providing programs for persons placed by a county or a licensed agency for legal adoption, unless the adoption is not completed within two years;\n(6) programs licensed or certified by the commissioner of corrections;\n(7) recreation programs for children or adults that are operated or approved by a park and recreation board whose primary purpose is to provide social and recreational activities;\n(8) programs operated by a school as defined in section 120A.22, subdivision 4; YMCA as defined in section 315.44; YWCA as defined in section 315.44; or JCC as defined in section 315.51, whose primary purpose is to provide child care or services to school-age children;\n(9) Head Start nonresidential programs that operate for less than 45 days in each calendar year;\n(10) programs for children such as scouting, boys clubs, girls clubs, and sports and art programs, and nonresidential programs for children provided for a cumulative total of less than 30 days in any 12-month period;\n(11) the religious instruction of school-age children; Sabbath or Sunday schools; or the congregate care of children by a church, congregation, or religious society during the period used by the church, congregation, or religious society for its regular worship;\n(12) camps licensed by the commissioner of health under Minnesota Rules, chapter 4630;\n(13) residential programs serving school-age children whose sole purpose is cultural or educational exchange, until the commissioner adopts appropriate rules;\n(14) community support services programs as defined in section 245.462, subdivision 6, and family community support services as defined in section 245.4871, subdivision 17;\n(15) the placement of a child by a birth parent or legal guardian in a preadoptive home for purposes of adoption as authorized by section 259.47;\n(16) a program serving only children who are age 33 months or older, that is operated by a nonpublic school, for no more than four hours per day per child, with no more than 20 children at any one time, and that is accredited by:\n(i) an accrediting agency that is formally recognized by the commissioner of education as a nonpublic school accrediting organization; or\n(ii) an accrediting agency that requires background studies and that receives and investigates complaints about the services provided.\nA program that asserts its exemption from licensure under item (ii) shall, upon request from the commissioner, provide the commissioner with documentation from the accrediting agency that verifies that the accreditation is current, that the accrediting agency investigates complaints about services, and that the accrediting agency's standards require background studies on all people providing direct contact services;\n(17) a program operated by a nonprofit organization incorporated in Minnesota or another state that serves youth in kindergarten through grade 12; provides structured, supervised youth development activities; and has learning opportunities take place before or after school, on weekends, or during the summer or other seasonal breaks in the school calendar. A program exempt under this clause is not eligible for child care assistance under chapter 142E. A program exempt under this clause must:\n(i) have a director or supervisor on site who is responsible for overseeing written policies relating to the management and control of the daily activities of the program, ensuring the health and safety of program participants, and supervising staff and volunteers;\n(ii) have obtained written consent from a parent or legal guardian for each youth participating in activities at the site; and\n(iii) have provided written notice to a parent or legal guardian for each youth at the site that the program is not licensed or supervised by the state of Minnesota and is not eligible to receive child care assistance payments;\n(18) Head Start programs that serve only children who are at least three years old but not yet six years old; or\n(19) programs licensed by the commissioner of human services under chapter 245A.\n(b) For purposes of paragraph (a), clause (4), a building is directly contiguous to a building in which a nonresidential program is located if it shares a common wall with the building in which the nonresidential program is located or is attached to that building by skyway, tunnel, atrium, or common roof.\n(c) Nothing in this chapter shall be construed to require licensure for any services provided and funded according to an approved federal waiver plan where licensure is specifically identified as not being a condition for the services and funding.\nNotwithstanding subdivision 2, paragraph (a), clause (1), in order to provide foster care for a child, an individual who is related to the child, other than a parent, or legal guardian, must be licensed by the commissioner except as provided by section 142B.06.\nThe provision in subdivision 2, paragraph (a), clause (2), does not apply to:\n(1) a child care provider who as an applicant for licensure or as a license holder has received a license denial under section 142B.15, a conditional license under section 142B.16, or a sanction under section 142B.18 from the commissioner that has not been reversed on appeal; or\n(2) a child care provider, or a child care provider who has a household member who, as a result of a licensing process, has a disqualification under this chapter that has not been set aside by the commissioner.\n(a) It is a misdemeanor for an individual, organization, or government entity to provide a residential or nonresidential program without a license issued under this chapter and in willful disregard of this chapter unless the program is excluded from licensure under subdivision 2.\n(b) The commissioner may ask the appropriate county attorney or the attorney general to begin proceedings to secure a court order against the continued operation of the program, if an individual, organization, or government entity has:\n(1) failed to apply for a license under this chapter after receiving notice that a license is required or continues to operate without a license after receiving notice that a license is required;\n(2) continued to operate without a license after a license issued under this chapter has been revoked or suspended under this chapter, and the commissioner has issued a final order affirming the revocation or suspension, or the license holder did not timely appeal the sanction; or\n(3) continued to operate without a license after a temporary immediate suspension of a license has been issued under this chapter.\n(c) The county attorney and the attorney general have a duty to cooperate with the commissioner.\nNothing in this section shall prohibit a child care program that is excluded from licensure under subdivision 2, paragraph (a), clause (2), from seeking a license under this chapter. The commissioner shall ensure that any application received from such an excluded provider is processed in the same manner as all other applications for licensed family day care.\nNothing in this section shall prohibit a school-age program that is excluded from licensure under subdivision 2, paragraph (a), clause (27), from seeking a license or continuing to be licensed under this chapter.\nNothing in this section shall prohibit a program that is excluded from licensure under subdivision 2, paragraph (a), clause (26), from seeking licensure. The commissioner shall ensure that any application received from such an excluded provider is processed in the same manner as all other applications for child care center licensure.",
	"repealed": false
}