{
	"id": "56.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/56.125",
	"title": "56.125 OPEN-END LOANS.",
	"text": "A licensee may make open-end loans under this chapter other than loans under an overdraft checking plan and may charge a daily, monthly, or other periodic rate of finance charge on unpaid balances not in excess of the maximum rate of interest permitted by section 56.131, subdivision 1, paragraph (a), under section 47.59, subdivision 3, paragraph (a), clause (1). For purposes of this section \"open-end loan\" means an agreement whereby: (1) the licensee pursuant to written agreement permits the borrower to obtain advances of money from the licensee from time to time or the licensee advances money on behalf of the borrower from time to time as directed by the borrower; (2) the borrower has the option of paying the balance in full at any time without penalty; (3) the amount of each advance and permitted charges and costs are debited to the borrower's account and payments and other credits are credited to the same account; and (4) the charges are computed on the unpaid principal balance of the account from time to time. A finance charge imposed on a transaction subject to this section must be computed on: (1) the previous balance after deducting all payments on accounts received by the licensee during the cycle and all credits to the account during the cycle applicable to any transaction reflected in the previous balance; (2) the average daily balance determined by adding the daily balances on the account for each day in the billing cycle and dividing the total by the number of days in the billing cycle; or (3) daily balances. The daily balance is figured by taking the beginning balance of the account each day, adding any new advances, subtracting any principal payments or credits, and any unpaid interest. The average daily balance is calculated by adding together all of the daily balances for the billing cycle, and the sum is then divided by the total number of days in the billing cycle. A billing cycle is considered to be monthly if the billing dates are on the same day of each month or do not vary by more than four days from that day. If a licensee makes loans under a credit card plan, it may do so only on the same terms and subject to the same conditions as apply to lenders under section 47.59.\nA licensee may take a lien upon real estate as security for any open-end loan at or after such time as the outstanding balance first exceeds $8,208. A subsequent reduction in the balance below $8,208 has no effect on the lien. A licensee may retain the security interest until it terminates the open-end account. If there is no outstanding balance in the account and there is no commitment by the licensee to a line of credit in excess of $8,208, the licensee shall, within 20 days following written demand by the borrower, deliver to the borrower a release of the mortgage on any real property taken as security for the open-end loan agreement. A real estate mortgage authorized for a financial institution secures all advances and obligations thereunder from the date of recording.\nIn addition to the charges authorized in subdivision 1, a licensee may contract for and receive in connection with an open-end loan agreement the additional charges, fees, costs, and expenses with respect to the line of credit limit permitted by sections 47.59, subdivisions 5 and 6, paragraph (a), clause (4); 56.131, subdivisions 2, 5, and 6; and 56.155 with respect to other loans, with the following variations:\n(1) If credit life, disability, or involuntary unemployment insurance is provided and if the insured dies, becomes disabled, or becomes involuntarily unemployed when there is an outstanding open-end loan indebtedness, the amount of the insurance may not exceed the total balance of the loan due on the date of the borrower's death or on the date of the last billing statement in the case of credit life insurance, or all minimum payments which become due on the loan during the covered period of disability in the case of credit disability insurance, or during the covered period of involuntary unemployment in the case of credit involuntary unemployment insurance. The additional charge for credit life insurance, credit disability insurance, or credit involuntary unemployment insurance must be calculated in each billing cycle by applying the current monthly premium rate for the insurance to the unpaid balances in the borrower's account.\n(2) The amount, terms, and conditions of any credit insurance against loss or damage to property must be reasonable in relation to the character and value of the property insured.\nPrior to any licensee taking a lien upon the borrower's homestead, as defined in chapter 510, as security for any open-end loan pursuant to subdivision 2, the borrower shall be provided with a statement in substantially the following form, in boldface type of a minimum size of 12 points, signed and dated by the borrower at the time of the execution of the contract surrendering the homestead exemption, immediately adjacent to a listing of the homestead property: \"I understand that some or all of the above real estate is normally protected by law from the claims of creditors, and I voluntarily give up my right to that protection for the above listed property with respect to claims arising out of this contract.\"",
	"repealed": false
}