{
	"id": "120B.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.021",
	"title": "120B.021 REQUIRED ACADEMIC STANDARDS.",
	"text": "(a) The following subject areas are required for statewide accountability:\n(1) language arts;\n(2) mathematics, encompassing algebra II, integrated mathematics III, or an equivalent in high school, and to be prepared for the three credits of mathematics in grades 9 through 12, the grade 8 standards include completion of algebra;\n(3) science, including earth and space science, life science, and the physical sciences, including chemistry and physics;\n(4) social studies, including history, geography, economics, and government and citizenship that includes civics;\n(5) physical education;\n(6) health; and\n(7) the arts. Public elementary and middle schools must offer at least three and require at least two of the following five arts areas: dance; media arts; music; theater; and visual arts. Public high schools must offer at least three and require at least one of the following five arts areas: media arts; dance; music; theater; and visual arts.\n(b) For purposes of applicable federal law, the academic standards for language arts, mathematics, and science apply to all public school students, except the very few students with extreme cognitive or physical impairments for whom an individualized education program team has determined that the required academic standards are inappropriate. An individualized education program team that makes this determination must establish alternative standards.\n(c) A school district may include child sexual abuse prevention instruction in a health curriculum, consistent with paragraph (a), clause (6). Child sexual abuse prevention instruction may include age-appropriate instruction on recognizing sexual abuse and assault, boundary violations, and ways offenders groom or desensitize victims, as well as strategies to promote disclosure, reduce self-blame, and mobilize bystanders. A school district may provide instruction under this paragraph in a variety of ways, including at an annual assembly or classroom presentation. A school district may also provide parents information on the warning signs of child sexual abuse and available resources.\n(d) District efforts to develop, implement, or improve instruction or curriculum as a result of the provisions of this section must be consistent with sections 120B.10, 120B.11, and 120B.20.\n(e) Locally developed academic standards in health apply until statewide rules implementing statewide health standards under subdivision 3 are required to be implemented in the classroom.\n(a) Upon receiving a student's application signed by the student's parent or guardian, a school district, area learning center, or charter school must declare that a student meets or exceeds a specific academic standard required for graduation under section 120B.02 and this section if the local school board, the school board of the school district in which the area learning center is located, or the charter school board of directors determines that the student:\n(1) is participating in a course of study, including an advanced placement or international baccalaureate course or program; a learning opportunity outside the curriculum of the district, area learning center, or charter school; or an approved preparatory program for employment or postsecondary education that is equally or more rigorous than the corresponding state or local academic standard required by the district, area learning center, or charter school;\n(2) would be precluded from participating in the rigorous course of study, learning opportunity, or preparatory employment or postsecondary education program if the student were required to achieve the academic standard to be waived; and\n(3) satisfactorily completes the requirements for the rigorous course of study, learning opportunity, or preparatory employment or postsecondary education program.\nConsistent with the requirements of this section, the local school board, the school board of the school district in which the area learning center is located, or the charter school board of directors also may formally determine other circumstances in which to declare that a student meets or exceeds a specific academic standard that the site requires for graduation under section 120B.02 and this section.\n(b) A student who satisfactorily completes a postsecondary enrollment options course or program under section 124D.09, or an advanced placement or international baccalaureate course or program under section 120B.13, is not required to complete other requirements of the academic standards corresponding to that specific rigorous course of study.\n(a) The commissioner must consider advice from at least the following stakeholders in developing statewide rigorous core academic standards in language arts, mathematics, science, social studies, including history, geography, economics, government and citizenship, health, and the arts:\n(1) parents of school-age children and members of the public throughout the state;\n(2) teachers throughout the state currently licensed and providing instruction in language arts, mathematics, science, social studies, health, or the arts and licensed elementary and secondary school principals throughout the state currently administering a school site;\n(3) currently serving members of local school boards and charter school boards throughout the state;\n(4) faculty teaching core subjects at postsecondary institutions in Minnesota;\n(5) representatives of the Minnesota business community;\n(6) representatives from the Tribal Nations Education Committee and Tribal Nations and communities in Minnesota, including both Anishinaabe and Dakota; and\n(7) current students, with input from the Minnesota Youth Council.\n(b) Academic standards must:\n(1) be clear, concise, objective, measurable, and grade-level appropriate;\n(2) not require a specific teaching methodology or curriculum; and\n(3) be consistent with the Constitutions of the United States and the state of Minnesota.\n(a) The commissioner, consistent with the requirements of this section and section 120B.022, must adopt statewide rules under section 14.389 for implementing statewide rigorous core academic standards in language arts, mathematics, science, social studies, physical education, and the arts.\n(b) The commissioner must adopt statewide rules for implementing statewide rigorous core academic standards in health.\n(a) The commissioner of education must revise the state's academic standards and graduation requirements and implement a ten-year cycle to review and, consistent with the review, revise state academic standards and related benchmarks, consistent with this subdivision. During each ten-year review and revision cycle, the commissioner also must examine the alignment of each required academic standard and related benchmark with the knowledge and skills students need for career and college readiness and advanced work in the particular subject area. The commissioner must include the contributions of Minnesota American Indian Tribes and communities, including urban Indigenous communities, as related to the academic standards during the review and revision of the required academic standards. The commissioner must embed Indigenous education for all students consistent with recommendations from Tribal Nations and urban Indigenous communities in Minnesota regarding the contributions of American Indian Tribes and communities in Minnesota into the state's academic standards during the review and revision of the required academic standards. The recommendations to embed Indigenous education for all students includes but is not limited to American Indian experiences in Minnesota, including Tribal histories, Indigenous languages, sovereignty issues, cultures, treaty rights, governments, socioeconomic experiences, contemporary issues, and current events.\n(b) The commissioner must ensure that the statewide mathematics assessments administered to students in grades 3 through 8 and 11 are aligned with the state academic standards in mathematics, consistent with section 120B.302, subdivision 3, paragraph (a). The commissioner must implement a review of the academic standards and related benchmarks in mathematics beginning in the 2021-2022 school year and every ten years thereafter.\n(c) The commissioner must implement a review of the academic standards and related benchmarks in arts beginning in the 2017-2018 school year and every ten years thereafter.\n(d) The commissioner must implement a review of the academic standards and related benchmarks in science beginning in the 2018-2019 school year and every ten years thereafter.\n(e) The commissioner must implement a review of the academic standards and related benchmarks in language arts beginning in the 2019-2020 school year and every ten years thereafter.\n(f) The commissioner must implement a review of the academic standards and related benchmarks in social studies beginning in the 2020-2021 school year and every ten years thereafter.\n(g) The commissioner must implement a review of the academic standards and related benchmarks in physical education beginning in the 2026-2027 school year and every ten years thereafter.\n(h) The commissioner must implement a review of the academic standards and related benchmarks in health education beginning in the 2034-2035 school year and every ten years thereafter.\n(i) School districts and charter schools must revise and align local academic standards and high school graduation requirements in world languages and career and technical education to require students to complete the revised standards beginning in a school year determined by the school district or charter school. School districts and charter schools must formally establish a periodic review cycle for the academic standards and related benchmarks in world languages and career and technical education.\n(j) The commissioner of education must embed technology and information literacy standards consistent with recommendations from school media specialists into the state's academic standards and graduation requirements.\n(k) The commissioner of education must embed ethnic studies as related to the academic standards during the review and revision of the required academic standards.\nTo support implementation of Indigenous education for all students, the commissioner must:\n(1) provide historically accurate, Tribally endorsed, culturally relevant, community-based, contemporary, and developmentally appropriate resources. Resources to implement standards must include professional development and must demonstrate an awareness and understanding of the importance of accurate, high-quality materials about the histories, languages, cultures, and governments of local Tribes;\n(2) provide resources to support all students learning about the histories, languages, cultures, governments, and experiences of their American Indian peers and neighbors. Resources to implement standards across content areas must be developed to authentically engage all students and support successful learning; and\n(3) conduct a needs assessment by December 31, 2023. The needs assessment must fully inform the development of future resources for Indigenous education for all students by using information from American Indian Tribes and communities in Minnesota, including urban Indigenous communities, Minnesota's Tribal Nations Education Committee, schools and districts, students, and educational organizations. The commissioner must submit a report on the findings and recommendations from the needs assessment to the chairs and ranking minority members of legislative committees with jurisdiction over education; to the American Indian Tribes and communities in Minnesota, including urban Indigenous communities; and to all schools and districts in the state by February 1, 2024. The commissioner of education must consult with Tribal Nations located in Minnesota and Minnesota's Tribal Nations Education Committee about the need for additional funding necessary for each Tribal Nation located in Minnesota to continue developing resources for Indigenous education for all students. By February 15, 2025, the commissioner must provide links to the materials developed by the Tribal Nations on its website and submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over education highlighting the materials that have been developed and documenting the need for additional resources. A consultation under this section does not replace or limit any consultation required under section 10.65.",
	"repealed": false
}