{
	"id": "125A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.30",
	"title": "125A.30 INTERAGENCY EARLY INTERVENTION COMMITTEES.",
	"text": "(a) A group of school districts or special education cooperatives, in cooperation with the county and tribal health and human service agencies located in the county or counties in which the districts or cooperatives are located, must establish an Interagency Early Intervention Committee for children with disabilities under age five and their families under this section, and for children with disabilities ages three to 22 consistent with the requirements under sections 125A.023 and 125A.027. Committees must include representatives of local health, education, and county human service agencies, early childhood family education programs, Head Start, parents of young children with disabilities under age 12, child care resource and referral agencies, school readiness programs, current service providers, and agencies that serve families experiencing homelessness, and may also include representatives from other private or public agencies and school nurses. The committee must elect a chair from among its members and must meet at least quarterly.\n(b) The committee must develop and implement interagency policies and procedures concerning the following ongoing duties:\n(1) develop public awareness systems designed to inform potential recipient families, especially parents with premature infants, or infants with other physical risk factors associated with learning or development complications, of available programs and services;\n(2) to reduce families' need for future services, and especially parents with premature infants, or infants with other physical risk factors associated with learning or development complications, implement interagency child find systems designed to actively seek out, identify, and refer infants and young children with, or at risk of, disabilities, including a child under the age of three who: (i) is the subject of a substantiated case of abuse or neglect or (ii) is identified as directly affected by illegal substance abuse, or withdrawal symptoms resulting from prenatal drug exposure;\n(3) implement a process for assuring that services involve cooperating agencies at all steps leading to individualized programs;\n(4) identify the current services and funding being provided within the community for children with disabilities under age five and their families; and\n(5) develop a plan for the allocation and expenditure of federal early intervention funds under United States Code, title 20, section 1471 et seq. (Part C, Public Law 108-446) and United States Code, title 20, section 631, et seq. (Chapter I, Public Law 89-313).\n(c) The local committee shall also participate in needs assessments and program planning activities conducted by local social service, health and education agencies for young children with disabilities and their families.",
	"repealed": false
}