{
	"id": "327A.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/327A.051",
	"title": "327A.051 HOME WARRANTY DISPUTE RESOLUTION.",
	"text": "(a) The commissioner of labor and industry shall maintain a list of persons who consent to serve as qualified neutrals for purposes of this section. The commissioner shall establish application requirements and qualifications for qualified neutrals, taking into consideration the education, experience, and training of the applicant, potential conflicts of interest, and that the purpose of the process is to assist parties in determining an agreeable scope of repair or other resolution of their dispute.\n(b) As a condition of being included on the panel of neutrals identified in this section, the commissioner of labor and industry may charge each qualified neutral a fee of $200 per year for the administration of the home warranty dispute resolution process.\n(a) The home warranty dispute resolution process required by this section is commenced by written application to the commissioner. A request must include the complete current address and full name of the contact person for each participating party.\n(b) Within ten days of receiving a written request, the commissioner shall provide each party with a written list of three qualified neutrals randomly selected from the panel of neutrals established under subdivision 1. The commissioner shall also provide complete contact information for each qualified neutral.\n(c) Within five business days after receipt of the list from the commissioner, the parties shall mutually select one of the three qualified neutrals identified by the commissioner to serve as the qualified neutral for their dispute. If the parties cannot mutually agree on a neutral, the vendor or home improvement contractor shall strike one of the neutrals from the list, the vendee or owner shall subsequently strike one of the remaining neutrals from the list, and the remaining neutral shall serve as the qualified neutral for the dispute resolution process. The parties shall notify the selected qualified neutral and the commissioner of the selection.\n(a) The qualified neutral selected by the parties shall convene, and each party shall attend, an in-person conference of the parties. The qualified neutral shall select the date for the conference after consulting the parties. The conference must occur no later than 30 days after the neutral's selection, except by mutual agreement of the parties. In addition, the neutral shall collect from each party an administrative fee of $25 and shall submit those fees to the commissioner no later than ten days after the completion of the conference.\n(b) At least seven days before the conference, each party must provide the qualified neutral and the other party with all information and documentation necessary to understanding the dispute, or the alleged loss or damages.\n(c) After reviewing the information and documentation provided by the parties and after consulting with the parties at the conference, the neutral shall issue to the parties a nonbinding, written determination, which must include, to the extent possible, findings and recommendations on the scope and amount of repairs necessary, if any. The qualified neutral shall mail the determination to each party within ten days after the conference.\n(d) The parties shall share the expense of the qualified neutral's billed time equally, unless otherwise agreed. The neutral's billed time for evaluation of documents, meeting with the parties, and issuing a written determination must not exceed six hours, unless agreed to in writing by both parties. The neutral must identify the neutral's hourly rate to the parties.\nIf both parties agree, the parties may designate an alternative dispute resolution process in lieu of participating in the home warranty dispute resolution process established by this section. If the parties agree to an alternative dispute resolution process, they shall provide written notice of the agreement and a description of the selected process to the commissioner as soon as practicable, but no later than the date the parties are required to select a neutral under subdivision 2.\n(a) The written determination issued by the qualified neutral and all communications relating to the home warranty dispute resolution process, except those between any party and the commissioner, are deemed confidential settlement communications pursuant to Rule 408 of the Minnesota Rules of Evidence.\n(b) No party may use the written offer of repair provided by a vendor or home improvement contractor, a counteroffer to repair, or a written determination issued by the qualified neutral as evidence of liability in subsequent litigation between the parties. The qualified neutral may not be called to testify regarding the dispute resolution proceedings.\n(c) Any amount paid by a party for the services of a qualified neutral under this section is deemed a taxable cost of the prevailing party in a subsequent litigation involving the same subject matter.\nFailure to strictly comply with the timelines in this section shall not be grounds for dismissal of any claim brought under section 327A.05, provided that the parties establish good faith effort in complying with this section.",
	"repealed": false
}