{
	"id": "144.1204",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1204",
	"title": "144.1204 SURETY REQUIREMENTS.",
	"text": "The commissioner may require an applicant for a license under section 144.1202, or a person who was formerly licensed by the Nuclear Regulatory Commission and is now subject to sections 144.1201 to 144.1204, to post financial assurances to ensure the completion of all requirements established by the commissioner for the decontamination, closure, decommissioning, and reclamation of sites, structures, and equipment used in conjunction with activities related to licensure. The financial assurances posted must be sufficient to restore the site to unrestricted future use and must be sufficient to provide for surveillance and care when radioactive materials remain at the site after the licensed activities cease. The commissioner may establish financial assurance criteria by rule. In establishing such criteria, the commissioner may consider:\n(1) the chemical and physical form of the licensed radioactive material;\n(2) the quantity of radioactive material authorized;\n(3) the particular radioisotopes authorized and their subsequent radiotoxicity;\n(4) the method in which the radioactive material is held, used, stored, processed, transferred, or disposed of; and\n(5) the potential costs of decontamination, treatment, or disposal of a licensee's equipment and facilities.\nThe commissioner may, by rule, establish types of financial assurances that meet the requirements of this section. Such financial assurances may include bank letters of credit, deposits of cash, or deposits of government securities.\nFinancial assurances must be established together with trust agreements. Both the financial assurances and the trust agreements must be in a form and substance that meet requirements established by the commissioner.\nThe commissioner is authorized to exempt from the requirements of this section, by rule, any category of licensee upon a determination by the commissioner that an exemption does not result in a significant risk to the public health or safety or to the environment and does not pose a financial risk to the state.\nNothing in this section relieves a licensee of a civil liability incurred, nor may this section be construed to relieve the licensee of obligations to prevent or mitigate the consequences of improper handling or abandonment of radioactive materials.",
	"repealed": false
}