{
	"id": "43A.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.345",
	"title": "43A.345 EARLY RETIREMENT INCENTIVE.",
	"text": "The incentive in subdivision 2 is available to any employee of the Bureau of Criminal Apprehension in the Department of Public Safety who:\n(1) retires during the pay period in which the employee's 55th birthday occurs, or retires during the first pay period after the employee's 55th birthday in which the employee's anniversary date occurs;\n(2) is covered by the State Patrol retirement fund and is eligible to receive an annuity from that fund at the time of retirement; and\n(3) is receiving the full employer contribution for health and dental coverage immediately before retirement, or is on an unpaid leave of absence immediately before retirement which began not more than six months before retirement, during which leave the employee continues to be covered by the state group insurance program by employee payment of premiums.\nFor an employee who meets the requirements of subdivision 1, the employer shall pay the full employer contribution, as specified in the collective bargaining agreement with the bargaining unit in section 179A.10, subdivision 2, clause (1), for health and dental insurance for the employee and, if the employee had dependent coverage immediately before retirement, for the employee's dependents. Notwithstanding section 179A.20, subdivision 2a, the employer contributions under this subdivision must continue until the employee reaches age 65. The postretirement health and dental insurance coverage provided under this section is that coverage the employee was receiving as of the date of retirement, subject to any changes in coverage specified in the collective bargaining agreement with the bargaining unit in section 179A.10, subdivision 2, clause (1).\nAn employee who meets the conditions in subdivision 1 but has attained the age of 50 but not yet 55 at the time of retirement must receive until age 65 an employer contribution of 120 times the amount of the monthly employer contribution applicable to the employee at the time of retirement, divided by the number of months from the date of retirement until the employee attains age 65.\nIf a collective bargaining agreement with the bargaining unit in section 179A.10, subdivision 2, clause (1), does not contain an early retirement incentive similar to that provided in this section, the benefits under this section are not available to an employee who retires after the implementation date of the agreement.\nAn employee otherwise eligible for an early retirement incentive under subdivisions 1 and 2 who retires on or after the employee's 55th birthday and between June 30, 1997, and July 1, 1998, is entitled to the incentive in subdivision 2.",
	"repealed": false
}