{
	"id": "62U.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.03",
	"title": "62U.03 HEALTH CARE HOMES.",
	"text": "(a) By January 1, 2010, health plan companies shall include health care homes in their provider networks and by July 1, 2010, shall pay a care coordination fee for their members who choose to enroll in health care homes certified by the commissioner under this section. Health plan companies shall develop payment conditions and terms for the care coordination fee for health care homes participating in their network in a manner that is consistent with the system developed under section 256B.0753. Nothing in this section shall restrict the ability of health plan companies to selectively contract with health care providers, including health care homes. Health plan companies may reduce or reallocate payments to other providers to ensure that implementation of care coordination payments is cost neutral.\n(b) By July 1, 2010, the commissioner of management and budget shall implement the care coordination payments for participants in the state employee group insurance program. The commissioner of management and budget may reallocate payments within the health care system in order to ensure that the implementation of this section is cost neutral.\n(a) For purposes of this section, the following definitions apply.\n(b) \"Commissioner\" means the commissioner of health.\n(c) \"Health plan company\" has the meaning provided in section 62Q.01, subdivision 4.\n(d) \"Personal clinician\" means a physician licensed under chapter 147, a physician assistant licensed and practicing under chapter 147A, or an advanced practice registered nurse licensed and registered to practice under chapter 148.\n(a) The commissioner of health shall develop and implement standards of certification for health care homes. In developing these standards, the commissioner shall consider existing standards developed by national independent accrediting and medical home organizations. The standards developed by the commissioner must meet the following criteria:\n(1) emphasize, enhance, and encourage the use of primary care, and include the use of primary care physicians, advanced practice registered nurses, and physician assistants as personal clinicians;\n(2) focus on delivering high-quality, efficient, and effective health care services;\n(3) encourage patient-centered care, including active participation by the patient and family or a legal guardian, or a health care agent as defined in chapter 145C, as appropriate in decision making and care plan development, and providing care that is appropriate to the patient's race, ethnicity, and language;\n(4) provide patients with a consistent, ongoing contact with a personal clinician or team of clinical professionals to ensure continuous and appropriate care for the patient's condition;\n(5) ensure that health care homes develop and maintain appropriate comprehensive care plans for their patients with complex or chronic conditions, including an assessment of health risks and chronic conditions;\n(6) enable and encourage utilization of a range of qualified health care professionals, including dedicated care coordinators, in a manner that enables providers to practice to the fullest extent of their license;\n(7) focus initially on patients who have or are at risk of developing chronic health conditions;\n(8) incorporate measures of quality, resource use, cost of care, and patient experience;\n(9) ensure the use of health information technology and systematic follow-up, including the use of patient registries; and\n(10) encourage the use of scientifically based health care, patient decision-making aids that provide patients with information about treatment options and their associated benefits, risks, costs, and comparative outcomes, and other clinical decision support tools.\n(b) In developing these standards, the commissioner shall consult with national and local organizations working on health care home models, physicians, relevant state agencies, health plan companies, hospitals, other providers, patients, and patient advocates.\n(c) For the purposes of developing and implementing these standards, the commissioner may use the expedited rulemaking process under section 14.389.\n(a) A personal clinician or a primary care clinic may be certified as a health care home. If a primary care clinic is certified, all of the primary care clinic's clinicians must meet the criteria of a health care home. To be certified as a health care home, a clinician or clinic must meet the standards set by the commissioner in accordance with this section. Certification as a health care home is voluntary. To maintain their status as health care homes, clinicians or clinics must renew their certification every three years.\n(b) Clinicians or clinics certified as health care homes must offer their health care home services to all their patients with complex or chronic health conditions who are interested in participation.\n(c) Health care homes must participate in the health care home collaborative established under subdivision 6.\n(a) Nothing in this section precludes the continued development of existing medical or health care home projects currently operating or under development by the commissioner of human services or precludes the commissioner of human services from establishing alternative models and payment mechanisms for persons who are enrolled in integrated Medicare and Medicaid programs under section 256B.69, subdivisions 23 and 28, are enrolled in managed care long-term care programs under section 256B.69, subdivision 6b, are dually eligible for Medicare and medical assistance, are in the waiting period for Medicare, or who have other primary coverage.\n(b) The commissioner shall waive health care home certification requirements if an applicant demonstrates that compliance with a certification requirement will create a major financial hardship or is not feasible, and the applicant establishes an alternative way to accomplish the objectives of the certification requirement.\nThe commissioner shall establish a health care home collaborative to provide an opportunity for health care homes and state agencies to exchange information related to quality improvement and best practices.\n(a) For continued certification under this section, health care homes must meet process, outcome, and quality standards as developed and specified by the commissioner. The commissioner shall collect data from health care homes necessary for monitoring compliance with certification standards and for evaluating the impact of health care homes on health care quality, cost, and outcomes.\n(b) The commissioner may contract with a private entity to perform an evaluation of the effectiveness of health care homes. Data collected under this subdivision is classified as nonpublic data under chapter 13.\nThe commissioner of human services shall encourage state health care program enrollees who have a complex or chronic condition to select a primary care clinic with clinicians who have been certified as health care homes.\nThe health care home and the county shall coordinate care and services provided to patients enrolled with a health care home who have complex medical needs or a disability, and who need and are eligible for additional local services administered by counties, including but not limited to waivered services, mental health services, social services, public health services, transportation, and housing. The coordination of care and services must be as provided in the plan established by the patient and the health care home.\nThe commissioner of human services shall implement a pediatric care coordination service for children with high-cost medical or high-cost psychiatric conditions who are at risk of recurrent hospitalization or emergency room use for acute, chronic, or psychiatric illness, who receive medical assistance services. Care coordination services must be targeted to children not already receiving care coordination through another service and may include but are not limited to the provision of health care home services to children admitted to hospitals that do not currently provide care coordination. Care coordination services must be provided by care coordinators who are directly linked to provider teams in the care delivery setting, but who may be part of a community care team shared by multiple primary care providers or practices. For purposes of this subdivision, the commissioner of human services shall, to the extent possible, use the existing health care home certification and payment structure established under this section and section 256B.0753.\n(a) The commissioner shall establish a health care homes advisory committee to advise the commissioner on the ongoing statewide implementation of the health care homes program authorized in this section.\n(b) The commissioner shall establish an advisory committee that includes representatives of the health care professions such as primary care providers, mental health providers, nursing and care coordinators, certified health care home clinics with statewide representation, health plan companies, state agencies, employers, academic researchers, consumers, and organizations that work to improve health care quality in Minnesota. At least 25 percent of the committee members must be consumers or patients in health care homes. The commissioner, in making appointments to the committee, shall ensure geographic representation of all regions of the state.\n(c) The advisory committee shall advise the commissioner on ongoing implementation of the health care homes program, including, but not limited to, the following activities:\n(1) implementation of certified health care homes across the state on performance management and implementation of benchmarking;\n(2) implementation of modifications to the health care homes program based on results of the legislatively mandated health care homes evaluation;\n(3) statewide solutions for engagement of employers and commercial payers;\n(4) potential modifications of the health care homes rules or statutes;\n(5) consumer engagement, including patient and family-centered care, patient activation in health care, and shared decision making;\n(6) oversight for health care homes subject matter task forces or workgroups; and\n(7) other related issues as requested by the commissioner.\n(d) The advisory committee shall have the ability to establish subcommittees on specific topics. The advisory committee is governed by section 15.059. Notwithstanding section 15.059, the advisory committee does not expire.",
	"repealed": false
}