{
	"id": "469.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.351",
	"title": "469.351 TRANSIT IMPROVEMENT AREA LOAN PROGRAM.",
	"text": "(a) The terms defined in this section have the meanings given them and apply to sections 469.35 and 469.351.\n(b) \"Applicant\" means a local governmental unit or a joint powers board, established under section 471.59.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Eligible organization\" means an applicant that has been designated as a transit improvement area by the commissioner.\n(e) \"Local governmental unit\" means a statutory or home rule charter city or town, or a county.\n(f) \"Transit improvement area\" means a geographic area designated by the commissioner composed of land parcels that are in proximity to a transit station.\n(g) \"Transit station\" means a physical structure to support the interconnection of public transit modes including at least one of the following modes: bus rapid transit, light rail transit, and commuter rail.\nA transit improvement area must increase the effectiveness of a transit project by incorporating one or more public transit modes with commercial, residential, or mixed-use development and by providing for safe and pedestrian-friendly use. The commissioner, in consultation with affected state and regional agencies, must designate transit improvement areas that meet the objectives under this subdivision. Affected state and regional agencies include, but are not limited to, the Minnesota Department of Transportation, the Minnesota Housing Finance Agency, and the Metropolitan Council for transit improvement areas located in the seven-county metropolitan region. To be eligible for designation, an applicant must submit a transit area improvement plan according to the requirements and timelines established by the commissioner. At a minimum, the plan must include the information specified under subdivision 3. The commissioner may modify an applicant's plan to better achieve the objectives of transit improvement areas. The commissioner must notify applicants of the designations and must provide a statement of any changes to an applicant's plan with justification for all changes.\n(a) An applicant must adopt a transit area improvement plan by resolution before submitting the application to the commissioner with the information required in this subdivision. Each transit area improvement plan must include the following:\n(1) a map indicating the geographic boundaries of the transit improvement area;\n(2) a description of the project for which funding under subdivision 4 is being requested;\n(3) an analysis of the demographic mix of people who are anticipated to use the transit station;\n(4) a description of the ownership and intended use of public and private facilities to be constructed in the transit improvement area, including infrastructure, buildings and other structures, and parks;\n(5) a description of pedestrian-friendly improvements to be provided, including walkways, parkways, and signage;\n(6) a statement of findings that the redevelopment or development of the transit improvement area promotes higher density land uses resulting in increased transit ridership;\n(7) a statement of the anticipated sources and amounts of local public funds;\n(8) a statement of the anticipated sources and amounts of private funds;\n(9) a statement of the anticipated sources and amounts of leveraged regional, state, and federal funds;\n(10) a description of the linkages to existing and proposed local, regional, and state transit systems; and\n(11) a description of other factors in the proposed development to increase ridership.\n(b) Transit improvement area plans with a residential component must propose at least 12 residential units per acre or a density bonus that allows for an increase in the number of residential units over what is permitted by the underlying zoning. The plan must include a description of the variety of housing types, including housing appropriate for low-income persons, disabled persons, and senior citizens and the prices for each housing type within the transit improvement area.\n(a) The commissioner may make loans to eligible organizations to be used for eligible costs under paragraph (b). A loan must be used for a designated transit improvement area, under the following terms:\n(1) the eligible organization must guarantee repayment of 100 percent of the loan;\n(2) a loan must be for a term of ten years, unless repayment is from a tax increment financing district or other state or federal funds, at an interest rate of two percent;\n(3) the eligible organization must make annual interest-only payments during the ten-year term of the loan;\n(4) the eligible organization must pay the entire principal amount of the initial loan at the end of the ten-year term;\n(5) a loan may not exceed $2,000,000;\n(6) the commissioner must disburse the loan on a cash-needs basis, based on costs incurred by the eligible organization, as well as reporting and other requirements outlined in subdivision 5;\n(7) the eligible organization must maintain the funds in accounts that allow the funds to be readily available for business investments;\n(8) the eligible organization and the commissioner may agree on contract specifications that are consistent with payback from a tax increment financing district or from any other state and federal funds that may be forthcoming; and\n(9) an eligible organization that receives a loan must report annually, in a format prescribed by the commissioner, on the nature and amount of the business investments in the transit improvement area, including an account of each financing transaction involving loans received under this section, the types and amounts of financing from sources other than the transit improvement area loan, the number of jobs created, and the amount of private sector and nonstate investment leveraged.\n(b) Loans under this section must be used to supplement and not replace funding from existing sources or programs. Loans must not be used for the construction costs of transit stations; transit systems; or the operating costs of public transit or transportation, including, but not limited to, the costs of maintaining, staffing, or operating transit stations. Loans from the bond proceeds fund must be spent to acquire and to better publicly owned land and buildings and other public improvements of a capital nature. Loans can be used for the following eligible expenditures according to an approved transit area improvement plan:\n(1) clearing land;\n(2) relocation costs;\n(3) corrections for soil, including removing or remediation of hazardous substances;\n(4) construction or installation of walkways, bridges or tunnels for pedestrians, bikeways, parking facilities, and signage;\n(5) improvements to streetscapes;\n(6) construction of public infrastructure to support construction of new affordable housing, senior housing, or housing for disabled persons;\n(7) construction of public infrastructure to support job creation in the area, especially small business development;\n(8) developing green spaces and parks; and\n(9) administrative expenses of the local authority.\n(c) All loan repayments under this section must be made to the appropriate account under section 469.35 for reinvestment in transit improvement areas.\nAll loans under this section are subject to an investment agreement that must include:\n(1) a description of the eligible organization, including business finance experience, qualifications, and investment history;\n(2) a description of the uses of investment proceeds by the eligible organization;\n(3) an explanation of the investment objectives; and\n(4) a description of the method of payment.",
	"repealed": false
}