{
	"id": "356.214",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.214",
	"title": "356.214 ACTUARIAL VALUATION PREPARATION.",
	"text": "(a) The governing board or managing or administrative official of each public pension plan and retirement fund or plan enumerated in paragraph (b) shall contract with an established actuarial consulting firm to conduct annual actuarial valuations and related services. The principal from the actuarial consulting firm on the contract must be an approved actuary under section 356.215, subdivision 1, paragraph (c).\n(b) Actuarial services must include the preparation of actuarial valuations and related actuarial work for the following retirement plans:\n(1) the teachers retirement plan, Teachers Retirement Association;\n(2) the general state employees retirement plan, Minnesota State Retirement System;\n(3) the correctional employees retirement plan, Minnesota State Retirement System;\n(4) the State Patrol retirement plan, Minnesota State Retirement System;\n(5) the judges retirement plan, Minnesota State Retirement System;\n(6) the general employees retirement plan, Public Employees Retirement Association;\n(7) the public employees police and fire plan, Public Employees Retirement Association;\n(8) the St. Paul teachers retirement plan, St. Paul Teachers Retirement Fund Association;\n(9) the legislators retirement plan, Minnesota State Retirement System; and\n(10) the local government correctional service retirement plan, Public Employees Retirement Association.\n(c) The actuarial valuation for the legislators retirement plan must include a separate calculation of total plan actuarial accrued liabilities due to constitutional officer coverage under section 3A.17.\n(d) The contracts must require completion of the annual actuarial valuation calculations on a fiscal year basis, with the contents of the actuarial valuation calculations as specified in section 356.215, and in conformity with the standards for actuarial work adopted by the Legislative Commission on Pensions and Retirement.\nThe contracts must require completion of annual experience data collection and processing and a quadrennial published experience study for the plans listed in paragraph (b), clauses (1), (2), and (6), as provided for in the standards for actuarial work adopted by the commission. The experience data collection, processing, and analysis must evaluate the following:\n(1) individual salary progression;\n(2) the rate of return on investments based on the current asset value;\n(3) payroll growth;\n(4) mortality;\n(5) retirement age;\n(6) withdrawal; and\n(7) disablement.\n(e) The actuary shall annually prepare a report to the governing or managing board or administrative official and the legislature, summarizing the results of the actuarial valuation calculations. The actuary shall include with the report any recommendations concerning the appropriateness of the support rates to achieve proper funding of the retirement plans by the required funding dates. The actuary shall, as part of the quadrennial experience study, include recommendations on the appropriateness of the actuarial valuation assumptions required for evaluation in the study.\n(f) If the actuarial gain and loss analysis in the actuarial valuation calculations indicates a persistent pattern of sizable gains or losses, the governing or managing board or administrative official shall direct the actuary to prepare a special experience study for a plan listed in paragraph (b), clause (3), (4), (5), (7), (8), (9), or (10), in the manner provided for in the standards for actuarial work adopted by the commission.\n[Repealed, 2008 c 349 art 10 s 18]\nA copy of the actuarial valuations and experience studies prepared by the actuary retained under a contract provided for in this section must be filed with the executive director of the Legislative Commission on Pensions and Retirement.\n(a) The Legislative Commission on Pensions and Retirement may contract with an established actuarial consulting firm to audit or review the actuarial valuations, experience studies, and actuarial cost analyses prepared by the actuary retained by the governing or managing boards, or administrative officials of each of the plans or funds listed in subdivision 1, paragraph (b). The principal representative from the actuarial consulting firm so engaged must be an approved actuary under section 356.215, subdivision 1, paragraph (c).\n(b) Any actuarial consulting firm retained under paragraph (a) will, according to a schedule determined under an agreement with the Legislative Commission on Pensions and Retirement, audit the valuation reports submitted by the actuary retained by each governing or managing board or administrative official, and provide an assessment of the reasonableness, reliability, and areas of concern or potential improvement in the specific reports reviewed, the procedures utilized by any particular reporting actuary, or general modifications to standards, procedures, or assumptions that the commission may wish to consider. Actuarial firms retained by the retirement funds must cooperate fully and make available any data or other materials necessary for the commission-retained actuary to conduct an adequate review and to render advice to the commission.",
	"repealed": false
}