{
	"id": "256B.795",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.795",
	"title": "256B.795 MATERNAL AND INFANT HEALTH REPORT.",
	"text": "(a) The commissioner of human services, in consultation with the commissioner of health, shall submit a biennial report beginning April 15, 2022, to the chairs and ranking minority members of the legislative committees with jurisdiction over health policy and finance on the effectiveness of state maternal and infant health policies and programs addressing health disparities in prenatal and postpartum health outcomes. For each reporting period, the commissioner shall determine the number of women enrolled in the medical assistance program who are pregnant or are in the 12-month postpartum period of eligibility and the percentage of women in that group who, during each reporting period:\n(1) received prenatal services;\n(2) received doula services;\n(3) gave birth by primary cesarean section;\n(4) gave birth to an infant who received care in the neonatal intensive care unit;\n(5) gave birth to an infant who was premature or who had a low birth weight;\n(6) experienced postpartum hemorrhage;\n(7) received postpartum care within six weeks of giving birth; and\n(8) received a prenatal and postpartum follow-up home visit from a public health nurse.\n(b) These measurements must be determined through an analysis of the utilization data from claims submitted during each reporting period and by any other appropriate means. The measurements for each metric must be determined in the aggregate stratified by race and ethnicity.\n(c) The commissioner shall establish a baseline for the metrics described in paragraph (a) using calendar year 2017. The initial report due April 15, 2022, must contain the baseline metrics and the metrics data for calendar years 2019 and 2020. The following reports due biennially thereafter must contain the metrics for the preceding two calendar years.\n(d) This section expires December 31, 2034.",
	"repealed": false
}