{
	"id": "116R.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.04",
	"title": "116R.04 REVENUE BONDS; PURPOSES, TERMS, APPROVAL.",
	"text": "The commissioner from time to time may issue negotiable bonds in one or more series or issues in a principal amount which, in the opinion of the commissioner of employment and economic development, is necessary to provide sufficient funds for achieving the purposes of sections 116R.01 to 116R.15, which may include the construction of a heavy maintenance facility for aircraft to be located at the Duluth International Airport, the financing of an aircraft engine repair facility in the city of Hibbing, the payment of interest on bonds of the commissioner, the establishment of reserves to secure the bonds, and the payment of all other expenditures of the commissioner and the owner of a financed facility incident to and necessary or convenient to carry out the purposes and powers of sections 116R.01 to 116R.15. The bonds may be issued as bonds or notes or in any other form authorized by law. Except as provided in subdivision 3, section 116R.02, subdivision 4, paragraph (a), or an order of the commissioner or indenture authorizing the bonds, sections 16A.631 to 16A.675 do not apply to the bonds authorized under section 116R.02.\nThe commissioner from time to time may issue bonds for the purpose of refunding any bonds then outstanding, including the payment of any redemption premiums thereon, any interest accrued or to accrue to the redemption date, and costs related to the issuance and sale of the bonds. The proceeds of any refunding bonds may, in the discretion of the commissioner, be applied to the purchase or payment at maturity of the bonds to be refunded, to the redemption of such outstanding bonds on any redemption date, or to pay interest on the refunding bonds and may, pending such application, be placed in escrow to be applied to such purchase, payment, retirement, or redemption. Any such escrowed proceeds, pending such use, may be invested and reinvested in obligations that are authorized investments under section 11A.24. The income earned or realized on any such investment may also be applied to the payment of the bonds to be refunded, interest or premiums on the refunded bonds, or to pay interest on the refunding bonds. After the terms of the escrow have been fully satisfied, any balance of such proceeds and any investment income may be returned to the general fund or, if applicable, the state bond fund, for use in any lawful manner. All refunding bonds issued under the provisions of this subdivision must be issued and secured in the manner provided by order of the commissioner, provided that any refunding bonds may be secured in any manner by which the refunded bonds were secured and payable from any source from which the refunded bonds were payable.\nAll bonds issued under this section must be issued in the form and manner and information in a bond register is subject to the limitations provided in section 16A.672.\nThe commissioner may covenant and agree with the holders of the bonds that the state will comply, insofar as possible, with the provisions of the United States Internal Revenue Code now or hereafter enacted that are applicable to the bonds and that establish conditions under which the interest to be paid on the bonds will not be includable in gross income for federal tax purposes.\nThe bonds may be issued without regard to whether the interest to be paid on them is includable in gross income for federal tax purposes.",
	"repealed": false
}