{
	"id": "260B.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.163",
	"title": "260B.163 HEARING.",
	"text": "(a) Except for hearings arising under section 260B.425, hearings on any matter shall be without a jury and may be conducted in an informal manner, except that a child who is prosecuted as an extended jurisdiction juvenile has the right to a jury trial on the issue of guilt. The rules of evidence promulgated pursuant to section 480.0591 and the law of evidence shall apply in adjudicatory proceedings involving a child alleged to be delinquent, an extended jurisdiction juvenile, or a juvenile petty offender, and hearings conducted pursuant to section 260B.125 except to the extent that the rules themselves provide that they do not apply.\n(b) When a continuance or adjournment is ordered in any proceeding, the court may make any interim orders as it deems in the best interests of the minor in accordance with the provisions of sections 260B.001 to 260B.421.\n(c) Except as otherwise provided in this paragraph, the court shall exclude the general public from hearings under this chapter and shall admit only those persons who, in the discretion of the court, have a direct interest in the case or in the work of the court. The court shall permit the victim of a child's delinquent act to attend any related delinquency proceeding, except that the court may exclude the victim:\n(1) as a witness under the Rules of Criminal Procedure; and\n(2) from portions of a certification hearing to discuss psychological material or other evidence that would not be accessible to the public.\nThe court shall open the hearings to the public in delinquency or extended jurisdiction juvenile proceedings where the child is alleged to have committed an offense or has been proven to have committed an offense that would be a felony if committed by an adult and the child was at least 16 years of age at the time of the offense, except that the court may exclude the public from portions of a certification hearing to discuss psychological material or other evidence that would not be accessible to the public in an adult proceeding.\n(d) In all delinquency cases a person named in the charging clause of the petition as a person directly damaged in person or property shall be entitled, upon request, to be notified by the court administrator in writing, at the named person's last known address, of (1) the date of the certification or adjudicatory hearings, and (2) the disposition of the case.\nA child who is the subject of a petition, and the parents, guardian, or legal custodian of the child have the right to participate in all proceedings on a petition. Official tribal representatives have the right to participate in any proceeding that is subject to the Indian Child Welfare Act of 1978, United States Code, title 25, sections 1901 to 1963.\nAny grandparent of the child has a right to participate in the proceedings to the same extent as a parent, if the child has lived with the grandparent within the two years preceding the filing of the petition. At the first hearing following the filing of a petition, the court shall ask whether the child has lived with a grandparent within the last two years, except that the court need not make this inquiry if the petition states that the child did not live with a grandparent during this time period. Failure to notify a grandparent of the proceedings is not a jurisdictional defect.\nNotwithstanding any provision of subdivision 1 to the contrary, in any delinquency proceedings in which the alleged victim of the delinquent act is testifying in court, the victim may choose to have a supportive person who is not scheduled to be a witness in the proceedings, present during the testimony of the victim.\n(a) The child, parent, guardian or custodian has the right to effective assistance of counsel in connection with a proceeding in juvenile court. This right does not apply to a child who is charged with a juvenile petty offense as defined in section 260B.007, subdivision 16, unless the child is charged with a third or subsequent juvenile alcohol or controlled substance offense and may be subject to the alternative disposition described in section 260B.235, subdivision 6.\n(b) The court shall appoint counsel, or standby counsel if the child waives the right to counsel, for a child who is:\n(1) charged by delinquency petition with a gross misdemeanor or felony offense; or\n(2) the subject of a delinquency proceeding in which out-of-home placement has been proposed.\n(c) The court shall appoint counsel to represent the child under section 611.14, clause (4), or the parents or guardian in any case in which it feels that such an appointment is appropriate if the person would be financially unable to obtain counsel under the guidelines set forth in section 611.17, except a juvenile petty offender who does not have the right to counsel under paragraph (a). If the court appoints standby or advisory counsel, the cost of counsel shall be paid for by the Office of the State Court Administrator with state funds or, if the prosecutor requests the appointment, by the governmental unit conducting the prosecution. In no event may the court order the Board of Public Defense to pay the cost of standby or advisory counsel.\n(d) Counsel for the child shall not also act as the child's guardian ad litem.\nThe county attorney shall present the evidence upon request of the court.\n(a) The court shall appoint a guardian ad litem to protect the interests of the minor when it appears, at any stage of the proceedings, that the minor is without a parent or guardian, or that the minor's parent is a minor or incompetent, or that the parent or guardian is indifferent or hostile to the minor's interests. In any other case the court may appoint a guardian ad litem to protect the interests of the minor when the court feels that such an appointment is desirable. The court shall appoint the guardian ad litem on its own motion or in the manner provided for the appointment of a guardian ad litem in the district court. The court may appoint separate counsel for the guardian ad litem if necessary.\n(b) A guardian ad litem shall carry out the following responsibilities:\n(1) conduct an independent investigation to determine the facts relevant to the situation of the child and the family, which must include, unless specifically excluded by the court, reviewing relevant documents; meeting with and observing the child in the home setting and considering the child's wishes, as appropriate; and interviewing parents, caregivers, and others with knowledge relevant to the case;\n(2) advocate for the child's best interests by participating in appropriate aspects of the case and advocating for appropriate community services when necessary;\n(3) maintain the confidentiality of information related to a case, with the exception of sharing information as permitted by law to promote cooperative solutions that are in the best interests of the child;\n(4) monitor the child's best interests throughout the judicial proceeding; and\n(5) present written reports on the child's best interests that include conclusions and recommendations and the facts upon which they are based.\n(c) The court may waive the appointment of a guardian ad litem pursuant to paragraph (a), whenever counsel has been appointed pursuant to subdivision 2 or is retained otherwise, and the court is satisfied that the interests of the minor are protected.\n(d) In appointing a guardian ad litem pursuant to paragraph (a), the court shall not appoint the party filing a petition pursuant to sections 260B.141 and 260C.141.\n(e) The following factors shall be considered when appointing a guardian ad litem in a case involving an Indian or minority child:\n(1) whether a person is available who is the same racial or ethnic heritage as the child or, if that is not possible;\n(2) whether a person is available who knows and appreciates the child's racial or ethnic heritage.\n(f) The court shall require a background study for each guardian ad litem as provided under section 518.165. The court shall have access to data collected pursuant to section 245C.32 for purposes of the background study.\nThe custodial parent or guardian of a child who is alleged or found to be delinquent, or is prosecuted as an extended jurisdiction juvenile, must accompany the child at each hearing held during the delinquency or extended jurisdiction juvenile proceedings, unless the court excuses the parent or guardian from attendance for good cause shown. The failure of a parent or guardian to comply with this duty may be punished as provided in section 260B.154.\nExcept in delinquency proceedings, the court may waive the presence of the minor in court at any stage of the proceedings when it is in the best interests of the minor to do so. In a delinquency proceeding, after the child is found to be delinquent, the court may excuse the presence of the child from the hearing when it is in the best interests of the child to do so. In any proceeding the court may temporarily excuse the presence of the parent or guardian of a minor from the hearing when it is in the best interests of the minor to do so. The attorney or guardian ad litem, if any, has the right to continue to participate in proceedings during the absence of the minor, parent, or guardian.\nThe minor and the minor's parent, guardian, or custodian are entitled to be heard, to present evidence material to the case, and to cross-examine witnesses appearing at the hearing.\n(a) Waiver of any right which a child has under this chapter must be an express waiver voluntarily and intelligently made by the child after the child has been fully and effectively informed of the right being waived.\n(b) Waiver of a child's right to be represented by counsel provided under the juvenile court rules must be an express waiver voluntarily and intelligently made by the child after the child has been fully and effectively informed of the right being waived. In determining whether a child has voluntarily and intelligently waived the right to counsel, the court shall look to the totality of the circumstances which includes but is not limited to the child's age, maturity, intelligence, education, experience, and ability to comprehend, and the presence and competence of the child's parents, guardian, or guardian ad litem. If the court accepts the child's waiver, it shall state on the record the findings and conclusions that form the basis for its decision to accept the waiver.",
	"repealed": false
}