{
	"id": "550.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.37",
	"title": "550.37 PROPERTY EXEMPT.",
	"text": "The property mentioned in this section is not liable to attachment, garnishment, or sale on any final process, issued from any court.\nThe Bible, Torah, Qur'an, prayer rug, and other religious items in an aggregate amount not exceeding $2,000.\nA personal library in an aggregate amount not exceeding $750.\nMusical instruments in an aggregate amount not exceeding $2,000.\nFamily pets in an aggregate amount not exceeding $1,000.\nA seat or pew in any house or place of public worship and a lot in any burial ground.\n(a) All wearing apparel, one watch, utensils, and foodstuffs of the debtor and the debtor's family.\n(b) Household furniture, household appliances, radios, computers, tablets, televisions, printers, cell phones, smart phones, and other consumer electronics of the debtor and the debtor's family, not exceeding $12,150 in value.\n(c) The debtor's aggregate interest, not exceeding $3,308 in value, in jewelry.\nThe exemption provided by this subdivision may not be waived except with regard to purchase money security interests. Except for a pawnbroker's possessory lien, a nonpurchase money security interest in the property exempt under this subdivision is void.\nIf a debtor has property of the type which would qualify for the exemption under clause (b), of a value in excess of $12,150 an itemized list of the exempt property, together with the value of each item listed, shall be attached to the security agreement at the time a security interest is taken, and a creditor may take a nonpurchase money security interest in the excess over $12,150 by requiring the debtor to select the exemption in writing at the time the loan is made.\n(a) Except for subdivisions 5 and 7, the dollar amounts in this section shall change periodically as provided in this subdivision to the extent of changes in the implicit price deflator for the gross domestic product, 2005 = 100, compiled by the United States Department of Commerce, and hereafter referred to as the index. The index for December 2011 is the reference base index.\n(b) The designated dollar amounts shall change on July 1 of each even-numbered year if the percentage of change, calculated to the nearest whole percentage point, between the index for December of the preceding year and the reference base index is ten percent or more. The portion of the percentage change in the index in excess of a multiple of ten percent shall be disregarded and the dollar amounts shall change only in multiples of ten percent of the amounts stated in this section.\n(c) If the index is revised, the percentage of change pursuant to this section shall be calculated on the basis of the revised index. If a revision of the index changes the reference base index, a revised reference base index shall be determined by multiplying the reference base index then applicable by the rebasing factor furnished by the Department of Commerce. If the index is superseded, the index referred to in this section is the one represented by the Department of Commerce as reflecting most accurately changes in the purchasing power of the dollar for consumers.\n(d) The commissioner of commerce shall:\n(1) announce and publish on or before April 30 of each year in which dollar amounts are to change, the changes in dollar amounts required by paragraph (b);\n(2) announce and publish promptly after the changes occur, changes in the index required by paragraph (c) including, if applicable, the numerical equivalent of the reference base index under a revised reference base index and the designation or title of any index superseding the index; and\n(3) promptly notify the revisor of statutes in writing of the changes announced and published by the commissioner pursuant to clauses (1) and (2). The revisor shall publish the changes in the next edition of Minnesota Statutes.\n(e) A person does not violate this chapter with respect to a transaction otherwise complying with this chapter if the person relies on dollar amounts either determined according to paragraph (b) or appearing in the last publication of the commissioner announcing the then current dollar amounts.\nFarm machines and implements used in farming operations by a debtor engaged principally in farming, livestock, farm produce, and standing crops, not exceeding $13,000 in value. When a debtor is a partnership of spouses or a partnership of natural persons related to each other within the third degree of kindred according to the rules of the civil law, for the purposes of the exemption in this subdivision, the partners may elect to treat the assets of the partnership as assets of the individual partners.\nThe tools, implements, machines, instruments, office furniture, stock in trade, and library reasonably necessary in the trade, business, or profession of the debtor, not exceeding $13,500 in value.\nThe total value of property selected by a debtor pursuant to subdivisions 5 and 6 shall not exceed $13,000, if the exemptions under subdivisions 5 and 6 are combined.\nThe library and philosophical and chemical or other apparatus belonging to, and used for the instruction of youth in, any university, college, seminary of learning, or school which is indiscriminately open to the public.\nAll money arising from any claim on account of the destruction of, or damage to, exempt property.\nAll money received by, or payable to, a surviving spouse or child from insurance payable at the death of a spouse, or parent, not exceeding $54,000. The $54,000 exemption provided by this subdivision shall be increased by $13,500 for each dependent of the surviving spouse or child.\nAll money, relief, or other benefits payable or to be rendered by any police department association, fire department association, beneficiary association, or fraternal benefit association to any person entitled to assistance therefrom, or to any certificate holder thereof or beneficiary under any such certificate.\n[See Note.]\nA manufactured home, as defined in section 168.002, subdivision 16, which is actually inhabited as a home by the debtor.\nOne of the following: (1) one motor vehicle, to the extent of a value not exceeding $10,000; (2) one motor vehicle that is regularly used by or for the benefit of a physically disabled person, as defined under section 169.345, subdivision 2, to the extent of a value not exceeding $25,000; (3) one motor vehicle, to the extent of a value not exceeding $100,000, that has been designed or modified to accommodate the disability making a disabled person eligible for a certificate authorized by section 169.345; or (4) one motor vehicle reasonably necessary for use in the trade, business, or profession of the debtor, to the extent of a value not to exceed $12,500.\nAll earnings not subject to garnishment by the provisions of section 571.922. A subsequent attachment, garnishment, or levy of execution shall impound only that pay period's nonexempt disposable earnings not subject to a prior attachment, garnishment or levy of execution, but in no instance shall more than an individual's total nonexempt disposable earnings in that pay period be subject to attachment, garnishment, or levy of execution. Garnishments shall impound the nonexempt disposable earnings in the order of their service upon the employer. The disposable earnings exempt from garnishment are exempt as a matter of right, whether claimed or not by the person to whom due. The exemptions may not be waived. The exempt disposable earnings are payable by the employer when due. The exempt disposable earnings shall also be exempt for 20 days after deposit in any financial institution, whether in a single or joint account. This 20-day exemption also applies to any contractual setoff or security interest asserted by a financial institution in which the earnings are deposited by the individual. In tracing the funds, the first-in first-out method of accounting shall be used. The burden of establishing that funds are exempt rests upon the debtor. As used in this section, the term \"financial institution\" includes credit unions. Nothing in this paragraph shall void or supersede any valid assignment of earnings or transfer of funds held on account made prior to the attachment, garnishment, or levy of execution.\nAll government assistance based on need, and the earnings or salary of a person who is a recipient of government assistance based on need, shall be exempt from all claims of creditors including any contractual setoff or security interest asserted by a financial institution. For the purposes of this chapter, government assistance based on need includes but is not limited to Minnesota family investment program; Supplemental Security Income; medical assistance; MinnesotaCare, payment of Medicare part B premiums or receipt of part D extra help; MFIP diversionary work program; work participation cash benefit; Minnesota supplemental assistance; emergency Minnesota supplemental assistance; general assistance; emergency general assistance; emergency assistance or county crisis funds; energy or fuel assistance; Supplemental Nutrition Assistance Program (SNAP); and any federal or state tax credit received by eligible low-income taxpayers, including but not limited to the earned income tax credit, the Minnesota working family credit, and renter's credit. The salary or earnings of any debtor who is or has been an eligible recipient of government assistance based on need, or an inmate of a correctional institution shall, upon the debtor's return to private employment or farming after having been an eligible recipient of government assistance based on need, or an inmate of a correctional institution, be exempt from attachment, garnishment, or levy of execution for a period of six months after the debtor's return to employment or farming and after all public assistance for which eligibility existed has been terminated. The exemption provisions contained in this subdivision also apply for 60 days after deposit in any financial institution, whether in a single or joint account. In tracing the funds, the first-in first-out method of accounting shall be used. The burden of establishing that funds are exempt rests upon the debtor. Agencies distributing government assistance and the correctional institutions shall, at the request of creditors, inform them whether or not any debtor has been an eligible recipient of government assistance based on need, or an inmate of a correctional institution, within the preceding six months.\nThe earnings of the minor child of any debtor and any child support paid to any debtor, or the proceeds thereof, by reason of any liability of such debtor not contracted for the special benefit of such minor child.\nThe claim for damages recoverable by any person by reason of a levy upon or sale under execution of the person's exempt personal property, or by reason of the wrongful taking or detention of such property by any person, and any judgment recovered for such damages.\nAll articles exempted by this section shall be selected by the debtor, the debtor's agent, or legal representative.\nThe exemptions provided for in subdivisions 3 to 15 extend only to debtors who are natural persons except as provided in subdivision 5 for partnerships.\nThe exemption of the property listed in subdivisions 2, 3, and 5 to 12a may not be waived except by a statement in substantially the following form, in boldface type of a minimum size of 12 points, signed and dated by the debtor at the time of the execution of the contract surrendering the exemption, immediately adjacent to the listing of the property: \"I understand that some or all of the above property is normally protected by law from the claims of creditors, and I voluntarily give up my right to that protection for the above listed property with respect to claims arising out of this contract.\"\nThe exemption of funds from creditors' claims, provided by subdivisions 9, 10, 11, 15, and 24, shall not be affected by the subsequent deposit of the funds in a bank or any other financial institution, whether in a single or joint account, if the funds are traceable to their exempt source. In tracing the funds, the first-in first-out method of accounting shall be used. The burden of establishing that funds are exempt rests upon the debtor. No bank or other financial institution shall be liable for damages for complying with process duly issued out of any court for the collection of a debt even if the funds affected by the process are subsequently determined to have been exempt.\nFor the purpose of this section, \"value\" means current fair market value.\nRights of action or money received for injuries to the person of the debtor or of a relative whether or not resulting in death. Injuries to the person include physical, mental, and emotional injuries.\nThe debtor's aggregate interest not to exceed in value $10,800 in any accrued dividends or interest under or loan value of any unmatured life insurance contracts owned by the debtor under which the insured is the debtor or an individual of whom the debtor is a dependent.\n(a) The debtor's right to receive present or future payments, or payments received by the debtor, under a stock bonus, pension, profit sharing, annuity, individual retirement account, Roth IRA, individual retirement annuity, simplified employee pension, or similar plan or contract on account of illness, disability, death, age, or length of service, to the extent of the debtor's aggregate interest under all plans and contracts up to a present value of $81,000 and additional amounts under all the plans and contracts to the extent reasonably necessary for the support of the debtor and any spouse or dependent of the debtor.\n(b) The exemptions in paragraph (a) do not apply when the debt is owed under a support order as defined in section 518A.26, subdivision 21.\n[See Note.]\nProceeds of payments received by a person for labor, skill, material, or machinery contributing to an improvement to real estate within the meaning of section 514.01.\n(a) All money held in a health savings account, as defined in the Internal Revenue Code of 1986, section 223(d), as amended, up to a present value of $25,000.\n(b) All money held in a medical savings account, as defined in the Internal Revenue Code of 1986, section 220(d)(1), as amended, up to a present value of $25,000.\n(c) The exemptions in paragraphs (a) and (b) do not apply pursuant to the division of marital assets under section 518.58, a surviving spouse benefit under section 518.581, and a support order under section 518A.53.\nThe debtor's aggregate interest, not to exceed $3,000, in household tools and equipment, including but not limited to hand and power tools, snow removal equipment, and lawnmowers.\nIn a bankruptcy, a debtor may exempt any property, including funds in a bank account, up to $1,500 in value.",
	"repealed": false
}