{
	"id": "136A.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.84",
	"title": "136A.84 DIRECT ADMISSIONS PROGRAM.",
	"text": "The commissioner shall administer the direct admissions program in consultation with stakeholders, including Minnesota State Colleges and Universities, the University of Minnesota, the Student Advisory Council under section 136A.031, the Minnesota Department of Education, the Minnesota Association of Secondary School Principals, and the Minnesota School Board Association, to automatically offer conditional admission into an eligible public or nonprofit institution as defined under section 136A.103, paragraph (a), located in Minnesota, to Minnesota high school seniors based on a student's high school grade point average, high school and college transcript information, standardized tests, statewide assessments, and other measures as determined by stakeholders.\nThe program shall establish and, to the extent feasible, implement a process for leveraging existing kindergarten through grade 12 and higher education student information systems to automate the admissions process for students. The program must specifically evaluate the impact this process has on outcomes for students with lower levels of college knowledge, low-income students, and students from populations underserved in higher education. The office shall attempt to achieve statewide representation and may prioritize program participants to include high schools with a significant number of students of color, low-income students, or both.\nThe commissioner shall provide information about the Minnesota state grant program and the North Star Promise and encourage students to determine their eligibility for financial aid based on FAFSA and state financial aid application completion.\nAnnually, by February 1, the Office of Higher Education shall report to the legislative committees with jurisdiction over kindergarten through grade 12 education finance and policy and higher education on activities occurring under this section. The report must include but is not limited to information about implementation, recommendations, and outcomes.",
	"repealed": false
}