{
	"id": "453.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/453.58",
	"title": "453.58 CITY POWERS.",
	"text": "A city may by resolution of its governing body exercise any of the powers granted in sections 453.51 to 453.62 to a municipal power agency, upon fulfillment of the conditions provided in sections 453.51 to 453.62 for the exercise of any such power, but without complying with the terms of section 453.53 hereof relating to incorporation, and notwithstanding any provision of any city charter or any other law denying, limiting, or placing conditions upon the exercise of any such power. Nothing in this section shall be construed to repeal any charter provision or law requiring an election or other condition precedent to the establishment after January 1, 1976, of a city electric energy distribution system.\nEvery resolution adopted in accordance with subdivision 1 shall be published in the official newspaper of the city. No action may be brought and no defense may be interposed in an action brought more than 30 days after publication of the resolution, placing at issue the validity of any provision of the resolution or the power of the city to make any contract or to issue any bond, note, or other obligation authorized thereby.\nNothing in sections 453.51 to 453.62 authorizes any city to issue general obligation bonds for any purpose specified in sections 453.51 to 453.62, without approval of its electors or performance of such other procedural conditions as may be required by its charter or the laws of this state. A city may, however, by resolution of its governing body and without approval of the electors or performance of other conditions provided in any charter or other law, enter into contracts with a municipal power agency for the purchase, sale, exchange, or transmission of electric energy and other services, on such terms and for such period of time as the resolution may provide. A city may appropriate and use tax and other revenues received in any year to make payments due or to comply with covenants to be performed during that year under any contract made by the city when acting as a municipal power agency, or any contract made by the city with a municipal power agency, as contemplated by sections 453.51 to 453.62, subject to the provisions of its charter and the laws of this state regarding budget and payment procedures and annual tax levy limitations.\n(a) Notwithstanding anything in sections 453.51 to 453.62 to the contrary, a city, by the exercise of any or all of the powers granted in sections 453.51 to 453.62, is not subject to any duty under section 453.54, subdivision 20, to pay amounts in lieu of taxes on any of its property. The sale or distribution of electric energy to private persons shall not cause a project to be treated as not used exclusively for a public purpose.\n(b) This subdivision is adopted to clarify the powers intended to be granted to cities under this section, and the consequences thereof, is remedial in character, and applies to all property heretofore or hereafter acquired through the exercise of any of the powers of sections 453.51 to 453.62.",
	"repealed": false
}