{
	"id": "144.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.291",
	"title": "144.291 MINNESOTA HEALTH RECORDS ACT.",
	"text": "Sections 144.291 to 144.298 may be cited as the \"Minnesota Health Records Act.\"\nFor the purposes of sections 144.291 to 144.298, the following terms have the meanings given.\n(a) \"Group purchaser\" has the meaning given in section 62J.03, subdivision 6.\n(b) \"Health information exchange\" means a legal arrangement between health care providers and group purchasers to enable and oversee the business and legal issues involved in the electronic exchange of health records between the entities for the delivery of patient care.\n(c) \"Health record\" means any information, whether oral or recorded in any form or medium, that relates to the past, present, or future physical or mental health or condition of a patient; the provision of health care to a patient; or the past, present, or future payment for the provision of health care to a patient.\n(d) \"Identifying information\" means the patient's name, address, date of birth, gender, parent's or guardian's name regardless of the age of the patient, and other nonclinical data which can be used to uniquely identify a patient.\n(e) \"Individually identifiable form\" means a form in which the patient is or can be identified as the subject of the health records.\n(f) \"Medical emergency\" means medically necessary care which is immediately needed to preserve life, prevent serious impairment to bodily functions, organs, or parts, or prevent placing the physical or mental health of the patient in serious jeopardy.\n(g) \"Patient\" means a natural person who has received health care services from a provider for treatment or examination of a medical, psychiatric, or mental condition, the surviving spouse and parents of a deceased patient, or a person the patient appoints in writing as a representative, including a health care agent acting according to chapter 145C, unless the authority of the agent has been limited by the principal in the principal's health care directive. Except for minors who have received health care services under sections 144.341 to 144.347, in the case of a minor, patient includes a parent or guardian, or a person acting as a parent or guardian in the absence of a parent or guardian.\n(h) \"Patient information service\" means a service providing the following query options: a record locator service as defined in paragraph (j) or a master patient index or clinical data repository as defined in section 62J.498, subdivision 1.\n(i) \"Provider\" means:\n(1) any person who furnishes health care services and is regulated to furnish the services under chapter 147, 147A, 147B, 147C, 147D, 148, 148B, 148D, 148F, 150A, 151, 153, or 153A;\n(2) a home care provider licensed under section 144A.471;\n(3) a health care facility licensed under this chapter or chapter 144A;\n(4) an assisted living facility licensed under chapter 144G; and\n(5) a physician assistant registered under chapter 147A.\n(j) \"Record locator service\" means an electronic index of patient identifying information that directs providers in a health information exchange to the location of patient health records held by providers and group purchasers.\n(k) \"Related health care entity\" means an affiliate, as defined in section 144.6521, subdivision 3, paragraph (b), of the provider releasing the health records.",
	"repealed": false
}