{
	"id": "61A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.60",
	"title": "61A.60 REQUIRED REPLACEMENT NOTICE AND FORM.",
	"text": "The notice required where sections 61A.53 to 61A.60 refer to this subdivision is as follows:\nNote important statement on reverse side\nThe notice required where sections 61A.53 to 61A.60 refer to this subdivision is as follows:\nIMPORTANT NOTICE\nREQUIRED BY\nMINNESOTA INSURANCE LAW\nThe following definitions must appear on the back of the notice forms provided in subdivisions 1 and 2:\nDEFINITIONS\nPREMIUMS: Premiums are the payments you make in exchange for an insurance policy or annuity contract. They are unlike deposits in a savings or investment program, because if you drop the policy or contract, you might get back less than you paid in.\nCASH SURRENDER VALUE: This is the amount of money you can get in cash if you surrender your life insurance policy or annuity. If there is a policy loan, the cash surrender value is the difference between the cash value printed in the policy and the loan value. Not all policies have cash surrender values.\nLAPSE: A life insurance policy may lapse when you do not pay the premiums within the grace period. If you had a cash surrender value, the insurer might change your policy to as much extended term insurance or paid-up insurance as the cash surrender value will buy. Sometimes the policy lets the insurer borrow from the cash surrender value to pay the premiums.\nSURRENDER: You surrender a life insurance policy when you either let it lapse or tell the company you want to drop it. Whenever a policy has a cash surrender value, you can get it in cash if you return the policy to the company with a written request. Most insurers will also let you exchange the cash value of the policy for paid-up or extended term insurance.\nCONVERT TO PAID-UP INSURANCE: This means you use your cash surrender value to change your insurance to a paid-up policy with the same insurer. The death benefit generally will be lower than under the old policy, but you will not have to pay any more premiums.\nPLACE ON EXTENDED TERM: This means you use your cash surrender value to change your insurance to term insurance with the same insurer. In this case, the net death benefit will be the same as before. However, you will only be covered for a specified period of time stated in the policy.\nBORROW POLICY LOAN VALUES: If your life insurance policy has a cash surrender value, you can almost always borrow all or part of it from the insurer. Interest will be charged according to the terms of the policy, and if the loan with unpaid interest ever exceeds the cash surrender value, your policy will be surrendered. If you die, the amount of the loan and any unpaid interest due will be subtracted from the death benefits.\nEVIDENCE OF INSURABILITY: This means proof that you are an acceptable risk. You have to meet the insurer's standards regarding age, health, occupation, etc., to be eligible for coverage.\nINCONTESTABLE CLAUSE: This says that after two years, depending on the policy or insurer, the life insurer will not resist a claim because you made a false or incomplete statement when you applied for the policy. For the early years, though, if there are wrong answers on the application and the insurer finds out about them, the insurer can deny a claim as if the policy had never existed.\nSUICIDE CLAUSE: This says that if you complete suicide after being insured for less than one year, depending on the policy and insurer, your beneficiaries will receive only a refund of the premiums that were paid.\nThe notices in subdivisions 1 and 2 must be reproduced in their entirety on one side of an 8-1/2 by 11 inch sheet of plain paper. The definitions contained in subdivision 3 must be printed on the reverse side. The insurer may print its legal name in the space provided.",
	"repealed": false
}