{
	"id": "524.2-205",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-205",
	"title": "524.2-205 DECEDENT'S NONPROBATE TRANSFERS TO OTHERS.",
	"text": "The value of the augmented estate includes the value of the decedent's nonprobate transfers to others, other than the homestead, of any of the following types, in the amount provided respectively for each type of transfer.\n(1) Property owned or owned in substance by the decedent immediately before death that passed outside probate at the decedent's death. Property included under this category consists of:\n(i) Property over which the decedent alone, immediately before death, held a presently exercisable general power of appointment. The amount included is the value of the property subject to the power, to the extent the property passed at the decedent's death, by exercise, release, lapse, default, or otherwise, to or for the benefit of any person other than the decedent's estate or surviving spouse.\n(ii) The decedent's interest in property held with the right of survivorship. The amount included is the value of the decedent's interest, to the extent the interest passed by right of survivorship at the decedent's death to someone other than the decedent's surviving spouse.\n(iii) Proceeds of insurance, including accidental death benefits, on the life of the decedent, if the decedent owned the insurance policy immediately before death or if and to the extent the decedent alone and immediately before death held a presently exercisable general power of appointment over the policy or its proceeds. The amount included is the value of the proceeds, to the extent they were payable at the decedent's death to or for the benefit of any person other than the decedent's estate or surviving spouse.\n(iv) The value payable after the decedent's death to or for the benefit of any person other than the decedent's surviving spouse of the proceeds of annuity contracts under which the decedent was the primary annuitant. The amount included is any amount over which the person has an immediate right of withdrawal after the decedent's death plus the commuted value of other amounts payable in the future.\n(v) The value payable after the decedent's death to or for the benefit of any person other than the decedent's surviving spouse of amounts under any public or private pension, disability compensation, benefit, or retirement plan or account, excluding the federal Social Security system. The amount included is any amount over which the person has an immediate right of withdrawal after the decedent's death plus the commuted value of other amounts payable in the future.\n(2) Property transferred in any of the following forms by the decedent during marriage, to the extent not included under paragraph (1):\n(i) Any irrevocable transfer in which the decedent retained the right to the possession or enjoyment of, or to the income from, the property if and to the extent the decedent's right terminated at or continued beyond the decedent's death. The amount included is the value of the fraction of the property to which the decedent's right related, to the extent the fraction of the property passed outside probate to or for the benefit of any person other than the decedent's estate or surviving spouse.\n(ii) Any transfer in which the decedent created a general power of appointment over income or property exercisable by the decedent alone or in conjunction with any other person, or exercisable by a nonadverse party. The amount included with respect to a power over property is the value of the property subject to the power, and the amount included with respect to a power over income is the value of the property that produces or produced the income, to the extent in either case that the property passed at the decedent's death to or for the benefit of any person other than the decedent's estate or surviving spouse. If the power is a power over both income and property and the preceding sentence produces different amounts, the amount included is the greater amount.\n(3) Property that passed during marriage and during the two-year period next preceding the decedent's death as a result of a transfer by the decedent if the transfer was of any of the following types:\n(i) Any property that passed as a result of the termination of a right or interest in, or power over, property that would have been included in the augmented estate under paragraph (1), clause (i), (ii), (iv), or (v), or under paragraph (2), if the right, interest, or power had not terminated until the decedent's death. The amount included is the value of the property that would have been included under those paragraphs if the property were valued at the time the right, interest, or power terminated, and is included only to the extent the property passed upon termination to or for the benefit of any person other than the decedent or the decedent's estate, spouse, or surviving spouse. As used in this paragraph, \"termination,\" with respect to a right or interest in property, occurs when the power is terminated by exercise, release, default, or otherwise, but with respect to a power described in paragraph (1), clause (i), \"termination\" occurs when the power is terminated by exercise or release, but not otherwise.\n(ii) Any transfer of or relating to an insurance policy on the life of the decedent if the proceeds would have been included in the augmented estate under paragraph (1), clause (iii), had the transfer not occurred. The amount included is the value of the insurance proceeds to the extent the proceeds were payable at the decedent's death to or for the benefit of any person other than the decedent's estate or surviving spouse.\n(iii) Any transfer of property, to the extent not otherwise included in the augmented estate, made to or for the benefit of a person other than the decedent's surviving spouse. The amount included is the value of the transferred property to the extent the aggregate transfers to any one donee in either of the two years exceeded $10,000.",
	"repealed": false
}