{
	"id": "256B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.49",
	"title": "256B.49 HOME AND COMMUNITY-BASED SERVICE WAIVERS FOR PERSONS WITH DISABILITIES.",
	"text": "[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n[Repealed, 1Sp2001 c 9 art 3 s 76]\n(a) The commissioner is authorized to apply for home and community-based service waivers, as authorized under section 1915(c) of the federal Social Security Act to serve persons under the age of 65 who are determined to require the level of care provided in a nursing home and persons who require the level of care provided in a hospital. The commissioner shall apply for the home and community-based waivers in order to:\n(1) promote the support of persons with disabilities in the most integrated settings;\n(2) expand the availability of services for persons who are eligible for medical assistance;\n(3) promote cost-effective options to institutional care; and\n(4) obtain federal financial participation.\n(b) The provision of waiver services to medical assistance recipients with disabilities shall comply with the requirements outlined in the federally approved applications for home and community-based services and subsequent amendments, including provision of services according to a service plan designed to meet the needs of the individual. For purposes of this section, the approved home and community-based application is considered the necessary federal requirement.\n(c) The commissioner shall provide interested persons serving on agency advisory committees, task forces, the Centers for Independent Living, and others who request to be on a list to receive, notice of, and an opportunity to comment on, at least 30 days before any effective dates, (1) any substantive changes to the state's disability services program manual, or (2) changes or amendments to the federally approved applications for home and community-based waivers, prior to their submission to the federal Centers for Medicare and Medicaid Services.\n(d) The commissioner shall seek approval, as authorized under section 1915(c) of the federal Social Security Act, to allow medical assistance eligibility under this section for children under age 21 without deeming of parental income or assets.\n(e) The commissioner shall seek approval, as authorized under section 1915(c) of the Social Act, to allow medical assistance eligibility under this section for individuals under age 65 without deeming the spouse's income or assets.\n(f) The commissioner shall comply with the requirements in the federally approved transition plan for the home and community-based services waivers authorized under this section.\n(g) The commissioner shall seek federal approval to allow for the reconfiguration of the 1915(c) home and community-based waivers in this section, as authorized under section 1915(c) of the federal Social Security Act, to implement a two-waiver program structure.\n(h) The commissioner shall seek federal approval for the 1915(c) home and community-based waivers in this section, as authorized under section 1915(c) of the federal Social Security Act, to implement an individual resource allocation methodology.\n[See Note.]\n(a) The commissioner shall establish statewide priorities for individuals on the waiting list for community alternative care, community access for disability inclusion, and brain injury waiver services, as of January 1, 2010. The statewide priorities must include, but are not limited to, individuals who continue to have a need for waiver services after they have maximized the use of state plan services and other funding resources, including natural supports, prior to accessing waiver services, and who meet at least one of the following criteria:\n(1) no longer require the intensity of services provided where they are currently living; or\n(2) make a request to move from an institutional setting.\n(b) After the priorities in paragraph (a) are met, priority must also be given to individuals who meet at least one of the following criteria:\n(1) have unstable living situations due to the age, incapacity, or sudden loss of the primary caregivers;\n(2) are moving from an institution due to bed closures;\n(3) experience a sudden closure of their current living arrangement;\n(4) require protection from confirmed abuse, neglect, or exploitation;\n(5) experience a sudden change in need that can no longer be met through state plan services or other funding resources alone; or\n(6) meet other priorities established by the department.\n(c) When allocating new enrollment resources to lead agencies, the commissioner must take into consideration the number of individuals waiting who meet statewide priorities.\n[See Note.]\nPersons who are determined likely to require the level of care provided in a nursing facility as determined under section 256B.0911, subdivision 26, or a hospital shall be informed of the home and community-based support alternatives to the provision of inpatient hospital services or nursing facility services. Each person must be given the choice of either institutional or home and community-based services using the provisions described in section 256B.77, subdivision 2, paragraph (p).\n(a) Each recipient of a home and community-based waiver shall be provided case management services by qualified vendors as described in the federally approved waiver application. The case management service activities provided must include:\n(1) finalizing the person-centered written support plan within the timelines established by the commissioner and section 256B.0911, subdivision 29;\n(2) informing the recipient or the recipient's legal guardian or conservator of service options, including all service options available under the waiver plans;\n(3) assisting the recipient in the identification of potential service providers of chosen services, including:\n(i) available options for case management service and providers;\n(ii) providers of services provided in a non-disability-specific setting;\n(iii) employment service providers;\n(iv) providers of services provided in settings that are not community residential settings; and\n(v) providers of financial management services;\n(4) assisting the recipient to access services and assisting with appeals under section 256.045; and\n(5) coordinating, evaluating, and monitoring of the services identified in the service plan.\n(b) The case manager may delegate certain aspects of the case management service activities to another individual provided there is oversight by the case manager. The case manager may not delegate those aspects which require professional judgment including:\n(1) finalizing the person-centered support plan;\n(2) ongoing assessment and monitoring of the person's needs and adequacy of the approved person-centered support plan; and\n(3) adjustments to the person-centered support plan.\n(c) Case management services must be provided by a public or private agency that is enrolled as a medical assistance provider determined by the commissioner to meet all of the requirements in the approved federal waiver plans. If a county agency provides case management under contracts with other individuals or agencies and the county agency utilizes a competitive proposal process for the procurement of contracted case management services, the competitive proposal process must include evaluation criteria to ensure that the county maintains a culturally responsive program for case management services adequate to meet the needs of the population of the county. For the purposes of this section, \"culturally responsive program\" means a case management services program that: (1) ensures effective, equitable, comprehensive, and respectful quality care services that are responsive to individuals within a specific population's values, beliefs, practices, health literacy, preferred language, and other communication needs; and (2) is designed to address the unique needs of individuals who share a common language or racial, ethnic, or social background.\n(d) Case management services must not be provided to a recipient by a private agency that has any financial interest in the provision of any other services included in the recipient's support plan. For purposes of this section, \"private agency\" means any agency that is not identified as a lead agency under section 256B.0911, subdivision 10.\n(e) For persons who need a positive support transition plan as required in chapter 245D, the case manager shall participate in the development and ongoing evaluation of the plan with the expanded support team. At least quarterly, the case manager, in consultation with the expanded support team, shall evaluate the effectiveness of the plan based on progress evaluation data submitted by the licensed provider to the case manager. The evaluation must identify whether the plan has been developed and implemented in a manner to achieve the following within the required timelines:\n(1) phasing out the use of prohibited procedures;\n(2) acquisition of skills needed to eliminate the prohibited procedures within the plan's timeline; and\n(3) accomplishment of identified outcomes.\nIf adequate progress is not being made, the case manager shall consult with the person's expanded support team to identify needed modifications and whether additional professional support is required to provide consultation.\n(f) The Department of Human Services shall offer ongoing education in case management to case managers. Case managers shall receive no less than 20 hours of case management education and disability-related training each year. The education and training must include person-centered planning, informed choice, cultural competency, employment planning, community living planning, self-direction options, and use of technology supports. By August 1, 2024, all case managers must complete an employment support training course identified by the commissioner of human services. For case managers hired after August 1, 2024, this training must be completed within the first six months of providing case management services. For the purposes of this section, \"person-centered planning\" or \"person-centered\" has the meaning given in section 256B.0911, subdivision 10. Case managers shall document completion of training in a system identified by the commissioner.\n(a) Assessments and reassessments shall be conducted by certified assessors according to section 256B.0911, subdivisions 13 and 14.\n(b) There must be a determination that the client requires a hospital level of care or a nursing facility level of care as defined in section 256B.0911, subdivision 26, at initial and subsequent assessments to initiate and maintain participation in the waiver program.\n(c) Regardless of other assessments identified in section 144.0724, subdivision 4, as appropriate to determine nursing facility level of care for purposes of medical assistance payment for nursing facility services, only assessments conducted according to section 256B.0911, subdivisions 17 to 21, 23, 24, and 27 to 31, that result in a hospital level of care determination or a nursing facility level of care determination must be accepted for purposes of initial and ongoing access to waiver services payment.\n(d) Recipients who are found eligible for home and community-based services under this section before their 65th birthday may remain eligible for these services after their 65th birthday if they continue to meet all other eligibility factors.\n(a) Each recipient of home and community-based waivered services shall be provided a copy of the written support plan which meets the requirements in section 256B.092, subdivision 1b.\n(b) In developing the comprehensive transitional service plan, the individual receiving services, the case manager, and the guardian, if applicable, will identify the transitional service plan fundamental service outcome and anticipated timeline to achieve this outcome. Within the first 20 days following a recipient's request for an assessment or reassessment, the transitional service planning team must be identified. A team leader must be identified who will be responsible for assigning responsibility and communicating with team members to ensure implementation of the transition plan and ongoing assessment and communication process. The team leader should be an individual, such as the case manager or guardian, who has the opportunity to follow the recipient to the next level of service.\nWithin ten days following an assessment, a comprehensive transitional service plan must be developed incorporating elements of a comprehensive functional assessment and including short-term measurable outcomes and timelines for achievement of and reporting on these outcomes. Functional milestones must also be identified and reported according to the timelines agreed upon by the transitional service planning team. In addition, the comprehensive transitional service plan must identify additional supports that may assist in the achievement of the fundamental service outcome such as the development of greater natural community support, increased collaboration among agencies, and technological supports.\nThe timelines for reporting on functional milestones will prompt a reassessment of services provided, the units of services, rates, and appropriate service providers. It is the responsibility of the transitional service planning team leader to review functional milestone reporting to determine if the milestones are consistent with observable skills and that milestone achievement prompts any needed changes to the comprehensive transitional service plan.\nFor those whose fundamental transitional service outcome involves the need to procure housing, a plan for the recipient to seek the resources necessary to secure the least restrictive housing possible should be incorporated into the plan, including employment and public supports such as housing access and shelter needy funding.\n(c) Counties and other agencies responsible for funding community placement and ongoing community supportive services are responsible for the implementation of the comprehensive transitional service plans. Oversight responsibilities include both ensuring effective transitional service delivery and efficient utilization of funding resources.\n(d) Following one year of transitional services, the transitional services planning team will make a determination as to whether or not the individual receiving services requires the current level of continuous and consistent support in order to maintain the recipient's current level of functioning. Recipients who are determined to have not had a significant change in functioning for 12 months must move from a transitional to a maintenance service plan. Recipients on a maintenance service plan must be reassessed to determine if the recipient would benefit from a transitional service plan at least every 12 months and at other times when there has been a significant change in the recipient's functioning. This assessment should consider any changes to technological or natural community supports.\n(e) When a county is evaluating denials, reductions, or terminations of home and community-based services under this section for an individual, the case manager shall offer to meet with the individual or the individual's guardian in order to discuss the prioritization of service needs within the support plan, comprehensive transitional service plan, or maintenance service plan. The reduction in the authorized services for an individual due to changes in funding for waivered services may not exceed the amount needed to ensure medically necessary services to meet the individual's health, safety, and welfare.\n(a) Services and supports included in the home and community-based waivers for persons with disabilities must meet the requirements set out in United States Code, title 42, section 1396n. The services and supports, which are offered as alternatives to institutional care, must promote consumer choice, community inclusion, self-sufficiency, and self-determination.\n(b) The commissioner must simplify and improve access to home and community-based waiver services, to the extent possible, through the establishment of a common service menu that is available to eligible recipients regardless of age, disability type, or waiver program.\n(c) Consumer-directed community supports must be offered as an option to all persons eligible for services under subdivision 11.\n(d) Services and supports must be arranged and provided consistent with individualized written plans of care for eligible waiver recipients.\n(e) The state of Minnesota and county agencies that administer home and community-based waiver services for persons with disabilities must not be liable for damages, injuries, or liabilities sustained through the purchase of supports by the individual, the individual's family, legal representative, or the authorized representative with funds received through consumer-directed community supports under this section. Liabilities include but are not limited to workers' compensation liability, the Federal Insurance Contributions Act (FICA), or the Federal Unemployment Tax Act (FUTA).\n[Repealed, 2013 c 108 art 9 s 16]\n(a) Lead agencies must not implement additional requirements, in addition to those required by the commissioner, that could result in the delay of approval or implementation of technology.\n(b) For individuals receiving waiver services under this section, approval or denial of technology must occur within 30 business days of the receipt of the initial request. If denied, the lead agency must submit a notice of action form clearly stating the reason for the denial, including information describing why the technology is not appropriate to meet the individual's assessed need.\n(a) The commissioner shall ensure that the average per capita expenditures estimated in any fiscal year for home and community-based waiver recipients does not exceed the average per capita expenditures that would have been made to provide institutional services for recipients in the absence of the waiver.\n(b) Beginning July 1, 2001, medically necessary home care nursing services will be authorized under this section as complex and regular care according to sections 256B.0651 to 256B.0654 and 256B.0659. The rate established by the commissioner for registered nurse or licensed practical nurse services under any home and community-based waiver as of January 1, 2001, shall not be reduced.\n(c) Notwithstanding section 252.28, subdivision 3, paragraph (d), if the 2009 legislature adopts a rate reduction that impacts payment to providers of adult foster care services, the commissioner may issue adult foster care licenses that permit a capacity of five adults. The application for a five-bed license must meet the requirements of section 245A.11, subdivision 2a. Prior to admission of the fifth recipient of adult foster care services, the county must negotiate a revised per diem rate for room and board and waiver services that reflects the legislated rate reduction and results in an overall average per diem reduction for all foster care recipients in that home. The revised per diem must allow the provider to maintain, as much as possible, the level of services or enhanced services provided in the residence, while mitigating the losses of the legislated rate reduction.\n[See Note.]\nThe commissioner shall reimburse approved vendors from the medical assistance account for the costs of providing home and community-based services to eligible recipients using the invoice processing procedures of the Medicaid management information system (MMIS). Recipients will be screened and authorized for services according to the federally approved waiver application and its subsequent amendments.\nThe commissioner of human services shall take the necessary safeguards to protect the health and welfare of individuals provided services under the waiver.\nThe commissioner shall seek to amend the brain injury waiver to include, as eligible persons, individuals with an acquired or degenerative disease diagnosis where cognitive impairment is present, such as multiple sclerosis.\nMS 2012 [Expired]\nFor the purposes of this section, the provisions of section 256B.092, subdivision 11, are controlling.\nMS 2022 [Repealed, 2023 c 50 art 1 s 38]\n(a) The commissioner shall make available additional waiver allocations and additional necessary resources to assure timely discharges from the Anoka-Metro Regional Treatment Center and the Minnesota Security Hospital in St. Peter for individuals who meet the following criteria:\n(1) are otherwise eligible for the brain injury, community access for disability inclusion, or community alternative care waivers under this section;\n(2) who would otherwise remain at the Anoka-Metro Regional Treatment Center or the Minnesota Security Hospital;\n(3) whose discharge would be significantly delayed without the available waiver allocation; and\n(4) who have met treatment objectives and no longer meet hospital level of care.\n(b) Additional waiver allocations under this subdivision must meet cost-effectiveness requirements of the federal approved waiver plan.\n(c) Any corporate foster care home developed under this subdivision must be considered an exception under section 245A.03, subdivision 7, paragraph (a).\n(a) Persons receiving home and community-based services authorized under this section who have two or more admissions within a calendar year to an emergency room, psychiatric unit, or institution must receive consultation from a mental health professional as defined in section 245.462, subdivision 18, or a behavioral professional as defined in the home and community-based services state plan within 30 days of discharge. The mental health professional or behavioral professional must:\n(1) conduct a functional assessment of the crisis incident as defined in section 245D.02, subdivision 11, which led to the hospitalization with the goal of developing proactive strategies as well as necessary reactive strategies to reduce the likelihood of future avoidable hospitalizations due to a behavioral crisis;\n(2) use the results of the functional assessment to amend the support plan in section 245D.02, subdivision 4b, to address the potential need for additional staff training, increased staffing, access to crisis mobility services, mental health services, use of technology, and crisis stabilization services in section 256B.0624, subdivision 7; and\n(3) identify the need for additional consultation, testing, mental health crisis intervention team services as defined in section 245D.02, subdivision 20, psychotropic medication use and monitoring under section 245D.051, and the frequency and duration of ongoing consultation.\n(b) For the purposes of this subdivision, \"institution\" includes, but is not limited to, the Anoka-Metro Regional Treatment Center and the Minnesota Security Hospital.\nEffective July 1, 2018, county and tribal agencies will be responsible for spending in excess of the annual allocation made by the commissioner. In the event a county or tribal agency spends in excess of the allocation made by the commissioner for a given allocation period, the county or tribal agency must submit a corrective action plan to the commissioner for approval. The plan must state the actions the agency will take to correct its overspending for the two years following the period when the overspending occurred. The commissioner shall recoup funds spent in excess of the allocation only in cases when statewide spending exceeds the appropriation designated for the home and community-based services waivers. Nothing in this subdivision shall be construed as reducing the county or tribe's responsibility to offer and make available feasible home and community-based options to eligible waiver recipients within the resources allocated to it for that purpose.\n[See Note.]\n(a) Effective until June 30, 2018, county and tribal agencies are responsible for authorizing the annual allocation made by the commissioner. In the event a county or tribal agency authorizes less than 97 percent of the allocation, while maintaining a list of persons waiting for waiver services, the county or tribal agency must submit a corrective action plan to the commissioner for approval. The commissioner may determine a plan is unnecessary given the size of the allocation and capacity for new enrollment. The plan must state the actions the agency will take to assure reasonable and timely access to home and community-based waiver services for persons waiting for services.\n(b) Effective July 1, 2018, county and tribal agencies are responsible for spending the annual allocation made by the commissioner. In the event a county or tribal agency spends less than 97 percent of the allocation, while maintaining a list of persons waiting for waiver services, the county or tribal agency must submit a corrective action plan to the commissioner for approval. The commissioner may determine a plan is unnecessary given the size of the allocation and capacity for new enrollment. The plan must state the actions the agency will take to assure reasonable and timely access to home and community-based waiver services for persons waiting for services.\n(c) If a county or tribe does not submit a plan when required or implement the changes required, the commissioner shall assure access to waiver services within the county or tribe's available allocation, and take other actions needed to assure that all waiver participants in that county or tribe are receiving appropriate waiver services to meet their needs.\n[See Note.]\n(a) Notwithstanding section 245A.03, subdivision 2, paragraph (a), clause (18), to prevent new development of customized living settings that otherwise meet the residential program definition under section 245A.02, subdivision 14, the commissioner shall not enroll new customized living settings serving four or fewer people in a single-family home to deliver customized living services as defined under the brain injury or community access for disability inclusion waiver plans under this section.\n(b) The commissioner may approve an exception to paragraph (a) when an existing customized living setting changes ownership at the same address.\n(c) Customized living settings operational on or before June 30, 2021, are considered existing customized living settings.\n(d) For any new customized living settings serving four or fewer people in a single-family home to deliver customized living services as defined in paragraph (a) and that was not operational on or before June 30, 2021, the authorizing lead agency is financially responsible for all home and community-based service payments in the setting.\n(e) For purposes of this subdivision, \"operational\" means customized living services are authorized and delivered to a person in the customized living setting.\n(a) For the purposes of this subdivision, \"operational\" has the meaning given in subdivision 28.\n(b) This paragraph applies only to customized living settings enrolled and operational on or before June 30, 2021, and customized living settings that have previously transferred their customized living enrollment date under this paragraph. A provider that receives approval from the commissioner of health under section 144G.195, subdivision 1, to relocate a licensed assisted living facility that was enrolled prior to January 11, 2021, to deliver medical assistance 24-hour customized living services, or customized living services as defined by the brain injury and community access for disability inclusion federally approved home and community-based services waiver plans, may continue to operate the customized living setting under the original setting's customized living enrollment date if all of the requirements under this subdivision are met.\n(c) A transfer of enrollment date is allowed under this subdivision only if the facility relocation is due to:\n(1) a provider that rents the original setting being unable to continue to rent the original setting because of eviction, nonrenewal of its lease by the property owner, or sale of the property by the owner;\n(2) a provider that rents the original setting being unable to make the necessary updates or improvements to the original setting to comply with the physical plant and other requirements under state or federal law, including but not limited to chapter 144G;\n(3) a provider's monthly rent increasing more than three percent in a 12-month period;\n(4) the original setting being destroyed or damaged by fire, lightning, flood, wind, ground shifts, or other such hazards, including environmental hazards, to such an extent that the original setting cannot be repaired and the safety of residents would be jeopardized by continuing to reside in the original setting; or\n(5) a provider or an entity that directly or indirectly through one or more intermediaries is controlled by, is under common control with, or controls the entity enrolled to provide customized living services at the current setting purchases a new setting and the commissioner of health approves the relocation of the provider's assisted living facility license to the newly purchased setting.\n(d) When a relocation is necessitated by a qualifying situation under paragraph (c), clauses (1) to (5), the provider must submit a notification to the commissioner of human services, the ombudsman of long-term care, the ombudsperson of mental health and developmental disabilities, relevant lead agencies, each resident's case manager, and either each person receiving services at the setting or the person's legal representative. The notification must be made at least 30 days prior to the relocation date and on forms and in the manner prescribed by the commissioner of human services.\n(e) A provider proposing to transfer a customized living setting enrollment date to a new setting must submit, with the provider's notification to the commissioner of human services under paragraph (d), the following information:\n(1) the addresses of the vacating location and of the proposed new location;\n(2) the anticipated date of the move to the new location;\n(3) contacts for the lead agency and each resident's waiver case manager;\n(4) documentation that the Department of Health has received an application to relocate pursuant to section 144G.195, subdivision 1, for the new location; and\n(5) documentation that the customized living provider's assisted living facility license is not conditional.\n(f) The commissioner of human services has 30 days to approve or deny requests to transfer the original setting's customized living enrollment date to the new setting.\n(g) The commissioner of human services must deny requests to transfer a customized living enrollment date to a new setting if:\n(1) the new setting approved by the commissioner of health under section 144G.195, subdivision 1, is adjoined to or on the same property as an institution as defined in Code of Federal Regulations, title 42, section 441.301(c), or one or more licensed assisted living facilities;\n(2) the requesting provider fails to notify the commissioner of human services of the proposed relocation within the time frames required under this subdivision;\n(3) the requesting provider's assisted living facility license is conditional; or\n(4) the requesting provider is changing ownership at the same time as the proposed relocation.\n(h) The setting to which the original customized living enrollment date is transferred must:\n(1) comply with setting requirements in the brain injury and community access for disability inclusion federally approved home and community-based services waiver plans and under this section as the requirements existed on the customized living enrollment date of the original setting;\n(2) have a resident capacity less than or equal to the resident capacity of the original setting;\n(3) not require or coerce any resident of the original setting to move to the new setting, consistent with informed choice and independent living policies under section 256B.4905, subdivisions 1a, 2a, 3a, and 8; and\n(4) provide each resident with a new assisted living contract and comply with the coordinated move requirements under section 144G.55.\n[See Note.]\n(a) For the purposes of this subdivision, \"residential support services\" means the following residential support services reimbursed under section 256B.4914: community residential services, customized living services, and 24-hour customized living services.\n(b) In order to increase independent living options for people with disabilities and in accordance with section 256B.4905, subdivisions 3 and 4, and consistent with section 245A.03, subdivision 7, the commissioner must establish and implement criteria to access residential support services. The criteria for accessing residential support services must prohibit the commissioner from authorizing residential support services unless at least all of the following conditions are met:\n(1) the individual has complex behavioral health or complex medical needs; and\n(2) the individual's service planning team has considered all other available residential service options and determined that those options are inappropriate to meet the individual's support needs.\nNothing in this subdivision shall be construed as permitting the commissioner to establish criteria prohibiting the authorization of residential support services for individuals described in the statewide priorities established in subdivision 12, the transition populations in subdivision 13, and the licensing moratorium exception criteria under section 245A.03, subdivision 7, paragraph (a).\n(c) Individuals with active service agreements for residential support services on the date that the criteria for accessing residential support services become effective are exempt from the requirements of this subdivision, and the exemption from the criteria for accessing residential support services continues to apply for renewals of those service agreements.\n[See Note.]",
	"repealed": false
}