{
	"id": "604.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.04",
	"title": "604.04 NOTICE OF POSSIBLE CLAIM.",
	"text": "The attorney for a person who intends to claim damage for or on account of personal injury, death or property damage arising out of the manufacture, sale, use or consumption of a product shall cause to be presented a notice of possible claim stating the time, place and circumstances of events giving rise to the claim and an estimate of compensation or other relief to be sought. This notice shall be given within six months of the date of entering into an attorney-client relation with the claimant in regard to the claim. Notice shall be given to all persons against whom the claim is likely to be made. Any person in the chain of manufacture and distribution shall promptly furnish to the claimant's attorney the names and addresses of all persons the person knows to be in the chain of manufacture and distribution if requested to do so by the attorney at the time the notice is given. Failure to furnish this information shall subject the person to the liability provided for in subdivision 3.\nActual notice of sufficient facts to reasonably put a person against whom the claim is to be made or the person's insurer on notice of a possible claim satisfies the notice requirements of this section. Failure to state an estimate of the amount of compensation or other relief demanded does not invalidate the notice, but the claimant shall furnish full information regarding the nature and extent of the injuries and damages within 15 days after demand by a person to whom the notice was given or by the person's insurer.\nA claimant who delays entering into an attorney-client relation with the purpose of delaying unreasonably the notice required by subdivision 1 is subject to liability as provided in subdivision 3.\nAny person injured by the failure of a claimant or the claimant's attorney or of a person in the chain of manufacture and distribution to comply with the requirements of this section may recover damages, costs and reasonable attorney fees from a person who violated this section, but failure to give notice does not affect the validity of a claim against a party who did not receive notice.",
	"repealed": false
}