{
	"id": "256B.1973",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.1973",
	"title": "256B.1973 DIRECTED PAYMENT ARRANGEMENTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Billing professionals\" means physicians, nurse practitioners, nurse midwives, clinical nurse specialists, physician assistants, anesthesiologists, and certified registered anesthetists, and may include dentists, individually enrolled dental hygienists, and dental therapists.\n(c) \"Health plan\" means a managed care or county-based purchasing plan that is under contract with the commissioner to deliver services to medical assistance enrollees under section 256B.69.\n(d) \"High medical assistance utilization\" means a medical assistance utilization rate equal to the standard established in section 256.969, subdivision 9, paragraph (d), clause (6).\nEach directed payment arrangement under this section is contingent on federal approval and must conform with the requirements for permissible directed managed care organization expenditures under section 256B.6928, subdivision 5.\nEligible providers under this section are nonstate government teaching hospitals with high medical assistance utilization and a level 1 trauma center and all of the hospital's owned or affiliated billing professionals, ambulance services, sites, and clinics.\nA nonstate governmental entity that is eligible to perform intergovernmental transfers may make voluntary intergovernmental transfers to the commissioner. The commissioner shall inform the nonstate governmental entity of the intergovernmental transfers necessary to maximize the allowable directed payments.\n(a) For each federally approved directed payment arrangement that is a state-directed fee schedule requirement, the commissioner shall determine a uniform adjustment factor to be applied to each claim submitted by an eligible provider to a health plan. The uniform adjustment factor shall be determined using the average commercial payer rate or using another method acceptable to the Centers for Medicare and Medicaid Services if the average commercial payer rate is not approved, minus the amount necessary for the plan to satisfy tax liabilities under sections 256.9657 and 297I.05 attributable to the directed payment arrangement. The commissioner shall ensure that the application of the uniform adjustment factor maximizes the allowable directed payments and does not result in payments exceeding federal limits, and may use an annual settle-up process. The directed payment shall be specific to each health plan and prospectively incorporated into capitation payments for that plan.\n(b) For each federally approved directed payment arrangement that is a state-directed fee schedule requirement, the commissioner shall develop a plan for the initial implementation of the state-directed fee schedule requirement to ensure that the eligible provider receives the entire permissible value of the federally approved directed payment arrangement. If federal approval of a directed payment arrangement under this subdivision is retroactive, the commissioner shall make a onetime pro rata increase to the uniform adjustment factor and the initial payments in order to include claims submitted between the retroactive federal approval date and the period captured by the initial payments.\nIn accordance with its contract, each health plan shall submit to the commissioner payment information for each claim paid to an eligible provider for services provided to a medical assistance enrollee.\nIn accordance with its contract, each health plan shall make directed payments to the eligible provider in an amount equal to the payment amounts the plan received from the commissioner.\nThe directed payment arrangement and state-directed fee schedule requirement must align the state quality goals to Hennepin Healthcare medical assistance patients, including unstably housed individuals, those with higher levels of social and clinical risk, limited English proficiency (LEP) patients, adults with serious chronic conditions, and individuals of color. The directed payment arrangement must maintain quality and access to a full range of health care delivery mechanisms for these patients that may include behavioral health, emergent care, preventive care, hospitalization, transportation, interpreter services, and pharmaceutical services. The commissioner, in consultation with Hennepin Healthcare, shall submit to the Centers for Medicare and Medicaid Services a methodology to measure access to care and the achievement of state quality goals.",
	"repealed": false
}