{
	"id": "176.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.111",
	"title": "176.111 DEPENDENTS, ALLOWANCES.",
	"text": "For the purposes of this chapter the following persons are conclusively presumed to be wholly dependent:\n(a) spouse, unless it be shown that the spouse and decedent were voluntarily living apart at the time of the injury or death;\n(b) children under 18 years of age, or a child under the age of 25 years who is regularly attending as a full-time student at a high school, college, or university, or regularly attending as a full-time student in a course of vocational or technical training.\nChildren 18 years of age, or over 18 when physically or mentally incapacitated from earning, are prima facie considered dependent.\nA spouse, child, mother, father, grandmother, grandfather, grandchild, sister, brother, mother-in-law, father-in-law, wholly supported by a deceased worker at the time of death and for a reasonable time prior thereto are considered actual dependents of the deceased worker and compensation shall be paid to them in the order named.\nAny member of a class named in subdivision 3 who regularly derived partial support from the wages of a deceased worker at the time of death and for a reasonable time prior thereto is considered a partial dependent and compensation shall be paid to such dependents in the order named.\nIn death cases compensation payable to dependents is computed on the following basis and shall be paid to the persons entitled thereto or to a guardian or conservator as required under section 176.092. The minimum amount of dependency compensation that must be paid to persons entitled thereto is $60,000.\nIf the deceased employee leaves a dependent surviving spouse and no dependent child, there shall be paid to the spouse weekly workers' compensation benefits at 50 percent of the weekly wage at the time of the injury for a period of ten years, including adjustments as provided in section 176.645.\nIf the deceased employee leaves a surviving spouse and one dependent child, there shall be paid to the surviving spouse for the benefit of the spouse and child 60 percent of the daily wage at the time of the injury of the deceased until the child is no longer a dependent as defined in subdivision 1. At that time there shall be paid to the dependent surviving spouse weekly benefits at a rate which is 16-2/3 percent less than the last weekly workers' compensation benefit payment, as defined in subdivision 8a, while the surviving child was a dependent, for a period of ten years, including adjustments as provided in section 176.645.\nIf the deceased employee leaves a surviving spouse and two dependent children, there shall be paid to the surviving spouse for the benefit of the spouse and children 66-2/3 percent of the daily wage at the time of the injury of the deceased until the last dependent child is no longer dependent. At that time the dependent surviving spouse shall be paid weekly benefits at a rate which is 25 percent less than the last weekly workers' compensation benefit payment, as defined in subdivision 8a, while the surviving child was a dependent, for a period of ten years, adjusted according to section 176.645.\nFor the purposes of subdivisions 7 and 8, \"last weekly workers' compensation benefit payment\" means the workers' compensation benefit which would have been payable without the application of subdivision 21.\n[Repealed, 1975 c 359 s 22]\nA surviving spouse who remarries and is receiving benefits under subdivision 6, 7, or 8 shall continue to be eligible to receive weekly benefits for the remaining period that the spouse is entitled to receive benefits pursuant to this section.\nIn all cases where compensation is payable to the surviving spouse for the benefit of the surviving spouse and dependent children, the commissioner, compensation judge, or Workers' Compensation Court of Appeals or district court in cases upon appeal shall determine what portion of the compensation applies for the benefit of dependent children and may order that portion paid to a guardian. This subdivision shall not be construed to increase the combined total of weekly government survivor benefits and workers' compensation beyond the limitation established in subdivision 21.\n[Repealed, 1981 c 346 s 145]\nIf the deceased employee leaves a dependent orphan, there shall be paid 55 percent of the weekly wage at the time of the injury of the deceased, for two or more orphans there shall be paid 66-2/3 percent of the wages.\n[Repealed, 1977 c 342 s 28]\nIf the deceased employee leave no surviving spouse or child entitled to any payment under this chapter, but leaves both parents wholly dependent on deceased, there shall be paid to such parents jointly 45 percent of the weekly wage at the time of the injury of the deceased. In case of the death of either of the wholly dependent parents the survivor shall receive 35 percent of the weekly wage thereafter. If the deceased employee leave one parent wholly dependent on the deceased, there shall be paid to such parent 35 percent of the weekly wage at the time of the injury of the deceased employee. The compensation payments under this section shall not exceed the actual contributions made by the deceased employee to the support of the employee's parents for a reasonable time immediately prior to the injury which caused the death of the deceased employee.\nIf the deceased employee leaves no surviving spouse or child or parent entitled to any payment under this chapter, but leaves a grandparent, grandchild, brother, sister, mother-in-law, or father-in-law wholly dependent on the employee for support, there shall be paid to such dependent, if but one, 30 percent of the weekly wage at the time of injury of the deceased, or if more than one, 35 percent of the weekly wage at the time of the injury of the deceased, divided among them share and share alike.\nExcept as provided in this chapter, compensation ceases upon the death or marriage of any dependent. Cessation of benefits requires notice pursuant to subdivision 23.\nPartial dependents are entitled to receive only that proportion of the benefits provided for actual dependents which the average amount of wages regularly contributed by the deceased to such partial dependents at the time of and for a reasonable time immediately prior to the injury bore to the total income of the dependent during the same time; and if the amount regularly contributed by the deceased to such partial dependents cannot be ascertained because of the circumstances of the case, the commissioner, compensation judge, or court of appeals, in cases upon appeal, shall make a reasonable estimate thereof taking into account all pertinent factors of the case.\nIn all cases where death results to an employee from a personal injury arising out of and in the course of employment, the employer shall pay the expense of burial, not exceeding in amount $15,000. In case any dispute arises as to the reasonable value of the services rendered in connection with the burial, its reasonable value shall be determined and approved by the commissioner, a compensation judge, or Workers' Compensation Court of Appeals, in cases upon appeal, before payment, after reasonable notice to interested parties as is required by the commissioner. If the deceased leaves no dependents, no compensation is payable, except as provided by this chapter.\n[Repealed, 1975 c 359 s 22]\nActual dependents are entitled to take compensation in the order named in subdivision 3 during dependency until 66-2/3 percent of the weekly wage of the deceased at the time of injury is exhausted. The total weekly compensation to be paid to full actual dependents of a deceased employee shall not exceed in the aggregate an amount equal to the maximum weekly compensation for a temporary total disability.\nThe following provision shall apply to any dependent entitled to receive weekly compensation benefits under this section as the result of the death of an employee, and who is also receiving or entitled to receive benefits under any government survivor program:\nThe combined total of weekly government survivor benefits and workers' compensation death benefits provided under this section shall not exceed 100 percent of the weekly wage being earned by the deceased employee at the time of the injury causing death; provided, however, that no state workers' compensation death benefit shall be paid for any week in which the survivor benefits paid under the federal program, by themselves, exceed 100 percent of such weekly wage provided, however, the workers' compensation benefits payable to a dependent surviving spouse shall not be reduced on account of any governmental survivor benefits payable to decedent's children if the support of the children is not the responsibility of the dependent surviving spouse.\nFor the purposes of this subdivision \"dependent\" means dependent surviving spouse together with all dependent children and any other dependents. For the purposes of this subdivision, mother's or father's insurance benefits received pursuant to United States Code, title 42, section 402(g), are benefits under a government survivor program.\n(a) In every case of death of an employee resulting from personal injury arising out of and in the course of employment where there are no persons entitled to monetary benefits of dependency compensation, the employer shall pay to the estate of the deceased employee the sum of $60,000. This payment must be made within 14 days of notice to the insurer of one of the following:\n(1) the appointment of a personal representative of the estate; or\n(2) if there is no personal representative, presentation of a certified death record and an affidavit of collection of personal property according to the requirements of sections 524.3-1201 and 524.3-1202.\n(b) Within 14 days of notice to the insurer of the death of the employee, the insurer must send notice to the estate, at the deceased employee's last known address, that this payment will be made after receipt of the documentation in paragraph (a), clause (1) or (2).\nIf an employer intends to discontinue dependency benefits of any individual identified as a dependent in this section, the employer must file with the commissioner, as required under section 176.231, subdivision 6, paragraphs (a) and (e), and serve on the dependent whose benefits are being discontinued written notice within 14 calendar days of discontinuance. The notice shall state the name of the individual whose dependency benefits are being discontinued, the date the individual's benefits will be discontinued, and a statement of facts clearly indicating the reason the individual will no longer receive dependency benefits and is no longer considered a dependent under this section. Any document in the employer's possession which is relied on for the discontinuance shall be attached to the notice. Failure to file this form as required may result in a penalty under section 176.231, subdivision 10.",
	"repealed": false
}