{
	"id": "176.2612",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.2612",
	"title": "176.2612 WORKERS' COMPENSATION CLAIMS ACCESS AND MANAGEMENT PLATFORM USER SYSTEM (CAMPUS).",
	"text": "(a) The commissioner shall maintain the workers' compensation Claims Access and Management Platform User System (CAMPUS) as defined in section 176.011, subdivision 1d. This section applies to the department and the Workers' Compensation Court of Appeals. Except for paragraph (b), clause (4), this subdivision does not apply to the office.\n(b) CAMPUS must:\n(1) provide a single filing system for users to electronically file documents required or authorized to be filed under this chapter with the commissioner or the Workers' Compensation Court of Appeals;\n(2) maintain and retain the division file and other claim-related documents;\n(3) accept filings by electronic data entry and by uploaded images of supplemental documents, such as a medical or narrative report or document;\n(4) electronically and securely transmit data, and images of documents, between each agency to allow the agency to perform its statutory functions;\n(5) electronically and securely serve documents;\n(6) organize electronic data filed in the division file into an image for viewing or printing by parties to a claim and staff at each agency;\n(7) provide electronic access to the division file by parties and each agency to workers' compensation documents and other data as authorized or required by this chapter and generate an audit trail when the division file is accessed by a person; and\n(8) allow authorized stakeholders, the department, and the Workers' Compensation Court of Appeals to manage and monitor claims and perform statutorily required functions.\nBy January 11, 2021, the commissioner must recommend to the Workers' Compensation Advisory Council a plan and proposed statutory amendments for the most effective means, based on an assessment of benefits and value, to implement improvements to CAMPUS and the case management system at the office, including ensuring a single calendaring system and a single filing system. The filing requirements in section 176.2611, subdivisions 3 and 4, remain in effect until further amendments related to a single filing system in CAMPUS are enacted pursuant to the recommendations of the Workers' Compensation Advisory Council.\n(a) For purposes of this subdivision, \"employer,\" \"insurer,\" and \"third-party administrator\" have the meanings given in section 176.253, subdivision 1.\n(b) Electronic access to view or file documents in CAMPUS shall be granted according to the requirements established by the department and the Department of Information Technology Services to authenticate the identity of the person or entity creating the account and authorize access to the documents that the person or entity is entitled to under this chapter. To create an account in CAMPUS, a person must provide the commissioner of labor and industry with information needed to create the account and authenticate the person's identity. The person must also agree to terms and conditions that are needed to safeguard the security and privacy of data and comply with the requirements of this chapter related to CAMPUS.\n(c) The persons or entities in clauses (1) to (12) must create and maintain an account in CAMPUS to electronically access or file documents:\n(1) an employee with a workers' compensation claim or other person who has access to the division file under section 176.231, subdivision 9, paragraph (c);\n(2) an employer with a workers' compensation claim;\n(3) a licensed workers' compensation insurer acting on behalf of an employer with a Minnesota workers' compensation claim;\n(4) an intervenor or potential intervenor in a workers' compensation dispute;\n(5) a registered rehabilitation provider under section 176.102;\n(6) the state or a political subdivision or school district that is not required to be self-insured by the commissioner of the Department of Commerce in order to pay its workers' compensation claims;\n(7) the assigned risk plan under chapter 79A;\n(8) the Workers' Compensation Reinsurance Association under chapter 79;\n(9) the Minnesota insurance guaranty association established under chapter 60C;\n(10) the self-insurers' security fund under chapter 79A;\n(11) a third-party administrator that has contracted to act on behalf of any of the entities listed in this subdivision; and\n(12) an attorney representing a person or entity listed above.\n(d) The commissioner may require that any person or entity listed in paragraph (c), clauses (2) to (12), create and maintain an account in CAMPUS if the person or entity is a party to a workers' compensation claim or associated with an enforcement action of the department.\n(e) A designated medical contact under section 176.135 and a managed care organization certified by the department under section 176.1351 must create and maintain an account to file and view documents related to the certified managed care plan or designated medical contact. A program administrator for a collective bargaining agreement approved by the commissioner under section 176.1812 must create an account to view documents related to a claim that is covered by the agreement. A health care provider must create an account to file a request for an administrative conference if permitted under section 176.136, subdivision 2.\n(f) If a person or entity is required to create and maintain an account under this subdivision and fails to do so:\n(1) unless good cause is shown, the commissioner may assess a $500 penalty against the person or entity for each 30-day period that an account is not created or maintained following the commissioner's notice that one is required;\n(2) failure to create or maintain an account shall not be a defense to untimely filing where electronic filing is required under this chapter; and\n(3) failure to create or maintain an account results in the appointment of the commissioner and successors in office as the person's agent to receive service by the commissioner or the Workers' Compensation Court of Appeals where service is required under this chapter, provided that the commissioner attempts service by United States mail on the party at the last known address.",
	"repealed": false
}