{
	"id": "465.719",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.719",
	"title": "465.719 CORPORATIONS CREATED BEFORE MAY 31, 1997.",
	"text": "The following definitions apply to this section:\n(a) \"Political subdivision\" means a county, a statutory or home rule charter city, a town, a school district, or other political subdivision of the state. Political subdivision includes a political subdivision acting individually or jointly as provided under section 471.59.\n(b) \"Corporation\" means a corporation created by a political subdivision before May 31, 1997, in which (i) the corporation's articles of incorporation or bylaws provide for the governing body of the political subdivision to serve as a corporation's governing board; (ii) the articles of incorporation or bylaws provide for appointed officials of the political subdivision or members of the governing body of the political subdivision or both to be automatically appointed to the board solely by virtue of their appointment or election to office and they constitute a majority of the corporation's board members; or (iii) the governing body of the political subdivision approves the budget or expenditures of the corporation for purposes other than those related to oversight of public grants or loans made to the corporation under a competitive process for which other entities are eligible. Corporation does not include:\n(1) a corporation established under chapters 453 or 453A, or sections 142F.30 to 142F.302 or 245.62 to 245.66;\n(2) a nonprofit corporation created to raise funds for use by a political subdivision if less than a majority of the board of directors of the corporation are members of the governing body of the political subdivision appointed to the board of directors by virtue of their election to office; or\n(3) a corporation created by a political subdivision pursuant to state statute or special law or federal law.\nIn order to provide for the continued existence of a corporation created by a political subdivision, the political subdivision, or its successor, that created the corporation must adopt a resolution at a regularly scheduled meeting of the governing body of the political subdivision. The resolution must include the information required in subdivisions 4 to 9. A certified copy of the resolution must be filed with the secretary of state. If a resolution is not adopted within three years of August 1, 2000, the board of directors of the corporation shall direct and authorize an officer or designee of the corporation to file with the secretary of state immediately a notice of intent to dissolve the corporation and then as soon as possible, complete dissolution of the corporation as provided in the corporation's articles of incorporation and bylaws, and the law under which the corporation was formed.\nIf the political subdivision adopts a resolution under subdivision 2, the board of directors of the corporation shall direct and authorize an officer or designee of the corporation to file amended articles of incorporation, if necessary, as soon as practicable after adoption of the resolution to make the articles of incorporation consistent with the resolution and to provide for the application of the laws under subdivision 9. Thereafter, the corporation may not amend its articles of incorporation unless the political subdivision adopts a resolution in support of the change as provided in subdivision 2 for ratifying existing corporations and a certified copy of the resolution is attached to the amended articles of incorporation filed with the secretary of state.\nIf on August 1, 2000, the corporation has contracts or other obligations that are inconsistent with any requirement of this section, the resolution may provide for the delayed application of that requirement for the time necessary to avoid a breach or impairment of the contract or obligation.\nThe resolution must make a detailed and specific finding regarding the purpose of the corporation, and why the corporation is the best alternative for accomplishing the purpose.\nThe resolution must specify what authorities and powers the corporation possesses. The authorities and powers of the corporation must not exceed the authorities and powers of the political subdivision that created it, except as otherwise authorized in this section.\nIf a majority of the corporation's governing board includes elected or appointed officials of the political subdivision creating the corporation, the resolution must make a detailed and specific finding regarding the purpose of those officials serving on the board, and why the corporation cannot accomplish its purpose unless those officials serve on the board. Alternatively, the resolution may provide for other board membership and the articles of incorporation amended to be consistent with the resolution.\nIf the political subdivision that created the corporation is a joint powers board, the joint powers agreement and the resolution must specify how the assets and liabilities of the corporation are allocated or attributed to each member of the joint powers board, including, but not limited to, for the purposes of any applicable levy or debt limits. If a corporation is created by more than one political subdivision, each political subdivision that ratifies creation of the corporation must adopt a resolution required by this section and, among other requirements, each resolution must specify and agree with the resolution of the other political subdivisions as to how the assets and liabilities of the corporation are allocated or attributed to each political subdivision, including, but not limited to, for the purposes of any applicable levy or debt limits.\nA corporation created by a political subdivision under this section must comply with every law that applies to the political subdivision, as if the corporation is a part of the political subdivision, unless the resolution ratifying creation of the corporation specifically exempts the corporation from part or all of a law. If the resolution exempts the corporation from part or all of a law, the resolution must make a detailed and specific finding as to why the corporation cannot fulfill its purpose if the corporation is subject to that law. A corporation may not be exempted from chapter 13D, the Minnesota Open Meeting Law, sections 138.163 to 138.25, governing records management, or chapter 13, the Minnesota Government Data Practices Act. Any affected or interested person may bring an action in district court to void the resolution on the grounds that the findings are not sufficiently detailed and specific, or that the corporation can fulfill its purpose if it is subject to the law from which the resolution exempts the corporation. Laws that apply to a political subdivision that also apply to a corporation created by a political subdivision under this subdivision include, but are not limited to:\n(1) chapter 13D, the Minnesota Open Meeting Law;\n(2) chapter 13, the Minnesota Government Data Practices Act;\n(3) section 471.345, the Uniform Municipal Contracting Law;\n(4) sections 43A.17, limiting the compensation of employees based on the governor's salary; 471.991 to 471.999, providing for equitable pay; and 465.72 and 465.722, governing severance pay;\n(5) if the corporation issues debt, its debt is included in the political subdivision's debt limit if it would be included if issued by the political subdivision, and issuance of the debt is subject to the election and other requirements of chapter 475 and section 471.69;\n(6) section 471.895, prohibiting acceptance of gifts from interested parties, and sections 471.87 to 471.89, relating to interests in contracts;\n(7) chapter 466, relating to municipal tort liability;\n(8) chapter 118A, requiring deposit insurance or bond or pledged collateral for deposits;\n(9) chapter 118A, restricting investments;\n(10) section 471.346, requiring ownership of vehicles to be identified;\n(11) sections 471.38 to 471.41, requiring claims to be in writing, itemized, and approved by the governing board before payment can be made; and\n(12) the corporation cannot make advances of pay, make or guarantee loans to employees, or provide in-kind benefits unless authorized by law.\nAt least every three years after adoption of a resolution that exempts a corporation from part or all of a law under subdivision 9, the political subdivision must review the activities of the corporation and whether the exemption should continue to apply to the corporation. The political subdivision must conduct the review at a regularly scheduled meeting of its governing body. The political subdivision must adopt a resolution to continue any exemption and a certified copy of the resolution must be filed with the secretary of state. The political subdivision cannot exempt the corporation from a law for the first time under the review process of this subdivision.\nIf the political subdivision has authority under other law to appropriate tax revenues for use by the corporation, those funds must be appropriated and used only for public purposes.\nA corporation created by a political subdivision that receives public money from the political subdivision, other than grants or loans made under a competitive process for which other entities are eligible, must be audited annually by either a certified public accountant or the state auditor. Except as provided below, the audit report must be presented at a regularly scheduled meeting of the governing body of the political subdivision that created the corporation. The audit report must be made available to individuals after presentation of the audit report to the governing body of the political subdivision. The data classification of an audit performed by the Office of the State Auditor is governed by chapter 6.\nThe state auditor has the same powers with regard to a corporation created by a political subdivision as the state auditor has with regard to the political subdivision that created the corporation.\nThe following data created, collected, or maintained by a corporation subject to this section are classified as private data under section 13.02, subdivision 12, or as nonpublic data under section 13.02, subdivision 9: (1) data relating either (i) to private businesses consisting of financial statements, credit reports, audits, business plans, income and expense projections, customer lists, balance sheets, income tax returns, and design, market, and feasibility studies not paid for with public funds, or (ii) to enterprises operated by the corporation that are in competition with entities offering similar goods and services, so long as the data are not generally known or readily ascertainable by proper means and disclosure of specific data would cause harm to the competitive position of the enterprise or private business, provided that the goods or services do not require a tax levy; and (2) any data identified in section 13.201 collected or received by a transit organization.",
	"repealed": false
}