{
	"id": "299F.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.012",
	"title": "299F.012 FIRE SAFETY ACCOUNT.",
	"text": "From the revenues appropriated from the fire safety account, established under section 297I.06, subdivision 3, the commissioner of public safety may expend funds for the activities and programs identified by the advisory committee established under subdivision 2 and recommended to the commissioner of public safety. The commissioner shall not expend funds without the recommendation of the advisory committee established under subdivision 2. These funds are to be used to provide resources needed for identified activities and programs of the Minnesota fire service and to ensure the State Fire Marshal Division responsibilities are fulfilled. Any balance remaining in the account after the first year of the biennium must be appropriated to the commissioner of public safety for the purposes specified in law.\n(a) The Fire Service Advisory Committee shall provide recommendations to the commissioner of public safety on fire service-related issues and shall consist of representatives of each of the following organizations: two appointed by the president of the Minnesota State Fire Chiefs Association, two appointed by the president of the Minnesota State Fire Department Association, two appointed by the president of the Minnesota Professional Fire Fighters, two appointed by the president of the League of Minnesota Cities, one appointed by the president of the Minnesota Association of Townships, one appointed by the president of the Insurance Federation of Minnesota, one appointed jointly by the presidents of the Minnesota Chapter of the International Association of Arson Investigators and the Fire Marshals Association of Minnesota, and the commissioner of public safety or the commissioner's designee. The commissioner of public safety must ensure that at least three of the members of the advisory committee work and reside in counties outside of the seven-county metropolitan area. The committee shall provide funding recommendations to the commissioner of public safety from the fire safety fund for the following purposes:\n(1) for the Minnesota Board of Firefighter Training and Education;\n(2) for programs and staffing for the State Fire Marshal Division; and\n(3) for fire-related regional response team programs and any other fire service programs that have the potential for statewide impact.\n(b) The committee under paragraph (a) does not expire.\nThe commissioner of public safety shall, by December 1 of each year, (1) provide an accounting of how the funds in the fire safety account were spent in the preceding fiscal year and (2) report any funds not spent in a fiscal year to the chairs of the committees of the house of representatives and the senate having jurisdiction over public safety finance. Money in the account does not cancel but remains available for expenditures for the programs identified in subdivisions 1 and 2.\nThe legislature intends that all money in the fire safety account be appropriated to the commissioner of public safety to fund the state fire marshal's office and activities and programs under this section.",
	"repealed": false
}