{
	"id": "124D.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.791",
	"title": "124D.791 INDIAN EDUCATION DIRECTOR.",
	"text": "An Indian education director shall be appointed by the commissioner.\nThe commissioner shall select the Indian education director on the basis of outstanding professional qualifications and knowledge of American Indian education, culture, practices, and beliefs. The Indian education director serves in the unclassified service. The commissioner may remove the Indian education director for cause. The commissioner is encouraged to seek qualified applicants who are enrolled members of a tribe.\nCompensation of the Indian education director shall be established under chapter 15A.\nThe American Indian education director shall:\n(1) work collaboratively and in conjunction with the Tribal Liaison, the Tribal Nations Education Committee, the 11 Tribal nations in Minnesota, the Minnesota Chippewa Tribe, and the Minnesota Indian Affairs Council;\n(2) evaluate the state of American Indian education in Minnesota;\n(3) engage the Tribal bodies, community groups, parents of children eligible to be served by American Indian education programs, American Indian administrators and teachers, persons experienced in the training of teachers for American Indian education programs, the Tribally controlled schools, and other persons knowledgeable in the field of American Indian education and seek their advice on policies that can improve the quality of American Indian education;\n(4) advise the commissioner on American Indian education issues, including:\n(i) issues facing American Indian students;\n(ii) policies for American Indian education;\n(iii) awarding scholarships to eligible American Indian students and in administering the commissioner's duties regarding awarding of American Indian education grants to school districts; and\n(iv) administration of the commissioner's duties under sections 124D.71 to 124D.82 and other programs for the education of American Indian people;\n(5) propose to the commissioner legislative changes that will improve the quality of American Indian education;\n(6) develop a strategic plan and a long-term framework for American Indian education, in conjunction with the Minnesota Indian Affairs Council, that is updated every five years and implemented by the commissioner, with goals to:\n(i) increase American Indian student achievement, including increased levels of proficiency and growth on statewide accountability assessments;\n(ii) increase the number of American Indian teachers in public schools;\n(iii) close the achievement gap between American Indian students and their more advantaged peers;\n(iv) increase the statewide graduation rate for American Indian students; and\n(v) increase American Indian student placement in postsecondary programs and the workforce; and\n(7) keep the American Indian community informed about the work of the department by reporting to the Tribal Nations Education Committee at each committee meeting.",
	"repealed": false
}