{
	"id": "181.724",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.724",
	"title": "181.724 INTERGOVERNMENTAL MISCLASSIFICATION ENFORCEMENT AND EDUCATION PARTNERSHIP ACT.",
	"text": "This section and section 181.725 may be cited as the \"Intergovernmental Misclassification Enforcement and Education Partnership Act.\"\nIt is the policy of the state of Minnesota to prevent employers from misclassifying workers, because employee misclassification allows an employer to illegally evade obligations under state labor, employment, and tax laws, including but not limited to the laws governing minimum wage, overtime, unemployment insurance, paid family medical leave, earned sick and safe time, workers' compensation insurance, temporary disability insurance, the payment of wages, and payroll taxes.\n(a) For the purposes of this section and section 181.725, the following terms have the meanings given, unless the language or context clearly indicates that a different meaning is intended.\n(b) \"Partnership entity\" means one of the following governmental entities with jurisdiction over employee misclassification in Minnesota:\n(1) the Department of Labor and Industry;\n(2) the Department of Revenue;\n(3) the Department of Employment and Economic Development;\n(4) the Department of Commerce; and\n(5) the attorney general in the attorney general's enforcement capacity under sections 177.45 and 181.1721.\n(c) \"Employee misclassification\" means the practice by an employer of not properly classifying workers as employees.\nFor purposes of this section, a partnership entity:\n(1) shall communicate with other entities to help detect and investigate instances of employee misclassification;\n(2) may request from, provide to, or receive from the other partnership entities data necessary for the purpose of detecting and investigating employee misclassification, unless prohibited by federal law; and\n(3) may collaborate with one another when investigating employee misclassification, unless prohibited by federal law. Collaboration includes but is not limited to referrals, strategic enforcement, and joint investigations by two or more partnership entities.",
	"repealed": false
}