{
	"id": "356.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.24",
	"title": "356.24 SUPPLEMENTAL PENSION OR DEFERRED COMPENSATION PLANS, RESTRICTIONS UPON GOVERNMENT UNITS.",
	"text": "It is unlawful for a school district or other governmental subdivision or state agency to levy taxes for or to contribute public funds to a supplemental pension or deferred compensation plan that is established, maintained, and operated in addition to a primary pension program for the benefit of the governmental subdivision employees other than:\n(1) to a supplemental pension plan that was established, maintained, and operated before May 6, 1971;\n(2) to a plan that provides solely for group health, hospital, disability, or death benefits;\n(3) to the individual retirement account plan established by chapter 354B;\n(4) to a plan that provides solely for severance pay under section 465.72 to a retiring or terminating employee;\n(5) to a deferred compensation plan defined in subdivision 3;\n(6) for personnel employed by the Board of Trustees of the Minnesota State Colleges and Universities and not covered by clause (5), to the supplemental retirement plan under chapter 354C, if the supplemental plan coverage is provided for in a personnel policy or in the collective bargaining agreement of the public employer with the exclusive representative of the covered employees in an appropriate unit, in an amount matching employee contributions on a dollar for dollar basis, but not to exceed an employer contribution of $2,700 a year for each employee;\n(7) to a supplemental plan or to a governmental trust to save for postretirement health care expenses qualified for tax-preferred treatment under the Internal Revenue Code, if the supplemental plan coverage is provided for in a personnel policy or in the collective bargaining agreement of a public employer with the exclusive representative of the covered employees in an appropriate unit;\n(8) to the laborers national industrial pension fund or to a laborers local pension fund for the employees of a governmental subdivision who are covered by a collective bargaining agreement that provides for coverage by that fund and that sets forth a fund contribution rate, but not to exceed an employer contribution of $10,000 per year per employee;\n(9) to the plumbers and pipefitters national pension fund or to a plumbers and pipefitters local pension fund for the employees of a governmental subdivision who are covered by a collective bargaining agreement that provides for coverage by that fund and that sets forth a fund contribution rate, but not to exceed an employer contribution of $5,000 per year per employee;\n(10) to the international union of operating engineers pension fund for the employees of a governmental subdivision who are covered by a collective bargaining agreement that provides for coverage by that fund and that sets forth a fund contribution rate, but not to exceed an employer contribution of $10,000 per year per employee;\n(11) to the International Association of Machinists national pension fund for the employees of a governmental subdivision who are covered by a collective bargaining agreement that provides for coverage by that fund and that sets forth a fund contribution rate, but not to exceed an employer contribution of $5,000 per year per employee;\n(12) for employees of United Hospital District, Blue Earth, to the state of Minnesota deferred compensation program, if the employee makes a contribution, in an amount that does not exceed the total percentage of covered salary under section 353.27, subdivisions 3 and 3a;\n(13) to the alternative retirement plans established by the Hennepin County Medical Center under section 383B.914, subdivision 5;\n(14) to the International Brotherhood of Teamsters Central States pension plan for fixed-route bus drivers employed by the St. Cloud Metropolitan Transit Commission who are members of the International Brotherhood of Teamsters Local 638 by virtue of that employment; or\n(15) to a supplemental plan organized and operated under the Internal Revenue Code, as amended, that is wholly and solely funded by the employee's accumulated sick leave, accumulated vacation leave, and accumulated severance pay.\n[Repealed, 2000 c 461 art 13 s 4]\nA personnel policy for unrepresented employees, a collective bargaining agreement for represented employees, or a school board for school district employees may establish limits on the number of vendors of plans covered by the exceptions set forth in subdivision 1 that it will utilize and conditions under which those vendors may contact employees both during working hours and after working hours.\n(a) Any insurance company, mutual fund company, or similar company providing investments eligible under section 403(b) of the Internal Revenue Code and eligible to receive employer contributions under this section may request the State Board of Investment, in conjunction with the Department of Commerce, to review the financial standing of the company, the competitiveness of its investment options and returns, and the level of all charges and fees impacting those returns.\n(b) The State Board of Investment may establish a fee for each review. The State Board of Investment must maintain and have available a list of all reviewed companies.\n(c) In reviewing companies under this section, the State Board of Investment must not be considered to be acting as a fiduciary or to be engaged in a fiduciary activity under chapter 356A or common law.\nMS 2018 [Repealed, 2020 c 108 art 2 s 3]\n(a) As used in this section:\n(1) \"deferred compensation plan\" means a plan that satisfies the requirements of this subdivision;\n(2) \"plan administrator\" means the individual or entity defined as the plan administrator in the plan document for the Minnesota deferred compensation plan under section 352.965 or a deferred compensation plan under section 457(b) of the Internal Revenue Code; and\n(3) \"vendor\" means the provider of an annuity contract, custodial account, or retirement income account under a tax-sheltered annuity plan under section 403(b) of the Internal Revenue Code.\n(b) The plan is:\n(1) the Minnesota deferred compensation plan under section 352.965;\n(2) a tax-sheltered annuity plan under section 403(b) of the Internal Revenue Code; or\n(3) a deferred compensation plan under section 457(b) of the Internal Revenue Code.\n(c) For each investment fund available to participants under the plan, other than in a self-directed brokerage account or fixed annuity contract, the plan administrator or vendor discloses at least annually to participants a statement that sets forth (1) all fees, including administrative, maintenance, and investment fees, that impact the rate of return on each investment fund available under the plan, and (2) the rates of return for the prior one-, five-, and ten-year periods or for the life of the fund, if shorter, in an easily understandable document. The plan administrator or vendor must file a copy of this statement annually with the executive director of the Legislative Commission on Pensions and Retirement.\n(d) Enrollment in the plan is provided for in:\n(1) a personnel policy of the public employer;\n(2) a collective bargaining agreement between the public employer and the exclusive representative of public employees in an appropriate unit; or\n(3) an individual employment contract (i) between a city and a city manager or other management employee, or (ii) between a school district and a superintendent or other management employee.\n(e) The plan covers employees of a school district, state agency, or other governmental subdivision. The plan may cover city managers covered by an alternative retirement arrangement under section 353.028, subdivision 3, paragraph (a) or (b), but must not cover employees of the Board of Trustees of Minnesota State Colleges and Universities who are covered by the Higher Education Supplemental Retirement Plan under chapter 354C.\n(f) If the public employer makes matching contributions to the plan, the matching contributions must match, on a dollar for dollar basis, employee elective deferral contributions not to exceed the lesser of (1) the maximum authorized under the policy described in paragraph (d) that provides for enrollment in the plan or program, or (2) one-half of the annual limit on elective deferrals under section 402(g) of the Internal Revenue Code. In lieu of or in addition to matching an employee's elective deferral contributions, the public employer may make employer matching contributions on behalf of an employee on account of qualified student loan payments, as defined in the Secure 2.0 Act of 2022, Public Law 117-328 (December 29, 2022), Division T, section 110, paragraph (b), and any regulations adopted thereunder. The employer matching contributions on account of an employee's qualified student loan payments plus any employer matching contributions that match an employee's elective deferral contributions must not exceed, for the year, the lesser of (1) the maximum authorized under the policy described in paragraph (d) that provides for enrollment in the plan or program, (2) one-half of the annual limit on elective deferrals under section 402(g) of the Internal Revenue Code, or (3) the employee's compensation for the year.\n(g) Contributions to the plan may include contributions deducted from an employee's sick leave, accumulated vacation leave, or accumulated severance pay, whether characterized as employee contributions or nonelective employer contributions, up to applicable limits under the Internal Revenue Code. Such contributions are not subject to the match requirement and limit in paragraph (f).",
	"repealed": false
}