{
	"id": "430.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.03",
	"title": "430.03 OBJECTIONS; APPEAL; REAPPRAISAL.",
	"text": "A person whose property is proposed to be taken, interfered with, or assessed for benefits under this chapter, who (1) thinks there is an irregularity in the council proceedings or action of the commissioners so that the award of the commissioners ought not to be confirmed, or (2) is dissatisfied with the amount of damages awarded for taking or interfering with the person's property or with the amount of the assessment for benefits to any property affected by the proceedings, may appeal from the city council's order of confirmation to the district court of the county within 20 days after the order. This appeal must be made by serving a written notice of the appeal upon the city clerk. The appeal must specify the property of the appellant affected by the award and assessment and refer to the objection filed. The appellant shall also deliver to the city clerk a bond to the city, executed by the appellant or someone on the appellant's behalf, with two sureties, in the amount of $50 conditioned to pay costs that may be awarded against the appellant. The city clerk shall then make out and send to the court administrator of the district court a copy of the commissioners' award as confirmed by the council, the order of the council confirming it, and the objection filed by the appellant, all certified by the clerk to be true copies, within ten days after the taking of the appeal.\nIf more than one appeal is taken from an award, the city clerk need not, in subsequent appeals, send anything to the court administrator except a certified copy of the appellant's objections.\nAn appeal requires no pleading. The court shall determine (1) whether there was any irregularity in the proceedings or omission of duty prejudicial to the appellant and specified in the appellant's written objections, so that the appellant's award or assessment ought not to stand, and (2) whether the commissioners had jurisdiction to take action affecting the appellant.\nIf a person claims that a pedestrian mall ordinance proposed in connection with an improvement under section 430.011 and adopted by the city council is invalid, the person shall appeal under section 430.031, subject to the right of the court to consolidate for hearing any appeal taken under that section with an appeal taken under this section.\nThe case may be heard on eight days' notice at any general or special term of the court. It has precedence over other civil cases. The judgment of the court must be either to confirm or annul the proceedings only as they affect the property of the appellant proposed to be taken, damaged, or assessed for benefits and described in the written objection. No appeal or writ of error may be taken from this determination.\nIf the amount of damages awarded or assessment made for benefits is complained of by the appellant, the court shall, if the proceedings are confirmed in other respects, appoint as commissioners three disinterested freeholders who are residents of the city to reappraise the damages or benefits. The parties to the appeal must be heard by the court upon the appointment of these commissioners. The court shall fix the time and place of the meeting of the commissioners. They shall be sworn to the faithful discharge of their duties as commissioners, view the premises, and hear from interested parties allegations and proofs pertinent to the question of the amount of the damages or assessments. These commissioners are governed by the provisions in this chapter governing commissioners appointed by the city council, including the method of arriving at the amount of damages and the offset of benefits to other property of the same owners. They shall, after the hearing and after they view the premises, report to the court their appraisal of damages or assessments of benefits in respect to the appellant. The award or assessment of these commissioners is final unless it is set aside by the court for good cause. If the report is set aside, the court may recommit it to the same commissioners or appoint new commissioners.\nThe court shall allow a reasonable compensation to commissioners for their services and award costs of the appeal including the compensation of commissioners, as it thinks just. If the court decides that the appeal was frivolous or vexatious, it may charge double costs against the appellant.\nThe city or any party may appeal from the court's final order to the court of appeals.\nReports and other papers from city council proceedings under this chapter must be filed in the office of the city clerk; notices of appeal and other notices to the city must be served upon the city clerk. Reports and other papers from park board proceedings under this chapter must be filed in the office of the secretary or other recording officer of the board; notices of appeal and other notices to the city must be served upon the secretary or other recording officer of the board.",
	"repealed": false
}