{
	"id": "80A.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.79",
	"title": "80A.79 SECTION 602; INVESTIGATIONS AND SUBPOENAS.",
	"text": "(a) Authority to investigate. The administrator may:\n(1) conduct public or private investigations within or outside of this state which the administrator considers necessary or appropriate to determine whether a person has violated, is violating, or is about to violate this chapter or a rule adopted or order issued under this chapter, or to aid in the enforcement of this chapter or in the adoption of rules and forms under this chapter;\n(2) require or permit a person to testify, file a statement, or produce a record, under oath or otherwise as the administrator determines, as to all the facts and circumstances concerning a matter to be investigated or about which an action or proceeding is to be instituted; and\n(3) publish a record concerning an action, proceeding, or an investigation under, or a violation of, this chapter or a rule adopted or order issued under this chapter if the administrator determines it is necessary or appropriate in the public interest and for the protection of investors.\n(b) Administrator powers to investigate. For the purpose of an investigation under this chapter, the administrator or its designated officer may administer oaths and affirmations, subpoena witnesses, seek compulsion of attendance, take evidence, require the filing of statements, and require the production of any records that the administrator considers relevant or material to the investigation.\n(c) Procedure and remedies for noncompliance. If a person does not appear or refuses to testify, file a statement, produce records, or otherwise does not obey a subpoena as required by the administrator under this chapter, the administrator may refer the matter to the attorney general, who may apply to the district court or a court of another state to enforce compliance. The court may:\n(1) hold the person in contempt;\n(2) order the person to appear before the administrator;\n(3) order the person to testify about the matter under investigation or in question;\n(4) order the production of records;\n(5) grant injunctive relief, including restricting or prohibiting the offer or sale of securities or the providing of investment advice;\n(6) impose a civil penalty up to $10,000 for each violation; and\n(7) grant any other necessary or appropriate relief.\n(d) Application for relief. This section does not preclude a person from applying to the district court or a court of another state for relief from a request to appear, testify, file a statement, produce records, or obey a subpoena.\n(e) Use immunity procedure. An individual is not excused from attending, testifying, filing a statement, producing a record or other evidence, or obeying a subpoena of the administrator under this chapter or in an action or proceeding instituted by the administrator under this chapter on the ground that the required testimony, statement, record, or other evidence, directly or indirectly, may tend to incriminate the individual or subject the individual to a criminal fine, penalty, or forfeiture. If the individual refuses to testify, file a statement or produce a record or other evidence on the basis of the individual's privilege against self-incrimination, the administrator may apply to the district court to compel the testimony, the filing of the statement, the production of the record, or the giving of other evidence. The testimony, record, or other evidence compelled under such an order may not be used, directly or indirectly, against the individual in a criminal case, except in a prosecution for perjury or contempt or otherwise failing to comply with the order.\n(f) Assistance to securities regulator of another jurisdiction. At the request of the securities regulator of another state or a foreign jurisdiction, the administrator may provide assistance if the requesting regulator states that it is conducting an investigation to determine whether a person has violated, is violating, or is about to violate a law or rule of the other state or foreign jurisdiction relating to securities matters that the requesting regulator administers or enforces. The administrator may provide the assistance by using the authority to investigate and the powers conferred by this section as the administrator determines is necessary or appropriate. The assistance may be provided without regard to whether the conduct described in the request would also constitute a violation of this chapter or other law of this state if occurring in this state. In deciding whether to provide the assistance, the administrator may consider whether the requesting regulator is permitted and has agreed to provide assistance reciprocally within its state or foreign jurisdiction to the administrator on securities matters when requested; whether compliance with the request would violate or prejudice the public policy of this state; and the availability of resources and employees of the administrator to carry out the request for assistance.",
	"repealed": false
}