{
	"id": "268.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.105",
	"title": "268.105 APPEALS.",
	"text": "(a) Upon a timely appeal to a determination having been filed or upon a referral for direct hearing under section 268.101, subdivision 3a, the chief unemployment law judge must set a time and date for a de novo due process hearing and send notice to any applicant and any employer, by mail or electronic transmission, not less than ten calendar days before the date of the hearing.\n(b) The department may adopt rules on procedures for hearings under Minnesota Rules, chapter 3310. The rules need not conform to common law or statutory rules of evidence and other technical rules of procedure.\n(c) The chief unemployment law judge has discretion regarding the method by which the hearing is conducted.\n(a) After the conclusion of the hearing, upon the evidence obtained, the unemployment law judge must make written findings of fact, reasons for decision, and decision and send those, by mail or electronic transmission, to all parties. When the credibility of a witness testifying in a hearing has a significant effect on the outcome of a decision, the unemployment law judge must set out the reason for crediting or discrediting that testimony. The unemployment law judge's decision is final unless a request for reconsideration is filed under subdivision 2.\n(b) If the appealing party fails to participate in the hearing, the unemployment law judge has the discretion to dismiss the appeal by summary decision. By failing to participate, the appealing party is considered to have failed to exhaust available administrative remedies unless the appealing party files a request for reconsideration under subdivision 2 and establishes good cause for failing to participate in the hearing. Submission of a written statement does not constitute participation. The applicant must participate personally and appearance solely by a representative does not constitute participation.\n(c) The unemployment law judge must issue a decision dismissing the appeal as untimely if the judge decides the appeal was not filed within 45 calendar days after the sending of the determination. The unemployment law judge may dismiss the appeal by summary decision, or the judge may conduct a hearing to obtain evidence on the timeliness of the appeal.\n(d) Decisions of an unemployment law judge are not precedential.\n(a) Only employees of the department who are attorneys licensed to practice law in Minnesota may serve as the chief unemployment law judge, senior unemployment law judges who are supervisors, or unemployment law judges. The commissioner must designate a chief unemployment law judge.\n(b) The chief unemployment law judge must assign an unemployment law judge to conduct a hearing and may transfer to another judge any proceedings pending before an unemployment law judge.\n(c) A full-time unemployment law judge must be paid a salary within a range directly tied to the salary set under section 15A.083, subdivision 7, for a workers' compensation judge. The salary paid within that range to any single unemployment law judge is based on experience and performance.\n(a) Any party, or the commissioner, may within 45 calendar days of the sending of the unemployment law judge's decision under subdivision 1a, file a request for reconsideration asking the judge to reconsider that decision.\n(b) Upon a request for reconsideration having been filed, the chief unemployment law judge must send a notice, by mail or electronic transmission, to all parties that a request for reconsideration has been filed. The notice must inform the parties:\n(1) that reconsideration is the procedure for the unemployment law judge to correct any factual or legal mistake in the decision, or to order an additional hearing when appropriate;\n(2) of the opportunity to provide comment on the request for reconsideration, and the right under subdivision 5 to obtain a copy of any recorded testimony and exhibits offered or received into evidence at the hearing;\n(3) that providing specific comments as to a perceived factual or legal mistake in the decision, or a perceived mistake in procedure during the hearing, will assist the unemployment law judge in deciding the request for reconsideration;\n(4) of the right to obtain any comments and submissions provided by any other party regarding the request for reconsideration; and\n(5) of the provisions of paragraph (c) regarding additional evidence.\nThis paragraph does not apply if paragraph (d) is applicable. Sending the notice does not mean the unemployment law judge has decided the request for reconsideration was timely filed.\n(c) In deciding a request for reconsideration, the unemployment law judge must not consider any evidence that was not submitted at the hearing, except for purposes of determining whether to order an additional hearing.\nThe unemployment law judge must order an additional hearing if a party shows that evidence which was not submitted at the hearing:\n(1) would likely change the outcome of the decision and there was good cause for not having previously submitted that evidence; or\n(2) would show that the evidence that was submitted at the hearing was likely false and that the likely false evidence had an effect on the outcome of the decision.\n\"Good cause\" for purposes of this paragraph is a reason that would have prevented a reasonable person acting with due diligence from submitting the evidence.\n(d) If the party who filed the request for reconsideration failed to participate in the hearing, the unemployment law judge must issue an order setting aside the decision and ordering an additional hearing if the party who failed to participate had good cause for failing to do so. The party who failed to participate in the hearing must be informed of the requirement to show good cause for failing to participate. If the unemployment law judge determines that good cause for failure to participate has not been shown, the judge must state that in the decision issued under paragraph (f).\nSubmission of a written statement at the hearing does not constitute participation for purposes of this paragraph.\n\"Good cause\" for purposes of this paragraph is a reason that would have prevented a reasonable person acting with due diligence from participating in the hearing.\n(e) A request for reconsideration must be decided by the unemployment law judge who issued the decision under subdivision 1a unless that judge:\n(1) is no longer employed by the department;\n(2) is on an extended or indefinite leave; or\n(3) has been removed from the proceedings by the chief unemployment law judge.\n(f) If a request for reconsideration is timely filed, the unemployment law judge must issue:\n(1) a decision affirming the findings of fact, reasons for decision, and decision issued under subdivision 1a;\n(2) a decision modifying the findings of fact, reasons for decision, and decision under subdivision 1a; or\n(3) an order setting aside the findings of fact, reasons for decision, and decision issued under subdivision 1a, and ordering an additional hearing.\nThe unemployment law judge must issue a decision dismissing the request for reconsideration as untimely if the judge decides the request for reconsideration was not filed within 45 calendar days after the sending of the decision under subdivision 1a.\nThe unemployment law judge must send to all parties, by mail or electronic transmission, the decision or order issued under this subdivision. A decision affirming or modifying the previously issued findings of fact, reasons for decision, and decision, or a decision dismissing the request for reconsideration as untimely, is the final decision on the matter and is binding on the parties unless judicial review is sought under subdivision 7.\n[Repealed by amendment, 2005 c 112 art 2 s 34]\n(a) An appeal that is pending before an unemployment law judge may be withdrawn by the appealing party, or an authorized representative of that party, by filing of a notice of withdrawal. A notice of withdrawal may be filed by mail or by electronic transmission.\n(b) The appeal must, by order, be dismissed if a notice of withdrawal is filed, unless an unemployment law judge directs that further proceedings are required for a proper result. An order of dismissal issued as a result of a notice of withdrawal is not subject to reconsideration or appeal.\n(c) A party may file a new appeal after the order of dismissal, but the original 45-calendar-day period for appeal begins from the date of issuance of the determination and that time period is not suspended or restarted by the notice of withdrawal and order of dismissal. The new appeal may only be filed by mail or facsimile transmission.\n(d) For purposes of this subdivision, \"appeals\" includes a request for reconsideration filed under subdivision 2.\n(a) If an unemployment law judge's decision allows unemployment benefits to an applicant, the benefits must be paid regardless of any request for reconsideration or petition to the Minnesota Court of Appeals.\n(b) If an unemployment law judge's decision modifies or reverses a determination that allowed unemployment benefits, or on reconsideration the decision modifies or reverses a prior decision that allowed benefits, any benefits paid are an overpayment of those benefits. A decision that results in an overpayment of unemployment benefits must set out the amount of the overpayment and the requirement under section 268.18, subdivision 1, that the benefits must be repaid.\n(c) If an unemployment law judge's decision on reconsideration under subdivision 2 allows unemployment benefits under section 268.095 because of a quit or discharge and the judge's decision is reversed by the Minnesota Court of Appeals or the Supreme Court of Minnesota, the applicant cannot be held ineligible for any of the benefits paid before the date of the court's reversal. The effect of the court's reversal is:\n(1) that the applicant may only be held ineligible for future unemployment benefits; and\n(2) the application of section 268.047, subdivision 3, in computing the future tax rate of a taxpaying employer.\n(d) If an unemployment law judge, on reconsideration under subdivision 2, orders the taking of additional evidence, the judge's prior decision must continue to be enforced until new findings of fact and decision are made by the judge.\n[Repealed, 2014 c 251 art 2 s 25]\n(a) All testimony at any hearing must be recorded. A copy of any recorded testimony and exhibits offered or received into evidence at the hearing must, upon request, be furnished to a party at no cost:\n(1) during the time period for filing a request for reconsideration;\n(2) while a request for reconsideration is pending;\n(3) during the time for filing a petition under subdivision 7; or\n(4) while a petition is pending.\nRegardless of any law to the contrary, recorded testimony and other evidence may later be made available only under a district court order. A subpoena is not considered a district court order.\n(b) Testimony obtained at a hearing may not be used or considered for any purpose, including impeachment, in any civil, administrative, or contractual proceeding, except by a local, state, or federal human rights agency with enforcement powers, unless the proceeding is initiated by the department. This paragraph does not apply to criminal proceedings.\nNo findings of fact or decision or order issued by an unemployment law judge may be held conclusive or binding or used as evidence in any separate or subsequent action in any other forum, be it contractual, administrative, or judicial, except proceedings provided for under this chapter, regardless of whether the action involves the same or related parties or involves the same facts.\n(a) In any proceeding under subdivision 1 or 2, an applicant or employer may be represented by any authorized representative.\nExcept for services provided by an attorney-at-law, no person may charge an applicant a fee of any kind for advising, assisting, or representing an applicant in a hearing, on reconsideration, or in a proceeding under subdivision 7.\n(b) An applicant may not be charged fees, costs, or disbursements of any kind in a proceeding before an unemployment law judge, the Minnesota Court of Appeals, or the Supreme Court of Minnesota.\n(c) No attorney fees may be awarded, or costs or disbursements assessed, against the department as a result of any proceedings under this section.\n(a) The Minnesota Court of Appeals must, by writ of certiorari to the department, review the unemployment law judge's decision on reconsideration, provided a petition for the writ is filed with the court and a copy is served upon the unemployment law judge or the commissioner and any other party within 45 calendar days of the sending of the unemployment law judge's decision on reconsideration under subdivision 2. Three days are added to the 45-calendar-day period if the decision on reconsideration was mailed to the parties.\n(b) Any employer petitioning for a writ of certiorari must pay to the court the required filing fee in accordance with the Rules of Civil Appellate Procedure. If the employer requests a written transcript of the testimony received at the hearing conducted under subdivision 1, the employer must pay to the department the cost of preparing the transcript. That money is credited to the administration account.\n(c) Upon issuance by the Minnesota Court of Appeals of a writ of certiorari as a result of an applicant's petition, the department must furnish to the applicant at no cost a written transcript of any testimony received at the hearing conducted under subdivision 1, and, if requested, a copy of all exhibits entered into evidence. No filing fee or cost bond is required of an applicant petitioning the Minnesota Court of Appeals for a writ of certiorari.\n(d) The Minnesota Court of Appeals may affirm the decision of the unemployment law judge or remand the case for further proceedings; or it may reverse or modify the decision if the substantial rights of the petitioner may have been prejudiced because the findings, inferences, conclusion, or decision are:\n(1) in violation of constitutional provisions;\n(2) in excess of the statutory authority or jurisdiction of the department;\n(3) made upon unlawful procedure;\n(4) affected by other error of law;\n(5) unsupported by substantial evidence in view of the hearing record as submitted; or\n(6) arbitrary or capricious.\n(e) The department is the primary responding party to any judicial action involving an unemployment law judge's decision. The department may be represented by an attorney licensed to practice law in Minnesota who is an employee of the department.",
	"repealed": false
}