{
	"id": "353.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.28",
	"title": "353.28 FINANCING OF EMPLOYER CONTRIBUTIONS.",
	"text": "Each governmental subdivision shall secure its employer contributions and its additional employer contributions and shall pay these contributions to the retirement fund out of moneys collected from taxes or other revenue of the governmental subdivision, as its obligation for all members employed by such subdivision and these contributions shall be charged as administrative costs.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\nAny amount due under this section or section 353.27, subdivision 4, is payable with interest at the applicable rate or rates specified in section 356.59, subdivision 3, compounded annually, from the date due until the date payment is received by the association, with a minimum interest charge of $10.\n(a) If a governmental subdivision which receives the direct proceeds of property taxation fails to pay an amount due under this chapter or chapter 353C or 353D, the executive director shall certify the amount to the governmental subdivision for payment. If the governmental subdivision fails to remit the sum so due in a timely fashion, the executive director shall certify the amount to the applicable county auditor for collection. The county auditor shall collect the amount out of the revenue of the governmental subdivision, or shall add the amount to the levy of the governmental subdivision and make payment directly to the association. This tax must be levied, collected, and apportioned in the manner that other taxes are levied, collected, and apportioned.\n(b) If a governmental subdivision which is not funded directly from the proceeds of property taxation fails to pay an amount due under this chapter, the executive director shall certify the amount to the governmental subdivision for payment. If the governmental subdivision fails to pay the amount for a period of 60 days after the date of the certification, the executive director shall certify the amount to the commissioner of management and budget, who shall deduct the amount from any subsequent state-aid payment or state appropriation amount applicable to the governmental subdivision and make payment directly to the association. If the amount of the state-aid payment or state appropriation is not sufficient to pay the full sum due, the amounts paid to the association must be applied first to the unpaid employee deductions withheld from the employees' wages and next to the unpaid employer contributions. Any remaining amount received by the association must be applied to the interest due on the employee and employer contribution amounts. If a governmental subdivision under this paragraph owes amounts to more than one public retirement plan, section 356.98 applies.\n(c) If a governmental subdivision has been dissolved or closed, the requirements in paragraph (b) of a certification to the governmental subdivision and the related 60-day waiting period do not apply. The executive director is authorized to immediately certify the applicable amount to the commissioner of management and budget.\n[Repealed, 1973 c 753 s 85]\nIf the taxes authorized to be levied under this section cause the total amount of taxes levied to exceed any limitation upon the power of a county, city, town, or school district to levy taxes, the governmental subdivision concerned, if it is other than a school district, may levy taxes in excess of the limitation in such amount as is necessary to meet its obligations under this section. The expenditures authorized to be made under this chapter by any municipality are not included in computing the cost of government as defined in any home rule charter of any municipality which employs members covered by the retirement fund.\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1973 c 753 s 85]\n[Repealed, 1971 c 106 s 40]",
	"repealed": false
}