{
	"id": "116L.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.17",
	"title": "116L.17 STATE DISLOCATED WORKER PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them in this subdivision.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Dislocated worker\" means an individual who is a resident of Minnesota at the time employment ceased or was working in the state at the time employment ceased and:\n(1) has been permanently separated or has received a notice of permanent separation from public or private sector employment and is eligible for or has exhausted entitlement to unemployment benefits, and is unlikely to return to the previous industry or occupation;\n(2) has been long-term unemployed and has limited opportunities for employment or reemployment in the same or a similar occupation in the area in which the individual resides, including older individuals who may have substantial barriers to employment by reason of age;\n(3) has been terminated or has received a notice of termination of employment as a result of a plant closing or a substantial layoff at a plant, facility, or enterprise;\n(4) has been self-employed, including farmers and ranchers, and is unemployed as a result of general economic conditions in the community in which the individual resides or because of natural disasters;\n(5) is a veteran as defined by section 197.447, has been discharged or released from active duty under honorable conditions within the last 36 months, and (i) is unemployed or (ii) is employed in a job verified to be below the skill level and earning capacity of the veteran;\n(6) is an individual determined by the United States Department of Labor to be covered by trade adjustment assistance under United States Code, title 19, sections 2271 to 2331, as amended;\n(7) is a displaced homemaker. A \"displaced homemaker\" is an individual who has spent a substantial number of years in the home providing homemaking service and (i) has been dependent upon the financial support of another; and due to divorce, separation, death, or disability of that person, must now find employment to self support; or (ii) derived the substantial share of support from public assistance on account of dependents in the home and no longer receives such support. To be eligible under this clause, the support must have ceased while the worker resided in Minnesota;\n(8) is the spouse of a member of the United States armed forces who is on active duty and who meets at least one of the following: (i) has lost employment as a direct result of relocation to accommodate a permanent change in the service member's duty station; or (ii) is unemployed or underemployed and facing barriers to obtaining or upgrading employment;\n(9) is an individual with non-work-related injuries or illnesses who does not have a workers' compensation case but needs support to reenter or remain in the workforce; or\n(10) is an adult with a low income, is a recipient of public assistance, or is deficient in basic skills.\nFor the purposes of this section, \"dislocated worker\" does not include an individual who was an employee, at the time employment ceased, of a political committee, political fund, principal campaign committee, or party unit, as those terms are used in chapter 10A, or an organization required to file with the federal elections commission.\n(d) \"Eligible organization\" means a state or local government unit, nonprofit organization, community action agency, business organization or association, or labor organization.\n(e) \"Plant closing\" means the announced or actual permanent shutdown of a single site of employment, or one or more facilities or operating units within a single site of employment.\n(f) \"Substantial layoff\" means a permanent reduction in the workforce, which is not a result of a plant closing, and which results in an employment loss at a single site of employment during any 30-day period for at least 50 employees excluding those employees that work less than 20 hours per week.\nThe board shall make grants to workforce development areas or other eligible organizations to provide services to dislocated workers as follows:\n(a) The board shall allocate funds available for the purposes of this section in its discretion to respond to substantial layoffs and plant closings.\n(b) The board shall regularly allocate funds to provide services to individual dislocated workers or small groups. The initial allocation for this purpose must be 50 percent of the deposits and transfers into the workforce development fund, less any collection costs paid out of the fund and any amounts appropriated by the legislature from the workforce development fund for programs other than the state dislocated worker program.\n(c) Following the initial allocation, the board may consider additional allocations to provide services to individual dislocated workers. The board's decision to allocate additional funds shall be based on relevant economic indicators including: the number of substantial layoffs to date, notices of substantial layoffs for the remainder of the fiscal year, evidence of declining industries, the number of permanently separated individuals applying for unemployment benefits by workforce development area, and the number of individuals exhausting unemployment benefits by workforce development area. The board must also consider expenditures of allocations to workforce development areas under paragraph (b) made during the first two quarters of the fiscal year and federal resources that have been or are likely to be allocated to Minnesota for the purposes of serving dislocated workers affected by substantial layoffs or plant closings; except that this sentence does not apply in fiscal year 2011.\n(d) The board may, in its discretion, allocate funds carried forward from previous years under subdivision 9 for large, small, or individual layoffs.\nThe board, in consultation with local workforce investment boards and local elected officials, shall develop a method of distributing funds to provide services for dislocated workers who are dislocated as a result of small or individual layoffs. The method shall reflect recent trends in the number of permanently separated individuals applying for unemployment benefits in a given workforce development area. The board shall evaluate and adjust obligations quarterly, based on a similar method.\nFunds granted by the board under this section may be used for any combination of the following, except as otherwise provided in this section:\n(1) employment transition services such as developing readjustment plans for individuals; outreach and intake; early readjustment; job or career counseling; testing; orientation; assessment of skills and aptitudes; provision of occupational and labor market information; job placement assistance; job search; job development; prelayoff assistance; relocation assistance; programs provided in cooperation with employers or labor organizations to provide early intervention in the event of plant closings or substantial layoffs; and entrepreneurial training and business consulting;\n(2) support services, including assistance to help the participant relocate to employ existing skills; out-of-area job search assistance; family care assistance, including child care; commuting assistance; emergency housing and rental assistance; counseling assistance, including personal and financial; health care; emergency health assistance; emergency financial assistance; work-related tools and clothing; and other appropriate support services that enable a person to participate in an employment and training program with the goal of reemployment;\n(3) specific, short-term training to help the participant enhance current skills in a similar occupation or industry; entrepreneurial training, customized training, or on-the-job training; basic and remedial education to enhance current skills; and literacy and work-related English training for non-English speakers;\n(4) long-term training in a new occupation or industry, including occupational skills training or customized training in an accredited program recognized by one or more relevant industries. Long-term training shall only be provided to dislocated workers whose skills are obsolete and who have no other transferable skills likely to result in employment at a comparable wage rate. Training shall only be provided for occupations or industries with reasonable expectations of job availability based on the service provider's thorough assessment of local labor market information where the individual currently resides or is willing to relocate. This clause shall not restrict training in personal services or other such industries; and\n(5) direct training services to provide a measurable increase in the job-related skills of participating incumbent workers, including basic assessment, counseling, and preemployment training services requested by the qualifying employer.\nMS 2022 [Repealed, 2024 c 120 art 4 s 2]\n(a) The commissioner, in consultation with the board, shall enter into contracts with local workforce investment boards, including the allocations determined by the board in subdivision 3. Contracts shall also require local workforce investment boards to report participant data to the commissioner regularly, in order to meet the requirements of this subdivision. The commissioner shall also enter into contracts with eligible organizations involved with substantial layoffs or plant closings. These contracts shall require the eligible organizations to report participant data to the commissioner regularly, in order to meet the requirements of this subdivision.\n(b) The commissioner and the board shall jointly establish performance outcome measures for all local workforce investment boards and eligible organizations involved with substantial layoffs or plant closings. The commissioner may request additional information to calculate these performance measures.\n(c) The commissioner and the board, in consultation with local workforce investment boards and eligible organizations involved with substantial layoffs or plant closings, shall establish minimum standards for the performance measures described in paragraph (b).\n(d) Local workforce investment boards may establish and report on additional performance outcomes based on unique features of local labor markets and other geographic differences.\n(e) The commissioner shall provide a report to the legislature by March 1 of each year on the previous fiscal year's program performance using the data in paragraphs (b) and (d) and analysis of whether local workforce investment boards and eligible organizations involved with substantial layoffs or plant closings are meeting the minimum standards described in paragraph (c). The commissioner shall inform any local workforce investment board or eligible organization that does not meet minimum performance standards in a given year of their status.\n[Repealed, 2004 c 257 s 12]\nNo more than five percent of the funds appropriated to the board for the purposes of this section may be spent by the board for its administrative costs.\nAny funds not allocated, obligated, or expended in a fiscal year shall be available for allocation, obligation, and expenditure in the following fiscal year.\nThe commissioner, in cooperation with local workforce councils, shall be responsible for implementing the following rapid response activities:\n(1) establishing on-site contact with employer and employee representatives within a short period of time after becoming aware of a current or projected plant closing or substantial layoff in order to:\n(i) provide information on and facilitate access to available public programs and services; and\n(ii) provide emergency assistance adapted to the particular closure or layoff;\n(2) promoting the formation of a employee-management committee by providing:\n(i) immediate assistance in the establishment of the employee-management committee;\n(ii) technical advice and information on sources of assistance and liaison with other public and private services and programs; and\n(iii) assistance in the selection of worker representatives in the event no union is present;\n(3) collecting and disseminating information related to economic dislocation, including potential closings or layoffs, and all available resources with the state for dislocated workers;\n(4) providing or obtaining appropriate financial and technical advice and liaison with economic development agencies and other organizations to assist in efforts to avert dislocation;\n(5) disseminating information throughout the state on the availability of services and activities carried out by the dislocated worker unit; and\n(6) assisting the local workforce council in developing its own coordinated response to a plant closing or substantial layoff and access to state economic development assistance.\nConverting layoffs into Minnesota businesses (CLIMB) is created to assist dislocated workers in starting or growing a business. CLIMB must offer entrepreneurial training, business consulting, and technical assistance to dislocated workers seeking to start or grow a business. The commissioner, in cooperation with local workforce councils, must provide the assistance in this subdivision by:\n(1) encouraging closer ties between the Small Business Development Center network, Small Business Development Center training providers, and workforce centers, as well as other dislocated worker program service providers; and\n(2) eliminating grantee performance data disincentives that would otherwise prevent enrollment of dislocated workers in entrepreneurship-related training.",
	"repealed": false
}