{
	"id": "401.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.05",
	"title": "401.05 FISCAL POWERS.",
	"text": "(a) Any county electing to become a CCA jurisdiction may, through its governing body:\n(1) use unexpended funds;\n(2) accept gifts, grants, and subsidies from any lawful source; and\n(3) apply for and accept federal funds.\n(b) This section applies to Tribal Nations, to the extent consistent with the laws of their respective Tribal governments.\n(a) A county or group of counties which acquires facilities under section 401.04 or constructs the facilities may finance the acquisition or construction and the equipping and subsequent improvement of the facilities in whole or in part by:\n(1) the issuance of general obligation bonds of the county or group of counties in the manner provided in chapter 475; or\n(2) the issuance of revenue bonds, secured by a lease agreement as provided in subdivision 3 and sections 469.152 to 469.165, by a city situated in any of the counties or a county housing and redevelopment authority established pursuant to chapter 469 or special law.\nProceedings for the issuance of general obligation bonds shall be instituted by the board of county commissioners of the county or boards of the group of counties.\n(b) If counties have combined as authorized in section 401.02, the joint powers board created under section 471.59 shall, with the approval of the county board of each county which is a party:\n(1) fix the total amount necessary for the construction or acquisition and the equipping and subsequent improvement of the facilities; and\n(2) apportion to each county its share of this amount or of the annual debt service or lease rentals required to pay this amount with interest, as provided in subdivision 4.\n(a) A county or joint powers board of a group of counties which acquires or constructs and equips or improves facilities under this chapter may, with the approval of the board of county commissioners of each county, enter into a lease agreement with a city situated within any of the counties, or a county housing and redevelopment authority established under chapter 469 or any special law. Under the lease agreement, the city or county housing and redevelopment authority shall:\n(1) construct or acquire and equip or improve a facility in accordance with plans prepared by or at the request of a county or joint powers board of the group of counties and approved by the commissioner of corrections; and\n(2) finance the facility by the issuance of revenue bonds.\n(b) The county or joint powers board of a group of counties may lease the facility site, improvements, and equipment for a term upon rental sufficient to produce revenue for the prompt payment of the revenue bonds and all interest accruing on them. Upon completion of payment, the lessee shall acquire title. The real and personal property acquired for the facility constitutes a project and the lease agreement constitutes a revenue agreement as provided in sections 469.152 to 469.165. All proceedings by the city or county housing and redevelopment authority and the county or joint powers board shall be as provided in sections 469.152 to 469.165, with the following adjustments:\n(1) no tax may be imposed upon the property;\n(2) the approval of the project by the commissioner of employment and economic development is not required;\n(3) the Department of Corrections shall be furnished and shall record information concerning each project as it may prescribe, in lieu of reports required on other projects to the commissioner of employment and economic development;\n(4) the rentals required to be paid under the lease agreement shall not exceed in any year one-tenth of one percent of the estimated market value of property within the county or group of counties as last equalized before the execution of the lease agreement;\n(5) the county or group of counties shall provide for payment of all rentals due during the term of the lease agreement in the manner required in subdivision 4;\n(6) no mortgage on the facilities shall be granted for the security of the bonds, but compliance with clause (5) may be enforced as a nondiscretionary duty of the county or group of counties; and\n(7) the county or the joint powers board of the group of counties may sublease any part of the facilities for purposes consistent with their maintenance and operation.\nThe county or each county of the group of counties shall annually levy a tax in an amount necessary to defray its proportion of the net costs of maintenance and operation of the facilities, and shall levy a tax to pay the cost of construction or acquisition, equipping, and any subsequent improvement to the facilities or the retirement of any bonds or required lease payments for these purposes. Each county may levy these taxes without limitation on the rate or amount. This levy shall not cause the amount of other taxes levied or to be levied by the county, which are subject to any limitation, to be reduced in any amount. A joint powers board of the group of counties shall apportion the costs of maintenance and operation, construction or acquisition, equipping, and subsequent improvement of the facilities to each of the counties according to a formula in the agreement entered into by the counties.\nAll money received for the operation and maintenance, payment of indebtedness or lease payments, and construction or acquisition, equipping, and subsequent improvement of the facilities must be deposited in a correctional facilities fund maintained in the treasury of the county in which the facilities are located or any county treasury of the group of counties as designated by the joint powers board. Payments from the fund shall only be made upon certification of the chair or board designee that the expenditures have been approved at a meeting of the board.",
	"repealed": false
}