{
	"id": "60K.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.60",
	"title": "60K.60 SALE OF SELF-STORAGE INSURANCE.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Occupant\" means a person or the person's sublessee, successor, or assignee who is entitled to the use of a leased space or spaces at a self-service storage facility, to the exclusion of others.\n(c) \"Owner\" means the owner or the owner's managing agent of a self-service storage facility.\n(d) \"Personal property\" means movable property that is not affixed to land and includes:\n(1) goods, wares, merchandise, household items, and furnishings;\n(2) vehicles, motor vehicles, trailers, and semitrailers; and\n(3) watercraft and motorized watercraft.\n(e) \"Self-service storage facility\" means any real property that is used for renting or leasing storage space in which the occupants themselves customarily store and remove personal property on a self-service basis.\n(a) An owner or the owner's employees and agents may offer or sell the kinds of insurance described in this section in connection with and incidental to the rental of space at a self-service storage facility. An owner and the owner's employees and agents are exempt from sections 60K.30 to 60K.56, with respect to the sale of this insurance.\n(b) An owner shall file a written notice in a form prescribed by the commissioner that the owner plans to conduct insurance sales as authorized by this section. The notice must specify all locations in this state at which the owner plans to conduct insurance sales. The owner shall notify the commissioner within 30 days after commencing insurance sales at any additional locations in this state.\n(c) An owner shall file the following with the commissioner:\n(1) an agreement that the owner assumes all responsibility for the authorized actions of all unlicensed employees and agents who sell on behalf of the owner the insurance coverage described in this section; and\n(2) an agreement that the owner and the owner's employees and agents are subject to the sections in chapter 72A and in Minnesota Rules, chapter 2790, regarding the marketing of the insurance coverage described in this section and the conduct of persons involved in the sale of the insurance coverage in the same manner as if they were licensed.\n(d) An owner may offer or sell insurance only in connection with and incidental to the rental of space at a self-service storage facility as an individual policy issued to an individual or as a group policy and only with respect to personal property insurance that provides coverage to occupants at the self-service storage facility at which the insurance is transacted, for the loss of or damage to stored personal property that occurs at that facility.\n(e) An owner shall not offer or sell insurance under this section unless:\n(1) the owner provides to the occupant written notice that:\n(i) summarizes the material terms of insurance coverage offered to occupants, including the identity of the insurer, premium amount, benefits, exclusions, and conditions;\n(ii) discloses that the policies offered by the owner may provide a duplication of coverage already provided by an occupant's homeowner's insurance policy, renter's insurance policy, vehicle insurance policy, watercraft insurance policy, or other source of property insurance coverage and that no liability coverage is provided by the insurance coverage. This disclosure must be displayed prominently in 12-point type or capital letters and shall read as follows:\n[Your renters' or homeowners' policy may provide the insurance you need. Check with your insurance agent to determine if your personal property stored at a location other than your home or business is covered.];\n(iii) states that if insurance is required as a condition of rental, the requirement may be satisfied by the occupant purchasing the insurance described in this section or by presenting evidence of other applicable insurance coverage; and\n(iv) describes the process for filing a claim;\n(2) all costs related to the insurance are stated in writing;\n(3) evidence of coverage in a form approved by the insurer is provided to every occupant who purchases the coverage; and\n(4) the insurance is provided by an insurer authorized to transact the applicable kinds of insurance in this state.\n(f) An employee or agent of an owner may act on behalf of and under the supervision of the owner in matters relating to the sale of insurance under this section. The conduct of an employee or agent of an owner acting within the scope of employment or agency is deemed the conduct of the owner for purposes of this section.\n(g) Each owner shall provide a training program, which must be submitted to the commissioner for approval, that gives employees and agents of the owner basic instruction about the provisions of this section, including the kinds of insurance coverage described in this section.\n(h) An owner shall not:\n(1) offer or sell insurance except in connection with and incidental to the rental of space at a self-service storage facility; or\n(2) advertise, represent, or otherwise portray itself or any of its employees or agents as licensed insurers or insurance producers.\n(i) Nothing in this section prohibits:\n(1) an insurer from paying and an owner from receiving a commission, service fee, or other valuable consideration dependent upon the sale of insurance; or\n(2) an owner from paying and its employees or agents from receiving production payments or incentive payments if the payments are not dependent on the sale of insurance.\n(a) No person shall charge a fee for any services rendered in connection with the solicitation, negotiation, or servicing of any self-service storage insurance unless the requirements of paragraphs (b) and (c) are met.\n(b) Before rendering the services, a written statement shall be provided to the prospective occupant disclosing:\n(1) the services for which fees are charged;\n(2) the amount of the fees;\n(3) that the fees are charged in addition to premiums; and\n(4) that premiums include a commission.\n(c) The fees charged must be reasonable in relation to the services rendered.",
	"repealed": false
}