{
	"id": "342.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.72",
	"title": "342.72 SUBSTANCE USE TREATMENT, RECOVERY, AND PREVENTION GRANTS.",
	"text": "A substance use treatment, recovery, and prevention grant program is established and must be administered by the commissioner of health.\nMS 2023 Supp [Repealed by amendment, 2024 c 121 art 3 s 3]\n(a) Substance use treatment, recovery, and prevention grants must be distributed as follows:\n(1) at least 75 percent of the money is for grants for substance use disorder and mental health recovery and prevention programs. Funds must be used for recovery and prevention activities, including substance use prevention for youth, and supplies that assist individuals and families to initiate, stabilize, and maintain long-term recovery from substance use disorders and co-occurring mental health conditions. Recovery and prevention activities may include prevention education, school-linked behavioral health, school-based peer programs, peer supports, self-care and wellness, culturally specific healing, community public awareness, mutual aid networks, telephone recovery checkups, mental health warmlines, harm reduction, recovery community organization development, first episode psychosis programs, and recovery housing; and\n(2) up to 25 percent of the money is for substance use disorder treatment programs as defined in chapter 245G and may be used to implement, strengthen, or expand supportive services and activities that are not covered by medical assistance under chapter 256B, MinnesotaCare under chapter 256L, or the behavioral health fund under chapter 254B. Services and activities may include adoption or expansion of evidence-based practices; competency-based training; continuing education; culturally specific and culturally responsive services; sober recreational activities; developing referral relationships; family preservation and healing; and start-up or capacity funding for programs that specialize in adolescent, culturally specific, culturally responsive, disability-specific, co-occurring disorder, or family treatment services.\n(b) The commissioner of health shall consult with the Governor's Advisory Council on Opioids, Substance Use, and Addiction; the commissioner of human services; and the Office of Cannabis Management to develop an appropriate application process, establish grant requirements, determine what organizations are eligible to receive grants, and establish reporting requirements for grant recipients.\nBy January 15 each year, the commissioner of health must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over health and human services policy and finance that details the substance use treatment, recovery, and prevention grants awarded, including the total amount awarded, total number of recipients, and geographic distribution of those recipients. Notwithstanding section 144.05, subdivision 7, the reporting requirement under this subdivision does not expire.",
	"repealed": false
}