{
	"id": "62K.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.03",
	"title": "62K.03 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given.\n\"Affordable Care Act\" means the federal Patient Protection and Affordable Care Act, Public Law 111-148, as amended, including the federal Health Care and Education Reconciliation Act of 2010, Public Law 111-152, and any amendments, and any federal guidance or regulations issued under these acts.\n\"Dental plan\" means a dental plan as defined in section 62Q.76, subdivision 3.\n\"Enrollee\" means a natural person covered by a health plan and includes an insured policyholder, subscriber, contract holder, member, covered person, or certificate holder.\n\"Health carrier\" means a health carrier as defined in section 62A.011, subdivision 2.\n\"Health plan\" means a health plan as defined in section 62A.011, subdivision 3.\n\"Individual health plan\" means an individual health plan as defined in section 62A.011, subdivision 4.\n\"Limited-scope pediatric dental plan\" means a dental plan meeting the requirements of section 9832(c)(2)(A) of the Internal Revenue Code of 1986, as amended, that provides only pediatric dental benefits meeting the requirements of the Affordable Care Act and is offered by a health carrier. A limited-scope pediatric dental plan includes a dental plan that is offered separately or in conjunction with an individual or small group health plan to individuals who have not attained the age of 19 years as of the beginning of the policy year or to a family.\n\"MNsure\" means MNsure as defined in section 62V.02.\n\"Preferred provider organization\" means a health plan that provides discounts to enrollees or subscribers for services they receive from certain health care providers.\n\"Qualified health plan\" means a health plan that meets the definition in the Affordable Care Act and has been certified by the board of MNsure in accordance with chapter 62V to be offered through MNsure.\n\"Small group health plan\" means a health plan issued by a health carrier to a small employer as defined in section 62L.02, subdivision 26.",
	"repealed": false
}