{
	"id": "190.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.05",
	"title": "190.05 DEFINITIONS.",
	"text": "For the purposes of the Military Code, the terms defined in this section have the meanings given them in this section unless the context clearly indicates otherwise.\nThe \"Department of Military Affairs\" or \"Military Department\" is comprised of and includes the military forces of the state, the Office of the Adjutant General, all military reservations, military installations, armories, air bases, and facilities owned or controlled by the state for military purposes, and civilians employed by the state for the administration of the Military Department.\nThe term \"military forces\" includes the National Guard, the State Guard, and any other organizations or components of the organized militia as may be authorized by state or federal law.\n\"Military reservations,\" without limitation, includes military installations, armories, air bases, and facilities owned or controlled by the state for military purposes.\nThe term \"National Guard\" includes the Army National Guard and the Air National Guard.\n\"Active service\" means either state active service, federally funded state active service, or federal active service.\n\"State active service\" excludes federal active service and federally funded state active service and includes service or duty:\n(1) on behalf of the state in case of actual or threatened public disaster, war, riot, tumult, breach of the peace, resistance of process, or whenever called upon in aid of state civil authority;\n(2) at encampments ordered by state authority;\n(3) otherwise ordered or requested by state authority and requiring the time of the organization or person; or\n(4) travel to or from service or duty under clause (1), (2), or (3).\n\"Federally funded state active service\" means service or duty under United States Code, title 32, as amended through December 31, 1983, and travel to or from that service or duty.\n\"Federal active service\" excludes federally funded state active service and means service or duty under United States Code, title 10, as amended through December 31, 1983, other service or duty as may be required by the law, regulation, or order of the United States government, and travel to or from that service or duty.\nThe term \"enlisted member\" includes enlisted members in the Army National Guard and airmen of the Air National Guard.\n\"Officer\" includes commissioned officers and commissioned warrant officers in the Army National Guard and the Air National Guard.\nUnless otherwise stated, all terms, organizational designations, and titles contained in the Military Code have the same meaning as like terms, organizational designations, and titles in federal law and regulations.",
	"repealed": false
}