{
	"id": "82B.094",
	"url": "https://www.revisor.mn.gov/statutes/cite/82B.094",
	"title": "82B.094 SUPERVISION OF TRAINEE REAL PROPERTY APPRAISERS.",
	"text": "(a) A certified residential real property appraiser or a certified general real property appraiser, in good standing, may engage a trainee real property appraiser to assist in the performance of real estate appraisals, provided that the certified residential real property appraiser or a certified general real property appraiser:\n(1) has been licensed in good standing as either a certified residential real property appraiser or a certified general real property appraiser for the three-year period immediately preceding the individual's application to become a supervisor;\n(2) has completed a six-hour course, approved in advance by the commissioner and provided by an education provider approved by the commissioner, that is specifically oriented to the requirements and responsibilities of supervisory appraisers and trainee appraisers. A course approved by the commissioner for the purposes of this section must be given the course title \"Minnesota Supervisor/Trainee Appraiser Course\";\n(3) has not been the subject of any license or certificate suspension or revocation or has not been prohibited from supervising activities in this state or any other state within the three years immediately preceding the individual's application to become a supervisor;\n(4) has no more than three trainee real property appraisers working under supervision at any one time;\n(5) actively and personally supervises the trainee real property appraiser, which includes ensuring that research of general and specific data has been adequately conducted and properly reported, application of appraisal principles and methodologies has been properly applied, that the analysis is sound and adequately reported, and that any analyses, opinions, or conclusions are adequately developed and reported so that the appraisal report is not misleading;\n(6) discusses with the trainee real property appraiser any necessary and appropriate changes that are made to a report, involving any trainee appraiser, before it is transmitted to the client. Changes not discussed with the trainee real property appraiser that are made by the supervising appraiser must be provided in writing to the trainee real property appraiser upon completion of the appraisal report;\n(7) accompanies the trainee real property appraiser on the inspections of the subject properties and drive-by inspections of the comparable sales on all appraisal assignments for which the trainee will perform work until the trainee appraiser is determined to be competent, in accordance with the competency rule of USPAP for the property type;\n(8) accepts full responsibility for the appraisal report by signing and certifying that the report complies with USPAP; and\n(9) reviews and signs the trainee real property appraiser's appraisal report or reports or if the trainee appraiser is not signing the report, states in the appraisal the name of the trainee and scope of the trainee's significant contribution to the report.\n(b) The supervising appraiser must review and sign the applicable experience log required to be kept by the trainee real property appraiser.\n(c) The supervising appraiser must notify the commissioner within ten days when the supervision of a trainee real property appraiser has terminated or when the trainee appraiser is no longer under the supervision of the supervising appraiser.\n(d) The supervising appraiser must maintain a separate work file for each appraisal assignment.\n(e) The supervising appraiser must verify that any trainee real property appraiser that is subject to supervision is properly licensed and in good standing with the commissioner.",
	"repealed": false
}