{
	"id": "325F.692",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.692",
	"title": "325F.692 FRAUDULENT TELEPHONE SERVICES; BILLING.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Information service\" means a billed service transmitted exclusively orally via the telecommunications network that may include provision of information or advice, participation in trivia or other games, participation in adult conversation or other group bridging services, or provision of similar billed services. An information service may be accessed by an information service customer by various methods including, but not limited to, dialing a 1-900 or 1-800 telephone number, or by the customer receiving a collect call from an information service provider following the customer's 1-800 call.\n(c) \"Information service customer\" means a person who receives information transmitted from or participates in conversation enabled by an information service provider.\n(d) \"Information service provider\" means a person who provides information services and directly, or indirectly through a billing agent, either charges information service customers for use of the information service or includes the costs associated with providing information services in the charge for a long-distance call.\n(e) \"Telephone service subscriber\" means a person who contracts with a telephone company for telephone services.\nA telephone service subscriber is not responsible for information service charges for calls made by minors or vulnerable adults as defined in section 626.5572, subdivision 21, unless expressly authorized by the subscriber or spouse.\n(a) A telephone company or independent telephone company, as defined in section 237.01, or any other entity that serves as the billing agent for information service charges shall, to the extent it has knowledge, list the charges for information services separately from charges for local and long-distance telephone service charges on each telephone service subscriber's billing statement, regardless of whether an information service customer initiated a call to access the information service or whether the information service provider initiated a call to the customer to allow the customer access to the information service. It is fraud under section 325F.69 to knowingly identify information service charges as telephone charges. A common carrier is liable for fraud under this subdivision only if it knowingly participates in the misidentification.\n(b) A bill or the portion of a telephone bill for information services must contain the following language printed in at least ten-point bold type or typewritten in capital letters in a color or shade that readily contrasts with the background:\n\"YOU HAVE THE RIGHT TO DISPUTE CHARGES FOR INFORMATION SERVICE CALLS. AS A TELEPHONE SERVICE SUBSCRIBER, YOU ARE NOT LEGALLY RESPONSIBLE FOR INFORMATION SERVICE CHARGES INCURRED BY MINORS OR VULNERABLE ADULTS WITHOUT YOUR CONSENT. NEITHER A LONG DISTANCE COMPANY NOR YOUR LOCAL TELEPHONE COMPANY MAY DISCONNECT YOUR SERVICE BECAUSE YOU REFUSE TO PAY AN INFORMATION SERVICE CHARGE.\"\nThe notice required by this paragraph can be provided in conjunction with other required notices.\nIt is fraudulent misrepresentation under section 325F.69 for an information service provider or a provider's agent, including an agent or employee of an entity that provides billing services for an information service provider, to knowingly advise an information service customer or a telephone service subscriber, either orally or in writing, that:\n(1) information service charges not incurred or authorized by a telephone service subscriber are the responsibility of the subscriber;\n(2) parents or guardians of minors or other vulnerable people are responsible for information service charges incurred by the minors or other vulnerable persons; or\n(3) the availability of telephone service for the subscriber may be affected by failure to pay information service charges not incurred or authorized by the subscriber.\nThe telephone service subscriber shall have the right to direct partial payments of a telephone bill. Unless otherwise directed by the telephone service subscriber, a telephone company or other billing entity that receives partial payment of a telephone bill shall allocate the partial payment first to charges for telephone services, and last to charges for information services.\nA telephone company or independent telephone company has a right of indemnity against anyone who has provided it with false information as to the status of information charges.\nAnyone who has refused to pay for two months of information charge bills or one month of charges in excess of $500 may be blocked from access to information services.\n[Repealed, 1998 c 345 s 16]\nThis section does not affect the legal responsibility of the person who places an information service call for the charges for the call.\nInformation service providers or their agents and telephone companies shall not issue calling card identification codes or personal identification numbers (PIN codes) to consumers over the telephone. This subdivision does not apply to the issuance of identification codes or personal identification numbers to consumers by a financial institution as defined in United States Code, title 18, section 20, or an affiliate or subsidiary of a financial institution.",
	"repealed": false
}