{
	"id": "216C.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.15",
	"title": "216C.15 EMERGENCY ENERGY CONSERVATION AND ALLOCATION PLAN.",
	"text": "The commissioner shall maintain an emergency conservation and allocation plan. The plan shall provide a variety of strategies and staged conservation measures to reduce energy use and, in the event of an energy supply emergency, shall establish guidelines and criteria for allocation of fuels to priority users. The plan shall contain alternative conservation actions and allocation plans to reasonably meet various foreseeable shortage circumstances and allow a choice of appropriate responses. The plan shall be consistent with requirements of federal emergency energy conservation and allocation laws and regulations, shall be based on reasonable energy savings or transfers from scarce energy resources and shall:\n(1) give priority to individuals, institutions, agriculture, businesses, and public transit under contract with the commissioner of transportation or the Metropolitan Council which demonstrate they have engaged in energy-saving measures and shall include provisions to insure that:\n(i) immediate allocations to individuals, institutions, agriculture, businesses, and public transit be based on needs at energy conservation levels;\n(ii) successive allocations to individuals, institutions, agriculture, businesses, and public transit be based on needs after implementation of required action to increase energy conservation; and\n(iii) needs of individuals, institutions, and public transit are adjusted to insure the health and welfare of the young, old and infirm;\n(2) insure maintenance of reasonable job safety conditions and avoid environmental sacrifices;\n(3) establish programs, controls, standards, priorities or quotas for the allocation, conservation, and consumption of energy resources; and for the suspension and modification of existing standards and the establishment of new standards affecting or affected by the use of energy resources, including those related to the type and composition of energy sources, and to the hours and days during which public buildings, commercial and industrial establishments, and other energy-consuming facilities may or are required to remain open;\n(4) establish programs to control the use, sale or distribution of commodities, materials, goods or services;\n(5) establish regional programs and agreements for the purpose of coordinating the energy resources, programs and actions of the state with those of the federal government, of local governments, and of other states and localities;\n(6) determine at what level of an energy supply emergency situation the Pollution Control Agency shall be requested to ask the governor to petition the president for a temporary emergency suspension of air quality standards as required by the Clean Air Act, United States Code, title 42, section 7410f; and\n(7) establish procedures for fair and equitable review of complaints and requests for special exemptions regarding emergency conservation measures or allocations.\nAt least once every five years and whenever construction of a new large energy facility is completed which affects the supply of energy in Minnesota, the commissioner shall review and if necessary revise the emergency conservation and allocation plan. Revisions of the emergency conservation and allocation plan shall be adopted pursuant to the rulemaking procedures in chapter 14 and reviewed by the appropriate standing committees of the legislature.\nThe Executive Council or the legislature may declare an energy supply emergency when an acute shortage of energy exists by issuing a declaration which indicates the nature of the emergency, the area or areas threatened if less than the whole state is threatened, and the conditions causing the emergency. The declaration shall be disseminated promptly by means calculated to bring its contents to the attention of the general public and shall be promptly filed with the commissioner, the Division of Emergency Management and the secretary of state. Upon a declaration of an energy supply emergency by the Executive Council or the legislature, the governor and the Division of Emergency Management, in consultation with the commissioner, shall implement and enforce the emergency conservation and allocation plan or any part thereof. Revisions of the plan shall be made by the commissioner in accordance with subdivision 2. The Executive Council or the legislature may terminate an energy supply emergency at any time by issuing a declaration which terminates the energy supply emergency and indicates the conditions which make possible termination of the emergency, but no energy supply emergency may continue for longer than 30 days unless renewed by the legislature. Each renewed energy supply emergency may not continue for longer than 30 days, unless otherwise provided by law. Each person shall carry out the responsibilities specified in the emergency conservation allocation plan, and violation of any provision of such emergency conservation or allocation requirements shall be deemed a violation of sections 216C.05 to 216C.30 and the rules promulgated thereunder for purposes of enforcement pursuant to section 216C.30.",
	"repealed": false
}