{
	"id": "325F.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.86",
	"title": "325F.86 DISCLOSURES.",
	"text": "In a rental-purchase agreement, the lessor shall disclose the following items, as applicable:\n(a) The total of payments necessary to acquire ownership of the property accompanied by an explanation that this term means the \"total dollar amount of payments you will have to make to acquire ownership.\"\n(b) The total number, amounts, and timing of all payments and other charges including taxes or official fees paid to or through the lessor that are necessary to acquire ownership of the property.\n(c) The difference between the amount disclosed under paragraph (a) and the cash price of the leased property, using the term \"cost of lease services\" to mean the difference between these amounts.\n(d) Any initial or advance payment such as a delivery charge or trade-in allowance.\n(e) A statement that the lessee will not own the property until the lessee has made the total of payments necessary to acquire ownership of the property.\n(f) A statement that the total of payments does not include additional charges such as late payment charges, and a separate listing and explanation of these charges, as applicable.\n(g) A statement that the lessee is liable for loss or damage to the property and the maximum amount for which the lessee is liable, which in the case of loss shall in no event be greater than the price the lessee would have paid to exercise an early purchase option. In the case of damage to the property other than normal wear and tear, the lessee shall be liable for the lesser of the price the lessee would have paid to exercise an early purchase option or the cost of repair as reasonably determined by the lessor.\n(h) A statement that the lessee is not required to purchase a liability damage waiver from the lessor.\n(i) A description of the goods or merchandise including model numbers as applicable and a statement indicating whether the property is new or used. It is not a violation of this subdivision to indicate that the property is used if it is actually new.\n(j) A statement that the lessee has the option to purchase the leased property during the terms of the rental-purchase agreement and at what price, formula, or by what method the price is to be determined.\n(k) The cash price of the merchandise.\n(l) A statement of the following lessee rights: reinstatement rights under section 325F.90, default notice under section 325F.89, and consumer warranties under sections 325G.17 to 325G.20.\nThe commissioner of commerce may prescribe the disclosure form by rule.",
	"repealed": false
}