{
	"id": "114C.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/114C.40",
	"title": "114C.40 VOLUNTARY SELF-REPORTING OF MINOR VIOLATIONS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(c) \"Environmental requirement\" means a requirement in a law administered by the agency, a rule adopted by the agency, a permit or order issued by the agency, an agreement entered into with the agency, or a court order issued pursuant to any of the foregoing.\n(d) \"Regulated entity\" means a public or private organization or individual that is subject to environmental requirements.\nExcept for violations determined by the commissioner under subdivision 4, the commissioner must defer for 60 calendar days enforcement of an environmental requirement against a regulated entity if:\n(1) violation of the environmental requirement was first identified by the regulated entity or an employee of or person contracted by the regulated entity;\n(2) the regulated entity notified the commissioner, through electronic submission or in writing, that a violation has occurred within two business days of the violation coming to the regulated entity's attention. The commissioner must contact the regulated entity within seven business days of receipt of the notification to schedule a consultation to discuss the nature of the violation. During the consultation, the regulated entity and the commissioner must develop a plan and mutually agreed upon timeframe for the regulated entity to return to compliance. The regulated entity must submit, through electronic submission or in writing, the agreed upon plan within seven business days of the consultation. The regulated entity must return to compliance within 60 calendar days following the date of the consultation unless a different timeframe was agreed upon during the consultation; and\n(3) the regulated entity has not been cited for noncompliance under subdivision 4 by the agency within the past two years from the date of the notification under clause (2).\nThe commissioner must not impose or bring an action for any administrative, civil, or criminal penalties against a regulated entity if the regulated entity complies with subdivision 2.\nNotwithstanding subdivisions 2 and 3, the commissioner may, at any time, bring:\n(1) a criminal enforcement action against any person who commits a violation under section 609.671;\n(2) a civil or administrative enforcement action, which may include a penalty, under section 115.071 or 116.072, against the regulated entity if:\n(i) a violation caused or had potential to cause serious harm to human health or the environment;\n(ii) a violation is of the specific terms of an administrative order, a judicial order or consent decree, a stipulation agreement, or a schedule of compliance;\n(iii) a violation has resulted in economic benefit which gives the regulated entity a clear advantage over its business competitors; or\n(iv) a violation is identified through a monitoring or sampling requirement prescribed by statute, regulation, permit, judicial or administrative order, consent decree, stipulation agreement, or schedule of compliance; or\n(3) an enforcement action against a regulated entity to enjoin an imminent and substantial danger under section 116.11.\nNothing in this section alters the obligation of any regulated entity to report releases, violations, or other matters that are required to be reported by state or federal law, rule, permit, or enforcement action.",
	"repealed": false
}