{
	"id": "60A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.07",
	"title": "60A.07 AUTHORIZATION AND REQUIREMENTS.",
	"text": "Three or more persons may form a domestic insurance corporation for any of the purposes specified in subdivision 2 by applying to the Department of Commerce and complying with all applicable organizational requirements and the conditions set out in clauses (1) to (6). The incorporators must subscribe a certificate specifying:\n(1) the corporation's name, which must distinguish it from all other corporations authorized to do business in this state, and must contain the word \"company,\" \"corporation,\" or \"incorporated\";\n(2) the general nature of the corporation's business and its principal place of business;\n(3) the period of its duration, if limited;\n(4) the names and places of residence of the incorporators;\n(5) the board in which the management of the corporation will be vested, the date of the initial annual meeting at which it will be elected, and the names and addresses of the board members until the first election; and\n(6) whether the corporation is organized on the stock plan, mutual plan, or otherwise; and, if organized as a stock company, the amount of capital stock, how the capital stock is to be paid in, the number of shares into which it is to be divided, and the par value of each share; and, if there is to be more than one class, a description and the terms of issue of each class and the method of voting on each class.\nThe certificate may contain any other lawful provision defining and regulating the powers and business of the insurance corporation, its officers, directors, trustees, members, or stockholders.\nDomestic insurance corporations established in this manner are organized under and governed by chapter 302A, except as otherwise provided in subdivision 1d and chapter 66A.\nMS 2018 [Repealed, 2020 c 80 art 1 s 29]\nIf the commissioner of commerce is satisfied that the corporation has been organized for legitimate purposes, and under such conditions as to merit and have public confidence, and that all provisions of law applicable to every branch of business in which, by the terms of its certificate, it is authorized to engage, have been complied with, the commissioner shall so certify. When the original certificate and the certificate of incorporation from the secretary of state are filed with the commissioner of commerce, the commissioner shall, within 60 days thereafter, execute and deliver to it a certificate of authority.\nBylaws may be adopted by the insurance corporation in the manner set forth in section 302A.181. Within 90 days after the adoption of the bylaws or any amendment thereof, a certified copy of the same must be filed with the commissioner of commerce.\nThe certificate of incorporation of an insurance corporation organized and existing under the laws of this state may be amended in the manner set forth in section 302A.135. Amendments are effective upon the commissioner's approval.\nThe provisions of chapter 302A apply to domestic stock corporations formed to carry on the business of insurance, except to the extent those provisions are inconsistent with any provisions contained in this chapter or to the extent in conflict with any provisions contained in chapters 60A to 79A. The provisions of chapter 302A apply to domestic mutual corporations formed to carry on the business of insurance only to the extent provided for in chapter 66A.\nCorporations may be formed for carrying on any one branch of the business of insurance authorized by law, or any two or more branches thereof, which are permitted by law to be transacted by one company; and business trusts as authorized by law of this state may be formed for carrying on the kind of business of insurance specified in section 60A.06, subdivision 1, clause (7).\nEvery company, domestic or foreign, shall file with the commissioner its acceptance of the provisions of the insurance laws of the state of Minnesota, and its charter and any amendments thereto, and each such company shall be governed thereby and by those laws relative to corporations in general, so far as applicable and not otherwise specifically provided. No foreign company shall be denied a license in this state because its corporate powers exceed those which it is permitted to exercise under the laws of this state, but no foreign company, which does outside of this state any kind or combination of kinds of insurance not permitted to be done in this state by similar domestic companies, now or hereafter organized, shall be or continue to be authorized to do an insurance business in this state if the commissioner of commerce finds, after ten days' notice sent by certified mail to the home office of the company involved, and an opportunity to be heard, that the doing of such kind or combination of kinds of insurance business impairs the financial solvency of the company or its financial ability to meet its obligations incurred in this state, or finds that the doing of such kinds or combination of kinds of insurance business is prejudicial to the interests of policyholders, creditors or the people of this state.\nNo insurance company or association, or fraternal benefit society, not specifically exempted therefrom by law, shall transact the business of insurance in this state unless it shall hold a license therefor from the commissioner.\n[Repealed, 1969 c 7 s 6]\nNo insurance company operating upon the stock plan shall be initially authorized to transact any one of the kinds of business enumerated in section 60A.06, subdivision 1, clauses (1) to (15), unless it shall have paid-up capital stock and surplus of not less than the amounts specified below. Except as otherwise provided by this subdivision, after initial authorization has been granted, surplus shall be constantly maintained in an amount not less than one-half of the surplus originally required for that kind of business. If the kind of business being transacted is of the type authorized by section 60A.06, subdivision 1, clause (4), surplus shall be constantly maintained after initial authorization in an amount not less than 25 percent of the amount of surplus originally required.\nNo insurance company operating upon the mutual plan as provided in chapter 66A, shall be authorized to transact any one of the kinds of business enumerated in section 60A.06, subdivision 1, clauses (1) to (3) and (5) to (15), unless in addition to the requirements specified in chapter 66A it shall have met the following requirements as to surplus: As to a mutual company operating on a nonassessable basis, an initial surplus of not less than the amount of surplus enumerated in subdivision 5a for a stock company authorized to transact that kind of business, provided that after initial authorization has been granted, the surplus shall thereafter be constantly maintained in an amount equal to not less than one-half of such initial surplus; as to a mutual company operating on an assessable basis, an initial surplus of not less than one-half of the amount of surplus enumerated in subdivision 5a for a stock company authorized to transact that kind of business, provided that after initial authorization has been granted, the surplus shall thereafter be constantly maintained in an amount equal to not less than one-half of such initial surplus.\nNo insurance company operating upon the mutual plan shall be authorized to transact the kind of business enumerated in section 60A.06, subdivision 1, clause (4), unless it shall have surplus of not less than $3,000,000; provided that after initial authorization has been granted, the surplus shall thereafter be constantly maintained in an amount of not less than $1,500,000.\nNo insurance company operating upon the mutual plan, other than as provided in chapter 66A, shall be authorized to transact the kind of business enumerated in section 60A.06, subdivision 1, clause (5)(a), unless it shall have a surplus of not less than $1,500,000; provided that after initial authorization has been granted, the surplus thereafter shall be constantly maintained in the amount of not less than $1,000,000.\nAny insurance corporation authorized to transact the kinds of business specified in section 60A.06, subdivision 1, clause (4), may also transact the kinds of business specified in section 60A.06, subdivision 1, clause (5)(a), upon meeting the following financial requirements: As to companies operating upon the stock plan, paid-up capital stock of not less than $1,000,000 and an initial surplus of not less than $2,000,000 which surplus shall thereafter be constantly maintained in the amount of not less than $500,000; as to companies operating on the mutual plan, an initial surplus of not less than $3,000,000 which shall thereafter be constantly maintained in the amount of not less than $1,500,000.\nAny insurance corporation which prior to January 1, 1949, was authorized to transact personal injury liability insurance and also the kinds of business specified in section 60A.06, subdivision 1, clauses (4) and (5), shall continue to be authorized to transact personal injury liability insurance, providing the corporation continues to meet the revised financial requirements of this subdivision.\nAny stock company may, when authorized by its articles of incorporation, transact any two or more of the kinds of business specified in section 60A.06, subdivision 1, clauses (1) to (3) and (5) to (15), upon meeting the following financial requirements: paid-up capital stock of not less than $1,000,000 and an initial surplus of not less than $1,000,000 which surplus shall thereafter be constantly maintained in the amount of not less than $500,000; provided, however, that if the sum of the capital stock and surplus requirements specified in subdivision 5a for the kinds of business to be transacted is less than the amount of the capital stock and surplus requirements stated in the foregoing clauses of this sentence, then the company may transact those kinds of business upon meeting the capital stock and surplus requirements specified in subdivision 5a for those kinds of business. Any insurance company operating upon the mutual plan as provided in chapter 66A, may, when authorized by its articles of incorporation, transact any two or more of the kinds of business specified in section 60A.06, subdivision 1, clauses (1) to (3) and (5) to (15), upon meeting the following requirements as to surplus which shall be in addition to the requirements specified in chapter 66A: as to mutual companies operating on a nonassessable basis, an initial surplus of not less than $1,000,000, which surplus shall thereafter be constantly maintained in the amount of not less than $500,000; as to mutual companies operating on an assessable basis, an initial surplus of not less than $750,000, which surplus shall thereafter be constantly maintained in the amount of not less than $375,000; provided, however, that if the sum of the surplus requirements specified in subdivisions 5a and 5b for the kinds of business to be transacted is less than the amount of the surplus requirements stated in the foregoing clauses of this sentence, then the company may transact those kinds of business upon meeting the surplus requirements specified in subdivisions 5a and 5b for those kinds of business.\n[Repealed, 1993 c 299 s 33]\nWhenever the commissioner finds that the capital or surplus of a stock company, or the surplus of a mutual company, is less than the minimum requirements prescribed by this section and sections 66A.32 and 66A.33, the commissioner shall determine the amount of the deficiency and issue an order in writing requiring the insurance company to restore the deficiency within such reasonable period as the commissioner shall designate. The commissioner may, by order served upon the insurance company, prohibit the insurance company from issuing any new policies while the deficiency exists. If at the expiration of the designated period the insurance company has not restored the deficiency and filed proof satisfactory to the commissioner, the commissioner shall proceed against the insurance company as provided in chapter 60B; provided, however, that if the surplus of a mutual company operating on the nonassessable basis declines below the minimum requirement prescribed by this section and sections 66A.32 and 66A.33 for such a company, and if its surplus is equal to or greater than the minimum requirement for a mutual company operating on the assessable basis, it may continue to write on the assessable basis by issuing only assessable policies.\n(a) Capital and surplus requirements apply to all types of insurance transacted by the insurer, whether or not only a portion of the types of insurance are transacted in this state. The commissioner may for the protection of the public require an insurer to maintain funds in excess of the amounts required under this section and sections 66A.32 and 66A.33, due to the amount, kind, or combination of types of insurance transacted by the insurer. Failure of an insurer to maintain funds as ordered by the commissioner is grounds for suspension or revocation of the insurer's certificate of authority.\n(b) After June 30, 1991, an insurer may not renew and continue its certificate of authority unless the insurer possesses at least the basic capital and surplus, and additional surplus required by the commissioner under this section and sections 66A.32 and 66A.33.\nWhen the capital of any domestic stock company is impaired, it may, upon a vote of the majority of the stock, reduce the same to not less than the legal minimum. In this case no part of its assets shall be distributed to the stockholders. Any such company whose capital is not impaired may, by a two-thirds vote of its stock and with the consent of the commissioner, reduce the same to not less than the legal minimum capital and surplus required for such a company. In either case, within ten days after the meeting at which the reduction was made, the company shall submit to the commissioner a certified statement of the proceedings thereof, including the amount of the reduction and its assets and liabilities, verified by its president, secretary, and a majority of its directors. The commissioner shall examine the facts and, if they conform to law and the commissioner is of opinion that injury to the public will not result, the commissioner shall endorse approval upon the statement. Upon filing the same with the secretary of state and paying a filing fee of $5, and duly amending its certificate of incorporation in conformity therewith, it may transact business upon the reduced capital as though the same were its original capital, and the commissioner shall issue a license to that effect. The company may thereafter, by a majority vote of its directors, require the return of every original stock certificate in exchange for a new certificate for such number of shares as each stockholder is entitled to, in the proportion that the reduced capital bears to the original.\nUpon application, the commissioner shall examine the proceedings of any domestic company to increase or reduce its capital stock and, when found conformable to law, shall revoke the old and issue a new certificate of authority to the company to transact business upon the increased or reduced capital.\n[Repealed, 2005 c 69 art 2 s 19]\nWhen the laws of any other state, territory, or country prohibit the organization of or do not provide for the organization of or the licensing in that state, territory, or country of a class or kind of insurance companies or associations organized under the laws of this state and authorized to transact the business of insurance in this state, then companies or associations of the same kind or class of the other state, territory, or country shall not be licensed to do business in this state.\nThis provision shall not apply to companies or associations, organized under the laws of another state, now licensed to do business in this state.\n[Clause (1) renumbered 66A.32]\n[Clause (2) renumbered 66A.33]\nEvery company shall provide a fidelity bond for its officers and employees. The bond shall be in the amount deemed necessary by the commissioner to adequately protect the public.",
	"repealed": false
}