{
	"id": "260B.193",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.193",
	"title": "260B.193 DISPOSITIONS; GENERAL PROVISIONS.",
	"text": "Whenever the court finds that the minor is not within the jurisdiction of the court or that the facts alleged in the petition have not been proved, it shall dismiss the petition.\nBefore making a disposition in a case, or appointing a guardian for a child, the court may consider any report or recommendation made by the local social services agency, probation officer, licensed child-placing agency, foster parent, guardian ad litem, tribal representative, or other authorized advocate for the child or child's family, a school district concerning the effect on student transportation of placing a child in a school district in which the child is not a resident, or any other information deemed material by the court. In addition, the court may consider the results of the children's mental health screening provided in section 260B.157, subdivision 1.\n[Repealed, 2001 c 78 s 4]\nWhen the court orders an out-of-home placement disposition for a child, the court shall state in its disposition order the intended outcome of the placement.\n(a) The court may dismiss the petition or otherwise terminate its jurisdiction on its own motion or on the motion or petition of any interested party at any time. Unless terminated by the court, and except as otherwise provided in this subdivision, the jurisdiction of the court shall continue until the individual becomes 19 years of age if the court determines it is in the best interest of the individual to do so.\n(b) The jurisdiction of the court over an extended jurisdiction juvenile, with respect to the offense for which the individual was convicted as an extended jurisdiction juvenile, extends until the offender becomes 21 years of age, unless the court terminates jurisdiction before that date.\n(c) The juvenile court has jurisdiction to designate the proceeding an extended jurisdiction juvenile prosecution, to hold a certification hearing, or to conduct a trial, receive a plea, or impose a disposition under section 260B.130, subdivision 4, if:\n(1) an adult is alleged to have committed an offense before the adult's 18th birthday; and\n(2) a petition is filed under section 260B.141 before expiration of the time for filing under section 628.26 and before the adult's 21st birthday.\nThe juvenile court lacks jurisdiction under this paragraph if the adult demonstrates that the delay was purposefully caused by the state in order to gain an unfair advantage.\n(d) The district court has original and exclusive jurisdiction over a proceeding:\n(1) that involves an adult who is alleged to have committed an offense before the adult's 18th birthday; and\n(2) in which a criminal complaint is filed before expiration of the time for filing under section 628.26 and after the adult's 21st birthday.\nThe juvenile court retains jurisdiction if the adult demonstrates that the delay in filing a criminal complaint was purposefully caused by the state in order to gain an unfair advantage.\n(e) The juvenile court has jurisdiction over a person who has been adjudicated delinquent, has been found to have committed a delinquent act, or has been charged by juvenile petition until the person's 21st birthday if the person fails to appear at any juvenile court hearing or fails to appear at or absconds from any placement under a juvenile court order. The juvenile court has jurisdiction over a convicted extended jurisdiction juvenile who fails to appear at any juvenile court hearing or fails to appear at or absconds from any placement under section 260B.130, subdivision 4. The juvenile court lacks jurisdiction under this paragraph if the adult demonstrates that the delay was purposefully caused by the state in order to gain an unfair advantage.",
	"repealed": false
}