{
	"id": "500.215",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.215",
	"title": "500.215 LIMITS ON CERTAIN RESIDENTIAL PROPERTY RIGHTS PROHIBITED; FLAG DISPLAY.",
	"text": "(a) Any provision of any deed restriction, subdivision regulation, restrictive covenant, local ordinance, contract, rental agreement or regulation, or homeowners association document that limits the right of an owner or tenant of residential property to display the flag of the United States and the flag of the State of Minnesota is void and unenforceable.\n(b) \"Homeowners association document\" includes the declaration, articles of incorporation, bylaws, and rules and regulations of:\n(1) a common interest community, as defined in section 515B.1-103(10), regardless of whether the common interest community is subject to chapter 515B; and\n(2) a residential community that is not a common interest community, as defined in section 515B.1-103(10).\n(a) This section does not prohibit limitations narrowly tailored to protect health or safety.\n(b) This section does not prohibit limitations that restrict:\n(1) the size of the flag to be displayed to a size customarily used on residential property;\n(2) the installation and display of the flag to a portion of the residential property to which the person who displays the flag has exclusive use; or\n(3) illuminating the flag.\n(c) This section does not prohibit a requirement that the flag be displayed in a legal manner under Minnesota law, that the flag be in good condition and not altered or defaced, or that the flag not be affixed in a permanent manner to that portion of property to be maintained by others or in a way that causes more than inconsequential damage to others' property. A person who causes damage is liable for the repair costs.\nThis section applies to all limitations described in subdivision 1 and not excepted in subdivision 2, regardless of whether adopted before, on, or after August 1, 2005.\nIf an owner or tenant of residential property is denied the right provided by this section, the owner or tenant is entitled to recover, from the party who denied the right, reasonable attorney fees and expenses if the owner or tenant prevails in enforcing the right. If a flag is installed or displayed in violation of enforceable restrictions or limitations, the party enforcing the restrictions or limitations is entitled to recover, from the party displaying the flag, reasonable attorney fees and expenses if the enforcing party prevails in enforcing the restrictions or limitations.",
	"repealed": false
}