{
	"id": "116J.399",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.399",
	"title": "116J.399 BROADBAND EASEMENTS.",
	"text": "For the purposes of this section, the following terms have the meanings given:\n(1) \"broadband infrastructure\" has the meaning given in section 116J.394, paragraph (c);\n(2) \"broadband service\" has the meaning given in section 116J.394, paragraph (b); and\n(3) \"provider\" means a broadband service provider, but does not include an electric cooperative association organized under chapter 308A that provides broadband service.\n(a) A provider, provider's affiliate, or another entity that has entered into an agreement with a provider may use the provider, affiliate, or entity's existing or subsequently acquired easements to install broadband infrastructure and provide broadband service, which may include an agreement to lease fiber capacity.\n(b) Before exercising rights granted under this subdivision, a provider must provide notice to the property owner on which the easement is located, as described in subdivision 3.\n(c) Use of an easement to install broadband infrastructure and provide broadband service vests and runs with the land beginning six months after the first notice is provided under subdivision 3, unless a court action challenging the use of the easement has been filed before that time by the property owner as provided under subdivision 4. The provider must also file copies of the notices with the county recorder.\n(a) A provider must send two written notices to impacted property owners declaring that the provider intends to use the easements to install broadband infrastructure and provide broadband service. The notices must be sent at least two months apart and must be sent by first class mail to the last known address of the owner of the property on which the easement is located or, if the property owner is an existing customer of the provider, by separate printed insertion in the property owner's monthly invoice or included as a separate page on a property owner's electronic invoice.\n(b) The notice must include:\n(1) the provider's name and mailing address;\n(2) a narrative describing the nature and purpose of the intended easement use;\n(3) a description of any trenching or other underground work expected to result from the intended use, and the anticipated time frame for the work;\n(4) a phone number for an employee of the provider that the property owner may contact regarding the easement; and\n(5) the following statement, in bold red lettering: \"It is important to make any challenge by the deadline to preserve any legal rights you may have.\"\n(c) The provider must file copies of the notices with the county recorder.\n(a) Notwithstanding any other law to the contrary, this subdivision governs an action under this section and is the exclusive means to bring a claim for compensation with respect to a notice of intent to use a provider's existing easement to install broadband infrastructure and provide broadband service.\n(b) Within six months after the date notice is received under subdivision 3, a property owner may file an action seeking to recover damages for a provider's use of an existing easement to install broadband infrastructure and provide broadband service. Claims for damages under $15,000 may be brought in conciliation court.\n(c) To initiate an action under this subdivision, a property owner must serve a complaint upon the provider in the same manner as in a civil action and must file the complaint with the district court for the county in which the easement is located. The complaint must state whether the property owner:\n(1) challenges the provider's right to use the easement for broadband services or infrastructure as provided under subdivision 5, paragraph (a);\n(2) seeks damages as provided under subdivision 5, paragraph (b); or\n(3) seeks to proceed under both clauses (1) and (2).\n(a) If a property owner files a complaint challenging a provider's right to use an easement to install broadband infrastructure and provide broadband service, after the provider answers the complaint, the district court must promptly hold a hearing on the complaint. If the district court denies the property owner's complaint, the provider may proceed to use the easement to install broadband infrastructure and provide broadband service, unless the complaint also seeks damages. If the complaint seeks damages, the provider may proceed under paragraph (b).\n(b) If a property owner files a claim for damages, a provider may, after answering the complaint, deposit with the court administrator an amount equal to the provider's estimate of damages. A provider's estimate of damages must be no less than $1. After the estimated damages are deposited, the provider may use the existing easement to install broadband infrastructure and provide broadband service, conditioned on an obligation, filed with the court administrator, to pay the amount of damages determined by the court.\n(a) In an action under this section involving a property owner's claim for damages:\n(1) the property owner has the burden to prove the existence and amount of any net reduction in the fair market value of the property, considering the existence, installation, construction, maintenance, modification, operation, repair, replacement, or removal of broadband infrastructure in the easement, adjusted to reflect any increase in the property's fair market value resulting from access to broadband service;\n(2) a court is prohibited from awarding consequential or special damages; and\n(3) evidence of estimated revenue, profits, fees, income, or similar benefits accruing to the provider, the provider's affiliate, or a third party as a result of use of the easement is inadmissible.\n(b) Any fees or costs incurred as a result of an action under this subdivision must be paid by the party that incurred the fees or costs, except that a provider is responsible for a property owner's attorney fees if the final judgment or award of damages by the court exceeds 140 percent of the provider's damage deposit made under subdivision 5, if applicable.\nNothing in this section limits in any way a provider's existing easement rights.\nThe placement of broadband infrastructure to provide broadband service under subdivisions 2 to 7 is subject to local government permitting and right-of-way management authority under section 237.163, and must be coordinated with the relevant local government unit in order to minimize potential future relocations. The provider must notify a local government unit prior to placing infrastructure for broadband service in an easement that is in or adjacent to the local government unit's public right-of-way.\nThe placement of broadband infrastructure for use to provide broadband service under subdivisions 1 to 7 or section 308A.201, subdivision 12, in any portion of an existing easement located in a railroad right-of-way is subject to sections 237.04 and 237.045.",
	"repealed": false
}