{
	"id": "458A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.24",
	"title": "458A.24 FINANCES.",
	"text": "The city treasurer of the city of Duluth shall be the treasurer of the authority. The treasurer shall receive and have the custody of all moneys of the authority from whatever source derived, and the same shall be deemed public funds. The treasurer shall disburse such funds only in accordance with the annual budget of the authority as approved by the city council at the time the annual city budget is adopted and only upon written orders drawn against such funds, signed by the executive director, as hereinafter provided for in sections 458A.21 to 458A.37, or the president, or if absent, the vice-president of the authority; and each order shall state the name of the payee, and the nature of the claim for which the same is issued. The treasurer shall keep an account of all moneys, showing the source of all receipts, and the nature, purpose and authority of all disbursements; and at least three times each year, at the times and in the form to be determined by the directors, the authority shall file with the city clerk a financial statement of the authority, showing all receipts and disbursements, the nature of the same, the moneys on hand, and the purposes for which the same are applicable, the credits and assets of the authority, and its outstanding liabilities.\nWithin the total budget approved by the city council as provided in subdivision 1, the authority has the exclusive power to receive, control, and order the expenditure of any and all moneys and funds in the control and management of the Duluth bus transportation system, as hereinafter provided for in sections 458A.21 to 458A.37.\n(a) Notwithstanding anything to the contrary contained in any law or in the charter of the city of Duluth or in any ordinance thereof, there is hereby created in the treasury of the city of Duluth a special municipal bus transportation fund, hereinafter referred to as the special fund; and a Duluth bus transportation operating fund, hereinafter referred to as the operating fund.\n(b) The money in the special fund shall be used solely for the establishment or acquisition of a bus transportation system for the city of Duluth, and for the equipping of said system.\n(c) Of the proceeds from the issuance and sale of the obligation bonds hereinafter provided for, the authority may use a sum not to exceed $200,000 for initial operating expenses after acquisition of said system; and in addition, may use from the proceeds of said bond issue a sum sufficient to reimburse the general fund of the city for all costs or expenses that may have been incurred by the city in an effort to acquire a transit system prior to the actual acquisition of any such bus transit system.\n(d) The special fund shall consist of:\n(1) all money derived from the issuance and sale of bonds by authority of the city council to provide funds for the establishment or creation of a bus transportation system, and for the equipping thereof;\n(2) all money appropriated or otherwise made available to the city of Duluth for the establishment or acquisition of a bus transportation system, and for the equipping thereof;\n(3) all money received from the United States, through its department of transportation, or through any other department or agency thereof, received for the purpose of the establishment or acquisition of a bus transportation system, including but not limited to rolling stock and other equipment, and also all moneys received in connection with the planning of said bus transportation system.\n(e) The operating fund shall be used for operation, promotion, maintenance, or betterment of the bus transportation system provided for in sections 458A.21 to 458A.37, and for the expenses of the authority hereunder. The operating fund shall consist of all moneys of the authority from whatever source derived other than moneys credited to the special fund as hereinabove provided.\nAt least once in each year the city auditor, under the direction of the city director of finance, shall make or cause to be made, at the expense of the authority, a complete examination and audit of all books and accounts of the authority; and for such purpose the city auditor shall have the power to inspect and examine such books and accounts at any time during regular business hours and at such intervals as the city auditor may determine. One copy of such yearly audit shall be filed by the city auditor with the city clerk as a public document.\nNotwithstanding anything to the contrary contained in any law or in the charter of the city of Duluth or in any ordinance thereof, no restrictions shall apply to the deposit of any funds or the designation of a depository by the authority in any bank in which a member of the authority shall have an interest if such funds are deposited and protected in accordance with chapter 118A; provided, however, that any director having such an interest shall disclose the same, which disclosure shall be entered upon the minutes of the authority.",
	"repealed": false
}