{
	"id": "65B.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.64",
	"title": "65B.64 PERSONS ENTITLED TO PARTICIPATE IN ASSIGNED CLAIMS PLAN.",
	"text": "A person entitled to basic economic loss benefits because of injury covered by sections 65B.41 to 65B.71 may obtain basic economic loss benefits through the assigned claims plan or bureau established pursuant to section 65B.63 and in accordance with the provisions for making assigned claims provided in sections 65B.41 to 65B.71, if:\n(a) the person is 14 years old or younger and basic economic loss benefits are not applicable to the injury because of section 65B.58;\n(b) basic economic loss benefits are not applicable to the injury for some reason other than those specified in section 65B.58, 65B.59, or 65B.60;\n(c) the plan of reparation security applicable to the injury cannot be identified; or\n(d) a claim for basic economic loss benefits is rejected by a reparation obligor on some ground other than the person is not entitled to basic economic loss benefits under sections 65B.41 to 65B.71.\nIn addition to the requirements for eligibility contained in section 65B.48, a nonresident is not entitled to basic economic loss benefits if the nonresident is the owner of a motor vehicle and does not carry the minimum automobile insurance coverage required by the state in which the vehicle is registered.\nIf a claim qualifies for assignment under subdivision 1, the assigned claims bureau or any reparation obligor to whom the claim is assigned shall have the right to seek indemnification from an uninsured tortfeasor. Except as otherwise provided in section 340A.801, subdivision 4, the reparation obligor to whom the claim is assigned shall further be subrogated to all of the rights of the claimant against any person for economic loss benefits provided by the obligor to whom the claim was assigned, including a transportation network company or participating driver required to provide basic economic loss benefits pursuant to section 65B.472.\nA person shall not be entitled to basic economic loss benefits through the assigned claims plan with respect to injury which was sustained if at the time of such injury the injured person was the owner of a private passenger motor vehicle for which security is required under sections 65B.41 to 65B.71 and that person failed to have such security in effect.\nFor purposes of determining whether security is required under section 65B.48, an owner of any vehicle is deemed to have contemplated the operation or use of the vehicle at all times unless the owner demonstrates to the contrary by clear and convincing objective evidence.\nPersons, whether or not related by blood or marriage, who dwell and function together with the owner as a family, other than adults who have been adjudicated as incompetent and minor children, shall also be disqualified from benefits through the assigned claims plan.",
	"repealed": false
}