{
	"id": "274.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/274.01",
	"title": "274.01 BOARD OF APPEAL AND EQUALIZATION.",
	"text": "(a) The town board of a town, or the council or other governing body of a city, is the local board of appeal and equalization except (1) in cities whose charters provide for a board of equalization or (2) in any city or town that has transferred its local board of review power and duties to the county board as provided in subdivision 3. The county assessor shall fix a day and time when the local board of equalization shall meet in the assessment districts of the county. Notwithstanding any law or city charter to the contrary, a city board of equalization shall be referred to as a local board of appeal and equalization. On or before February 15 of each year the assessor shall give written notice of the time to the city or town clerk. Notwithstanding the provisions of any charter to the contrary, the meetings must be held between April 1 and May 31 each year. The clerk shall give published and posted notice of the meeting at least ten days before the date of the meeting.\nThe board shall meet either at a central location within the county or at the office of the clerk to review the assessment and classification of property in the town or city. No changes in valuation or classification which are intended to correct errors in judgment by the county assessor may be made by the county assessor after the board has adjourned in those cities or towns that hold a local board of review; however, corrections of errors that are merely clerical in nature or changes that extend homestead treatment to property are permitted after adjournment until the tax extension date for that assessment year. The changes must be fully documented and maintained in the assessor's office and must be available for review by any person. A copy of the changes made during this period in those cities or towns that hold a local board of review must be sent to the county board no later than December 31 of the assessment year.\n(b) The board shall determine whether the taxable property in the town or city has been properly placed on the list and properly valued by the assessor. If real or personal property has been omitted, the board shall place it on the list with its market value, and correct the assessment so that each tract or lot of real property, and each article, parcel, or class of personal property, is entered on the assessment list at its market value. No assessment of the property of any person may be raised unless the person has been duly notified of the intent of the board to do so. On application of any person feeling aggrieved, the board shall review the assessment or classification, or both, and correct it as appears just. The board may not make an individual market value adjustment or classification change that would benefit the property if the owner or other person having control over the property has refused the assessor access to inspect the property and the interior of any buildings or structures as provided in section 273.20. A board member shall not participate in any actions of the board which result in market value adjustments or classification changes to property owned by the board member, the spouse, parent, stepparent, child, stepchild, grandparent, grandchild, brother, sister, uncle, aunt, nephew, or niece of a board member, or property in which a board member has a financial interest. The relationship may be by blood or marriage.\n(c) A local board may reduce assessments upon petition of the taxpayer but the total reductions must not reduce the aggregate assessment made by the county assessor by more than one percent. If the total reductions would lower the aggregate assessments made by the county assessor by more than one percent, none of the adjustments may be made. The assessor shall correct any clerical errors or double assessments discovered by the board without regard to the one percent limitation.\n(d) A local board does not have authority to grant an exemption or to order property removed from the tax rolls.\n(e) A majority of the members may act at the meeting, and adjourn from day to day until they finish hearing the cases presented. The assessor shall attend and take part in the proceedings, but must not vote. The county assessor, or an assistant delegated by the county assessor shall attend the meetings. The board shall list separately all omitted property added to the list by the board and all items of property increased or decreased, with the market value of each item of property, added or changed by the board. The county assessor shall enter all changes made by the board.\n(f) Except as provided in subdivision 3, if a person fails to appear in person, by counsel, or by written communication before the board after being duly notified of the board's intent to raise the assessment of the property, or if a person feeling aggrieved by an assessment or classification fails to apply for a review of the assessment or classification, the person may not appear before the county board of appeal and equalization for a review. This paragraph does not apply if an assessment was made after the local board meeting, as provided in section 273.01, or if the person can establish not having received notice of market value at least five days before the local board meeting.\n(g) The local board must complete its work and adjourn within 20 days from the time of convening stated in the notice of the clerk, unless a longer period is approved by the commissioner of revenue. No action taken after that date is valid. All complaints about an assessment or classification made after the meeting of the board must be heard and determined by the county board of equalization. A nonresident may, at any time, before the meeting of the board file written objections to an assessment or classification with the county assessor. The objections must be presented to the board at its meeting by the county assessor for its consideration.\nThe governing body of a city may appoint a special board of review. The city may delegate to the special board of review all of the powers and duties in subdivision 1. The special board of review shall serve at the direction and discretion of the appointing body, subject to the restrictions imposed by law. The appointing body shall determine the number of members of the board, the compensation and expenses to be paid, and the term of office of each member. At least one member of the special board of review must be an appraiser, real estate broker, or other person familiar with property valuations in the assessment district.\nThe town board of any town or the governing body of any home rule charter or statutory city may transfer its powers and duties under subdivision 1 to the county board, and no longer perform the function of a local board. Before the town board or the governing body of a city transfers the powers and duties to the county board, the town board or city's governing body shall give public notice of the meeting at which the proposal for transfer is to be considered. The public notice shall follow the procedure contained in section 13D.04, subdivision 2. A transfer of duties as permitted under this subdivision must be communicated to the county assessor, in writing, before December 1 of any year to be effective for the following year's assessment. This transfer of duties to the county may either be permanent or for a specified number of years, provided that the transfer cannot be for less than three years. Its length must be stated in writing. A town or city may renew its option to transfer. The option to transfer duties under this subdivision is only available to a town or city whose assessment is done by the county.",
	"repealed": false
}