{
	"id": "116A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.24",
	"title": "116A.24 APPOINTMENT AND POWERS OF WATER AND SEWER COMMISSION.",
	"text": "Any time after the establishment of a water or sewer or combined water or sewer system, or the formation of a district under section 116A.02, subdivision 4, the board or boards or, when a multicounty system is established under section 116A.12, the court may provide for the appointment of a water or sewer or water and sewer commission. Such a commission shall be appointed before the final award of a contract for the construction of any system ordered by the district court. The commission shall have not less than five members and not more than 11. Members shall be appointed at large by the county board or boards from within the areas in their respective counties which are served by the system or from within a district formed under section 116A.02, subdivision 4, which district includes the served areas. Commission members shall serve for terms of four years and until their successors are appointed and qualify. The commencement date of the term of each member and the member's successors shall be fixed by order of the board or boards or court so that as nearly as possible an equal number of members will be replaced or reappointed each year. When multicounty systems are involved, commission membership shall be apportioned by the boards or court among the counties on the basis of their population served by the system or, if a district has been formed, on the basis of population located within that portion of each county situated within the district. When the area served by any system is enlarged and the commission members are not appointed from within a district formed under section 116A.02, subdivision 4, which includes the enlarged system, the board or boards or court shall reapportion or increase the membership and reestablish the terms so as to conform to the foregoing provisions, but each member shall continue to serve for the term appointed. Vacancies due to death, incapacity to serve, removal, or resignation shall be filled by the appointing boards for the unexpired terms.\nSubject to the approval of the board or boards except to the extent that approval is waived by the board or boards in an order filed with and confirmed by order of the district court, the water or sewer or water and sewer commission or when a multicounty system is involved a county board may do all things necessary to establish, construct, operate and maintain a system including but not limited to the following:\n(a) Employ on such terms as it deems advisable, persons or firms performing engineering, legal or other services of a professional nature; require any employee to obtain and file with it an individual bond or fidelity insurance policy; and procure insurance in such amounts as it deems necessary against liability of the board or its officers and employees or both, for personal injury or death and property damage or destruction, with the force and effect stated in chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property as it deems necessary.\n(b) Construct or maintain its systems or facilities in, along, on, under, over, or through public streets, bridges, viaducts, and other public rights-of-way without first obtaining a franchise from any local government unit having jurisdiction over them; but such facilities shall be constructed and maintained in accordance with the ordinances and resolutions of any such government unit relating to construction, installation, and maintenance of similar facilities in such public properties and shall not obstruct the public use of such rights-of-way.\n(c) Enter into any contract necessary or proper for the exercise of its powers or the accomplishment of its purposes.\n(d) Have the power to adopt rules and regulations relating to the establishment of water or sewer rentals or user fees as may be deemed advisable and the operation of any system operated by it, and may provide penalties for the violation thereof not exceeding the maximum which may be specified for a misdemeanor. Any rule or regulation prescribing a penalty for violation shall be published at least once in a newspaper having general circulation in the area.\n(e) Act under the provisions of section 471.59, or any other appropriate law providing for joint or cooperative action between government units.\n(f) Acquire by purchase, lease, condemnation, gift, or grant, any real or personal property including positive and negative easements and water and air rights, and it may construct, enlarge, improve, replace, repair, maintain, and operate any system determined to be necessary or convenient for the collection and disposal of sewage or collection, treatment, and distribution of water in its jurisdiction. Any local government unit and the commissioners of transportation and natural resources are authorized to convey to or permit the use of any such facilities owned or controlled by it by the board or commission, subject to the rights of the holders of any bonds issued with respect thereto, with or without compensation, without an election or approval by any other government agency. The board or commission may hold such property for its purposes, and may lease any such property so far as not needed for its purposes, upon such terms and in such manner as it shall deem advisable. Unless otherwise provided, the right to acquire lands and property rights by condemnation shall be exercised in accordance with sections 117.012 to 117.232, and shall apply to any property or interest therein owned by any local government unit; provided, that no such property devoted to an actual public use at the time, or held to be devoted to such use within a reasonable time, shall be so acquired unless a court of competent jurisdiction shall determine that the use proposed by the commission is paramount to such use. Except in case of property in actual public use, the board or commission may take possession of any property for which condemnation proceedings have been commenced at any time after the issuance of a court order appointing commissioners for its condemnation.\n(g) Contract with the United States or any agency thereof, any state or agency thereof, or any local government unit or governmental agency or subdivision, for the joint use of any facility owned by the board or such entity, for the operation by such entity of any system or facility of the board, or for the performance on the board's behalf of any service, on such terms as may be agreed upon by the contracting parties.\n(h) Exercise any other powers granted to the board or boards or court under section 116A.01, subdivision 2, relating to the establishment of a water or sewer or water and sewer system, except that the issuance of bonds by a commission is subject to subdivision 3, paragraph (b).\n(i) Retain the services of a certified public accountant for the purposes of providing an annual audited operating statement and balance sheet and other financial reports. The reports must be prepared in accordance with general accounting principles and must be filed within six months after the close of the fiscal year in the office of each county auditor within the district and with the office of the state auditor. The reports may be prepared by the state auditor instead of by a certified public accountant if the commission so requests.\n(a) The payment of the cost of construction of a multicounty system established by order pursuant to section 116A.12, and of the subsequent improvement or extension of the system when ordered by the court, is the obligation of each of the counties containing property assessable for the system, in proportion to the area of such property situated within the county, or in any other proportion which the counties, by concurring resolutions, confirmed by order of the court, may determine is just and reasonable. When bonds are sold and issued by the counties to pay such cost pursuant to section 116A.20, the proceeds of the bonds, except such portion as the county shall retain to pay interest until the system is self-supporting, shall be remitted to the commission, and the commission shall receive and disburse all revenues of the system, and shall act as agent of the counties in supervising the construction, improvement, and extension thereof, and thereafter in operating and maintaining the system. All collections of special assessments and any debt service ad valorem taxes levied for the system on property within each county shall be deposited as received in the sinking fund for bonds issued by that county to finance the system or extensions or improvements thereof, or in a single joint account administered by the commission on behalf of the counties for payment into the respective sinking fund accounts of the counties at such times and in such amounts as the county boards mutually determine is just and reasonable. The commission shall remit to the counties the net revenues from time to time received in excess of the amounts needed to pay current operation and maintenance expenses of the system and to maintain a reasonable operating reserve. The net revenues remitted each year shall be apportioned among the counties in proportion to the principal amount of bonds of each county then outstanding, which were issued for the establishment, improvement, or extension of the system or any other proportion which the counties mutually determine is just and reasonable; provided that with the consent of the county boards, the commission may retain any portion of the net revenues not needed for the payment of their bonds in a special fund to be expended for the improvement or extension of the system.\n(b) The commission may incur debt by issuing obligations for any lawful purpose, including the construction, alteration, extension, or improvement of works or any part of works or of a building for the use of the commission, and for the purchase of materials, machinery, and equipment necessary for carrying out the commission's authority. The debt, whether express or implied, must be payable solely:\n(1) from revenues, income, receipts, and profits derived by the commission from the operation and management of its system;\n(2) from the proceeds of other debt incurred by the commission under this paragraph; or\n(3) from federal or state grants, gifts, or other available money.\n(c) The commission may by resolution pledge any source of revenue referred to in paragraph (b) to pay obligations and interest on them. The resolution may specify the particular revenues that are pledged, related terms and conditions, and the rights of holders. The commission may provide for the refunding of obligations through the issuance of other obligations, with rights and priorities similar in all respects to those of the refunded obligations.\n(d) All accounts authorized by this subdivision may be established within a single fund administered by the commission on behalf of the counties and held in a single bank mutually designated by the county boards to serve as a depository for all sums, including bond proceeds, special assessments, tax levies and revenues received on account of the system.\n[Repealed, 1977 c 442 s 16]",
	"repealed": false
}