{
	"id": "58.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.08",
	"title": "58.08 BONDS; LETTERS OF CREDIT.",
	"text": "[Repealed, 2007 c 57 art 3 s 64]\n(a) An applicant for a residential mortgage originator license must file with the department a surety bond in the amount of $125,000, issued by an insurance company authorized to do so in this state. The bond must cover all mortgage loan originators who are employees or independent agents of the applicant. The bond must be available for the recovery of expenses, fines, and fees levied by the commissioner under this chapter and for losses incurred by borrowers as a result of a licensee's noncompliance with the requirements of this chapter, sections 325D.43 to 325D.48, and 325F.67 to 325F.69, or breach of contract relating to activities regulated by this chapter.\n(b) The bond must be submitted with the originator's license application and evidence of continued coverage must be submitted with each renewal. Any change in the bond must be submitted for approval by the commissioner, within ten days of its execution. The bond or a substitute bond shall remain in effect during all periods of licensing.\n(c) Upon filing of the mortgage call report as required by section 58.141, a licensee shall maintain or increase the licensee's surety bond to reflect the total dollar amount of the closed residential mortgage loans originated in this state in the preceding year according to the table in this paragraph. A licensee may decrease the licensee's surety bond according to the table in this paragraph if the surety bond required is less than the amount of the surety bond on file with the department.\nFor purposes of this subdivision, \"mortgage loan originator\" has the meaning given the term in section 58A.02, subdivision 7.\n(a) A residential mortgage servicer licensee shall continuously maintain a surety bond or irrevocable letter of credit in an amount not less than $125,000 in a form approved by the commissioner, issued by an insurance company or bank authorized to do so in this state. The bond or irrevocable letter of credit must be available for the recovery of expenses, fines, and fees levied by the commissioner under this chapter, and for losses or damages incurred by borrowers or other aggrieved parties as the result of a licensee's noncompliance with the requirements of this chapter, sections 325D.43 to 325D.48, and 325F.67 to 325F.69, or breach of contract relating to activities regulated by this chapter.\n(b) The bond or irrevocable letter of credit must be submitted with the servicer's license application and evidence of continued coverage must be submitted with each renewal. Any change in the bond or letter of credit must be submitted for approval by the commissioner, within ten days of its execution. The bond or a substitute bond must remain in effect during all periods of a license.\n(c) Upon filing the mortgage call report under section 58.141, a licensee must maintain or increase the licensee's surety bond to reflect the total dollar amount of unpaid principal balance for residential mortgage loans serviced in Minnesota during the preceding quarter according to the table in this paragraph. A licensee may decrease the licensee's surety bond according to the table in this paragraph if the surety bond required is less than the amount of the surety bond on file with the department.\nMS 2022 [Repealed, 2024 c 114 art 2 s 48]\nAs used in this chapter, an irrevocable letter of credit must be accepted only if it is clean, irrevocable, and contains an evergreen clause.\n(a) \"Clean\" means a letter of credit that is not conditioned on the delivery of any other documents or materials.\n(b) \"Irrevocable\" means a letter of credit that cannot be modified or revoked without the consent of the beneficiary once the beneficiary is established.\n(c) \"Evergreen clause\" means one that specifically states the expiration of a letter of credit will not take place without a 60-day notice by the issuer and one that allows the issuer to conduct an annual review of the account party's financial condition. If prior notice of expiration is not given by the issuer, the letter of credit is automatically extended for one year.\nA clean irrevocable letter of credit must be accepted only if it is issued by a financial institution that is authorized to engage in banking in any of the 50 states or under the laws of the United States, and whose business is substantially confined to banking and supervised by the state commissioner of commerce or similar official, and that has a long-term debt rating by a recognized national rating agency of investment grade or better. If no long-term debt rating is available, the financial institution must have the equivalent investment grade financial characteristics.",
	"repealed": false
}