{
	"id": "52.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.05",
	"title": "52.05 MEMBERSHIP.",
	"text": "Credit union membership consists of the incorporators and other persons as may be elected to membership and subscribe to at least one share as designated by the board of directors, pay the initial installment thereon and the entrance fee if any. In addition to a regularly qualified member, the spouse of a member, the blood or adoptive relatives of either of them and their spouses may be members. When an individual member of a credit union leaves the field of membership, the member, and all persons who became members by virtue of that individual's membership may continue as members. The surviving spouse of a regularly qualified member, and the blood or adoptive relatives of either of them and their spouses may become members. Organizations, incorporated or otherwise, composed for the most part of the same general group as the credit union membership may be members. Credit unions chartered by this or any other state, or any federal credit union may be members. Credit union organizations shall be limited to persons within one or more groups or any combination of groups having a common bond of occupation, association, or community.\nAny two persons representing a group of 30 or less or any 15 persons representing a larger group may apply to the commissioner, advising the commissioner of the common bond of the group and its number of potential members, for a determination whether it is feasible for the group to form a credit union. Upon a determination that it is not feasible to organize because the number of potential members is too small, the applicants will be certified by the commissioner as eligible to petition for membership in an existing credit union capable of serving the group. If the credit union so petitioned resolves to accept the group into membership, it shall follow the bylaw amendment and approval procedure set forth in section 52.02.\nThe commissioner may adopt rules to implement this subdivision. If adopted, these rules must provide that:\n(1) for the purpose of this subdivision, groups with a potential membership of less than 500 will be considered too small to be feasible as a separate credit union;\n(2) for the purpose of this subdivision, groups with a potential membership of at least 500 but less than 3,000 may be considered to be too small to be feasible as a separate credit union, based upon criteria developed by the commissioner, taking into account the objectives of this subdivision;\n(3) groups with a potential membership of 3,000 or more will be considered in light of all circumstances relevant to the objectives of this subdivision; and\n(4) all group applications, except for applications from groups made up of members of existing credit unions or groups made up of people who have a common employer which qualifies them for membership in an existing credit union, will be considered separately from any consideration of the membership provisions of existing credit unions; except that, groups made up of members of an existing credit union may be certified under this subdivision with the agreement of the credit union.",
	"repealed": false
}