{
	"id": "83A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/83A.06",
	"title": "83A.06 HEARING ON PETITION.",
	"text": "After receiving the petition to name a body of water, the auditor must present the petition to the county board. The county board must, by order, set the time and location for a hearing on the petition to be held more than 30 days after the order is made. The hearing may be held at any convenient place within the county as determined by the county board.\n(a) If the petition describes a body of water located within more than one county, the county boards of the several affected counties must act jointly and as one body and the majority of the joint body must determine the name of the water body under sections 83A.05 to 83A.07 in the same manner as prescribed for the county board.\n(b) For a water body located within more than one county, the county auditor with whom the petition is filed must forward by mail a certified copy of the petition to the auditor of each affected county who shall present the petition to the respective county boards, and the notice of hearing the petition determined by the joint body shall be published in each county as provided in subdivision 4.\n(c) The auditor of the county where the petition was filed must make and file certified copies of the adopted resolution in the office of the county recorder of each affected county at the expense of the petitioners.\nBefore the notice of the hearing is given, the petitioners must give a bond to be approved by the county attorney of the county where the petition has been filed that is conditioned on the full payment of the reasonable expenses incurred by the county for the proceeding. The commissioner of natural resources is not required to give bond.\nNotice of the hearing must be:\n(1) published for at least three weeks in the newspaper designated by the county board as the official newspaper for the county;\n(2) served on the commissioner of natural resources; and\n(3) served personally on the chair of the town board of a town, on the president of a statutory city board of trustees, and on the mayor of a city that has a body of water in the petition within or adjoining the boundary of the political subdivision.\nAt the hearing, legal voters of the county and municipalities may appear, by attorney or in person, and file an answer to the petition, stating in plain, concise language why the petition should not be granted in whole or in part, and in the answer may ask the county board to give to the body of water a different name than the name requested in the original petition.\nAt the hearing on the petition, the county board shall hear all parties desiring to be heard on the petition and make an order, by resolution, determining the name of the body of water described in the petition. The name determined by the board at the hearing is the legal name of the body of water.",
	"repealed": false
}