{
	"id": "471.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.191",
	"title": "471.191 ACQUISITION OF FACILITIES BY CITY, SCHOOL DISTRICT.",
	"text": "Any city operating a program of public recreation and playgrounds pursuant to sections 471.15 to 471.19 may acquire or lease, equip, and maintain land, buildings, and other recreational facilities, including, but without limitation, outdoor or indoor swimming pools, skating rinks and arenas, athletic fields, golf courses, marinas, concert halls, museums, and facilities for other kinds of athletic or cultural participation, contests, conventions, conferences, and exhibitions, together with related automobile parking facilities as defined in section 459.14, and may expend funds for the operation of such program and borrow and expend funds for capital costs thereof pursuant to the provisions of this section. A school district operating a program of public recreation and playgrounds has the rights provided in this section. Any facilities to be operated by a nonprofit corporation, as contemplated in section 471.16, may be leased to the corporation upon such rentals and for such term, not exceeding 30 years, and subject to such other provisions as may be agreed; including but not limited to provisions (a) permitting the lessee, subject to whatever conditions are stated, to provide for the construction and equipment of the facilities by any means available to it and in the manner determined by it, without advertisement for bids as required for other municipal facilities, and (b) granting the lessee the option to renew the lease upon such conditions and rentals, or to purchase the facilities at such price, as may be agreed; provided that (c) any such lease shall require the lessee to pay net rentals sufficient to pay the principal, interest, redemption premiums, and other expenses when due with respect to all city bonds issued for the acquisition or betterment of the facilities, less such amount of taxes and special assessments, if any, as may become payable in any year of the term of the lease, on the land, building, or other facilities leased, and (d) no option shall be granted to purchase the facilities at any time at a price less than the amount required to pay all principal and interest to become due on such bonds to the earliest date or dates on which they may be paid and redeemed, and all redemption premiums and other expenses of such payment and redemption.\nAny such city may issue bonds pursuant to chapter 475, for the acquisition and betterment of land, buildings, and facilities for the purpose of carrying out the powers granted by this section. Such bonds, unless authorized as general obligations of the issuer pursuant to approval of the electors or pursuant to another law or charter provision permitting such issuance without an election, shall be payable solely from the income of land, buildings, and facilities used or useful for the operation of the program, but may be secured by a pledge to the bondholders, or to a trustee, of all income and revenues of whatsoever nature derived from any such land, buildings, and facilities, as a first charge on the gross revenues thereof to the extent necessary to pay the bonds and interest thereon when due and to accumulate and maintain an additional reserve for that purpose in an amount equal to the total amount of payments to become due in any fiscal year. In this event the governing body of the issuer may by resolution or trust indenture define the land, buildings, or facilities, the revenues of which are pledged, and establish covenants and agreements to be made by the issuer for the security of the bonds, including a covenant that the issuer will establish, maintain, revise when necessary, and collect charges for all services, products, use, and occupancy of the land, buildings, and facilities, in the amounts and at the times required to produce the revenues pledged, and also sufficient, with any other funds appropriated by the governing body from time to time, to provide adequately for the operation and maintenance of the land, buildings, and facilities. After the issuance of any bonds for which revenues are so pledged, the governing body of the issuer shall provide in its budget each year for any anticipated deficiency in the revenues available for such operation and maintenance. For this purpose any issuer may levy a tax on the taxable property within its boundaries, in excess of taxes which may otherwise be levied within charter limitations. The authority to levy additional taxes granted herein shall not apply to cities or towns in which the net tax capacity consists in part of iron ore or lands containing taconite or semitaconite.\nAny such city may acquire land, buildings, and facilities for the purpose of carrying out the powers granted by this section under a lease agreement for a term not exceeding 30 years, vesting title in the lessee upon the payment of all amounts due and the performance of all covenants thereunder, provided that the rentals under any such lease agreement shall be payable solely from the revenues of the leased property. The terms and conditions of the lease agreement shall be established by resolution of the governing body of the lessee, and may include a pledge to the lessor of all income and revenues of whatsoever nature derived from the leased property, as a first charge on the gross revenues thereof to the extent necessary to pay the rentals when due, and a covenant that the lessee will establish, maintain, revise when necessary, and collect charges for all service, products, use, and occupancy of the leased property in the amounts and at the times required to produce the revenues pledged, and also sufficient, with any other funds appropriated by the governing body from time to time, to provide adequately for the operation and maintenance of the property. From and after the execution of any such lease agreement, the governing body of the lessee shall provide for any deficiencies in the revenues available for operation and maintenance, to the same extent and in the same manner as provided in subdivision 2. If such lease agreement is entered into with a nonprofit corporation as owner and lessor, organized and existing under chapter 317A for the sole purpose of providing and leasing such land, buildings, and facilities for public use and of conveying the same to the lessee when all sums borrowed therefor have been repaid, such corporation shall be deemed to be a public corporation, agency, and instrumentality of the city, and obligations incurred by it for this purpose, together with the interest on such obligations, shall be exempt from taxation to the same extent as obligations of the city. Any mortgage or trust indenture executed by such corporation for the security of its obligations may provide for the segregation and payment of rentals and revenues of land, buildings, and facilities directly by the lessee to the mortgagee or trustee, whether or not such mortgagee or trustee is in possession under foreclosure proceedings or otherwise, and the mortgage or trust indenture may be enforced by foreclosure and sale and by any other remedy at law or in equity which is available in the event of default in payment of amounts due and performance of covenants under any mortgage of real or personal property; provided that no such mortgage or trust indenture shall impair the continued right of the lessee to the use and enjoyment of the land, buildings, and facilities so long as the lessee is not in default in the payment of rentals due and in the performance of covenants under the lease agreement.\nAny and all properties acquired and used, whether under lease or otherwise, by a city for the purposes authorized and contemplated in this section shall be deemed and are declared to be public property exclusively used for a public purpose and as such exempt from taxation, so long as and to the extent that such property is devoted to said purposes and is not subleased to any private individual, association, or corporation in connection with a business conducted for profit, for a term of three or more years. An agreement whereby a city, as owner or lessee, employs a private individual, association, or corporation to operate facilities for use of the public, for the purposes herein contemplated and subject to regulation by the public owner or lessee, is not a sublease for the purpose of this subdivision.\nAll obligations issued by any city pursuant to this section are issued for the acquisition or betterment of revenue producing public conveniences and are payable wholly from the income thereof, within the meaning of all provisions of chapter 475. The rentals payable under a lease and the securities issued by the lessor pursuant to subdivision 3 are not obligations within the meaning of chapter 475.",
	"repealed": false
}