{
	"id": "115.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.06",
	"title": "115.06 COOPERATION.",
	"text": "The agency, so far as it is not inconsistent with its duties under the laws of this state, may assist and cooperate with any agency of another state, of the United States of America or of the Dominion of Canada or any province thereof in any matter relating to water pollution control.\nThe agency may receive and accept money, property, or services from any person or from any agency described in subdivision 1 or from any other source for any purpose within the scope of its functions under this chapter, chapter 116, or 116F, and all money so received are hereby appropriated for such purposes in like manner and subject to like provisions of law as the corresponding appropriations of state funds.\nIt shall be the duty of each city, county, town, sanitary district, public corporation, or other governmental subdivision to cooperate with the agency in obtaining compliance with the provisions of this chapter and to enforce within its jurisdiction all standards, orders, rules, or permit requirements adopted by the agency thereunder.\n(a) The agency may encourage citizen monitoring of ambient water quality for public waters by:\n(1) providing technical assistance to citizen and local group water quality monitoring efforts;\n(2) integrating citizen monitoring data into water quality assessments and agency programs, provided that the data adheres to agency quality assurance and quality control protocols; and\n(3) seeking public and private funds to:\n(i) collaboratively develop clear guidelines for water quality monitoring procedures and data management practices for specific data and information uses;\n(ii) distribute the guidelines to citizens, local governments, and other interested parties;\n(iii) improve and expand water quality monitoring activities carried out by the agency; and\n(iv) continue to improve electronic and web access to water quality data and information about public waters that have been either fully or partially assessed.\n(b) This subdivision does not authorize a citizen to enter onto private property for any purpose.",
	"repealed": false
}