{
	"id": "84.872",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.872",
	"title": "84.872 YOUTHFUL SNOWMOBILE OPERATORS; PROHIBITIONS.",
	"text": "(a) Notwithstanding anything in section 84.87 to the contrary, no person under 14 years of age shall make a direct crossing of a trunk, county state-aid, or county highway as the operator of a snowmobile, or operate a snowmobile upon a street or highway within a municipality. A person 14 years of age or older, but less than 18 years of age, may make a direct crossing of a trunk, county state-aid, or county highway only if the person has in immediate possession:\n(1) a valid snowmobile safety certificate issued by the commissioner;\n(2) a driver's license that has a valid snowmobile qualification indicator issued under section 171.07, subdivision 12; or\n(3) an identification card that has a valid snowmobile qualification indicator issued under section 171.07, subdivision 12.\n(b) Notwithstanding section 84.862, no person under the age of 14 years shall operate a snowmobile unless supervised by or accompanied by one of the following listed persons on the same or an accompanying snowmobile, or on a device towed by the same or an accompanying snowmobile: the person's parent, legal guardian, or other person 18 years of age or older designated by the parent or guardian. However, a person 12 years of age or older but under the age of 14 years may operate a snowmobile if the person has in immediate possession a valid snowmobile safety certificate issued by the commissioner or an identification card with a valid snowmobile qualification indicator issued under section 171.07, subdivision 12.\n(c) The snowmobile safety certificate exceptions under paragraph (b) do not allow a person under the age of 14 years to make a direct crossing of a highway as the operator of a snowmobile or to operate a snowmobile upon a street or highway, as prohibited under paragraph (a).\n(a) No person under the age of 18 shall operate or ride a snowmobile in this state without wearing protective headgear that complies with standards established by the commissioner of public safety.\n(b) The provisions of this subdivision shall not apply to persons during their participation in a parade that has been granted a permit or other official authorization by a local unit of government or to a person operating a snowmobile on land that is owned by the person or the person's parents, grandparents, siblings, uncles, or aunts.\nIt is unlawful for any person who is the owner or in lawful control of a snowmobile to permit the snowmobile to be operated contrary to the provisions of this section.\nWhen the judge of a juvenile court, or any of its duly authorized agents, shall determine that any person, while less than 18 years of age, has violated the provisions of sections 84.81 to 84.88, or any other state or local law or ordinance regulating the operation of snowmobiles, the judge, or duly authorized agent, shall immediately report this determination to the commissioner and may recommend the suspension of the person's snowmobile safety certificate. The commissioner is hereby authorized to suspend the certificate, without a hearing.",
	"repealed": false
}