{
	"id": "142G.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.65",
	"title": "142G.65 EMPLOYMENT AND TRAINING SERVICE PROVIDER APPEAL.",
	"text": "An employment and training service provider that is not included in a county's service agreement under section 142G.76, subdivision 4, because the county has demonstrated financial hardship under section 142G.54, subdivision 5, may appeal its exclusion to the commissioner of employment and economic development under this section.\nAn employment and training service provider that is not included by a county agency in the service agreement under section 142G.76, subdivision 4, and that meets the criteria in paragraph (b), may appeal its exclusion to the commissioner of employment and economic development, and may request alternative approval by the commissioner of employment and economic development to provide services in the county.\n(a) The commissioner must act on a request for alternative approval under this section within 30 days of the receipt of the request. If after reviewing the provider's request, and the county's service agreement submitted under section 142G.76, subdivision 4, the commissioner determines that the provider meets the criteria under subdivision 2, paragraph (b), and that approval of the provider would not cause financial hardship to the county, the county must submit a revised service agreement under subdivision 4 that includes the approved provider.\n(b) If the commissioner determines that the approval of the provider would cause financial hardship to the county, the commissioner must notify the provider and the county of this determination. The alternate approval process under this section shall be closed to other requests for alternate approval to provide employment and training services in the county for up to 12 months from the date that the commissioner makes a determination under this paragraph.\nThe commissioner of employment and economic development must notify the county agency when the commissioner grants an alternative approval to an employment and training service provider under subdivision 2. Upon receipt of the notice, the county agency must submit a revised service agreement under section 142G.76, subdivision 4, that includes the approved provider. The county has 90 days from the receipt of the commissioner's notice to submit the revised service agreement.\nNotwithstanding subdivision 3, once a county meets the requirements of section 142G.54, subdivision 4, the commissioner may, but is not required to, act on a request by an employment and training services provider for alternative approval in that county.",
	"repealed": false
}