{
	"id": "256.476",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.476",
	"title": "256.476 CONSUMER SUPPORT PROGRAM.",
	"text": "The commissioner of human services shall establish a consumer support grant program for individuals with functional limitations and their families who wish to purchase and secure their own supports. The program shall:\n(1) make support grants available to individuals or families as an effective alternative to the family support program, personal care attendant services, home health aide services, and home care nursing services;\n(2) provide consumers more control, flexibility, and responsibility over their services and supports;\n(3) promote local program management and decision making; and\n(4) encourage the use of informal and typical community supports.\nFor purposes of this section, the following terms have the meanings given them:\n(a) \"County board\" means the county board of commissioners for the county of financial responsibility as defined in section 256G.02, subdivision 4, or its designated representative. When a human services board has been established under sections 402.01 to 402.10, it shall be considered the county board for the purposes of this section.\n(b) \"Family\" means the person's birth parents, adoptive parents or stepparents, siblings or stepsiblings, children or stepchildren, grandparents, grandchildren, niece, nephew, aunt, uncle, or spouse. For the purposes of this section, a family member is at least 18 years of age.\n(c) \"Functional limitations\" means the long-term inability to perform an activity or task in one or more areas of major life activity, including self-care, understanding and use of language, learning, mobility, self-direction, and capacity for independent living. For the purpose of this section, the inability to perform an activity or task results from a mental, emotional, psychological, sensory, or physical disability, condition, or illness.\n(d) \"Informed choice\" means a voluntary decision made by the person, the person's legal representative, or other authorized representative after becoming familiarized with the alternatives to:\n(1) select a preferred alternative from a number of feasible alternatives;\n(2) select an alternative which may be developed in the future; and\n(3) refuse any or all alternatives.\n(e) \"Local agency\" means the local agency authorized by the county board or, for counties not participating in the consumer grant program by July 1, 2002, the commissioner, to carry out the provisions of this section.\n(f) \"Person\" or \"persons\" means a person or persons meeting the eligibility criteria in subdivision 3.\n(g) \"Authorized representative\" means an individual designated by the person or their legal representative to act on their behalf. This individual may be a family member, guardian, representative payee, or other individual designated by the person or their legal representative, if any, to assist in purchasing and arranging for supports. For the purposes of this section, an authorized representative is at least 18 years of age.\n(h) \"Screening\" means the screening of a person's service needs under sections 256B.0911 and 256B.092.\n(i) \"Supports\" means services, care, aids, environmental modifications, or assistance purchased by the person, the person's legal representative, or other authorized representative. Examples of supports include respite care, assistance with daily living, and assistive technology. For the purpose of this section, notwithstanding the provisions of section 144A.43, supports purchased under the consumer support program are not considered home care services.\n(j) \"Program of origination\" means the program the individual transferred from when approved for the consumer support grant program.\n(a) A person is eligible to apply for a consumer support grant if the person meets all of the following criteria:\n(1) the person is eligible for and has been approved to receive services under medical assistance as determined under sections 256B.055 and 256B.056 or the person has been approved to receive a grant under the family support program under section 252.32;\n(2) the person is able to direct and purchase the person's own care and supports, or the person has a family member, legal representative, or other authorized representative who can purchase and arrange supports on the person's behalf;\n(3) the person has functional limitations, requires ongoing supports to live in the community, and is at risk of or would continue institutionalization without such supports; and\n(4) the person will live in a home. For the purpose of this section, \"home\" means the person's own home or home of a person's family member. These homes are natural home settings and are not licensed by the Department of Health or Human Services.\n(b) Persons may not concurrently receive a consumer support grant if they are:\n(1) receiving personal care attendant and home health aide services, or home care nursing under section 256B.0625; a family support grant; or alternative care services under section 256B.0913; or\n(2) residing in an institutional or congregate care setting.\n(c) A person or person's family receiving a consumer support grant shall not be charged a fee or premium by a local agency for participating in the program.\n(d) Individuals receiving home and community-based waivers under United States Code, title 42, section 1396h(c), are not eligible for the consumer support grant, except for individuals receiving consumer support grants before July 1, 2003, as long as other eligibility criteria are met.\n(e) The commissioner shall establish a budgeted appropriation each fiscal year for the consumer support grant program. The number of individuals participating in the program will be adjusted so the total amount allocated to counties does not exceed the amount of the budgeted appropriation. The budgeted appropriation will be adjusted annually to accommodate changes in demand for the consumer support grants.\n(a) A county board may choose to participate in the consumer support grant program. If a county has not chosen to participate by July 1, 2002, the commissioner shall contract with another county or other entity to provide access to residents of the nonparticipating county who choose the consumer support grant option. The commissioner shall notify the county board in a county that has declined to participate of the commissioner's intent to enter into a contract with another county or other entity at least 30 days in advance of entering into the contract. The local agency shall establish written procedures and criteria to determine the amount and use of support grants. These procedures must include, at least, the availability of respite care, assistance with daily living, and adaptive aids. The local agency may establish monthly or annual maximum amounts for grants and procedures where exceptional resources may be required to meet the health and safety needs of the person on a time-limited basis, however, the total amount awarded to each individual may not exceed the limits established in subdivision 11.\n(b) Support grants to a person, a person's legal representative, or other authorized representative will be provided through a monthly subsidy payment and be in the form of cash, voucher, or direct county payment to vendor. Support grant amounts must be determined by the local agency. Each service and item purchased with a support grant must meet all of the following criteria:\n(1) it must be over and above the normal cost of caring for the person if the person did not have functional limitations;\n(2) it must be directly attributable to the person's functional limitations;\n(3) it must enable the person, a person's legal representative, or other authorized representative to delay or prevent out-of-home placement of the person; and\n(4) it must be consistent with the needs identified in the service agreement, when applicable.\n(c) Items and services purchased with support grants must be those for which there are no other public or private funds available to the person, a person's legal representative, or other authorized representative. Fees assessed to the person or the person's family for health and human services are not reimbursable through the grant.\n(d) In approving or denying applications, the local agency shall consider the following factors:\n(1) the extent and areas of the person's functional limitations;\n(2) the degree of need in the home environment for additional support; and\n(3) the potential effectiveness of the grant to maintain and support the person in the family environment or the person's own home.\n(e) At the time of application to the program or screening for other services, the person, a person's legal representative, or other authorized representative shall be provided sufficient information to ensure an informed choice of alternatives by the person, the person's legal representative, or other authorized representative, if any. The application shall be made to the local agency and shall specify the needs of the person or the person's legal representative or other authorized representative, the form and amount of grant requested, the items and services to be reimbursed, and evidence of eligibility for medical assistance.\n(f) Upon approval of an application by the local agency and agreement on a support plan for the person or the person's legal representative or other authorized representative, the local agency shall make grants to the person or the person's legal representative or other authorized representative. The grant shall be in an amount for the direct costs of the services or supports outlined in the service agreement.\n(g) Reimbursable costs shall not include costs for resources already available, such as special education classes, day training and habilitation, case management, other services to which the person is entitled, medical costs covered by insurance or other health programs, or other resources usually available at no cost to the person or the person's legal representative or other authorized representative.\n(h) The state of Minnesota, the county boards participating in the consumer support grant program, or the agencies acting on behalf of the county boards in the implementation and administration of the consumer support grant program shall not be liable for damages, injuries, or liabilities sustained through the purchase of support by the individual, the individual's family, or the authorized representative under this section with funds received through the consumer support grant program. Liabilities include but are not limited to: workers' compensation liability, the Federal Insurance Contributions Act (FICA), or the Federal Unemployment Tax Act (FUTA). For purposes of this section, participating county boards and agencies acting on behalf of county boards are exempt from the provisions of section 268.035.\n(a) For the purpose of transferring persons to the consumer support grant program from the family support program and personal care assistance services, home health aide services, or home care nursing services, the amount of funds transferred by the commissioner between the family support program account, the medical assistance account, or the consumer support grant account shall be based on each county's participation in transferring persons to the consumer support grant program from those programs and services.\n(b) At the beginning of each fiscal year, county allocations for consumer support grants shall be based on:\n(1) the number of persons to whom the county board expects to provide consumer supports grants;\n(2) their eligibility for current program and services;\n(3) the monthly grant levels allowed under subdivision 11; and\n(4) projected dates when persons will start receiving grants. County allocations shall be adjusted periodically by the commissioner based on the actual transfer of persons or service openings, and the monthly grant levels associated with those persons or service openings, to the consumer support grant program.\n(c) The amount of funds transferred by the commissioner from the medical assistance account for an individual may be changed if it is determined by the county or its agent that the individual's need for support has changed.\n(d) The authority to utilize funds transferred to the consumer support grant account for the purposes of implementing and administering the consumer support grant program will not be limited or constrained by the spending authority provided to the program of origination.\n(e) The commissioner may use up to five percent of each county's allocation, as adjusted, for payments for administrative expenses, to be paid as a proportionate addition to reported direct service expenditures.\n(f) The county allocation for each person or the person's legal representative or other authorized representative cannot exceed the amount allowed under subdivision 11.\n(g) The commissioner may recover, suspend, or withhold payments if the county board, local agency, or grantee does not comply with the requirements of this section.\n(h) Grant funds unexpended by consumers shall return to the state once a year. The annual return of unexpended grant funds shall occur in the quarter following the end of the state fiscal year.\nNotice, appeal, and hearing procedures shall be conducted in accordance with section 256.045. The denial, suspension, or termination of services under this program may be appealed by a recipient or applicant under section 256.045, subdivision 3. It is an absolute defense to an appeal under this section, if the county board proves that it followed the established written procedures and criteria and determined that the grant could not be provided within the county board's allocation of money for consumer support grants.\n[Repealed, 1Sp2001 c 9 art 3 s 76]\nThe commissioner shall:\n(1) transfer and allocate funds pursuant to subdivision 11;\n(2) determine allocations based on projected and actual local agency use;\n(3) monitor and oversee overall program spending;\n(4) evaluate the effectiveness of the program;\n(5) provide training and technical assistance for local agencies and consumers to help identify potential applicants to the program; and\n(6) develop guidelines for local agency program administration and consumer information.\nCounty boards receiving funds under this section shall:\n(1) determine the needs of persons and families for services and supports;\n(2) determine the eligibility for persons proposed for program participation;\n(3) approve items and services to be reimbursed and inform families of their determination;\n(4) issue support grants directly to or on behalf of persons;\n(5) submit quarterly financial reports and an annual program report to the commissioner;\n(6) coordinate services and supports with other programs offered or made available to persons or their families; and\n(7) provide assistance to persons or their families in securing or maintaining supports, as needed.\nPersons receiving grants under this section shall:\n(1) spend the grant money in a manner consistent with their agreement with the local agency;\n(2) notify the local agency of any necessary changes in the grant or the items on which it is spent;\n(3) notify the local agency of any decision made by the person, a person's legal representative, or other authorized representative that would change their eligibility for consumer support grants;\n(4) arrange and pay for supports; and\n(5) inform the local agency of areas where they have experienced difficulty securing or maintaining supports.\nEffective July 1, 2001, the commissioner shall allocate consumer support grant resources to serve additional individuals based on a review of Medicaid authorization and payment information of persons eligible for a consumer support grant from the most recent fiscal year. The commissioner shall use the following methodology to calculate maximum allowable monthly consumer support grant levels:\n(1) For individuals whose program of origination is medical assistance home care under sections 256B.0651, 256B.0653, and 256B.0654, the maximum allowable monthly grant levels are calculated by:\n(i) determining the service authorization for each individual based on the individual's home care assessment;\n(ii) calculating the overall ratio of actual payments to service authorizations by program;\n(iii) applying the overall ratio to 50 percent of the service authorization level of each home care rating; and\n(iv) adjusting the result for any authorized rate changes provided by the legislature.\n(2) The monthly consumer support grant level for individuals who are eligible for ten or more hours of personal care assistance services or community first services and supports per day shall be increased by 7.5 percent of the monthly grant amount calculated under clause (1) when the individual uses direct support services provided by a worker who has completed training as identified in section 256B.0659, subdivision 11, paragraph (d), or section 256B.85, subdivision 16, paragraph (e).\n(3) The commissioner shall ensure the methodology is consistent with the home care programs.",
	"repealed": false
}