{
	"id": "86B.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.30",
	"title": "86B.30 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 86B.30 to 86B.341.\n\"Accompanying operator\" means a person 21 years of age or older who:\n(1) is in a personal watercraft or other type of motorboat;\n(2) is within immediate reach of the controls of the motor; and\n(3) possesses a valid operator's permit or is an exempt operator.\n\"Adult operator\" means a motorboat operator, including a personal watercraft operator, who is 12 years of age or older and who was:\n(1) effective July 1, 2025, born on or after July 1, 2004;\n(2) effective July 1, 2026, born on or after July 1, 2000;\n(3) effective July 1, 2027, born on or after July 1, 1996; and\n(4) effective July 1, 2028, born on or after July 1, 1987.\n\"Exempt operator\" means a motorboat operator, including a personal watercraft operator, who is 12 years of age or older and who:\n(1) possesses a valid license to operate a motorboat issued for maritime personnel by the United States Coast Guard under Code of Federal Regulations, title 46, part 10, or a marine certificate issued by the Canadian government;\n(2) is not a resident of the state, is temporarily using the waters of the state for a period not to exceed 60 days, and:\n(i) meets any applicable requirements of the state or country of residency; or\n(ii) possesses a Canadian pleasure craft operator's card;\n(3) is operating a motorboat under a dealer's license according to section 86B.405; or\n(4) is operating a motorboat during an emergency.\n\"Motorboat rental business\" means a person engaged in the business of renting or leasing motorboats, including personal watercraft, for a period not exceeding 30 days. Motorboat rental business includes a person's agents and employees but does not include a resort business.\n\"Resort business\" means a person that is engaged in the business of providing lodging and recreational services to transient guests and that is classified as a resort under section 273.13, subdivision 22 or 25. A resort business includes a person's agents and employees.\n\"Young operator\" means a motorboat operator, including a personal watercraft operator, younger than 12 years of age.",
	"repealed": false
}