{
	"id": "458D.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.10",
	"title": "458D.10 COSTS OF SOLID WASTE DISPOSAL.",
	"text": "The estimated cost to the district of the administration, operation, maintenance and debt service of solid waste disposal sites or facilities and the estimated costs of acquisition and betterment of the disposal sites or facilities which the board shall incur in the budget year, other than cost of acquisition and betterment which are payable out of state or federal grants and bond proceeds, and all other previously unrecovered costs incurred by the board are referred to as current costs and shall be recovered by the board through a system of user charges.\nPrior to commencing the operation of any solid waste disposal site or facility, the board shall establish a system of nondiscriminatory rates for the use of solid waste disposal sites and facilities. The rates shall be designed to recover current costs. The rates shall be adjusted by the board at any time to reflect actual costs of operating the disposal sites and facilities.\nNotwithstanding the provisions of subdivision 1, if in any budget year the receipts from user charges are insufficient to pay the current costs of operating such disposal sites and facilities, the board may issue negotiable general obligation certificates of the indebtedness in an amount sufficient to meet the deficiency. The certificates shall be issued as provided by section 458D.14, subdivisions 3 and 5.\nThe board may by resolution authorize the issuance of general obligation bonds for the acquisition or betterment of solid waste disposal sites and facilities, including but without limitation, the payment of interest during construction and for a reasonable period thereafter, the establishment of a reserve for bond payments, working capital, refunding of outstanding bonds, certificates of indebtedness, or judgments. The board shall pledge its full faith and credit and taxing power for the payment of the bonds and provide for the issuance and sale and for the security of such bonds in the manner provided in chapter 475, and shall have the same powers and duties as a municipality issuing bonds under that law, except no election shall be required and the debt limitations of chapter 475 shall not apply to the bonds. The board may pledge for payment of the bonds, revenues received from users. The board may by resolution and prior to beginning operation of any solid waste disposal site or facility authorize the issuance of general obligation bonds in an amount not to exceed 50 percent of the estimated cost of operating the disposal site or facility for the first 12 months of operation. The estimated cost shall be the best estimate of the board declared in resolution form. The board shall pledge its full faith, credit and taxing powers for the payment of such bonds and provide for the issuance and sale and for the security of such bonds in the manner provided in chapter 475, and shall have the same powers and duties as a municipality issuing bonds under that law, except no election shall be required and the debt limitations of chapter 475 shall not apply to the bonds. The board may also pledge for the payment of the bonds any revenues receivable from user charges.",
	"repealed": false
}