{
	"id": "347.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.14",
	"title": "347.14 UNLICENSED DOGS.",
	"text": "Any person may seize, impound, or restrain any unlicensed dog which the person may find running at large. The fact that a dog is without a license attached to a collar shall be presumptive evidence that the dog is unlicensed. The sheriff and sheriff's deputies or other police officer shall seize, impound or restrain any dog for which no license has been issued and for which one is required. Any officer who shall seize, restrain, impound, or kill any dog found in any place without a license, as required under sections 347.09 to 347.20, upon delivery of such dog or carcass and the proper disposal of the carcass and after making a report to the town or city treasurer of the town or city in which the dog was seized or killed, showing that the dog did not have a license, shall receive therefor a payment of $2, the same to be made from any funds in the town or city treasury not otherwise appropriated.\nThe county auditor shall reimburse the town for any expense incurred under section 347.10 and shall charge such expense to the dog license fund.\nIt is unlawful for a person to harbor or permit to remain about the person's premises a dog for which no license exists and for which one is required. Any person who has seized or impounded a dog with or without license under this section shall deliver the dog to the humane officer of the town or city, if a humane officer exists; or, if there is not a humane officer, to the town or city peace officer. The officer to whom the dog is delivered shall, without delay, notify the owner, personally or through the United States mail, if the owner is known to the officer or can be ascertained with reasonable effort. If, after five regular business days of the impounding agency, the owner does not claim the dog, the officer may dispose of the dog in a proper and humane manner. For the purpose of this section, \"regular business day\" means a day during which the establishment having custody of the dog is open to the public at least four consecutive hours between 8:00 a.m. and 7:00 p.m.\nAny person who shall violate any of the provisions of sections 347.08 to 347.21 shall be liable to a penalty of not less than $5 nor more than $50 for such violation.",
	"repealed": false
}