{
	"id": "144.552",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.552",
	"title": "144.552 PUBLIC INTEREST REVIEW.",
	"text": "(a) The following entities must submit a plan to the commissioner:\n(1) a hospital seeking to increase its number of licensed beds; or\n(2) an organization seeking to obtain a hospital license and notified by the commissioner under section 144.553, subdivision 1, paragraph (c), that it is subject to this section.\nThe plan must include information that includes an explanation of how the expansion will meet the public's interest. When submitting a plan to the commissioner, an applicant shall pay the commissioner for the commissioner's cost of reviewing and monitoring the plan, as determined by the commissioner and notwithstanding section 16A.1283. Money received by the commissioner under this section is appropriated to the commissioner for the purpose of administering this section. If the commissioner does not issue a finding within the time limit specified in paragraph (c), the commissioner must return to the applicant the entire amount the applicant paid to the commissioner. For a hospital that is seeking an exception to the moratorium under section 144.551, the plan must be submitted to the commissioner no later than August 1 of the calendar year prior to the year when the exception will be considered by the legislature.\n(b) Plans submitted under this section shall include detailed information necessary for the commissioner to review the plan and reach a finding. The commissioner may request additional information from the hospital submitting a plan under this section and from others affected by the plan that the commissioner deems necessary to review the plan and make a finding. If the commissioner determines that additional information is required from the hospital submitting a plan under this section, the commissioner shall notify the hospital of the additional information required no more than 30 days after the initial submission of the plan. A hospital submitting a plan from whom the commissioner has requested additional information shall submit the requested additional information within 14 calendar days of the commissioner's request.\n(c) The commissioner shall review the plan and, within 150 calendar days of the date when the commissioner sends the applicant organization a notice of complete application letter, issue a finding on whether the plan is in the public interest. The commissioner shall provide a copy of the notice of complete application letter to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over health and human services policy and finance. In making the recommendation, the commissioner shall consider issues including but not limited to:\n(1) whether the new hospital or hospital beds are needed to provide timely access to care or access to new or improved services given the number of available beds. For the purposes of this clause, \"available beds\" means the number of licensed acute care beds that are immediately available for use or could be brought online within 48 hours without significant facility modifications;\n(2) the financial impact of the new hospital or hospital beds on existing acute-care hospitals that have emergency departments in the region;\n(3) how the new hospital or hospital beds will affect the ability of existing hospitals in the region to maintain existing staff;\n(4) the extent to which the new hospital or hospital beds will provide services to nonpaying or low-income patients relative to the level of services provided to these groups by existing hospitals in the region; and\n(5) the views of affected parties.\n(d) If the plan is being submitted by an existing hospital seeking authority to construct a new hospital, the commissioner shall also consider:\n(1) the ability of the applicant to maintain the applicant's current level of community benefit as defined in section 144.699, subdivision 5, at the existing facility; and\n(2) the impact on the workforce at the existing facility including the applicant's plan for:\n(i) transitioning current workers to the new facility;\n(ii) retraining and employment security for current workers; and\n(iii) addressing the impact of layoffs at the existing facility on affected workers.\n(e) If the commissioner receives multiple plan submissions under this section within the same review period, the commissioner shall review the plans in the order they were received. Time periods under this section shall begin for each review once the commissioner has sent the applicant organization a notice of complete application letter. The commissioner shall provide to the chairs and ranking minority members of the house of representatives and senate committees having jurisdiction over health and human services policy and finance updates every 30 days on the progress of the review of any plan submitted under this section.\n(f) Prior to making a recommendation, the commissioner shall conduct a public hearing in the affected hospital service area to take testimony from interested persons.\n(g) Upon making a recommendation under paragraph (c), the commissioner shall provide a copy of the recommendation to the chairs of the house of representatives and senate committees having jurisdiction over health and human services policy and finance.\n(h) If an exception to the moratorium is approved under section 144.551 after a review under this section, the commissioner shall monitor the implementation of the exception up to completion of the construction project. Thirty days after completion of the construction project, the hospital shall submit to the commissioner a report on how the construction has met the provisions of the plan originally submitted under the public interest review process or a plan submitted pursuant to section 144.551, subdivision 1, paragraph (b), clause (20).",
	"repealed": false
}