{
	"id": "40A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.04",
	"title": "40A.04 STATEWIDE AGRICULTURAL LAND PRESERVATION.",
	"text": "A county located outside of the metropolitan area may submit to the commissioner and to the regional development commission in which it is located, if one exists, a proposed agricultural land preservation plan and proposed official controls implementing the plan. To the extent practicable, submission of the proposal must coincide with the completion of the county soil survey. The commissioner, in consultation with the regional development commission, shall review the plan and controls for consistency with the elements in this chapter and shall submit written comments to the county within 60 days of receipt of the proposal. The comments must include a determination of whether the plan and controls are consistent with the elements in this chapter. The commissioner shall notify the county of its determination. If the commissioner determines that the plan and controls are consistent, the county shall adopt the controls within 90 days of completion of the commissioner's review. If the commissioner determines that the plan and controls are not consistent, the comments must include the additional elements that must be addressed by the county. The county shall amend its plan and controls to include the additional elements and adopt the amended controls within 120 days of completion of the commissioner's review.\nA city that is located partially within a county in the metropolitan area but is not included in the definition of the metropolitan area may elect to be governed by this section. The city may:\n(1) request the county outside of the metropolitan area where it is partially located to include the city in the agricultural land preservation plan and official controls of the county under section 394.32; or\n(2) perform the duties of a county independently under this section.\nIf the city does not elect to be governed by this section, the city may perform the duties of an authority under chapter 473H.",
	"repealed": false
}