{
	"id": "62I.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.13",
	"title": "62I.13 ACTION BY THE MINNESOTA JOINT UNDERWRITING ASSOCIATION UPON THE APPLICATION.",
	"text": "To be eligible to participate in the association, an applicant must apply for coverage as required by this section and section 62I.08.\nAnyone who is unable to obtain insurance in the private market and who so certifies to the association is eligible to apply to the association for coverage. The application may require information as provided in section 62I.08. Payment of the applicable premium or required portion of it must be paid prior to coverage by the association. An offer of coverage at a rate in excess of the rate that would be charged by the association for similar coverage and risk shall be deemed to be a refusal of coverage for purposes of eligibility for participation in the association. It shall not be deemed to be a written notice of refusal if the rate for coverage offered is less than ten percent in excess of the joint underwriting association rates for similar coverage and risk or 20 percent in excess of the Joint Underwriting Association rates for liquor liability coverages. However, the offered rate must be the rate generally charged by the insurer for similar coverage and risk.\nFor good cause, coverage may be denied or terminated by the association. Good cause may exist if the applicant or insured: (1) has an outstanding debt due or owing to the association at the time of application or renewal arising from a prior policy; (2) refuses to permit completion of an audit requested by the commissioner or the association; (3) submits misleading or erroneous information to the commissioner or the association; (4) disregards safety standards, laws, rules or ordinance pertaining to the risk being insured; (5) fails to supply information requested by the commissioner or the association; and (6) fails to comply with the terms of the policies or contracts for coverage issued by the association.\n[Repealed, 2003 c 21 s 13]\nAn application for coverage by the association must be granted or denied within ten days after receipt of a properly completed application and any supplemental information requested. Anyone covered by the association must be given at least 30 days' notice of nonrenewal or cancellation of coverage.\n[Repealed by amendment, 2017 c 34 s 7]",
	"repealed": false
}