{
	"id": "325F.6651",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.6651",
	"title": "325F.6651 DEFINITIONS.",
	"text": "For the purpose of sections 325F.6651 to 325F.6658, the following terms have the meanings given them.\n\"Farm tractor\" means any self-propelled vehicle which is designed primarily for pulling or propelling agricultural machinery and implements and is used principally in the occupation or business of farming, including an implement of husbandry, as defined in section 169.011, subdivision 35, that is self-propelled.\n\"Consumer\" means a purchaser, other than for purposes of resale, of a new farm tractor, a person to whom the new farm tractor is transferred for the same purposes during the duration of an express warranty applicable to the farm tractor and any other person entitled by the terms of the warranty to enforce the terms of the warranty. In the case of an agricultural vehicle within the warranty period, the sale must be made through an authorized farm equipment dealer.\n\"Manufacturer\" means a person engaged in the business of manufacturing, assembling, or distributing farm tractors, who under normal business conditions during the year, manufactures, assembles, or distributes to dealers at least ten new farm tractors.\n\"Manufacturer's express warranty\" and \"warranty\" mean the written warranty of the manufacturer of a new farm tractor of its condition and fitness for use, including any terms or conditions precedent to the enforcement of obligations under that warranty.\n\"Fair rental value\" means the rental value calculated in accordance with the \"Tractor and Farm Equipment Trade-In Guide\" published by the National Farm and Power Equipment Dealers Association.\n\"Nonconformity\" means any condition of the farm tractor that makes it impossible to use for the purpose for which it was intended.\n\"Reasonable allowance for prior use\" shall mean no less than the fair rental value of the farm tractor and shall be the sum of:\n(1) that amount attributable to use by the consumer prior to the consumer's first report of the nonconformity to the manufacturer or its authorized dealers;\n(2) that amount attributable to use by the consumer during any period subsequent to such report of the reported nonconformity; and\n(3) that amount attributable to use by the consumer of the farm tractor provided by the manufacturer or its authorized dealers while the farm tractor is out of service by reason of repair of the reported nonconformity.",
	"repealed": false
}