{
	"id": "174.257",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.257",
	"title": "174.257 RIDE-SHARING PROGRAM.",
	"text": "(a) The commissioner of transportation shall establish a ride-sharing program in order to advise citizens of the available alternatives to travel by low-occupancy vehicles and the benefits derived from sharing rides. The program must provide citizens with necessary information and opportunities for sharing rides, encourage citizens to share rides, and assist citizens in obtaining access to shared rides. The program must make use of existing services and agencies whenever possible. The program must give priority to assisting employers who will implement employee ride-sharing programs.\n(b) The services provided by the program must include:\n(1) providing general information to potential ride-sharing users;\n(2) establishing procedures for the implementation of ride-sharing programs by individuals, groups, corporations, or local agencies;\n(3) offering assistance to local governments and other political subdivisions in implementing ride-sharing programs;\n(4) providing technical assistance to those individuals, groups, corporations, or local agencies;\n(5) providing advice to individuals requesting assistance in finding ride-sharing opportunities and programs; and\n(6) providing assistance in obtaining insured leased vans and management assistance to individuals and persons implementing ride-sharing programs.\nNo political subdivision may impose a tax on, or require a license for a ride-sharing arrangement as defined in section 169.011, subdivision 65.\nA political subdivision may authorize the use of motor vehicles which it owns or operates for ride-sharing arrangements for its employees, and may establish reasonable reimbursement rates for that use.\nThe state may authorize the use of motor vehicles which it owns or operates for ride-sharing arrangements for its employees, and shall establish reasonable reimbursement rates for that use.",
	"repealed": false
}