{
	"id": "352.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.22",
	"title": "352.22 REFUND OR DEFERRED ANNUITIES.",
	"text": "Any employee who ceases to be a state employee by reason of termination of state service or layoff is entitled to a refund provided in subdivision 2 or a deferred retirement annuity as provided in subdivision 3. Application for a refund may be made after the termination of state service or layoff if the applicant has not again become a state employee required to be covered by the system.\nExcept as provided in subdivision 3, the refund payable to a person who ceased to be a state employee by reason of a termination of state service is an amount equal to employee accumulated contributions plus interest until the date on which the refund is paid, at the following rates for the applicable period:\n(1) six percent per year compounded daily from the date that the contribution was made until June 30, 2011;\n(2) four percent per year compounded daily from the date that the contribution was made or July 1, 2011, whichever is later, until June 30, 2018; and\n(3) three percent per year compounded daily from the date that the contribution was made or July 1, 2018, whichever is later.\nIncluded with the refund is any interest paid as part of repayment of a past refund, plus interest thereon from the date of repayment.\nNo refunds of contributions made to the metropolitan transit commission-transit operating division employees retirement fund received before July 1, 1978, or for service rendered before July 1, 1978, may be repaid.\nAny person who has received a refund from the state employees retirement plan, and who is a member of any of the retirement plans specified in section 356.311, paragraph (b), may repay the refund with interest to the state employees retirement plan. If a refund is repaid to the plan and more than one refund has been received from the plan, all refunds must be repaid. Repayment must be made as provided in section 352.23, and under terms and conditions consistent with that section as agreed upon with the director.\n(a) An employee who has at least three years of allowable service if employed before July 1, 2010, or who has at least five years of allowable service if employed after June 30, 2010, when termination occurs may elect to leave the accumulated contributions in the fund and thereby be entitled to a deferred retirement annuity. The annuity must be computed under the law in effect when state service terminated, on the basis of the allowable service credited to the person before the termination of service.\n(b) An employee on layoff or on leave of absence without pay, except a leave of absence for health reasons, and who does not return to state service must have an annuity, deferred annuity, or other benefit to which the employee may become entitled computed under the law in effect on the employee's last working day.\n(c) No application for a deferred annuity may be made more than 60 days before the time the former employee reaches the required age for entitlement to the payment of the annuity. The deferred annuity begins to accrue no earlier than 60 days before the date the application is filed in the office of the system, but not (1) before the date on which the employee reaches the required age for entitlement to the annuity nor (2) before the day following the termination of state service in a position which is not covered by the retirement system.\n(d) Application for the accumulated contributions left on deposit with the fund may be made at any time following the date of the termination of service.\n(e) Deferred annuities must be augmented as provided in subdivision 3a.\n(a) The deferred annuity of any former state employee must be augmented from the first day of the month following termination of active service or July 1, 1971, whichever is later, to the effective date of retirement.\n(b) For a person who became a state employee before July 1, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) five percent until January 1, 1981;\n(2) three percent thereafter until January 1 of the year following the year in which the former employee attains age 55 or January 1, 2012, whichever is earlier;\n(3) five percent from the January 1 next following the attainment of age 55 until December 31, 2011;\n(4) two percent from January 1, 2012, until December 31, 2018; and\n(5) after December 31, 2018, the deferred annuity must not be augmented.\n(c) For a person who became a state employee after June 30, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) 2.5 percent until December 31, 2011;\n(2) two percent from January 1, 2012, until December 31, 2018; and\n(3) after December 31, 2018, the deferred annuity must not be augmented.\n(d) The retirement annuity or disability benefit of, or the survivor benefit payable on behalf of, a former state employee who terminated service before July 1, 1997, which is not first payable until after June 30, 1997, must be increased on an actuarial equivalent basis to reflect the change in the investment return actuarial assumption under section 356.215, subdivision 8, from five percent to six percent under a calculation procedure and the tables adopted by the board and approved by the actuary retained under section 356.214.\n(a) If a person otherwise entitled to an annuity has more than one period of uninterrupted service, the person is entitled to augmentation under subdivision 3a for each period of uninterrupted service. \"Uninterrupted service\" for the purpose of this subdivision means periods of covered employment during which the employee has not been separated from state service for more than two years. The formula percentages used for each period of uninterrupted service must be those applicable to a new employee. The mortality and investment rate of return assumptions used to compute the annuity must be those in effect when the employee files an application for annuity.\n(b) If a person repays a refund, the service restored by the repayment must be considered continuous with the next period of service for which the employee has credit with this system.\n(c) The requirements and provisions for retirement before normal retirement age in sections 352.115, subdivision 1, and 352.116 also apply to an employee fulfilling the requirements with a combination of service as provided in this subdivision.\n(d) This subdivision does not reduce the annuity otherwise payable under this chapter.\nThe retirement annuity or disability benefit of, or the survivor benefit payable on behalf of, a former state employee who terminated service before July 1, 1997, which is not first payable until after June 30, 1997, must be increased on an actuarial equivalent basis to reflect the change in the postretirement interest rate actuarial assumption under Laws 1997, chapter 233, section 58, from five percent to six percent under a calculation procedure and the tables adopted by the board and approved by the actuary retained under section 356.214.\n[Repealed, 1983 c 128 s 36]\nThe right of refund provided in this section is not restricted as to time unless specifically provided and the statute of limitation does not apply to it.\n[Repealed, 1965 c 230 s 18]\n[Repealed, Ex1967 c 57 so 20]\n(a) If a former employee covered by the system does not apply for refund within five years after the last deduction was taken from salary for the retirement fund, and does not have enough service to qualify for a deferred annuity, accumulated member and employer contributions must be credited to and become a part of the retirement fund.\n(b) If the former employee returns to state service and becomes a state employee covered by the system, the amount credited to the retirement fund, if more than $25, must be restored to the individual account. If the amount credited to the fund is over $25 and the former employee applies for refund or an annuity under section 356.30 or 356.311, the amount must be restored to the former employee's individual account and a refund made or an annuity paid, whichever applies.\n[Repealed, 1993 c 307 art 7 s 1]\nFormer employees covered by the system are entitled to apply for refunds if they are or become members of the State Patrol retirement fund, the state Teachers Retirement Association, or employees of the University of Minnesota excluded from coverage under the system by action of the Board of Regents; or employees of the adjutant general who under federal law effectually elect membership in a federal retirement system; or officers or employees of the senate or house of representatives, excluded from coverage under section 352.01, subdivision 2b, clause (6), item (i). The refunds must include accumulated contributions plus interest as provided in subdivision 2.\n[Repealed, 1980 c 342 s 21]",
	"repealed": false
}