{
	"id": "260C.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.223",
	"title": "260C.223 CONCURRENT PERMANENCY PLANNING.",
	"text": "(a) The commissioner of children, youth, and families shall establish a program for concurrent permanency planning for child protection services.\n(b) Concurrent permanency planning involves a planning process for children who are placed out of the home of their parents pursuant to a court order, or who have been voluntarily placed out of the home by the parents for 60 days or more and who are not developmentally disabled or emotionally disabled under section 260C.212, subdivision 9. The responsible social services agency shall develop an alternative permanency plan while making reasonable efforts for reunification of the child with the family, if required by section 260.012. The goals of concurrent permanency planning are to:\n(1) achieve early permanency for children;\n(2) decrease children's length of stay in foster care and reduce the number of moves children experience in foster care; and\n(3) develop a group of families who will work towards reunification and also serve as permanent families for children.\nThe commissioner shall establish guidelines and protocols for social services agencies involved in concurrent permanency planning, including criteria for conducting concurrent permanency planning based on relevant factors such as:\n(1) age of the child and duration of out-of-home placement;\n(2) prognosis for successful reunification with parents;\n(3) availability of relatives and other concerned individuals to provide support or a permanent placement for the child; and\n(4) special needs of the child and other factors affecting the child's best interests.\nIn developing the guidelines and protocols, the commissioner shall consult with interest groups within the child protection system, including child protection workers, child protection advocates, county attorneys, law enforcement, community service organizations, the councils of color, and the ombudsperson for families.\nConcurrent permanency planning programs must include involvement of parents and full disclosure of their rights and responsibilities; goals of concurrent permanency planning; support services that are available for families; permanency options; and the consequences of not complying with case plans.\nThe commissioner of children, youth, and families shall provide ongoing technical assistance, support, and training for responsible social services agencies and other individuals and agencies involved in concurrent permanency planning.\nThe requirements of this section relating to concurrent permanency planning are effective only for state fiscal years when aid is distributed for concurrent permanency planning.",
	"repealed": false
}