{
	"id": "221.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.81",
	"title": "221.81 BUILDING MOVER.",
	"text": "For the purposes of this section, the terms used in this section have the meanings given them in this subdivision.\n(a) \"Building mover\" means a person, corporation, or other entity who raises, supports off the foundation, and moves buildings on and over public streets and highways. Building mover does not include a person who moves manufactured homes or modular homes, farmers moving their own farm buildings, or persons moving buildings which are less than 16 feet wide by 20 feet long.\n(b) \"Political subdivision\" means a city, town, or county.\n(c) \"Road authority\" has the meaning given it in section 160.02, subdivision 25.\nNo person may operate as a building mover in this state unless licensed by the commissioner. The commissioner may inspect a building mover's vehicles or records to determine compliance with this section.\nTo obtain a license to operate as a building mover an applicant shall file an application with the commissioner specifying the name and address of its officers and other information as the commissioner may reasonably require. The commissioner shall issue the license upon compliance by the applicant with insurance requirements and payment of an initial $150 filing fee. A license once granted continues in full force and effect, subject to a $100 annual renewal fee and compliance with insurance requirements, unless revoked or suspended.\nThe commissioner, upon approval of a license for a building mover, shall issue a sufficient number of cab cards to each licensed mover to provide one cab card for each power unit used in moving buildings. The fee is $10 for each cab card issued. The cab card must be carried at all times in a readily available place in the cab of the power unit for which it was issued. The building mover may also purchase up to five floater cab cards for a fee of $100 for each floater card issued. Cab cards are effective for a 12-month period and continue from year to year thereafter upon payment of the required fee. Cab cards are only good for the period for which the license is effective.\n(a) Each building mover shall have in effect the following:\n(1) comprehensive general liability insurance including completed operations, underground property damage, and collapse coverage in the amount of at least $500,000 for bodily injury or property damage; and\n(2) motor vehicle liability insurance in the amount of at least $500,000 for bodily injury or property damage.\n(b) The insurance must be written by an insurer licensed to do business in the state of Minnesota. Each building mover shall file with the commissioner a certificate evidencing the insurance. The insurance policy must provide that the policy may not be canceled without the insurer first giving 30 days' written notice to the commissioner of the impending cancellation.\n(c) On request of the commissioner, the insurer must furnish a duplicate original of the policy and all endorsements to the policy.\nA building mover may not move a building on or across a street or highway without first obtaining a permit from the road authority having jurisdiction over the street or highway. A permit for the movement of a building may not be granted to a building mover who does not possess a current license issued by the commissioner.\nNo license to move buildings or bond, cash deposit, or insurance coverage may be required by a political subdivision of the state other than the license and insurance coverage required by the commissioner. A road authority may charge a fee for services performed and may require a permit which reasonably regulates the hours, routing, movement, parking, or speed limit for a building mover operating on streets or highways under its jurisdiction. A building mover shall comply with the State Building Code in jurisdictions which have adopted the State Building Code, and with local ordinances which regulate the moving or removing of buildings. A building mover may not be required to pay a route approval fee to, or obtain a permit for the movement of a building on streets or highways from, a political subdivision which is not also the road authority. This section does not prohibit a political subdivision from charging a permit fee for regulation of activities which do not involve the use of public streets or highways. Neither the state nor a political subdivision may regulate rates charged by building movers.\nA building mover is required to comply with section 221.031, subdivision 6. The mover's name and USDOT number must be displayed on the power unit of a vehicle used to move buildings and on buildings being moved.\n(a) A building mover must comply with the rules adopted in section 221.0314: (1) subdivision 6 for driving of motor vehicles; (2) subdivision 7 for parts and accessories necessary for the safe operation, except as provided in paragraph (b); (3) subdivision 10 for inspection, repair, and maintenance; (4) subdivision 8 for accident reporting; and (5) subdivisions 2 to 5 for driver qualifications.\n(b) A towed vehicle, other than a full trailer, pole trailer, or semitrailer, as those terms are defined in Code of Federal Regulations, title 49, section 390.5, used by a building mover to move a building on a highway is not required to comply with rules for parts and accessories necessary for safe operation.\nThe commissioner, after notice and a hearing, may revoke, suspend, or deny a license for:\n(1) failure of the applicant or license holder to reimburse the road authority for damage to public highways, roads, streets, or utilities that are not paid for by the license holder's insurer;\n(2) conduct of the applicant or license holder that endangers the health and safety of users of the public highways, roads, streets, or utilities;\n(3) conduct of the applicant or license holder that obstructs traffic in a manner other than as authorized in the permit;\n(4) violation of this section;\n(5) failure to obtain or comply with required local moving permits, or permits required by section 168B.15 or 169.86;\n(6) placing or leaving a building on property without the permission of the owner of the property or in violation of local ordinances; or\n(7) abandoning a building after it is first moved under the road permit. For purposes of this subdivision, \"abandon\" means conduct that shows that a building mover has failed to use reasonable diligence in moving a building to the location described in the road permit.\n(a) The commissioner shall suspend a license without a hearing for the following reasons:\n(1) failure to pay the renewal fee; or\n(2) failure to comply with insurance requirements.\n(b) The suspension continues until the fees are paid and the insurance requirements are satisfied.\nA person who violates, or aids or abets the violation of, any of the provisions of this section is guilty of a misdemeanor. Every distinct violation is a separate offense.\n[Repealed, 1983 c 293 s 84]\n[Repealed, 1983 c 293 s 84]\n[Repealed, 1983 c 293 s 84]",
	"repealed": false
}