{
	"id": "168.1298",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1298",
	"title": "168.1298 SPECIAL \"SUPPORT OUR TROOPS\" PLATES.",
	"text": "(a) The commissioner shall issue special \"Support Our Troops\" license plates to an applicant who:\n(1) is an owner of a passenger automobile, one-ton pickup truck, recreational vehicle, or motorcycle;\n(2) pays a fee in the amount specified for special plates under section 168.12, subdivision 5;\n(3) pays the registration tax required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes a minimum of $30 annually to the Minnesota \"Support Our Troops\" account established in section 190.19; and\n(6) complies with laws and rules governing registration and licensing of vehicles and drivers.\n(b) The license application under this section must indicate that the annual contribution specified under paragraph (a), clause (5), is a minimum contribution to receive the plates and that the applicant may make an additional contribution to the account.\nAfter consultation with interested groups, the adjutant general and the commissioner of veterans affairs shall design the special plate, subject to the approval of the commissioner.\nContributions under this section must not be refunded.\nNotwithstanding section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another passenger automobile, one-ton pickup truck, recreational vehicle, or motorcycle owned by the individual to whom the special plates were issued.\nContributions under subdivision 1, paragraph (a), clause (5), must be paid to the commissioner and credited to the Minnesota \"Support Our Troops\" account established in section 190.19. The fees collected under this section must be deposited in the driver and vehicle services operating account under section 299A.705.\nThe commissioner shall maintain a record of the number of plates issued under this section.",
	"repealed": false
}