{
	"id": "62A.3163",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.3163",
	"title": "62A.3163 MEDICARE SUPPLEMENT PLAN WITH 50 PERCENT PART A DEDUCTIBLE COVERAGE.",
	"text": "(a) The Medicare supplement plan with 50 percent Medicare Part A deductible coverage must have a level of coverage that will provide:\n(1) 100 percent of Medicare Part A hospitalization coinsurance plus coverage for 365 days after Medicare benefits end;\n(2) coverage for 50 percent of the Medicare Part A inpatient hospital deductible amount per benefit period;\n(3) coverage for the coinsurance amount for each day used from the 21st through the 100th day in a Medicare benefit period for posthospital skilled nursing care eligible under Medicare Part A;\n(4) coverage for cost sharing for all Medicare Part A eligible hospice and respite care expenses;\n(5) coverage under Medicare Part A or B for the reasonable cost of the first three pints of blood, or equivalent quantities of packed red blood cells, as defined under federal regulations;\n(6) coverage for 100 percent of the cost sharing otherwise applicable under Medicare Part B, after the policyholder pays the Medicare Part B deductible;\n(7) coverage of 100 percent of the cost sharing for Medicare Part B preventive services and diagnostic procedures for cancer screening described in section 62A.30 after the policyholder pays the Medicare Part B deductible;\n(8) coverage of 80 percent of the hospital and medical expenses and supplies incurred during travel outside of the United States as a result of a medical emergency; and\n(9) coverage for 100 percent of the Medicare Part A or B home health care services and medical supplies after the policyholder pays the Medicare Part B deductible.\n(b) A Medicare supplement plan with 50 percent Part A deductible coverage must provide the benefits contained in this section, but must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual.",
	"repealed": false
}