{
	"id": "363A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.42",
	"title": "363A.42 PUBLIC RECORDS; ACCESSIBILITY.",
	"text": "For purposes of this section, \"records\" means any publicly available recorded information that is collected, created, received, maintained or disseminated by the executive, judicial or legislative branches of the state, the Minnesota State Colleges and Universities, the University of Minnesota, cities, towns, counties, school districts and all other political subdivisions of the state, regardless of physical form or method of storage.\nUpon request by an individual, records must be made available within a reasonable time period to persons with disabilities in a manner consistent with state and federal laws prohibiting discrimination against persons with disabilities. Reasonable modifications must be made in any policies, practices and procedures that might otherwise deny equal access to records to individuals with disabilities.\nNotwithstanding any law to the contrary except Laws 2009, chapter 131, this section does not apply to: (1) technology procured or developed prior to January 1, 2013, unless substantially modified or substantially enhanced after January 1, 2013; or (2) records that cannot be reasonably modified to be accessible without an undue burden as defined in section 16E.015, subdivision 4, to the public entity.\nViolation of this section is subject to a penalty of $500 per violation, plus reasonable attorney fees, costs and disbursements, payable to a qualified disabled person under section 363A.03, subdivision 36, who sought the accessible record under subdivision 2, by the public entity in violation of this section. The total amount of penalties payable to any individual or class regardless of the number of violations is limited to $15,000. In any class action or series of class actions which arise from a violation of this section, the amount of attorney fees awarded against the violating public entity may not exceed $15,000. Any action must be commenced within one year of the occurrence of the alleged violation.",
	"repealed": false
}