{
	"id": "61B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.26",
	"title": "61B.26 DUTIES AND POWERS OF COMMISSIONER.",
	"text": "(a) In addition to other duties and powers in sections 61B.18 to 61B.32, the commissioner shall:\n(1) notify the board of directors of the existence of an impaired or insolvent insurer within three days after a determination of impairment or insolvency is made or the commissioner receives notice of impairment or insolvency;\n(2) upon request of the board of directors, provide the association with a statement of the premiums in this and any other appropriate states for each member insurer;\n(3) when an impairment is declared and the amount of the impairment is determined, serve a demand upon the impaired insurer to make good the impairment within a reasonable time; notice to the impaired insurer shall constitute notice to its shareholders, if any; the failure of the impaired insurer to promptly comply with the commissioner's demand shall not excuse the association from the performance of its powers and duties under sections 61B.18 to 61B.32; and\n(4) in a liquidation, conservation, or rehabilitation proceeding involving a domestic insurer, be appointed as the liquidator, conservator, or rehabilitator.\n(b) The commissioner may suspend or revoke, after notice and hearing, the certificate of authority to transact business in this state of any member insurer which fails to pay an assessment when due or fails to comply with the plan of operation. As an alternative, the commissioner may levy a forfeiture on any member insurer which fails to pay an assessment when due. A forfeiture shall not exceed five percent of the unpaid assessment per month, but no forfeiture shall be less than $100 per month.\n(c) A final action of the board of directors or the association may be appealed to the commissioner if the appeal is taken within 60 days of the aggrieved party's receipt of notice of the final action being appealed. Any final action or order of the commissioner is subject to judicial review in a court of competent jurisdiction, in the manner provided by chapter 14. A determination or decision by the commissioner under sections 61B.18 to 61B.32 is not subject to the contested case or rulemaking provisions of chapter 14.\n(d) The liquidator, rehabilitator, or conservator of an impaired insurer may notify all interested persons of the effect of sections 61B.18 to 61B.32.\n(e) For the purposes of sections 61B.18 to 61B.32, the commissioner may delegate any of the powers conferred by law.\n(f) Nonperformance of any of the acts specified in this section or failure to meet the specific time limits does not affect the association, its members, or any other person as to the person's duties and obligations.",
	"repealed": false
}