{
	"id": "245C.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.32",
	"title": "245C.32 SYSTEMS AND RECORDS.",
	"text": "The commissioner may establish systems and records to fulfill the requirements of this chapter.\n(a) The commissioner shall design, develop, and test the NETStudy 2.0 system and implement it no later than September 1, 2015.\n(b) The NETStudy 2.0 system developed and implemented by the commissioner shall incorporate and meet all applicable data security standards and policies required by the Federal Bureau of Investigation (FBI), Department of Public Safety, Bureau of Criminal Apprehension, and the Department of Information Technology Services. The system shall meet all required standards for encryption of data at the database level as well as encryption of data that travels electronically among agencies initiating background studies, the commissioner's authorized fingerprint collection vendor or vendors, the commissioner, the Bureau of Criminal Apprehension, and in cases involving national criminal record checks, the FBI.\n(c) The data system developed and implemented by the commissioner shall incorporate a system of data security that allows the commissioner to control access to the data field level by the commissioner's employees. The commissioner shall establish that employees have access to the minimum amount of private data on any individual as is necessary to perform their duties under this chapter.\n(d) The commissioner shall oversee regular quality and compliance audits of the authorized fingerprint collection vendor or vendors.\nWhen accessing private data on individuals through NETStudy 2.0, entities that are authorized to initiate background studies and the commissioner's authorized fingerprint collection vendors shall be subject to all responsibilities and civil remedies applicable to a responsible authority or government entity as specified under section 13.08.\n(a) The commissioner may also use these systems and records to obtain and provide criminal history data from the Bureau of Criminal Apprehension, criminal history data held by the commissioner, and data about substantiated maltreatment under section 626.557 or chapter 260E, for other purposes, provided that:\n(1) the background study is specifically authorized in statute; or\n(2) the request is made with the informed consent of the subject of the study as provided in section 13.05, subdivision 4.\n(b) An individual making a request under paragraph (a), clause (2), must agree in writing not to disclose the data to any other individual without the consent of the subject of the data.\n(c) The commissioner may use these systems to share background study documentation electronically with entities and individuals who are the subject of a background study.\n(d) The commissioner may recover the cost of obtaining and providing background study data by charging the individual or entity requesting the study a fee as described in section 245C.10. The fees collected under this paragraph are appropriated to the commissioner for the purpose of conducting background studies.\n(a) When specifically required by statute, the commissioner shall also obtain criminal history data from the National Criminal Records Repository.\n(b) To obtain criminal history data from the National Criminal Records Repository, the commissioner shall require classifiable fingerprints of the data subject and must submit these fingerprint requests through the Bureau of Criminal Apprehension.\n(c) The commissioner may require the background study subject to submit fingerprint images electronically. The commissioner may not require electronic fingerprint images until the electronic recording and transfer system is available for noncriminal justice purposes and the necessary equipment is in use in the law enforcement agency in the background study subject's local community.\n(d) The commissioner may recover the cost of obtaining and providing criminal history data from the National Criminal Records Repository by charging the individual or entity requesting the study a fee of no more than $30 per study. The fees collected under this subdivision are appropriated to the commissioner for the purpose of obtaining criminal history data from the National Criminal Records Repository.",
	"repealed": false
}