{
	"id": "295.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.53",
	"title": "295.53 EXCLUSIONS AND EXEMPTIONS; SPECIAL RULES.",
	"text": "(a) The following payments are excluded from the gross revenues subject to the hospital, surgical center, or health care provider taxes under sections 295.50 to 295.59:\n(1) payments received by a health care provider or the wholly owned subsidiary of a health care provider for care provided outside Minnesota;\n(2) government payments received by the Direct Care and Treatment executive board for state-operated services;\n(3) payments received by a health care provider for hearing aids and related equipment or prescription eyewear delivered outside of Minnesota; and\n(4) payments received by an educational institution from student tuition, student activity fees, health care service fees, government appropriations, donations, or grants, and for services identified in and provided under an individualized education program as defined in section 256B.0625 or Code of Federal Regulations, chapter 34, section 300.340(a). Fee for service payments and payments for extended coverage are taxable.\n(b) The following payments are exempted from the gross revenues subject to hospital, surgical center, or health care provider taxes under sections 295.50 to 295.59:\n(1) payments received for services provided under the Medicare program, including payments received from the government and organizations governed by sections 1833, 1853, and 1876 of title XVIII of the federal Social Security Act, United States Code, title 42, section 1395; and enrollee deductibles, co-insurance, and co-payments, whether paid by the Medicare enrollee, by Medicare supplemental coverage as described in section 62A.011, subdivision 3, clause (10), or by Medicaid payments under title XIX of the federal Social Security Act. Payments for services not covered by Medicare are taxable;\n(2) payments received for home health care services;\n(3) payments received from hospitals or surgical centers for goods and services on which liability for tax is imposed under section 295.52 or the source of funds for the payment is exempt under clause (1), (6), (9), (10), or (11);\n(4) payments received from the health care providers for goods and services on which liability for tax is imposed under this chapter or the source of funds for the payment is exempt under clause (1), (6), (9), (10), or (11);\n(5) amounts paid for legend drugs to a wholesale drug distributor who is subject to tax under section 295.52, subdivision 3, reduced by reimbursement received for legend drugs otherwise exempt under this chapter;\n(6) payments received from the behavioral health fund under chapter 254B;\n(7) payments received in the nature of charitable donations that are not designated for providing patient services to a specific individual or group;\n(8) payments received for providing patient services incurred through a formal program of health care research conducted in conformity with federal regulations governing research on human subjects. Payments received from patients or from other persons paying on behalf of the patients are subject to tax;\n(9) payments received from any governmental agency for services benefiting the public, not including payments made by the government in its capacity as an employer or insurer or payments made by the government for services provided under the MinnesotaCare program or the medical assistance program governed by title XIX of the federal Social Security Act, United States Code, title 42, sections 1396 to 1396v;\n(10) payments received under the federal Employees Health Benefits Act, United States Code, title 5, section 8909(f), as amended by the Omnibus Reconciliation Act of 1990. Enrollee deductibles, co-insurance, and co-payments are subject to tax;\n(11) payments received under the federal Tricare program, Code of Federal Regulations, title 32, section 199.17(a)(7). Enrollee deductibles, co-insurance, and co-payments are subject to tax; and\n(12) supplemental, enhanced, or uniform adjustment factor payments authorized under section 256B.196, 256B.197, or 256B.1973.\n(c) Payments received by wholesale drug distributors for legend drugs sold directly to veterinarians or veterinary bulk purchasing organizations are excluded from the gross revenues subject to the wholesale drug distributor tax under sections 295.50 to 295.59.\nIn addition to the exemptions allowed under subdivision 1, a staff model health plan company may deduct from its gross revenues for the year:\n(1) amounts paid to hospitals, surgical centers, and health care providers that are not employees of the staff model health plan company for services on which liability for the tax is imposed under section 295.52;\n(2) net amounts added to reserves, to the extent that the amounts added do not cause total reserves to exceed 200 percent of the statutory net worth requirement, the calculation of which may be determined on a consolidated basis, taking into account the amounts held in reserve by affiliated staff model health plan companies;\n(3) assessments for the comprehensive health insurance plan under section 62E.11; and\n(4) amounts spent for administration as reported as total administration to the Department of Health in the statement of revenues, expenses, and net worth pursuant to section 62D.08, subdivision 3, clause (a).\nA hospital, surgical center, health care provider, or wholesale drug distributor must not state the tax obligation under section 295.52 in a deceptive or misleading manner. It must not separately state tax obligations on bills provided to patients, consumers, or other payers when the amount received for the services or goods is not subject to tax.\nPharmacies that separately state the tax obligations on bills provided to consumers or to other payers who purchase legend drugs may state the tax obligation as the wholesale price of the legend drugs multiplied by the tax percentage specified in section 295.52. Pharmacies must not state the tax obligation based on the retail price.\nWhenever the commissioner determines that a person has engaged in any act or practice constituting a violation of this subdivision, the commissioner may bring an action in the name of the state in the district court of the appropriate county to enjoin the act or practice and to enforce compliance with this subdivision, or the commissioner may refer the matter to the attorney general or the county attorney of the appropriate county. Upon a proper showing, a permanent or temporary injunction, restraining order, or other appropriate relief must be granted.\n[Expired]\n(a) In addition to the exemptions allowed under subdivision 1, a hospital or health care provider may claim an annual credit against the total amount of tax, if any, the hospital or health care provider owes for that calendar year under sections 295.50 to 295.57. The credit shall equal 2.5 percent of revenues for patient services used to fund expenditures for qualifying research conducted by an allowable research program. The amount of the credit shall not exceed the tax liability of the hospital or health care provider under sections 295.50 to 295.57.\n(b) For purposes of this subdivision, the following requirements apply:\n(1) expenditures must be for program costs of qualifying research conducted by an allowable research program;\n(2) an allowable research program must be a formal program of medical and health care research conducted by an entity which is exempt under section 501(c)(3) of the Internal Revenue Code as defined in section 289A.02, subdivision 7, or is owned and operated under authority of a governmental unit;\n(3) qualifying research must:\n(A) be approved in writing by the governing body of the hospital or health care provider which is taking the deduction under this subdivision;\n(B) have as its purpose the development of new knowledge in basic or applied science relating to the diagnosis and treatment of conditions affecting the human body;\n(C) be subject to review by individuals with expertise in the subject matter of the proposed study but who have no financial interest in the proposed study and are not involved in the conduct of the proposed study; and\n(D) be subject to review and supervision by an institutional review board operating in conformity with federal regulations if the research involves human subjects or an institutional animal care and use committee operating in conformity with federal regulations if the research involves animal subjects. Research expenses are not exempt if the study is a routine evaluation of health care methods or products used in a particular setting conducted for the purpose of making a management decision. Costs of clinical research activities paid directly for the benefit of an individual patient are excluded from this exemption. Basic research in fields including biochemistry, molecular biology, and physiology are also included if such programs are subject to a peer review process.\n(c) No credit shall be allowed under this subdivision for any revenue received by the hospital or health care provider in the form of a grant, gift, or otherwise, whether from a government or nongovernment source, on which the tax liability under section 295.52 is not imposed.\n(d) The taxpayer shall apply for the credit under this section on the annual return under section 295.55, subdivision 5.\n(e) Beginning September 1, 2001, if the actual or estimated amount paid under this section for the calendar year exceeds $2,500,000, the commissioner of management and budget shall determine the rate of the research credit for the following calendar year to the nearest one-half percent so that refunds paid under this section will most closely equal $2,500,000. The commissioner of management and budget shall publish in the State Register by October 1 of each year the rate of the credit for the following calendar year. A determination under this section is not subject to the rulemaking provisions of chapter 14.\n[Repealed, 1997 c 225 art 3 s 23]",
	"repealed": false
}