{
	"id": "518A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.40",
	"title": "518A.40 CHILD CARE SUPPORT.",
	"text": "Unless otherwise agreed to by the parties and approved by the court, the court must order that work-related or education-related child care costs of joint children be divided between the obligor and obligee based on their proportionate share of the parties' combined monthly PICS. The amount of work-related or education-related child care costs required by this subdivision to be divided between the obligor and obligee is the total amount received by the child care provider from the obligee and any public agency for the joint child or children. Child care costs shall be adjusted by the amount of the estimated federal and state child care credit payable on behalf of a joint child. The Department of Human Services shall develop tables to calculate the applicable credit based upon the custodial parent's PICS.\n(a) If the obligor's PICS meets the income eligibility requirements for child care assistance under the basic sliding fee program under chapter 142E, the court must order the obligor to pay the lesser of the following amounts:\n(1) the amount of the obligor's monthly co-payment for child care assistance under the basic sliding fee schedule established by the commissioner of education under chapter 142E, based on an obligor's monthly PICS and the size of the obligor's household provided that the obligee is actually receiving child care assistance under the basic sliding fee program. For purposes of this subdivision, the obligor's household includes the obligor and the number of joint children for whom child support is being ordered; or\n(2) the amount of the obligor's child care obligation under subdivision 1.\n(b) The commissioner of children, youth, and families must publish a table with the child care assistance basic sliding fee amounts and update the table for changes to the basic sliding fee schedule by July 1 of each year.\n(a) The court must require verification of employment or school attendance and documentation of child care expenses from the obligee and the public authority, if applicable.\n(b) If child care expenses fluctuate during the year because of the obligee's seasonal employment or school attendance or extended periods of parenting time with the obligor, the court must determine child care expenses based on an average monthly cost.\n(c) The amount allocated for child care expenses is considered child support but is not subject to a cost-of-living adjustment under section 518A.75.\n(d) The court may allow the parent with whom the joint child does not reside to care for the joint child while the parent with whom the joint child resides is working or attending school, as provided in section 518.175, subdivision 8. Allowing the parent with whom the joint child does not reside to care for the joint child under section 518.175, subdivision 8, is not a reason to deviate from the guidelines.\n(a) Upon the request of the obligor when child care support is ordered to be paid, unless there is a protective or restraining order issued by the court regarding one of the parties or on behalf of a joint child, or the obligee is a participant in the Safe at Home program:\n(1) the obligee must give the child care provider the name and address of the obligor and must give the obligor the name, address, and telephone number of the child care provider;\n(2) by February 1 of each year, the obligee must provide the obligor with verification from the child care provider that indicates the total child care expenses paid for the previous year; and\n(3) when there is a change in the child care provider, the type of child care provider, or the age group of the child, the obligee must provide updated information to the obligor within 30 calendar days. If the obligee fails to provide the annual verification from the provider or updated information, the obligor may request the verification from the provider.\n(b) When the obligee is no longer incurring child care expenses, the obligee must notify the obligor, and the public authority if it provides child support services, that the child care expenses ended and on which date. If the public authority is providing services, the public authority must follow the procedure outlined in subdivision 4.\n(a) When a court order provides for child care expenses, and child care support is not assigned under section 518A.81, the public authority, if the public authority provides child support enforcement services, may suspend collecting the amount allocated for child care expenses when either party informs the public authority that no child care expenses are being incurred and:\n(1) the public authority verifies the accuracy of the information with the obligee; or\n(2) the obligee fails to respond within 30 days of the date of a written request from the public authority for information regarding child care costs. A written or oral response from the obligee that child care costs are being incurred is sufficient for the public authority to continue collecting child care expenses.\nThe suspension is effective as of the first day of the month following the date that the public authority either verified the information with the obligee or the obligee failed to respond.\nThe public authority will resume collecting child care expenses when either party provides information that child care costs are incurred, or when a child care support assignment takes effect under section 518A.81, subdivision 4. The resumption is effective as of the first day of the month after the date that the public authority received the information.\n(b) If the parties provide conflicting information to the public authority regarding whether child care expenses are being incurred, the public authority will continue or resume collecting child care expenses. Either party, by motion to the court, may challenge the suspension, continuation, or resumption of the collection of child care expenses under this subdivision. If the public authority suspends collection activities for the amount allocated for child care expenses, all other provisions of the court order remain in effect.\n(c) In cases where there is a substantial increase or decrease in child care expenses, the parties may modify the order under section 518A.39.\n(d) In cases where child care expenses have terminated, the parties may modify the order under section 518A.39.\n(e) When the public authority is providing child support services, the parties may contact the public authority about the option of a stipulation to modify or terminate the child care support amount.",
	"repealed": false
}