{
	"id": "484.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.74",
	"title": "484.74 ALTERNATIVE DISPUTE RESOLUTION.",
	"text": "In litigation involving an amount in excess of $7,500 in controversy, the presiding judge may, by order, direct the parties to enter nonbinding alternative dispute resolution. Alternatives may include private trials, neutral expert fact-finding, mediation, minitrials, and other forms of alternative dispute resolution. The guidelines for the various alternatives must be established by the presiding judge and must emphasize early and inexpensive exchange of information and case evaluation in order to facilitate settlement.\nThe judge shall appoint an impartial third-party neutral to conduct all proceedings held under subdivision 1. A party may file with the judge within five days of the notice of appointment of a neutral and serve on all other parties to the action a notice to remove the neutral. Upon receipt of the notice to remove, the judge shall assign another neutral. After a party has once disqualified a neutral as a matter of right, a substitute neutral may be disqualified by the party only by making an affirmative showing of prejudice to the judge.\nIn addition to the alternatives under subdivision 1, in cases where the amount in controversy exceeds $50,000, and with the consent of all of the parties, the presiding judge may submit to the parties a list of retired judges or qualified attorneys who are available to serve as special magistrates for binding proceedings under this subdivision. If the parties agree on selection of a person from the list, the presiding judge may appoint, by order, the person as a special magistrate. The special magistrate may preside over any pretrial and trial matters as determined by the presiding judge. If there is a right to a jury trial, the special magistrate shall conduct the jury trial pursuant to the rules of court and shall use the jury pool of the county in which the action is venued. The presiding judge may adopt the rulings and findings of the special magistrate and the results of any jury trial without modification. The parties have a right to appeal from the presiding judge's rulings and findings and from the jury verdict as in other civil matters.\nSubject to chapter 563, the special magistrate's fees and expenses must be borne by the parties on a basis determined to be fair and equitable by the presiding judge, upon recommendation by the special magistrate. The special magistrate may assess costs against a party for failure to comply with rules or orders, or for litigation that is frivolous or brought in bad faith.\nSubject to chapter 563, the neutral's fees and expenses must be borne by the parties on a basis determined to be fair and equitable by the presiding judge.\nThis section applies only to the Second and Fourth Judicial Districts, which will serve as pilot projects to evaluate the effectiveness of alternative forms of resolving commercial and personal injury disputes.",
	"repealed": false
}