{
	"id": "103B.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.305",
	"title": "103B.305 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103B.301 to 103B.355.\n\"Board\" means the Board of Water and Soil Resources.\n\"Comprehensive local water management plan,\" \"comprehensive water plan,\" \"local water plan,\" and \"local water management plan\" mean the plan adopted by a county under sections 103B.311 and 103B.315.\n\"Groundwater systems\" means the 14 principal aquifers of the state as defined by the United States Geological Survey in the Water-Resources Investigations 81-51, entitled \"Designation of Principal Water-Supply Aquifers in Minnesota\" (August 1981), and its revisions.\n\"Local units of government\" means municipalities, towns, counties, soil and water conservation districts, watershed districts, organizations formed for the joint exercise of powers under section 471.59, and other special purpose districts or authorities exercising authority in water and related land resources management at the local level.\n\"Municipality\" means a statutory or home rule charter city.\n\"Official controls\" means ordinances and regulations that control the physical development of the whole or part of a local government unit or that implement the general objectives of the local government unit.\n\"Plan authority\" means those local government units coordinating planning under sections 103B.301 to 103B.335.\n\"Priority concerns\" means issues, resources, subwatersheds, or demographic areas that are identified as a priority by the plan authority.\n\"Priority concerns scoping document\" means the list of the chosen priority concerns and a detailed account of how those concerns were identified and chosen.\n\"Related land resources\" means land affected by present or projected management practices that have significant effects on the quantity and quality, or use of groundwater or surface water.\n\"State review agencies\" means the Board of Water and Soil Resources, the Department of Agriculture, the Department of Health, the Department of Natural Resources, the Pollution Control Agency, and other agencies granted state review status by a resolution of the board.\n\"Watershed management organization\" has the meaning given in section 103B.205, subdivision 13.\n\"Watershed units\" means each of the 81 major watershed units identified in the state watershed boundaries map prepared pursuant to the requirements of Laws 1977, chapter 455, section 33, subdivision 7, paragraph (a), and the accompanying database, and the revisions of that database.",
	"repealed": false
}