{
	"id": "103G.287",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.287",
	"title": "103G.287 GROUNDWATER APPROPRIATIONS.",
	"text": "(a) Groundwater use permit applications are not complete until the applicant has supplied:\n(1) a water well record as required by section 103I.205, subdivision 9, information on the subsurface geologic formations penetrated by the well and the formation or aquifer that will serve as the water source, and geologic information from test holes drilled to locate the site of the production well;\n(2) the maximum daily, seasonal, and annual pumpage rates and volumes being requested;\n(3) information on groundwater quality in terms of the measures of quality commonly specified for the proposed water use and details on water treatment necessary for the proposed use;\n(4) the results of an aquifer test completed according to specifications approved by the commissioner. The test must be conducted at the maximum pumping rate requested in the application and for a length of time adequate to assess or predict impacts to other wells and surface water and groundwater resources. The permit applicant is responsible for all costs related to the aquifer test, including the construction of groundwater and surface water monitoring installations, and water level readings before, during, and after the aquifer test; and\n(5) the results of any assessments conducted by the commissioner under paragraph (c).\n(b) The commissioner may waive an application requirement in this subdivision if the information provided with the application is adequate to determine whether the proposed appropriation and use of water is sustainable and will protect ecosystems, water quality, and the ability of future generations to meet their own needs.\n(c) The commissioner shall provide an assessment of a proposed well needing a groundwater appropriation permit. The commissioner shall evaluate the information submitted as required under section 103I.205, subdivision 1, paragraph (e), and determine whether the anticipated appropriation request is likely to meet the applicable requirements of this chapter. If the appropriation request is likely to meet applicable requirements, the commissioner shall provide the person submitting the information with a letter or electronically transmitted notice providing preliminary approval to construct the well and the requirements, including test-well information, that will be needed to obtain the permit.\n(d) The commissioner must provide an applicant denied a groundwater use permit or issued a groundwater use permit that is reduced or restricted from the original request with all information the commissioner used in making the determination, including hydrographs, flow tests, aquifer tests, topographic maps, field reports, photographs, and proof of equipment calibration.\nGroundwater appropriations may be authorized only if they avoid known negative impacts to surface waters. If the commissioner determines that groundwater appropriations are having a negative impact to surface waters, the commissioner may use a sustainable diversion limit or other relevant method, tools, or information to implement measures so that groundwater appropriations do not negatively impact the surface waters.\nThe commissioner may establish water appropriation limits to protect groundwater resources. When establishing water appropriation limits to protect groundwater resources, the commissioner must consider the sustainability of the groundwater resource, including the current and projected water levels, cumulative withdrawal rates from the resource on a monthly or annual basis, water quality, whether the use protects ecosystems, and the ability of future generations to meet their own needs. The commissioner may consult with the commissioners of health, agriculture, and the Pollution Control Agency and other state entities when determining the impacts on water quality and quantity.\n(a) The commissioner may designate groundwater management areas and limit total annual water appropriations and uses within a designated area to ensure sustainable use of groundwater that protects ecosystems, water quality, and the ability of future generations to meet their own needs. Water appropriations and uses within a designated management area must be consistent with a groundwater management area plan approved by the commissioner that addresses water conservation requirements and water allocation priorities established in section 103G.261. At least 30 days prior to implementing or modifying a groundwater management area plan under this subdivision, the commissioner shall consult with the advisory team established in paragraph (c).\n(b) Notwithstanding section 103G.271, subdivision 1, paragraph (b), and Minnesota Rules, within designated groundwater management areas, the commissioner may require general permits as specified in section 103G.271, subdivision 1, paragraph (c), for water users using less than 10,000 gallons per day or 1,000,000 gallons per year and water suppliers serving less than 25 persons for domestic purposes. The commissioner may waive the requirements under section 103G.281 for general permits issued under this paragraph, and the fee specified in section 103G.301, subdivision 2, paragraph (c), does not apply to general permits issued under this paragraph.\n(c) When designating a groundwater management area, the commissioner shall assemble an advisory team to assist in developing a groundwater management area plan for the area. The advisory team members shall be selected from public and private entities that have an interest in the water resources affected by the groundwater management area. A majority of the advisory team members shall be public and private entities that currently hold water-use permits for water appropriations from the affected water resources. The commissioner shall consult with the League of Minnesota Cities, the Association of Minnesota Counties, the Minnesota Association of Watershed Districts, and the Minnesota Association of Townships in appointing the local government representatives to the advisory team. The advisory team may also include representatives from the University of Minnesota, the Minnesota State Colleges and Universities, other institutions of higher learning in Minnesota, political subdivisions with jurisdiction over water issues, nonprofits with expertise in water, and federal agencies.\nThe commissioner may issue water-use permits for appropriation from groundwater only if the commissioner determines that the groundwater use is sustainable to supply the needs of future generations and the proposed use will not harm ecosystems, degrade water, or reduce water levels beyond the reach of public water supply and private domestic wells constructed according to Minnesota Rules, chapter 4725.",
	"repealed": false
}