{
	"id": "473.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.351",
	"title": "473.351 METROPOLITAN AREA REGIONAL PARKS FUNDING.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Implementing agency\" means the counties of Anoka, Washington, Ramsey, Scott, Carver, Dakota, the city of St. Paul, the city of Bloomington, the Minneapolis Park and Recreation Board, and the Three Rivers Park District.\n(b) \"Operation and maintenance expenditures\" means the cost of providing for the operation and maintenance of waters, lands, and facilities that are a part of the metropolitan area regional park and open space system, including but not limited to, the provision of fire, police, maintenance, forestry, rehabilitation expenses pertaining to routine care, and the allocation of the administrative overhead costs of the regional park and open space systems.\n(c) \"Operation and maintenance money\" means money appropriated by the legislature to the commissioner of employment and economic development for distribution by the Metropolitan Council.\n(d) \"Regional recreation open space systems\" means those parks that have been designated by the Metropolitan Council under section 473.145.\nAnnually before August 1 the Metropolitan Council shall distribute grant money received from the commissioner of natural resources to fund the operation and maintenance expenditures of the implementing agencies for the operation and maintenance of regional park and open space systems. The Metropolitan Council shall annually report to the legislature the amount distributed to each implementing agency and its estimate of the percentage of operation and maintenance expenditures paid for with operation and maintenance money.\nBy July 1 of every year each implementing agency must submit to the Metropolitan Parks and Open Space Commission a statement of the next annual anticipated operation and maintenance expenditures of the regional recreation open space parks systems within their respective jurisdictions and the previous year's actual expenditures. After reviewing the actual expenditures submitted and by July 15 of each year, the parks and open space commission shall forward to the Metropolitan Council the funding requests from the implementing agencies based on the actual expenditures made. The Metropolitan Council shall distribute the operation and maintenance money as follows:\n(1) 40 percent based on the use that each implementing agency's regional recreation open space system has in proportion to the total use of the metropolitan regional recreation open space system;\n(2) 40 percent based on the operation and maintenance expenditures made in the previous year by each implementing agency in proportion to the total operation and maintenance expenditures of all of the implementing agencies; and\n(3) 20 percent based on the acreage that each implementing agency's regional recreation open space system has in proportion to the total acreage of the metropolitan regional recreation open space system. The 80 percent natural resource management land acreage of the park reserves must be divided by four in calculating the distribution under this clause.\nEach implementing agency must receive no less than 40 percent of its actual operation and maintenance expenses to be incurred in the current calendar year budget as submitted to the parks and open space commission. If the available operation and maintenance money is less than the total amount determined by the formula including the preceding, the implementing agencies will share the available money in proportion to the amounts they would otherwise be entitled to under the formula.\nThis section does not affect, change, alter, transfer, or modify the governance, administration, jurisdiction, or control of the implementing agencies over the parks, water, lands, and facilities they presently or in the future may administer, govern, or control, nor the employment relationship between the implementing agencies and their present and future employees.\nMS 1986 [Repealed, 1987 c 404 s 191]\nA metropolitan area regional park receiving grant money for maintenance and operation costs must agree:\n(1) to sell or promote licenses, passes, or registrations required to engage in recreational activities appropriate to the park or the site of the park when a building on the park site is staffed and open to the public; and\n(2) to provide drinking water supplies adequate for the recreational uses of the park. Each implementing agency must consult with groups representing users of its parks to determine the adequacy of drinking water supplies.",
	"repealed": false
}