{
	"id": "84.795",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.795",
	"title": "84.795 OPERATION REQUIREMENTS; LOCAL REGULATION.",
	"text": "(a) A person may not operate an off-highway motorcycle within the right-of-way of a town road or a trunk, county state-aid, or county highway in this state unless the right-of-way encompasses:\n(1) a trail administered by the commissioner and designated for off-highway motorcycle use or multiple use; or\n(2) a corridor access trail designated under paragraph (b).\n(b) A road authority, as defined in section 160.02, subdivision 25, may designate, with the approval of the commissioner, corridor access trails on public road rights-of-way for gaining access to established off-highway motorcycle trails.\n(c) A person may not operate an off-highway motorcycle upon a trunk, county state-aid, or county highway in this state unless the vehicle is equipped with at least one headlight and one taillight, each of minimum candlepower as prescribed by rule of the commissioner, and with brakes conforming to standards prescribed by rule of the commissioner, all of which are subject to the approval of the commissioner of public safety.\n(d) A person may not operate an off-highway motorcycle at any time within the right-of-way of an interstate highway or freeway within this state.\n(a) A person operating an off-highway motorcycle may make a direct crossing of a public road right-of-way provided:\n(1) the crossing is made at an angle of approximately 90 degrees to the direction of the road and at a place where no obstruction prevents a quick and safe crossing;\n(2) the off-highway motorcycle is brought to a complete stop before crossing the shoulder or main-traveled way of the road;\n(3) the driver yields the right-of-way to all oncoming traffic that constitutes an immediate hazard;\n(4) in crossing a divided road, the crossing is made only at an intersection of the road with another public road; and\n(5) if the crossing is made between the hours of one-half hour after sunset to one-half hour before sunrise or in conditions of reduced visibility, only if both front and rear lights are on.\n(b) Chapters 169 and 169A apply to the operation of off-highway motorcycles upon streets and highways, except for those provisions relating to required equipment and those provisions that by their nature have no application.\nSubdivisions 1 and 2 do not apply to vehicles registered for public road use under chapter 168 when being operated on a traveled portion of a public road.\nA person may not drive or operate an off-highway motorcycle:\n(1) at a rate of speed greater than reasonable or proper under the surrounding circumstances;\n(2) in a careless, reckless, or negligent manner so as to endanger or to cause injury or damage to the person or property of another;\n(3) in a tree nursery or planting in a manner that damages or destroys growing stock;\n(4) without a brake operational by either hand or foot;\n(5) at a speed exceeding ten miles per hour on the frozen surface of public waters within 100 feet of a person fishing or a fishing shelter; or\n(6) in a manner that violates operation rules adopted by the commissioner.\nA person may not operate or be in control of an off-highway motorcycle anywhere in this state or on the ice of any boundary water of this state while under the influence of alcohol or a controlled substance, as provided in section 169A.20, and is subject to sections 169A.50 to 169A.53 or 171.177.\nA person may not drive or operate an off-highway motorcycle on an airport defined in section 360.013, subdivision 39.\n(a) Nothing in this section or chapter 169 prohibits the use of off-highway motorcycles within the right-of-way of a state trunk or county state-aid highway or upon public lands or waters under the jurisdiction of the commissioner of natural resources, in an organized contest or event, subject to the consent of the official or board having jurisdiction over the highway or public lands or waters.\n(b) In permitting the contest or event, the official or board having jurisdiction may prescribe restrictions, conditions, or permit revocation procedures, as the official or board considers advisable.\nA county, city, or town, acting through its governing body, may regulate the operation of off-highway motorcycles on public lands, waters, and property under its jurisdiction other than public road rights-of-way within its boundaries, by resolution or ordinance of the governing body and by giving appropriate notice, provided that:\n(1) the regulations must be consistent with sections 84.787 to 84.795 and rules adopted under section 84.79;\n(2) an ordinance may not impose a fee for the use of public land or water under the jurisdiction of either the Department of Natural Resources or another agency of the state, or for the use of an access to it owned by the state, a county, or a city; and\n(3) an ordinance may not require an off-highway motorcycle operator to possess a motor vehicle driver's license while operating an off-highway motorcycle.",
	"repealed": false
}