{
	"id": "97B.671",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.671",
	"title": "97B.671 PREDATOR-CONTROL PROGRAM.",
	"text": "If the commissioner determines that predators are damaging domestic or wild animals and further damage can be prevented, the commissioner shall authorize the taking of the predators by predator controllers. The commissioner shall define the area where the predators may be taken, the objectives to be achieved, procedures for notifying predator controllers, payments to be made, the methods to be used, and when the predator control shall cease.\n(a) The commissioner shall certify a person as a predator controller if the person has not violated a provision of this section and meets qualifications of experience, ability, and reliability. The commissioner shall establish application procedures, prescribe forms, and maintain a list of predator controllers. The application procedures must include reports from conservation officers and other department field personnel as to the ability and reliability of the applicants.\n(b) The commissioner may revoke a certification if the predator controller violates a provision of sections 97B.601 to 97B.671 or 97B.901 to 97B.945 or a rule of the commissioner relating to fur-bearing animals.\nThe commissioner shall pay a predator controller the amount the commissioner determines by written order published in the State Register for each coyote and fox taken. The commissioner may require the predator controller to submit proof of the taking and a signed statement concerning the predators taken. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(a) The commissioner shall provide a wolf-control training program for certified predator controllers participating in wolf control.\n(b) After the wolf is delisted under the federal Endangered Species Act of 1973, in zone B, as defined under section 97B.645, subdivision 12, if the commissioner, after considering recommendations from an extension agent or conservation officer, has verified that livestock, domestic animals, or pets were destroyed by a wolf within the previous five years, and if the livestock, domestic animal, or pet owner requests wolf control, the commissioner shall open a predator-control area for wolves.\n(c) After the wolf is delisted under the federal Endangered Species Act of 1973, in zone A, as defined under paragraph (g), if the commissioner, after considering recommendations from an extension agent or conservation officer, verifies that livestock, domestic animals, or pets were destroyed by a wolf, and if the livestock, domestic animal, or pet owner requests wolf control, the commissioner shall open a predator-control area for wolves for up to 60 days.\n(d) A predator-control area opened for wolves may not exceed a one-mile radius surrounding the damage site.\n(e) The commissioner shall pay a certified wolf predator controller the amount the commissioner determines by written order published in the State Register for each wolf taken. The certified wolf predator controller must dispose of unsalvageable remains as directed by the commissioner. All salvageable wolf remains must be surrendered to the commissioner. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(f) The commissioner may, in consultation with the commissioner of agriculture, develop a cooperative agreement for wolf-control activities with the United States Department of Agriculture. The cooperative agreement activities may include, but not be limited to, wolf control, training for state predator controllers, and control monitoring and record keeping.\n(g) For the purposes of this subdivision, \"zone A\" means that portion of the state lying outside of zone B, as defined under section 97B.645, subdivision 12.",
	"repealed": false
}