{
	"id": "412.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.02",
	"title": "412.02 CITY ELECTIONS; OFFICERS, TERMS, VACANCIES, CITY EMPLOYEES.",
	"text": "The following officers shall be elected for the terms and in the years shown and in the cities described in the table.\nNeither the mayor nor any city council member may be employed by the city. For purposes of this subdivision, \"employed\" refers to full-time permanent employment as defined by the city's employment policy.\nTerms of elective officers shall commence on the first Monday in January following the election at which the officer is chosen. All officers chosen and qualified as such shall hold office until their successors qualify.\nExcept as otherwise provided in subdivision 2b, a vacancy in an office shall be filled by council appointment until an election is held as provided in this subdivision. In case of a tie vote in the council, the mayor shall make the appointment. If the vacancy occurs before the first day to file affidavits of candidacy for the next regular city election and more than two years remain in the unexpired term, a special election shall be held at or before the next regular city election and the appointed person shall serve until the qualification of a successor elected at a special election to fill the unexpired portion of the term. If the vacancy occurs on or after the first day to file affidavits of candidacy for the regular city election or when less than two years remain in the unexpired term, there need not be a special election to fill the vacancy and the appointed person shall serve until the qualification of a successor. The council must specify by ordinance under what circumstances it will hold a special election to fill a vacancy other than a special election held at the same time as the regular city election.\nAll of the provisions of the Minnesota Election Law are applicable to special elections as far as practicable.\nA vacancy in the office of mayor or council member may be declared by the council when the officeholder is unable to serve in the office or attend council meetings for a 90-day period because of illness, or because of absence from or refusal to attend council meetings for a 90-day period. If any of the preceding conditions occurs, the council may, after it has by resolution declared a vacancy to exist, fill the vacancy at a regular or special council meeting for the remainder of the unexpired term, or until the person is again able to resume duties and attend council meetings, whichever is earlier. When the person is again able to resume duties and attend council meetings, the council shall by resolution remove the temporary officeholder and restore the original officeholder.\n(a) In cities operating under the standard plan of government the council may by ordinance adopted at least 60 days before the next regular city election combine the offices of clerk and treasurer in the office of clerk-treasurer, but such an ordinance shall not be effective until the expiration of the term of the incumbent treasurer or when an earlier vacancy occurs. After the effective date of the ordinance, the duties of the treasurer and deputy treasurer as prescribed by this chapter shall be performed by the clerk-treasurer or a duly appointed deputy. The offices of clerk and treasurer may be reestablished by ordinance.\n(b) If the offices of clerk and treasurer are combined as provided by this section and the city's annual revenue for all governmental and enterprise funds combined is more than the amount in paragraph (c), the council shall provide for an annual audit of the city's financial affairs by the state auditor or a public accountant in accordance with minimum auditing procedures prescribed by the state auditor. If the offices of clerk and treasurer are combined and the city's annual revenue for all governmental and enterprise funds combined is the amount in paragraph (c), or less, the council shall provide for an audit of the city's financial affairs by the state auditor or a public accountant in accordance with minimum audit procedures prescribed by the state auditor at least once every five years, which audit shall be for a one-year period to be determined at random by the person conducting the audit.\n(c) For the purposes of paragraph (b), the amount in 2004 is $150,000, and in 2005 and after, $150,000 adjusted for inflation using the annual implicit price deflator for state and local expenditures as published by the United States Department of Commerce.\nMS 1971 [Repealed, 1973 c 34 s 7]\nMS 1982 [Repealed, 1983 c 359 s 151]\nThe council may by ordinance adopted at least 60 days before the next regular city election submit to the voters of the city the question of whether the city council should be increased or reduced to seven or five members. The ordinance shall include a schedule of elections and terms and ward boundary changes, if applicable, to accomplish the change. The proposal shall be voted on at the next city general election and, if approved by a majority of those voting on the question, go into effect in accordance with the schedule and ward boundaries, if applicable.\n(a) A city may adopt an ordinance to elect its city council members by ward in the following circumstances:\n(1) if the ordinance is submitted to the voters of the city for approval at a regular or special election, and the ordinance is adopted at least 180 days before that election; or\n(2) when approved or ordered to do so by a court of competent jurisdiction acting in response to a challenge to the city's method of conducting elections.\n(b) If the city is petitioned by at least 15 percent of the electors voting at the last previous city election asking that the question of city council member election by ward be put to the voters of the city, the city must adopt an ordinance for that purpose and submit the ordinance to the voters of the city for approval at a regular or special election.\n(c) An ordinance must designate the boundaries of the wards. The ordinance must also state whether the city will otherwise operate as a statutory standard plan city or statutory optional plan city, subject to voter approval as may be required under this chapter. If submitted to the voters by ballot question, the ordinance shall go into effect at the next regular city election if it is approved by a majority of those voting on the question. Except as provided by this subdivision, section 205.10 applies to a ballot question submitted to the voters at a special election under this subdivision.\n(d) A city that elects its council members by ward is subject to the requirements of sections 204B.135 and 205.84.",
	"repealed": false
}