{
	"id": "354.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.55",
	"title": "354.55 OPTIONS TO CERTAIN MEMBERS.",
	"text": "[Repealed, 1974 c 289 s 59]\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 1974 c 289 s 59]\n[Repealed, 1989 c 319 art 2 s 28]\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 1974 c 289 s 59]\n[Repealed, 1974 c 289 s 59]\n[Repealed, 1974 c 289 s 59]\nMS 2018 [Repealed, 2020 c 108 art 8 s 9]\n(a) Any person covered under section 354.44, subdivision 6, who ceases to render teaching service, may leave the person's accumulated deductions in the fund for the purpose of receiving a deferred annuity at retirement.\n(b) The deferred retirement annuity of any former member must be augmented from the first day of the month following the termination of active service to the effective date of retirement.\n(c) No augmentation is creditable if the deferral period is less than three months or if deferral commenced before July 1, 1971.\n(d) For persons who became covered employees before July 1, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) five percent until January 1, 1981;\n(2) three percent from January 1, 1981, until January 1 of the year following the year in which the deferred annuitant attains age 55 or June 30, 2012, whichever is earlier;\n(3) five percent from the date established in clause (2) until June 30, 2012;\n(4) two percent from July 1, 2012, until June 30, 2019; and\n(5) after June 30, 2019, the deferred annuity must not be augmented.\n(e) For persons who become covered employees after June 30, 2006, the annuity must be augmented at the following rate or rates, compounded annually:\n(1) 2.5 percent until June 30, 2012;\n(2) two percent from July 1, 2012, until June 30, 2019; and\n(3) after June 30, 2019, the deferred annuity must not be augmented.\n(f) In no case may the annuity payable under this subdivision be less than the amount of annuity payable under section 354.44, subdivision 6.\n(g) The requirements and provisions for retirement before normal retirement age contained in section 354.44, subdivision 6, also apply to an employee fulfilling the requirements with a combination of service as provided in section 356.311.\n(h) The augmentation provided by this subdivision applies to the benefit provided in section 354.46, subdivision 2.\n(i) The augmentation provided by this subdivision does not apply to any period in which a person is on an approved leave of absence from an employer unit covered by the provisions of this chapter.\n(j) The retirement annuity or disability benefit of, or the survivor benefit payable on behalf of, a former teacher who terminated service before July 1, 1997, which is not first payable until after June 30, 1997, must be increased on an actuarial equivalent basis to reflect the change in the investment return actuarial assumption under section 356.215, subdivision 8, from five percent to six percent under a calculation procedure and tables adopted by the board as recommended by an approved actuary and approved by the actuary retained under section 356.214.\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 2015 c 68 art 13 s 65]\n[Repealed, 2009 c 169 art 1 s 77; art 4 s 51]\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 2015 c 68 art 13 s 65]\nTeachers who retire after June 30, 1973 and who failed to make an election pursuant to Minnesota Statutes 1971, section 354.145, subdivision 1, clause (1) and subdivision 2, clause (1) shall have their annuity at retirement computed under section 354.44, subdivision 2 or 6, whichever is larger.\n(1) Teachers who retired after June 30, 1972 and before July 1, 1973 who failed to make an election pursuant to Minnesota Statutes 1971, section 354.145, subdivision 1, clause (1) shall have their annuity recomputed under the law in effect on June 30, 1973 under the provisions of either Minnesota Statutes 1971, section 354.33, subdivision 1 or 7, whichever is larger.\n(2) Teachers who retired after June 30, 1972 and before July 1, 1973 and who failed to make an election pursuant to Minnesota Statutes 1971, section 354.145, subdivision 2, clause (1) shall have their annuity recomputed under the law in effect on June 30, 1973 under the provisions of either section 354.44, subdivision 2 or 6, whichever is larger.\n[Repealed, 2015 c 68 art 13 s 65]",
	"repealed": false
}