{
	"id": "116P.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.08",
	"title": "116P.08 TRUST FUND EXPENDITURES.",
	"text": "(a) Money in the trust fund may be spent only for:\n(1) the reinvest in Minnesota program as provided in section 84.95, subdivision 2;\n(2) research that contributes to increasing the effectiveness of protecting or managing the state's environment or natural resources;\n(3) collection and analysis of information that assists in developing the state's environmental and natural resources policies;\n(4) enhancement of public education, awareness, and understanding necessary for the protection, conservation, restoration, and enhancement of air, land, water, forests, fish, wildlife, and other natural resources;\n(5) capital projects for the preservation and protection of unique natural resources;\n(6) activities that preserve or enhance fish, wildlife, land, air, water, and other natural resources that otherwise may be substantially impaired or destroyed in any area of the state;\n(7) administrative and investment expenses incurred by the State Board of Investment in investing deposits to the trust fund; and\n(8) administrative expenses subject to the limits in section 116P.09.\n(b) In making recommendations for expenditures from the trust fund, the commission shall give priority to funding programs and projects under paragraph (a), clauses (1) and (6). Any requests for proposals issued by the commission shall clearly indicate these priorities.\nMoney from the trust fund may not be spent for:\n(1) purposes of environmental compensation and liability under chapter 115B and response actions under chapter 115C;\n(2) purposes of municipal water pollution control in municipalities with a population of 5,000 or more under the authority of chapters 115 and 116;\n(3) costs associated with the decommissioning of nuclear power plants;\n(4) hazardous waste disposal facilities;\n(5) solid waste disposal facilities;\n(6) projects or purposes inconsistent with the strategic plan; or\n(7) acquiring property by eminent domain, unless the owner requests that the owner's property be acquired by eminent domain.\n(a) The commission shall adopt a strategic plan for making expenditures from the trust fund, including identifying the priority areas for funding for the next six years. The strategic plan must be reviewed every two years. The strategic plan must have clearly stated short- and long-term goals and strategies for trust fund expenditures, must provide measurable outcomes for expenditures, and must determine areas of emphasis for funding.\n(b) The commission shall consider the long-term strategic plans of agencies with environment and natural resource programs and responsibilities and plans of conservation and environmental organizations during the development and review of the strategic plan.\n(a) Funding may be provided only for those projects that meet the categories established in subdivision 1.\n(b) The commission must recommend an annual or biennial legislative bill to make appropriations from the trust fund for the purposes provided in subdivision 1. The recommendations must be submitted to the governor for inclusion in the biennial budget and supplemental budget submitted to the legislature.\n(c) The commission may recommend regional block grants for a portion of trust fund expenditures to partner with existing regional organizations that have strong citizen involvement, to address unique local needs and capacity, and to leverage all available funding sources for projects.\n(d) The commission may recommend the establishment of an emerging issues account in its legislative bill for funding emerging issues, which come up unexpectedly, but which still adhere to the commission's strategic plan, to be approved by the governor after initiation and recommendation by the commission.\n(e) Money in the trust fund may not be spent except under an appropriation by law.\n(a) Meetings of the commission, committees or subcommittees of the commission, technical advisory committees, and peer reviewers must be open to the public and are subject to chapter 13D. The commission shall attempt to meet throughout various regions of the state during each biennium. For purposes of this subdivision, a meeting occurs when a quorum is present and action is taken regarding a matter within the jurisdiction of the commission, a committee or subcommittee of the commission, a technical advisory committee, or peer reviewers.\n(b) For legislative members of the commission, enforcement of this subdivision is governed by section 3.055, subdivision 2. For nonlegislative members of the commission, enforcement of this subdivision is governed by section 13D.06, subdivisions 1 and 2.\n(a) Research proposals must include a stated purpose directly connected to the trust fund's constitutional mandate, this chapter, and the adopted strategic plan under subdivision 3, a timeline, potential outcomes, and an explanation of the need for the research. All research proposals must be peer reviewed before receiving an appropriation.\n(b) In conducting research proposal reviews, the peer reviewers shall:\n(1) comment on the methodology proposed and whether it can be expected to yield appropriate and useful information and data; and\n(2) comment on the need for the research and about similar existing information available, if any.\n(c) Peer reviewers' comments under paragraph (b) must be reported to the commission.\n(d) The peer reviewers may review completed research proposals that have received an appropriation and comment and report upon whether the project reached the intended goals.\n(a) The peer reviewers must be knowledgeable in general research methods in the areas of environment and natural resources.\n(b) Compensation of peer reviewers is governed by section 15.059, subdivision 3.",
	"repealed": false
}