{
	"id": "347.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.37",
	"title": "347.37 PUBLIC ACCESS; NOTICE; INSPECTION; ENFORCEMENT.",
	"text": "The Board of Animal Health shall cause to be inspected from time to time all kennels and dealers licensed hereunder and all records required by sections 347.31 to 347.40 to be kept by the licensees.\nAny duly authorized agent of the board, any sheriff, or sheriff's deputy, or police officer, or humane agent appointed pursuant to section 343.01 is granted the power and the authority to enter upon the premises of any kennel or dealer at any time during the daylight hours for the purposes herein set forth, and for the purposes of inspecting the compliance with the provisions of sections 346.55, 347.31 to 347.40 and the rules issued pursuant thereto, and for the purposes of enforcing sections 346.55, or 347.31 to 347.40; except that humane agents shall not enter upon the premises of a licensed veterinarian acting as a kennel.\nEach dealer shall post a conspicuous notice in a format no less than 24 by 36 inches and easily readable by the general public, that states: (1) that the person is a licensed dealer in dogs and cats; (2) that dogs and cats left with the dealer may be used for research purposes; and (3) the hours the dealer is open to the public. The notice must be placed in at least two locations on the premises, one of which must be on or near the exterior mail delivery point and one of which must be at the regularly used point of exchange of dogs and cats. A person may view dogs and cats in the custody of a dealer during the time the premises is open to the public. Dealers are required to be open to the public on a regular basis at least four hours between 7:00 a.m. and 10:00 p.m. on at least four of the seven days of each week including at least one Saturday or Sunday. Any advertisement placed by a dealer seeking dogs or cats must inform the public that dogs and cats brought to the dealer may be used for research purposes.",
	"repealed": false
}