{
	"id": "17.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.03",
	"title": "17.03 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall encourage and promote the development of agricultural industries, investigate marketing conditions affecting the marketing of farm products, and assist farmers, producers, and consumers in the organization and management of cooperative enterprises and the cooperative marketing of farm products; advise and assist in the location and establishment of local markets when the commissioner determines that the public necessity or the welfare of the community requires such markets, if satisfied that such markets will be successfully operated by a cooperative company or municipality. It shall be the duty of the Department of Agriculture and the University of Minnesota to cooperate in all ways that may be beneficial to the agricultural interests of the state. It is intended that police and organizational powers in reference to agriculture shall be exercised by the state Department of Agriculture and that the University of Minnesota shall retain its present powers and duties relating to obtaining and disseminating agricultural information and conducting agricultural research, and shall retain custody of scientific collections.\n[Repealed, 2014 c 181 s 14]\n(a) The commissioner shall cooperate with the government of the United States, with financial agencies created to assist in the development of the agricultural resources of this state, and so far as practicable may use the facilities provided by the existing state departments and the various state and local organizations. This subdivision is intended to relate to every function and duty which devolves upon the commissioner.\n(b) The commissioner may apply for, receive, and disburse federal funds made available to the state by federal law or regulation for any purpose related to the powers and duties of the commissioner. All money received by the commissioner under this paragraph shall be deposited in the state treasury and is appropriated to the commissioner for the purposes for which it was received. Money made available under this paragraph may be paid pursuant to applicable federal regulations and rate structures. Money received under this paragraph does not cancel and is available for expenditure according to federal law. The commissioner may contract with and enter into grant agreements with persons, organizations, educational institutions, firms, corporations, other state agencies, and any agency or instrumentality of the federal government to carry out agreements made with the federal government relating to the expenditure of money under this paragraph. Bid requirements under chapter 16C do not apply to contracts under this paragraph.\nThe commissioner is authorized to publish, from time to time, such marketing or other information as may be deemed necessary to the welfare of agriculture, and to that end may investigate marketing or other conditions relating to agriculture in this and in other states, and to make these investigations public in such manner as shall in the commissioner's judgment be most effective.\n[Repealed, 1987 c 312 art 1 s 25; 1987 c 396 art 10 s 7]\nThe commissioner of agriculture and the commissioner of employment and economic development shall cooperate with each other to promote the beneficial agricultural interests of the state. The commissioner of agriculture has primary responsibility for promoting state agricultural interests to international markets. The commissioner of agriculture is also responsible for the promotion of national trade programs related to international marketing. The commissioner of agriculture has primary responsibility for promoting the agriculture interests of producers, promoting state agricultural markets, and promoting agricultural interests of the state in cooperative production and marketing efforts with other states and the United States Department of Agriculture. The commissioner of agriculture is also responsible for promoting the national and international marketing of state agricultural products.\nThe commissioner shall establish a program of agricultural diversification. The commissioner must assist the horticultural industry, help producers diversify farming operations, and coordinate state agency efforts regarding agricultural diversification, after consulting with farm groups, the University of Minnesota, and applicable institutions of higher learning. The commissioner shall report to the governor and legislature annually on activities and actions that should be taken in these matters.\n(a) The commissioner shall devise means of advancing the production and marketing of nontraditional agricultural products of the state. The commissioner shall also seek the cooperation and involvement of every department or agency of the state, and such public and nonpublic organizations as the commissioner deems appropriate, for the promotion of nontraditional agricultural products.\n(b) The production and marketing of nontraditional agricultural products are considered agricultural pursuits.\n(c) Except as otherwise provided in law, the commissioner may adopt appropriate rules concerning health standards for nontraditional agriculture.\n(d) Except as otherwise provided in law, the slaughter of all meat producing animals, fowl, or fish that are nontraditional agriculture intended for sale in commercial outlets must occur at an inspected slaughterhouse.\n(e) Except as otherwise provided in law, it is the responsibility of an owner to take all reasonable actions to maintain the nontraditional agriculture on property owned or leased by the owner, including the construction of fences, enclosures, or other barriers, and housing of a suitable design.\n(f) For purposes of this subdivision, \"nontraditional agriculture\" and \"nontraditional agricultural products\" includes but is not limited to aquaculture as defined in section 17.47, subdivision 2, and the production of animals domesticated from wild stock, either native or nonnative, that are kept in confinement by the owner.\n[Repealed, 2003 c 128 art 13 s 40]\n(a) The department may charge a fee for farm crisis assistance services it provides to persons outside of the department.\n(b) The state is not liable for the actions of persons under contract with the department who provide farm crisis assistance services as part of their contractual duties. Persons who provide farm crisis assistance are not subject to liability for their actions that are within the scope of their contract. The immunity from liability in this subdivision is in addition to and not a limitation of immunity otherwise accorded to the state and its contractors under law.\n(c) Fees collected by the department under this subdivision must be deposited in the general fund.\n(d) Persons under contract with the department to provide farm crisis assistance are not employees of the state.\n(a) The commissioner may accept for and on behalf of the state any gift, bequest, devise, grant, or interest in money or personal property of any kind tendered to the state for any purpose pertaining to the activities of the Department of Agriculture or any of its divisions.\n(b) The commissioner may charge a fee for reports, publications, or other promotional or informational material produced by the Department of Agriculture. The commissioner may solicit and accept advertising revenue for any departmental publications or promotional materials.\n(c) The fees collected by the commissioner under this section are to recover all or part of the costs of providing services for which the fees are paid.\n(d) Money received by the commissioner for these activities may be credited to one or more special accounts in the state treasury. Money in those special accounts is annually appropriated to the commissioner to provide the services for which the money was received.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.\n(a) It is the goal of the Department of Agriculture that environmental and resource management permits be issued or denied within 150 days of the submission of a completed permit application. The commissioner of agriculture shall establish management systems designed to achieve the goal.\n(b) The commissioner shall prepare an annual permitting efficiency report that includes statistics on meeting the goal in paragraph (a). The report is due February 1 of each year. For permit applications that have not met the goal, the report must state the reasons for not meeting the goal, steps that will be taken to complete action on the application, and the expected timeline. In stating the reasons for not meeting the goal, the commissioner shall separately identify delays caused by the responsiveness of the proposer, lack of staff, scientific or technical disagreements, or the level of public engagement. The report must specify the number of days from initial submission of the application to the day of determination that the application is complete. The report must aggregate the data for the year and assess whether program or system changes are necessary to achieve the goal. The report must be posted on the department website and submitted to the governor and the chairs of the house of representatives and senate committees having jurisdiction over agriculture policy and finance.\n(c) The commissioner shall allow electronic submission of environmental review and permit documents to the department.\nThe commissioner may accept money as part of a contract with any public or private entity to provide statutorily prescribed services by the department. A contract must specify the services to be provided by the department and the amount and method of reimbursement. Money generated in a contractual agreement under this section must be deposited in a special revenue fund and is appropriated to the department for purposes of providing services specified in the contracts. Contracts under this section must be processed in accordance with section 16C.05.\n(a) The commissioner shall submit to the legislative committees having jurisdiction over appropriations from the agricultural fund in section 16A.531 reports on the amount of revenue raised in each fee account within the fund, the expenditures from each account, and the purposes for which the expenditures were made. The reports must be issued in February and November each year, to coincide with the forecasts of revenue and expenditures prepared under section 16A.103.\n(b) The report delivered in February of each year must include the commissioner's recommendations, if any, for changes in statutes relating to the fee accounts of the agricultural fund.",
	"repealed": false
}