{
	"id": "609.7495",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.7495",
	"title": "609.7495 PHYSICAL INTERFERENCE WITH SAFE ACCESS TO HEALTH CARE.",
	"text": "For the purposes of this section, the following terms have the meanings given them.\n(a) \"Facility\" means any of the following:\n(1) a hospital or other health institution licensed under sections 144.50 to 144.56;\n(2) a medical facility as defined in section 144.561;\n(3) an agency, clinic, or office operated under the direction of or under contract with the commissioner of health or a community health board, as defined in section 145A.02;\n(4) a facility providing counseling regarding options for medical services or recovery from an addiction;\n(5) a facility providing emergency shelter services for battered women, as defined in section 611A.31, subdivision 3, or a facility providing transitional housing for battered women and their children;\n(6) a facility as defined in section 260E.03, subdivision 6;\n(7) a facility as defined in section 626.5572, subdivision 6, where the services described in that paragraph are provided;\n(8) a place to or from which ambulance service, as defined in section 144E.001, is provided or sought to be provided; and\n(9) a hospice provider licensed under section 144A.753.\n(b) \"Aggrieved party\" means a person whose access to or egress from a facility is obstructed in violation of subdivision 2, or the facility.\nA person is guilty of a gross misdemeanor who intentionally and physically obstructs any individual's access to or egress from a facility.\nNothing in this section shall be construed to impair the right of any individual or group to engage in speech protected by the United States Constitution, the Minnesota Constitution, or federal or state law, including but not limited to peaceful and lawful handbilling and picketing.\n(a) A party who is aggrieved by an act prohibited by this section, or by an attempt or conspiracy to commit an act prohibited by this section, may bring an action for damages, injunctive or declaratory relief, as appropriate, in district court against any person or entity who has violated or has conspired to violate this section.\n(b) A party who prevails in a civil action under this subdivision is entitled to recover from the violator damages, costs, attorney fees, and other relief as determined by the court. In addition to all other damages, the court may award to the aggrieved party a civil penalty of up to $1,000 for each violation. If the aggrieved party is a facility and the political subdivision where the violation occurred incurred law enforcement or prosecution expenses in connection with the same violation, the court shall award any civil penalty it imposes to the political subdivision instead of to the facility.\n(c) The remedies provided by this subdivision are in addition to any other legal or equitable remedies the aggrieved party may have and are not intended to diminish or substitute for those remedies or to be exclusive.",
	"repealed": false
}