{
	"id": "462A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.05",
	"title": "462A.05 SPECIFIC POWERS OF THE AGENCY.",
	"text": "The agency shall have the specific powers and duties set forth in this section.\nIt may make or participate in the making of eligible construction loans to sponsors or builders of residential housing for occupancy by persons or families of low and moderate income. Such loans shall be made only upon determination by the agency that construction loans are not otherwise available, wholly or in part, from private lenders upon equivalent terms and conditions.\nIt may make grants to sponsors or builders of multiunit residential housing for occupancy by persons and families of low and moderate income. The grants shall only be made for the construction or rehabilitation of three bedroom apartment units or townhouse units of four bedrooms or more for large low and moderate income families. No grant shall exceed the amount of $5,000 per unit. In making grants, the agency shall determine the circumstances under which and the terms and conditions under which all or any portion thereof will be repaid and shall determine the appropriate security should repayment be required.\nIt may agree to purchase, make, or otherwise participate in the making and enter into commitments for the purchase, making, or participation in the making of long-term eligible mortgage loans to sponsors of residential housing for occupancy by persons and families of low and moderate income, or to persons and families of low and moderate income who may purchase residential housing. The loans shall be made only upon determination by the agency that long-term mortgage loans are not otherwise available, wholly or in part, from private lenders upon equivalent terms and conditions. In establishing maximum mortgage amounts and maximum purchase prices for single family dwellings, the agency shall take into account housing cost differences in the regions of the state.\nIt may refinance the existing indebtedness of owners of rental property, secured by residential housing for occupancy by persons and families of low and moderate income, if refinancing is determined by the agency to be necessary to reduce housing costs to an affordable level or to maintain the supply of affordable low-income housing. The authority granted in this subdivision is in addition to and not in limitation of the authority granted in section 462A.05, subdivision 14.\nThe agency may make loans to refinance the existing indebtedness, of owners of rental property, secured by federally assisted housing for the purpose of obtaining agreement of the owner to participate in the federally assisted rental housing program and to extend any existing low-income affordability restrictions on the housing for the maximum term permitted. For purposes of this subdivision, \"federally assisted rental housing\" includes housing that is:\n(1) subject to a project-based housing or rental assistance payment contract funded by the federal government;\n(2) financed by the Rural Housing Service of the United States Department of Agriculture under section 515 of the Housing Act of 1949, as amended; or\n(3) financed under section 236; section 221(d)(3) below market interest rate program; section 202; or section 811 of the Housing and Urban Development Act of 1968, as amended.\nIt may agree to purchase, make, or otherwise participate in the making and enter into commitments for the purchase, making, or participation in the making of long-term mortgage loans to persons and families of low and moderate income to refinance a long-term mortgage or other financing secured by the residential housing occupied by the owner of the property. The loans shall be made only upon determination by the agency that long-term mortgage loans are not otherwise available, wholly or in part, from private lenders upon equivalent terms and conditions.\nIt may purchase and enter into commitments for the purchase of eligible securities, certificates of deposit, time deposits, or existing mortgage loans from banks, savings associations, insurance companies, or other financial intermediaries, provided that the agency shall first determine that all or a portion of the proceeds of such instruments will be utilized to make loans for residential housing as defined in section 462A.03, subdivision 7, or all or a portion of the instruments are backed by or otherwise evidence an interest in existing mortgages securing mortgage loans to finance residential housing. In the case of eligible securities backed by existing mortgages, the proceeds must be used in whole or in part either for making loans for residential housing or for preserving the use of existing residential housing by persons and families of low and moderate income.\nIt may make temporary loans solely to \"nonprofit\" or \"cooperative housing\" sponsors as defined by the agency, with or without interest, and with such security for repayment, if any, as the agency determines reasonably necessary and practicable, solely from the housing development fund, in accordance with the provisions of section 462A.21, to defray development costs to sponsors of residential housing construction for occupancy by persons and families of low and moderate income which development costs are eligible or potentially eligible for construction loans or mortgages.\nIt may accept appropriations, gifts, grants, bequests and devises, and utilize or dispose of the same to carry out its corporate purpose.\nIt may make and execute contracts, releases, compromises, compositions and other instruments necessary or convenient for the exercise of its powers, or to carry out its corporate purpose.\nIt may collect reasonable interest, fees, and charges in connection with making and servicing its loans, notes, bonds, obligations, commitments and other evidences of indebtedness, and in connection with providing technical, consultative and project assistance services. Such interest, fees and charges shall be limited to the amounts required to pay the costs of the agency, including operating and administrative expenses, and reasonable allowances for losses which may be incurred.\nIt may invest any funds not required for immediate disbursement in accordance with the provisions of section 462A.18, subdivision 2.\nIt may sell eligible loans or eligible securities to the Federal National Mortgage Association or any other agency or instrumentality of the United States, and may invest in the capital stock issued by said association or other agency or instrumentality to the extent, if any, required as a condition of such sale.\nIt may receive federal housing assistance supplements; may administer and distribute said supplements in accordance with the applicable provisions of federal law or regulations governing the administration and distribution of said supplements; and may make and publish such rules as are necessary to enable it to receive, administer, and distribute said supplements in accordance with said federal laws and regulations.\nIt may, from time to time, establish such funds as may be needed in order to receive, administer, and distribute federal housing assistance supplements. All federal housing assistance supplement funds received by the agency are hereby appropriated to the agency.\nIt may participate in qualified mortgage certificate programs as provided by section 25 of the Internal Revenue Code of 1954, as amended through December 31, 1984.\nIn carrying out the policies and purposes declared in section 462A.02, the agency shall prefer those housing projects which are federally subsidized and those loans which are federally insured or guaranteed, to the extent that the agency finds such projects and loans to be available at the times and in the amounts needed to meet the shortage of residential housing for persons and families of low and moderate income.\nIt may agree to purchase, make, or otherwise participate in the making, and may enter into commitments for the purchase, making, or participation in the making, of eligible loans for rehabilitation, with terms and conditions as the agency deems advisable, to persons and families of low and moderate income, and to owners of existing residential housing for occupancy by such persons and families, for the rehabilitation of existing residential housing owned by them. Rehabilitation may include the addition or rehabilitation of a detached accessory dwelling unit. The loans may be insured or uninsured and may be made with security, or may be unsecured, as the agency deems advisable. The loans may be in addition to or in combination with long-term eligible mortgage loans under subdivision 3. They may be made in amounts sufficient to refinance existing indebtedness secured by the property, if refinancing is determined by the agency to be necessary to permit the owner to meet the owner's housing cost without expending an unreasonable portion of the owner's income thereon. No loan for rehabilitation shall be made unless the agency determines that the loan will be used primarily to make the housing more desirable to live in, to increase the market value of the housing, for compliance with state, county or municipal building, housing maintenance, fire, health or similar codes and standards applicable to housing, or to accomplish energy conservation, decarbonization, climate resiliency, and other qualified projects. In unincorporated areas and municipalities not having codes and standards, the agency may, solely for the purpose of administering the provisions of this chapter, establish codes and standards. No loan under this subdivision for the rehabilitation of owner-occupied housing shall be denied solely because the loan will not be used for placing the owner-occupied residential housing in full compliance with all state, county, or municipal building, housing maintenance, fire, health, or similar codes and standards applicable to housing. Rehabilitation loans shall be made only when the agency determines that financing is not otherwise available, in whole or in part, from private lenders upon equivalent terms and conditions. Accessibility rehabilitation loans authorized under this subdivision may be made to eligible persons and families without limitations relating to the maximum incomes of the borrowers if:\n(1) the borrower or a member of the borrower's family requires a level of care provided in a hospital, skilled nursing facility, or intermediate care facility for persons with developmental disabilities;\n(2) home care is appropriate; and\n(3) the improvement will enable the borrower or a member of the borrower's family to reside in the housing.\nThe agency may waive any requirement that the housing units in a residential housing development be rented to persons of low and moderate income if the development consists of four or fewer dwelling units, one of which is occupied by the owner.\nIt may make loans to persons and families of low and moderate income to rehabilitate or to assist in rehabilitating existing residential housing owned and occupied by those persons or families. Rehabilitation may include replacement of manufactured homes. No loan shall be made unless the agency determines that the loan will be used primarily for rehabilitation work necessary for health or safety, essential accessibility improvements, or to improve the energy efficiency, clean energy, greenhouse gas emissions reductions, climate resiliency, and other qualified projects in the dwelling. No loan for rehabilitation of owner-occupied residential housing shall be denied solely because the loan will not be used for placing the residential housing in full compliance with all state, county or municipal building, housing maintenance, fire, health or similar codes and standards applicable to housing. The amount of any loan shall not exceed the lesser of (a) a maximum loan amount determined under rules adopted by the agency not to exceed $37,500, or (b) the actual cost of the work performed, or (c) that portion of the cost of rehabilitation which the agency determines cannot otherwise be paid by the person or family without the expenditure of an unreasonable portion of the income of the person or family. Loans made in whole or in part with federal funds may exceed the maximum loan amount to the extent necessary to comply with federal lead abatement requirements prescribed by the funding source. In making loans, the agency shall determine the circumstances under which and the terms and conditions under which all or any portion of the loan will be repaid and shall determine the appropriate security for the repayment of the loan. Loans pursuant to this subdivision may be made with or without interest or periodic payments.\nIt may agree to purchase, make, or otherwise participate in the making, and may enter into commitments for the purchase, making, or participating in the making, of loans to persons and families, without limitations relating to the maximum incomes of the borrowers, to assist in energy conservation, decarbonization, climate resiliency, and other qualified projects for existing housing owned by those persons or families including, but not limited to: weatherstripping and caulking; chimney construction or improvement; furnace or space heater repair, cleaning or replacement; central air conditioner installation, repair, maintenance, or replacement; air source or geothermal heat pump installation, repair, maintenance, or replacement; insulation; windows and doors; and structural or other directly related repairs or installations essential for energy conservation, decarbonization, climate resiliency, and other qualified projects. Loans shall be made only when the agency determines that financing is not otherwise available, in whole or in part, from private lenders upon equivalent terms and conditions. Loans under this subdivision or subdivision 14 may:\n(1) be integrated with a utility's on-bill repayment program approved under section 216B.241, subdivision 5d; and\n(2) also be made for the installation of on-site solar energy or energy storage systems.\nIt may agree or enter commitments to purchase, make, or participate in making loans described in subdivision 14 for programs approved by the agency for the preservation of designated neighborhoods. To achieve the policy of economic integration stated in section 462A.02, subdivision 6, the programs may authorize loans to borrowers having ownership interests in properties in the neighborhood who are not eligible mortgagors as defined in section 462A.03, subdivision 13. The aggregate original principal balances of noneligible mortgagor loans in a neighborhood benefiting from financing under this subdivision must not exceed 25 percent of the total amount of neighborhood preservation loan funds allocated to the neighborhood under the program.\nRehabilitation loans authorized under subdivision 14 may be made to eligible persons and households without limitations relating to the maximum incomes of the borrowers.\nA person or household is eligible to receive an accessibility loan under the following conditions:\n(1) the borrower or an individual residing in the borrower's home has a permanent physical or mental condition that substantially limits one or more major life activities; and\n(2) the improvement to the housing will assist the borrower or a member of the borrower's household in residing in the housing.\nThe agency may agree and enter into commitments to purchase, make, or otherwise participate in making loans to persons or families, without limitations relating to the maximum incomes of the borrowers, for the purchase and rehabilitation of existing owner-occupied residential housing, as provided under subdivision 14.\n(a) It may make grants to persons and families of low and moderate income to pay or to assist in paying a loan made pursuant to subdivision 14, or to rehabilitate or to assist in rehabilitating existing residential housing owned or occupied by such persons or families. For the purposes of this section, persons of low and moderate income include administrators appointed pursuant to section 504B.425, paragraph (d). No grant shall be made unless the agency determines that the grant will be used primarily to make the housing more desirable to live in, to increase the market value of the housing or for compliance with state, county or municipal building, housing maintenance, fire, health or similar codes and standards applicable to housing, or to accomplish energy conservation, decarbonization, climate resiliency, or other qualified projects. In unincorporated areas and municipalities not having codes and standards, the agency may, solely for the purpose of administering this provision, establish codes and standards. No grant for rehabilitation of owner occupied residential housing shall be denied solely because the grant will not be used for placing the residential housing in full compliance with all state, county or municipal building, housing maintenance, fire, health or similar codes and standards applicable to housing. The amount of any grant shall not exceed the lesser of (a) $6,000, or (b) the actual cost of the work performed, or (c) that portion of the cost of rehabilitation which the agency determines cannot otherwise be paid by the person or family without spending an unreasonable portion of the income of the person or family thereon. In making grants, the agency shall determine the circumstances under which and the terms and conditions under which all or any portion thereof will be repaid and shall determine the appropriate security should repayment be required.\n(b) The agency may also make grants to rehabilitate or to assist in rehabilitating housing under this subdivision to persons of low and moderate income for the purpose of qualifying as foster parents.\nIt may make grants or loans to persons and families of low and moderate income to improve the accessibility of existing residential housing for disabled occupants, or to assist in paying a loan made pursuant to subdivision 14 to improve the accessibility of existing residential housing for disabled occupants. The amount of an accessibility grant or loan must not exceed the lesser of the actual cost of the work performed or the part of the cost of rehabilitation the agency determines cannot otherwise be paid by the person or family without spending an unreasonable portion of the income of the person or family on it, based upon the cost of the improvements and other appropriate factors including extraordinary medical expenses. Grants or loans made pursuant to this section may include the payment of money for technical assistance for the design and construction of accessibility improvements. In making grants or loans under this subdivision, the agency shall determine the circumstances under which and the terms and conditions under which all or any portion thereof will be repaid and shall determine the appropriate security should repayment be required. The agency may gather data on available accessible housing financed under this program and make the information available to interested individuals and groups.\n(a) It may make grants to assist in energy conservation, decarbonization, climate resiliency, and other qualified projects for existing owner occupied housing including, but not limited to: insulation, storm windows and doors, furnace or space heater repair, cleaning or replacement, chimney construction or improvement, weatherstripping and caulking, structural or other directly related repairs, or installations essential for energy conservation, decarbonization, climate resiliency, and other qualified projects. The grant to any household shall not exceed $2,000.\n(b) To be eligible for an emergency energy conservation, decarbonization, and climate resiliency grant, a household must be certified as eligible to receive emergency residential heating assistance under either the federal or the state program, and either (1) have had a heating cost for the preceding heating season that exceeded 120 percent of the regional average for the preceding heating season for that energy source as determined by the commissioner of employment and economic development, or (2) be eligible to receive a federal energy conservation grant, but be precluded from receiving the grant because of a need for directly related repairs that cannot be paid for under the federal program. The Housing Finance Agency shall make a reasonable effort to determine whether other state or federal loan and grant programs are available and adequate to finance the intended improvements. An emergency energy conservation grant may be made in conjunction with grants or loans from other state or federal programs that finance other needed rehabilitation work. The receipt of a grant pursuant to this section shall not affect the applicant's eligibility for other Housing Finance Agency loan or grant programs.\n(a) It may make or purchase loans or grants for the abatement of hazardous levels of lead paint in residential buildings and lead-contaminated soil on the property of residential buildings occupied by low- and moderate-income persons. Hazardous levels are as determined by the Department of Health or the Pollution Control Agency. The agency must establish criteria for a residential lead paint and lead-contaminated soil abatement program, including the terms of loans and grants under this section, a maximum amount for loans or grants, eligible borrowers or grantees, eligible contractors, and eligible buildings. The agency may make grants to cities, local units of government, registered lead abatement contractors, and nonprofit organizations for the purpose of administering a residential lead paint and contaminated lead soil abatement program. The agency must establish standards for the relocation of families where necessary and the payment of relocation expenses. To the extent possible, the agency must coordinate loans and grants under this section with existing housing programs.\nThe agency, in consultation with the Department of Health, must report to the legislature by January 1996 on the costs and benefits of subsidized lead abatement and the extent of the childhood lead exposure problem. The agency must review the effectiveness of its existing loan and grant programs in providing funds for residential lead abatement and report to the legislature with examples, case studies and recommendations.\n(b) The agency may also make grants to eligible organizations, as defined in section 144.9512, subdivision 1, for the purposes of section 144.9512.\n(a) It may make payments or expenditures from the housing development fund to persons of low or moderate income, who are recipients of an eligible loan as defined in section 462A.03, subdivision 11, or who have purchased residential housing from a recipient of such eligible loan, and who are owners and occupants of residential housing constructed or rehabilitated under this chapter, when, in the agency's determination, such residential housing contains defects or omissions which affect the structural soundness, or the use and the livability of such housing, including but not limited to defects or omissions in materials, hardware, fixtures, design, workmanship and landscaping of whatever kind and nature incorporated in said housing and which are covered by an agency approved warranty, for the purposes of (i) correcting such defects, or (ii) paying the claims of the owner arising from such defects, provided, that this authority shall exist only if the owner has requested assistance from the agency not later than four years after the issuance of the eligible loan, or where such residential housing was rehabilitated under this chapter only if the owner has requested assistance from the agency not later than two years after the issuance of the eligible loan.\n(b) If such owner elects to receive payments or expenditures pursuant to this section, the agency is subrogated to the right of such owner to recover damages against any party or persons reasonably calculated to be responsible for such damages.\n(c) The agency may require from the seller of such residential housing, or the contractor responsible for the construction or rehabilitation of such housing, an agreement to reimburse the agency for any payments and expenditures made pursuant to this subdivision with respect to such residential housing.\nThe agency may make conventional loans, as defined in and in accordance with the conditions and limitations prescribed in section 47.20. Notwithstanding section 47.20, conventional loans owned by the agency on May 30, 1981 or thereafter made or purchased may contain provisions which limit, condition, or prohibit assumption of the loans.\n(a) It may make loans to \"nonprofit\" sponsors as defined by the agency, with or without interest, and with such security for repayment, if any, as the agency determines reasonably necessary and practicable, solely from the housing development fund in accordance with the provisions of section 462A.21, subdivision 9, to encourage innovations in the development or rehabilitation of single and multifamily residential housing. It may make loans to for-profit sponsors pursuant to this subdivision, provided that the agency shall make the loan with interest at a rate determined by the agency.\n(b) It shall promulgate rules, in accordance with chapter 14, relating to the administration of the loans authorized by this subdivision. The rules may define types of projects eligible for loans, criteria for selecting between eligible loans, terms of the loans including interest rates and loan periods, and other characteristics that the agency deems necessary to administer the program.\n(a) The agency may make loans, with or without interest, and with security for repayment, if any, the agency determines reasonably necessary and practicable, for the financing of innovative housing as described in this section.\n(b) The housing shall be cooperative or rental multifamily housing which is designed to provide long-term affordability and which is either owned and operated on a nonprofit cooperative basis by the residents, or owned by a limited-dividend entity and operated by a residents association.\n(c) Occupancy shall be restricted to persons and families of low and moderate income as defined in section 462A.03, subdivision 10; provided that the agency shall give priority to proposals that will provide housing to persons and families whose income is 50 percent or less of the statewide median family income, as estimated by the United States Department of Housing and Urban Development.\n(d) A democratic residents association shall have substantial control over the operation and management of the housing and over the filling of housing unit vacancies.\n(e) A training and education program shall be developed by the loan recipient and made available to residents to help them organize and operate the residents association, understand their legal rights and financial interests regarding the property, and manage and maintain the property. The agency shall ensure that a training and education program has been developed prior to approving any loan under this section.\nIt may make no interest loans of up to $4,000 to persons and families of low and moderate income who are veterans or veterans' dependents to assist in making down payments to enable them to purchase new or existing housing to be used as their principal place of residence. To be eligible, the veterans or veteran's dependent must be a first time home owner, and must enter into an agreement with the agency, with appropriate security as determined by the agency, to repay the loan amount in full when the property is sold, transferred, or otherwise conveyed, or ceases to be the recipient's principal place of residence. For the purpose of this subdivision, \"veteran\" means a person residing in Minnesota who has been separated under honorable conditions from any branch of the armed forces of the United States after having served on active duty for 181 consecutive days or by reason of disability incurred while serving on active duty, and who served at any time during the period from August 5, 1964 to May 7, 1975; and \"veteran's dependent\" means a person residing in Minnesota who is the unmarried surviving spouse of a veteran.\nMS 1996 [Repealed, 1997 c 200 art 4 s 23]\n(a) The agency may make loans or grants to for-profit, limited-dividend, or nonprofit sponsors, as defined by the agency, for residential housing to be used to provide housing to low- and moderate-income persons who are adults with chronic substance use disorder.\n(b) Housing for adults with chronic substance use disorder must satisfy the following conditions:\n(1) be certified by the Department of Health or the city as a board and lodging facility or single residence occupancy housing;\n(2) meet all applicable health, building, fire safety, and zoning requirements;\n(3) be located in an area significantly distant from the present location of county detoxification service sites;\n(4) make available the services of trained personnel to appraise each client before or upon admission and to provide information about medical, job training, and substance use disorder services as necessary;\n(5) provide on-site security designed to assure the health and safety of clients, staff, and neighborhood residents; and\n(6) operate with the guidance of a neighborhood-based board.\nPriority for loans and grants made under this paragraph must be given to proposals that address the needs of the Native American population and veterans of military services for this type of housing.\n(c) Loans or grants pursuant to this subdivision must not be used for facilities that provide housing available for occupancy on less than a 24-hour continuous basis. To the extent possible, a sponsor shall combine the loan or grant with other funds obtained from public and private sources. In making loans or grants, the agency shall determine the circumstances, terms, and conditions under which all or any portion of the loan or grant will be repaid and the appropriate security should repayment be required.\nThe agency may make or purchase loans to owners of rental property that is occupied or intended for occupancy primarily by low- and moderate-income tenants and which does not comply with the standards established in section 326B.106, subdivision 1, for the purpose of energy improvements, decarbonization, climate resiliency, and other qualified projects necessary to bring the property into full or partial compliance with these standards. For property which meets the other requirements of this subdivision, a loan may also be used for moderate rehabilitation of the property. The authority granted in this subdivision is in addition to and not in limitation of any other authority granted to the agency in this chapter. The limitations on eligible mortgagors contained in section 462A.03, subdivision 13, do not apply to loans under this subdivision. Loans for the improvement of rental property pursuant to this subdivision may contain provisions that repayment is not required in whole or in part subject to terms and conditions determined by the agency to be necessary and desirable to encourage owners to maximize rehabilitation of properties.\nIt may make or participate in the making and enter into commitments for the making of loans to any banking institution, savings association, or other lender approved by the members, organized under the laws of this or any other state or of the United States having an office in this state, notwithstanding the provisions of section 462A.03, subdivision 13, if it first determines that the proceeds of such loans will be utilized for the purpose of making loans to or for the benefit of eligible persons and families as provided and in accordance with this chapter. Loans pursuant to this subdivision shall be secured, repaid and bear interest at the rate as determined by the members.\nThe agency may participate in loans or establish a fund to insure loans, or portions of loans, that are made by any banking institution, savings association, or other lender approved by the agency, organized under the laws of this or any other state or of the United States having an office in this state, to owners of renter-occupied homes or apartments that do not comply with standards set forth in section 326B.106, subdivision 1, without limitations relating to the maximum incomes of the owners or tenants. The proceeds of the insured portion of the loan must be used to pay the costs of improvements, including all related structural and other improvements, that will reduce energy consumption, that will decarbonize, and that will ensure the climate resiliency of housing.\n(a) It may engage in housing programs for low- and moderate-income elderly, persons with physical or developmental disabilities, or single parent families in the case of home sharing programs, as defined by the agency, to provide grants or loans, with or without interest, for:\n(1) accessibility improvements to residences occupied by elderly persons;\n(2) housing sponsors, as defined by the agency, of home sharing programs to match existing homeowners with prospective tenants who will contribute either rent or services to the homeowner, where either the homeowner or the prospective tenant is elderly, a person with physical or developmental disabilities, or the head of a single parent family;\n(3) the construction of or conversion of existing buildings into structures for occupancy by the elderly that contain from three to 12 private sleeping rooms with shared cooking facilities and common space; and\n(4) housing sponsors, as defined by the agency, to demonstrate the potential for home equity conversion in Minnesota for the elderly, in both rural and urban areas, and to determine the need in those equity conversions for consumer safeguards.\n(b) In making the grants or loans, the agency shall determine the terms and conditions of repayment and the appropriate security, if any, should repayment be required. The agency may provide technical assistance to sponsors of home sharing programs or may contract or delegate the provision of the technical assistance in accordance with section 462A.07, subdivision 12.\n(c) Housing sponsors who receive funding through these programs shall provide homeowners and tenants participating in a home sharing program with information regarding their rights and obligations as they relate to federal and state tax law including, but not limited to, taxable rental income, homestead classification under chapter 273, the renter's credit under section 290.0693, and the property tax refund act under chapter 290A.\nThe agency, in its own name or in conjunction with other housing sponsors as a joint venturer, partner, shareholder, or member, may, subject to the provisions of subdivision 27, clause (1) acquire, rehabilitate, or lease from private or public parties, housing designed and planned to be sold or rented at prices that low- and moderate-income persons and families can afford, and (2) rent or otherwise dispose of that housing to persons and families of low and moderate income or to housing sponsors to rent or sell the property to those persons and families. The agency may charge rents for the use of the residential housing facilities acquired, rehabilitated, or leased under this subdivision in amounts sufficient to comply with any agreements of the agency, whether in connection with the issuance of bonds or otherwise, including rent in amounts sufficient for reimbursement of all costs of financing by the agency and the payment of those service charges and insurance premiums that the agency determines to be reasonable.\nIt may, when the agency determines it is necessary or desirable to carry out its purposes and to exercise any or all of the powers conferred upon it by this chapter, and subject to the provisions of subdivision 27, form or consent to the formation of one or more corporations under the Minnesota Nonprofit Corporation Act, as amended, or under other laws of this state. The agency may be a member of the corporations, and the members and employees of the agency from time to time may be members of the board of directors or officers of the corporations. The agency may enter into agreements with them providing for the agency to approve various aspects of their operations. The agency may capitalize the corporations and may acquire all or a part of the corporations' share or member certificates. The agency may require that it approve aspects of the operation of the corporations including the corporations' articles of incorporation or bylaws, directors, projects and expenditures, and the sale or conveyance of projects, and the issuance of obligations. The agency may agree to and may take title to property of the corporations upon their dissolution.\n(a) The agency, or the corporations referred to in subdivision 26, may acquire property or property interests under subdivisions 25 and 26 and section 462A.06, subdivision 7, for the following purposes: (1) to protect a loan or grant in which the agency or corporation has an interest; or (2) to preserve for the use of low- and moderate-income persons or families multifamily housing which was (i) previously financed by the agency, or (ii) not financed by the agency but is benefited by federal housing assistance payments or other rental subsidy or interest reduction contracts. Property or property interests acquired for the purpose specified in clause (1) may be acquired by foreclosure, deed in lieu of foreclosure, or otherwise.\n(b) Multifamily property acquired as provided in paragraph (a), clause (2), must be managed on a fee basis by an entity other than the agency or corporation. The agency or corporation may manage the property on a temporary basis until an agreement is entered into with another entity to manage the property. The agency or corporation shall make the property available for sale at a purchase price and on terms that are mutually agreeable to the parties. In the sale of property benefited by federal housing assistance, priority must be given to a buyer who agrees to maintain the federal housing assistance.\nMS 1990 [Repealed, 1991 c 292 art 9 s 38]\nMS 1990 [Repealed, 1991 c 292 art 9 s 38]\nIt may invest in, purchase, acquire, and take assignments of existing notes and mortgages not closed for the purpose of sale to the agency, from lenders that are nonprofit or nonprofit entities, as defined in the agency's rules, provided that: (1) the notes and mortgages evidence loans for the construction, rehabilitation, purchase, improvement, or refinancing of residential housing intended for occupancy and occupied by low- and moderate-income persons and families; and (2) the loan sellers utilize the funds derived from the purchases in accordance with the authority contained in section 462A.07, subdivision 12, for the purposes and objectives of sections 462A.02, 462A.03, 462A.05, 462A.07, and 462A.21; and (3) the purchases are subject to security and limitations on the costs and expenses of the loan sellers incidental to the utilization of the purchase proceeds as the agency may determine. The proceeds of the purchases authorized by this subdivision shall not be subject to the limitations of section 462A.21, subdivisions 6 and 9. In addition, it may invest in, purchase, acquire, and take assignments of existing federally insured mortgages for multifamily housing, not closed for the purpose of sale to the agency, from any banking institution, savings association, or other lender or financial intermediary approved by the members; provided that the multifamily housing is benefited by contracts for federal housing assistance payments.\nIt may agree to purchase, make, or otherwise participate in the making and enter into commitments for the purchase, making, or participation in the making of loans to provide financing for residential housing for occupancy by persons and families of low and moderate income that qualifies for and will be utilized so as to obtain the benefits of low-income housing credits under section 42 of the Internal Revenue Code of 1986, as amended through December 31, 1988. The limitations on eligible mortgagors contained in section 462A.03, subdivision 13, do not apply to loans under this subdivision, and the loans may be insured or uninsured and may be made with security, or may be unsecured, as the agency deems advisable.\nThe agency may obtain the appointment of receivers or assignments of rents and profits under sections 559.17 and 576.25, subdivision 5, except that the limitation relating to the minimum amounts of the original principal balances of mortgages contained in sections 576.25, subdivision 5, paragraph (a), clause (i), and 559.17, subdivision 2, clause (2), shall be inapplicable to it.\nThe agency may establish a fund to coinsure loans, with a division of risk as determined by the agency, that are made by any banking institution, savings association, or other lender approved by the agency, organized under the laws of this or any other state or of the United States having an office in this state, to low- and moderate-income purchasers of residential housing to be occupied by them, or to low- and moderate-income persons or families for improvements to residential property that they occupy as their principal place of residence, provided that loan insurance on comparable terms and conditions is not otherwise available in the areas where the borrowers' properties are situated.\n(a) The agency may make, purchase, or make a forward commitment to purchase home equity conversion loans for low or moderate income elderly homeowners. Loan recipients must be at least 62 years of age, have substantial equity in their home, and have an income at or below 50 percent of the greater of statewide or area median income. The agency must inform a program participant of available home equity conversion loan counseling services before making a loan.\n(b) Repayment of a home equity conversion loan may not be required until at least one of the following conditions occurs:\n(1) the sale or conveyance of the mortgaged property;\n(2) the mortgaged property is no longer the mortgagor's principal residence;\n(3) the death of the mortgagor; or\n(4) a violation of an obligation of the mortgagor under the mortgage.\nFor purposes of this section, an obligation of the mortgagor under the mortgage does not include immediate repayment upon completion of loan disbursements at the end of a specified term.\nThe agency may provide financial assistance for the conversion of manufactured home parks to cooperative or nonprofit ownership. Financial assistance may include direct loans, interest rate subsidy loans, loan guarantees, and down payment assistance.\nThe agency may make grants or loans to nonprofit organizations, local government units, Indian tribes, and Indian tribal organizations to finance the acquisition, improvement, rehabilitation, and lease-purchase of existing housing for persons of low and moderate income. A person or family is eligible to participate in a lease-purchase agreement if the person's or family's income does not exceed 60 percent of the greater of (1) state median income, or (2) area or county median income. The lease agreement must provide for a portion of the lease payment to be escrowed as a down payment on the housing. A property containing two or fewer dwelling units is eligible for financing under the lease-purchase housing program. A loan made under this subdivision must be repaid to the agency upon sale of the housing.\nMS 1992 [Repealed, 1993 c 236 s 19]\nThe agency may make loans with or without interest for the purpose of funding community land trusts under sections 462A.30 and 462A.31 from monies other than state general obligation bond proceeds. To assure the long-term affordability of housing provided by the community land trust, the community land trust must own the land acquired in whole or in part with a loan from the agency under this section under terms and conditions determined by the agency. The agency may convert the loan to a grant under circumstances approved by the agency.\nThe agency may make equity take-out loans to owners of federally assisted rental property. The owner of a federally assisted rental property must agree to participate in the federal assistance program and extend the low-income affordability restrictions on the housing for the maximum term of the federal assistance contract. An equity take-out loan must be secured by appropriate security determined necessary by the agency.\nThe agency may make matching grants for the purpose of employing and training resident youths or youths residing in the surrounding neighborhood in the construction, maintenance, or rehabilitation of multifamily housing financed by the agency.\nThe agency may make demonstration grants to owners or managers of multifamily rental property upon which the agency holds a mortgage for the purpose of developing or coordinating services that promote the tenant's ability to live independently, support the tenant's self-sufficiency, improve the relationship between the tenants and the community, or that otherwise strengthen the community.\nThe agency may administer the rent assistance program established in section 462A.2095.\nThe agency must prioritize its use of appropriations for any program under this chapter to serve households most affected by housing disparities.\nThe agency may establish special purpose credit programs to assist one or more economically disadvantaged classes of persons in order to address the effects of historic and current discrimination which resulted in limiting access to housing credit by persons on the basis of race, color, ethnicity, or national origin. A special purpose credit program may include a wide variety of remedies, including but not limited to loans or other financial assistance, based on current, documented need as determined by the agency.\nNotwithstanding any other provision in this chapter, at its discretion the agency may make any federally recognized Indian Tribe in Minnesota, or their associated Tribally Designated Housing Entity (TDHE) as defined by United States Code, title 25, section 4103(22), eligible for agency funding.",
	"repealed": false
}