{
	"id": "60K.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.48",
	"title": "60K.48 COMMISSIONS.",
	"text": "An insurance company or insurance producer shall not pay a commission, service fee, brokerage, or other valuable consideration to a person for selling, soliciting, or negotiating insurance in this state if that person is required to be licensed under sections 60K.30 to 60K.56 and is not so licensed.\nA person shall not accept a commission, service fee, brokerage, or other valuable consideration for selling, soliciting, or negotiating insurance in this state if that person is required to be licensed under sections 60K.30 to 60K.56 and is not so licensed.\n(a) Renewal or other deferred commissions may be paid to a person for selling, soliciting, or negotiating insurance in this state if the person was required to be licensed under sections 60K.30 to 60K.56 at the time of the sale, solicitation, or negotiation and was so licensed at that time.\n(b) An insurer or insurance producer may pay or assign commissions, service fees, brokerages, or other valuable consideration to an insurance agency or to persons who do not sell, solicit, or negotiate insurance in this state, unless the payment would constitute an illegal rebate or otherwise violate section 72A.20, subdivision 10. A duly licensed producer may pay commissions or assign or direct that commissions be paid to a partnership of which the producer is a member, employee, or agent, or to a corporation of which the agent is an officer, employee, or agent.\n(a) If a health carrier pays commissions or service fees to licensed producers who are appointed by the health carrier for sale of an individual health plan, then, within 30 days of receipt of the agent of record agreement, the health carrier must accommodate a policyholder or applicant for coverage by allowing a policyholder or applicant to select or change the agent of record, effective upon the next premium cycle.\n(b) The health carrier's standard commission and service fees must be paid to the policyholder's agent of record or the agent's assignee if any premium rate for an individual health plan has been approved by the commissioner with costs associated with producer commissions included in the filed rate.\n(c) A health carrier is prohibited from offering, renewing, or failing to renew individual health plans based solely on the commission-paying status of the health plan.\n(d) Nothing in this subdivision requires a health carrier to pay any commission or service fee with respect to the sale of an individual health plan, unless the rate for the individual health plan has been approved by the commissioner with costs associated with producer commissions included in the filed rate.",
	"repealed": false
}