{
	"id": "260.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.69",
	"title": "260.69 CULTURAL COMPETENCY TRAINING FOR INDIVIDUALS WORKING WITH AFRICAN AMERICAN AND DISPROPORTIONATELY REPRESENTED CHILDREN.",
	"text": "The commissioner of children, youth, and families must collaborate with the Children's Justice Initiative to ensure that cultural competency training is given to individuals working in the child welfare system, including child welfare workers and supervisors. Training must also be made available to attorneys, juvenile court judges, and family law judges.\n(a) The commissioner must develop training content and establish the frequency of trainings for child welfare workers and supervisors.\n(b) The cultural competency training under this section is required prior to or within six months of beginning work with any African American or disproportionately represented child and their family. A responsible social services agency staff person who is unable to complete the cultural competency training prior to working with African American or disproportionately represented children and their families must work with a qualified staff person within the agency who has completed cultural competency training until the person is able to complete the required training. The training must be available by January 1, 2027, and must:\n(1) be provided by an African American individual or individual from a community that is disproportionately represented in the child welfare system who is knowledgeable about African American and other disproportionately represented social and cultural norms and historical trauma;\n(2) raise awareness and increase a person's competency to value diversity, conduct a self-assessment, manage the dynamics of difference, acquire cultural knowledge, and adapt to diversity and the cultural contexts of communities served;\n(3) include instruction on effectively developing a safety plan and instruction on engaging a safety network; and\n(4) be accessible and comprehensive and include the ability to ask questions.\n(c) The training may be provided in a series of segments, either in person or online.\nThe commissioner must provide an update to the chairs and ranking minority members of the legislative committees with jurisdiction over child protection by January 1, 2028, on the rollout of the training under subdivision 1 and the content and accessibility of the training under subdivision 2.",
	"repealed": false
}