{
	"id": "16B.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.35",
	"title": "16B.35 ART IN STATE BUILDINGS.",
	"text": "An appropriation for the construction or alteration of any state building may contain an amount not to exceed one percent of the total appropriation for the building for the acquisition of works of art, excluding landscaping, which may be an integral part of the building or its grounds, attached to the building or grounds or capable of being displayed in other state buildings. Money used for this purpose is available only for the acquisition of works of art to be exhibited in areas of a building or its grounds accessible, on a regular basis, to members of the public. No more than ten percent of the total amount available each fiscal year under this subdivision may be used for administrative expenses, either by the commissioner of administration or by any other entity to whom the commissioner delegates administrative authority. For the purposes of this section \"state building\" means a building the construction or alteration of which is paid for wholly or in part by the state.\nNotwithstanding subdivision 1, no part of a state appropriation may be used to acquire or install works of art in a state correctional facility.\nA prohibition on using state appropriations to pay for art in correctional facilities does not apply to art produced through programming in correctional facilities.\nNotwithstanding subdivision 1, an appropriation to the Public Facilities Authority and project financing provided by the authority from the appropriation may not include an amount to acquire works of art.\nA building for which the appropriation is less than $500,000 for construction or alteration or a building for which the commissioner of administration has determined that this section is inappropriate is exempt from the requirements of this section.\nIf an amount made available under subdivision 1 is not expended for works of art for the building, the unexpended portion is available to the Minnesota Board of the Arts for the commission or purchase of works of art for state buildings existing or for which an appropriation was made prior to June 15, 1983, and is not available to pay construction costs of the building.\nArt for a building on a public college or university campus shall be selected by the campus, in consultation with the Arts Board. Consideration of the artwork of faculty and students on that campus is encouraged.\nSections 574.26 to 574.32 do not apply to this section.",
	"repealed": false
}