{
	"id": "505.1793",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.1793",
	"title": "505.1793 PROPOSED LOCAL RIGHT-OF-WAY ACQUISITIONS; FILING.",
	"text": "To facilitate the acquisition of right-of-way required for public transportation and public utility and drainage easements, the governing body of a statutory or home rule charter city or town may file for record in the office of the county recorder or registrar of titles in the county in which right-of-way is to be acquired, orders or resolutions, as required by law, in the form of maps or plats showing right-of-way by course distance, bearing and arc length, and other rights or interests in land to be acquired as the governing body determines necessary. The map or plat must show by outline all tracts and parcels of land affected by the proposed acquisition. The map or plat must be subscribed by the mayor or chair of the governing body and prepared and certified by a licensed land surveyor. The certified map or plat is entitled to record without compliance with chapter 505.\nAmendments, alterations, rescissions, or vacations of orders, resolutions, maps, or plats so filed are entitled to record in the same manner. The recorder or registrar may make suitable notations on the appropriate map or plat affected by an amendment, alteration, rescission, or vacation to direct the attention of anyone examining the record to the proper map or plat.\nIf an error on a map or plat incorrectly defines the intended acquisition, but does not affect rights of interests to be acquired, a certificate may be prepared stating what the defect is, what the correct information is, and which map or plat the certificate affects. The certificate must be signed by a licensed land surveyor and subscribed by the mayor or chair of the governing body. The certificate must be filed for record in the office of the county recorder or registrar of titles in the county where the map or plat is filed. When filed, the certificate amends the map or plat. The recorder or registrar may make suitable notations on the map or plat to which the certificate refers to direct the attention of anyone examining the map or plat to the record of the certificate.\nMaps or plats filed for record under this section do not operate of themselves to transfer title to the property described and designated by appropriate parcel number, but the maps or plats are to be used for delineation purposes.\nLand acquisition by the governing body for public transportation and public utility and drainage easements by instrument of conveyance or by eminent domain proceedings may refer to the map or plat and parcel number, together with delineation of the parcel, as the only manner of description necessary for the acquisition.",
	"repealed": false
}