{
	"id": "290C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.04",
	"title": "290C.04 APPLICATIONS.",
	"text": "(a) A landowner may apply to enroll forest land for the sustainable forest incentive program under this chapter. The claimant must complete, sign, and submit an application to the commissioner by October 31 in order for the land to become eligible beginning in the next year. The application shall be on a form prescribed by the commissioners of revenue and natural resources and must include the information the commissioners deem necessary. At a minimum, the application must show the following information for the land and the claimant: (i) the claimant's Social Security number or state or federal business tax registration number and date of birth, (ii) the claimant's address, (iii) the claimant's signature, (iv) the county's parcel identification numbers for the tax parcels that completely contain the claimant's forest land that is sought to be enrolled, (v) the number of acres eligible for enrollment in the program, (vi) proof, in a form specified by the commissioner, that the claimant has executed and acknowledged in the manner required by law for a deed, and recorded, a covenant that the land is not and shall not be developed in a manner inconsistent with the requirements and conditions of this chapter, and (vii) a registration number for the forest management plan, issued by the commissioner of natural resources. The covenant shall state in writing that the covenant is binding on the claimant and the claimant's successor or assignee, and that it runs with the land for a period of not less than eight years unless the claimant requests termination of the covenant after a reduction in payments due to changes in the payment formula under section 290C.07 or as a result of executive action, the amount of payment a claimant is eligible to receive under section 290C.07 is reduced or limited. The commissioner shall specify the form of the covenant and provide copies upon request. The covenant must include a legal description that encompasses all the forest land that the claimant wishes to enroll under this section or the certificate of title number for that land if it is registered land. The commissioner of natural resources shall record the area eligible for enrollment into the Sustainable Forest Incentive Act as electronic geospatial data, as defined in section 16E.30, subdivision 10.\n(b) The commissioner shall provide by electronic means data sufficient for the commissioner of natural resources to determine whether the land qualifies for enrollment. The commissioner must make the data available within 30 days of receipt of the application filed by the claimant or by October 1, whichever is sooner. The commissioner of natural resources must notify the commissioner whether the land qualifies for enrollment within 30 days of the data being available, and if the land qualifies for enrollment, the commissioner of natural resources shall specify the number of qualifying acres per tax parcel.\n(c) The commissioner shall notify the claimant within 90 days after receipt of a completed application that either the land has or has not been approved for enrollment. A claimant whose application is denied may appeal the denial as provided in section 290C.13.\n(d) Within 90 days after the denial of an application, or within 90 days after the final resolution of any appeal related to the denial, the commissioner shall execute and acknowledge a document releasing the land from the covenant required under this chapter. The document must be mailed to the claimant and is entitled to be recorded.\n(e) The Social Security numbers collected from individuals under this section are private data as provided in section 13.355. The federal business tax registration number and date of birth data collected under this section are also private data on individuals or nonpublic data, as defined in section 13.02, subdivisions 9 and 12, but may be shared with county assessors for purposes of tax administration and with county treasurers for purposes of the revenue recapture under chapter 270A.",
	"repealed": false
}