{
	"id": "559.217",
	"url": "https://www.revisor.mn.gov/statutes/cite/559.217",
	"title": "559.217 CANCELLATION OF RESIDENTIAL PURCHASE AGREEMENT.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Purchase agreement\" means an earnest money contract, purchase agreement, or exercised option whether or not the instrument is subject to section 559.21.\n(c) \"Residential real property\" means real property, including vacant land, occupied by, or intended to be occupied by, in the aggregate, one to four families as their residence.\n(d) \"Suspend\" means to temporarily or permanently restrain or enjoin a cancellation proceeding under subdivision 3 or 4 pursuant to the provisions of section 559.211.\nEither the purchaser or the seller may cancel a purchase agreement for residential real property under this section. If either a seller or purchaser initiates a cancellation proceeding under this section and before completion of the proceeding the other party to the purchase agreement initiates a cancellation proceeding under this section, whether under subdivision 3 or 4, the purchase agreement is deemed canceled as of the date the second cancellation notice is served upon the other party to the purchase agreement under this section. Either party may later pursue legal remedies at law to recover the earnest money. A court shall make a determination of which party is entitled to the earnest money without regard to which party first initiated the cancellation proceeding and may consider the terms of the canceled purchase agreement in making its determination.\n(a) If a default occurs or an unfulfilled condition exists after the date specified for fulfillment in the terms of a purchase agreement for the conveyance of residential real property, which does not by its terms cancel the purchase agreement, the purchaser or the seller may initiate a cancellation by serving upon the other party to the purchase agreement and any third party that is holding earnest money under the purchase agreement a notice:\n(1) specifying the residential real property that is the subject of the purchase agreement, including the legal description;\n(2) specifying the purchase agreement by date and names of parties, and the unfulfilled condition or default; and\n(3) stating that the purchase agreement will be canceled 15 days after service of the notice upon the other party to the purchase agreement unless prior to the cancellation date the party upon whom the notice is served complies with the conditions in default and completes the unfulfilled conditions, including, if applicable, completion of the purchase or sale of the residential real property according to the terms of the purchase agreement.\n(b) The notice to initiate a cancellation under this subdivision must be served in the manner provided in section 559.21, subdivision 4, paragraphs (a) and (b). The notice required by this subdivision must be given notwithstanding any provisions in the purchase agreement to the contrary.\n(c) The purchase agreement is canceled unless, within 15 days after the service of the notice upon the other party to the purchase agreement, the party upon whom the notice was served fully complies with the conditions in default and completes the unfulfilled conditions or secures from a court an order suspending the cancellation.\n(a) If an unfulfilled condition exists after the date specified for fulfillment in the terms of a purchase agreement for the conveyance of residential real property, which by the terms of the purchase agreement cancels the purchase agreement, either the purchaser or the seller may confirm the cancellation by serving upon the other party to the purchase agreement and any third party that is holding earnest money under the purchase agreement a notice:\n(1) specifying the residential real property that is the subject of the purchase agreement, including the legal description;\n(2) specifying the purchase agreement by date and names of parties, and the unfulfilled condition; and\n(3) stating that the purchase agreement has been canceled.\n(b) The notice to initiate a cancellation under this subdivision must be served in the manner provided in section 559.21, subdivision 4, paragraphs (a) and (b). The notice required by this subdivision may be given notwithstanding any provisions in the purchase agreement to the contrary.\n(c) The cancellation of the purchase agreement is complete, unless, within 15 days after the service of the notice upon the other party to the purchase agreement, the party upon whom the notice was served secures from a court an order suspending the cancellation.\n(a) For purposes of subdivision 3, the term \"notice\" means a writing stating the information required in subdivision 3, paragraph (a), stating the name, address, and telephone number of that party serving the notice or of an attorney authorized by such party to serve the notice, and including the following information in 12-point or larger underlined uppercase type, or 8-point type if published:\n\"THIS NOTICE IS TO INFORM YOU THAT BY THIS NOTICE THE (SELLER) (PURCHASER) (STRIKE ONE) HAS BEGUN PROCEEDINGS UNDER MINNESOTA STATUTES, SECTION 559.217, TO CANCEL YOUR PURCHASE AGREEMENT FOR THE (PURCHASE) (SALE) (STRIKE ONE) OF THE ABOVE PROPERTY FOR THE REASONS SPECIFIED IN THIS NOTICE. THE PURCHASE AGREEMENT WILL BE CANCELED ... DAYS AFTER (SERVICE OF THIS NOTICE UPON YOU) (THE FIRST DAY OF PUBLICATION OF THIS NOTICE) (STRIKE ONE) UNLESS BEFORE THEN:\n(A) YOU HAVE FULLY COMPLIED WITH ALL OF YOUR OBLIGATIONS UNDER THE PURCHASE AGREEMENT THAT WERE REQUIRED TO BE PERFORMED AS OF THE DATE OF SERVICE OF THIS NOTICE INCLUDING, WITHOUT LIMITATION, THE ITEMS OF DEFAULT SPECIFIED IN THIS NOTICE AND THE UNFULFILLED CONDITIONS SPECIFIED IN THIS NOTICE ARE COMPLETED, INCLUDING, IF APPLICABLE, COMPLETION OF THE PURCHASE OR SALE OF THE RESIDENTIAL REAL PROPERTY ACCORDING TO THE TERMS OF THE PURCHASE AGREEMENT; OR\n(B) YOU SECURE FROM A DISTRICT COURT AN ORDER THAT THE TERMINATION OF THE PURCHASE AGREEMENT BE SUSPENDED UNTIL YOUR CLAIMS OR DEFENSES ARE FINALLY DISPOSED OF BY TRIAL, HEARING, OR SETTLEMENT. YOUR ACTION MUST SPECIFICALLY STATE THOSE FACTS AND GROUNDS THAT DEMONSTRATE YOUR CLAIMS OR DEFENSES.\nIF YOU DO NOT DO ONE OR THE OTHER OF THE ABOVE THINGS WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE, YOUR PURCHASE AGREEMENT WILL BE CANCELED AT THE END OF THE PERIOD (AND YOU WILL LOSE ALL EARNEST MONEY YOU HAVE PAID ON THE PURCHASE AGREEMENT) (STRIKE IF NOT APPLICABLE); AND YOU MAY LOSE YOUR RIGHT TO ASSERT ANY CLAIMS OR DEFENSES THAT YOU MIGHT HAVE.\nHOWEVER, IF WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE YOU SERVE YOUR OWN NOTICE UNDER MINNESOTA STATUTES, SECTION 559.217, YOUR PURCHASE AGREEMENT WILL BE IMMEDIATELY CANCELED, BUT YOUR ENTITLEMENT TO EARNEST MONEY MUST BE DETERMINED BY A COURT OR DETERMINED BY ARBITRATION IF AGREED TO BY THE PARTIES.\nIF YOU HAVE ANY QUESTIONS ABOUT THIS NOTICE, CONTACT AN ATTORNEY IMMEDIATELY.\"\n(b) For purposes of subdivision 4, the term \"notice\" means a writing stating the information required in subdivision 4, paragraph (a), stating the name, address, and telephone number of the party serving the notice or of an attorney authorized by such party to serve the notice, and including the following information in 12-point or larger underlined uppercase type, or 8-point type if published:\n\"THIS NOTICE IS PURSUANT TO MINNESOTA STATUTES, SECTION 559.217, TO INFORM YOU THAT YOUR PURCHASE AGREEMENT FOR THE (PURCHASE) (SALE) (STRIKE ONE) OF THE ABOVE PROPERTY HAS BEEN CANCELED FOR THE REASONS SPECIFIED IN THIS NOTICE. THE CANCELLATION WILL BE CONFIRMED ... DAYS AFTER (SERVICE OF THIS NOTICE UPON YOU) (THE FIRST DAY OF PUBLICATION OF THIS NOTICE) (STRIKE ONE) UNLESS BEFORE THEN YOU SECURE FROM A DISTRICT COURT AN ORDER THAT THE CONFIRMATION OF CANCELLATION OF THE PURCHASE AGREEMENT BE SUSPENDED UNTIL YOUR CLAIMS OR DEFENSES ARE FINALLY DISPOSED OF BY TRIAL, HEARING, OR SETTLEMENT. YOUR ACTION MUST SPECIFICALLY STATE THOSE FACTS AND GROUNDS THAT DEMONSTRATE YOUR CLAIMS OR DEFENSES.\nIF YOU DO NOT OBTAIN SUCH A COURT ORDER WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE, THE CONFIRMATION OF CANCELLATION OF YOUR PURCHASE AGREEMENT WILL BE FINAL AT THE END OF THE PERIOD (AND YOU WILL LOSE ALL EARNEST MONEY YOU HAVE PAID ON THE PURCHASE AGREEMENT) (STRIKE IF NOT APPLICABLE); AND YOU MAY LOSE YOUR RIGHT TO ASSERT ANY CLAIMS OR DEFENSES THAT YOU MIGHT HAVE.\nHOWEVER, IF WITHIN THE TIME PERIOD SPECIFIED IN THIS NOTICE YOU SERVE YOUR OWN NOTICE UNDER MINNESOTA STATUTES, SECTION 559.217, YOUR PURCHASE AGREEMENT WILL BE IMMEDIATELY CANCELED, BUT YOUR ENTITLEMENT TO EARNEST MONEY MUST BE DETERMINED BY A COURT OR DETERMINED BY ARBITRATION IF AGREED TO BY THE PARTIES.\nIF YOU HAVE ANY QUESTIONS ABOUT THIS NOTICE, CONTACT AN ATTORNEY IMMEDIATELY.\"\nA seller or a purchaser upon whom the notice is served may commence a proceeding under section 559.211 to obtain a court order to suspend the cancellation of a purchase agreement under this section, and in the proceeding the court may award court filing fees, attorney fees, and costs of service actually expended to the prevailing party in an amount not to exceed $3,000.\n(a) After a cancellation under subdivision 3 or a confirmation of cancellation under subdivision 4, the purchase agreement is void and of no further force or effect, and, except as provided in subdivision 2, any earnest money held under the purchase agreement must be distributed to, and become the sole property of, the party completing the cancellation of the purchase agreement.\n(b) When a cancellation under this section has been completed, the party who served the notice, or that party's attorney, may execute an affidavit stating that the party caused a notice of cancellation to be served upon the other party, that the other party neither complied with the actions required in the notice, if applicable, nor obtained a court order suspending the cancellation, and that the property is residential real property.\n(c) A copy of the affidavit of cancellation, when attached to a copy of the notice, is prima facie evidence of the facts therein stated.\n(d) Except as provided in subdivision 2, the affidavit of cancellation, when delivered to a third party holding earnest money under the purchase agreement, is a sufficient basis for that person to release the earnest money to the party initiating and completing the cancellation.\n(e) If either a seller or purchaser commences a cancellation proceeding under this section and before completion of the first proceeding the other party initiates a cancellation proceeding under this section, either party or that party's attorney may execute an affidavit stating that both parties caused the notice of cancellation to be served upon the other party and further specifying the date the second notice of cancellation was served upon the other party. A copy of the affidavit of cancellation, when attached to copies of both notices of cancellation, is prima facie evidence of the cancellation of the purchase agreement and of the effective date of the cancellation of the purchase agreement.\nAny attorney authorized to serve the notice of cancellation by a party initiating a cancellation under this section is designated as the attorney who may receive service as agent for the party initiating the cancellation of all summons, complaints, orders, and motions made in connection with an action by the party upon whom the notice is served to restrain the cancellation, and any responsive notice of cancellation as described in subdivision 2. Service in the action and service of a responsive notice of cancellation may be made upon the party initiating the cancellation by personal service or by mailing a copy of the process or notice to such party or to such party's attorney, by first class mail, postage prepaid, to the address stated in the notice. Service upon a party by first class mail shall be effective upon delivery to the address stated in the notice.",
	"repealed": false
}