{
	"id": "161.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.165",
	"title": "161.165 COMMISSIONER ACTION; INTERSTATE HIGHWAYS.",
	"text": "This section applies to interstate highways.\n(a) If the appeal board recommends approval of the final layout or does not submit its findings and recommendations within 60 days of the hearing, in which case the final layout is deemed approved, the commissioner may prepare substantially similar final construction plans and proceed with the project.\n(b) If the final construction plans change access, traffic capacity, or acquisition of permanent right-of-way from the final layout approved by the appeal board, the commissioner shall submit the portion of the final construction plans that shows the changes, to the governing body for its approval or disapproval under section 161.164, subdivision 2.\n(a) If, within 60 days, the appeal board recommends approval of the final layout with modifications, the commissioner may:\n(1) prepare final construction plans with the recommended modifications, notify the governing body, and proceed with the project;\n(2) decide not to proceed with the project; or\n(3) prepare final construction plans substantially similar to the final layout referred to the appeal board, and proceed with the project. The commissioner shall, before proceeding with the project, file a written report with the governing body and the appeal board stating fully the reasons for doing so.\n(b) If the final construction plans contain changes in access or traffic capacity or require additional acquisition of permanent right-of-way from the final layout reviewed by the appeal board or the governing body, the commissioner shall resubmit the portion of the final construction plans that shows the changes, to the governing body for its approval or disapproval under section 161.164, subdivision 2.\n(a) If, within 60 days, the appeal board recommends disapproval of the final layout, the commissioner may either:\n(1) decide not to proceed with the project; or\n(2) prepare final construction plans substantially similar to the final layout referred to the appeal board, notify the governing body and the appeal board, and proceed with the project. Before proceeding with the project, the commissioner shall file a written report with the governing body and the appeal board stating fully the reasons for doing so.\n(b) If the final construction plans contain changes in access or traffic capacity or require additional acquisition of permanent right-of-way from the final layout reviewed by the appeal board or the governing body, the commissioner shall resubmit the portion of the final construction plans that shows the changes, to the governing body for its approval or disapproval under section 161.164, subdivision 2.\nThe commissioner shall send a complete set of final construction plans to the municipality at least 45 days before the bid opening for informational purposes.",
	"repealed": false
}