{
	"id": "168.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.10",
	"title": "168.10 REGISTRATION; COLLECTOR VEHICLE.",
	"text": "(a) Except as provided in subdivisions 1a, 1b, 1c, 1d, 1g, and 1h, every owner of any motor vehicle in this state, not exempted by section 168.012 or 168.26, shall as soon as registered ownership of a motor vehicle is acquired and annually thereafter during the period provided in section 168.31, file with the commissioner of public safety on a blank provided by the commissioner a listing for taxation and application for the registration of such vehicle, stating the first, middle and last names, the date of birth, and the address of the primary residence of each registered owner thereof who is a natural person or mailing address if the address of the primary residence has been classified as private data under this chapter, the full name and address of any other registered owner, the name and address of the person from whom purchased, make of motor vehicle, year and number of the model, manufacturer's identification number or serial number, type of body, the weight of the vehicle in pounds, for trailers only, its rated load carrying capacity and for buses only, its seating capacity, and such other information as the commissioner may require. Any false statement willfully and knowingly made in regard thereto shall be deemed perjury and punished accordingly. The listing and application for registration by dealers or manufacturers' agents within the state, of motor vehicles received for sale or use within the state shall be accepted as compliance with the requirements of this chapter, imposed upon the manufacturer.\n(b) Registration shall be refused a motor vehicle if the original identification or serial number has been destroyed, removed, altered, covered, or defaced. However, if the commissioner is satisfied on the sworn statements of the registered owner or registered owners or such other persons as the commissioner may deem advisable that the applicant is the legal owner, a special identification number in the form prescribed by the commissioner shall be assigned to the motor vehicle. When it has been determined that the number had been affixed to such vehicle in a manner prescribed by the commissioner, the vehicle may thereafter be registered in the same manner as other motor vehicles. In the case of a new or rebuilt motor vehicle manufactured or assembled without an identification or serial number, the commissioner may assign an identification number to the motor vehicle in the same manner as prescribed heretofore.\n(a) Any motor vehicle that: (1) was manufactured prior to 1936 or is a restored pioneer vehicle, as defined in section 168A.01, subdivision 16d; and (2) is owned and operated solely as a collector's item, shall be listed for taxation and registration as provided by paragraph (b).\n(b) An affidavit shall be executed stating the name and address of the owner, the name and address of the person from whom purchased, the make of the motor vehicle, year and number of the model, the manufacturer's identification number and that the vehicle is owned and operated solely as a collector's item and not for general transportation purposes. If the commissioner is satisfied that the affidavit is true and correct and the owner pays a $25 tax and the plate fee authorized under section 168.12, the commissioner shall list such vehicle for taxation and registration and shall issue a single number plate.\n(c) The number plate so issued shall bear the inscription \"Pioneer,\" \"Minnesota\" and the registration number or other combination of characters authorized under section 168.12, subdivision 2a, but no date. The number plate is valid without renewal as long as the vehicle is in existence in Minnesota. The commissioner has the power to revoke said plate for failure to comply with this subdivision.\n(a) Any motor vehicle manufactured between and including the years 1925 and 1948, and designated as a full classic car because of its fine design, high engineering standards, and superior workmanship, and owned and operated solely as a collector's item shall be listed for taxation and registration as follows: An affidavit shall be executed stating the name and address of the owner, the name and address of the person from whom purchased, the make of the motor vehicle, year and number of the model, the manufacturer's identification number, verification of the vehicle's full classic car status from nationally published standards and guides as determined by the registrar, and that the vehicle is owned and operated solely as a collector's item and not for general transportation purposes. If the commissioner is satisfied that the affidavit is true and correct and that the motor vehicle qualifies to be classified as a classic car, and the owner pays a $25 tax and the plate fee authorized under section 168.12, the commissioner shall list such vehicle for taxation and registration and shall issue a single number plate.\n(b) The number plate so issued shall bear the inscription \"Classic Car,\" \"Minnesota,\" and the registration number or other combination of characters authorized under section 168.12, subdivision 2a, but no date. The number plate is valid without renewal as long as the vehicle is in existence in Minnesota. The commissioner has the power to revoke said plate for failure to comply with this subdivision.\n(c) No commercial vehicles such as hearses, ambulances, or trucks are considered to be classic cars.\n(a) The owner of any self-propelled motor vehicle, including any truck, (1) that is (i) at least 20 model years old, or (ii) at least ten model years old and with a body or engine style of which not more than 500 were manufactured in or imported into the United States in any model year, (2) that was manufactured after 1935, and (3) that is owned and operated solely as a collector's vehicle, shall list the vehicle for taxation and registration as provided in paragraph (b).\n(b) The owner shall execute an affidavit stating (1) the name and address of the person from whom purchased and of the new owner, (2) the make of the motor vehicle, (3) the year and number of the model, (4) the manufacturer's identification number, (5) in the case of a vehicle described in paragraph (a), clause (1)(ii), that the vehicle has a body or engine style of which not more than 500 were manufactured or imported into the United States in any model year, and (6) that the vehicle is owned and operated solely as a collector's item and not for general transportation purposes.\n(c) The owner shall provide a statement of the manufacturer or importer regarding the number of vehicles manufactured or imported during the model year.\n(d) The owner shall also prove that the owner also has one or more vehicles with regular license plates.\n(e) If the commissioner is satisfied that the affidavit is true and correct and the owner pays a $25 tax and the plate fee authorized under section 168.12, the commissioner shall list the vehicle for taxation and registration and shall issue a single number plate.\n(f) The number plate issued shall bear the inscription \"Collector,\" \"Minnesota,\" and the registration number or other combination of characters authorized under section 168.12, subdivision 2a, but no date. The number plate is valid without renewal as long as the vehicle is in existence in Minnesota. The commissioner has the power to revoke the plate for failure to comply with this subdivision.\nAny modernized motor vehicle manufactured prior to the year 1949 or designed and manufactured to resemble such vehicle shall be listed for taxation and registration as follows:\nAn affidavit shall be executed stating the name and address of the person from whom purchased and of the new owner, the make of the motor vehicle, year number of model, and the manufacturer's identification number. The affidavit shall further state that the vehicle is owned and operated solely as a street rod and not for general transportation purposes. The owner must also prove that the owner has one or more vehicles with regular license plates. If the commissioner is satisfied that the affidavit is true and correct and the owner pays a $25 tax and the plate fee authorized under section 168.12, the commissioner shall list such vehicle for taxation and registration and shall issue a single number plate.\nThe number plate issued shall bear the inscription \"Street Rod,\" \"Minnesota,\" and the registration number or other combination of characters authorized under section 168.12, subdivision 2a, but no date. The number plate is valid without renewal as long as the vehicle is in existence in Minnesota. The commissioner has the power to revoke such plate for failure to comply with this subdivision.\nPioneer, classic, collector vehicles, collector military vehicles, or street rods, licensed or unlicensed, operable or inoperable, may be stored in compliance with local government zoning and ordinances on their owners' property, provided that the vehicles and any outdoor storage areas they may require are maintained in such a manner that they do not constitute a health or environmental hazard and are screened from ordinary public view by means of a fence, shrubbery, rapidly growing trees or other appropriate means. The appropriate local agency or authority may inform an owner of the owner's failure to comply with these requirements, and may order the vehicles removed from the outdoor storage area if the owner fails to comply with these requirements within 20 days after the warning.\nAny pioneer, classic, collector vehicle, collector military vehicle, or street rod shall have all equipment, in operating condition, which was specifically required by law as a condition for its first sale after manufacture.\nNo law requiring any particular equipment or specifying any standards to be met by motor vehicles shall apply to pioneer, classic, collector vehicles, collector military vehicles, or street rods unless it specifically so states.\nA vehicle registered pursuant to subdivision 1a, 1b, 1c or 1d may in lieu of being issued number plates by the commissioner display original Minnesota number plates issued in the same year as the model year of the car on which they are displayed. The number of the original plates must be provided to the commissioner. The original plates must be in good condition. Original Minnesota number plates shall not be used if the number on the original plate is identical to a number on any current plate or any other plate in a numbering system used by the commissioner without written authorization from the commissioner. Any person currently using plates issued pursuant to subdivision 1a, 1b, 1c or 1d shall return those plates to the commissioner before substituting original plates. The commissioner shall charge a fee in the amount specified for special plates under section 168.12, subdivision 5, for registering the number on original plates.\n(a) A motor vehicle, including a truck, shall be listed and registered under this section if it meets the following conditions:\n(1) it is at least 20 years old;\n(2) its first owner following its manufacture was a branch of the armed forces of the United States and it presently conforms to the vehicle specifications required during the time of military ownership, or it has been restored and presently conforms to the specifications required by a branch of the armed forces for the model year that the restored vehicle could have been owned by that branch of the armed forces; and\n(3) it is owned by a nonprofit organization and operated solely as a collector's vehicle. For purposes of this subdivision, \"nonprofit organization\" means a corporation, society, association, foundation, or institution organized and operated exclusively for historical or educational purposes, no part of the net earnings of which inures to the benefit of a private individual.\n(b) The owner of the vehicle shall execute an affidavit stating the name and address of the person from whom purchased and of the new owner; the make, year, and model number of the motor vehicle; the manufacturer's identification number; and the collector military vehicle identification number, if any, located on the exterior of the vehicle. The affidavit must affirm that the vehicle is owned by a nonprofit organization and is operated solely as a collector's item and not for general transportation purposes. If the commissioner is satisfied that the affidavit is true and correct and the owner pays a $25 tax and the plate fee authorized under section 168.12, the commissioner shall list the vehicle for taxation and registration and shall issue number plates. The number plates shall bear the inscriptions \"Collector\" and \"Minnesota\" and the registration number, but no date. The number plates are valid without renewal as long as the vehicle is in existence in Minnesota. The commissioner may revoke the plates for failure to comply with this subdivision.\n(c) Notwithstanding section 168.09, 168.12, or other law to the contrary, the owner of a registered collector military vehicle is not required to display registration plates on the exterior of the vehicle if the vehicle has an exterior number identification that conforms to the identifying system for military vehicles in effect when the vehicle was last owned by the branch of the armed forces of the United States or in effect in the year to which the collector military vehicle has been restored. However, the state registration plates must be carried in or on the collector military vehicle at all times.\n(d) The owner of a registered collector military vehicle that is not required to display registration plates under paragraph (c) may tow a registered trailer behind it. The trailer is not required to display registration plates if the trailer:\n(1) does not exceed a gross weight of 15,000 pounds;\n(2) otherwise conforms to registration, licensing, and safety laws and specifications;\n(3) conforms to military specifications for appearance and identification;\n(4) is intended to represent and does represent a military trailer; and\n(5) carries registration plates on or in the trailer or the collector military vehicle towing the trailer.\n(e) This subdivision does not apply to a decommissioned military vehicle that (1) was also manufactured and sold as a comparable civilian vehicle, and (2) has the same size dimensions and vehicle weight as the comparable civilian vehicle. A decommissioned military vehicle under this paragraph is eligible for a motor vehicle title under chapter 168A and is subject to the same registration, insurance, equipment, and operating requirements as a motor vehicle.\nNotwithstanding section 168.12, subdivision 1, on payment of a transfer fee of $5, plates issued under this section may be transferred to another vehicle owned or jointly owned by the person to whom the special plates were issued or the plate may be assigned to another owner. In addition to the transfer fee a new owner must pay the $25 tax and any fee required by section 168.12, subdivision 2a. The $5 fee must be paid into the state treasury and credited to the driver and vehicle services operating account under section 299A.705, subdivision 1. License plates issued under this section may not be transferred to a vehicle not eligible for the collector's vehicle license plates.\nUpon the installation of a new body or the addition to or change of type of any body in or upon any registered motor vehicle, the owner shall file with the registrar a new application setting forth such change, together with the payment of any additional tax to which the motor vehicle by such change has become subject, and shall apply for a revision of the registration made.\nIt shall be unlawful for any person:\n(1) to display or cause to be displayed or to possess any canceled, revoked, suspended or fraudulently obtained or stolen registration plates;\n(2) to lend the person's registration plates to another or knowingly to permit the use thereof by another;\n(3) to display or represent as the person's own any registration plates not issued to that person; provided, however, this shall not apply to any legal change of ownership of the motor vehicle to which the plates are attached, nor shall this apply to any transfer of collector plates under subdivision 1i;\n(4) to fail or refuse to surrender to the department upon its lawful demand any registration plates which have been revoked, canceled, or suspended by proper authority;\n(5) to use a false or fictitious name or address or description of the motor vehicle, identification number, or serial number in any application for registration of a motor vehicle or to knowingly make a false statement or to knowingly conceal a material fact or otherwise commit a fraud in any such application;\n(6) to destroy, alter, remove, cover or deface the identification or serial number of any motor vehicle or to knowingly operate any motor vehicle the identification or serial number of which has been destroyed, altered, removed, covered or defaced without first making application for assignment of a special identification number as provided by law.\nIt shall be a misdemeanor for any person to violate any of the provisions of this chapter unless such violation is by this chapter or other laws of this state declared to be a felony or gross misdemeanor.",
	"repealed": false
}