{
	"id": "254B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.09",
	"title": "254B.09 INDIAN RESERVATION ALLOCATION OF BEHAVIORAL HEALTH FUND.",
	"text": "The commissioner shall pay eligible vendors for substance use disorder services to American Indians on the same basis as other payments, except that no local match is required when an invoice is submitted by the governing authority of a federally recognized American Indian tribal body or a county if the tribal governing body has not entered into an agreement under subdivision 2 on behalf of a current resident of the reservation under this section.\nThe commissioner may enter into agreements with federally recognized tribal units to pay for substance use disorder treatment services provided under Laws 1986, chapter 394, sections 8 to 20. The agreements must clarify how the governing body of the tribal unit fulfills local agency responsibilities regarding the form and manner of invoicing.\n[Repealed, 1989 c 282 art 2 s 219]\n[Repealed, 1Sp2010 c 1 art 19 s 24]\n[Repealed, 1Sp2010 c 1 art 19 s 24]\nAfter entering into an agreement under subdivision 2, the governing authority of each reservation may submit invoices to the state for the cost of providing substance use disorder services to residents of the reservation according to the placement rules governing county placements, except that local match requirements are waived. The governing body may designate an agency to act on its behalf to provide placement services and manage invoices by written notice to the commissioner and evidence of agreement by the agency designated.\n[Repealed, 1Sp2010 c 1 art 19 s 24]\nThe commissioner may set rates for substance use disorder services to American Indians according to the American Indian Health Improvement Act, Public Law 94-437, for eligible vendors. These rates shall supersede rates set in county purchase of service agreements when payments are made on behalf of clients eligible according to Public Law 94-437.",
	"repealed": false
}