{
	"id": "144A.4792",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.4792",
	"title": "144A.4792 MEDICATION MANAGEMENT.",
	"text": "(a) This subdivision applies only to home care providers with a comprehensive home care license that provide medication management services to clients. Medication management services may not be provided by a home care provider who has a basic home care license.\n(b) A comprehensive home care provider who provides medication management services must develop, implement, and maintain current written medication management policies and procedures. The policies and procedures must be developed under the supervision and direction of a registered nurse, licensed health professional, or pharmacist consistent with current practice standards and guidelines.\n(c) The written policies and procedures must address requesting and receiving prescriptions for medications; preparing and giving medications; verifying that prescription drugs are administered as prescribed; documenting medication management activities; controlling and storing medications; monitoring and evaluating medication use; resolving medication errors; communicating with the prescriber, pharmacist, and client and client representative, if any; disposing of unused medications; and educating clients and client representatives about medications. When controlled substances are being managed, stored, and secured by the comprehensive home care provider, the policies and procedures must also identify how the provider will ensure security and accountability for the overall management, control, and disposition of those substances in compliance with state and federal regulations and with subdivision 22.\n(a) For each client who requests medication management services, the comprehensive home care provider shall, prior to providing medication management services, have a registered nurse, licensed health professional, or authorized prescriber under section 151.37 conduct an assessment to determine what medication management services will be provided and how the services will be provided. This assessment must be conducted face-to-face with the client. The assessment must include an identification and review of all medications the client is known to be taking. The review and identification must include indications for medications, side effects, contraindications, allergic or adverse reactions, and actions to address these issues.\n(b) The assessment must:\n(1) identify interventions needed in management of medications to prevent diversion of medication by the client or others who may have access to the medications; and\n(2) provide instructions to the client or client's representative on interventions to manage the client's medications and prevent diversion of medications.\n\"Diversion of medications\" means the misuse, theft, or illegal or improper disposition of medications.\nThe comprehensive home care provider must monitor and reassess the client's medication management services as needed under subdivision 2 when the client presents with symptoms or other issues that may be medication-related and, at a minimum, annually.\nThe home care provider must document in the client's record any refusal for an assessment for medication management by the client. The provider must discuss with the client the possible consequences of the client's refusal and document the discussion in the client's record.\n(a) For each client receiving medication management services, the comprehensive home care provider must prepare and include in the service plan a written statement of the medication management services that will be provided to the client. The provider must develop and maintain a current individualized medication management record for each client based on the client's assessment that must contain the following:\n(1) a statement describing the medication management services that will be provided;\n(2) a description of storage of medications based on the client's needs and preferences, risk of diversion, and consistent with the manufacturer's directions;\n(3) documentation of specific client instructions relating to the administration of medications;\n(4) identification of persons responsible for monitoring medication supplies and ensuring that medication refills are ordered on a timely basis;\n(5) identification of medication management tasks that may be delegated to unlicensed personnel;\n(6) procedures for staff notifying a registered nurse or appropriate licensed health professional when a problem arises with medication management services; and\n(7) any client-specific requirements relating to documenting medication administration, verifications that all medications are administered as prescribed, and monitoring of medication use to prevent possible complications or adverse reactions.\n(b) The medication management record must be current and updated when there are any changes.\n(c) Medication reconciliation must be completed when a licensed nurse, licensed health professional, or authorized prescriber is providing medication management.\nMedications may be administered by a nurse, physician, or other licensed health practitioner authorized to administer medications or by unlicensed personnel who have been delegated medication administration tasks by a registered nurse.\nWhen administration of medications is delegated to unlicensed personnel, the comprehensive home care provider must ensure that the registered nurse has:\n(1) instructed the unlicensed personnel in the proper methods to administer the medications, and the unlicensed personnel has demonstrated the ability to competently follow the procedures;\n(2) specified, in writing, specific instructions for each client and documented those instructions in the client's records; and\n(3) communicated with the unlicensed personnel about the individual needs of the client.\nEach medication administered by comprehensive home care provider staff must be documented in the client's record. The documentation must include the signature and title of the person who administered the medication. The documentation must include the medication name, dosage, date and time administered, and method and route of administration. The staff must document the reason why medication administration was not completed as prescribed and document any follow-up procedures that were provided to meet the client's needs when medication was not administered as prescribed and in compliance with the client's medication management plan.\nDocumentation of dates of medication setup, name of medication, quantity of dose, times to be administered, route of administration, and name of person completing medication setup must be done at the time of setup.\n(a) A home care provider who is providing medication management services to the client and controls the client's access to the medications must develop and implement policies and procedures for giving accurate and current medications to clients for planned or unplanned times away from home according to the client's individualized medication management plan. The policy and procedures must state that:\n(1) for planned time away, the medications must be obtained from the pharmacy or set up by a licensed nurse according to appropriate state and federal laws and nursing standards of practice;\n(2) for unplanned time away, when the pharmacy is not able to provide the medications, a licensed nurse or unlicensed personnel shall give the client or client's representative medications in amounts and dosages needed for the length of the anticipated absence, not to exceed seven calendar days;\n(3) the client or client's representative must be provided written information on medications, including any special instructions for administering or handling the medications, including controlled substances;\n(4) the medications must be placed in a medication container or containers appropriate to the provider's medication system and must be labeled with the client's name and the dates and times that the medications are scheduled; and\n(5) the client or client's representative must be provided in writing the home care provider's name and information on how to contact the home care provider.\n(b) For unplanned time away when the licensed nurse is not available, the registered nurse may delegate this task to unlicensed personnel if:\n(1) the registered nurse has trained the unlicensed staff and determined the unlicensed staff is competent to follow the procedures for giving medications to clients; and\n(2) the registered nurse has developed written procedures for the unlicensed personnel, including any special instructions or procedures regarding controlled substances that are prescribed for the client. The procedures must address:\n(i) the type of container or containers to be used for the medications appropriate to the provider's medication system;\n(ii) how the container or containers must be labeled;\n(iii) the written information about the medications to be given to the client or client's representative;\n(iv) how the unlicensed staff must document in the client's record that medications have been given to the client or the client's representative, including documenting the date the medications were given to the client or the client's representative and who received the medications, the person who gave the medications to the client, the number of medications that were given to the client, and other required information;\n(v) how the registered nurse shall be notified that medications have been given to the client or client's representative and whether the registered nurse needs to be contacted before the medications are given to the client or the client's representative;\n(vi) a review by the registered nurse of the completion of this task to verify that this task was completed accurately by the unlicensed personnel; and\n(vii) how the unlicensed staff must document in the client's record any unused medications that are returned to the provider, including the name of each medication and the doses of each returned medication.\nThe comprehensive home care provider must determine whether the comprehensive home care provider shall require a prescription for all medications the provider manages. The comprehensive home care provider must inform the client or the client's representative whether the comprehensive home care provider requires a prescription for all over-the-counter and dietary supplements before the comprehensive home care provider agrees to manage those medications.\nA comprehensive home care provider providing medication management services for over-the-counter drugs or dietary supplements must retain those items in the original labeled container with directions for use prior to setting up for immediate or later administration. The provider must verify that the medications are up-to-date and stored as appropriate.\nThere must be a current written or electronically recorded prescription as defined in section 151.01, subdivision 16a, for all prescribed medications that the comprehensive home care provider is managing for the client.\nPrescriptions must be renewed at least every 12 months or more frequently as indicated by the assessment in subdivision 2. Prescriptions for controlled substances must comply with chapter 152.\nVerbal prescription orders from an authorized prescriber must be received by a nurse or pharmacist. The order must be handled according to Minnesota Rules, part 6800.6200.\nWhen a written or electronic prescription is received, it must be communicated to the registered nurse in charge and recorded or placed in the client's record.\nA prescription or order received verbally, in writing, or electronically must be kept confidential according to sections 144.291 to 144.298 and 144A.44.\nWhen the comprehensive home care provider is aware of any medications or dietary supplements that are being used by the client and are not included in the assessment for medication management services, the staff must advise the registered nurse and document that in the client's record.\nA comprehensive home care provider providing storage of medications outside of the client's private living space must store all prescription medications in securely locked and substantially constructed compartments according to the manufacturer's directions and permit only authorized personnel to have access.\nA prescription drug, prior to being set up for immediate or later administration, must be kept in the original container in which it was dispensed by the pharmacy bearing the original prescription label with legible information including the expiration or beyond-use date of a time-dated drug.\nNo prescription drug supply for one client may be used or saved for use by anyone other than the client.\n(a) Any current medications being managed by the comprehensive home care provider must be given to the client or the client's representative when the client's service plan ends or medication management services are no longer part of the service plan. Medications that have been stored in the client's private living space for a client who is deceased or that have been discontinued or that have expired may be given to the client or the client's representative for disposal.\n(b) The comprehensive home care provider will dispose of any medications remaining with the comprehensive home care provider that are discontinued or expired or upon the termination of the service contract or the client's death according to state and federal regulations for disposition of medications and controlled substances.\n(c) Upon disposition, the comprehensive home care provider must document in the client's record the disposition of the medication including the medication's name, strength, prescription number as applicable, quantity, to whom the medications were given, date of disposition, and names of staff and other individuals involved in the disposition.\n(a) Comprehensive home care providers providing medication management must develop and implement procedures for loss or spillage of all controlled substances defined in Minnesota Rules, part 6800.4220. These procedures must require that when a spillage of a controlled substance occurs, a notation must be made in the client's record explaining the spillage and the actions taken. The notation must be signed by the person responsible for the spillage and include verification that any contaminated substance was disposed of according to state or federal regulations.\n(b) The procedures must require the comprehensive home care provider of medication management to investigate any known loss or unaccounted for prescription drugs and take appropriate action required under state or federal regulations and document the investigation in required records.",
	"repealed": false
}