{
	"id": "148.996",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.996",
	"title": "148.996 REGISTRY.",
	"text": "The commissioner of health shall maintain a registry of certified doulas who have met the requirements listed in subdivision 2.\nThe commissioner shall include on the registry any individual who:\n(1) submits an application on a form provided by the commissioner. The form must include the applicant's name, address, and contact information;\n(2) submits evidence of maintaining a current certification from one of the organizations listed in section 148.995, subdivision 2, or from an organization designated by the commissioner under section 148.9965; and\n(3) pays the fees required under section 148.997.\nThe commissioner shall conduct a criminal background check by reviewing the Bureau of Criminal Apprehension's website. If the review indicates that an applicant has been engaged in criminal behavior, the commissioner shall indicate this on the registry and provide a link to the Bureau of Criminal Apprehension's website.\nInclusion on the registry maintained by the commissioner is valid for three years, provided the doula meets the requirement in subdivision 2, clause (2), during the entire period. At the end of the three-year period, the certified doula may submit a new application to remain on the doula registry by meeting the requirements described in subdivision 2.\nThe commissioner shall provide a link to the registry on the Department of Health's website.\n(a) If the commissioner determines that a doula included on the registry does not meet the requirement in subdivision 2, clause (2), the commissioner shall notify the affected doula that the doula no longer meets the requirement in subdivision 2, clause (2), specify steps the doula must take to maintain inclusion on the registry, and specify the effect of failing to take such steps. The commissioner must provide this notice by first class mail to the address on file with the commissioner for the affected doula.\n(b) Following the provision of notice under paragraph (a), the commissioner shall remove from the registry any doula who no longer meets the requirement in subdivision 2, clause (2), and who does not take the steps specified by the commissioner to maintain inclusion on the registry.",
	"repealed": false
}