{
	"id": "462.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.14",
	"title": "462.14 APPRAISAL OF DAMAGE.",
	"text": "The council shall appoint five appraisers who shall be disinterested qualified voters of the city, and none of whom shall be a resident of the ward or wards in which any part of the district so designated is situate, to view the premises and appraise the damages which may be occasioned by the establishment of such restricted residence district and by the exercise by the city of the powers herein granted.\nThe appraisers shall be notified as soon as practicable by the city clerk, as the case may be, to attend at a time fixed, for the purpose of qualifying and entering upon their duties. When a vacancy may occur among the appraisers by neglect or refusal of any of them to act or otherwise, such vacancy shall be filled by the council.\nThe appraisers shall be sworn to discharge their duty as appraisers in the matter with impartiality and fidelity; and to make due return of their acts to the council.\nThe appraisers shall give notice, by publication in the official newspaper of the city, once a week for two consecutive weeks, which last publication shall be at least ten days before the day of such meeting, which notice shall contain a general description of the lands designated by the council, and give notice that a plat of the same has been filed in the office of the city clerk, and that the appraisers will meet at a place and time designated in the notice, and thence proceed to view the premises and appraise the damages which may be occasioned by the establishment of such restricted residence district and by the exercise by the city of the powers herein granted, and to assess benefits in the manner hereinafter specified.\nThe city clerk shall, after the first publication of such notice, and at least six days (Sunday excluded) prior to the meeting specified in said notice, serve upon each person having an interest as owner or mortgagee in each parcel of land in said district as shown by the records in the office of the county recorder a copy of the notice by depositing the same in the post office of the city, with first class postage prepaid, in an envelope bearing on its front in type no smaller than 10-point the words \"Notice of Restricted Residence District Proceedings Affecting Your Property\" or \"Notice of Proceedings to Vacate Restricted Residence Districts Affecting Your Property,\" as the case may be, directed to such person at the person's last known place of residence, if known to the city clerk, but if not known, then to the person's place of residence as given in the last published city directory of the city, if the person's name appears therein, or obtained from the records of such owner's address last given on tax receipts in the office of the county treasurer or auditor, or, in the case of mortgagees, to the address, if any, appearing in the mortgage.\nAfter the first publication of the notice, and at least six days (Sunday excluded) prior to the meeting specified in the notice, a copy of the same shall also be served upon the person in possession of each of the tracts or parcels of land, or some part thereof, if the same be actually occupied, in the same manner as provided for the service of summons in a civil action in the district court. A copy of all subsequent notices relating to said proceedings which are required to be published, shall be mailed by said clerk in the manner above specified, immediately after the first publication thereof, to owners and mortgagees in the manner and to the address above provided and to such persons as shall have appeared in said proceedings and requested in writing that such notice be mailed to them.\nAt the time and place mentioned in the notice, the appraisers shall meet and thence proceed to view the premises, and may hear the evidence or proof offered by the parties interested, and may adjourn from time to time for the purposes aforesaid. When their view and hearing shall be concluded they shall determine the amount of damages, if any, suffered by each piece or parcel of land of which each piece or parcel of land in the district is a part. They shall also determine the amount of benefits, if any, to each such piece or parcel of land. If the damages exceed the benefits to any particular piece, the excess shall be awarded as damages. If the benefits exceed the damages to any particular piece, the difference shall be assessed as benefits, but the costs of the proceedings, including printers' fees, appraisers' fees, cost of serving notices and other expenses, shall be added to the amount to be assessed. The total assessments for benefits, however, shall not be greater than the aggregate net award of damages, including the costs of the proceedings as above provided; and in every case the benefits assessed upon the several parcels shall be in proportion to the actual benefits received, and no assessment upon any particular piece shall exceed the amount of actual benefits after deducting the damages, if any.\nIf the land and buildings belong to different persons, or if the land be subject to lease, mortgage or judgment, or if there be any estate less than an estate in fee, the injury or damage done to such persons or interests respectively may be awarded to them separately by the appraisers. Neither such award of the appraisers, nor the confirmation thereof by the council shall be deemed to require the payment of such damages to the person or persons named in such award in case it shall transpire that such person or persons are not entitled to receive the same.\nThe appraisers having ascertained and appraised the damages and benefits as aforesaid, shall make and file with the city clerk a written report of their action in the premises, embracing a schedule and appraisement of the damages awarded and benefits assessed, with descriptions of the lands, and the names of the owners, if known to them and also a statement of the costs of the proceedings.\nUpon such report being filed, the city clerk shall give notice that such appraisement has been returned, and that the same will be considered by the council at a meeting thereof to be named in the notice, which notice shall be published in the official newspaper of the city, once a week for two consecutive weeks, and the last publication shall be at least ten days before such meeting. The council upon the day fixed for the consideration of such report, or at any subsequent meeting to which the same may stand over or be referred, shall have power in their discretion to confirm, revise or annul the appraisement and assessment, giving due consideration to any objections interposed by parties interested in the manner hereinafter specified, provided that the council shall not have the power to reduce the amount of any award, nor increase any assessment. In case the appraisement and assessment is annulled, the council may thereupon appoint new appraisers, who shall proceed, in like manner, as in case of the first appraisement, and upon the coming in of their report, the council shall proceed in a like manner and with the same powers as in the case of the first appraisement.\nIf not annulled or set aside, such awards shall be final, and shall be a charge upon the city, for the payment of which the credit of the city shall be pledged. Such assessments shall be and remain a lien and charge upon the respective lands until paid. The awards shall be paid to the persons entitled thereto, or shall be deposited and set apart in the treasury of the city for the use of the parties entitled thereto, within six months after the confirmation of the appraisement and award. In case any appeal or appeals shall be taken from the order confirming the appraisement and assessment, as hereinafter provided, then the time for payment of the awards shall be extended until and including 60 days after the final determination of all appeals taken in the proceeding, and in case of any change in the awards or assessments upon appeal, the council may, by resolution duly adopted, at any time within 60 days after the determination of all appeals, set aside the entire proceeding. Any awards so set aside shall not be paid, and the proceedings as to the tracts for which the awards are so set aside shall be deemed abandoned. Any awards not so set aside shall be a charge upon the city, for the payment of which the credit of the city shall be pledged. All awards shall bear interest at the rate of six percent per annum from the time of the filing of the original appraisers' report and all subsequent awards and awards upon appeal shall be made as of the day and date of filing of such original reports.\nUpon the conclusion of the proceedings and the payment of the awards, the several tracts of lands shall be deemed to be taken and appropriated for the purpose of sections 462.12 to 462.17, and the right above specified shall vest absolutely in the city in which the lands are situate. In case the council shall in any case be unable to determine to whom the damages should in any particular case be paid, or in case of adverse claim in relation thereto, or in case of the legal disability of any person interested, the council shall, and in any and every case, the council may in its discretion deposit the amount of damages with the district court of the county in which such lands are situate, for the use of the parties entitled thereto, and the court shall, upon the application of any person interested and upon such notice as the court shall prescribe, determine who is entitled to the award, and shall order the same paid accordingly. Any such deposit shall have the same effect as the payment to the proper persons.\nAny owner of land within the district who deems that there is any irregularity in the proceedings of the council, or action of the appraisers, by reason of which the award of the appraisers ought not to be confirmed, or who is dissatisfied with the amount of damages awarded, to the owner or the assessment thereon, may at any time before the time specified for the consideration of the award and assessment by the council, file with the city clerk, in writing, objections to such confirmation, setting forth therein specifically the particular irregularities complained of, and the particular objection to the award or assessment, and containing a description of the property in which the owner is interested, affected by such proceedings and the owner's interest therein, and if, notwithstanding such objections the council shall confirm the award, or assessment, such person so objecting shall have the right to appeal from such order of confirmation of the council to the district court of the county where such land is situate, within 20 days after such order. Such appeals shall be made by serving a written notice of appeal upon the city clerk which shall specify the property of the appellant affected by such award and refer to the objection filed as aforesaid, thereupon the city clerk, at the expense of the appellant, shall make out and transmit to the court administrator of the district court a copy of the record of the entire proceedings, and of the award of the appraisers as confirmed by the council and of the order of the council confirming the same, and of the objections filed by the appellant, as aforesaid, and of the notice of appeal, all certified by the city clerk to be true copies, within ten days after the taking of such appeal. If more than one appeal be taken from any award, it shall not be necessary that the city clerk in appeals subsequent to the first, shall send up anything but a certified copy of the appellant's objections. There shall be no pleading on any appeal, but the court shall determine in the first instance whether there was in the proceedings any such irregularity or omission of duty prejudicial to the appellant and specified in the appellant's written objection that as to the appellant the award or assessment of the appraisers ought not to stand, and whether the appraisers had jurisdiction to take action in the premises.\nThe case may be brought on for hearing on eight days' notice, at any general or special term of the court, and the judgment of the court shall be to confirm or annul the proceedings, only so far as they affect the property of the appellant proposed to be included in the district or damaged or assessed, and described in the written objection. If the amount of damages or benefits assessed is complained of by the appellant, the court shall, if the proceedings are confirmed in other respects, appoint three disinterested qualified voters as appraisers to reappraise the damages and reassess benefits as to the property of appellant. The parties to the appeal shall be heard by the court upon the appointment of the appraisers. The court shall fix the time and place of meeting of the appraisers. They shall be sworn to the faithful discharge of their duties as appraisers, and proceed to view the premises and to hear the parties interested, with their allegations and proofs pertinent to the question of the amount of damages or benefits. The appraisers shall be governed by the same provisions in respect to the method of arriving at the amount of damages or benefits and in all other material respects as are provided in sections 462.12 to 462.17 for the government of appraisers appointed by the council. They shall, after the hearing and view of the premises, report to the court their award of damages and assessment of benefits in respect to the property of the appellant. The award shall be final unless set aside by the court. The motion to set aside shall be made within 15 days. If the report is set aside, the court may, in its discretion, recommit it to the same appraisers, or appoint new appraisers as it deems best. The court shall allow to the appraisers a reasonable compensation for their services, and make such award of costs on the appeal, including the compensation of appraisers as it deems just in the premises, and enforce the award by execution. If the court is of the opinion that the appeal was frivolous or vexatious, it may adjudge double costs against the appellant. An appeal may be taken from any final decision of the district court as in other civil cases.\nThe city council, for the purpose of realizing the funds for making such improvements and paying such damages and the costs of such proceeding may issue and sell special certificates of indebtedness, or special restricted residence district bonds, as it may decide, which shall entitle the holder thereof to all sums realized upon any such assessment, or if deemed advisable, a series of two or more certificates or bonds against any one assessment, the principal and interest being payable at fixed dates out of the fund collected from such assessments, including interest and penalties, and the whole of such fund is hereby pledged for the pro rata payment of such certificates or bonds and the interest thereon, as they severally become due. Such certificates or bonds may be made payable to the bearer, with interest coupons attached, and the city council may bind the city to make good deficiencies in the collection up to, but not exceeding, the principal and interest at the rate fixed as hereinafter provided and for the time specified in section 462.15. If the city, because of any such guaranty, shall redeem any certificate or bond, it shall thereupon be subrogated to the holder's rights. For the purpose of such guaranty, penalties collected shall be credited upon deficiencies of principal and interest before the city shall be liable. Such certificates or bonds shall be sold at public sale or by sealed proposals at a meeting of which at least two weeks' published notice shall be given to the purchaser who will pay the par value thereof at the lowest interest rate, and the certificates or bonds shall be drawn accordingly, but the rate of interest shall in no case exceed five percent per annum payable annually or semiannually. The city clerk shall certify to the county auditor the rate of interest to be determined, and interest shall be computed upon the assessments at such annual rate, in accordance with the terms of section 462.15.",
	"repealed": false
}