{
	"id": "216I.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.21",
	"title": "216I.21 EMINENT DOMAIN POWERS; POWER OF CONDEMNATION.",
	"text": "Nothing in this section shall invalidate the power of eminent domain vested in utilities by statute or common law existing as of May 24, 1973, except to the extent modified herein. The power of eminent domain shall continue to exist for utilities and may be used according to law to accomplish any of the purposes and objectives of this chapter, including acquisition of the right to utilize existing high-voltage transmission facilities which are capable of expansion or modification to accommodate both existing and proposed conductors. Notwithstanding any law to the contrary, all easement interests shall revert to the then fee owner if a route is not used for high-voltage transmission line purposes for a period of five years.\nIn eminent domain proceedings by a utility for the acquisition of real property proposed for construction of a route or a site, the proceedings shall be conducted in the manner prescribed in chapter 117, except as otherwise specifically provided in this section.\nWhen such property is acquired by eminent domain proceedings or voluntary purchase and the amount the owner shall receive for the property is finally determined, the owner who is entitled to payment may elect to have the amount paid in not more than ten annual installments, with interest on the deferred installments, at the rate of eight percent per annum on the unpaid balance, by submitting a written request to the utility before any payment has been made. After the first installment is paid the petitioner may make its final certificate, as provided by law, in the same manner as though the entire amount had been paid.\n(a) When private real property that is an agricultural or nonagricultural homestead, nonhomestead agricultural land, rental residential property, and both commercial and noncommercial seasonal residential recreational property, as those terms are defined in section 273.13 is proposed to be acquired for the construction of a site or route for a high-voltage transmission line with a capacity of 200 kilovolts or more by eminent domain proceedings, the owner shall have the option to require the utility to condemn a fee interest in any amount of contiguous, commercially viable land which the owner wholly owns in undivided fee and elects in writing to transfer to the utility within 60 days after receipt of the notice of the objects of the petition filed pursuant to section 117.055. Commercial viability shall be determined without regard to the presence of the utility route or site. Within 60 days after receipt by the utility of an owner's election to exercise this option, the utility shall provide written notice to the owner of any objection the utility has to the owner's election, and if no objection is made within that time, any objection shall be deemed waived. Within 120 days of the service of an objection by the utility, the district court having jurisdiction over the eminent domain proceeding shall hold a hearing to determine whether the utility's objection is upheld or rejected. The utility has the burden of proof to prove by a preponderance of the evidence that the property elected by the owner is not commercially viable. The owner shall have only one such option and may not expand or otherwise modify an election without the consent of the utility. The required acquisition of land pursuant to this subdivision shall be considered an acquisition for a public purpose and for use in the utility's business, for purposes of chapter 117 and section 500.24, respectively; provided that a utility shall divest itself completely of all such lands used for farming or capable of being used for farming not later than the time it can receive the market value paid at the time of acquisition of lands less any diminution in value by reason of the presence of the utility route or site. Upon the owner's election made under this subdivision, the easement interest over and adjacent to the lands designated by the owner to be acquired in fee, sought in the condemnation petition for a right-of-way for a high-voltage transmission line with a capacity of 200 kilovolts or more shall automatically be converted into a fee taking.\n(b) All rights and protections provided to an owner under chapter 117 apply to acquisition of land or an interest in land under this section.\n(c) Within 120 days of an owner's election under this subdivision to require the utility to acquire land, or 120 days after a district court decision overruling a utility objection to an election made pursuant to paragraph (a), the utility must make a written offer to acquire that land and amend its condemnation petition to include the additional land.\n(d) For purposes of this subdivision, \"owner\" means the fee owner, or when applicable, the fee owner with the written consent of the contract for deed vendee, or the contract for deed vendee with the written consent of the fee owner.\nA utility shall notify by certified mail each person who has transferred any interest in real property to the utility after July 1, 1974, but prior to the effective date of Laws 1977, chapter 439, for the purpose of a site or route that the person may elect in writing within 90 days after receipt of notice to require the utility to acquire any remaining contiguous parcel of land pursuant to this section or to return any payment to the utility and require it to make installment payments pursuant to this section.",
	"repealed": false
}