{
	"id": "48.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.24",
	"title": "48.24 RESTRICTIONS UPON TOTAL LIABILITIES TO A BANK.",
	"text": "The total liabilities to any such bank, as principal, guarantor or endorser of any individual, including the liabilities of any corporation or limited liability company in which the individual owns or controls a majority interest, any partnership, unincorporated association, limited liability company, or corporation, including the liabilities of the several members of an unincorporated association and including the liabilities of the general partners but not the limited partners of a partnership, and in case of a corporation or limited liability company, of all subsidiaries thereof in which such corporation or limited liability company owns or controls a majority interest, shall never exceed 20 percent of the bank's capital actually paid in cash and of its actual surplus fund, except that obligations not to exceed 25 percent of said capital and surplus to any one borrower shall not be included as liabilities for the purposes of this section, but shall be liabilities of the borrowers, provided they are secured by not less than a like amount of any one of the various types of obligations of the United States or which are fully guaranteed as to principal and interest by the United States, and providing that such bonds or obligations have a market value of at least ten percent in excess of the amount loaned thereon at the time each loan is made.\nLiabilities include any credit exposure to an individual arising from a derivative transaction. The term \"derivative transaction\" includes any transaction that is a contract, agreement, swap, or note that is based, in whole or in part, on the value of, any interest in, or any quantitative measure or the occurrence of any event relating to, one or more currencies, interest or other rates, or interest rate indices, and that is subject to regulation by the commissioner of commerce.\nFor the purpose of this section the members of a family living together in one household, if borrowed funds are to be used in the conduct of a common enterprise, shall be regarded as one person and the total liabilities of the members of the family shall be limited as herein provided. The endorser or guarantor of any obligation which is exempt from loaning limits according to the provisions of this section shall also be exempt from such loaning limits to the extent of the amount of liability on such obligations for the purposes of this section but shall be liable thereon. Individual extensions of credit which result in liabilities of individuals, corporations, or limited liability companies exceeding the limitations set forth in this section shall be construed to conform to the provisions of this subdivision upon reduction in an amount sufficient to reduce the total liability to not more than the legal amount, but until paid in full shall not exempt the officer or employee of the bank from being personally liable to the bank for the amount of the original excess portion of the loan as set forth in subdivision 8.\nLoans not exceeding 25 percent of such capital and surplus made upon first mortgage security on improved real estate in any state in which the bank or a detached facility of the bank is located, or in any state adjoining a state in which the bank or a detached facility of the bank is located, shall not constitute a liability of the maker of the notes secured by such mortgages within the meaning of the foregoing provision limiting liability, but shall be an actual liability of the maker. These mortgage loans shall be limited to, and in no case exceed, 50 percent of the cash value of the security covered by the mortgage, except mortgage loans guaranteed as provided by the Servicemen's Readjustment Act of 1944, as now or hereafter amended, or for which there is a commitment to so guarantee or for which a conditional guarantee has been issued, which loans shall in no case exceed 60 percent of the cash value of the security covered by such mortgage. For the purposes of this subdivision, real estate is improved when substantial and permanent development or construction has contributed substantially to its value, and agricultural land is improved when farm crops are regularly raised on such land without further substantial improvements.\nConditional sales contracts or other paper evidencing an agreement to purchase or lease personal property owned and guaranteed by the person discounting same, not to exceed 30 percent of the capital stock and surplus, taken from any one person, shall not constitute a liability within the meaning of this section, but the actual liabilities on such agreements are not to be construed as affected by the provisions of this subdivision: Provided, however, if information as to the financial condition of each purchaser or lessee is reasonably adequate by reason of the bank's own records or actual knowledge of an officer of the bank and, upon written certification by an officer appointed by the bank's board of directors for that purpose, that the responsibility of each purchaser or lessee has been evaluated and the bank is relying primarily upon the purchaser or lessee for the payment of the obligation, the limitations of subdivision 1 as to each purchaser or lessee shall be the sole applicable loan limitation.\n[Repealed, 1993 c 257 s 49]\nLoans or obligations shall not be subject under this section to any limitation based upon such capital and surplus to the extent that they are secured or covered by guarantees, or by commitments or agreements to take over or to purchase the same, made by:\n(1) the Minnesota Department of Agriculture;\n(2) any Federal Reserve bank;\n(3) the United States or any department, bureau, board, commission, or establishment of the United States, including any corporation wholly owned directly or indirectly by the United States;\n(4) the Minnesota Employment and Economic Development Department; or\n(5) a municipality or political subdivision within Minnesota to the extent that the guarantee or collateral is a valid and enforceable general obligation of that political body.\nThe discount of the following classes of paper shall not be regarded as creating liability within the meaning of this section:\n(1) Bonds, orders, warrants, or other evidences of indebtedness of the United States, of federal land banks, of this state or of any county, city, town, hospital district, or school district in this state, or of the bonds, representing general obligation of any other state in the United States, or bonds and obligations of the federal home loan banks established by act of Congress known as the Federal Home Loan Bank Act, approved July 23, 1932, and acts amendatory thereto, or debentures and other obligations of the federal intermediate credit banks established by act of Congress known as the Federal Intermediate Credit Banks Act, approved March 4, 1923, and acts amendatory thereto, in obligations issued by the banks for cooperatives or any of them, and in bonds and obligations of the home owners' loan corporation established by act of Congress, known as the Home Owners' Loan Act of 1933, and acts amendatory thereto, in exchange for mortgages on homes, or contracts for deed, or real estate held by it.\n(2) Bills of exchange drawn in good faith against actually existing values, including bills which are secured by shipping documents conveying or securing title to goods shipped, and which are not to be surrendered until such bills are paid in cash or solvent credits. This includes bankers' acceptances or participations in bankers' acceptances of the kind and maturities made eligible by law for rediscount with, or purchase by, Federal Reserve banks, providing the same are accepted or endorsed by a bank or trust company incorporated under the laws of this state; or by any bank or trust company in the United States which is a member of the Federal Reserve system.\n(3) Paper based upon the collateral security of warehouse receipts covering agricultural or manufactured products stored in elevators or warehouses under the following conditions:\nFirst, when the actual market value of the property covered by such receipts at all times exceeds by at least ten percent the amount loaned thereon, and\nSecond, when the full amount of every such loan is at all times covered by fire insurance in duly authorized companies, within the limit of their ability to cover such amounts, and the excess, if any, in companies having sufficient paid-up capital to authorize their admission, and payable, in case of loss, to the bank or holder of the warehouse receipt.\n(4) Total loans to an obligor secured by segregated deposit accounts in the lending bank, provided that a security interest in the deposit has been perfected. Where the deposit is eligible for withdrawal before the secured loan matures, the bank shall establish internal procedures to prevent release of the deposit without the lending bank's prior consent.\n(5) Debentures issued under the authority of the federal National Mortgage Association.\n(6) Obligations representing loans from one business day to the next to any state bank or national banking association of excess reserve balances from time to time maintained under the provisions of section 48.221, or of section 19 of the Federal Reserve Act, as amended, United States Code, title 12, sections 461 et seq.\nObligations of any individual or organization, however organized, in the form of notes or drafts secured by shipping documents or instruments transferring or securing title covering feeder livestock which is free from all other encumbrances, when the market value of the livestock securing the obligation at the time of the making of the loan is not less than 115 percentum of the face amount of the notes covered by such documents, shall be subject under this subdivision to a limitation of 20 percent of capital and surplus in addition to 20 percent of capital and surplus as included in provisions of subdivision 1. Feeder livestock loans as referred to in this subdivision is defined to include only obligations secured by liens or giving title to cattle, sheep, goats, hogs or poultry being fattened for market, but excluding dairy cattle, milk goats, poultry used for production of eggs, or barnyard or work animals.\nPursuant to such rules as the commissioner of commerce finds to be necessary and proper, if any, the liability or obligation to a bank of any insurance company admitted and authorized to do business in this state shall not be subject under this section to any limitation based upon such capital and surplus to the extent that such insurance company issues policies or certificates of indemnity of mortgage guaranty insurance.\nFor the purposes of this subdivision \"mortgage guaranty insurance\" shall mean insurance against financial loss by reason of nonpayment of principal, interest and other sums agreed to be paid under the terms of any note, bond, mortgage, security agreement, or other instrument constituting a first lien, security interest or charge on real property or manufactured homes.\nWhen a bank shall allow any individual, partnership, limited liability company, unincorporated association, or corporation, or any officer or director of the bank, to become indebted to it, directly or indirectly, in excess of the amount, exclusive of interest permitted by the laws of this state, the officer or employee of the bank willfully permitting or approving the loan shall be guilty of a gross misdemeanor and, in addition thereto, shall be personally liable to the bank for the amount of the loan in excess of the statutory limit.\nThis section does not prohibit the bank from advancing funds that may be reasonably necessary to avoid loss on a loan or investment made subject to this section or an obligation created in good faith. The rights under this subdivision are in addition to and not inconsistent with section 48.21.\nObligations of any individual or organization, however organized, where the note is secured by a perfected first lien on stored grain and a perfected assignment of the proceeds of a forward contract for sale of the grain (1) with a recognized commodity buyer or broker, reasonably satisfactory to the bank, (2) where the delivery of grain under the contract will occur within 270 days, (3) where the grain is insured for full value against loss by fire or other casualty, and (4) where the value of the forward contract exceeds 115 percent of the face amount of the secured note, is subject under this subdivision to a limitation of ten percent of capital and surplus in addition to the 20 percent of capital and surplus as included in subdivision 1.",
	"repealed": false
}