{
	"id": "16B.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.85",
	"title": "16B.85 RISK MANAGEMENT.",
	"text": "The commissioner may implement programs of insurance or alternatives to the purchase of conventional insurance. This authority does not extend to areas of risk subject to: (1) collective bargaining agreements, (2) plans established under section 43A.18, or (3) programs established under sections 176.541 to 176.611, except for the Department of Administration. The mechanism for implementing possible alternatives to conventional insurance is the risk management fund created in subdivision 2.\n(a) All state agencies, political subdivisions, and the Minnesota State Colleges and Universities, may, in cooperation with the commissioner, participate in insurance programs and other funding alternative programs provided by the risk management fund.\n(b) When an entity described in paragraph (a) enters into an insurance or self-insurance program, each entity shall contribute the appropriate share of its costs as determined by the commissioner.\n(c) The money in the fund to pay claims arising from state activities and for administrative costs, including costs for the adjustment and defense of the claims, is appropriated to the commissioner.\n(d) Interest earned from the investment of money in the fund shall be credited to the fund and be available to the commissioner for the expenditures authorized in this subdivision.\n(e) The fund is exempt from the provisions of section 16A.152, subdivision 4. In the event that proceeds in the fund are insufficient to pay outstanding claims and associated administrative costs, the commissioner, in consultation with the commissioner of management and budget, may assess entities participating in the fund amounts sufficient to pay the costs. The commissioner shall determine the proportionate share of the assessment of each entity.\nThe commissioner shall:\n(1) review the state's exposure to various types of potential risks in consultation with affected entities and advise them as to the reduction of risk and fiscal management of those losses;\n(2) be responsible for statewide risk management coordination, evaluation of funding and insuring alternatives, and the approval of all insurance purchases in consultation with affected entities;\n(3) identify ways to eliminate redundant efforts in the management of state risk management and insurance programs;\n(4) maintain the state risk management information system; and\n(5) administer and maintain the state risk management fund.\nThe commissioner may request bids from insurance carriers or negotiate with insurance carriers and may enter into contracts of insurance carriers that in the judgment of the division are best qualified to underwrite and service the insurance programs.\nA state agency, including an entity defined as a part of the state in section 3.732, subdivision 1, clause (1), may procure insurance against liability of the agency and its employees for damages resulting from the torts of the agency and its employees. The procurement of this insurance constitutes a waiver of the limits of governmental liability under section 3.736, subdivisions 4 and 4a, only to the extent that valid and collectible insurance, including where applicable, proceeds from the Minnesota Insurance Guaranty Association, exceeds those limits and covers the claim. Purchase of insurance has no other effect on the liability of the agency and its employees. Procurement of commercial insurance, participation in the risk management fund under this section, or provisions of an individual self-insurance plan with or without a reserve fund or reinsurance does not constitute a waiver of any governmental immunities or exclusions.",
	"repealed": false
}