{
	"id": "342.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.73",
	"title": "342.73 CANNABIS GROWER GRANTS.",
	"text": "The office, in consultation with the commissioner of agriculture, shall establish CanGrow, a program to award grants to (1) eligible organizations to help farmers navigate the regulatory structure of the legal cannabis industry, and (2) nonprofit corporations to fund loans to farmers for expansion into the legal cannabis industry.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Eligible organization\" means any organization capable of helping farmers navigate the regulatory structure of the legal cannabis industry, particularly individuals facing barriers to education or employment, and may include educational institutions, nonprofit organizations, private businesses, community groups, units of local government, or partnerships between different types of organizations.\n(c) \"Industry\" means the legal cannabis industry in the state of Minnesota.\n(d) \"Program\" means the CanGrow grant program.\n(e) \"Social equity applicant\" means a person who meets the qualification requirements in section 342.17.\n(a) Grant money awarded to eligible organizations may be used for both developing technical assistance resources relevant to the regulatory structure of the legal cannabis industry and for providing such technical assistance or navigation services to farmers.\n(b) The office must award grants to eligible organizations through a competitive grant process.\n(c) To receive grant money, an eligible organization must submit a written application to the office, using a form developed by the office, explaining the organization's ability to assist farmers in navigating the regulatory structure of the legal cannabis industry, particularly farmers facing barriers to education or employment.\n(d) An eligible organization's grant application must also include:\n(1) a description of the proposed technical assistance or navigation services, including the types of farmers targeted for assistance;\n(2) any evidence of the organization's past success in providing technical assistance or navigation services to farmers, particularly farmers who live in areas where long-term residents are eligible to be social equity applicants;\n(3) an estimate of the cost of providing the technical assistance;\n(4) the sources and amounts of any nonstate funds or in-kind contributions that will supplement grant money, including any amounts that farmers will be charged to receive assistance; and\n(5) any additional information requested by the office.\n(e) In awarding grants under this subdivision, the office shall give weight to applications from organizations that demonstrate a history of successful technical assistance or navigation services, particularly for farmers facing barriers to education or employment. The office shall also give weight to applications where the proposed technical assistance will serve areas where long-term residents are eligible to be social equity applicants. The office shall fund technical assistance to farmers throughout the state.\n(a) The CanGrow revolving loan account is established in the special revenue fund. Money in the account, including interest, is appropriated to the office to make loan financing grants under the CanGrow program.\n(b) The office must award grants to nonprofit corporations through a competitive grant process.\n(c) To receive grant money, a nonprofit corporation must submit a written application to the office using a form developed by the office.\n(d) In awarding grants under this subdivision, the office shall give weight to whether the nonprofit corporation:\n(1) has a board of directors that includes individuals experienced in agricultural business development;\n(2) has the technical skills to analyze projects;\n(3) is familiar with other available public and private funding sources and economic development programs;\n(4) can initiate and implement economic development projects;\n(5) can establish and administer a revolving loan account; and\n(6) has established relationships with communities where long-term residents are eligible to be social equity applicants.\nThe office shall make grants that will help farmers enter the legal cannabis industry throughout the state.\n(e) A nonprofit corporation that receives grants under the program must:\n(1) establish an office-certified revolving loan account for the purpose of making eligible loans; and\n(2) enter into an agreement with the office that the office shall fund loans that the nonprofit corporation makes to farmers entering the legal cannabis industry. The office shall review existing agreements with nonprofit corporations every five years and may renew or terminate an agreement based on that review. In making this review, the office shall consider, among other criteria, the criteria in paragraph (d).\n(a) The criteria in this subdivision apply to loans made by nonprofit corporations under the program.\n(b) A loan must be used to support a farmer in entering the legal cannabis industry. Priority must be given to loans to businesses owned by farmers who are eligible to be social equity applicants and businesses located in communities where long-term residents are eligible to be social equity applicants.\n(c) Loans must be made to businesses that are not likely to undertake the project for which loans are sought without assistance from the program.\n(d) The minimum state contribution to a loan is $2,500 and the maximum is either:\n(1) $50,000; or\n(2) $150,000, if state contributions are matched by an equal or greater amount of new private investment.\n(e) Loan applications given preliminary approval by the nonprofit corporation must be forwarded to the office for approval. The office must give final approval for each loan made by the nonprofit corporation under the program.\n(f) If the borrower has met lender criteria, including being current with all payments for a minimum of three years, the office may approve either full or partial forgiveness of interest or principal amounts.\n(a) The office shall establish a minimum interest rate for loans or guarantees to ensure that necessary loan administration costs are covered. The interest rate charged by a nonprofit corporation for a loan under this section must not exceed the Wall Street Journal prime rate. For a loan under this section, the nonprofit corporation may charge a loan origination fee equal to or less than one percent of the loan value. The nonprofit corporation may retain the amount of the origination fee.\n(b) Loan repayment of principal must be paid to the office for deposit in the CanGrow revolving loan account. Loan interest payments must be deposited in a revolving loan account created by the nonprofit corporation originating the loan being repaid for further distribution or use, consistent with the criteria of this section.\n(c) Administrative expenses of the nonprofit corporations with whom the office enters into agreements, including expenses incurred by a nonprofit corporation in providing financial, technical, managerial, and marketing assistance to a business receiving a loan under this section, are eligible program expenses that the office may agree to pay under the grant agreement.\nThe office shall make extensive efforts to publicize these grants, including through partnerships with community organizations, particularly those located in areas where long-term residents are eligible to be social equity applicants.\n(a) A nonprofit corporation that receives a grant under subdivision 4 shall:\n(1) submit an annual report to the office by January 15 of each year that the nonprofit corporation participates in the program that includes a description of agricultural businesses supported by the grant program, an account of loans made during the calendar year, the program's impact on farmers' ability to expand into the legal cannabis industry, the source and amount of money collected and distributed by the program, the program's assets and liabilities, and an explanation of administrative expenses; and\n(2) provide for an independent annual audit to be performed in accordance with generally accepted accounting practices and auditing standards and submit a copy of each annual audit report to the office.\n(b) By February 15, 2024, and each February 15 thereafter, the office must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over agriculture that details awards given through the CanGrow program and the use of grant money, including any measures of success toward helping farmers enter the legal cannabis industry. The report must include geographic information regarding the issuance of grants and loans under this section, the repayment rate of loans issued under subdivision 5, and a summary of the amount of loans forgiven.",
	"repealed": false
}