{
	"id": "103E.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.601",
	"title": "103E.601 DRAINAGE LIEN STATEMENT.",
	"text": "When the contract for the construction of a drainage project is awarded, the auditor of an affected county shall make a statement showing the total cost of the drainage project with the estimated cost of all items required to complete the work. The cost must be prorated to each tract of property affected in direct proportion to the benefits. The cost, less any damages, is the amount of liability for each tract for the drainage project. The property liability must be shown in the tabular statement as provided in subdivision 2, opposite the property owner's name and description of each tract of property. The amount of liability on a tract of property for establishment and construction of a drainage project may not exceed the benefits determined in the proceedings that accrue to the tract.\nThe auditor of each affected county shall make a lien statement in tabular form showing:\n(1) the names of the property owners, corporate entities, or political subdivisions of the county benefited or damaged by the construction of the drainage project in the viewers' report as approved by the final order for establishment;\n(2) the description of the property in the viewers' report, and the total number of acres in each tract according to the county tax lists;\n(3) the number of acres benefited or damaged in each tract shown in the viewers' report;\n(4) the amount of benefits and damages to each tract of property as stated in the viewers' report and confirmed by the final order that established the drainage project unless the order is appealed and a different amount is set; and\n(5) the amount each tract of property will be liable for and must pay to the county for the establishment and construction of the drainage project.\nIf any items of the cost of the drainage project have been omitted from the original drainage lien statement, a supplemental drainage lien statement with the omitted items must be made and recorded in the same manner provided for a drainage lien statement. The total amount of the original drainage lien and any supplemental drainage liens may not exceed the benefits.\nThe lien against property in the drainage lien statement and supplemental drainage lien statements must be certified by the auditor and recorded on each tract by the county recorder of the county where the tract is located. The county recorder's fees for recording must be paid if allowed by the board. The drainage lien statement and any supplemental drainage lien statements, after recording, must be returned and preserved by the auditor.",
	"repealed": false
}