{
	"id": "297F.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.05",
	"title": "297F.05 RATES OF TAX; PERSONAL DEBT.",
	"text": "A tax is imposed upon the sale of cigarettes in this state, upon having cigarettes in possession in this state with intent to sell, upon any person engaged in business as a distributor, and upon the use or storage by consumers, at the rate of 152 mills, or 15.2 cents, on each cigarette.\n[Repealed, 1Sp2017 c 1 art 9 s 7]\nA person who distributes free packages of cigarettes is liable for the payment of tax under this chapter.\n(a) Except as provided in paragraphs (b) and (c) and subdivision 3a, a tax is imposed upon all tobacco products in this state and upon any person engaged in business as a distributor, at the rate of 95 percent of the wholesale sales price of the tobacco products. The tax is imposed at the time the distributor:\n(1) brings, or causes to be brought, into this state from outside the state tobacco products for sale;\n(2) makes, manufactures, or fabricates tobacco products in this state for sale in this state; or\n(3) ships or transports tobacco products to retailers in this state, to be sold by those retailers.\n(b) A tax equal to the greater of the tax imposed under paragraph (a) or a minimum tax equal to the rate imposed on a pack of 20 cigarettes weighing not more than three pounds per thousand, as established under subdivision 1, is imposed on each container of moist snuff weighing not more than 1.2 ounces. When more than one container subject to tax under this paragraph is packaged together, each container is subject to the minimum tax.\n(c) Except as provided in paragraph (b), a tax equal to the greater of the tax imposed under paragraph (a) or a minimum tax equal to the rate imposed on a pack of 20 cigarettes weighing not more than three pounds per thousand, as established under subdivision 1, multiplied by the number of ounces of moist snuff in the container, divided by 1.2, is imposed on each container of moist snuff weighing more than 1.2 ounces.\n(d) For purposes of this subdivision, a \"container\" means a consumer-size can, package, or other container that is marketed or packaged for sale to a retail purchaser.\n(a) A tax is imposed upon all premium cigars in this state and upon any person engaged in business as a tobacco product distributor, at the lesser of:\n(1) the rate of 95 percent of the wholesale sales price of the premium cigars; or\n(2) $0.50 per premium cigar.\n(b) The tax imposed under paragraph (a) is imposed at the time the tobacco products distributor:\n(1) brings, or causes to be brought, into this state from outside the state premium cigars for sale;\n(2) makes, manufactures, or fabricates premium cigars in this state for sale in this state; or\n(3) ships or transports premium cigars to retailers in this state, to be sold by those retailers.\nExcept as provided in subdivision 4a, a tax is imposed upon the use or storage by consumers of tobacco products in this state, and upon such consumers, at the rate of 95 percent of the cost to the consumer of the tobacco products or the minimum tax under subdivision 3, paragraph (b) or (c), whichever is greater.\nA tax is imposed upon the use or storage by consumers of all premium cigars in this state, and upon such consumers, at the lesser of:\n(1) the rate of 95 percent of the cost to the consumer of the premium cigars; or\n(2) $0.50 per premium cigar.\nA retailer or out-of-state retailer must, for any delivery sale, collect and pay to the state any use tax imposed by this section. The retailer or out-of-state retailer must give the purchaser a receipt for the tax paid.\nThe tax imposed by this chapter, and interest and penalties imposed with respect to it, is a personal debt of the person required to file a return from the time the liability for it arises, regardless of when the time for payment of the liability occurs. In the case of the executor or administrator of the estate of a decedent and in the case of any fiduciary, the debt is that of the person in the person's official or fiduciary capacity only, unless the person has voluntarily distributed the assets held in that capacity without reserving sufficient assets to pay the tax, interest, and penalties. In that case, the person is personally liable for the deficiency.\nThe tax imposed by this section is not a cost of doing business or an overhead expense under section 325D.01, subdivision 7.\nThe state of Minnesota or any of its agencies, instrumentalities, or governmental subdivisions is subject to the tax imposed by this chapter on all cigarettes or tobacco products sold, in the same manner as distributors, if such unit is engaged in the purchase and sale of cigarettes or tobacco products.",
	"repealed": false
}