{
	"id": "550.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.175",
	"title": "550.175 EXECUTION ON REAL PROPERTY THAT INCLUDES HOMESTEAD.",
	"text": "The executing creditor must obtain an order from the court directing a sale of the real property that includes a homestead before service of the notice of execution on real property containing the homestead of the debtor. The order shall contain the following findings:\n(1) whether the real property is the homestead of a nondebtor;\n(2) the amount of the debtor's homestead exemption, if any; and\n(3) whether the fair market value of the real property exceeds the sum of the debtor's homestead exemption and the present encumbrances.\nIf the court finds that there is no nondebtor with a valid homestead interest in the real property and that the fair market value of the homestead real property exceeds the sum of the debtor's homestead exemption and the present encumbrances, the court shall order a sale of the real property for cash or cash equivalents to the extent of the homestead exemption at the time of sale.\nIf real property is to be sold on execution and the property contains a portion of the homestead of the debtor, the debtor must be notified by the executing creditor that the homestead may be sold and redeemed separately from the remaining property. The notice in subdivision 2 must be included in the notice of execution served on the debtor under section 550.19.\nThe following notice must be included in the execution notice of real property containing a homestead that is served on a debtor under section 550.19. The notice must be in 10 point capitalized letters.\n\"PART OF THE PROPERTY TO BE SOLD CONTAINS YOUR HOUSE. YOU MAY DESIGNATE THE AREA OF A HOMESTEAD TO BE SOLD AND REDEEMED SEPARATELY.\nYOU MAY DESIGNATE THE HOUSE YOU OCCUPY AND ANY AMOUNT OF THE PROPERTY AS A HOMESTEAD. THE DESIGNATED HOMESTEAD PROPERTY MUST CONFORM TO THE LOCAL ZONING ORDINANCES AND BE COMPACT SO THAT IT DOES NOT UNREASONABLY REDUCE THE VALUE OF THE REMAINING PROPERTY.\nYOU MUST PROVIDE THE CREDITOR CAUSING THIS PROPERTY TO BE SOLD, THE SHERIFF, AND THE COUNTY RECORDER WITH A COPY OF THE LEGAL DESCRIPTION OF THE HOMESTEAD YOU HAVE DESIGNATED BY TEN BUSINESS DAYS BEFORE THE DATE THE PROPERTY IS TO BE SOLD.\"\nThe debtor must designate the legal description of the homestead property to be sold separately and the debtor's estimate of the value of the property. The homestead property designated may include any amount of the property. The designation must conform to local zoning, include the dwelling occupied by the debtor, and be compact so that it does not unreasonably affect the value of the remaining property. The debtor must serve a copy of the designation on the executing creditor, the sheriff, and the county recorder by ten business days before the sale is scheduled.\n(a) If the sheriff receives a homestead property designation under subdivision 3, the sheriff must offer and sell the designated homestead property, and the remaining property, separately, unless the executing creditor denies the right to the exemption, objects to the property designated, or claims the value exceeds the exemption.\n(b) If the executing creditor is dissatisfied with the homestead property designation or the debtor's valuation of the property, upon proper motion to the district court of the county in which any part of the property is located, the executing creditor is entitled to a court approved designation of the homestead and a court determination of value. The court shall either approve the debtor's designation or cause the property to be surveyed and order a homestead designation consistent with the standards of subdivision 3 and require an appraisal of fair market value, as applicable. The court's designation of the homestead property must conform to the debtor's request, to the extent not inconsistent with the standards of subdivision 3.\n(c) The court, in determining appraised value, shall review any appraisals provided by the debtor and executing creditor and may require a court appointed independent appraisal. The appraisals shall evaluate the property's fair market value, net of reasonable costs of sale.\n(d) If the court determines that the property claimed as a homestead exceeds in value the amount of the homestead exemption or if the court determines that the property cannot be divided without material injury, the court shall order the sale of the entire property, including the designated homestead for cash or cash equivalents to the extent of the homestead exemption at the time of sale.\n(e) At the sale, no bid may be accepted unless it exceeds the amount of the homestead exemption. If no bid exceeds the exemption, the homestead is exempt.\n(f) The cost of any court ordered survey or appraisal and of the sale must be collected on the execution, if the debtor designated as the debtor's homestead a greater quantity of property, property of greater value than the debtor was entitled to, or designated a parcel that does not meet the standards of subdivision 3. In all other cases, the costs shall be borne by the executing creditor.\nThe debtor may redeem the designated homestead, the remaining property, or the entire property including the homestead. The period of redemption for the designated homestead or the remaining property is the same as the period of redemption for the entire property including the designated homestead.\nReal property that includes a homestead as defined under section 510.01 is not subject to execution under this chapter if there is a nondebtor with:\n(1) homestead rights under sections 507.02 and 510.01 to 510.04;\n(2) rights as a joint tenant or life tenant; or\n(3) rights to take the homestead under section 524.2-402.",
	"repealed": false
}