{
	"id": "181.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.275",
	"title": "181.275 REGULATING NURSES' OVERTIME.",
	"text": "For purposes of this section, the following terms have the meanings given them:\n(1) \"emergency\" means a period when replacement staff are not able to report for duty for the next shift or increased patient need, because of unusual, unpredictable, or unforeseen circumstances such as, but not limited to, an act of terrorism, a disease outbreak, adverse weather conditions, or natural disasters which impact continuity of patient care;\n(2) \"normal work period\" means 12 or fewer consecutive hours consistent with a predetermined work shift;\n(3) \"nurse\" has the meaning given in section 148.171, subdivision 9, and includes nurses employed by the state of Minnesota; and\n(4) \"taking action against\" means discharging; disciplining; penalizing; interfering with; threatening; restraining; coercing; reporting to the Board of Nursing; or otherwise retaliating or discriminating against regarding compensation, terms, conditions, location, or privileges of employment.\nExcept as provided in subdivision 3, a hospital or other entity licensed under sections 144.50 to 144.58, and its agent, or other health care facility licensed by the commissioner of health, and the facility's agent, is prohibited from taking action against a nurse solely on the grounds that the nurse fails to accept an assignment of additional consecutive hours at the facility in excess of a normal work period, if the nurse declines to work additional hours because doing so may, in the nurse's judgment, jeopardize patient safety. This subdivision does not apply to a nursing facility, an intermediate care facility for persons with developmental disabilities, a licensed boarding care facility, or a housing with services establishment.\nSubdivision 2 applies to a nurse employed by the state of Minnesota regardless of the type of facility in which the nurse is employed and regardless of the facility's license, if the nurse is involved in resident or patient care.\nMS 2007 Supp [Expired]\nThis section does not diminish or impair the rights of a person under any collective bargaining agreement.\nNotwithstanding subdivision 2, a nurse may be scheduled for duty or required to continue on duty for more than one normal work period in an emergency.\nSection 645.241 does not apply to violations of this section.",
	"repealed": false
}