{
	"id": "41B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.10",
	"title": "41B.10 REVENUE BONDS; OPTIONAL RESOLUTION AND CONTRACT PROVISIONS.",
	"text": "Any resolution authorizing any bonds or any issue of bonds may contain provisions, which must be a part of the contract with the holders of the bonds, as to the matters referred to in this section.\n(a) It may pledge or create a lien on all or any part of the money or property of the authority and any money held in trust or otherwise by others to secure the payment of the bonds or of any issue of bonds, subject to any agreements with bondholders which exist.\n(b) It may provide for the custody, collection, securing, investment, and payment of any money of the authority.\n(c) It may set aside reserves or sinking funds and provide for their regulation and disposition and may create other special funds into which any money of the authority may be deposited.\n(d) It may limit the loans and securities to which the proceeds of sale of bonds may be applied and may pledge repayments thereon to secure the payment of the notes or bonds or of any issue of notes or bonds.\n(e) It may limit the issuance of additional bonds, the terms upon which additional bonds may be issued and secured, and the refunding of outstanding or other bonds.\n(f) It may prescribe the procedure, if any, by which the terms of any contract with bondholders may be amended or abrogated, the amount of bonds the holders of which must consent to the amendment or abrogation, and the manner in which that consent may be given.\n(g) It may vest in a trustee or trustees property, rights, powers, and duties in trust determined by the authority, which may include any or all of the rights, powers, and duties of the bondholders, or may limit the rights, powers, and duties of the trustee.\n(h) It may define the acts or omissions to act which constitute a default in the obligations and duties of the authority and may provide for the rights and remedies of the holders of bonds in the event of a default, and provide any other matters of like or different character, consistent with the general laws of the state and other provisions of sections 41B.01 to 41B.23, which in any way affect the security or protection of the bonds and the rights of the bondholders.",
	"repealed": false
}