{
	"id": "53B.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.40",
	"title": "53B.40 LICENSE ISSUANCE.",
	"text": "(a) When an application for an original license under this chapter includes all of the items and addresses all of the matters that are required, the application is complete and the commissioner must promptly notify the applicant in a record of the date on which the application is determined to be complete.\n(b) The commissioner's determination that an application is complete and accepted for processing means only that the application, on the application's face, appears to include all of the items, including the criminal background check response from the Federal Bureau of Investigation, and address all of the matters that are required. The commissioner's determination that an application is complete is not an assessment of the substance of the application or of the sufficiency of the information provided.\n(c) When an application is filed and considered complete under this section, the commissioner must investigate the applicant's financial condition and responsibility, financial and business experience, character, and general fitness. The commissioner may conduct an investigation of the applicant, the reasonable cost of which the applicant must pay. The commissioner must issue a license to an applicant under this section if the commissioner finds:\n(1) the applicant has complied with sections 53B.38 and 53B.39; and\n(2) the financial condition and responsibility; financial and business experience, competence, character, and general fitness of the applicant; and the competence, experience, character, and general fitness of the key individuals and persons in control of the applicant indicate that it is in the interest of the public to permit the applicant to engage in money transmission.\n(d) If an applicant avails itself of or is otherwise subject to a multistate licensing process:\n(1) the commissioner is authorized to accept the investigation results of a lead investigative state for the purposes of paragraph (c); or\n(2) if Minnesota is a lead investigative state, the commissioner is authorized to investigate the applicant pursuant to paragraph (c) and the time frames established by agreement through the multistate licensing process, provided that the time frame complies with the application review period provided under paragraph (e).\n(e) The commissioner must approve or deny the application within 120 days after the date the application is deemed complete. If the application is not approved or denied within 120 days after the completion date, the application is approved and the license takes effect on the first business day after the 120-day period expires.\n(f) The commissioner must issue a formal written notice of the denial of a license application within 30 days of the date the decision to deny the application is made. The commissioner must set forth in the notice of denial the specific reasons for the denial of the application. An applicant whose application is denied by the commissioner under this paragraph may appeal within 30 days of the date the written notice of the denial is received. The commissioner must set a hearing date that is not later than 60 days after service of the response, unless a later date is set with the consent of the denied applicant.\n(g) The initial license term begins on the day the application is approved. The license expires on December 31 of the year in which the license term began, unless the initial license date is between November 1 and December 31, in which case the initial license term runs through December 31 of the following year. If a license is approved between November 1 and December 31, the applicant is subject to the renewal fee under section 53B.31, paragraph (a).",
	"repealed": false
}