{
	"id": "103D.921",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.921",
	"title": "103D.921 DISTRICT COURT TO CREATE PRELIMINARY FUND.",
	"text": "(a) If a petition has been filed with the managers for the construction or implementation of a project within the watershed district, the managers may file a petition with the district court in the county where the watershed district has its principal place of business asking that a preliminary expense fund be created for the watershed district.\n(b) The managers may subsequently amend or supplement the petition if necessary. At least ten days' notice of a petition or amended or supplementary petition must be given to the auditor of each county affected by the proposed project.\n(c) The preliminary fund must be of a size that is proportionate to the needs of the watershed district for preliminary work on the proposed project.\nThe district court after the hearing may designate the amount of the fund and set the proportionate amount that each county affected by the improvement shall pay, in proportion to the area in the county affected by the proposed project. The court shall order the auditor of each county to draw a warrant on the treasurer of the county for the payment of the amount specified in the order, payable to the treasurer of the watershed district. The sum advanced by the county shall be charged to the watershed district and must be repaid with interest as soon as the watershed district has funds for that purpose.\nThe preliminary fund must be used by the managers for preliminary work. If the managers incur expenses for surveys or other preliminary work on a proposed project, all expenses connected with the work shall be included in the cost of construction or implementation of the proposed project. If construction or implementation of the project is authorized by the managers, the money advanced from the preliminary fund shall be repaid from assessments for the project.\nThe state, state agencies, and political subdivisions may appropriate money necessary to pay their proportionate share of the preliminary expenses, determined by the managers according to the benefits that will probably accrue from the proposed project.\nThe district court may order a preliminary fund for all works of the watershed district instituted under section 103D.701.",
	"repealed": false
}