{
	"id": "16B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.32",
	"title": "16B.32 ENERGY USE.",
	"text": "(a) If the incorporation of cost-effective energy efficiency measures into the design, materials, and operations of a building or major building renovation subject to section 16B.325 is not sufficient to meet Sustainable Building 2030 energy performance standards required under section 216B.241, subdivision 9, cost-effective renewable energy sources or solar thermal energy systems, or both, must be deployed to achieve those standards.\n(b) The commissioners of administration and commerce shall review compliance of building designs and plans subject to this section with Sustainable Building 2030 performance standards developed under section 216B.241, subdivision 9, and shall make recommendations to the legislature as necessary to ensure that those performance standards are met.\n(c) For the purposes of this section:\n(1) \"energy efficiency\" has the meaning given in section 216B.2402, subdivision 7;\n(2) \"renewable energy\" has the meaning given in section 216B.2422, subdivision 1, paragraph (c), and includes hydrogen generated from wind, solar, or hydroelectric; and\n(3) \"solar thermal energy systems\" has the meaning given to \"qualifying solar thermal project\" in section 216B.2411, subdivision 2, paragraph (e).\nThe total aggregate nameplate capacity of all renewable energy sources utilized to meet Sustainable Building 2030 standards in a state-owned building or facility, including any subscription to a community solar garden under section 216B.1641, may not exceed 120 percent of the average annual electric energy consumption of the state-owned building or facility.\nThe commissioner of administration in consultation with the commissioner of commerce, in cooperation with one or more public utilities or comprehensive energy services providers, may conduct a shared-savings program involving energy conservation expenditures on state-owned and wholly state-leased buildings. The public utility or energy services provider shall contract with appropriate state agencies to implement energy efficiency improvements in the selected buildings. A contract must require the public utility or energy services provider to include all energy efficiency improvements in selected buildings that are calculated to achieve a cost payback within ten years. The contract must require that the public utility or energy services provider be repaid solely from energy cost savings and only to the extent of energy cost savings. Repayments must be interest-free. The goal of the program in this paragraph is to demonstrate that through effective energy conservation the total energy consumption per square foot of state-owned and wholly state-leased buildings could exceed existing energy code by at least 30 percent. All agencies must report to the commissioner of administration their monthly energy usage, building schedules, inventory of energy-consuming equipment, and other information as needed by the commissioner to manage and evaluate the program.\nThe commissioner may accept gifts for energy efficiency improvements in state-owned and wholly leased buildings. Energy cost savings from these improvements, up to the cost of these improvements, shall be deposited in a special revenue fund established in the state treasury. Money in the special revenue fund is appropriated to the commissioner to implement further energy efficiency improvements in state-owned or wholly leased buildings.",
	"repealed": false
}