{
	"id": "84.943",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.943",
	"title": "84.943 MINNESOTA CRITICAL HABITAT PRIVATE SECTOR MATCHING ACCOUNT.",
	"text": "The Minnesota critical habitat private sector matching account is established as a separate account in the reinvest in Minnesota resources fund established under section 84.95. The account shall be administered by the commissioner of natural resources as provided in this section.\nThe critical habitat private sector matching account shall consist of contributions from private sources and appropriations.\n(a) Appropriations transferred to the critical habitat private sector matching account and money credited to the account under section 168.1296, subdivision 5, may be expended only to the extent that they are matched with contributions from private sources; by funds contributed to the nongame wildlife management account; or by appropriations from the bond proceeds fund for projects that benefit critical natural habitat. The private contributions may be made in cash, property, land, or interests in land. Appropriations transferred to the account that are not matched within three years from the date of the appropriation shall cancel to the source of the appropriation. For the purposes of this section, the private contributions of property, land, or interests in land that are retained by the commissioner shall be valued in accordance with their appraised value.\n(b) For every dollar used as a match under paragraph (a), the commissioner may expend up to two dollars from the account for the purposes described in subdivision 5.\nThe critical habitat private sector matching account shall be managed to earn the highest interest compatible with prudent investment, preservation of principal, and reasonable liquidity. Unless an appropriation to the account reverts to its original source under subdivision 3, the principal and interest in the account remain in the account until expended as provided in this section.\n(a) The commissioner of natural resources may accept contributions and pledges to the critical habitat private sector matching account. A pledge that is made contingent on an appropriation is acceptable and shall be reported with other pledges as required in this section. The commissioner may agree to match a contribution contingent on a future appropriation. In the budget request for each biennium, the commissioner shall report the balance of contributions in the account and the amount that has been pledged for payment in the succeeding two calendar years.\n(b) Money in the account is appropriated to the commissioner of natural resources only for the direct acquisition, restoration, or enhancement of land or interests in land as provided in section 84.944. Acquisition includes:\n(1) purchase of land or an interest in land by the commissioner; or\n(2) acceptance by the commissioner of gifts of land or interests in land as program projects.\n(c) To the extent of available appropriations other than bond proceeds, the money matched to the nongame wildlife management account may be used for:\n(1) the management of nongame wildlife projects as specified in section 290.431;\n(2) restoration and enhancement activities for critical natural habitat; or\n(3) monitoring and evaluation activities for rare resources and native plant communities that inform the management of critical natural habitat.\nNo more than 30 percent of the nongame wildlife management account appropriations each fiscal year may be used to match money from the critical habitat private sector matching account for monitoring and evaluation activities.",
	"repealed": false
}