{
	"id": "142A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.42",
	"title": "142A.42 DIAPER DISTRIBUTION GRANT PROGRAM.",
	"text": "The commissioner of children, youth, and families shall establish a diaper distribution program to award competitive grants to eligible applicants to provide diapers to underresourced families statewide.\nTo be eligible for a grant under this section, an applicant must demonstrate its capacity to distribute diapers statewide by having:\n(1) a network of well-established partners for diaper distribution;\n(2) the infrastructure needed to efficiently manage diaper procurement and distribution statewide;\n(3) relationships with national organizations that support and enhance the work of addressing diaper need;\n(4) the ability to engage in building community awareness of diaper need and advocate for diaper need at local, state, and federal levels;\n(5) a commitment to and demonstration of working with organizations across ideological and political spectrums;\n(6) the ability to address diaper need for children from birth through early childhood; and\n(7) a commitment to working within an equity framework by ensuring access to organizations that provide culturally specific services or are located in communities with high concentrations of poverty.\nApplicants must apply to the commissioner in a form and manner prescribed by the commissioner. Applications must be filed at the times and for the periods determined by the commissioner.\nAn eligible applicant that receives grant money under this section shall use the money to purchase diapers and wipes and may use up to ten percent of the money for administrative costs.\n(a) An eligible applicant that receives grant money under this section must:\n(1) retain records documenting expenditure of the grant money;\n(2) report to the commissioner on the use of the grant money; and\n(3) comply with any additional requirements imposed by the commissioner.\n(b) The commissioner may require that a report submitted under this subdivision include an independent audit.",
	"repealed": false
}