{
	"id": "120A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/120A.05",
	"title": "120A.05 DEFINITIONS.",
	"text": "For the purposes of this chapter the terms defined in this section have the meanings given them.\n\"Auditor\" means county auditor.\n\"Board\" means a school board.\n\"Commissioner\" means the commissioner of education.\n\"Common district\" means any school district validly created and existing as a common school district or joint common school district as of July 1, 1957, or pursuant to the terms of the Education Code.\n\"County board\" means a board of county commissioners.\n\"Department\" means the Department of Education.\n\"District\" means a school district.\n\"Elementary school\" means any school with building, equipment, courses of study, class schedules, enrollment of pupils ordinarily in prekindergarten through grade 6 or any portion thereof, and staff meeting the standards established by the commissioner.\n\"Independent district\" means any school district validly created and existing as an independent, consolidated, joint independent, county or a ten or more township district as of July 1, 1957, or pursuant to the Education Code.\n\"Kindergarten\" means a program designed for pupils five years of age on September 1 of the calendar year in which the school year commences that prepares pupils to enter first grade the following school year.\n\"Middle school\" means any school other than a secondary school giving an approved course of study in a minimum of two consecutive grades above 4th but below 10th with building, equipment, courses of study, class schedules, enrollment, and staff meeting the standards established by the commissioner of education.\n\"Prekindergarten\" means a program designed for pupils younger than five years of age on September 1 of the calendar year in which the school year commences that prepares pupils to enter kindergarten the following school year.\n\"School district tax\" means the tax levied and collected to provide the amount of money voted or levied by the district or the board for school purposes.\n\"Secondary school\" means any school with building, equipment, courses of study, class schedules, enrollment of pupils ordinarily in grades 7 through 12 or any portion thereof, and staff meeting the standards established by the commissioner of education.\n\"Special district\" means a district established by a charter granted by the legislature or by a home rule charter including any district designated a special independent school district by the legislature.\n[Obsolete]\n\"Superintendent\" means superintendent of the school district involved.\n\"Vocational center school\" means any school serving a group of secondary schools with approved areas of secondary vocational training and offering vocational secondary and adult programs necessary to meet local needs and meeting standards established by the commissioner of education.",
	"repealed": false
}