{
	"id": "244.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.41",
	"title": "244.41 DEFINITIONS.",
	"text": "For purposes of the act, the terms defined in this section have the meanings given.\n\"Act\" means the Minnesota Rehabilitation and Reinvestment Act.\n\"Commissioner\" means the commissioner of corrections.\nAs used in sections 244.40 to 244.51, \"conditional release\" has the meaning given in section 609.02, subdivision 18.\n\"Correctional facility\" means a state facility under the direct operational authority of the commissioner but does not include a commissioner-licensed local detention facility.\n\"Direct-cost per diem\" means the actual nonsalary expenditures, including encumbrances as of July 31 following the end of the fiscal year, from the Department of Corrections expense budgets for food preparation; food provisions; personal support for incarcerated persons, including clothing, linen, and other personal supplies; transportation; and professional technical contracted health care services.\n\"Earned compliance credit\" means a one-month reduction from the period during active supervision of the supervised release term for every two months that a supervised individual exhibits compliance with the conditions and goals of the individual's supervision plan. Earned compliance credit also applies to a conditional release term.\n\"Earned incentive release credit\" means credit that is earned and included in calculating an incarcerated person's term of imprisonment for completing objectives established by their individualized rehabilitation plan under section 244.42.\n\"Earned incentive release savings\" means the calculation of the direct-cost per diem multiplied by the number of incarcerated days saved for the period of one fiscal year.\n\"Executed sentence\" means the total period for which an incarcerated person is committed to the custody of the commissioner.\n\"Incarcerated days saved\" means the number of days of an incarcerated person's original term of imprisonment minus the number of actual days served, excluding days not served due to death or as a result of time earned in the challenge incarceration program under sections 244.17 to 244.173.\n\"Incarcerated person\" has the meaning given \"inmate\" in section 244.01, subdivision 2.\n\"Supervised release\" means the release of an incarcerated person according to section 244.05.\n\"Supervised release term\" means the period equal to one-third of the individual's fixed executed sentence, less any disciplinary confinement period or punitive restrictive-housing confinement imposed under section 244.05, subdivision 1b.\n\"Supervision abatement status\" means an end to active correctional supervision of a supervised individual without effect on the legal expiration date of the individual's executed sentence less any earned incentive release credit or the expiration date of a conditional release term.\n\"Term of imprisonment\" has the meaning given in section 244.01, subdivision 8.",
	"repealed": false
}