{
	"id": "548.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/548.101",
	"title": "548.101 ASSIGNED CONSUMER DEBT DEFAULT JUDGMENTS.",
	"text": "(a) A party entitled to a judgment by default in a conciliation court or district court action upon an assigned obligation arising out of any consumer debt that is primarily for personal, family, or household purposes and in default at the time of assignment shall apply to the court and submit, in addition to the request, application, or motion for judgment:\n(1) a copy of the written contract between the debtor and original creditor or, if no written contract exists, other admissible evidence establishing the terms of the account relationship between the debtor and the original creditor, including the moving party's entitlement to the amounts described in clause (4). If only the balance owed at the time the debt was charged off or first assigned is claimed to be owed, evidence may include a monthly or periodic billing statement;\n(2) admissible evidence establishing that the defendant owes the debt;\n(3) the last four numbers of the debtor's Social Security number, if known;\n(4) admissible evidence establishing that the amount claimed to be owed is accurate, including the balance owed at the time the debt was charged off or first assigned to another party by the original creditor and, if included in the request, application, or motion for judgment, a breakdown of any fees, interest, and charges added to that amount;\n(5) admissible evidence establishing a valid and complete chain of assignment of the debt from the original creditor to the party requesting judgment, including documentation or a bill of sale evidencing the assignment with evidence that the particular debt at issue was included in the assignment referenced in the documentation or bill of sale;\n(6) in district court cases, proof that a summons and complaint were properly served on the debtor and that the debtor did not serve a timely answer or, in conciliation court cases, proof that the party seeking the judgment or the party's attorney used reasonable efforts to provide the court administrator with the correct address for the debtor; and\n(7) in district court cases, proof that the party requesting the default judgment or the party's attorney mailed a notice of intent to apply for default judgment to the debtor. The notice must be mailed to the debtor at the debtor's last known address at least 14 days before the request, application, or motion for default, and must be substantially in the following form:\n.............. [Plaintiff] served this lawsuit on you on .............. [date]. Under Minnesota law, a lawsuit may be started against you even though it has not yet been filed in court and the court has no record of this lawsuit or this paperwork. You are in default because you did not serve a written Answer on time. .............. [Plaintiff] will ask the Court to enter a judgment against you without any further court proceedings, unless you mail a written Answer or written response contesting the debt within 14 days from the date below. A judgment is a court order that you must pay a certain amount of money.\n(b) If admissible, the same item of evidence or document may be provided to satisfy more than one requirement under paragraph (a), clauses (1) to (5). A court may permit the foundation for documents submitted under paragraph (a) to be established by an affidavit.\n(c) Except in conciliation court cases or if a hearing is required under court rules, the court may either:\n(1) hold a hearing before entry of a default judgment; or\n(2) enter an administrative default judgment without a hearing if the court determines that the evidence submitted satisfies the requirements of paragraph (a).",
	"repealed": false
}