{
	"id": "473.254",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.254",
	"title": "473.254 LOCAL HOUSING INCENTIVES ACCOUNT.",
	"text": "(a) A municipality may elect to participate in the local housing incentive account program. If the election to participate occurs by November 15 of any year, it is effective commencing the next calendar year; otherwise it is effective commencing the next succeeding calendar year. An election to participate in the program is effective until revoked according to paragraph (b). A municipality is subject to this section only in those calendar years for which its election to participate in the program is effective. For purposes of this section, municipality means a municipality electing to participate in the local housing incentive account program for the calendar year in question, unless the context indicates otherwise.\n(b) A municipality may revoke its election to participate in the local housing incentive account program. If the revocation occurs by November 15 of any year, it is effective commencing the next calendar year; otherwise it is effective commencing the next succeeding calendar year. After revoking its election to participate in the program, a municipality may again elect to participate in the program according to paragraph (a).\n(c) A municipality that elects to participate may receive grants or loans from the tax base revitalization account, livable communities demonstration account, or the local housing incentive account. A municipality that does not participate is not eligible to receive a grant under sections 116J.551 to 116J.557. The council, when making discretionary funding decisions, shall give consideration to a municipality's participation in the local housing incentives program.\nThe council shall negotiate with each municipality to establish affordable and life-cycle housing goals for that municipality that are consistent with and promote the policies of the Metropolitan Council as provided in the adopted Metropolitan Development Guide. The council shall adopt, by resolution after a public hearing, the negotiated affordable and life-cycle housing goals for each municipality by January 15, 1996, and by January 15 in each succeeding year for each municipality newly electing to participate in the program or for each municipality with which new housing goals have been negotiated. By June 30, 1996, and by June 30 in each succeeding year for each municipality newly electing to participate in the program or for each municipality with which new housing goals have been negotiated, each municipality shall identify to the council the actions it plans to take to meet the established housing goals.\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]\n(a) Each municipality's \"affordable and life-cycle housing opportunities amount\" for that year must be determined annually by the council using the method in this subdivision. The affordable and life-cycle housing opportunities amount must be determined for each calendar year for all municipalities in the metropolitan area.\n(b) The council must allocate to each municipality its portion of the $1,000,000 of the revenue generated by the levy authorized in section 473.249 which is credited to the local housing incentives account pursuant to subdivision 5, paragraph (b). The allocation must be made by determining the amount levied for and payable in each municipality in the previous calendar year pursuant to the council levy in section 473.249 divided by the total amount levied for and payable in the metropolitan area in the previous calendar year pursuant to such levy and multiplying that result by $1,000,000.\n(c) The council must also determine the amount levied for and payable in each municipality in the previous calendar year pursuant to the council levy in section 473.253, subdivision 1.\n(d) A municipality's affordable and life-cycle housing opportunities amount for the calendar year is the sum of the amounts determined under paragraphs (b) and (c).\n(e) By August 1 of each year, the council must notify each municipality of its affordable and life-cycle housing opportunities amount for the following calendar year determined by the method in this subdivision.\n(a) A municipality that does not spend 85 percent of its affordable and life-cycle housing opportunities amount to create affordable and life-cycle housing opportunities in the previous calendar year must do one of the following with the affordable and life-cycle housing opportunities amount for the previous year as determined under subdivision 3a:\n(1) distribute it to the local housing incentives account; or\n(2) distribute it to the housing and redevelopment authority of the city or county in which the municipality is located to create affordable and life-cycle housing opportunities in the municipality.\n(b) A municipality may enter into agreements with adjacent municipalities to cooperatively provide affordable and life-cycle housing. The housing may be provided in any of the cooperating municipalities, but must meet the combined housing goals of each participating municipality.\n(a) The council shall credit to the local housing incentives account any revenues derived from municipalities under subdivision 4, paragraph (a), clause (1).\n(b) The council shall annually credit $1,000,000 of the revenues generated by the levy authorized in section 473.249 to the local housing incentives account.\n(c) The council shall annually transfer $500,000 from the livable communities demonstration account to the local housing incentives account.\nThe funds in the account must be distributed annually by the council to municipalities that:\n(1) have not met their affordable and life-cycle housing goals as determined by the council; and\n(2) are actively funding projects designed to help meet the goals.\nFunds may also be distributed to a development authority for a project in an eligible municipality. The funds distributed by the council must be matched on a dollar-for-dollar basis by the municipality or development authority receiving the funds. When distributing funds in the account, the council must give priority to projects that (1) are in municipalities that have contribution net tax capacities that exceed their distribution net tax capacities by more than $200 per household, (2) demonstrate the proposed project will link employment opportunities with affordable and life-cycle housing, and (3) provide matching funds from a source other than the required affordable and life-cycle housing opportunities amount under subdivision 3 or 3a, as applicable. For the purposes of this subdivision, \"municipality\" means a statutory or home rule charter city or town in the metropolitan area and \"development authority\" means a housing and redevelopment authority, economic development authority, or port authority.\nBy July 1, 2004, and by July 1 in each succeeding year, each municipality must certify to the council whether or not it has spent 85 percent of its affordable and life-cycle housing opportunities amount, as determined under subdivision 3a, in the previous calendar year to create affordable and life-cycle housing opportunities. The council may verify each municipality's certification.\nIf a municipality did not participate for one or more years and elects later to participate, the municipality must, with respect to its affordable and life-cycle housing opportunities amount for the calendar year preceding the participating calendar year:\n(1) establish that it spent such amount on affordable and life-cycle housing during that preceding calendar year; or\n(2) agree to spend such amount from the preceding calendar year on affordable and life-cycle housing in the participating calendar year, in addition to its affordable and life-cycle housing opportunities amount for the participating calendar year; or\n(3) distribute such amount to the local housing incentives account.\nThe council will determine which investments count toward the required affordable and life-cycle housing opportunities amount by comparing the municipality to participating municipalities similar in terms of stage of development and demographics. If it determines it to be in the best interests of the region, the council may waive a reasonable portion of the amount.\nBy February 1 of each year, the council must report to the legislature the municipalities that have elected to participate and not to participate under subdivision 1. This report must be filed as provided in section 3.195.\nThe Metropolitan Council shall present to the legislature and release to the public by November 15, 1996, and each year thereafter a comprehensive report card on affordable and life-cycle housing in each municipality in the metropolitan area. The report card must include information on government, nonprofit, and marketplace efforts.",
	"repealed": false
}