{
	"id": "168.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.021",
	"title": "168.021 PLATES FOR PHYSICALLY DISABLED PERSONS.",
	"text": "(a) When a motor vehicle registered under section 168.017, a motorcycle, a motorized bicycle, a one-ton pickup truck, or a self-propelled recreational vehicle is owned or primarily operated by a permanently physically disabled person or a custodial parent or guardian of a permanently physically disabled person, the owner may apply for and secure from the commissioner (1) immediately, a temporary permit valid for 30 days if the applicant is eligible for the disability plates issued under this section and (2) two disability plates with attached emblems, one plate to be attached to the front, and one to the rear of the motor vehicle, truck, or recreational vehicle, or, in the case of a motorcycle or a motorized bicycle, one disability plate the same size as a regular motorcycle plate.\n(b) The commissioner shall not issue more than one plate to the owner of a motorcycle or a motorized bicycle and not more than one set of plates to any owner of another vehicle described in paragraph (a) at the same time unless the state Council on Disability approves the issuance of a second plate or set of plates to an owner.\n(c) When the owner first applies for the disability plate or plates, the owner must submit a medical statement in a format approved by the commissioner under section 169.345, or proof of physical disability provided for in that section.\n(d) No medical statement or proof of disability is required when an owner applies for a plate or plates for one or more vehicles listed in paragraph (a) that are specially modified for and used exclusively by permanently physically disabled persons.\n(e) The owner of a vehicle listed in paragraph (a) may apply for and secure (i) immediately, a permit valid for 30 days, if the applicant is eligible to receive the disability plate or plates issued under this section, and (ii) a disability plate or plates for the vehicle if:\n(1) the owner employs a permanently physically disabled person who would qualify for the disability plate or plates under this section; and\n(2) the owner furnishes the motor vehicle to the physically disabled person for the exclusive use of that person in the course of employment.\nIf a physically disabled person parks a vehicle described in subdivision 1, displaying the disability plate or plates described in this section, or a permit valid for 30 days and issued to an eligible person awaiting receipt of the disability plate or plates described in this section, or any person parks the motor vehicle for a physically disabled person, that person is entitled to park the motor vehicle as provided in section 169.345.\nThe commissioner shall design and furnish two disability plates, or one disability plate for a motorcycle or a motorized bicycle that is the same size as a regular motorcycle plate, with attached emblem or emblems to an eligible owner. The emblem must bear the internationally accepted wheelchair symbol, as designated in section 326B.106, subdivision 9, approximately three inches square. The emblem must be large enough to be visible plainly from a distance of 50 feet. An applicant eligible for a disability plate or plates shall pay the motor vehicle registration fee authorized by sections 168.013 and 168.09.\n(a) When ownership of a vehicle described in subdivision 1, is transferred, the owner of the vehicle shall remove the disability plate or plates. The buyer of the motor vehicle is entitled to receive a regular plate or plates for the vehicle without further cost for the remainder of the registration period.\n(b) Notwithstanding section 168.12, subdivision 1, the disability plate or plates may be transferred to a replacement vehicle on notification to the commissioner. However, the disability plate or plates may not be transferred unless the replacement vehicle (1) is listed under section 168.012, subdivision 1, and, in case of a single plate for a motorcycle or a motorized bicycle, the replacement vehicle is a motorcycle or a motorized bicycle, and (2) is owned or primarily operated by the permanently physically disabled person.\nOn becoming ineligible for the disability plate or plates, the owner of the motor vehicle shall remove the disability plate or plates. The owner may receive regular plates for the vehicle without further cost for the remainder of the registration period.\n(a) A person who uses the disability plate or plates or permit provided under this section on a motor vehicle in violation of this section is guilty of a misdemeanor, and is subject to a fine of $500. This subdivision does not preclude a person who is not physically disabled from operating a vehicle bearing the disability plates or permit if:\n(1) the person is the owner of the vehicle described in subdivision 1 and permits its operation by a physically disabled person;\n(2) the person operates the vehicle with the consent of the owner who is physically disabled; or\n(3) the person is the owner of the vehicle, is the custodial parent or guardian of a permanently physically disabled minor, and operates the vehicle to transport the minor.\n(b) A driver who is not disabled is not entitled to the parking privileges provided in this section and in section 169.346 unless parking the vehicle for a physically disabled person.\nAll fees collected from the sale of a disability plate or plates under this section must be deposited in the state treasury to the credit of the driver and vehicle services operating account under section 299A.705, subdivision 1.\nFor the purposes of this section, the term \"physically disabled person\" has the meaning given it in section 169.345, subdivision 2.\nThis section must not be construed to revoke, limit, or amend chapter 171.\nMS 1986 [Repealed, 1987 c 355 s 10]",
	"repealed": false
}