{
	"id": "354.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.44",
	"title": "354.44 RETIREMENT BENEFITS.",
	"text": "Any member or former member who ceases or has ceased to render teaching services in any school or institution covered by the provisions of this chapter, and who has attained the age of at least 55 years with not less than three years allowable service, or who has received credit for not less than 30 years allowable service regardless of age, is entitled upon written application to a retirement annuity.\nA member who terminates employment at any time during the academic year at the end of which the person is at the normal retirement age or older shall, for the purpose of determining eligibility for a proportionate retirement annuity, be considered to have been required to terminate employment at normal retirement age or older pursuant to section 356.32. For purposes of this subdivision, an academic year ends August 31.\n(a) The amount of retirement annuity is an amount equal to double the annuity which could be purchased by the member's accumulated deductions plus interest thereon. The annuity must be determined by the member's age, sex, double the amount of accumulated deductions, double the amount of interest earned on the accumulated deductions, and the appropriate mortality tables and interest rates. To determine the amount of the annuity for a basic member, the accumulated deductions before July 1, 1957, and the accumulated deductions after July 1, 1957, must be considered separately.\n(b) For service rendered before July 1, 1957, the accumulated deductions for a member must be carried forward at a fixed amount which is shown credited to the member's account as of that date. That fixed amount must also include any payments in lieu of salary deductions which were actually so made under an agreement executed between the member and the board as authorized by section 354.50 or any other authorized payments made by the member to the fund. The annuity granted with respect to the period must be determined as follows:\n(1) the fixed amount of the accumulated deductions for the period including the interest credited on the amount as earned up to July 1, 1957; and\n(2) annuity purchase rates based on the applicable mortality table established by the board and the interest rate assumption in effect before July 1, 1957, in the case of basic members and an annuity purchase rate based on an appropriate annuity table of mortality established by the board as provided in section 354.07, subdivision 1, and using the applicable investment return assumption specified in section 356.215, subdivision 8, in the case of coordinated members.\n(c) For service rendered after July 1, 1957, the accumulated deductions for a member must consist of the amounts actually credited to the member's account by reason of salary deductions. The annuity granted with respect to the period must be determined by the following:\n(1) accumulated deductions for the period;\n(2) interest credited on these accumulated deductions from July 1, 1957, to the date of retirement;\n(3) interest credited on accumulated deductions including prior credited interest provided in paragraph (b) from July 1, 1957, to the date of retirement;\n(4) after the amount available for an annuity granted with respect to the person is determined in accordance with the provisions of this subdivision, an additional amount equal to 20 percent of the sum of clause (1) plus interest credited to a member's account from July 1, 1957, to date of retirement is to be added. This added amount is not to be doubled as provided for other amounts determined in this subdivision; and\n(5) the annuity purchase rate based on an appropriate annuity table of mortality established by the board as provided in section 354.07, subdivision 1, and using the applicable investment return assumption specified in section 356.215, subdivision 8.\nA member or a person authorized to act on behalf of the member may make application for retirement provided the age and service requirements under subdivision 1 are satisfied on or before the member's retirement annuity accrual date under subdivision 4. The application may be made no earlier than 180 days before the termination of teaching service. The application must be made on a form prescribed by the executive director and is not complete until all necessary supporting documents are received by the executive director.\n(a) If the applicable age and service requirements under this section are satisfied, an annuity payment begins to accrue as follows:\n(1) on the day after the termination of teaching service;\n(2) on the day of receipt of application if the application is filed with the executive director after the six-month period that occurs immediately following the termination of teaching service; or\n(3) on July 1 for all school principals and other administrators who receive a full annual contract salary during the fiscal year for performance of a full year's contract duties.\n(b) A member, or a person authorized to act on behalf of the member, may specify a different date of retirement from that determined in paragraph (a), as follows:\n(1) if the application is filed on or before the date of termination of teaching service, the accrual date must not be earlier than the day after the termination of teaching service and no later than six months after the termination date; or\n(2) if the application is filed during the six-month period that occurs immediately following the termination of teaching service, the annuity may begin to accrue retroactively, but no earlier than the day after termination of teaching service and no later than six months after the termination date.\n(a) Any person who retired under the provisions of this chapter and has thereafter resumed teaching in any employer unit to which this chapter applies is eligible to continue to receive payments in accordance with the annuity except that all or a portion of the annuity payments must be deferred during the calendar year immediately following the fiscal year in which the person's salary from the teaching service is in an amount greater than $46,000. The amount of the annuity deferral is one-half of the salary amount in excess of $46,000 and must be deducted from the annuity payable for the calendar year immediately following the fiscal year in which the excess amount was earned.\n(b) If the person is retired for only a fractional part of the fiscal year during the initial year of retirement, the maximum reemployment salary exempt from triggering a deferral as specified in this subdivision must be prorated for that fiscal year.\n(c) After a person has reached the Social Security normal retirement age, no deferral requirement is applicable regardless of the amount of salary.\n(d) The amount of the retirement annuity deferral must be handled or disposed of as provided in section 356.47.\n(e) For the purpose of this subdivision, salary from teaching service includes all salary or income earned as a teacher as defined in section 354.05, subdivision 2, paragraph (a), clause (1). Salary from teaching service also includes, but is not limited to:\n(1) all income for services performed as a consultant, independent contractor, or third-party supplier, or as an employee of a consultant, independent contractor, or third-party supplier, to an employer unit covered by the provisions of this chapter; and\n(2) the greater of either the income received or an amount based on the rate paid with respect to an administrative position, consultant, independent contractor, or third-party supplier, or as an employee of a consultant, independent contractor, or third-party supplier, in an employer unit with approximately the same number of pupils and at the same level as the position occupied by the person who resumes teaching service.\n(f) Notwithstanding other paragraphs of this subdivision, if the reemployed annuitant has a former spouse receiving a portion of the annuity under section 518.58, subdivision 1, the portion payable to the former spouse must not be deferred.\nA person who performs services as an interim superintendent because of the death, disability, termination, or resignation of the previous superintendent is exempt from the earnings limitations and reductions in annuity payments in subdivision 5 for up to 90 working days of service as an interim superintendent. During this period of up to 90 working days, the school board may pay the interim superintendent at any rate, up to the rate paid to the previous superintendent. This exemption applies only if the school board hiring the interim superintendent submits an application for the exemption on a form prescribed by the executive director, and the executive director approves the application before the services as interim superintendent begin. The application must certify that the school board has unanimously approved the exemption from the earnings limitations and reductions. The executive director may prescribe a form for the application. A school board shall not apply for more than one exemption in a fiscal year. No more than three exemptions may be approved for any person. Only one exemption may be approved for any person in a fiscal year. The exemption under this subdivision does not apply to a person who retires from a school district and within one year after retirement returns to the same school district as an interim superintendent.\n(a) The formula retirement annuity must be computed in accordance with the applicable provisions of the formulas stated in paragraph (b) or (d) on the basis of each member's average salary under section 354.05, subdivision 13a, for the period of the member's formula service credit.\n(b) This paragraph, in conjunction with paragraph (c), applies to a person who first became a member of the association or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, unless paragraph (d), in conjunction with paragraph (e), produces a higher annuity amount, in which case paragraph (d) applies. The average salary as defined in section 354.05, subdivision 13a, multiplied by the following percentages per year of formula service credit shall determine the amount of the annuity to which the member qualifying therefor is entitled for service rendered before July 1, 2006:\nFor service rendered on or after July 1, 2006, by a member other than a member who was a member of the former Duluth Teachers Retirement Fund Association between January 1, 2006, and June 30, 2015, and for service rendered on or after July 1, 2013, by a member who was a member of the former Duluth Teachers Retirement Fund Association between January 1, 2013, and June 30, 2015, the average salary as defined in section 354.05, subdivision 13a, multiplied by the following percentages per year of service credit, determines the amount the annuity to which the member qualifying therefor is entitled:\n(c)(1) This paragraph applies only to a person who first became a member of the association or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and whose annuity is higher when calculated under paragraph (b), in conjunction with this paragraph than when calculated under paragraph (d), in conjunction with paragraph (e).\n(2) Where any member retires prior to normal retirement age under a formula annuity, the member shall be paid a retirement annuity in an amount equal to the normal annuity provided in paragraph (b) reduced by one-quarter of one percent for each month that the member is under normal retirement age at the time of retirement except that for any member who has 30 or more years of allowable service credit, the reduction shall be applied only for each month that the member is under age 62.\n(3) Any member whose attained age plus credited allowable service totals 90 years is entitled, upon application, to a retirement annuity in an amount equal to the normal annuity provided in paragraph (b), without any reduction by reason of early retirement.\n(d) This paragraph applies to a member who has become at least 55 years old and first became a member of the association after June 30, 1989, and to any other member who has become at least 55 years old and whose annuity amount when calculated under this paragraph and in conjunction with paragraph (e), is higher than it is when calculated under paragraph (b), in conjunction with paragraph (c).\n(1) For a basic member, the average salary, as defined in section 354.05, subdivision 13a, multiplied by 2.7 percent for each year of service for a basic member determines the amount of the retirement annuity to which the basic member is entitled. The annuity of a basic member who was a member of the former Minneapolis Teachers Retirement Fund Association as of June 30, 2006, must be determined according to the annuity formula under the articles of incorporation of the former Minneapolis Teachers Retirement Fund Association in effect as of that date.\n(2) For a coordinated member, the average salary, as defined in section 354.05, subdivision 13a, multiplied by 1.7 percent for each year of service rendered before July 1, 2006, and by 1.9 percent for each year of service rendered on or after July 1, 2006, for a member other than a member who was a member of the former Duluth Teachers Retirement Fund Association between January 1, 2006, and June 30, 2015, and by 1.9 percent for each year of service rendered on or after July 1, 2013, for a member of the former Duluth Teachers Retirement Fund Association between January 1, 2013, and June 30, 2015, determines the amount of the retirement annuity to which the coordinated member is entitled.\n(e) This paragraph applies to a person who has become at least 55 years old and first becomes a member of the association after June 30, 1989, and to any other member who has become at least 55 years old and whose annuity is higher when calculated under paragraph (d) in conjunction with this paragraph than when calculated under paragraph (b) in conjunction with paragraph (c). An employee who retires under the formula annuity before the normal retirement age is entitled to receive the normal annuity provided in paragraph (d), reduced as described in clause (1) or (2), as applicable.\n(1) For a member who is at least age 62 and has at least 30 years of service, the annuity shall be reduced by an early reduction factor of six percent for each year that the member's age of retirement precedes the normal retirement age. The resulting reduced annuity shall be further adjusted to take into account the increase in the monthly amount that would have occurred had the member retired early and deferred receipt of the annuity until normal retirement age and the annuity was augmented during the deferral period at 2.5 percent, if the member commenced employment after June 30, 2006, or at three percent, if the member commenced employment before July 1, 2006, compounded annually.\n(2) For a member who has not attained age 62 or has fewer than 30 years of service, the annuity shall be reduced for each year that the member's age of retirement precedes normal retirement age by the following early reduction factors:\n(i) for the period during which the member is age 55 through age 58, the factor is four percent; and\n(ii) for the period during which the member is at least age 59 but not yet normal retirement age, the factor is seven percent.\nThe resulting annuity shall be further adjusted to take into account the increase in the monthly amount that would have occurred had the member retired early and deferred receipt of the annuity until normal retirement age and the annuity was augmented during the deferral period at the applicable annual rate, compounded annually. The applicable annual rate is the rate in effect for the month that includes the member's effective date of retirement and shall be considered as fixed for the member for the period until the member reaches normal retirement age. The applicable annual rate for June 2019 is 2.5 percent, if the member commenced employment after June 30, 2006, or three percent, if the member commenced employment before July 1, 2006, compounded annually, and decreases each month beginning July 2019 in equal monthly increments over the five-year period that begins July 1, 2019, and ends June 30, 2024, to zero percent effective for July 2024 and thereafter.\nAfter June 30, 2024, the reduced annuity commencing before normal retirement age under this clause shall not take into account any augmentation.\n(f) No retirement annuity is payable to a former employee with a salary that exceeds 95 percent of the governor's salary unless and until the salary figures used in computing the highest five successive years average salary under paragraph (a) have been audited by the Teachers Retirement Association and determined by the executive director to comply with the requirements and limitations of section 354.05, subdivisions 35 and 35a.\n[Repealed, 2008 c 349 art 5 s 37]\n[Repealed, 1990 c 570 art 12 s 64]\n(a) A retirement annuity under subdivision 2 or 6 is eligible for postretirement adjustments under section 356.415.\n(b) Retirement annuities payable from the teachers retirement plan must not be in an amount less than the amount originally determined on the date of retirement and as adjusted on each succeeding January 1 under Minnesota Statutes 2008, section 11A.18, before January 1, 2010, and under section 356.415 after December 31, 2009.\n(a) An annuity or benefit for a given month must be paid during the first week of that month.\n(b) Evidence of receipt of the check issued or acknowledgment of the amount electronically transferred in payment of an annuity or benefit may be required from the payee on a form prescribed by the executive director. The evidence of receipt form may be required periodically at times specified by the board. If the filing of an evidence of receipt form is required and the form is not filed, future annuities or benefits must be withheld until the form is submitted.\nAn annuity under this chapter must be computed under the law in effect as of the date of termination of teaching service. A former teacher who returns to covered service following a termination and who is not receiving a retirement annuity under this section must have earned at least one-half year of credited service following the return to covered service to be eligible for improved benefits resulting from any law change enacted subsequent to that termination.",
	"repealed": false
}