{
	"id": "319B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.02",
	"title": "319B.02 DEFINITIONS.",
	"text": "For the purposes of sections 319B.01 to 319B.12, the terms defined in this section have the meanings given them.\n\"Board\" means an agency of the state of Minnesota which has jurisdiction to grant a license to furnish professional services of a category within subdivision 19, except that in the case of a professional firm that provides legal services, \"board\" means the Board of Professional Responsibility.\n\"Certificate of authority\" means:\n(1) with respect to a foreign firm that is a corporation, the certificate of authority required under sections 303.01 to 303.24 and any notice filed under section 303.115 in connection with that certificate; and\n(2) with respect to a foreign firm that is a limited liability company, the certificate of authority referred to in sections 322C.0802 to 322C.0804 and any notice filed in connection with that certificate.\n\"Disqualified\" means to have a license to provide pertinent professional services:\n(1) suspended, unless by its terms the suspension will automatically end less than 90 days after it takes effect; or\n(2) revoked.\nThe disqualification occurs when the suspension or revocation first takes effect.\n\"Firm\" includes a corporation, limited liability company, and limited liability partnership, wherever incorporated, organized, or registered.\n\"Foreign firm\" means a corporation incorporated, limited liability company organized, or limited liability partnership registered under the laws of a state other than Minnesota.\n\"Foreign professional firm\" means a foreign firm that has in effect an election under section 319B.04, subdivision 2.\n\"Generally applicable governing law\" of a firm means:\n(1) with respect to a firm that is a corporation, the state statute under which the corporation is incorporated;\n(2) with respect to a firm that is a limited liability company, the state statute under which the limited liability company is organized; and\n(3) with respect to a firm that is a limited liability partnership, the state statute under which the limited liability partnership obtains its status as a limited liability partnership;\nplus any other law that is generally relevant to the structure, governance, operations, or other internal affairs of the firm.\n\"Governance authority\" means the authority and responsibility to:\n(1) determine important policies for a professional firm;\n(2) superintend the professional firm's overall operations; and\n(3) maintain general, active management of and ultimate control over all matters involving professional judgment.\n\"License\" includes any license, certificate, registration, or other authority referred to in subdivision 17 or 19.\n\"Minnesota firm\" includes a corporation organized under chapter 302A or 317A, limited liability company organized under chapter 322C, and limited liability partnership that has an effective statement of qualification under section 323A.1001.\n\"Minnesota professional firm\" means a Minnesota firm that has in effect an election under section 319B.03, subdivision 2.\n\"Organizational document\" means:\n(1) with respect to a corporation organized under chapter 302A or 317A, that corporation's articles of incorporation;\n(2) with respect to a limited liability company organized under chapter 322C, that limited liability company's articles of organization; and\n(3) with respect to a limited liability partnership that has an effective statement of qualification under section 323A.1001, that statement of qualification.\n\"Owner\" means:\n(1) with respect to a professional firm that is a corporation, except a nonprofit corporation, an owner of shares in the corporation;\n(2) with respect to a professional firm that is a limited liability company, a member in the limited liability company; and\n(3) with respect to a professional firm that is a limited liability partnership, a partner in the limited liability partnership.\n\"Ownership interest\" means:\n(1) with respect to a professional firm that is a corporation, except a nonprofit corporation, shares in the corporation;\n(2) with respect to a professional firm that is a limited liability company, a membership interest in the limited liability company; and\n(3) with respect to a professional firm that is a limited liability partnership, a partnership interest.\n\"Partial right\" means a right in or with respect to an ownership interest where the right is by itself insufficient to make the right's holder an owner.\n\"Pertinent professional services\" means, with respect to a professional firm, the category or categories of professional services specified by the firm in its election under section 319B.03, subdivision 2, or 319B.04, subdivision 2.\n\"Professional\" means a natural person who is licensed by the laws of the state of Minnesota or similar laws of another state to furnish one or more of the categories of professional services listed in subdivision 19. Professional includes a natural person who is licensed or otherwise authorized to practice law under the laws of a foreign nation.\n\"Professional firm\" means both Minnesota professional firms and foreign professional firms.\n\"Professional services\" means services of the type required or permitted to be furnished by a professional under a license, registration, or certificate issued by the state of Minnesota to practice medicine and surgery under sections 147.01 to 147.22, as a physician assistant pursuant to sections 147A.01 to 147A.27, chiropractic under sections 148.01 to 148.105, registered nursing under sections 148.171 to 148.285, optometry under sections 148.52 to 148.62, psychology under sections 148.88 to 148.98, social work under chapter 148E, marriage and family therapy under sections 148B.29 to 148B.39, professional counseling under sections 148B.50 to 148B.593, dentistry and dental hygiene under sections 150A.01 to 150A.12, pharmacy under sections 151.01 to 151.40, podiatric medicine under sections 153.01 to 153.25, veterinary medicine under sections 156.001 to 156.14, architecture, engineering, surveying, landscape architecture, geoscience, and certified interior design under sections 326.02 to 326.15, accountancy under chapter 326A, or law under sections 481.01 to 481.17, or under a license or certificate issued by another state under similar laws. Professional services includes services of the type required to be furnished by a professional pursuant to a license or other authority to practice law under the laws of a foreign nation.\n\"State\" means a state of the United States and the District of Columbia.\n\"Statement of foreign qualification\" means with respect to a limited liability partnership that has an effective statement of foreign qualification under section 323A.1102, that statement of foreign qualification.\n\"Surviving spouse\" means a surviving spouse of a deceased professional as an individual, as the personal representative of the estate of the decedent, as the trustee of an inter vivos or testamentary trust created by the decedent, or as the sole heir or beneficiary of an estate or trust of which the personal representative or trustee is a bank or other institution that has trust powers.\n\"Update\" means:\n(1) with respect to a Minnesota professional firm that is either a Minnesota corporation or a Minnesota limited liability company, amend the organizational document;\n(2) with respect to a foreign professional firm that is a foreign corporation, file a notice under section 303.115 in connection with the foreign corporation's certificate of authority;\n(3) with respect to a foreign firm that is a limited liability company, file an amended certificate of authority;\n(4) with respect to a Minnesota professional firm that is a limited liability partnership and has an effective statement of qualification under section 323A.1001, amend that statement of qualification; and\n(5) with respect to a foreign professional firm that is a limited liability partnership and has an effective statement of foreign qualification under section 323A.1102, amend that statement of foreign qualification.",
	"repealed": false
}