{
	"id": "136A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.01",
	"title": "136A.01 OFFICE OF HIGHER EDUCATION.",
	"text": "The Office of Higher Education, which may also be known as the Minnesota Office of Higher Education, is created with a commissioner appointed by the governor with the advice and consent of the senate and serving at the pleasure of the governor.\n(a) The office is responsible for:\n(1) necessary state level administration of financial aid programs, including accounting, auditing, and disbursing state and federal financial aid funds, and reporting on financial aid programs to the governor and the legislature;\n(2) approval, registration, licensing, and financial aid eligibility of private collegiate and career schools, under sections 136A.61 to 136A.71 and 136A.82 to 136A.834;\n(3) determining whether to enter into an interstate reciprocity agreement regarding postsecondary distance education;\n(4) negotiating and administering reciprocity agreements;\n(5) publishing and distributing financial aid information and materials, and other information and materials under section 136A.87, to students and parents;\n(6) collecting and maintaining student enrollment and financial aid data and reporting data on students and postsecondary institutions to develop and implement a process to measure and report on the effectiveness of postsecondary institutions;\n(7) administering the federal programs that affect students and institutions on a statewide basis; and\n(8) prescribing policies, procedures, and rules under chapter 14 necessary to administer the programs under its supervision.\n(b) The office may match individual student data from the student record enrollment database with individual student financial aid data collected and maintained by the office in order to audit or evaluate federal or state supported education programs as permitted by United States Code, title 20, section 1232g(b)(3), and Code of Federal Regulations, title 34, section 99.35. The office shall not release data that personally identifies parents or students other than to employees and contractors of the office.\nThe commissioner is authorized to utilize incentive gifts including, but not limited to, gift cards in order to promote to the public the various programs administered by the office. The annual total expenditures for such incentive programs shall not exceed $10,000.",
	"repealed": false
}