{
	"id": "34A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/34A.04",
	"title": "34A.04 ENFORCEMENT.",
	"text": "(a) The commissioner shall enforce this chapter and chapters 28, 28A, 29, 30, 31, 31A, 32D, and 34. To carry out the enforcement duties under these chapters, the commissioner may, upon presenting appropriate credentials, during regular working hours and at other reasonable times, inspect premises subject to the commissioner's enforcement and licensing authority; require information from persons with information relevant to an inspection; and inspect and copy relevant papers and records, including business records.\n(b) The commissioner may administer oaths, take and cause to be taken depositions of witnesses, and issue subpoenas, and may petition the district court in the county in which the premises is located to compel compliance with subpoenas or to permit an inspection.\n(c) Violations of chapters 28, 28A, 29, 30, 31, 31A, 32D, and 34, or rules adopted under chapters 28, 28A, 29, 30, 31, 31A, 32D, and 34, are a violation of this chapter.\n(d) Upon the request of the commissioner, county attorneys, sheriffs, and other officers having authority in the enforcement of the general criminal laws shall take action to the extent of their authority necessary or proper for the enforcement of this chapter or standards, stipulations, and agreements of the commissioner.\nIf minor violations of this chapter occur or the commissioner believes the public interest will be best served by a suitable notice of warning in writing, this chapter does not require the commissioner to take any additional action.\nCivil judicial enforcement actions may be brought by the attorney general in the name of the state on behalf of the commissioner. A county attorney may bring a civil judicial enforcement action upon the request of the commissioner and agreement by the attorney general.\nThe commissioner may apply to a court with jurisdiction for a temporary or permanent injunction to prevent, restrain, or enjoin violations of provisions of this chapter.\nEach county attorney or city attorney to whom the commissioner reports any violation of this chapter shall consider instituting appropriate proceedings in the proper courts and prosecuting them in the manner required by law. If the county or city attorney refuses to prosecute, the attorney general, on request of the commissioner, may prosecute.",
	"repealed": false
}