{
	"id": "524.3-203",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-203",
	"title": "524.3-203 PRIORITY AMONG PERSONS SEEKING APPOINTMENT AS PERSONAL REPRESENTATIVE.",
	"text": "(a) Whether the proceedings are formal or informal, persons who are not disqualified have priority for appointment in the following order:\n(1) the person with priority as determined by a probated will including a person nominated by a power conferred in a will;\n(2) the surviving spouse of the decedent who is a devisee of the decedent;\n(3) other devisees of the decedent;\n(4) the surviving spouse of the decedent;\n(5) other heirs of the decedent;\n(6) 45 days after the death of the decedent, any creditor;\n(7) 90 days after the death of the decedent and pursuant to section 524.5-428, paragraph (b), any conservator of the decedent who has not been discharged.\n(b) An objection to an appointment can be made only in formal proceedings. In case of objection the priorities stated in (a) apply except that:\n(1) if the estate appears to be more than adequate to meet exemptions and costs of administration but inadequate to discharge anticipated unsecured claims, the court, on petition of creditors, may appoint any qualified person;\n(2) in case of objection to appointment of a person other than one whose priority is determined by will by an heir or devisee appearing to have a substantial interest in the estate, the court may appoint a person who is acceptable to heirs and devisees whose interests in the estate appear to be worth in total more than half of the probable distributable value, or, in default of this accord any suitable person.\n(c) A person entitled to letters under (2) to (5) of (a) above may nominate a qualified person to act as personal representative. Any person aged 18 and over may renounce the right to nominate or to an appointment by appropriate writing filed with the court. When two or more persons share a priority, those of them who do not renounce must concur in nominating another to act for them, or in applying for appointment.\n(d) Conservators of the estates of protected persons, or if there is no conservator, any guardian except a guardian ad litem of a minor or incapacitated person, may exercise the same right to nominate, to object to another's appointment, or to participate in determining the preference of a majority in interest of the heirs and devisees that the protected person or ward would have if qualified for appointment.\n(e) Appointment of one who does not have priority, including priority resulting from disclaimer, renunciation or nomination determined pursuant to this section, may be made only in formal proceedings. Before appointing one without priority, the court must determine that those having priority, although given notice of the proceedings, have failed to request appointment or to nominate another for appointment, and that administration is necessary.\n(f) No person is qualified to serve as a personal representative who is:\n(1) under the age of 18;\n(2) a person whom the court finds unsuitable in formal proceedings.\n(g) A personal representative appointed by a court of the decedent's domicile has priority over all other persons except as provided in (b)(1) or where the decedent's will nominates different persons to be personal representative in this state and in the state of domicile. The domiciliary personal representative may nominate another, who shall have the same priority as the domiciliary personal representative.\n(h) This section governs priority for appointment of a successor personal representative but does not apply to the selection of a special administrator.",
	"repealed": false
}