{
	"id": "626.846",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.846",
	"title": "626.846 ATTENDANCE, FORFEITURE OF POSITION.",
	"text": "Notwithstanding any general or local law or charter to the contrary, any peace officer or part-time peace officer employed or elected on or after July 1, 1979, by any state, county, municipality or joint or contractual combination thereof of the state of Minnesota shall not be eligible for permanent appointment without being licensed by the board pursuant to sections 626.84 to 626.863.\n[Repealed, 1980 c 578 s 12]\nEvery peace officer or part-time peace officer who shall be appointed by any state, county, municipality or joint or contractual combination thereof of the state of Minnesota on a temporary basis or for a probationary term, shall forfeit the officer's position unless the officer has been licensed by the board pursuant to sections 626.841 to 626.863. Any other peace officer or part-time peace officer employed or elected by any state, county, municipality or joint or contractual combination thereof, may attend peace officer training courses and be licensed by the board pursuant to sections 626.84 to 626.863.\nA peace officer who has received a permanent appointment prior to July 1, 1978, shall be licensed by the board if the officer has met the requirements of sections 626.841 to 626.855 in effect on June 30, 1977 and if the officer has requested licensing by the board.\n[Repealed, 1980 c 578 s 12]\n[Repealed, 1980 c 578 s 12]\n[Repealed, 1980 c 578 s 12]\nA person seeking election to the office of sheriff must be licensed as a peace officer. A person seeking appointment to the office of sheriff, or seeking appointment to the position of chief law enforcement officer, as defined by the rules of the board, after June 30, 1987, must be licensed or eligible to be licensed as a peace officer. The person shall submit proof of peace officer licensure or eligibility as part of the application for office. A person elected or appointed to the office of sheriff or the position of chief law enforcement officer shall be licensed as a peace officer during the person's term of office or employment.",
	"repealed": false
}