{
	"id": "192.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.261",
	"title": "192.261 LEAVE OF ABSENCE.",
	"text": "Subject to the conditions hereinafter prescribed, any officer or employee of the state or of any political subdivision, municipal corporation, or other public agency of the state who: (1) engages in active service in time of war or other emergency declared by proper authority in any of the military or naval forces of the state or of the United States for which leave is not otherwise allowed by law; or (2) during convalescence for an injury or disease incurred during active service, as documented by a line-of-duty determination form signed by proper military authority, and any other documentation as reasonably requested by the employer; shall be entitled to leave of absence from the officer's or employee's public office or employment without pay during such service, with right of reinstatement as hereinafter provided. Such leave of absence without pay, whether heretofore or hereafter, shall not extend beyond four years plus such additional time in each case as such an officer or employee may be required to serve pursuant to law. This shall not be construed to preclude the allowance of leave with pay for such service to any person entitled thereto under section 43A.183, 192.26, or 471.975. Nothing in this section contained shall affect any of the provisions or application of section 352.27 nor of section 192.26 to 192.264, or any laws amendatory thereof, insofar as such sections pertain to the state employees retirement association or its members. \"Active service\" has the meaning given the term in section 190.05, subdivision 5.\nExcept as otherwise hereinafter provided, upon the completion of such service such officer or employee shall be reinstated in the public position, which was held at the time of entry into such service, or a public position of like seniority, status, and pay if such is available at the same salary which the officer or employee would have received if the leave had not been taken, upon the following conditions: (1) that the position has not been abolished or that the term thereof, if limited, has not expired; (2) that the officer or employee is not physically or mentally disabled from performing the duties of such position; (3) that the officer or employee makes written application for reinstatement to the appointing authority within 90 days after termination of such service, or 90 days after discharge from hospitalization or medical treatment which immediately follows the termination of, and results from, such service; provided such application shall be made within one year and 90 days after termination of such service notwithstanding such hospitalization or medical treatment; (4) that the officer or employee submits an honorable discharge or other form of release by proper authority indicating that the officer's or employee's military or naval service was satisfactory. Upon such reinstatement the officer or employee shall have the same rights with respect to accrued and future seniority status, efficiency rating, vacation, sick leave, and other benefits as if that officer or employee had been actually employed during the time of such leave. The officer or employee reinstated under this section is entitled to vacation and sick leave with pay as provided in any applicable civil service rules, collective bargaining agreement, or compensation plan, and accumulates vacation and sick leave from the time the person enters active military service until the date of reinstatement without regard to any otherwise applicable limits on civil service rules limiting the number of days which may be accumulated. No officer or employee so reinstated shall be removed or discharged within one year thereafter except for cause, after notice and hearing; but this shall not operate to extend a term of service limited by law.\nAny public officer elected or appointed for a definite term who, before the expiration of such term, returns from military or naval service under leave of absence without pay under chapters 190 to 193, in lieu of making written application for reinstatement as hereinbefore provided, shall file in the same office where the public officer's oath is filed within 45 days after termination of such military or naval service a verified certificate that the public officer has complied with the conditions for reinstatement hereinbefore prescribed, and that public officer shall thereupon be deemed to have resumed that office, with all the rights and privileges granted by chapters 190 to 193; provided, that any false statement in such certificate shall be ground for removal.\nNo person who is engaged in active service in any of the military or naval forces of the state or of the United States within or without the state shall thereby be disqualified from being a candidate for or from being elected or appointed to any public office within the state if that person is otherwise eligible therefor. A person who is elected or appointed to any such office who at the commencement of the term thereof is engaged in any such active military or naval service shall not thereby be disqualified from assuming and holding such office if otherwise eligible therefor and if that person's military or naval service is not constitutionally or legally incompatible therewith. Such person, if prevented by military or naval duties from taking office in person, may file an oath of office, and a bond, if required, by mail or other means of transmittal, and shall thereupon be deemed to have assumed office, subject to all the provisions of sections 192.26 to 192.264, so far as applicable.\n(a) Any public officer or employee who is a member of the military forces who is ordered to an initial period of active duty for training of not less than three consecutive months shall, upon application for reemployment within 31 days after that member's (1) release from that active duty for training after satisfactory service, or (2) discharge from hospitalization incident to that active duty for training, or one year after a scheduled release from that training, whichever is earlier, be entitled to all reemployment rights and benefits provided by this section. Any person restored to a position in accordance with the provisions of this clause shall not be discharged from the position without cause within six months after that restoration.\n(b) Any public officer or employee not covered by section 192.26, or by clause (a) shall, upon request, be granted a leave of absence from public employment for the period required to perform active duty for training or inactive duty training in the military forces. Upon release from a period of active duty for training or inactive duty training, or upon discharge from hospitalization incident to that training, the officer or employee shall be permitted to return to the previously held position with the same seniority, status, rate of pay, and vacation as if the officer or employee had not been absent for those purposes. The officer or employee shall report for work at the beginning of the next regularly scheduled working period after expiration of the last calendar day necessary to travel from the place of training to the place of employment following release from active duty, or within a reasonable time thereafter if delayed return is due to factors beyond the employee's control. Failure to report for work at the next regularly scheduled working period shall make the employee subject to the conduct rules of the employer pertaining to explanations and discipline with respect to absence from scheduled work. If that employee is hospitalized incident to active duty for training or inactive duty training, that employee shall be required to report for work (1) at the beginning of the next regularly scheduled work period after expiration of the time necessary to travel from the place of discharge from hospitalization to the place of employment, (2) within a reasonable time thereafter if delayed return is due to factors beyond the employee's control, or (3) within one year after the release from active duty for training or inactive duty training, whichever is earlier. If an employee covered by this clause is not qualified to perform the position's duties by reason of disability sustained during active duty for training or inactive duty training, but is qualified to perform the duties of any other position in the employ of the employer or a successor in interest, that employee shall be restored by that employer or a successor in interest to another position, the duties of which that employee is qualified to perform and which will provide like seniority, status, and pay, or the nearest approximation thereof consistent with the circumstances in the particular case. For the purpose of this paragraph, the terms \"active duty for training\" and \"inactive duty for training\" shall have the meanings subscribed to them by the United States Code Annotated, title 38, part III, chapter 43, sections 2021 to 2026.\n(c) Any employee not covered by clause (a) shall be considered as having been on leave of absence during the period required to report for the purpose of being inducted into, entering or determining by a preinduction or other examination the employee's physical fitness to enter the military forces. If rejected, upon completion of the preinduction or other examination, or upon discharge from hospitalization incident to that rejection or examination, the employee shall be permitted to return to the employee's position in accordance with the provisions of clause (b).\nA person who engages in active service in the military forces in time of emergency declared by the proper authority of any state who is not an officer or employee of this state or of any political subdivision, municipal corporation, or other public agency of this state is entitled to leave and reinstatement in the same manner and to the same extent as granted to officers and employees of this state or of any political subdivision, municipal corporation, or other public agency of this state by subdivisions 1 to 4. The provisions of this subdivision shall not entitle a person given leave and reinstatement rights by this subdivision to any pay during such service as provided by section 192.26. The provisions of this subdivision do not apply to situations in which the person's reemployment rights are protected by United States Code Annotated, appendix 50, section 459(g) of the Selective Service Act of 1967.",
	"repealed": false
}