{
	"id": "10A.176",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.176",
	"title": "10A.176 COORDINATED EXPENDITURES.",
	"text": "An expenditure described in this section that expressly advocates for the election of the candidate or the defeat of the candidate's opponent is a coordinated expenditure and is not independent under section 10A.01, subdivision 18.\n(a) An expenditure is a coordinated expenditure if the expenditure is made on or after January 1 of the year the office will appear on the ballot by a spender for which the candidate, on or after January 1 of the year the office will appear on the ballot, has engaged in fundraising of money that is not general treasury money, as defined in section 10A.01, subdivision 17c, of the spender.\n(b) For purposes of this subdivision, candidate fundraising includes:\n(1) soliciting or collecting money for or to the spender that is not general treasury money; and\n(2) appearing for the spender as a speaker at an event raising money that is not general treasury money.\n(c) This subdivision does not apply to a candidate's fundraising on behalf of a party unit.\nAn expenditure is a coordinated expenditure if the expenditure is made on or after January 1 of the year the office will appear on the ballot by a spender that:\n(1) is not a party unit; and\n(2) is an association, political committee, political fund, independent expenditure political committee, or independent expenditure political fund, in which the candidate was a chairperson, deputy chairperson, treasurer, or deputy treasurer on or after January 1 of the year the office will appear on the ballot.\n(a) An expenditure is a coordinated expenditure if the expenditure is made during an election segment for consulting services from a consultant who has also provided consulting services to the candidate or the candidate's opponent during that same election segment.\n(b) This subdivision does not apply when the following conditions are met:\n(1) the consultant assigns separate personnel to the spender and the candidate;\n(2) the consultant has a written policy that describes the measures that the consultant has taken to prohibit the flow of information between the personnel providing services to the spender and the personnel providing services to the candidate;\n(3) the written policy has been distributed to all personnel and clients covered by the policy, including the candidate and the spender;\n(4) the consultant has implemented the measures described in the written policy; and\n(5) no information has been shared between the spender and the personnel that provided services to the spender and the candidate and the personnel providing services to the candidate.\nAn expenditure is a coordinated expenditure if the expenditure is made after the spender receives from the candidate information that is not publicly available regarding the candidate's campaign plans, strategy, or needs.\nAn expenditure is a coordinated expenditure if the expenditure is made when:\n(1) the spender provides information to the candidate regarding the expenditure's contents, intended audience, timing, location or mode, volume, or frequency; and\n(2) the information is provided to the candidate before the expenditure is communicated to the public.\nAn expenditure is a coordinated expenditure if the expenditure is made with the candidate's participation in the following:\n(1) any of the processes required for the creation and development of the expenditure, including budgeting decisions, media design, acquisition of graphics and text, production, and distribution of the final product; or\n(2) any decision regarding the content, timing, location, intended audience, volume of distribution, or frequency of the expenditure.",
	"repealed": false
}