{
	"id": "3.1985",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.1985",
	"title": "3.1985 LEGISLATIVE FUNDING; APPROPRIATION.",
	"text": "As used in this section, \"member expenses\" means:\n(1) compensation to members of the legislature, to include salary; payroll taxes; leadership pay; employer-paid benefits or contributions offered through the state employee group insurance program or the Minnesota State Retirement System; and any fees related to items identified in this clause; and\n(2) per diem and mileage costs associated with the conduct of legislative business by members of the legislature, and housing and communication costs for members, as authorized by the house of representatives Committee on Rules and Legislative Administration or the senate Committee on Rules and Administration.\n(a) Sums sufficient to fund member expenses of the house of representatives and the senate are appropriated from the general fund to the house of representatives and senate, as applicable.\n(b) No later than June 15 of each year, the controller of the house of representatives and the secretary of the senate must each certify to the commissioner of management and budget the amounts to be appropriated under this section for the fiscal year beginning July 1 of the same year.\n(c) No later than January 15 of each year, the controller of the house of representatives and the secretary of the senate must each certify to the commissioner of management and budget any changes to the current biennium's appropriations. Certifications provided by January 15 of an odd-numbered year must include estimated amounts to be appropriated for the fiscal biennium beginning the next July 1.\n(d) Amounts certified under paragraphs (b) and (c) must be the amounts determined by a majority vote conducted during a public meeting of the house of representatives Committee on Rules and Legislative Administration, or the senate Committee on Rules and Administration, as applicable.\n(e) At any time between the date funds are certified under this subdivision and the last date for adjusting the certified amount, the Legislative Advisory Commission may convene a meeting to review and provide advice on the certified amount. At its discretion, the committees may incorporate the advice of the Legislative Advisory Commission when making an adjustment to the certified amount.\n(f) Sums sufficient to address emergency needs of the house of representatives, senate, Legislative Coordinating Commission, and any other joint legislative office, council, or commission, are appropriated from the general fund to the house of representatives, senate, or Legislative Coordinating Commission, as applicable. Emergency needs may include but are not limited to information technology system failures, cybersecurity incidents, and physical infrastructure failures. The controller of the house of representatives, the secretary of the senate, or the executive director of the Legislative Coordinating Commission must certify to the commissioner of management and budget any amount to be appropriated under this paragraph, as directed by the speaker of the house, majority leader of the senate, or chair of the Legislative Coordinating Commission. To the extent practical, any amount proposed for appropriation must be submitted to the commissioner of management and budget for advice and comment prior to final certification. The total amount appropriated by this paragraph in a fiscal year must not exceed $1,000,000.\n(g) In the event of a nonappropriation caused by a gubernatorial veto impacting the house of representatives, the senate, the Legislative Coordinating Commission, or any other joint legislative office, council, or commission, the general fund appropriation base for the house of representatives, senate, or Legislative Coordinating Commission, plus three percent, is appropriated in the next fiscal year from the general fund to the house of representatives, senate, or Legislative Coordinating Commission, as applicable, for any expenses for which an appropriation is not otherwise provided by this section.\n(h) By October 15 each year, the house of representatives, the senate, and the Legislative Coordinating Commission must each submit a report to the commissioner of management and budget detailing expenditures made under paragraphs (a) and (f) for the prior fiscal year.\nNothing in this section precludes the house of representatives, the senate, or a joint legislative office or commission of the Legislative Coordinating Commission from receiving a direct appropriation by law or another statutory appropriation for a specific purpose provided in the direct or statutory appropriation. If the house of representatives, the senate, or a joint legislative office or commission receives a direct or statutory appropriation, the amount appropriated is distinct from and must not be considered during the biennial appropriation certification process under this section.",
	"repealed": false
}