{
	"id": "256B.5012",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.5012",
	"title": "256B.5012 ICF/DD PAYMENT SYSTEM IMPLEMENTATION.",
	"text": "The total payment rate effective October 1, 2000, for existing ICF/DD facilities is the total of the operating payment rate and the property payment rate plus inflation factors as defined in this section. The initial rate year shall run from October 1, 2000, through December 31, 2001. Subsequent rate years shall run from January 1 through December 31 beginning in the year 2002.\n(a) The operating payment rate equals the facility's total payment rate in effect on September 30, 2000, minus the property rate. The operating payment rate includes the special operating rate and the efficiency incentive in effect as of September 30, 2000. Within the limits of appropriations specifically for this purpose, the operating payment shall be increased for each rate year by the annual percentage change in the Employment Cost Index for Private Industry Workers - Total Compensation, as forecasted by the commissioner of management and budget's economic consultant, in the second quarter of the calendar year preceding the start of each rate year. In the case of the initial rate year beginning October 1, 2000, and continuing through December 31, 2001, the percentage change shall be based on the percentage change in the Employment Cost Index for Private Industry Workers - Total Compensation for the 15-month period beginning October 1, 2000, as forecast by Data Resources, Inc., in the first quarter of 2000.\n(b) Effective October 1, 2000, the operating payment rate shall be adjusted to reflect an occupancy rate equal to 100 percent of the facility's capacity days as of September 30, 2000.\n(c) Effective July 1, 2001, the operating payment rate shall be adjusted for the increases in the Department of Health licensing fees that were authorized in section 144.122.\n(a) The property payment rate effective October 1, 2000, is based on the facility's modified property payment rate in effect on September 30, 2000. The modified property payment rate is the actual property payment rate exclusive of the effect of gains or losses on disposal of capital assets or adjustments for excess depreciation claims. Effective October 1, 2000, a facility minimum property rate of $8.13 shall be applied to all existing ICF/DD facilities. Facilities with a modified property payment rate effective September 30, 2000, which is below the minimum property rate shall receive an increase effective October 1, 2000, equal to the difference between the minimum property payment rate and the modified property payment rate in effect as of September 30, 2000. Facilities with a modified property payment rate at or above the minimum property payment rate effective September 30, 2000, shall receive the modified property payment rate effective October 1, 2000.\n(b) Within the limits of appropriations specifically for this purpose, facility property payment rates shall be increased annually for inflation, effective January 1, 2002. The increase shall be based on each facility's property payment rate in effect on September 30, 2000. Modified property payment rates effective September 30, 2000, shall be arrayed from highest to lowest before applying the minimum property payment rate in paragraph (a). For modified property payment rates at the 90th percentile or above, the annual inflation increase shall be zero. For modified property payment rates below the 90th percentile but equal to or above the 75th percentile, the annual inflation increase shall be one percent. For modified property payment rates below the 75th percentile, the annual inflation increase shall be two percent.\nNotwithstanding Minnesota Rules, part 9505.0415, subpart 7, a vacant bed in an intermediate care facility for persons with developmental disabilities shall be counted as a reserved bed when determining occupancy rates and eligibility for payment of a therapeutic leave day.\n(a) For the rate years beginning July 1, 2001, and July 1, 2002, the commissioner shall make available to each facility reimbursed under this section an adjustment to the total operating payment rate of 3.5 percent. Of this adjustment, two-thirds must be used as provided under paragraph (b) and one-third must be used for operating costs.\n(b) The adjustment under this paragraph must be used to increase the wages and benefits and pay associated costs of all employees except administrative and central office employees, provided that this increase must be used only for wage and benefit increases implemented on or after the first day of the rate year and must not be used for increases implemented prior to that date.\n(c) For each facility, the commissioner shall make available an adjustment using the percentage specified in paragraph (a) multiplied by the total payment rate, excluding the property-related payment rate, in effect on the preceding June 30. The total payment rate shall include the adjustment provided in section 256B.501, subdivision 12.\n(d) A facility whose payment rates are governed by closure agreements, receivership agreements, or Minnesota Rules, part 9553.0075, is not eligible for an adjustment otherwise granted under this subdivision.\n(e) A facility may apply for the payment rate adjustment provided under paragraph (b). The application must be made to the commissioner and contain a plan by which the facility will distribute the adjustment in paragraph (b) to employees of the facility. For facilities in which the employees are represented by an exclusive bargaining representative, an agreement negotiated and agreed to by the employer and the exclusive bargaining representative constitutes the plan. A negotiated agreement may constitute the plan only if the agreement is finalized after the date of enactment of all rate increases for the rate year. The commissioner shall review the plan to ensure that the payment rate adjustment per diem is used as provided in this subdivision. To be eligible, a facility must submit its plan by March 31, 2002, and March 31, 2003, respectively. If a facility's plan is effective for its employees after the first day of the applicable rate year that the funds are available, the payment rate adjustment per diem is effective the same date as its plan.\n(f) A copy of the approved distribution plan must be made available to all employees by giving each employee a copy or by posting it in an area of the facility to which all employees have access. If an employee does not receive the wage and benefit adjustment described in the facility's approved plan and is unable to resolve the problem with the facility's management or through the employee's union representative, the employee may contact the commissioner at an address or telephone number provided by the commissioner and included in the approved plan.\nFor rate periods beginning on or after June 1, 2003, the commissioner shall increase the total operating payment rate for each facility reimbursed under this section by $3 per day. The increase shall not be subject to any annual percentage increase.\n(a) For the rate periods beginning October 1, 2005, and October 1, 2006, the commissioner shall make available to each facility reimbursed under this section an adjustment to the total operating payment rate of 2.2553 percent.\n(b) 75 percent of the money resulting from the rate adjustment under paragraph (a) must be used to increase wages and benefits and pay associated costs for employees, except for administrative and central office employees. 75 percent of the money received by a facility as a result of the rate adjustment provided in paragraph (a) must be used only for wage, benefit, and staff increases implemented on or after the effective date of the rate increase each year, and must not be used for increases implemented prior to that date. The wage adjustment eligible employees may receive may vary based on merit, seniority, or other factors determined by the provider.\n(c) For each facility, the commissioner shall make available an adjustment, based on occupied beds, using the percentage specified in paragraph (a) multiplied by the total payment rate, including variable rate but excluding the property-related payment rate, in effect on the preceding day. The total payment rate shall include the adjustment provided in section 256B.501, subdivision 12.\n(d) A facility whose payment rates are governed by closure agreements or receivership agreements is not eligible for an adjustment otherwise granted under this subdivision.\n(e) A facility may apply for the portion of the payment rate adjustment provided under paragraph (a) for employee wages and benefits and associated costs. The application must be made to the commissioner and contain a plan by which the facility will distribute the funds according to paragraph (b). For facilities in which the employees are represented by an exclusive bargaining representative, an agreement negotiated and agreed to by the employer and the exclusive bargaining representative constitutes the plan. A negotiated agreement may constitute the plan only if the agreement is finalized after the date of enactment of all rate increases for the rate year. The commissioner shall review the plan to ensure that the payment rate adjustment per diem is used as provided in this subdivision. To be eligible, a facility must submit its plan by March 31, 2006, and December 31, 2006, respectively. If a facility's plan is effective for its employees after the first day of the applicable rate period that the funds are available, the payment rate adjustment per diem is effective the same date as its plan.\n(f) A copy of the approved distribution plan must be made available to all employees by giving each employee a copy or by posting it in an area of the facility to which all employees have access. If an employee does not receive the wage and benefit adjustment described in the facility's approved plan and is unable to resolve the problem with the facility's management or through the employee's union representative, the employee may contact the commissioner at an address or telephone number provided by the commissioner and included in the approved plan.\n(a) For the rate year beginning October 1, 2007, the commissioner shall make available to each facility reimbursed under this section operating payment rate adjustments equal to 2.0 percent of the operating payment rates in effect on September 30, 2007. For the rate year beginning October 1, 2008, the commissioner shall make available to each facility reimbursed under this section operating payment rate adjustments equal to 2.0 percent of the operating payment rates in effect on September 30, 2008. For each facility, the commissioner shall make available an adjustment, based on occupied beds, using the percentage specified in this paragraph multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate, in effect on the preceding day. The total payment rate shall include the adjustment provided in section 256B.501, subdivision 12. A facility whose payment rates are governed by closure agreements or receivership agreements is not eligible for an adjustment otherwise granted under this subdivision.\n(b) Seventy-five percent of the money resulting from the rate adjustments under paragraph (a) must be used for increases in compensation-related costs for employees directly employed by the facility on or after the effective date of the rate adjustments, except:\n(1) the administrator;\n(2) persons employed in the central office of a corporation that has an ownership interest in the facility or exercises control over the facility; and\n(3) persons paid by the facility under a management contract.\n(c) Two-thirds of the money available under paragraph (b) must be used for wage increases for all employees directly employed by the facility on or after the effective date of the rate adjustments, except those listed in paragraph (b), clauses (1) to (3). The wage adjustment that employees receive under this paragraph must be paid as an equal hourly percentage wage increase for all eligible employees. All wage increases under this paragraph must be effective on the same date. Only costs associated with the portion of the equal hourly percentage wage increase that goes to all employees shall qualify under this paragraph. Costs associated with wage increases in excess of the amount of the equal hourly percentage wage increase provided to all employees shall be allowed only for meeting the requirements in paragraph (b). This paragraph shall not apply to employees covered by a collective bargaining agreement.\n(d) The commissioner shall allow as compensation-related costs all costs for:\n(1) wages and salaries;\n(2) FICA taxes, Medicare taxes, state and federal unemployment taxes, and workers' compensation;\n(3) the employer's share of health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, and pensions; and\n(4) other benefits provided, subject to the approval of the commissioner.\n(e) The portion of the rate adjustments under paragraph (a) that is not subject to the requirements in paragraphs (b) and (c) shall be provided to facilities effective October 1 of each year.\n(f) Facilities may apply for the portion of the rate adjustments under paragraph (a) that is subject to the requirements in paragraphs (b) and (c). The application must be submitted to the commissioner within six months of the effective date of the rate adjustments, and the facility must provide additional information required by the commissioner within nine months of the effective date of the rate adjustments. The commissioner must respond to all applications within three weeks of receipt. The commissioner may waive the deadlines in this paragraph under extraordinary circumstances, to be determined at the sole discretion of the commissioner. The application must contain:\n(1) an estimate of the amounts of money that must be used as specified in paragraphs (b) and (c);\n(2) a detailed distribution plan specifying the allowable compensation-related and wage increases the facility will implement to use the funds available in clause (1);\n(3) a description of how the facility will notify eligible employees of the contents of the approved application, which must provide for giving each eligible employee a copy of the approved application, excluding the information required in clause (1), or posting a copy of the approved application, excluding the information required in clause (1), for a period of at least six weeks in an area of the facility to which all eligible employees have access; and\n(4) instructions for employees who believe they have not received the compensation-related or wage increases specified in clause (2), as approved by the commissioner, and which must include a mailing address, email address, and the telephone number that may be used by the employee to contact the commissioner or the commissioner's representative.\n(g) The commissioner shall ensure that cost increases in distribution plans under paragraph (f), clause (2), that may be included in approved applications, comply with requirements in clauses (1) to (4):\n(1) costs to be incurred during the applicable rate year resulting from wage and salary increases effective after October 1, 2006, and prior to the first day of the facility's payroll period that includes October 1 of each year shall be allowed if they were not used in the prior year's application and they meet the requirements of paragraphs (b) and (c);\n(2) a portion of the costs resulting from tenure-related wage or salary increases may be considered to be allowable wage increases, according to formulas that the commissioner shall provide, where employee retention is above the average statewide rate of retention of direct care employees;\n(3) the annualized amount of increases in costs for the employer's share of health and dental insurance, life insurance, disability insurance, and workers' compensation shall be allowable compensation-related increases if they are effective on or after April 1 of the year in which the rate adjustments are effective and prior to April 1 of the following year; and\n(4) for facilities in which employees are represented by an exclusive bargaining representative, the commissioner shall approve the application only upon receipt of a letter of acceptance of the distribution plan, as regards members of the bargaining unit, signed by the exclusive bargaining agent and dated after May 25, 2007. Upon receipt of the letter of acceptance, the commissioner shall deem all requirements of this section as having been met in regard to the members of the bargaining unit.\n(h) The commissioner shall review applications received under paragraph (f) and shall provide the portion of the rate adjustments under paragraphs (b) and (c) if the requirements of this subdivision have been met. The rate adjustments shall be effective October 1 of each year. Notwithstanding paragraph (a), if the approved application distributes less money than is available, the amount of the rate adjustment shall be reduced so that the amount of money made available is equal to the amount to be distributed.\nEffective July 1, 2009, the commissioner shall decrease each facility reimbursed under this section operating payment adjustments equal to 2.58 percent of the operating payment rates in effect on June 30, 2009. For each facility, the commissioner shall implement the rate reduction, based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate, in effect on the preceding date. The total rate reduction shall include the adjustment provided in subdivision 7.\nEffective July 1, 2011, the commissioner shall increase the daily rate to $138.23 at an intermediate care facility for the developmentally disabled located in Clearwater County and classified as a class A facility with 15 beds.\nFor each facility reimbursed under this section, except for a facility located in Clearwater County and classified as a class A facility with 15 beds, the commissioner shall decrease operating payment rates equal to 0.095 percent of the operating payment rates in effect on June 30, 2011. For each facility, the commissioner shall apply the rate reduction, based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate, in effect on the preceding date. The total rate reduction shall include the adjustment provided in section 256B.501, subdivision 12.\nFor each facility reimbursed under this section, the commissioner shall decrease operating payments equal to 1.5 percent of the operating payment rates in effect on June 30, 2011. For each facility, the commissioner shall apply the rate reduction, based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate, in effect on the preceding date. The total rate reduction shall include the adjustment provided in section 256B.501, subdivision 12.\nFor each facility reimbursed under this section, the commissioner shall increase operating payments equal to one-half percent of the operating payment rates in effect on June 30, 2013. For each facility, the commissioner shall apply the rate increase, based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate, in effect on the preceding date. The total rate increase shall include the adjustment provided in section 256B.501, subdivision 12.\n[Repealed, 2013 c 108 art 7 s 64]\nFor rate periods beginning on or after June 1, 2013, the commissioner shall increase the total operating payment rate for each facility reimbursed under this section by $7.81 per day. The increase shall not be subject to any annual percentage increase.\n(a) Notwithstanding subdivision 12, for each facility reimbursed under this section, for the rate period beginning April 1, 2014, the commissioner shall increase operating payments equal to one percent of the operating payment rates in effect on March 31, 2014.\n(b) For each facility, the commissioner shall apply the rate increase based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate, but excluding the property-related payment rate in effect on the preceding date. The total rate increase shall include the adjustment provided in section 256B.501, subdivision 12.\n(a) For the rate period beginning July 1, 2014, the commissioner shall increase operating payments for each facility reimbursed under this section equal to five percent of the operating payment rates in effect on June 30, 2014.\n(b) For each facility, the commissioner shall apply the rate increase based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate in effect on June 30, 2014. The total rate increase shall include the adjustment provided in section 256B.501, subdivision 12.\n(c) To receive the rate increase under paragraph (a), each facility reimbursed under this section must submit to the commissioner documentation that identifies a quality improvement project that the facility will implement by June 30, 2015. Documentation must be provided in a format specified by the commissioner. Projects must:\n(1) improve the quality of life of intermediate care facility residents in a meaningful way;\n(2) improve the quality of services in a measurable way; or\n(3) deliver good quality service more efficiently while using the savings to enhance services for the participants served.\n(d) For a facility that fails to submit the documentation described in paragraph (c) by a date or in a format specified by the commissioner, the commissioner shall reduce the facility's rate by one percent effective January 1, 2015.\n(e) Facilities that receive a rate increase under this subdivision shall use 80 percent of the additional revenue to increase compensation-related costs for employees directly employed by the facility on or after July 1, 2014, except:\n(1) persons employed in the central office of a corporation or entity that has an ownership interest in the facility or exercises control over the facility; and\n(2) persons paid by the facility under a management contract.\nThis requirement is subject to audit by the commissioner.\n(f) Compensation-related costs include:\n(1) wages and salaries;\n(2) the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, workers' compensation, and mileage reimbursement;\n(3) the employer's share of health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, pensions, and contributions to employee retirement accounts; and\n(4) other benefits provided and workforce needs, including the recruiting and training of employees as specified in the distribution plan required under paragraph (i).\n(g) For public employees under a collective bargaining agreement, the increase for wages and benefits is available and pay rates must be increased only to the extent that the increases comply with laws governing public employees' collective bargaining. Money received by a facility under paragraph (e) for pay increases for public employees must be used only for pay increases implemented between July 1, 2014, and August 1, 2014.\n(h) For a facility that has employees that are represented by an exclusive bargaining representative, the provider shall obtain a letter of acceptance of the distribution plan required under paragraph (i), in regard to the members of the bargaining unit, signed by the exclusive bargaining agent. Upon receipt of the letter of acceptance, the facility shall be deemed to have met all the requirements of this subdivision in regard to the members of the bargaining unit. Upon request, the facility shall produce the letter of acceptance for the commissioner.\n(i) A facility that receives a rate adjustment under paragraph (a) that is subject to paragraph (e) shall prepare, and upon request submit to the commissioner, a distribution plan that specifies the amount of money the facility expects to receive that is subject to the requirements of paragraph (e), including how that money will be distributed to increase compensation for employees. The commissioner may recover funds from a facility that fails to comply with this requirement.\n(j) By January 1, 2015, the facility shall post the distribution plan required under paragraph (i) for a period of at least six weeks in an area of the facility's operation to which all eligible employees have access and shall provide instructions for employees who do not believe they have received the wage and other compensation-related increases specified in the distribution plan. The instructions must include a mailing address, email address, and telephone number that an employee may use to contact the commissioner or the commissioner's representative.\nEffective July 1, 2017, the daily rate for an intermediate care facility for persons with developmental disabilities located in Murray County that is classified as a class B facility and licensed for 14 beds is $400. This increase is in addition to any other increase that is effective on July 1, 2017.\n(a) For the rate period beginning January 1, 2022, the commissioner must increase operating payments for each facility reimbursed under this section equal to five percent of the operating payment rates in effect on December 31, 2021.\n(b) For each facility, the commissioner must apply the rate increase based on occupied beds, using the percentage specified in this subdivision multiplied by the total payment rate, including the variable rate but excluding the property-related payment rate in effect on December 31, 2021. The total rate increase must include the adjustment provided in section 256B.501, subdivision 12.\n(a) Effective January 1, 2024, the daily operating payment rate for a class A intermediate care facility for persons with developmental disabilities is increased by $40.\n(b) Effective January 1, 2024, the daily operating payment rate for a class B intermediate care facility for persons with developmental disabilities is increased by $40.\n(a) The minimum daily operating payment rate for a class A intermediate care facility for persons with developmental disabilities is $275.\n(b) The minimum daily operating payment rate for a class B intermediate care facility for persons with developmental disabilities is $316.\nBeginning January 1, 2025, and every year thereafter, the rates under this section must be updated for the percentage change in the Consumer Price Index (CPI-U) from the previous July 1 to the data available 12 months and one day prior.",
	"repealed": false
}