{
	"id": "168.1288",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.1288",
	"title": "168.1288 MINNESOTA MISSING AND MURDERED INDIGENOUS RELATIVES PLATES.",
	"text": "The commissioner must issue Minnesota missing and murdered Indigenous relatives special license plates or a single motorcycle plate to an applicant who:\n(1) is a registered owner of a passenger automobile, noncommercial one-ton pickup truck, motorcycle, or recreational vehicle;\n(2) pays an additional fee in the amount specified for special plates under section 168.12, subdivision 5;\n(3) pays the registration tax as required under section 168.013;\n(4) pays the fees required under this chapter;\n(5) contributes a minimum of $25 annually to the Minnesota missing and murdered Indigenous relatives account; and\n(6) complies with this chapter and rules governing registration of motor vehicles and licensing of drivers.\nIn consultation with the Office of Missing and Murdered Indigenous Relatives, the commissioner must adopt a suitable plate design that includes a red handprint to one side, a partial ribbon skirt toward the bottom corner, and reads \"Missing and Murdered Indigenous Relatives\" or \"MMIR.\"\nOn application to the commissioner and payment of a transfer fee of $5, special plates issued under this section may be transferred to another motor vehicle if the subsequent vehicle is:\n(1) qualified under subdivision 1, clause (1), to bear the special plates; and\n(2) registered to the same individual to whom the special plates were originally issued.\nSpecial plates issued under this section are not subject to section 168.1293, subdivision 2.\nContributions collected under subdivision 1, clause (5), must be deposited in the Minnesota missing and murdered Indigenous relatives account, which is established in the special revenue fund. Money in the account is annually appropriated to the commissioner of public safety. This appropriation is first for the annual cost of administering the account funds, and the remaining funds are for distribution to the Office of Missing and Murdered Indigenous Relatives for investigation of unsolved cases and to establish a reward fund for information relating to missing and murdered Indigenous relatives.",
	"repealed": false
}