{
	"id": "138.912",
	"url": "https://www.revisor.mn.gov/statutes/cite/138.912",
	"title": "138.912 HEALTHY EATING, HERE AT HOME.",
	"text": "The healthy eating, here at home program is established to provide incentives for low-income Minnesotans to use federal Supplemental Nutrition Assistance Program (SNAP) benefits for healthy purchases at Minnesota-based farmers' markets, mobile markets, and direct-farmer sales, including community-supported agriculture shares.\n(a) The definitions in this subdivision apply to this section.\n(b) \"Healthy eating, here at home\" means a program administered by the Minnesota Humanities Center to provide incentives for low-income Minnesotans to use SNAP benefits for healthy purchases at Minnesota-based farmers' markets.\n(c) \"Healthy purchases\" means SNAP-eligible foods.\n(d) \"Minnesota-based farmers' market\" means a physical market as defined in section 28A.151, subdivision 1, paragraph (b), and also includes mobile markets and direct-farmer sales, including through a community-supported agriculture model.\n(e) \"Voucher\" means a physical or electronic credit.\n(f) \"Eligible household\" means an individual or family that is determined to be a recipient of SNAP.\nThe Minnesota Humanities Center shall allocate grant funds to nonprofit organizations that work with Minnesota-based farmers' markets to provide up to $10 vouchers to SNAP participants who use electronic benefits transfer (EBT) cards for healthy purchases. Funds may also be provided for vouchers distributed through nonprofit organizations engaged in healthy cooking and food education outreach to eligible households for use at farmers' markets. Funds appropriated under this section may not be used for healthy cooking classes or food education outreach. When awarding grants, the Minnesota Humanities Center must consider how the nonprofit organizations will achieve geographic balance, including specific efforts to reach eligible households across the state, and the organizations' capacity to manage the programming and outreach.\nTo be eligible for a healthy eating, here at home voucher, an eligible household must meet the Minnesota SNAP eligibility requirements under section 142F.10.\nAn eligible household may use the voucher toward healthy purchases at Minnesota-based farmers' markets. Every eligible household that receives a voucher must be informed of the allowable uses of the voucher.\nThe nonprofit organizations that receive grant funds must report annually to the Minnesota Humanities Center with information regarding the operation of the program, including the number of vouchers issued and the number of people served. To the extent practicable, the nonprofit organizations must report on the usage of the vouchers and evaluate the program's effectiveness.\nThe commissioner of children, youth, and families must submit a waiver request to the federal United States Department of Agriculture seeking approval for the inclusion of Minnesota grocery stores in this program so that SNAP participants may use the vouchers for healthy produce at grocery stores. Grocery store participation is voluntary and a grocery store's associated administrative costs will not be reimbursed.",
	"repealed": false
}