{
	"id": "626.8458",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8458",
	"title": "626.8458 VEHICLE PURSUITS; POLICIES AND INSTRUCTION REQUIRED.",
	"text": "The legislature finds that emergency vehicle operations are an integral part of law enforcement's commitment to public safety. Law enforcement agencies shall make reasonable efforts to guide their officers in the safe and responsible performance of their emergency response duties. Although laws and rules provide the foundation for the conduct of law enforcement officers, continuous and effective training is essential to ensure proper law enforcement action during emergency vehicle operations, including police pursuits. This training must be designed to give officers both skills and decision-making ability so that emergency vehicle operations can be resolved safely and successfully.\n(a) By July 1, 1999, the board shall adopt a new or revised model policy governing the conduct of peace officers who are in pursuit of a vehicle being operated in violation of section 609.487. The board shall seek and consider comments of members of the public when adopting the policy. In order to assist peace officers in responding to the complex and unpredictable factors associated with police pursuits, the model policy shall, at a minimum, contain the following components:\n(1) a statement describing the philosophy of the model policy. This philosophy must state that the safety of all persons involved in or by a police pursuit is of primary importance. It also must balance the risks of the pursuit to the public and peace officers with the consequences of failing to pursue;\n(2) the factors to be considered in initiating and terminating a pursuit, and the standards for evaluating the need to initiate or terminate a pursuit;\n(3) the procedures, tactics, and technologies used during pursuits;\n(4) the various responsibilities of the pursuing officers, the officer supervising the pursuit, the dispatcher, and air support;\n(5) the procedures governing interjurisdictional pursuits;\n(6) the procedures governing care of any persons injured in the course of the pursuit;\n(7) the contents of pursuit reports filed under section 626.5532; and\n(8) the procedures used to evaluate each pursuit.\n(b) The board shall review and, as necessary, revise the model pursuit policy in collaboration with the Minnesota Chiefs of Police Association, the Minnesota Sheriffs Association, the Minnesota Police and Peace Officers Association, a representative from the State Patrol, and other interested law enforcement industry groups.\n(a) The chief law enforcement officer of every state and local law enforcement agency must establish and enforce a written policy governing the conduct of peace officers employed by the agency who are in pursuit of a vehicle being operated in violation of section 609.487. The policy must, at a minimum, comply with the requirements of any new or revised model pursuit policy adopted by the board under subdivision 2 and must take into account the comments of members of the public and any pursuit vehicle technology that is available to the agency.\n(b) Every state and local law enforcement agency must certify annually to the board that it has adopted a written policy in compliance with the board's model pursuit policy.\n(c) The board shall assist the chief law enforcement officer of each state and local law enforcement agency in developing and implementing pursuit policies under this subdivision.\n(a) By January 1, 2000, the board shall prepare learning objectives for instructing peace officers in emergency vehicle operations and in the conduct of police pursuits. The course shall consist of at least seven hours of classroom and skills-based training.\n(b) An individual is not eligible to take the peace officer licensing examination or the part-time peace officer licensing examination on or after January 1, 2000, unless the individual has received the training described in paragraph (a).\nThe chief law enforcement officer of every state and local law enforcement agency shall provide in-service training in emergency vehicle operations and in the conduct of police pursuits to every peace officer and part-time peace officer employed by the agency who the chief law enforcement officer determines may be involved in a police pursuit given the officer's responsibilities. The training shall comply with learning objectives developed and approved by the board and shall consist of at least eight hours of classroom and skills-based training every five years.\nThe board may impose licensing sanctions and seek injunctive relief under section 214.11 for failure to comply with the requirements of this section.",
	"repealed": false
}