{
	"id": "282.226",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.226",
	"title": "282.226 COUNTY COLLECTS PAYMENTS; REPORTS; EXPENSES.",
	"text": "The county treasurer shall collect all payments of principal and interest made under sections 282.221 to 282.226, place the same in a special fund, and forthwith submit to the natural resources commissioner a copy of the receipt specifying the name and address of the person making the payment and the date and amount thereof, whether for principal, timber, improvements or interest, the fund to which it is applicable, and the number of the certificate. Such receipt shall be countersigned by the auditor of such county, and shall have the same force and effect as if given by the commissioner of management and budget. The county treasurer shall report all collections to the commissioner of natural resources on June 30 and December 31 of each year and at such other times when requested by the commissioner. There shall be transferred from this special fund to the revenue fund of the county the cost of giving the notices required in section 282.222, subdivisions 1 and 2, and there shall be paid from this fund to the members of the county board upon warrant of the county auditor $10 per day for each day necessarily consumed in the classification and appraisal of the lands under sections 282.221 to 282.226 and mileage at the rate of six cents per mile for necessary travel and to the county auditor and the county treasurer for their additional duties such sums as the county board may by resolution determine, not to exceed to each annually one percent of the annual receipts under sections 282.221 to 282.226, and to help defray the costs of equipment and supplies, and for additional clerk hire in the county auditor's office such amount as the county board may by resolution determine, not to exceed annually ten percent of the annual receipts under sections 282.221 to 282.226. Where a county board has appointed a land commissioner under the provisions of section 282.13, instead of the amount provided for costs of equipment and supplies and additional clerk hire in the county auditor's office, such amount as the county board may by resolution determine, not to exceed annually ten percent of the annual receipts under sections 282.221 to 282.226, may be transferred from such fund to the tax-forfeited land fund to help defray expenses incurred by the county land department in administering such lands. The net amount remaining in this fund shall be transmitted by the county treasurer to the commissioner of natural resources as of June 30 and December 31 each year, and at such other times when requested by the commissioner, and credited to the Red Lake Game Preserve fund created by section 84A.03.",
	"repealed": false
}