{
	"id": "149A.941",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.941",
	"title": "149A.941 ALKALINE HYDROLYSIS FACILITIES AND ALKALINE HYDROLYSIS.",
	"text": "A dead human body may only be hydrolyzed in this state at an alkaline hydrolysis facility licensed by the commissioner of health.\nAny building to be used as an alkaline hydrolysis facility must comply with all applicable local and state building codes, zoning laws and ordinances, wastewater management regulations, and environmental statutes, rules, and standards. An alkaline hydrolysis facility must have, on site, a purpose built human alkaline hydrolysis system approved by the commissioner of health, a system approved by the commissioner of health for drying the hydrolyzed remains, a motorized mechanical device approved by the commissioner of health for processing hydrolyzed remains, and in the building a holding facility approved by the commissioner of health for the retention of dead human bodies awaiting alkaline hydrolysis. The holding facility must be secure from access by anyone except the authorized personnel of the alkaline hydrolysis facility, preserve the dignity of the remains, and protect the health and safety of the alkaline hydrolysis facility personnel.\nThe room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place shall be properly lit and ventilated with an exhaust fan that provides at least 12 air changes per hour.\nAll plumbing fixtures, water supply lines, plumbing vents, and waste drains shall be properly vented and connected pursuant to the Minnesota Plumbing Code. The alkaline hydrolysis facility shall be equipped with a functional sink with hot and cold running water.\nThe room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place shall have nonporous flooring, so that a sanitary condition is provided. The walls and ceiling of the room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place shall run from floor to ceiling and be covered with tile, or by plaster or sheetrock painted with washable paint or other appropriate material so that a sanitary condition is provided. The doors, walls, ceiling, and windows shall be constructed to prevent odors from entering any other part of the building. All windows or other openings to the outside must be screened, and all windows must be treated in a manner that prevents viewing into the room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place. A viewing window for authorized family members or their designees is not a violation of this subdivision.\nThe alkaline hydrolysis facility must have a functional emergency eye wash and quick drench shower.\n(a) The room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place must be private and have no general passageway through it. The room shall, at all times, be secure from the entrance of unauthorized persons. Authorized persons are:\n(1) licensed morticians;\n(2) registered interns or students as described in section 149A.91, subdivision 6;\n(3) public officials or representatives in the discharge of their official duties;\n(4) trained alkaline hydrolysis facility operators; and\n(5) the person or persons with the right to control the dead human body as defined in section 149A.80, subdivision 2, and their designees.\n(b) Each door allowing ingress or egress shall carry a sign that indicates that the room is private and access is limited. All authorized persons who are present in or enter the room where the alkaline hydrolysis vessel is located while a body is being prepared for final disposition must be attired according to all applicable state and federal regulations regarding the control of infectious disease and occupational and workplace health and safety.\nThe room where the alkaline hydrolysis vessel is located and the room where the chemical storage takes place and all fixtures, equipment, instruments, receptacles, clothing, and other appliances or supplies stored or used in the room must be maintained in a clean and sanitary condition at all times.\nWhen a boiler is required by the manufacturer of the alkaline hydrolysis vessel for its operation, all state and local regulations for that boiler must be followed.\nAll applicable provisions of state and federal regulations regarding exposure to workplace hazards and accidents shall be followed in order to protect the health and safety of all authorized persons at the alkaline hydrolysis facility.\nA licensed alkaline hydrolysis facility must employ a licensed mortician to carry out the process of alkaline hydrolysis of a dead human body. It is the duty of the licensed alkaline hydrolysis facility to provide proper procedures for all personnel, and the licensed alkaline hydrolysis facility shall be strictly accountable for compliance with this chapter and other applicable state and federal regulations regarding occupational and workplace health and safety.\nNo alkaline hydrolysis facility shall hydrolyze or cause to be hydrolyzed any dead human body or identifiable body part without receiving written authorization to do so from the person or persons who have the legal right to control disposition as described in section 149A.80 or the person's legal designee. The written authorization must include:\n(1) the name of the deceased and the date of death of the deceased;\n(2) a statement authorizing the alkaline hydrolysis facility to hydrolyze the body;\n(3) the name, address, telephone number, relationship to the deceased, and signature of the person or persons with legal right to control final disposition or a legal designee;\n(4) directions for the disposition of any nonhydrolyzed materials or items recovered from the alkaline hydrolysis vessel;\n(5) acknowledgment that the hydrolyzed remains will be dried and mechanically reduced to a granulated appearance and placed in an appropriate container and authorization to place any hydrolyzed remains that a selected urn or container will not accommodate into a temporary container;\n(6) acknowledgment that, even with the exercise of reasonable care, it is not possible to recover all particles of the hydrolyzed remains and that some particles may inadvertently become commingled with particles of other hydrolyzed remains that remain in the alkaline hydrolysis vessel or other mechanical devices used to process the hydrolyzed remains;\n(7) directions for the ultimate disposition of the hydrolyzed remains; and\n(8) a statement that includes, but is not limited to, the following information: \"During the alkaline hydrolysis process, chemical dissolution using heat, water, and an alkaline solution is used to chemically break down the human tissue and the hydrolyzable alkaline hydrolysis container. After the process is complete, the liquid effluent solution contains the chemical by-products of the alkaline hydrolysis process except for the deceased's bone fragments. The solution is cooled and released according to local environmental regulations. A water rinse is applied to the hydrolyzed remains which are then dried and processed to facilitate inurnment or scattering.\"\nA licensed alkaline hydrolysis facility acting in good faith, with reasonable reliance upon an authorization to hydrolyze, pursuant to an authorization to hydrolyze and in an otherwise lawful manner, shall be held harmless from civil liability and criminal prosecution for any actions taken by the alkaline hydrolysis facility.\n(a) No dead human body shall be accepted for final disposition by alkaline hydrolysis unless:\n(1) encased in an appropriate alkaline hydrolysis container;\n(2) accompanied by a disposition permit issued pursuant to section 149A.93, subdivision 3, including a photocopy of the completed death record or a signed release authorizing alkaline hydrolysis of the body received from the coroner or medical examiner; and\n(3) accompanied by an alkaline hydrolysis authorization that complies with subdivision 12.\n(b) An alkaline hydrolysis facility shall refuse to accept delivery of an alkaline hydrolysis container where there is:\n(1) evidence of leakage of fluids from the alkaline hydrolysis container;\n(2) a known dispute concerning hydrolysis of the body delivered;\n(3) a reasonable basis for questioning any of the representations made on the written authorization to hydrolyze; or\n(4) any other lawful reason.\nA dead human body must be hydrolyzed within 24 hours of the alkaline hydrolysis facility accepting legal and physical custody of the body.\nAll alkaline hydrolysis facility employees handling alkaline hydrolysis containers for dead human bodies shall use universal precautions and otherwise exercise all reasonable precautions to minimize the risk of transmitting any communicable disease from the body. No dead human body shall be removed from the container in which it is delivered.\nAll licensed alkaline hydrolysis facilities shall develop, implement, and maintain an identification procedure whereby dead human bodies can be identified from the time the alkaline hydrolysis facility accepts delivery of the remains until the hydrolyzed remains are released to an authorized party. After hydrolyzation, an identifying disk, tab, or other permanent label shall be placed within the hydrolyzed remains container before the hydrolyzed remains are released from the alkaline hydrolysis facility. Each identification disk, tab, or label shall have a number that shall be recorded on all paperwork regarding the decedent. This procedure shall be designed to reasonably ensure that the proper body is hydrolyzed and that the hydrolyzed remains are returned to the appropriate party. Loss of all or part of the hydrolyzed remains or the inability to individually identify the hydrolyzed remains is a violation of this subdivision.\nA licensed alkaline hydrolysis facility shall knowingly hydrolyze only dead human bodies or human remains in an alkaline hydrolysis vessel, along with the alkaline hydrolysis container used for infectious disease control.\nThe final disposition of dead human bodies by alkaline hydrolysis shall be done in privacy. Unless there is written authorization from the person with the legal right to control the disposition, only authorized alkaline hydrolysis facility personnel shall be permitted in the alkaline hydrolysis area while any dead human body is in the alkaline hydrolysis area awaiting alkaline hydrolysis, in the alkaline hydrolysis vessel, being removed from the alkaline hydrolysis vessel, or being processed and placed in a hydrolyzed remains container.\nExcept with the express written permission of the person with the legal right to control the disposition, no alkaline hydrolysis facility shall hydrolyze more than one dead human body at the same time and in the same alkaline hydrolysis vessel, or introduce a second dead human body into an alkaline hydrolysis vessel until reasonable efforts have been employed to remove all fragments of the preceding hydrolyzed remains, or hydrolyze a dead human body and other human remains at the same time and in the same alkaline hydrolysis vessel. This section does not apply where commingling of human remains during alkaline hydrolysis is otherwise provided by law. The fact that there is incidental and unavoidable residue in the alkaline hydrolysis vessel used in a prior hydrolyzation is not a violation of this subdivision.\nUpon completion of the alkaline hydrolysis process, reasonable efforts shall be made to remove from the alkaline hydrolysis vessel all of the recoverable hydrolyzed remains and nonhydrolyzed materials or items. Further, all reasonable efforts shall be made to separate and recover the nonhydrolyzed materials or items from the hydrolyzed human remains and dispose of these materials in a lawful manner, by the alkaline hydrolysis facility. The hydrolyzed human remains shall be placed in an appropriate container to be transported to the processing area.\nExcept with the express written permission of the person with the legal right to control the final disposition or otherwise provided by law, no alkaline hydrolysis facility shall dry or mechanically process the hydrolyzed human remains of more than one body at a time in the same drying device or mechanical processor, or introduce the hydrolyzed human remains of a second body into a drying device or mechanical processor until processing of any preceding hydrolyzed human remains has been terminated and reasonable efforts have been employed to remove all fragments of the preceding hydrolyzed remains. The fact that there is incidental and unavoidable residue in the drying device, the mechanical processor, or any container used in a prior alkaline hydrolysis process, is not a violation of this provision.\nThe hydrolyzed human remains shall be dried and then reduced by a motorized mechanical device to a granulated appearance appropriate for final disposition and placed in an alkaline hydrolysis remains container along with the appropriate identifying disk, tab, or permanent label. Processing must take place within the licensed alkaline hydrolysis facility. Dental gold, silver or amalgam, jewelry, or mementos, to the extent that they can be identified, may be removed prior to processing the hydrolyzed remains, only by staff licensed or registered by the commissioner of health; however, any dental gold and silver, jewelry, or mementos that are removed shall be returned to the hydrolyzed remains container unless otherwise directed by the person or persons having the right to control the final disposition. Every person who removes or possesses dental gold or silver, jewelry, or mementos from any hydrolyzed remains without specific written permission of the person or persons having the right to control those remains is guilty of a misdemeanor. The fact that residue and any unavoidable dental gold or dental silver, or other precious metals remain in the alkaline hydrolysis vessel or other equipment or any container used in a prior hydrolysis is not a violation of this section.\nIf a hydrolyzed remains container is of insufficient capacity to accommodate all hydrolyzed remains of a given dead human body, subject to directives provided in the written authorization to hydrolyze, the alkaline hydrolysis facility shall place the excess hydrolyzed remains in a secondary alkaline hydrolysis remains container and attach the second container, in a manner so as not to be easily detached through incidental contact, to the primary alkaline hydrolysis remains container. The secondary container shall contain a duplicate of the identification disk, tab, or permanent label that was placed in the primary container and all paperwork regarding the given body shall include a notation that the hydrolyzed remains were placed in two containers. Keepsake jewelry or similar miniature hydrolyzed remains containers are not subject to the requirements of this subdivision.\nNo hydrolyzed remains shall be disposed of or scattered in a manner or in a location where the hydrolyzed remains are commingled with those of another person without the express written permission of the person with the legal right to control disposition or as otherwise provided by law. This subdivision does not apply to the scattering or burial of hydrolyzed remains at sea or in a body of water from individual containers, to the scattering or burial of hydrolyzed remains in a dedicated cemetery, to the disposal in a dedicated cemetery of accumulated residue removed from an alkaline hydrolysis vessel or other alkaline hydrolysis equipment, to the inurnment of members of the same family in a common container designed for the hydrolyzed remains of more than one body, or to the inurnment in a container or interment in a space that has been previously designated, at the time of sale or purchase, as being intended for the inurnment or interment of the hydrolyzed remains of more than one person.\nEvery alkaline hydrolysis facility shall provide for the removal and disposition in a dedicated cemetery of any accumulated residue from any alkaline hydrolysis vessel, drying device, mechanical processor, container, or other equipment used in alkaline hydrolysis. Disposition of accumulated residue shall be according to the regulations of the dedicated cemetery and any applicable local ordinances.\nFollowing completion of the hydrolyzation, the inurned hydrolyzed remains shall be released according to the instructions given on the written authorization to hydrolyze. If the hydrolyzed remains are to be shipped, they must be securely packaged and transported by a method which has an internal tracing system available and which provides for a receipt signed by the person accepting delivery. Where there is a dispute over release or disposition of the hydrolyzed remains, an alkaline hydrolysis facility may deposit the hydrolyzed remains with a court of competent jurisdiction pending resolution of the dispute or retain the hydrolyzed remains until the person with the legal right to control disposition presents satisfactory indication that the dispute is resolved.\nIf, after 30 calendar days following the inurnment, the hydrolyzed remains are not claimed or disposed of according to the written authorization to hydrolyze, the alkaline hydrolysis facility or funeral establishment may give written notice, by certified mail, to the person with the legal right to control the final disposition or a legal designee, that the hydrolyzed remains are unclaimed and requesting further release directions. Should the hydrolyzed remains be unclaimed 120 calendar days following the mailing of the written notification, the alkaline hydrolysis facility or funeral establishment may dispose of the hydrolyzed remains in any lawful manner deemed appropriate.\nEvery alkaline hydrolysis facility shall create and maintain on its premises or other business location in Minnesota an accurate record of every hydrolyzation provided. The record shall include all of the following information for each hydrolyzation:\n(1) the name of the person or funeral establishment delivering the body for alkaline hydrolysis;\n(2) the name of the deceased and the identification number assigned to the body;\n(3) the date of acceptance of delivery;\n(4) the names of the alkaline hydrolysis vessel, drying device, and mechanical processor operator;\n(5) the time and date that the body was placed in and removed from the alkaline hydrolysis vessel;\n(6) the time and date that processing and inurnment of the hydrolyzed remains was completed;\n(7) the time, date, and manner of release of the hydrolyzed remains;\n(8) the name and address of the person who signed the authorization to hydrolyze;\n(9) all supporting documentation, including any transit or disposition permits, a photocopy of the death record, and the authorization to hydrolyze; and\n(10) the type of alkaline hydrolysis container.\nRecords required under subdivision 29 shall be maintained for a period of three calendar years after the release of the hydrolyzed remains. Following this period and subject to any other laws requiring retention of records, the alkaline hydrolysis facility may then place the records in storage or reduce them to microfilm, microfiche, laser disc, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of release of the hydrolyzed remains. At the end of this period and subject to any other laws requiring retention of records, the alkaline hydrolysis facility may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified.",
	"repealed": false
}