{
	"id": "326B.475",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.475",
	"title": "326B.475 RESTRICTED PLUMBER LICENSE.",
	"text": "(a) The commissioner of labor and industry shall grant a restricted journeyworker or restricted master plumber license to an individual if:\n(1) the individual completes an application with information required by the commissioner of labor and industry;\n(2) the completed application is accompanied by a fee of $30;\n(3) the commissioner of labor and industry receives the completed application and fee between October 1, 2009, and October 15, 2009;\n(4) the completed application for a restricted journeyworker plumber license demonstrates that, prior to the application, the applicant has had at least two years of practical plumbing experience in the plumbing trade; and\n(5) the completed application for a restricted master plumber license demonstrates that, prior to the application, the applicant has had:\n(i) at least four years of practical plumbing experience in the plumbing trade; or\n(ii) at least two years of practical plumbing experience as a plumbing contractor in the plumbing trade.\n(b) For applications received between October 1, 2009, and October 15, 2009, the commissioner may waive penalties for an applicant who failed to post a bond after June 30, 1999, under section 326B.46, subdivision 2, if the commissioner finds that the penalty would cause undue hardship or the waiver is otherwise warranted under the circumstances.\nA restricted master plumber and restricted journeyworker plumber may engage in the plumbing trade in all areas of the state except in cities and towns with a population of more than 5,000 according to the last federal census.\nApplications for restricted master plumber and restricted journeyworker plumber licenses must be submitted to the commissioner prior to October 1, 2008.\nA restricted master plumber and restricted journeyworker plumber license must be renewed for as long as that licensee engages in the plumbing trade. Notwithstanding section 326B.094, failure to renew a restricted master plumber and restricted journeyworker plumber license within 12 months after the expiration date will result in permanent forfeiture of the restricted master plumber and restricted journeyworker plumber license.\n[Repealed, 2010 c 347 art 3 s 75]\n[Repealed, 2010 c 347 art 3 s 75]\nThe renewal fee for the restricted master plumber and restricted journeyworker plumber licenses is the same fee as for a master or journeyworker plumber license, respectively.",
	"repealed": false
}