{
	"id": "237.766",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.766",
	"title": "237.766 PLAN DURATION AND EXTENSION.",
	"text": "An alternative regulation plan approved by the commission under section 237.764 must remain in force as approved for the term specified in the plan, which must be for no less than three years. Except as otherwise provided in this section, within six months prior to the termination of the plan the company shall give notice that it will propose a new plan, extend an existing plan, or revert to rate of return regulation.\nA new plan proposed by a company must be reviewed by the commission and, with the consent of the company, revised or approved consistent with sections 237.76 to 237.774, except that the justification of earnings levels in section 237.764, subdivision 1, paragraph (c), if required, and the provisions prohibiting rate increases at the initiation of or during the first three years of a plan contained in section 237.762, shall not apply to a new plan. Any new plan must be approved by the commission and shall contain a mechanism under which a telephone company may reduce the rates for price-regulated services below the initial rates or prices or increase the rates or prices during the term of the plan. The plan must specify the reports required of the telephone company for review of the plan and specify that the telephone company shall maintain records in sufficient detail to facilitate the review. A new plan is not an extension, which must be made pursuant to subdivision 3.\n(a) Notwithstanding the provisions of its plan, a telephone company operating under a plan as of May 20, 2004, may elect to extend that plan for up to three years from the expiration date of the plan or until December 31, 2007, whichever is earlier. The election is effective upon notification to customers, the commission, the department, and the Office of the Attorney General. A telephone company must provide notification of its election within 30 days of May 20, 2004, or within six months of the expiration of its current or expired plan, whichever is later. Once a telephone company has elected to exercise the option provided under this subdivision, the company may elect at any time to terminate the plan by notifying customers, the commission, the department, and the Office of the Attorney General, in writing, six months prior to the termination date. Upon termination of a plan, the company shall be regulated as provided in this chapter.\n(b) A telephone company may elect to extend a plan entered into after May 20, 2004, in lieu of proposing a new plan only if the company is in substantial compliance with the plan's service quality provisions and has met its infrastructure obligations under the plan. If the company elects to extend a plan, the rates for price-regulated services shall be capped at the rate levels in effect at the time the extension commences, provided, however, exceptions to a price cap contained in the plan being extended may remain in force. Unless otherwise specified in the plan, all other provisions of the plan shall continue in effect throughout the extension period. A plan may not be extended for less than one year or more than three years, and may only be extended once.\n(c) The Department of Commerce or the Office of the Attorney General may file an objection to the extension with the commission if the company is not in substantial compliance with the service quality provisions of its plan or has not met its infrastructure obligations under the plan. An objection must be filed within 45 days of the company's notice of its intention to extend the plan.\n(d) If an objection is filed by the Department of Commerce or the Office of the Attorney General, the commission may hold a hearing on the issues raised in the objection. The hearings shall be completed within 30 days of the deadline for filing the objections. If the commission finds that the issues raised in the objection are valid, it may reject the extension. If the commission finds that the issues raised in the objection are not valid, it shall approve the extension. The commission shall issue its decision within 15 days of the completion of the hearings concerning the objection.\n(e) If the Department of Commerce or the Office of the Attorney General does not file an objection, the commission shall approve the extension within 60 days of the company's filing of its notice of its intention to extend the plan.\n(a) A telephone company may elect to opt into another company's plan if:\n(1) the chosen plan is from a company that is larger than the electing company; or\n(2) the chosen plan is from an affiliated company; and\n(3) the plan is currently in effect.\n(b) A telephone company electing to enter an existing plan in lieu of proposing a new plan must operate under the terms of that plan for at least three years. If the original term of the existing plan was longer than three years, then the adopting company must operate under the plan for that longer period.\n(c) A telephone company that desires to adopt an existing plan must give notice to the commission at least 90 days prior to the proposed effective date of the adoption and to its customers at least 60 days prior to the proposed effective date.\n(d) The Department of Commerce or the Office of the Attorney General may file an objection to a telephone company that has previously operated under a plan from electing to opt into the plan of another company if the electing company is not in substantial compliance with the service quality provisions or has not met the infrastructure obligations of its plan.\n(e) If a telephone company has not previously operated under an alternative regulation plan, the rates for its price-regulated services must be capped for the first three years at the rates in effect at the time of opt in, except for any plan provisions that address exogenous changes.\n(f) Within 30 days of the electing company filing notice to the commission, interested parties may file comments identifying any aspect of the adoption that the party believes is contrary to the public interest. Reply comments may be filed within 45 days following the notice to the commission. The commission shall accept the adoption unless it finds adoption of the existing plan by the electing telephone company is not in the public interest, in which case it may reject or modify the election to opt into the provisions of the existing plan. If the commission modifies the election, the electing company may withdraw its proposed adoption of the existing plan by filing notice with the commission within 30 days of the commission's modification order.",
	"repealed": false
}