{
	"id": "65A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.35",
	"title": "65A.35 ADMINISTRATION.",
	"text": "Each insurer authorized to write and engaged in writing within this state, on a direct basis, property or liability insurance or any component of this insurance contained in a multiperil policy, including homeowners and commercial multiperil policies, shall participate in the plan as a condition of its authority to write such kinds of insurance within this state.\nThe purposes of the Minnesota FAIR plan are:\n(1) to formulate and administer, subject to the approval of the commissioner, a plan assuring fair access to insurance requirements in order that no property is denied property or liability insurance through the FAIR plan due to the condition of the property, except after a physical inspection of the property and a fair evaluation of its individual underwriting characteristics; and\n(2) to formulate and administer, subject to the approval of the commissioner, a reinsurance arrangement whereby the members of the Minnesota FAIR plan share equitably the responsibility for insuring property which is insurable but for which property or liability insurance cannot be obtained through normal insurance markets.\nThe plan of operation of the Minnesota FAIR plan, consistent with the provisions of sections 65A.31 to 65A.42 and the purpose of the plan must provide for the FAIR plan, the reinsurance arrangement, and the economical and efficient administration of the Minnesota FAIR plan, including, but not limited to, management of the plan, establishment of necessary facilities within this state, assessment of members to defray losses and expenses, commission arrangements, reasonable underwriting standards, acceptance and cession of reinsurance, and procedures for determining amounts of insurance to be provided.\nThe plan of operation is subject to approval by the commissioner.\nThe Minnesota FAIR plan shall amend the plan of operation on its own initiative, subject to prior approval by the commissioner, or at the direction of the commissioner.\n(1) The Minnesota FAIR plan is administered by a board of nine directors, five of whom are elected by the members of the plan and four who represent the public. Public directors may include licensed insurance agents. Public directors are appointed by the commissioner. No less than two elected directors must be representatives of domestic insurers. In the election of directors, each member of the Minnesota FAIR plan is allotted votes bearing the same ratio to the total number of votes to be cast as its degree of participation in the plan bears to the total participation.\n(2) Any vacancy among the elected directors must be filled by a vote of the other elected directors.\n(3) If at any time the members fail to elect the required number of directors to the board, or a vacancy remains unfilled for more than 15 days, the commissioner may appoint the directors necessary to constitute a full board of directors.\n(4) Vacancies among directors appointed by the commissioner must be filled by appointment by the commissioner. A person so appointed serves until the end of the term of the director the person is replacing.\n(5) All public directors serve for a period of two years. The terms of all public directors begin on July 1 of the year their appointments begin.\n(6) The plan of operation must provide for adequate compensation of public directors. A per diem amount and a procedure for reimbursement of expenses incurred in the discharge of their duties must be included in the plan. Private directors are not eligible for compensation.\n(7) At the option of the board, employees may participate in an insurance plan administered by the commissioner of management and budget under chapter 43A, except as otherwise provided in section 43A.27, subdivision 2, clause (6).\nAll members of the Minnesota FAIR plan shall participate in its expenses, losses, and equity distribution in the proportion that the premiums written as defined in this subdivision, but excluding that portion, if any, of premiums attributable to the reinsurance arrangement maintained by the facility, by each such member during the second preceding calendar year bear to the aggregate premiums written in this state by all members of the plan. Participation by each member in the plan is determined annually by the plan on the basis of such premiums written during the second preceding calendar year as disclosed in the annual statements and other reports filed by the member with the NAIC.",
	"repealed": false
}