{
	"id": "144A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.20",
	"title": "144A.20 ADMINISTRATOR QUALIFICATIONS.",
	"text": "The Board of Executives for Long Term Services and Supports may issue licenses to qualified persons as nursing home administrators or assisted living directors, and shall establish qualification criteria for nursing home administrators and assisted living directors.\n[Repealed, 1999 c 102 s 7]\nThe Board of Executives for Long Term Services and Supports may issue licenses to qualified persons as a nursing home administrator and shall approve training and examinations. No license shall be issued to a person as a nursing home administrator unless that person:\n(1) is at least 21 years of age and otherwise suitably qualified;\n(2) has satisfactorily met standards set by the Board of Executives for Long Term Services and Supports. The standards shall be designed to assure that nursing home administrators are individuals who, by training or experience, are qualified to serve as nursing home administrators; and\n(3) has passed an examination approved by the board and designed to test for competence in the subject matters referred to in clause (2), or has been approved by the Board of Executives for Long Term Services and Supports through the development and application of other appropriate techniques.\n(a) The Board of Executives for Long Term Services and Supports may issue licenses to qualified persons as an assisted living director and shall approve training and examinations. No license shall be issued to a person as an assisted living director unless that person:\n(1) is eligible for licensure;\n(2) has applied for licensure under this subdivision within 30 days of hire as an assisted living director; and\n(3) has satisfactorily met standards set by the board. The standards shall be designed to assure that assisted living directors are individuals who, by training or experience, are qualified to serve as assisted living directors.\n(b) In order to be qualified to serve as an assisted living director, an individual must:\n(1) have completed an approved training course and passed an examination approved by the board that is designed to test for competence and that includes assisted living facility laws in Minnesota; or\n(2)(i) currently be licensed in the state of Minnesota as a nursing home administrator or have been validated as a qualified health services executive by the National Association of Long Term Care Administrator Boards; and\n(ii) have core knowledge of assisted living facility laws.\n(c) An assisted living director must receive at least 30 hours of continuing education every two years on topics relevant to the operation of an assisted living facility and the needs of its residents. An assisted living director must maintain records of the continuing education required by this paragraph for at least the most recent three-year period and must provide these records to Department of Health surveyors upon request. Continuing education earned to maintain another professional license, such as a nursing home administrator license, nursing license, social worker license, mental health professional license, or real estate license, may be used to satisfy this requirement when the continuing education is relevant to the assisted living services offered and residents served at the assisted living facility.",
	"repealed": false
}