{
	"id": "245C.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.16",
	"title": "245C.16 DISQUALIFIED INDIVIDUAL'S RISK OF HARM.",
	"text": "(a) If the commissioner determines that the individual studied has a disqualifying characteristic, the commissioner shall review the information immediately available and make a determination as to the subject's immediate risk of harm to persons served by the program where the individual studied will have direct contact with, or access to, people receiving services.\n(b) The commissioner shall consider all relevant information available, including the following factors in determining the immediate risk of harm:\n(1) the recency of the disqualifying characteristic;\n(2) the recency of discharge from probation for the crimes;\n(3) the number of disqualifying characteristics;\n(4) the intrusiveness or violence of the disqualifying characteristic;\n(5) the vulnerability of the victim involved in the disqualifying characteristic;\n(6) the similarity of the victim to the persons served by the program where the individual studied will have direct contact;\n(7) whether the individual has a disqualification from a previous background study that has not been set aside;\n(8) if the individual has a disqualification which may not be set aside because it is a permanent bar under section 245C.24, subdivision 1, or the individual is a child care background study subject who has a felony-level conviction for a drug-related offense in the last five years, the commissioner may order the immediate removal of the individual from any position allowing direct contact with, or access to, persons receiving services from the program and from working in a children's residential facility or foster residence setting; and\n(9) if the individual has a disqualification which may not be set aside because it is a permanent bar under section 245C.24, subdivision 2, or the individual is a child care background study subject who has a felony-level conviction for a drug-related offense during the last five years, the commissioner may order the immediate removal of the individual from any position allowing direct contact with or access to persons receiving services from the center and from working in a licensed child care center or certified license-exempt child care center.\n(c) This section does not apply when the subject of a background study is regulated by a health-related licensing board as defined in chapter 214, and the subject is determined to be responsible for substantiated maltreatment under section 626.557 or chapter 260E.\n(d) This section does not apply to a background study related to an initial application for a child foster family setting license.\n(e) Except for paragraph (f), this section does not apply to a background study that is also subject to the requirements under section 256B.0659, subdivisions 11 and 13, for a personal care assistant or a qualified professional as defined in section 256B.0659, subdivision 1.\n(f) If the commissioner has reason to believe, based on arrest information or an active maltreatment investigation, that an individual poses an imminent risk of harm to persons receiving services, the commissioner may order that the person be continuously supervised or immediately removed pending the conclusion of the maltreatment investigation or criminal proceedings.\n(a) After evaluating the information immediately available under subdivision 1, the commissioner may have reason to believe one of the following:\n(1) the individual poses an imminent risk of harm to persons served by the program where the individual studied will have direct contact or access to persons served by the program or where the individual studied will work;\n(2) the individual poses a risk of harm requiring continuous, direct supervision while providing direct contact services during the period in which the subject may request a reconsideration; or\n(3) the individual does not pose an imminent risk of harm or a risk of harm requiring continuous, direct supervision while providing direct contact services during the period in which the subject may request a reconsideration.\n(b) After determining an individual's risk of harm under this section, the commissioner must notify the subject of the background study and the applicant or license holder as required under section 245C.17.\n(c) For Title IV-E eligible children's residential facilities and foster residence settings, the commissioner is prohibited from making the findings in paragraph (a), clause (2) or (3).\n(d) For licensed child care centers or certified license-exempt child care centers, the commissioner is prohibited from making the findings in paragraph (a), clause (2) or (3).\n(a) County licensing agencies performing duties under this section may develop an alternative system for determining the subject's immediate risk of harm to persons served by the program, providing the notices under subdivision 2, paragraph (b), and documenting the action taken by the county licensing agency.\n(b) Each county licensing agency's implementation of the alternative system is subject to approval by the commissioner.\n(c) Notwithstanding this alternative system, county licensing agencies shall complete the requirements of section 245C.17.",
	"repealed": false
}