{
	"id": "617.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.241",
	"title": "617.241 OBSCENE MATERIALS AND PERFORMANCES; DISTRIBUTION AND EXHIBITION PROHIBITED; PENALTY.",
	"text": "For purposes of this section, the following terms have the meanings given them:\n(a) \"Obscene\" means that the work, taken as a whole, appeals to the prurient interest in sex and depicts or describes in a patently offensive manner sexual conduct and which, taken as a whole, does not have serious literary, artistic, political, or scientific value. In order to determine that a work is obscene, the trier of fact must find:\n(1) that the average person, applying contemporary community standards would find that the work, taken as a whole, appeals to the prurient interest in sex;\n(2) that the work depicts sexual conduct specifically defined by paragraph (b) in a patently offensive manner; and\n(3) that the work, taken as a whole, lacks serious literary, artistic, political, or scientific value.\n(b) \"Sexual conduct\" means any of the following:\n(1) An act of sexual intercourse, normal or perverted, actual or simulated, including genital-genital, anal-genital, or oral-genital intercourse, whether between human beings or between a human being and an animal.\n(2) Sadomasochistic abuse, meaning flagellation or torture by or upon a person who is nude or clad in undergarments or in a sexually revealing costume or the condition of being fettered, bound, or otherwise physically restricted on the part of one so clothed or who is nude.\n(3) Masturbation, excretory functions, or lewd exhibitions of the genitals including any explicit, close-up representation of a human genital organ.\n(4) Physical contact or simulated physical contact with the clothed or unclothed pubic areas or buttocks of a human male or female, or the breasts of the female, whether alone or between members of the same or opposite sex or between humans and animals in an act of apparent sexual stimulation or gratification.\n(c) \"Community\" means the political subdivision from which persons properly qualified to serve as jurors in a criminal proceeding are chosen.\n(d) \"Work\" means \"material\" or \"performance.\"\n(e) \"Material\" means a book, magazine, pamphlet, paper, writing, card, advertisement, circular, print, picture, photograph, motion picture film, videotape, script, image, instrument, statue, drawing, or other article.\n(f) \"Performance\" means a play, motion picture, dance, or other exhibition performed before an audience.\nIt is unlawful for a person, knowing or with reason to know its content and character, to:\n(a) exhibit, sell, print, offer to sell, give away, circulate, publish, distribute or attempt to distribute any obscene material; or\n(b) produce, present, participate in, or direct an obscene performance.\nA person violating subdivision 2 is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $3,000, or both.\nWhoever violates the provisions of subdivision 2 within five years of a previous conviction under that subdivision is guilty of a felony and may be sentenced to imprisonment for not more than two years, or to payment of a fine of not more than $10,000, or both.",
	"repealed": false
}