{
	"id": "45.0135",
	"url": "https://www.revisor.mn.gov/statutes/cite/45.0135",
	"title": "45.0135 COMMERCE FRAUD BUREAU.",
	"text": "[Repealed, 2004 c 269 art 1 s 12]\n[Repealed, 2004 c 269 art 1 s 12]\n(a) The commissioner may appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), and establish a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), known as the Commerce Fraud Bureau, to conduct investigations, and to make arrests under sections 629.30 and 629.34. The primary jurisdiction of the law enforcement agency is limited to offenses with a nexus to insurance-related crimes or financial crimes.\n(b) Upon request and at the commissioner's discretion, the Commerce Fraud Bureau may respond to a law enforcement agency's request to exercise law enforcement duties in cooperation with the law enforcement agency that has jurisdiction over the particular matter.\n(c) The Commerce Fraud Bureau must allocate at least 70 percent of its work to insurance fraud, as defined in sections 60A.951, subdivision 4, and 609.611.\nThe Commerce Fraud Bureau shall:\n(1) review notices and reports within the Commerce Fraud Bureau's primary jurisdiction submitted by authorized insurers, their employees, and agents or producers;\n(2) respond to notifications or complaints within the Commerce Fraud Bureau's primary jurisdiction generated by other law enforcement agencies, state or federal governmental units, or any other person;\n(3) initiate inquiries and conduct investigations when the bureau has reason to believe that an offense within the Commerce Fraud Bureau's primary jurisdiction has been or is being committed; and\n(4) report crimes disclosed by the Commerce Fraud Bureau's investigations to appropriate law enforcement agencies, including, but not limited to, the attorney general, county attorneys, or any other appropriate law enforcement or regulatory agency, and shall assemble evidence, prepare charges, and otherwise assist any law enforcement authority having jurisdiction.\nThe initial processing of a person arrested by the Commerce Fraud Bureau for an offense within its jurisdiction is the responsibility of the bureau unless otherwise directed by the law enforcement agency with primary jurisdiction. Subsequent investigation shall be the responsibility of the bureau unless otherwise directed by the law enforcement agency with primary jurisdiction. At the request of the primary jurisdiction, the bureau may assist in a subsequent investigation being carried out by the primary jurisdiction.\nThe Commerce Fraud Bureau must develop a policy for notifying the law enforcement agency with primary jurisdiction when it has initiated investigation of any person within the jurisdiction of that agency.\nThe commissioner shall appoint a peace officer employed full time to be the chief law enforcement officer and to be responsible for the management of the Commerce Fraud Bureau. The chief law enforcement officer shall possess the necessary police and management experience to manage a law enforcement agency. The chief law enforcement officer may appoint, discipline, and discharge all employees of the bureau. All police managerial and supervisory personnel must be full-time employees of the bureau. Supervisory personnel must be on duty and available any time peace officers of the bureau are on duty.\nExcept as otherwise provided in this section, the Commerce Fraud Bureau shall comply with all statutes and administrative rules relating to the operation and management of a law enforcement agency.\nIf the bureau seeks evidence, documentation, and related materials pertinent to an investigation, and the matter is located outside of this state, the bureau may designate representatives, including officials of the state where the matter is located, to secure the matter or inspect the matter on its behalf.\nThe provisions of chapter 13, including, but not limited to, section 13.82, apply to the classification, disclosure, and collection of data relating to the Commerce Fraud Bureau.\nThe Commerce Fraud Bureau shall maintain records and information in order to produce an annual report of its activities as may be prescribed by the commissioner of commerce. The commissioner shall report annually to the house of representatives and senate standing committees with jurisdiction over insurance issues as to the activities of the bureau and the cost-effectiveness of the programs established by the bureau.\nThe insurance fraud prevention account is created in the state treasury. Money received from assessments under subdivision 7 and transferred from the automobile theft prevention account in sections 65B.84, subdivision 1, and 297I.11, subdivision 2, is deposited in the account. Money in this fund is appropriated to the commissioner of commerce for the purposes specified in this section and sections 60A.951 to 60A.956.\nEach insurer authorized to sell insurance in the state of Minnesota, including surplus lines carriers, and having Minnesota earned premium the previous calendar year shall remit an assessment to the commissioner for deposit in the insurance fraud prevention account on or before June 1 of each year. The amount of the assessment shall be based on the insurer's total assets and on the insurer's total written Minnesota premium, for the preceding fiscal year, as reported pursuant to section 60A.13. Beginning with the payment due on or before June 1, 2024, the assessment amount is:\nFor purposes of this subdivision, the following entities are not considered to be insurers authorized to sell insurance in the state of Minnesota: risk retention groups; or township mutuals organized under chapter 67A.\n(a) The Commerce Fraud Bureau may consult with the appropriate health-related board when a licensee, licensed under chapter 144E, 147, 148, 148B, or 150A, is suspected of insurance fraud.\n(b) The bureau shall, for any conviction involving or related to insurance, send copies of all public data in its possession to the appropriate health-related licensing board.\n(a) The commissioner may:\n(1) impose an administrative penalty against any person in an amount as set forth in paragraph (b) for each intentional act of insurance fraud or substantiated acts of attempted insurance fraud as defined in section 60A.951, subdivision 4, committed by that person;\n(2) order restitution to any person suffering loss as a result of the insurance fraud; and\n(3) order restitution to a company for the reasonable documented cost of any investigation in connection with the insurance fraud.\n(b) The administrative penalty for each violation described in paragraph (a) may be no more than:\n(1) $20,000 if the funds or the value of the property or services wrongfully obtained exceeds $5,000;\n(2) $10,000 if the funds or value of the property or services wrongfully obtained exceeds $1,000, but not more than $5,000;\n(3) $3,000 if the funds or value of the property or services wrongfully obtained is more than $500, but not more than $1,000; and\n(4) $1,000 if the funds or value of the property or services wrongfully obtained is $500 or less.\n(c) If an administrative penalty is not paid after all rights of appeal have been waived or exhausted, the commissioner may bring a civil action in a court of competent jurisdiction to collect the administrative penalty, including expenses and litigation costs, reasonable attorney fees, and interest.\n(d) This section does not affect a person's right to seek recovery, including expenses and litigation costs, reasonable attorney fees, and interest, against any person that commits insurance fraud.\n(e) For purposes of this subdivision, \"insurance fraud\" has the meaning given in section 60A.951, subdivision 4.\n(f) Hearings under this subdivision must be conducted in accordance with chapter 14 and any other applicable law.\n(g) All revenues from penalties, expenses, costs, fees, and interest collected under paragraphs (a) to (c) shall be deposited in the insurance fraud prevention account under subdivision 6.",
	"repealed": false
}