{
	"id": "148F.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.075",
	"title": "148F.075 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "(a) The purpose of mandatory continuing education is to promote the professional development of alcohol and drug counselors so that the services they provide promote the health and well-being of clients who receive services.\n(b) Continued professional growth and maintaining competence in providing alcohol and drug counseling services are the ethical responsibilities of each licensee.\nEvery two years, all licensees must complete a minimum of 40 clock hours of continuing education activities that meet the requirements in this section. The 40 clock hours shall include a minimum of nine clock hours on diversity, and a minimum of three clock hours on professional ethics. Diversity training includes, but is not limited to, the topics listed in Minnesota Rules, part 4747.1100, subpart 2. A licensee may be given credit only for activities that directly relate to the practice of alcohol and drug counseling.\nIn order to obtain clock hour credit for a continuing education activity, the activity must:\n(1) constitute an organized program of learning;\n(2) reasonably be expected to advance the knowledge and skills of the alcohol and drug counselor;\n(3) pertain to subjects that directly relate to the practice of alcohol and drug counseling;\n(4) be conducted by individuals who have education, training, and experience and are knowledgeable about the subject matter; and\n(5) be presented by a sponsor who has a system to verify participation and maintains attendance records for three years, unless the sponsor provides dated evidence to each participant with the number of clock hours awarded.\nClock hours may be earned through the following:\n(1) attendance at educational programs of annual conferences, lectures, panel discussions, workshops, in-service trainings, seminars, and symposia;\n(2) successful completion of college or university courses offered by a regionally accredited school or education program, if not being taken in order to meet the educational requirements for licensure under this chapter. The licensee must obtain a grade of at least a \"C\" or its equivalent or a pass in a pass/fail course in order to receive the following continuing education credits:\n(i) one semester credit equals 15 clock hours;\n(ii) one trimester credit equals 12 clock hours; and\n(iii) one quarter credit equals ten clock hours;\n(3) successful completion of home study or online courses offered by an accredited school or education program and that require a licensee to demonstrate knowledge following completion of the course;\n(4) teaching a course at a regionally accredited institution of higher education. To qualify for continuing education credit, the course must directly relate to the practice of alcohol and drug counseling, as determined by the board. Continuing education hours may be earned only for the first time the licensee teaches the course. Ten continuing education hours may be earned for each semester credit hour taught; or\n(5) presentations at workshops, seminars, symposia, meetings of professional organizations, in-service trainings, or postgraduate institutes. The presentation must be related to alcohol and drug counseling. A presenter may claim one hour of continuing education for each hour of presentation time. A presenter may also receive continuing education hours for development time at the rate of three hours for each hour of presentation time. Continuing education hours may be earned only for the licensee's first presentation on the subject developed.\nApproval shall not be given for courses that do not meet the requirements of this section or are limited to the following:\n(1) any subject contrary to the rules of professional conduct;\n(2) supervision of personnel;\n(3) entertainment or recreational activities;\n(4) employment orientation sessions;\n(5) policy meetings;\n(6) marketing;\n(7) business;\n(8) first aid, CPR, and similar training classes; and\n(9) training related to payment systems, including covered services, coding, and billing.\n(a) When the licensee applies for renewal of the license, the licensee must complete and submit an affidavit of continuing education compliance showing that the licensee has completed a minimum of 40 approved continuing education clock hours since the last renewal. Failure to submit the affidavit when required makes the licensee's renewal application incomplete and void.\n(b) All licensees shall retain original documentation of completion of continuing education hours for a period of five years. For purposes of compliance with this section, a receipt for payment of the fee for the course is not sufficient evidence of completion of the required hours of continuing education. Information retained shall include:\n(1) the continuing education activity title;\n(2) a brief description of the continuing education activity;\n(3) the sponsor, presenter, or author;\n(4) the location and the dates attended;\n(5) the number of clock hours; and\n(6) the certificate of attendance, if applicable.\n(c) Only continuing education obtained during the two-year reporting period may be considered at the time of reporting.\n(a) At the time of renewal, the board may randomly audit a percentage of its licensees for compliance with continuing education requirements.\n(b) The board shall mail a notice to a licensee selected for an audit of continuing education hours. The notice must include the reporting periods selected for audit.\n(c) Selected licensees shall submit copies of the original documentation of completed continuing education hours. Upon specific request, the licensee shall submit original documentation. Failure to submit required documentation shall result in the renewal application being considered incomplete and void and constitute grounds for nonrenewal of the license and disciplinary action.\n(a) If a licensee is unable to meet the continuing education requirements by the renewal date, the licensee may request a time-limited variance to fulfill the requirements after the renewal date. A licensee seeking a variance is considered to be renewing late and is subject to the late renewal fee, regardless of when the request is received or whether the variance is granted.\n(b) The licensee shall submit the variance request on a form designated by the board, include the variance fee subject to section 14.056, subdivision 2, and the late fee for license renewal under section 148F.115. The variance request is subject to the criteria for rule variances in section 14.055, subdivision 4, and must include a written plan listing the activities offered to meet the requirement. Hours completed after the renewal date pursuant to the written plan count toward meeting only the requirements of the previous renewal period.\n(c) A variance granted under this subdivision expires six months after the license renewal date. A licensee who is granted a variance but fails to complete the required continuing education within the six-month period may apply for a second variance according to this subdivision.\n(d) If an initial variance request is denied, the license of the licensee shall not be renewed until the licensee completes the continuing education requirements. If an initial variance is granted, and the licensee fails to complete the required continuing education within the six-month period, the license shall be administratively suspended until the licensee completes the required continuing education, unless the licensee has obtained a second variance according to paragraph (c).",
	"repealed": false
}