{
	"id": "469.084",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.084",
	"title": "469.084 ST. PAUL.",
	"text": "Notwithstanding any law to the contrary, the port authority of the city of St. Paul may plan for, acquire by condemnation, purchase, or otherwise, construct, improve, operate, directly, by lease or otherwise, and maintain parks and other recreation facilities anywhere within its port district. The port authority shall establish rules on the use of the rivers, lakes, parks and recreation facilities either alone or in cooperation with the federal government or its agencies, the city of St. Paul, the state, or an agency or political subdivision of the state.\nThe port authority may conduct meetings as provided by section 13D.015.\nThe port authority does not have police power except as provided by subdivisions 1 to 8.\nThe port authority must not take lands owned, controlled, or used by the city of St. Paul without consent of the city council.\nFor all other recreation purposes the port authority has jurisdiction over the use of all the navigable rivers or lakes and all the parks and recreation facilities abutting the rivers and lakes.\nThe port authority may spend port authority money to carry out subdivisions 1 to 8 and issue bonds for the purposes in subdivisions 1 to 8 according to either section 469.060 or 469.061.\nThe port authority, prior to taking action under subdivisions 1 to 8, shall submit for approval plans to acquire, improve, and operate parks and recreation facilities along navigable rivers and lakes within its port district to the city of St. Paul and shall submit the plans for all areas located within Ramsey County, whether located within or without the port district, to the county for approval.\nNotwithstanding any law to the contrary, the sale of revenue bonds issued by the port authority under section 469.061, shall be at public sale under section 475.60, or in accordance with the procedures set forth in sections 469.152 to 469.165. The bonds may be sold in the manner and for the price that the port authority determines to be for the best interest of the port authority. A sale must not be made at a price so low as to cause the average annual rate of interest on the money received from the sale to exceed eight percent per year computed by adding the amount of the discount to the total amount of interest payable on all obligations of the series to their stated maturity dates. The bonds may be made callable. If issued as callable, the bonds may be refunded.\nNotwithstanding any law to the contrary, the port authority of the city of St. Paul, under sections 469.048 to 469.068 and this section, may do what a redevelopment agency may do or must do under sections 469.152 to 469.165 to further any of the purposes of sections 469.048 to 469.068 and subdivisions 1 to 8. The port authority may use its powers and duties under sections 469.048 to 469.068 and subdivisions 1 to 8 to further the purposes of sections 469.152 to 469.165. The powers and duties in subdivisions 1 to 8 are in addition to the powers and duties of the port authority under sections 469.048 to 469.068, and under sections 469.152 to 469.165. The port authority may use its powers for industrial development or to establish industrial development districts. If the term \"industrial\" is used in relation to industrial development purposes under sections 469.048 to 469.068, the term includes \"economic\" and \"economic development.\"\nNotwithstanding any contrary law, the port authority of the city of St. Paul may participate with public or private corporations or other entities, whose purpose is to provide venture capital to small businesses that have facilities located or to be located in the port district. For that purpose the port authority may use not more than ten percent of available annual net income or $400,000 annually, whichever is less, to acquire or invest in securities of, and enter into financing arrangements and related agreements with, the corporations or entities. The participation by the port authority must not exceed in any year 25 percent of the total amount of funds provided for venture capital purposes by all of the participants. The corporation or entity shall report in writing each month to the commissioners of the port authority all investment and other action taken by it since the last report. Funds contributed to the corporation or entity must be invested pro rata with each contributor of capital taking proportional risks on each investment. As used in this subdivision, the term \"small business\" has the meaning given it in section 645.445, subdivision 2.\nThe port authority of the city of Saint Paul has jurisdiction over the use of the Mississippi River for recreation purposes within its port district and may acquire and may spend port authority money for lands abutting the river within the port district to construct, operate directly, by lease or otherwise, and maintain recreation facilities. The authority shall establish rules on the use of the river and abutting lands, either individually, or in cooperation with the federal government or its agencies, the city of Saint Paul, the state, or a state agency, or political subdivision.\nNotwithstanding any law or charter provision to the contrary, an issue of revenue bonds authorized by the port authority of the city of St. Paul shall be issued only with the consent of the St. Paul City Council in a resolution. Notwithstanding any law or charter provision to the contrary, a project to be financed by the port authority of the city of St. Paul by proceeds of revenue bonds shall be financed only with the consent of the St. Paul City Council in a resolution. An existing obligation, contract, collective bargaining or other agreement, fringe benefit plan, or covenant made or entered into by the St. Paul Port Authority is not impaired by this subdivision.\nNotwithstanding any law or charter provision to the contrary, the council may, by resolution adopted by a majority of the council, place any employee of the port authority under the direction, supervision, or control of the mayor or a department of the city.\nNotwithstanding section 118A.04 or other law, the port authority of the city of St. Paul may invest its funds in commercial paper of prime quality in the same manner as the state board of investment may invest money not currently needed.\nThe treasurer and assistant treasurer of the port authority of the city of St. Paul shall give bond to the state in sums not to exceed $25,000 and $10,000 respectively. The bonds must be conditioned for the faithful discharge of their duties. The bonds must be approved as to both form and surety by the port authority and must be filed with its secretary. The amount of the bonds must be set at least annually by the port authority.\nIf the port authority receives real property through termination of a revenue agreement, as defined in section 469.153, subdivision 10, or as the result of refinancing and contracts with a corporation to operate the property, the corporation may sell, purchase, or rent supplies, materials, or equipment, or construct, alter, expand, repair, or maintain the real property without regard to section 471.345.",
	"repealed": false
}