{
	"id": "246C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.04",
	"title": "246C.04 TRANSFER OF DUTIES.",
	"text": "(a) Section 15.039 applies to the transfer of responsibilities from the Department of Human Services to Direct Care and Treatment required by this chapter.\n(b) The commissioner of administration, with the governor's approval, shall issue reorganization orders under section 16B.37 as necessary to carry out the transfer of duties required by this chapter. The provision of section 16B.37, subdivision 1, stating that transfers under section 16B.37 may only be to an agency that has existed for at least one year does not apply to transfers to an agency created by this chapter.\nThe commissioner of human services shall continue to exercise all authority and responsibility for and retain custody of persons subject to civil commitment under chapter 253B or 253D until July 1, 2025. Effective July 1, 2025, custody of persons subject to civil commitment under chapter 253B or 253D and in the custody of the commissioner of human services as of that date is hereby transferred to the executive board without any further act or proceeding. Authority and responsibility for the commitment of such persons is transferred to the executive board July 1, 2025.\nThe commissioner of human services shall continue to exercise all authorities and responsibilities under this chapter and chapters 13, 245, 246, 246B, 252, 253, 253B, 253C, 253D, 254A, 254B, and 256, with reference to any state-operated service, program, or facility subject to transfer under Laws 2024, chapter 79; Laws 2024, chapter 125, article 5; and Laws 2024, chapter 127, article 50, until July 1, 2025. Effective July 1, 2025, the powers and duties vested in or imposed upon the commissioner of human services with reference to any state-operated service, program, or facility are hereby transferred to, vested in, and imposed upon the executive board according to this chapter and applicable state law. Effective July 1, 2025, the executive board has the exclusive power of administration and management of all state hospitals for persons with a developmental disability, mental illness, or substance use disorder. Effective July 1, 2025, the executive board has the power and authority to determine all matters relating to the development of all of the foregoing institutions and of such other institutions vested in the executive board. Effective July 1, 2025, the powers, functions, and authority vested in the commissioner of human services relative to such state institutions are transferred to the executive board according to this chapter and applicable state law.\nThere is hereby appropriated to such persons or institutions as are entitled to such sums as are provided for in this section, from the fund or account in the state treasury to which the money was credited, an amount sufficient to make such payment.",
	"repealed": false
}