{
	"id": "84.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.155",
	"title": "84.155 CONSERVATION PROJECTS; BELTRAMI ISLAND, PINE ISLAND.",
	"text": "Leases entered into between the United States of America and the state of Minnesota, through the commissioner of conservation, under date of August 2, 1940, demising to the state of Minnesota federal owned lands in what are known as the Beltrami and Pine Island areas, located in the counties of Koochiching, Roseau, Lake of the Woods, and Beltrami, in the state of Minnesota, for a period of 50 years, are hereby in all things ratified and approved.\nFor the purpose of protecting, preserving, and managing wild life, forest and water resources, there is hereby established the Beltrami Island conservation project consisting of all lands within the descriptions hereinafter contained. All public lands, except tax-forfeited lands, lying within these areas are hereby set aside and reserved from sale. These areas shall comprise the following lands and waters in Beltrami County, Minnesota:\nAll of Townships 155 and 156 North, in Ranges 31, 32, 33, 34, and 35 West of the fifth principal meridian:\nAll of Townships 157 and 158 North, in Ranges 36 and 37 West of the fifth principal meridian:\nand the following described lands and waters in the Lake of the Woods County, Minnesota:\nAll of Township 157 North, Range 32 West of the fifth principal meridian:\nAll of Townships 157, 158, and 159 North, in Range 33 West of the fifth principal meridian:\nAll of Townships 157, 158, 159, and 160 North, in Range 34 West of the fifth principal meridian:\nAll of Townships 157, 158, 159, and 160 North, in Range 35 West of the fifth principal meridian:\nAll of Townships 159 and 160 North, in Range 36 West of the fifth principal meridian:\nand the following described lands and waters in Roseau County, Minnesota:\nThe South one-half of Township 161 North, in Range 35 West of the fifth principal meridian:\nThe South one-half of Township 161 North, in Range 36 West of the fifth principal meridian:\nAll of Townships 159 and 160 and the South two-thirds of Township 161 North, in Range 37 West of the fifth principal meridian, and\nThe East two-thirds of Township 160 North, in Range 38 West of the fifth principal meridian.\nFor the purpose of protecting, preserving and managing wild life, forest and water resources, there is hereby established the Pine Island conservation project consisting of all lands within the descriptions hereinafter contained. All public lands, except tax-forfeited lands, lying within these areas are hereby set aside and reserved from sale. These areas shall comprise the following lands and waters in Koochiching County, Minnesota:\nAll of Townships 64 and 65 North, in Range 24 and 25 West of the fourth principal meridian:\nAll of Townships 64, 65, 66, and 67 North, in Range 26 West of the fourth principal meridian:\nAll of the lands in Townships 64, 65, 66, and 67 North, in Range 27 West of the fourth principal meridian:\nAll of Township 152; the South one-half of Township 153; all of Townships 155 and 156; the West two-thirds of Township 157; and that portion of Township 158 North situated south of the center line of Black River, all in Range 25 West of the fifth principal meridian:\nAll of Township 152 North; the South one-half of Township 153; the North one-half of Township 155; all of Townships 156 and 157; and that portion of Township 158 North situated south of the center line of Black River, all in Range 26 West of the fifth principal meridian:\nAll of Townships 153 and 154; the North one-half of Township 155; all of Townships 156 and 157, and that portion of Township 158 North situated south of the center line of Black River and east of that branch of the Black River that flows north through Sections 33 and 28, in Range 27 West of the fifth principal meridian:\nAll of Townships 153, 154, 155, 156, 157, and 158 and the West one-third of Township 159 North, in Range 28 West of the fifth principal meridian; and\nAll of Townships 153, 154, 155, 156, 157, 158, and 159 North, in Range 29 West of the fifth principal meridian.\nAll public lands except tax-forfeited lands, owned by the state of Minnesota, as well as lands owned by the United States and leased by the state of Minnesota within the Beltrami and Pine Island projects shall be under the management and control of the commissioner, who shall have authority to negotiate for and enter into on behalf of the state of Minnesota, leases for hay stumpage and timber stumpage at such fees and prices as the commissioner may determine reasonable and just.\nWithin the boundaries of the Beltrami Island and Pine Island areas, the commissioner is hereby given full power and authority to make, establish, promulgate, and enforce all necessary rules for the care, preservation, protection, breeding, propagation, and disposition of any and all species of wild life therein and the regulation, issuance, sale, and revocation of special licenses or special permits for hunting, fishing, trapping, camping and other uses within the areas not inconsistent with the terms of this section. The commissioner shall have the power and authority to declare the terms and conditions of such licenses and permits and the charges to be made therefor. The commissioner may issue rules specifying and controlling the terms under and by which any wild animals may be taken, captured, or killed therein or under and by which fur-bearing animals having commercial value may be sold and transported. The commissioner may regulate and effect the sale of merchantable timber from such lands as are owned or leased by the state; provided, authority as to the leased lands shall not exceed that provided in the leases.\nThere shall be created two accounts, one to be known as the Beltrami Island conservation account and the other as the Pine Island conservation account. All income and revenue received by virtue of all hay and stumpage leases, timber sales, sales of special licenses and permits, as hereinabove provided, from each of the areas described in this section, shall be paid in to the state treasury and credited to that account bearing the name of the project from which the income was derived. These sums are hereby appropriated for the purpose of administering said areas in accordance with the terms of this section and the terms of the leases herein referred to as having been approved and ratified and for making repairs and replacements on the properties leased as provided by the leases. Any portion of income or revenue not needed for the above purposes may be used, subject to the mutual agreement between the state of Minnesota and the United States provided for in the leases, covering the acquisition by the state of Minnesota of additional lands to block in, round out and enlarge its holdings. Nothing herein contained shall alter, modify, or change the method of handling revenue or income provided for in Laws 1929, chapter 258, from lands now in the public domain under the provisions of that act and nothing herein contained shall alter, modify, or change the method of handling revenue or income provided for in Laws 1929, chapter 258, from lands now in the public domain under the provisions of this section.",
	"repealed": false
}