{
	"id": "243.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.52",
	"title": "243.52 DISCIPLINE; PREVENTION OF ESCAPE; DUTY TO REPORT.",
	"text": "If any person confined or incarcerated in any adult correctional facility either under the control of the commissioner of corrections or licensed by the commissioner of corrections under section 241.021 assaults any correctional officer or any other person, the assaulted person may use force in defense of the assault, except as limited in this section. If any confined or incarcerated person attempts to damage the buildings or appurtenances, resists the lawful authority of any correctional officer, refuses to obey the correctional officer's reasonable demands, or attempts to escape, the correctional officer may enforce obedience and discipline or prevent escape by the use of force. If any confined or incarcerated person resisting lawful authority is wounded or killed by the use of force by the correctional officer or assistants, that conduct is authorized under this section.\n(a) Use of force must not be applied maliciously or sadistically for the purpose of causing harm to a confined or incarcerated person.\n(b) Unless the use of deadly force is justified in this section, a correctional officer working in an adult correctional facility either under the control of the commissioner of corrections or licensed by the commissioner under section 241.021 may not use any of the following restraints:\n(1) a choke hold;\n(2) a prone restraint;\n(3) tying all of a person's limbs together behind the person's back to render the person immobile; or\n(4) securing a person in any way that results in transporting the person face down in a vehicle, except as directed by a medical professional.\n(c) For the purposes of this subdivision, the following terms have the meanings given them:\n(1) \"choke hold\" means a method by which a person applies sufficient pressure to a person to make breathing difficult or impossible, and includes but is not limited to any pressure to the neck, throat, or windpipe that may prevent or hinder breathing or reduce intake of air. Choke hold also means applying pressure to a person's neck on either side of the windpipe, but not to the windpipe itself, to stop the flow of blood to the brain via the carotid arteries;\n(2) \"prone restraint\" means the use of manual restraint that places a person in a face-down position; and\n(3) \"deadly force\" has the meaning given in section 609.066, subdivision 1.\n(d) Use of deadly force is justified only if an objectively reasonable correctional officer would believe, based on the totality of the circumstances known to the officer at the time and without the benefit of hindsight, that deadly force is necessary:\n(1) to protect the correctional officer or another from death or great bodily harm, provided that the threat:\n(i) can be articulated with specificity;\n(ii) is reasonably likely to occur absent action by the correctional officer; and\n(iii) must be addressed through the use of deadly force without unreasonable delay; or\n(2) to effect the capture or prevent the escape of a person when the officer reasonably believes that the person will cause death or great bodily harm to another person under the threat criteria in clause (1), unless immediately apprehended.\n(a) Regardless of tenure or rank, staff working in an adult correctional facility either under the control of the commissioner of corrections or licensed by the commissioner under section 241.021 who observe another employee engage in neglect or use force that exceeds the degree of force permitted by law must report the incident in writing as soon as practicable, but no later than 24 hours to the administrator of the correctional facility that employs the reporting staff member.\n(b) A staff member who fails to report neglect or excessive use of force within 24 hours is subject to disciplinary action or sanction by the correctional facility that employs them. Staff members shall suffer no reprisal for reporting another staff member engaged in excessive use of force or neglect.\n(c) For the purposes of this subdivision, \"neglect\" means:\n(1) the knowing failure or omission to supply a person confined or incarcerated in the facility with care or services, including but not limited to food, clothing, health care, or supervision that is reasonable and necessary to obtain or maintain the person's physical or mental health or safety; or\n(2) the absence or likelihood of absence of care or services, including but not limited to food, clothing, health care, or supervision necessary to maintain the physical and mental health of the person that a reasonable person would deem essential for health, safety, or comfort.",
	"repealed": false
}