{
	"id": "148E.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.48",
	"title": "148E.48 ADVERSE ACTIONS.",
	"text": "(a) In addition to the other powers conferred by state law, a remote state shall have the authority, in accordance with existing state due process law, to:\n(1) take adverse action against a regulated social worker's multistate authorization to practice only within that member state, and issue subpoenas for both hearings and investigations that require the attendance and testimony of witnesses as well as the production of evidence. Subpoenas issued by a licensing authority in a member state for the attendance and testimony of witnesses or the production of evidence from another member state shall be enforced in the latter state by any court of competent jurisdiction, according to the practice and procedure of that court applicable to subpoenas issued in proceedings pending before it. The issuing licensing authority shall pay any witness fees, travel expenses, mileage, and other fees required by the service statutes of the state in which the witnesses or evidence are located; and\n(2) only the home state shall have the power to take adverse action against a regulated social worker's multistate license.\n(b) For purposes of taking adverse action, the home state shall give the same priority and effect to reported conduct received from a member state as it would if the conduct had occurred within the home state. In so doing, the home state shall apply its own state laws to determine appropriate action.\n(c) The home state shall complete any pending investigations of a regulated social worker who changes their home state during the course of the investigations. The home state shall also have the authority to take appropriate action and shall promptly report the conclusions of the investigations to the administrator of the data system. The administrator of the data system shall promptly notify the new home state of any adverse actions.\n(d) A member state, if otherwise permitted by state law, may recover from the affected regulated social worker the costs of investigations and dispositions of cases resulting from any adverse action taken against that regulated social worker.\n(e) A member state may take adverse action based on the factual findings of another member state, provided that the member state follows its own procedures for taking the adverse action.\n(f) Joint investigations:\n(1) In addition to the authority granted to a member state by its respective social work practice act or other applicable state law, any member state may participate with other member states in joint investigations of licensees.\n(2) Member states shall share any investigative, litigation, or compliance materials in furtherance of any joint or individual investigation initiated under the Compact.\n(g) If adverse action is taken by the home state against the multistate license of a regulated social worker, the regulated social worker's multistate authorization to practice in all other member states shall be deactivated until all encumbrances have been removed from the multistate license. All home state disciplinary orders that impose adverse action against the license of a regulated social worker shall include a statement that the regulated social worker's multistate authorization to practice is deactivated in all member states until all conditions of the decision, order, or agreement are satisfied.\n(h) If a member state takes adverse action, it shall promptly notify the administrator of the data system. The administrator of the data system shall promptly notify the home state and all other member states of any adverse actions by remote states.\n(i) Nothing in this compact shall override a member state's decision that participation in an alternative program may be used in lieu of adverse action.\n(j) Nothing in this Compact shall authorize a member state to demand the issuance of subpoenas for attendance and testimony of witnesses or the production of evidence from another member state for lawful actions within that member state.\n(k) Nothing in this Compact shall authorize a member state to impose discipline against a regulated social worker who holds a multistate authorization to practice for lawful actions within another member state.",
	"repealed": false
}