{
	"id": "144.4196",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4196",
	"title": "144.4196 EMPLOYEE PROTECTION.",
	"text": "For purposes of this section:\n(1) \"qualifying employee\" means a person who performs services for hire in Minnesota and who has been subject to isolation or quarantine, or has responsibility for the care of a person under subdivision 2 who is subject to isolation or quarantine, for a communicable disease as defined in section 144.419, subdivision 1, clause (2). The term applies to persons who comply with isolation or quarantine restrictions because of:\n(i) a commissioner's directive;\n(ii) an order of a federal quarantine officer;\n(iii) a state or federal court order; or\n(iv) a written recommendation of the commissioner or designee that the person enter isolation or quarantine; and\n(2) \"employer\" means any person having one or more employees in Minnesota and includes the state and any political subdivision of the state.\n(a) An employer shall not discharge, discipline, threaten, or penalize a qualifying employee, or otherwise discriminate in the work terms, conditions, location, or privileges of the employee, because the employee:\n(1) has been in isolation or quarantine; or\n(2)(i) is not in isolation or quarantine, but has responsibility for the care of a person in isolation or quarantine who is a minor or an adult family member who is a disabled or vulnerable adult; and\n(ii) has assumed responsibility for all or a portion of the care voluntarily, by contract, or by agreement.\n(b) A qualifying employee claiming a violation of paragraph (a) may bring a civil action for recovery of lost wages or benefits, for reinstatement, or for other relief within 180 days of the claimed violation or 180 days of the end of the isolation or quarantine, whichever is later. A qualifying employee who prevails shall be allowed reasonable attorney fees fixed by the court.\n(c) Nothing in this subdivision is intended to alter sick leave or sick pay terms of the employment relationship.\nThe protections of subdivision 2 do not apply to work absences due to isolation or quarantine for periods longer than 21 consecutive workdays. However, absences due to isolation or quarantine for periods longer than 21 consecutive workdays resulting in loss of employment shall be treated for purposes of unemployment compensation in the same manner as loss of employment due to a serious illness.",
	"repealed": false
}