{
	"id": "363A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.07",
	"title": "363A.07 LOCAL COMMISSIONS.",
	"text": "If a county or group of counties creates a local commission, the commission does not have jurisdiction over any part of the county that is within the jurisdiction of a local commission created by city charter or municipal ordinance.\nThe commissioner, whether or not a charge has been filed under this chapter, may refer a matter involving discrimination because of race, color, religion, sex, gender identity, creed, disability, marital status, status with regard to public assistance, national origin, age, sexual orientation, or familial status to a local commission for study and report.\nUpon referral by the commissioner, the local commission shall make a report and make recommendations to the commissioner and take other appropriate action within the scope of its powers.\nA local commission may refer a matter under its jurisdiction to the commissioner.\nThe charging party has the option of filing a charge either with a local commission or the department. Notwithstanding the provisions of any ordinance or resolution to the contrary, a charge may be filed with a local commission within one year after the occurrence of the practice. The exercise of such choice in filing a charge with one agency shall preclude the option of filing the same charge with the other agency. At the time a charge comes to the attention of a local agency, the agency or its representative shall inform the charging party of this option, and of the party's rights under Laws 1967, chapter 897.\nWhere this chapter provides additional protections and remedies not provided for under a local antidiscrimination ordinance, the local commission shall advise a party bringing a charge under a local ordinance of those additional protections and remedies and of the option to file a charge under this chapter.\nThe term \"local commission\" as used in this subdivision has the same meaning given the term in section 363A.03, subdivision 23.\nNotwithstanding the provisions of any law or ordinance to the contrary, a person who has filed a charge with a local commission may bring a civil action as provided in section 363A.34 at the following times:\n(1) within 90 days after receipt of notice that the local commission has determined that there is no probable cause to credit the allegations contained in the charge; receipt of notice is presumed to be five days from the date of service by mail of the written notice; or\n(2) after 45 days from the filing of the charge if a hearing has not been held or if the local commission has not entered into a conciliation agreement to which the charging party is a signator. The charging party shall notify the local commission of an intention to bring a civil action, which shall be commenced within 90 days of giving the notice.\nA charging party bringing a civil action shall mail by registered or certified mail a copy of the summons and complaint to the local commission and upon their receipt the local commission shall terminate all proceedings before the local commission relating to the charge. No charge shall be filed or reinstituted with the local commission after a civil action relating to the same unfair discriminatory practice has been brought unless the civil action has been dismissed without prejudice.",
	"repealed": false
}