{
	"id": "462A.395",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.395",
	"title": "462A.395 GREATER MINNESOTA HOUSING INFRASTRUCTURE GRANT PROGRAM.",
	"text": "The commissioner of the Minnesota Housing Finance Agency may make grants to counties and cities to provide up to 50 percent of the capital costs of public infrastructure necessary for an eligible workforce housing development project. The commissioner may make a grant award only after determining that nonstate resources are committed to complete the project. The nonstate contribution may be cash, other committed grant funds, or in kind. In-kind contributions may include the value of the site, whether the site is prepared before or after the law appropriating money for the grant is enacted.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"City\" means a statutory or home rule charter city located outside the metropolitan area, as defined in section 473.121, subdivision 2.\n(c) \"Housing infrastructure\" means publicly owned physical infrastructure necessary to support housing development projects, including but not limited to sewers, water supply systems, utility extensions, streets, wastewater treatment systems, stormwater management systems, and facilities for pretreatment of wastewater to remove phosphorus.\nHousing projects eligible for a grant under this section may be a single-family or multifamily housing development, and either owner-occupied or rental. Housing projects eligible for a grant under this section may also be a manufactured home development qualifying for homestead treatment under section 273.124, subdivision 3a.\n(a) The commissioner must develop forms and procedures for soliciting and reviewing applications for grants under this section. At a minimum, a city or county must include in its application a resolution of the county board or city council certifying that the required nonstate match is available. The commissioner must evaluate complete applications for funding for eligible projects to determine that:\n(1) the project is necessary to increase sites available for housing development that will provide adequate housing stock for the current or future workforce; and\n(2) the increase in workforce housing will result in substantial public and private capital investment in the county or city in which the project would be located.\n(b) The determination of whether to make a grant for a site is within the discretion of the commissioner, subject to this section. The commissioner's decisions and application of the criteria are not subject to judicial review, except for abuse of discretion.\nA county or city may receive no more than $40,000 per lot for single-family, duplex, triplex, or fourplex housing developed, no more than $60,000 per manufactured housing lot, and no more than $180,000 per lot for multifamily housing with more than four units per building. A county or city may receive no more than $500,000 in two years for one or more housing developments. The $500,000 limitation does not apply to use on manufactured housing developments.",
	"repealed": false
}