{
	"id": "331A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/331A.02",
	"title": "331A.02 REQUIREMENTS FOR A QUALIFIED NEWSPAPER.",
	"text": "No newspaper in this state shall be entitled to any compensation or fee for publishing any public notice unless it is a qualified newspaper. A newspaper that is not qualified must inform a public body that presents a public notice for publication that it is not qualified. To be qualified, a newspaper shall:\n(a) be printed in the English language in newspaper format and in column and sheet form equivalent in printed space to at least 800 square inches;\n(b) if a daily, be published and distributed at least five days each week. If not a daily, the newspaper may be published and distributed at least twice a month with respect to the publishing of government public notices. In any week in which a legal holiday is included, not more than four issues of a daily paper are necessary;\n(c) in at least half of its issues each year, have no more than 75 percent of its printed space comprised of advertising material and paid public notices. In all of its issues each year, have 25 percent, if published more often than weekly, or 50 percent, if weekly, of its news columns devoted to news of local interest. Not more than 25 percent of its total nonadvertising column inches in any issue may wholly duplicate any other publication unless the duplicated material is from recognized general news services;\n(d) be of general circulation in the area to which a public notice is directed, or where there is a reasonable likelihood that the person to whom it is directed will become aware of the notice;\n(e) have its known office of issue located in either:\n(1) the county in which lies, in whole or in part, the political subdivision that is publishing the public notice; or\n(2) an adjoining county;\n(f) file a copy of each issue promptly with the State Historical Society;\n(g) be made available at single or subscription prices to any person or entity requesting the newspaper and making the applicable payment, or be distributed without charge to local residents;\n(h) have complied with all the foregoing conditions of this subdivision for at least one year immediately preceding the date of the notice publication;\n(i) between September 1 and December 31 of each year publish a sworn United States Post Office periodicals-class statement of ownership and circulation or a statement of ownership and circulation verified by a recognized independent circulation auditing agency covering a period of at least one year ending no earlier than the June 30 preceding the publication deadline. When publication occurs after December 31 and before July 1, qualification shall be effective from January 1 through December 31 of that year; and\n(j) after publication of the statement described in paragraph (i), submit to the secretary of state by December 31 a filing containing the newspaper's name, address of its known office of issue, telephone number, and a statement that it has complied with all of the requirements of this section. The filing must be accompanied by a fee of $25. The secretary of state shall make available for public inspection a list of newspapers that have filed. Acceptance of a filing does not constitute a guarantee by the state that any other qualification has been met.\nMS 2002 [Repealed, 2004 c 182 s 33]\nThe following circumstances shall not affect the qualification of a newspaper, invalidate an otherwise valid publication, or invalidate a designation as official newspaper.\n(a) Suspension of publication for a period of not more than three consecutive months resulting from the destruction of its known office of issue, equipment, or other facility by the elements, unforeseen accident, or acts of God or by reason of a labor dispute.\n(b) The consolidation of one newspaper with another published in the same county or in an adjoining county, or a change in its name or ownership, or a temporary change in its known office of issue.\n(c) Change of the day of publication, the frequency of publication, or the change of the known office of issue from one place to another within the same county or in an adjoining county. Except as provided in this subdivision, suspension of publication, or a change of known office of issue, or failure to maintain its known office of issue in the county or in an adjoining county, shall deprive a newspaper of its standing as a qualified newspaper until it again becomes qualified pursuant to subdivision 1.\nA person interested in a newspaper's qualification under this section may petition the district court in the county in which the newspaper has its known office of issue for a declaratory judgment to determine whether the newspaper is qualified. Unless filed by the publisher, the petition and summons shall be served on the publisher as in other civil actions. Service in other cases shall be made by publication of the petition and summons once each week for three successive weeks in the newspaper or newspapers the court may order and upon the persons as the court may direct. Publications made in a newspaper after a judgment that it is qualified but before the judgment is vacated or set aside shall be valid. Except as provided in this subdivision, the Uniform Declaratory Judgments Act and the Rules of Civil Procedure shall apply to the action.\nIf, in the normal course of its business, a qualified newspaper maintains a website, then as a condition of accepting and publishing public notices, the newspaper must agree to post all the notices on its website and on the Minnesota Newspaper Association's statewide public notice website, at no additional cost to the advertiser. The newspaper's website must include a link to its online public notices section, the contents of which must be accessible at no cost to the public. Each notice must remain on the website during the notice's full publication period. Failure to post or maintain a public notice on the newspaper's website or to post a public notice on the statewide public notice website does not affect the validity of the public notice.",
	"repealed": false
}