{
	"id": "469.062",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.062",
	"title": "469.062 OTHER BONDS.",
	"text": "A port authority city except the city of Duluth may issue bonds and appropriate bond proceeds to purchase, construct, extend, improve, and maintain docks, warehouses, or other port or terminal facilities owned or to be owned or operated by its port authority. This action may be taken in the same manner as if the facilities were public utility plants, needed public buildings, and public conveniences capable of producing revenue, and were owned or to be owned or operated solely by the city.\nThe city of Duluth may issue not more than $1,000,000 of its general obligation bonds and may appropriate the bond proceeds for any of the purposes in subdivision 1 and to conserve, develop, reclaim, protect, and improve lands under the jurisdiction of its seaway port authority. The bonds shall be issued only after approval of two-thirds of the members of the city council. The bonds shall be issued, sold, and secured under sections 475.60 to 475.73. The bonds are valid without an election.\nA seaway port authority may issue and sell its negotiable revenue bonds for a purpose in section 469.055, subdivision 6, or for a purpose in this chapter related to the development of a seaport. The bonds must be issued, sold, and secured in the same manner as the bonds in subdivision 5 except that a trust indenture may but need not be executed. The bond resolutions and indenture, if any, must list the facilities whose net revenues are to be pledged for the bond and interest payments. The authority may mortgage some or all of its facilities, except a tunnel or bridge for vehicles, including additions and improvements, to a trustee for the bondholders. The mortgaged facilities may include those financed by the bonds, those operated by the authority, or those leased to others. The authority may agree to covenants and restrictions about: (1) issuing more bonds payable from net revenues of the same facilities, (2) changes to the bond resolutions or the indenture, (3) the remedies and priorities of the bondholders in case of default, and (4) anything else about the security of the bonds that the authority decides is needed to best market the bonds.\nWhen two-thirds of the members of the city council of the city of Duluth approve issuance of general obligation bonds of the city, the proceeds of which are to be appropriated to the seaway port authority, the board of St. Louis County commissioners may by five-sevenths vote issue general obligation bonds of the county. The bonds may be issued in an amount not to exceed $4,000,000, and the proceeds appropriated to be used by the seaway port authority for any or all of the purposes specified in section 469.062, subdivision 2, if the county board by resolution determines that the conservation, development, reclamation, protection, and improvement of lands under the jurisdiction of the port authority and the construction of port facilities thereon will promote the public welfare of the county at large and the economic well-being of its people, industries, and commerce, and is an essential governmental function of the county, and can best be performed through the medium of the port authority. The bonds shall be issued, sold, and secured as provided in sections 475.60 to 475.753. The bonds are valid without an election.\nThe authority may issue and sell its negotiable revenue bonds for the purposes of section 469.055, subdivision 9. The bonds must be authorized by port authority resolutions containing the customary provisions about the form of the bonds and their maturity, interest rate, sinking fund, redemption, and refunding. The bonds must be issued under a trust indenture from the port authority to a corporate trustee. The indenture must contain the customary provisions as to: (1) the issuance of bonds; (2) the application of the revenues of the bridge or tunnel to create a sinking fund to pay the bonds and interest on them; (3) the holding of the proceeds of the bonds in a special trust to acquire or construct the bridge or tunnel; and (4) the pledge and assignment by the port authority to the trustee of the bridge or tunnel revenues in excess of the cost of operation and maintenance of it as security for the payment of the principal of and interest on the bonds. The port authority shall collect tolls for transit over the bridge or through the tunnel acquired or constructed under this section sufficient at all times to pay for its operation and maintenance and to pay the principal of and interest on the bonds issued under this subdivision. The bonds and the coupons showing interest on them are an irrevocable contract between the bondholders and the port authority that the tolls shall always be sufficient for those purposes. The bonds must not bear interest at more than eight percent per year. The bonds must not be sold for less than par plus accrued interest to the date of delivery and payment and may be sold at private sale without publishing prior notice of the sale. Bonds issued under this subdivision are not a debt of the port authority's city, are not subject to the city's debt limit, and are not payable from city property taxes. The bonds are payable solely from the toll revenues earned by the bridge or tunnel and pledged to the payment of the bonds.",
	"repealed": false
}