{
	"id": "115A.9651",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.9651",
	"title": "115A.9651 LISTED METALS IN SPECIFIED PRODUCTS; ENFORCEMENT.",
	"text": "After July 1, 1998, no person may distribute a listed product for sale or use in this state.\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Council\" means the council established under subdivision 5.\n(c) \"Essential product\" means a specified product into which the introduction of a listed metal is required under military specifications or to ensure the integrity of a product essential for aviation or railroad safety, and which is being used only in that application.\n(d) \"Intentionally introduce\" means to deliberately use a listed metal as an element during manufacture or distribution of a specified product. Intentional introduction does not include the incidental presence of a listed metal.\n(e) \"Listed metal\" means lead, cadmium, mercury, or hexavalent chromium.\n(f) \"Listed product\" means a specified product that is included on the prohibited products list published under subdivision 4.\n(g) \"New product\" means a specified product which was not used, sold, or distributed in the state before July 2, 1998, or which has been reformulated so that it contains more of a listed metal.\n(h) \"Official\" means an officer of a corporation, a general partner of a partnership or limited partnership, a sole proprietor, or, in the case of any other entity, a person with high-level management responsibilities.\n(i) \"Specified product\" means an ink, dye, pigment, paint, or fungicide into which a listed metal has been intentionally introduced or in which the incidental presence of a listed metal exceeds a concentration of 100 parts per million.\n(a) By July 1, 1998, each person who has filed the progress report specified in Laws 1994, chapter 585, section 30, subdivision 2, paragraph (e), indicating compliance would be achieved by July 1, 1998, shall certify to the commissioner that the products referenced in that report have been reformulated and no longer meet the definition of a specified product. The certification must be in writing and signed by an official of the company. If, due to significant change in circumstances, the person cannot so certify by July 1, 1998, a product review report and fee shall be submitted as provided under subdivision 6.\n(b) The person submitting the certification shall keep a copy on file and make copies available to the commissioner or the attorney general upon request or to any member of the public within 60 days of receipt of a written request that specifies the type of product for which the information is requested.\nBy October 1, 1998, the commissioner shall publish in the State Register a list of specified products for which the commissioner has received certifications as provided under subdivision 3.\n[Repealed, 2007 c 133 art 2 s 13]\n(a) Except as provided under subdivision 7, the manufacturer, or an association of manufacturers, of any specified product distributed for sale or use in this state that is not listed pursuant to subdivision 4 shall submit a product review report and fee as provided in paragraph (c) to the commissioner for each product by July 1, 1998. Each product review report shall contain at least the following:\n(1) a policy statement articulating upper management support for eliminating or reducing intentional introduction of listed metals into its products;\n(2) a description of the product and the amount of each listed metal distributed for use in this state;\n(3) a description of past and ongoing efforts to eliminate or reduce the listed metal in the product;\n(4) an assessment of options available to reduce or eliminate the intentional introduction of the listed metal including any alternatives to the specified product that do not contain the listed metal, perform the same technical function, are commercially available, and are economically practicable;\n(5) a statement of objectives in numerical terms and a schedule for achieving the elimination of the listed metals and an environmental assessment of alternative products;\n(6) a listing of options considered not to be technically or economically practicable; and\n(7) certification attesting to the accuracy of the information in the report signed and dated by an official of the manufacturer or user.\nIf the manufacturer fails to submit a product review report, a user of a specified product may submit a report and fee which comply with this subdivision by August 15, 1998.\n(b) By July 1, 1999, and annually thereafter until the commissioner takes action under subdivision 9, the manufacturer or user must submit a progress report and fee as provided in paragraph (c) updating the information presented under paragraph (a).\n(c) The fee shall be $295 for each report. The fee shall be deposited in the state treasury and credited to the environmental fund. The fee is exempt from section 16A.1285.\n(d) Where it cannot be determined from a progress report submitted by a person pursuant to Laws 1994, chapter 585, section 30, subdivision 2, paragraph (e), the number of products for which product review reports are due under this subdivision, the commissioner shall have the authority to determine, after consultation with that person, the number of products for which product review reports are required.\n(e) The commissioner shall summarize, aggregate, and publish data reported under paragraphs (a) and (b) annually.\n(f) A product that is the subject of a recommendation by the Toxics in Packaging Clearinghouse, as administered by the Council of State Governments, is exempt from this section.\n(a) By January 1, 1998, a manufacturer or user of an essential product must submit a certification to the commissioner that the product meets the definition in subdivision 2, paragraph (c). By July 1, 2002, each manufacturer or user of an essential product shall submit a report to the commissioner which includes the information required in subdivision 6, paragraph (a), and a statement of whether the product continues to meet the definition in subdivision 2, paragraph (c).\n(b) By October 1, 1998, the commissioner shall publish in the State Register a list of essential products for which the commissioner has received certification pursuant to this subdivision. By October 1, 2002, the commissioner shall publish in the State Register a list of essential products based on reports submitted by July 1, 2002, as provided in paragraph (a).\n(a) After July 1, 1998, but before July 1, 2005, no person shall sell, distribute, or offer for sale in this state a new product prior to the manufacturer or user submitting a product review report and fee specified in subdivision 6.\n(b) The council shall review reports submitted under this subdivision and provide advice to the commissioner. The council's advice to the commissioner under this subdivision shall be based on an evaluation of the environmental impact of the product and the ability of the manufacturer or user to reduce or eliminate the listed metal. Before making a recommendation that the commissioner take action under subdivision 9, the council must conclude that:\n(1) there is an alternative to the specified product that does not contain the listed metal that performs the same technical function, is commercially available, and is economically practicable, and replacement of the product with the alternative will result in an environmental benefit in the state; or\n(2) if there is no alternative to the new product, that the use of the listed metal in the new product presents a significant threat to the safe and efficient operation of waste facilities, or use of the listed metal does not increase the useful life span of the new product, reduce the overall toxicity of the final product or of material used in production of the final product, or otherwise provide a net environmental benefit to the state.\n(c) Notwithstanding subdivision 5, paragraph (f), where the commissioner determines that a new product subject to paragraph (a) is sufficiently similar to a product or products previously reviewed by the council, the commissioner may authorize the permanent members of the council to perform the duties established in paragraph (b) without the appointment of temporary members. In performing those duties, the council shall utilize information gathered in any previous review of a similar product or products.\n(d) Beginning July 1, 2005, no person shall sell, distribute, or offer for sale in this state a new product without the commissioner's approval. A person seeking approval of a new product shall submit a product review report including the information and fee specified in subdivision 6. The commissioner shall not approve the new product unless the commissioner determines that it meets the criteria in paragraph (b). The commissioner shall make a determination within six months of receipt of a complete request.\n(a) The commissioner may, upon the recommendation of the council, prohibit the distribution for sale or use in this state of a specified product that is not an essential product.\n(b) Before taking action under this subdivision, the commissioner must conclude that:\n(1) there is an alternative to the specified product that does not contain the listed metal that performs the same technical function, is commercially available, and is economically practicable, and replacement of the product with the alternative will result in an environmental benefit to the state; or\n(2) if there is no alternative to the new product, that the use of the listed metal in the new product presents a significant threat to the safe and efficient operation of waste facilities, or use of the listed metal does not increase the useful life span of the new product, reduce the overall toxicity of the final product or of material used in production of the final product, or otherwise provide a net environmental benefit to the state.\n(c) If the commissioner fails to take action under this subdivision as recommended by the council, the commissioner shall submit a report to the legislature explaining the reasons for not taking such action.\n(d) The commissioner shall provide the legislature a report and recommendations based on any report prepared by the council under subdivision 5, paragraph (c), clause (2).\n(a) This section does not apply to art supplies.\n(b) This section may be enforced under sections 115.071 and 116.072. The attorney general or the commissioner of the agency shall coordinate enforcement of this section.\n(a) The Pollution Control Agency may adopt, amend, suspend, and repeal rules to implement this section.\n(b) Publication of notice under subdivision 5, paragraph (g), shall be deemed to satisfy the requirements of section 14.101.\n(c) The commissioner may adopt a council recommendation under subdivision 5 as the agency's statement of need and reasonableness. A recommendation adopted in this manner shall be deemed to satisfy any content requirements for a statement of need and reasonableness imposed by law.\n(d) Any hearings on rules adopted under this section shall be conducted in accordance with sections 14.14 to 14.20 and address whether the rule meets the standards for review under which the judge is required to approve or disapprove the rule.\n(e) Section 14.125 does not apply to the agency's rulemaking authority under this section.\n(f) A rule adopted under this section is effective until repealed by the agency.",
	"repealed": false
}