{
	"id": "412.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.191",
	"title": "412.191 MEMBERS; POWERS, DUTIES.",
	"text": "The city council in a standard plan city shall consist of the mayor, the clerk, and the three or five council members. In optional plan cities, except those cities having a larger council under Minnesota Statutes 1994, section 412.023, subdivision 4, the council shall consist of the mayor and the four council members. A majority of all the members shall constitute a quorum although a smaller number may adjourn from time to time.\nRegular meetings of the council shall be held at such times and places as may be prescribed by its rules. Special meetings may be called by the mayor or by any two members of a five-member council or three members of a seven-member council by writing filed with the clerk who shall then mail a notice to all the members of the time and place of meeting at least one day before the meeting. The mayor or, in the mayor's absence, the acting mayor, shall preside. All meetings of the council shall be open to the public. The council may preserve order at its meetings, compel the attendance of members, and punish nonattendance and shall be the judge of the election and qualification of its members. The council shall have power to regulate its own procedure.\nThe council, after every regular or special meeting, shall publish the official council proceedings or a summary conforming to section 331A.01, subdivision 10. As an alternative to publication, the city may mail, at city expense, a copy of the proceedings to any resident upon request. The publication shall occur within 30 days of the meeting to which the proceedings relate. Cities with a population of less than 1,000 according to the latest federal census are not required to comply with this section, but may do so at their discretion.\nEvery ordinance shall be enacted by a majority vote of all the members of the council except where a larger number is required by law. It shall be signed by the mayor, attested by the clerk and published once in the official newspaper. In the case of lengthy ordinances, or ordinances which include charts or maps, if the city council determines that publication of the title and a summary of an ordinance would clearly inform the public of the intent and effect of the ordinance, the council may by a four-fifths vote of its members direct that only the title of the ordinance and a summary be published, conforming to section 331A.01, subdivision 10, with notice that a printed copy of the ordinance is available for inspection by any person during regular office hours at the office of the city clerk and any other location which the council designates. A copy of the entire text of the ordinance shall be posted in the community library, if there is one, or if not, in any other public location which the council designates. Prior to the publication of the title and summary the council shall approve the text of the summary and determine that it clearly informs the public of the intent and effect of the ordinance. The publishing of the title and summary shall be deemed to fulfill all legal publication requirements as completely as if the entire ordinance had been published. The text of the summary shall be published in a body type no smaller than brevier or eight-point type. Proof of the publication shall be attached to and filed with the ordinance.\nEvery ordinance shall be recorded in the ordinance book within 20 days after publication of the ordinance or its title and summary. All ordinances shall be suitably entitled and shall be substantially in the style. \"The City Council of ............... ordains:\".\nMS 1974 [Repealed, 1976 c 44 s 70]",
	"repealed": false
}