{
	"id": "216C.378",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.378",
	"title": "216C.378 DISTRIBUTED ENERGY RESOURCES SYSTEM UPGRADE PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Capacity constrained location\" means a location on an electric utility's distribution system that the utility has reasonably determined requires significant distribution or network upgrades before additional distributed energy resources can interconnect.\n(c) \"DER Technical Planning Standard\" means an engineering practice that limits the total aggregate distributed energy resource capacity that may interconnect to a particular location on the utility's distribution system.\n(d) \"Distributed energy resources\" means distributed generation, as defined in section 216B.164, and energy storage systems, as defined in section 216B.2422.\n(e) \"Distribution upgrades\" means the additions, modifications, and upgrades made to an electric utility's distribution system to facilitate interconnection of distributed energy resources.\n(f) \"Interconnection\" means the process governed by the Minnesota Distributed Energy Resources Interconnection Process and Agreement, as approved in the Minnesota Public Utilities Commission's order issued April 19, 2019, or the Minnesota Distributed Energy Resources Interconnection Process most recently approved by the commission.\n(g) \"Net metered facility\" has the meaning given in section 216B.164.\n(h) \"Network upgrades\" means additions, modifications, and upgrades to the transmission system required at or beyond the point at which the distributed energy resource interconnects with an electric utility's distribution system to accommodate the interconnection of the distributed energy resource with the electric utility's distribution system. Network upgrades do not include distribution upgrades.\nA distributed energy resources system upgrade program is established in the department. The purpose of the program is to provide funding to the utility subject to section 116C.779 to complete infrastructure investments necessary to enable electricity customers to interconnect distributed energy resources. The program must be designed to achieve the following goals to the maximum extent feasible:\n(1) make upgrades at capacity constrained locations on the utility's distribution system that maximize the number and capacity of distributed energy resources projects with a capacity of up to 40 kilowatts alternating current that can be interconnected sufficient to serve projected demand;\n(2) enable all distributed energy resources projects with a nameplate capacity of up to 40 kilowatts alternating current to be reviewed and approved by the utility within 43 business days;\n(3) minimize interconnection barriers for electricity customers seeking to construct net metered facilities for on-site electricity use; and\n(4) advance innovative solutions that can minimize the cost of distribution and network upgrades required for interconnection, including but not limited to energy storage, control technologies, smart inverters, distributed energy resources management systems, and other innovative technologies and programs.\n(a) By November 1, 2023, the utility subject to section 116C.779 must file with the commissioner a plan for the distributed energy resources system upgrade program. The plan must contain, at a minimum:\n(1) a description of how the utility proposes to use money in the distributed energy resources system upgrade program account to upgrade the utility's distribution system to maximize the number and capacity of distributed energy resources that can be interconnected sufficient to serve projected demand;\n(2) the locations where the utility proposes to make investments under the program;\n(3) the number and capacity of distributed energy resources projects the utility expects to interconnect as a result of the program;\n(4) a plan for reporting on the program's outcomes; and\n(5) any additional information required by the commissioner.\n(b) The utility subject to section 116C.779 is prohibited from implementing the program until the commissioner approves the plan submitted under this subdivision. No later than March 31, 2024, the commissioner must approve a plan under this subdivision that the commissioner determines is in the public interest. Any proposed modifications to the plan approved under this subdivision must be approved by the commissioner.\nWhen developing the plan required under subdivision 3, the utility must prioritize making investments:\n(1) at capacity constrained locations on the distribution grid;\n(2) in communities with demonstrated customer interest in distributed energy resources, as measured by anticipated, pending, and completed interconnection applications; and\n(3) in communities with a climate action plan, clean energy goal, or policies that:\n(i) seek to mitigate the impacts of climate change on the city; or\n(ii) reduce the city's contributions to the causes of climate change.\nThe commissioner may pay the following reasonable costs of the utility subject to section 116C.779 under a plan approved in accordance with subdivision 3 from money available in the distributed energy resources system upgrade program account:\n(1) distribution upgrades and network upgrades;\n(2) energy storage; control technologies, including but not limited to a distributed energy resources management system; or other innovative technology used to achieve the purposes of this section; and\n(3) pilot programs operated by the utility to implement innovative technology solutions.\nThe utility subject to section 116C.779 must reserve any increase in the DER Technical Planning Standard made available by upgrades paid for under this section for net metered facilities and distributed energy resources with a nameplate capacity of up to 40 kilowatts alternating current. The commissioner may modify the requirements of this subdivision when the commissioner finds doing so is in the public interest.\n(a) A distributed energy resources system upgrade program account is established in the special revenue fund. The account consists of money provided by law, and any other money donated, allotted, transferred, or otherwise provided to the account. Earnings, including interest, dividends, and any other earnings arising from the assets of the account, must be credited to the account. Earnings remaining in the account at the end of a fiscal year do not cancel to the general fund or renewable development account but remain in the account until expended.\n(b) Money from the account is appropriated to the commissioner to review plans, award grants, and pay the reasonable costs of the department to administer this section.\nThe utility subject to section 116C.779 must report to the commissioner within 60 days if any distributed energy resources project with a capacity of up to 40 kilowatts alternating current is unable to interconnect due to safety, reliability, or the cost of distribution or network upgrades required at a location for which upgrade funding was provided under this program. The utility must make available to the commissioner all engineering analyses, studies, and information related to any such instances. The commissioner may modify or waive this requirement after December 31, 2025.",
	"repealed": false
}