{
	"id": "525.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/525.152",
	"title": "525.152 AWARD OF PROPERTY WITH SENTIMENTAL VALUE TO CHILDREN.",
	"text": "(a) \"Eligible child\" means a child of the decedent who:\n(1) is not the child of the surviving spouse, if any;\n(2) if there is no surviving spouse, is not a minor, and has a different parent than minor children of the decedent; and\n(3) if the decedent dies testate, is a devisee under the decedent's will.\n(b) \"Sentimental value\" means significant emotional or nostalgic value arising out of the relationship of an individual with the decedent or arising out of the relationship of the eligible child with the individual who is the nondecedent parent of the eligible child.\nThe following property is not eligible for an award under this section:\n(1) real property;\n(2) personal property that is the subject of a specific devise under the decedent's will where the will was executed before August 1, 1989, and where the devise specifically identifies the particular item of property, unless the property is selected under section 524.2-403;\n(3) personal property that is the subject of a specific devise under a separate writing under section 524.2-513, unless the property is selected under section 524.2-403; and\n(4) personal property disposed of by a premarital agreement.\nAt the time of an allowance selection under section 524.2-403, the person making the selection shall serve personally or by mail a written itemized notice of the property selected to every eligible child of the decedent. This requirement does not apply if an award of property with sentimental value already has been made under this section. Within 30 days of receipt of the notice of selection, an eligible child may petition the court to award property with sentimental value contained in the notice, or other property with sentimental value that belonged to the decedent, to the eligible child.\nThe court shall award property with sentimental value to an eligible child if it finds that the property's sentimental value to the child outweighs its sentimental value to the person entitled to the allowance selection. If more than one eligible child petitions the court for an award of the same property, the court shall award the property to the child for whom the property has the greatest sentimental value. In awarding property with sentimental value to an eligible child, the court shall give weight to the following factors:\n(1) the relationship of the eligible child to the acquisition and use of the property;\n(2) whether the property was acquired prior to the decedent's marriage to the surviving spouse or prior to the birth of minor children who are entitled to an allowance selection; and\n(3) whether the property belonged to the individual who is the nondecedent parent of the eligible child.\n(a) As a condition of an award of sentimental property under this section, the court shall order that the eligible child pay the value of the property to the estate or that the value of the property be deducted from the eligible child's share of the estate. The surviving spouse or minor children may make an additional allowance selection in place of property with sentimental value awarded to an eligible child.\n(b) If the court awards property under subdivision 4, the court shall appoint an appraiser who shall determine the value of the property. The value of the property is its appraised value as of the date of the decedent's death without reference to its sentimental value to the eligible child or any other person.",
	"repealed": false
}