{
	"id": "46.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/46.131",
	"title": "46.131 ASSESSMENTS AND FEES FOR FINANCIAL INSTITUTIONS.",
	"text": "Examination fees of the Department of Commerce shall be assessed against financial institutions and residential PACE administrators, as defined in section 216C.435, subdivision 10a, in accordance with the provisions of this section.\nEach financial institution governed by chapters 46 to 59A, 216C, and 332 to 332B that is organized under the laws of this state or required to be administered by the commissioner of commerce shall pay into the state treasury its proportionate share of the cost of maintaining the Department of Commerce. This subdivision does not apply to student loan servicers or collection agencies.\nA proportionate share of all annual office expenses of the commissioner of commerce and the portion of the general support costs of the Department of Commerce and of the cost of services provided by the attorney general that is attributable to the commissioner of commerce, as well as all actual expenses of the examiners in the field, excepting salaries, shall be allocated to each industry affected, and referred to in subdivision 4, as assessments and on the basis of the total time devoted to each.\n(a) Assessments shall be made by the commissioner against each institution within the industry on an equitable basis, according to the total assets or business volume of each institution as of the end of the previous calendar year.\n(b) Assessments against residential PACE administrators, as defined in section 216C.435, subdivision 10a, must be made by the commissioner according to the total business volume as of the end of the previous calendar year.\n[Repealed, 2017 c 94 art 8 s 16]\n[Repealed, 1981 c 220 s 18]\nSuch assessments shall be levied on July 1, 1965, and prior to the beginning of each fiscal period beginning July 1 and ending June 30 thereafter, and shall be based on the total estimated expense as herein referred to during such period. Assessment revenue will be remitted to the commissioner for deposit in the financial institutions account on or before July 1 of each year.\nIn addition to such assessments, each institution referred to in subdivision 2, with the exception of credit unions under $25,000, shall pay an examination fee upon the request of the commissioner and to be based on the salary cost of examiners or assistants, and at such an average rate per day or fraction thereof so as to provide for the total cost of such examinations.\nThese assessments or fees shall be paid by the institution examined within 20 days after a statement of the amount has been submitted to the institution examined by the commissioner of commerce and, if not so paid, shall bear interest at the rate of interest provided for by section 549.09. The penalty shall be payable to the commissioner on request.\nEach financial institution described in subdivision 2 shall pay a fee of $50 to the commissioner of commerce upon application to the commissioner for approval of a change in its certificate, charter, articles of incorporation, bylaws, powers or license. Money collected by the commissioner under this subdivision shall be deposited in the financial institutions account in subdivision 11.\n(a) The financial institutions account is created as a separate account in the special revenue fund. Earnings, including interest, dividends, and any other earnings arising from account assets, must be credited to the account.\n(b) The account consists of funds received from assessments under subdivision 7, examination fees under subdivision 8, and funds received pursuant to subdivision 10 and the following provisions: sections 46.04; 46.041; 46.048, subdivision 1; 47.101; 47.54, subdivision 1; 47.60, subdivision 3; 47.62, subdivision 4; 48.61, subdivision 7, paragraph (b); 49.36, subdivision 1; 52.203; 53B.38; 53B.41; 53B.43; 53C.02; 56.02; 58.10; 58A.045, subdivision 2; 59A.03; 216C.437, subdivision 12; 332A.04; and 332B.04.\n(c) Funds in the account are annually appropriated to the commissioner of commerce for activities under this section.",
	"repealed": false
}