{
	"id": "206.845",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.845",
	"title": "206.845 BALLOT RECORDING AND COUNTING SECURITY.",
	"text": "The county auditor and municipal clerk must secure ballot recording and tabulating systems physically and electronically against unauthorized access. Except for wired connections within the polling place, ballot recording and tabulating systems must not be connected to or operated on, directly or indirectly, any electronic network, including a local area network, a wide-area network, the Internet, or the World Wide Web. Wireless communications may not be used in any way in a vote recording or vote tabulating system. Wireless, device-to-device capability is not permitted. No connection by modem is permitted.\nTransfer of information from the ballot recording or tabulating system to another system for network distribution or broadcast must be made by disk, tape, or other physical means of communication, other than direct or indirect electronic connection of the vote recording or vote tabulating system. A county auditor or municipal clerk may not create or disclose, or permit any other person to create or disclose, an electronic image of the hard drive of any vote recording or tabulating system or any other component of an electronic voting system, except as authorized in writing by the secretary of state or for the purpose of conducting official duties as expressly authorized by law.\nAfter the close of the polls, the head election judge must create a printed record of the results of the election for that precinct. After the record has been printed, the head election judge in a precinct that employs automatic tabulating equipment may transmit the accumulated tally for each device to a central reporting location using a telephone, modem, Internet, or other electronic connection. During the canvassing period, the results transmitted electronically must be considered unofficial until the canvassing board has performed a complete reconciliation of the results.\nAfter the municipal clerk or county auditor has received data from automatic tabulating equipment, textual data from the file is public, with the following exceptions, which are protected nonpublic data under section 13.02:\n(1) data that indicate the date, time, or order in which a voter cast a ballot;\n(2) data that indicate the method with which a voter cast a ballot;\n(3) data files that do not include all ballots cast in a precinct;\n(4) data files that provide data in the order it was generated; and\n(5) data from precincts in which fewer than ten votes were cast.\nData stored as images are protected nonpublic data under section 13.02.",
	"repealed": false
}