{
	"id": "53A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/53A.03",
	"title": "53A.03 APPLICATION FOR LICENSE; FEES.",
	"text": "(a) An application for a license must be in writing, under oath, and in the form prescribed and furnished by the commissioner and must contain the following:\n(1) the full name and address (both of residence and place of business) of the applicant, and if the applicant is a partnership or association, of every member, and the name and business address if the applicant is a corporation;\n(2) the county and municipality, with street and number, if any, of all currency exchange locations operated by the applicant; and\n(3) the applicant's occupation or profession, for the ten years immediately preceding the application; present or previous connection with any other currency exchange in this or any other state; whether the applicant has ever been convicted of any crime; and the nature of the applicant's occupancy of the premises to be licensed; and if the applicant is a partnership or a corporation, the information specified in this paragraph must be supplied for each partner and each officer and director of the corporation. If the applicant is a partnership or a nonpublicly held corporation, the information specified in this paragraph must be required of each partner and each officer, director, and stockholders owning in excess of ten percent of the corporate stock of the corporation.\n(b) The application shall be accompanied by a nonrefundable fee of $1,000 for the review of the initial application. Upon approval by the commissioner, an additional license fee of $500 must be paid by the applicant as an annual license fee for the remainder of the calendar year. An annual license fee of $500 is due for each subsequent calendar year of operation upon submission of a license renewal application on or before September 1. Fees must be deposited in the state treasury and credited to the general fund. Upon payment of the required annual license fee, the commissioner shall issue a license for the year beginning January 1.\n(c) The commissioner shall require the applicant to submit to a background investigation conducted by the Bureau of Criminal Apprehension as a condition of licensure. As part of the background investigation, the Bureau of Criminal Apprehension shall conduct criminal history checks of Minnesota records and is authorized to exchange fingerprints with the Federal Bureau of Investigation for the purpose of a criminal background check of the national files. The cost of the investigation must be paid by the applicant.\n(d) Section 58A.04, subdivisions 2 and 3, apply to this section.\n(e) For purposes of this section, \"applicant\" includes an employee who exercises management or policy control over the company, a director, an officer, a limited or general partner, a manager, or a shareholder holding more than ten percent of the outstanding stock of the corporation.",
	"repealed": false
}