{
	"id": "244.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.10",
	"title": "244.10 SENTENCING HEARING; DEVIATION FROM GUIDELINES.",
	"text": "Whenever a person is convicted of a felony, the court, upon motion of either the defendant or the state, shall hold a sentencing hearing. The hearing shall be scheduled so that the parties have adequate time to prepare and present arguments regarding the issue of sentencing. The parties may submit written arguments to the court prior to the date of the hearing and may make oral arguments before the court at the sentencing hearing. Prior to the hearing, the court shall transmit to the defendant or the defendant's attorney and the prosecuting attorney copies of the presentence investigation report.\nAt the conclusion of the sentencing hearing or within 20 days thereafter, the court shall issue written findings of fact and conclusions of law regarding the issues submitted by the parties, and shall enter an appropriate order.\nWhether or not a sentencing hearing is requested pursuant to subdivision 1, the district court shall make written findings of fact as to the reasons for departure from the Sentencing Guidelines in each case in which the court imposes or stays a sentence that deviates from the Sentencing Guidelines applicable to the case.\n[Repealed, 2005 c 136 art 16 s 16; Renumbered subd 8]\n[Repealed, 2005 c 136 art 16 s 16; Renumbered subd 9]\nIn bringing a motion for an aggravated sentence, the state is not limited to factors specified in the Sentencing Guidelines provided the state provides reasonable notice to the defendant and the district court prior to sentencing of the factors on which the state intends to rely.\n(a) When the prosecutor provides reasonable notice under subdivision 4, the district court shall allow the state to prove beyond a reasonable doubt to a jury of 12 members the factors in support of the state's request for an aggravated departure from the Sentencing Guidelines or the state's request for an aggravated sentence under any sentencing enhancement statute or the state's request for a mandatory minimum under section 609.11 as provided in paragraph (b) or (c).\n(b) The district court shall allow a unitary trial and final argument to a jury regarding both evidence in support of the elements of the offense and evidence in support of aggravating factors when the evidence in support of the aggravating factors:\n(1) would be admissible as part of the trial on the elements of the offense; or\n(2) would not result in unfair prejudice to the defendant.\nThe existence of each aggravating factor shall be determined by use of a special verdict form.\nUpon the request of the prosecutor, the court shall allow bifurcated argument and jury deliberations.\n(c) The district court shall bifurcate the proceedings, or impanel a resentencing jury, to allow for the production of evidence, argument, and deliberations on the existence of factors in support of an aggravated departure after the return of a guilty verdict when the evidence in support of an aggravated departure:\n(1) includes evidence that is otherwise inadmissible at a trial on the elements of the offense; and\n(2) would result in unfair prejudice to the defendant.\n(a) As used in this section, \"aggravating factors\" include, but are not limited to, situations where:\n(1) the victim was particularly vulnerable due to age, infirmity, or reduced physical or mental capacity, which was known or should have been known to the offender;\n(2) the victim was treated with particular cruelty for which the offender should be held responsible;\n(3) the current conviction is for a criminal sexual conduct offense or an offense in which the victim was otherwise injured and there is a prior felony conviction for a criminal sexual conduct offense or an offense in which the victim was otherwise injured;\n(4) the offense was a major economic offense, identified as an illegal act or series of illegal acts committed by other than physical means and by concealment or guile to obtain money or property, to avoid payment or loss of money or property, or to obtain business or professional advantage. The presence of two or more of the circumstances listed below are aggravating factors with respect to the offense:\n(i) the offense involved multiple victims or multiple incidents per victim;\n(ii) the offense involved an attempted or actual monetary loss substantially greater than the usual offense or substantially greater than the minimum loss specified in the statutes;\n(iii) the offense involved a high degree of sophistication or planning or occurred over a lengthy period of time;\n(iv) the offender used the offender's position or status to facilitate the commission of the offense, including positions of trust, confidence, or fiduciary relationships; or\n(v) the offender had been involved in other conduct similar to the current offense as evidenced by the findings of civil or administrative law proceedings or the imposition of professional sanctions;\n(5) the offense was a major controlled substance offense, identified as an offense or series of offenses related to trafficking in controlled substances under circumstances more onerous than the usual offense. The presence of two or more of the circumstances listed below are aggravating factors with respect to the offense:\n(i) the offense involved at least three separate transactions in which controlled substances were sold, transferred, or possessed with intent to do so;\n(ii) the offense involved an attempted or actual sale or transfer of controlled substances in quantities substantially larger than for personal use;\n(iii) the offense involved the manufacture of controlled substances for use by other parties;\n(iv) the offender knowingly possessed a firearm during the commission of the offense;\n(v) the circumstances of the offense reveal the offender to have occupied a high position in the drug distribution hierarchy;\n(vi) the offense involved a high degree of sophistication or planning or occurred over a lengthy period of time or involved a broad geographic area of disbursement; or\n(vii) the offender used the offender's position or status to facilitate the commission of the offense, including positions of trust, confidence, or fiduciary relationships;\n(6) the offender committed, for hire, a crime against the person;\n(7) the offender is sentenced according to section 609.3455, subdivision 3a;\n(8) the offender is a dangerous offender who committed a third violent crime, as described in section 609.1095, subdivision 2;\n(9) the offender is a career offender as described in section 609.1095, subdivision 4;\n(10) the offender committed the crime as part of a group of three or more persons who all actively participated in the crime;\n(11) the offender intentionally selected the victim or the property against which the offense was committed, in whole or in part, because of the victim's, the property owner's, or another's actual or perceived race, color, religion, sex, sexual orientation, disability, age, or national origin;\n(12) the offender used another's identity without authorization to commit a crime. This aggravating factor may not be used when the use of another's identity is an element of the offense;\n(13) the offense was committed in the presence of a child; and\n(14) the offense was committed in a location in which the victim had an expectation of privacy.\n(b) Notwithstanding section 609.04 or 609.035, or other law to the contrary, when a court sentences an offender for a felony conviction, the court may order an aggravated sentence beyond the range specified in the sentencing guidelines grid based on any aggravating factor arising from the same course of conduct.\n(c) Nothing in this section limits a court from ordering an aggravated sentence based on an aggravating factor not described in paragraph (a).\nIn either a unitary or bifurcated trial under subdivision 5, a defendant shall be allowed to present evidence and argument to the jury or fact finder regarding whether facts exist that would justify an aggravated departure or an aggravated sentence under any sentencing enhancement statute or a mandatory minimum sentence under section 609.11. A defendant is not allowed to present evidence or argument to the jury or fact finder regarding facts in support of a mitigated departure during the trial, but may present evidence and argument in support of a mitigated departure to the judge as fact finder during a sentencing hearing.\nThe defendant may waive the right to a jury determination of whether facts exist that would justify an aggravated sentence. Upon receipt of a waiver of a jury trial on this issue, the district court shall determine beyond a reasonable doubt whether the factors in support of the state's motion for aggravated departure or an aggravated sentence under any sentencing enhancement statute or a mandatory minimum sentence under section 609.11 exist.\n(a) Subject to paragraph (b), in any case in which a person is convicted of an offense and the presumptive sentence under the Sentencing Guidelines is commitment to the custody of the commissioner of corrections, if the court grants a dispositional departure and stays imposition or execution of sentence, the probation or court services officer who is assigned to supervise the offender shall provide in writing to the following the fact that the offender is on probation and the terms and conditions of probation:\n(1) a victim of and any witnesses to the offense committed by the offender, if the victim or the witness has requested notice; and\n(2) the chief law enforcement officer in the area where the offender resides or intends to reside.\nThe law enforcement officer, in consultation with the offender's probation officer, may provide all or part of this information to any of the following agencies or groups the offender is likely to encounter: public and private educational institutions, day care establishments, and establishments or organizations that primarily serve individuals likely to be victimized by the offender. The law enforcement officer, in consultation with the offender's probation officer, also may disclose the information to individuals the officer believes are likely to be victimized by the offender. The officer's belief shall be based on the offender's pattern of offending or victim preference as documented in the information provided by the Department of Corrections or Direct Care and Treatment.\nThe probation officer is not required under this subdivision to provide any notice while the offender is placed or resides in a residential facility that is licensed under section 241.021 or 245A.02, subdivision 14, if the facility staff is trained in the supervision of sex offenders.\n(b) Paragraph (a) applies only to offenders required to register under section 243.166, as a result of the conviction.\n(c) The notice authorized by paragraph (a) shall be limited to data classified as public under section 13.84, subdivision 6, unless the offender provides informed consent to authorize the release of nonpublic data or unless a court order authorizes the release of nonpublic data.\n(d) Nothing in this subdivision shall be interpreted to impose a duty on any person to use any information regarding an offender about whom notification is made under this subdivision.\nIf the defendant contests the existence of or factual basis for a prior conviction in the calculation of the defendant's criminal history score, proof of it is established by competent and reliable evidence, including a certified court record of the conviction.",
	"repealed": false
}