{
	"id": "243.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.24",
	"title": "243.24 MONEY, HOW USED; FORFEITURE.",
	"text": "Any money arising under section 243.23 shall be and remain under the control of the commissioner of corrections and shall be for the sole benefit of the inmate, unless by special order of the commissioner of corrections it shall be used as designated in section 243.23, subdivisions 2 and 3, or for rendering assistance to the inmate's family or dependent relatives, under such rules as to time, manner, and amount of disbursements as the commissioner of corrections may prescribe. Unless ordered disbursed as hereinbefore prescribed or for an urgency determined in each case by the chief executive officer of the facility, a portion of such earnings in an amount to be determined by the commissioner shall be set aside and kept by the facility in the public welfare fund of the state for the benefit of the inmate and for the purpose of assisting the inmate when leaving the facility and if released on parole said sum to be disbursed to the inmate in such amounts and at such times as the commissioner of corrections may authorize and on final discharge, if any portion remains undisbursed, it shall be transmitted to the inmate.\nIf the fund standing to the credit of the prisoner on the prisoner's leaving the facility by discharge, supervised release, or on parole be less than $100, the warden or chief executive officer is directed to pay out of the current expense fund of the facility sufficient funds to make the total of said earnings the sum of $100. Offenders who have previously received the $100 upon their initial release from incarceration will not receive the $100 on any second or subsequent release from incarceration for that offense. Offenders who were sentenced as short-term offenders under section 609.105 shall not receive gate money.\nMoney or property received by or in the possession of an inmate that is determined by the head of the institution after an institutional disciplinary hearing to be contraband within the meaning of rules adopted by the commissioner of corrections may be seized by the institution head or by the head's designee. Property seized under this subdivision may be sold or destroyed if the property is not claimed by its rightful owner within 30 days. Proceeds from a sale or money seized pursuant to this subdivision must be deposited in the inmate social welfare fund for the benefit of the inmates of the facility. The commissioner of corrections shall adopt rules consistent with this section. The state or an official, employee, or agent of the state is not liable for any damages due to the disposal of personal property or use of money in accordance with this section.",
	"repealed": false
}