{
	"id": "469.1794",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.1794",
	"title": "469.1794 DURATION EXTENSION TO OFFSET DEFICITS.",
	"text": "Subject to the conditions and limitations imposed by this section, an authority may, by resolution, extend the duration limit under section 469.176, subdivision 1b, 1c, 1e, or 1g, that applies to a preexisting district by up to the maximum number of years permitted under subdivision 5, plus any amount authorized by the commissioner of revenue under subdivision 6.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Extended district\" means a tax increment financing district whose duration limit is extended under this section.\n(c) \"Preexisting district\" has the meaning given in section 469.1792, subdivision 2.\n(d) \"Preexisting obligation\" has the meaning given in section 469.1792, subdivision 2.\n(e) \"Qualifying obligation\" means:\n(1) a preexisting obligation that is:\n(i) a general obligation bond of the municipality;\n(ii) a general obligation bond of the authority;\n(iii) a revenue bond of the authority to which other revenues or money of the authority in addition to tax increments are pledged to pay;\n(iv) an interfund loan, including an advance or payment made by the municipality or authority after June 1, 2002, to pay an obligation listed in items (i) to (iii);\n(v) an obligation assumed by a developer before January 1, 2001, to repay a general obligation bond issued by a municipality to fund cleanup and development activities, if the developer assumed the obligation more than five years after the issuance of the bonds; or\n(2) a bond issued to refinance a preexisting obligation under clause (1).\nBefore an authority may extend the duration of district under this section, the following conditions must be met with regard to the district:\n(1) the original local tax rate under section 469.177, subdivision 1a, does not apply under an election made under section 469.1792, subdivision 3, or under other operation of law;\n(2) for a district in the metropolitan area or taconite tax relief area, the fiscal disparities contribution is computed under section 469.177, subdivision 3, paragraph (a);\n(3) the municipality has transferred any available increments in other districts to pay qualified obligations of the district or other districts in the municipality under section 469.1763, subdivision 6; and\n(4) the authority finds that, taking into account all of the increments that are available to pay qualifying obligations for the district, the increments from the district will be insufficient to pay the amount of qualifying obligations and that the insufficiency is a result of (i) the changes in the classification rates and (ii) elimination of the state-determined general education property tax levy under Laws 2001, First Special Session chapter 5.\nThe authority may extend the duration of a district under this section only after the municipality has approved the extension after providing public notice and holding a hearing in the manner provided under section 469.175, subdivision 3.\n(a) The maximum extension for a district under this subdivision equals the lesser of:\n(1) four years; or\n(2) the tax reform percentage for the district, determined under paragraph (b), multiplied by the remaining duration of the district rounded to the nearest whole number. Fractions in excess of one-third are rounded up.\n(b) The tax reform percentage for the district, as estimated by the county auditor, equals:\n(1)(i) the total taxes paid by the original tax capacity for the district for taxes payable in 2001, minus\n(ii) the average of the total taxes paid by the original tax capacity for the district for taxes payable in 2002 and in 2003, divided by\n(2) the total taxes paid by the original tax capacity for the district for taxes payable in 2001.\n(c) In the resolution approving the extension, the municipality may elect to treat all preexisting obligations as qualified obligations for purposes of this section. If the municipality makes an election under this paragraph, the maximum duration is reduced by one-half of the amount otherwise permitted under paragraph (a).\n(d) The remaining duration of a district is the number of calendar years, beginning after December 31, 2001, in which the district may collect increment under its duration limit under section 469.176, subdivision 1b, 1c, 1e, or 1g, or a special law approved before January 1, 2002, as applicable.\n(e) For purposes of this subdivision, \"taxes\" exclude taxes levied against market value, rather than tax capacity, and the state general tax under section 275.025.\n(a) If the municipality determines that the extension permitted under subdivision 5 will not provide sufficient revenue to pay in full the amount of qualifying obligations, the municipality may apply to the commissioner of revenue for an additional duration extension. The commissioner may authorize an extension of the duration of the district of up to two years after determining that:\n(1) the insufficiency of revenues to pay the qualifying obligations, which will be offset by the additional extension of the duration limit, result from (i) the changes in the classification rates and (ii) elimination of the state-determined general education property tax levy under Laws 2001, First Special Session chapter 5;\n(2) the municipality has or is transferring all available increments from other preexisting districts and after August 1, 2001, has not entered into new obligations or authorized new spending that reduced the amount of those increments that are available for transfer to pay qualifying obligations; and\n(3) increases in increments over the term of the district are unlikely to eliminate the insufficiency.\n(b) The commissioner may:\n(1) establish the form of and time for applications under this subdivision; and\n(2) require the municipality to provide the information that the commissioner determines is necessary or useful in evaluating the application.\n(c) This subdivision does not apply to a district if the authority has made an election under subdivision 5, paragraph (c).\n(a) Tax increments of an extended district may only be used to pay preexisting obligations of the district and administrative expenses, effective upon the final required approval of the extension under this section. All tax increments that are attributable to an extension of the duration of a district under this section must be used only to pay qualified obligations of the district. If increments from a district subject to this subdivision are pledged to pay preexisting obligations that are not qualified obligations, increments received under the duration limit, determined without regard to this section, must be used to pay qualified obligations and preexisting obligations that are not qualified obligations in proportion to their relative shares of all payments due on all preexisting obligations.\n(b) If the authority elects to extend the duration of a district under this section and if increments from one or more other districts are pledged to pay preexisting obligations of the extended district, increments from all of the districts may only be used to pay preexisting obligations and administrative expenses.\nAn extended district must be decertified at the end of the first calendar year when sufficient increments have been received to pay the qualified obligations of the extended district. Any remaining unspent increments must be distributed as excess increments under section 469.176, subdivision 2, paragraph (c), clause (4).",
	"repealed": false
}