{
	"id": "124D.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.78",
	"title": "124D.78 PARENT AND COMMUNITY PARTICIPATION.",
	"text": "School districts, charter schools, Tribal contract schools, and the respective school boards must provide for the maximum involvement of parents of American Indian children enrolled in American Indian education programs, programs for elementary and secondary grades, special education programs, and support services. Accordingly, school districts, charter schools, and Tribal contract schools in which there are ten or more state-identified American Indian students enrolled must establish an American Indian Parent Advisory Committee. If a committee whose membership consists of a majority of parents of American Indian children has been or is established according to federal, Tribal, or other state law, that committee may serve as the committee required by this section and is subject to, at least, the requirements of this subdivision and subdivision 2.\nThe American Indian Parent Advisory Committee must develop its recommendations in consultation with the curriculum advisory committee required by section 120B.11, subdivision 3. This committee must afford parents the necessary information and the opportunity effectively to express their views concerning all aspects of American Indian education and the educational needs of the American Indian children enrolled in the school or program. School districts, charter schools, and Tribal contract schools must ensure that programs are planned, operated, and evaluated with the involvement of and in consultation with parents of the American Indian students served by the programs.\nPrior to March 1, the American Indian Parent Advisory Committee must meet to discuss whether or not they concur with the educational offerings that have been extended by the district to American Indian students. If the committee finds that the district, charter school, Tribal contract school, and the school board have been meeting the needs of American Indian students, they issue a vote and resolution of concurrence. If they find that the needs of American Indian students are not being met, they issue a vote and resolution of nonconcurrence. The vote and resolution must be presented to the school board by one or more members of the American Indian Parent Advisory Committee. The vote is formally reflected on documentation provided by the Department of Education and must be submitted annually on March 1.\nIf the vote is one of nonconcurrence, the committee must provide written recommendations for improvement to the school board at the time of the presentation. In the case of nonconcurrence, the school board is given 60 days in which to respond, in writing, to the committee's recommendations. The board response must be signed by the entire school board and submitted to both the American Indian Parent Advisory Committee and to the Department of Education. The resolution must be accompanied by Parent Advisory Committee meeting minutes that show they have been appraised by the district on the goals of the Indian Education Program Plan and the measurement of progress toward those goals.\nThe American Indian Parent Advisory Committee must be composed of parents or guardians of American Indian children eligible to be enrolled in American Indian education programs; American Indian secondary students; American Indian family members of students eligible to be enrolled in American Indian education programs; American Indian language and culture education teachers and paraprofessionals; American Indian teachers; American Indian district employees; American Indian counselors; adult American Indian people enrolled in educational programs; and American Indian community members. The majority of each committee must be the parents or guardians of the American Indian children enrolled or eligible to be enrolled in the programs.\nIf the organizational membership or the board of directors of a Tribal contract school consists of parents of children attending the school, that membership or board may serve also as the American Indian Parent Advisory Committee.\nFor the purposes of sections 124D.71 to 124D.82, the number of students who identify as American Indian or Alaska Native, as defined by the state of Minnesota on October 1 of the previous school year, will be used to determine the state-identified American Indian student counts for school districts, charter schools, and Tribal contract schools for the subsequent school year.",
	"repealed": false
}