{
	"id": "16D.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.14",
	"title": "16D.14 VENUE.",
	"text": "The commissioner or the attorney general may bring an action to recover debts owed to the state in Ramsey County District Court or Ramsey County Conciliation Court at the discretion of the state. In order to bring a cause of action under this section in any county other than the county where the debtor resides or where the cause of action arose, the commissioner or the attorney general must notify the debtor as provided in subdivisions 2 to 4, unless that venue is authorized by other law.\n(a) The commissioner or the attorney general may bring a conciliation court action where the cause of action arose or where the debtor resides. Before bringing a conciliation court action for a claim for $2,500 or less under this section in any county other than where the debtor resides or where the cause of action arose, the commissioner or the attorney general shall send a form by first class mail to the debtor's last known address notifying the debtor of the intent to bring an action in Ramsey County. The commissioner or attorney general must enclose a form for the debtor to use to request that the action not be brought in Ramsey County and a self-addressed, postage paid envelope. The form must advise the debtor of the right to request that the action not be brought in Ramsey County and that the debtor has 30 days from the date of the form to make this request.\n(b) If the debtor timely returns the form requesting the action not be brought in Ramsey County, the commissioner or attorney general may only file the action in the county of the debtor's residence, the county where the cause of action arose, or as provided by other law. The commissioner or attorney general shall notify the debtor of the action taken. If the debtor does not timely return the form, venue is as chosen by the commissioner or attorney general as authorized under this section.\n(c) If a judgment is obtained in Ramsey County Conciliation Court when the form was sent by first class mail under this subdivision and the debtor reasonably demonstrates that the debtor did not reside at the address where the form was sent or that the debtor did not receive the form, the commissioner or the attorney general shall vacate the judgment without prejudice and return any funds collected as a result of enforcement of the judgment. Evidence of the debtor's correct address include, but are not limited to, a driver's license, homestead declaration, school registration, utility bills, or a lease or rental agreement.\n(a) The commissioner or the attorney general may bring a conciliation court action where the cause of action arose or where the debtor resides. In order to bring a conciliation court claim that exceeds $2,500 under this section in a county other than where the debtor resides or where the cause of action arose, the commissioner or the attorney general shall serve with the conciliation court claim a change of venue form for the debtor to use to request that venue be changed and a self-addressed, postage paid return envelope. This form must advise the debtor that the form must be returned within 30 days of the date of service or venue will remain in Ramsey County.\n(b) If the debtor timely returns the change of venue form requesting a change of venue, the commissioner or attorney general shall change the venue of the action to the county of the debtor's residence, the county where the cause of action arose, as provided by other law, or dismiss the action. The commissioner or attorney general must notify the debtor of the action taken. If the debtor does not timely return the form, venue is as chosen by the commissioner or attorney general as authorized under this section. The commissioner or the attorney general shall file the signed return receipt card or the proof of service with the court.\n(a) In order to bring a district court action under this section in any county other than where the debtor resides or where the cause of action arose, the commissioner or attorney general shall serve the change of venue form with the summons and complaint or petition commencing the collection action. Two copies of the form must be served along with a self-addressed, postage paid return envelope. The form must advise the debtor that the form must be returned within 20 days of the date of service or venue will remain in Ramsey County. If the debtor timely returns the change of venue form, the time to answer the summons and complaint or petition runs from the date of debtor's request for change of venue.\n(b) If the debtor timely returns the change of venue form requesting that the action not be brought in Ramsey County, the commissioner or attorney general shall change the venue of the action to the county of the debtor's residence, the county where the cause of action arose, as provided by other law, or dismiss the action. The commissioner or attorney general shall notify the debtor of the action taken. If the debtor is served the form to change venue along with the district court summons and complaint or petition, in accordance with court rules, but does not return the form within the statutory timelines, venue is as chosen by the commissioner or attorney general as authorized under this section. The commissioner or attorney general shall file the proof of service along with the summons and complaint or petition commencing the lawsuit.\nNo court filing fees, docketing fees, release of judgment fees, or any other fees or costs for court services may be assessed against the state for actions filed by the state or a state agency seeking monetary relief in favor of the state.",
	"repealed": false
}