{
	"id": "256.9695",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9695",
	"title": "256.9695 APPEALS OF RATES; PROHIBITED PRACTICES FOR HOSPITALS; TRANSITION RATES.",
	"text": "A hospital may appeal a decision arising from the application of standards or methods under section 256.9685, 256.9686, or 256.969, if an appeal would result in a change to the hospital's payment rate or payments. Both overpayments and underpayments that result from the submission of appeals shall be implemented. Regardless of any appeal outcome, relative values, Medicare wage indexes, Medicare cost-to-charge ratios, and policy adjusters shall not be changed. The appeal shall be heard by an administrative law judge according to sections 14.57 to 14.62, or upon agreement by both parties, according to a modified appeals procedure established by the commissioner and the Office of Administrative Hearings. In any proceeding under this section, the appealing party must demonstrate by a preponderance of the evidence that the commissioner's determination is incorrect or not according to law.\nTo appeal a payment rate or payment determination or a determination made from base year information, the hospital shall file a written appeal request to the commissioner within 60 days of the date the preliminary payment rate determination was mailed. The appeal request shall specify: (i) the disputed items; (ii) the authority in federal or state statute or rule upon which the hospital relies for each disputed item; and (iii) the name and address of the person to contact regarding the appeal. Facts to be considered in any appeal of base year information are limited to those in existence 18 months after the last day of the calendar year that is the base year for the payment rates in dispute.\n(a) Hospitals that have a provider agreement with the department may not limit medical assistance admissions to percentages of certified capacity or to quotas unless patients from all payors are limited in the same manner. This requirement does not apply to certified capacity that is unavailable due to contracts with payors for specific occupancy levels.\n(b) Hospitals may not transfer medical assistance patients to or cause medical assistance patients to be admitted to other hospitals without the explicit consent of the receiving hospital when service needs of the patient are available and within the scope of the transferring hospital. The transferring hospital is liable to the receiving hospital for patient charges and ambulance services without regard to medical assistance payments plus the receiving hospital's reasonable attorney fees if found in violation of this prohibition.\n[Repealed, 2014 c 312 art 24 s 48]\n[Repealed, 2014 c 312 art 24 s 48]\nThe commissioner of human services shall adopt permanent rules to implement this section and sections 256.9685, 256.9686, and 256.969 under chapter 14, the Administrative Procedure Act.",
	"repealed": false
}