{
	"id": "161.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.23",
	"title": "161.23 EXCESS ACQUISITION.",
	"text": "On determining that it is necessary to acquire any interest in a part of a tract or parcel of real estate for trunk highway purposes, the commissioner of transportation may acquire in fee, with the written consent of the owner or owners thereof, by purchase, gift, or condemnation the whole or such additional parts of such tract or parcel as the commissioner deems to be in the best interests of the state. Any owner or owners consenting to such excess acquisition may withdraw the consent at any time prior to the award of commissioners in the case of condemnation proceedings, or at any time prior to payment in the case of purchase. In the event of withdrawal the commissioner shall dismiss from the condemnation proceedings the portion of the tract in excess of what is needed for highway purposes.\n(a) On acquiring real estate in excess of what is needed for trunk highway purposes as authorized in subdivision 1, the commissioner of transportation shall, within one year after the completion of the construction, reconstruction, or improvement of the highway for which a portion of the real estate was needed and required, convey and quitclaim the excess real estate.\n(b) The excess real estate may be sold and conveyed to the owner of the land abutting upon the excess real estate in the same manner and under the same terms provided under section 161.44, subdivision 2, or to the highest responsible bidder, after receipt of sealed bids following mailed notice to adjacent landowners and published notice of the sale for three successive weeks in a newspaper or trade journal of general circulation in the territory from which bids are likely to be received. All bids may be rejected and new bids received upon like advertisement.\n(c) If the lands remain unsold after being offered for sale, the commissioner may offer the remaining lands to any person who agrees to pay the minimum bid established for the public sale. The sale must continue until all eligible lands have been sold or the commissioner withdraws the remaining lands from the sale. The lands to be sold must be listed on the department's unsold property inventory list.\n(d) The deed may contain restrictive clauses limiting the use of such real estate in the interests of safety and convenient public travel when the commissioner finds that the restrictions are reasonably necessary.\nIf the lands remain unsold after being offered for sale to the highest bidder, the commissioner may retain the services of a licensed real estate broker to find a buyer. The sale price may be negotiated by the broker, but must not be less than 80 percent of the appraised market value as determined by the commissioner. The broker's fee must be established by prior agreement between the commissioner and the broker, and must not exceed ten percent of the sale price for sales of $10,000 or more. The broker's fee must be paid to the broker from the proceeds of the sale.\nThe commissioner may lease for the term between the acquisition and sale thereof and for a fair rental rate and upon such terms and conditions as the commissioner deems proper, any excess real estate acquired under this section, and any real estate acquired in fee for trunk highway purposes and not presently needed for those purposes. All rents received from the leases must be paid into the state treasury. Seventy percent of the rents must be credited to the trunk highway fund. The remaining 30 percent must be paid to the county treasurer where the real estate is located, and distributed in the same manner as real estate taxes. This subdivision does not apply to real estate leased for the purpose of providing commercial and public service advertising pursuant to agreements as provided in sections 160.272 to 160.276 or to fees collected under section 174.70, subdivision 2.\nNothing contained in this section shall be construed to prevent the commissioner from acquiring lands, real estate, or interests in lands or real estate necessary for trunk highway purposes, without the consent of the owner or owners thereof.\nMoney received from the sale of such lands and properties less any fee paid under subdivision 2a must be paid into the trunk highway fund.",
	"repealed": false
}