{
	"id": "527.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/527.405",
	"title": "527.405 CONVEYANCE BY CUSTODIAN.",
	"text": "In support of a real property transaction where an interest in real property is held in a custodianship, a custodian shall furnish to the grantee or other party to the transaction an affidavit attesting that:\n(1) the custodian has not resigned or been removed prior to executing the conveyance; and\n(2) the custodianship has not terminated, or if the custodianship has terminated that the conveyance is to the minor or to the personal representative of the minor's estate.\nAn affidavit under this section must be substantially in the following form:\nAFFIDAVIT OF CUSTODIAN\nState of Minnesota\nCounty of.............................\n........., being first duly sworn on oath says, that:\n1. Affiant was appointed or designated as custodian in the document dated ....... and filed for record ....... as Document No. ...., (or in book .. of page ..) in the office of the (County Recorder) (Registrar of Titles) of ..... County, Minnesota (being the document which originally conveyed the real estate to the custodian).\n2. Affiant is the grantor custodian for the minor in the document dated ..., conveying to .......... an interest in the real property in ..... County, Minnesota, legally described as:\n(insert legal description here)\n3. The name of the minor is ..........................\n4. The custodianship (check one) ....... has not terminated prior to the date of the document described in paragraph 2 above (or) ....... has terminated and the conveyance is to the minor or to the personal representative of the minor's estate.\n5. Affiant's address is: ........................\n6. Affiant has not resigned and does not have actual knowledge of affiant's removal as custodian.\nAffiant knows the matters herein stated are true and makes this affidavit for the purpose of inducing the passing of title to the real property.\n........................................\nAffiant\nSubscribed and sworn to before me this day of ...., 20..\n........................................\nNotary Public\nThis instrument was drafted by ..........................\nAn affidavit by a custodian under this section is conclusive proof that the custodian has not resigned or been removed as custodian prior to executing the conveyance and that the custodianship has not terminated, or that if the custodianship has terminated, the conveyance is to the minor or to the personal representative of the minor's estate. However, the affidavit is not conclusive as to a party dealing directly with the custodian who has actual knowledge that the custodian has resigned or been removed or that the custodianship has terminated and the conveyance is not to the minor or the personal representative of the minor's estate.",
	"repealed": false
}