{
	"id": "103E.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.285",
	"title": "103E.285 DETAILED SURVEY REPORT.",
	"text": "The engineer shall prepare a detailed survey report that includes the data and information in this section.\nA complete map of the proposed drainage project and drainage system must be drawn to scale, showing:\n(1) the terminus and course of each drain and whether it is ditch or tile, and the location of other proposed drainage works;\n(2) the location and situation of the outlet;\n(3) the watershed of the proposed drainage project and the subwatershed of main branches, if any, with the location of existing highway bridges and culverts;\n(4) all property affected, with the names of the known owners;\n(5) public roads and railways affected;\n(6) the outline of any lake basin, wetland, or public water body affected;\n(7) other physical characteristics of the watershed necessary to understand the proposed drainage project and the affected drainage system; and\n(8) the area to be acquired to maintain a grass strip under section 103E.021.\nA profile of all proposed drainage lines must be presented showing, graphically, the elevation of the ground and gradient at each 100-foot station, and the station number at each section line and at each property line. The profile must show information necessary to understand it, including, in the case of an open ditch, the bottom width and side slope and, in the case of a tiled ditch, the size of tile.\nPlans for private bridges and culverts to be constructed by and as a part of the proposed drainage project and plans for other works to be constructed for the proposed drainage project must be presented. A list must be made that shows the required minimum hydraulic capacity of bridges and culverts at railways and highways that cross ditches, and at other prospective ditch crossings where bridges and culverts are not specified to be constructed as part of the proposed drainage project. Plans and estimates of the cost of highway bridges and culverts must be prepared for the viewers to determine benefits and damages.\nA tabular statement must be prepared showing:\n(1) the number of cubic yards of excavation, linear feet of tile, and average depth on each tile line;\n(2) the bridges, culverts, and works to be constructed under the plans for the drainage project; and\n(3) the estimated unit cost of each item, a summary of the total cost, and an estimate of the total cost of completing the proposed drainage project that includes supervision and other costs.\nThe acreage must be shown that will be taken for ditch right-of-way on each government lot, 40-acre tract, or fraction of a lot or tract under separate ownership. The ditch right-of-way must include the area to be taken to maintain a grass strip under section 103E.021.\nSpecifications for drain tile must be given that comply with the requirements of the American Society for Testing Materials standard specifications for drain tile, except where the engineer requires tile of a special, higher quality for certain tile depths or soil conditions.\nIf required under section 103E.281, the report on the soil survey must be included in the detailed survey report or submitted and filed separately before the final hearing.\nIf construction of the proposed drainage project would be more economical, the engineer may recommend:\n(1) that the work be divided into sections and contracted separately;\n(2) that the ditch and tile work or tile and labor on the project be contracted separately; or\n(3) the time and manner for the work to be completed.\nOther data and information to inform the drainage authority of the practicability and necessity of the proposed drainage project must be made available including a comprehensive examination and the recommendation by the engineer regarding the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1.\nIf an outlet is only practical in an adjoining state, the engineer shall describe the right-of-way needed and the cost of obtaining the right-of-way and constructing the outlet.\nThe engineer shall prepare the detailed survey and complete the detailed survey report, in duplicate, as specified in this section.",
	"repealed": false
}