{
	"id": "121A.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.24",
	"title": "121A.24 SEIZURE TRAINING AND ACTION PLAN.",
	"text": "(a) For purposes of this section, \"seizure action plan\" means a written individualized health plan designed to acknowledge and prepare for the health care needs of a student with a seizure disorder diagnosed by the student's treating licensed health care provider.\n(b) The requirements of this subdivision apply to a school district or charter school where an enrolled student's parent or guardian has notified the school district or charter school that the student has a diagnosed seizure disorder and has seizure rescue medication or medication prescribed by the student's licensed health care provider to treat seizure disorder symptoms approved by the United States Food and Drug Administration. The parent or guardian of a student with a diagnosed seizure disorder must collaborate with school personnel to implement the seizure action plan.\n(c) A seizure action plan must:\n(1) identify a school nurse or a designated individual at each school site who is on duty during the regular school day and can administer or assist with the administration of seizure rescue medication or medication prescribed to treat seizure disorder symptoms approved by the United States Food and Drug Administration;\n(2) require training on seizure medications for an employee identified under clause (1), recognition of signs and symptoms of seizures, and appropriate steps to respond to seizures;\n(3) be provided to the person identified under clause (1); and\n(4) be filed in the office of the school principal or licensed school nurse or, in the absence of a licensed school nurse, a professional nurse or designated individual.\n(d) A school district or charter school employee or volunteer responsible for the supervision or care of a student with a diagnosed seizure disorder must be given notice and a copy of the seizure action plan, the name or position of the employee identified under paragraph (c), clause (1), and the method by which the trained school employee may be contacted in an emergency.\nA school district or charter school must provide all licensed school nurses or, in the absence of a licensed school nurse, a professional nurse or designated individual, and other school staff working with students with self-study materials on seizure disorder signs, symptoms, medications, and appropriate responses.",
	"repealed": false
}