{
	"id": "144.6522",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6522",
	"title": "144.6522 DESIGNATION OF A CAREGIVER.",
	"text": "(a) For purposes of this section:\n(b) \"Aftercare\" means any assistance provided to a patient in the patient's residence by a caregiver designated by the patient in accordance with this section after the patient's discharge from a hospital. Assistance may include, but is not limited to, assisting with basic activities of daily living (ADLs), instrumental activities of daily living (IADLs), or carrying out medical or nursing tasks, such as managing wound care, assisting in administering medications, and operating medical equipment.\n(c) \"Agent\" means a court-appointed guardian, the parent of a minor child whose authority to act on behalf of the patient as to health care decisions has not been restricted by the court, or a health agent authorized to act on behalf of the patient under chapter 145C.\n(d) \"Designated caregiver\" means any individual 18 years of age or older who is designated as a caregiver by a patient to provide aftercare assistance to the patient in the patient's residence after the patient's discharge from a hospital and who, in the professional opinion of the patient's health care provider, is capable of providing aftercare assistance. A designated caregiver may include, but is not limited to, a relative, partner, friend, or neighbor who has a relationship with the patient.\n(e) \"Discharge\" means a patient's exit or release from a hospital to the patient's residence following an inpatient admission.\n(f) \"Entry\" means a patient's admission to a hospital for the purposes of inpatient medical care.\n(g) \"Hospital\" means a facility licensed under sections 144.50 to 144.56.\n(h) \"Residence\" means a dwelling that the patient considers to be the patient's home. For the purposes of this section, a residence does not include a rehabilitation facility, hospital, nursing facility, or other health care or residential facility where health care staff are responsible for performing necessary medical and nursing tasks for the patient.\n(a) A hospital shall provide each patient or, if applicable, the patient's agent with an opportunity to designate at least one caregiver no later than 24 hours upon the patient's entry into a hospital and before the patient is discharged from the hospital or transferred to another health care facility. If the patient is unconscious or otherwise incapacitated upon entry into the hospital, the hospital shall provide the patient or the patient's agent with an opportunity to designate a caregiver within 24 hours following the patient's recovery of consciousness or capacity.\n(b) If the patient or the patient's agent designates an individual as a caregiver, the hospital shall record the patient's designation of caregiver, the relationship of the designated caregiver to the patient, and the name, telephone number, and address of the patient's designated caregiver in the patient's medical record. If the patient or the patient's agent declines to designate a caregiver, the hospital shall document this in the patient's medical record.\n(c) If the patient designates a caregiver, the hospital shall be deemed to have obtained the written consent of the patient to release medical information to the designated caregiver following the hospital's established procedures for releasing personal health information and in compliance with all federal and state laws. The patient or the patient's agent may revoke prior consent to release medical information to the designated caregiver at any time and, if consent is revoked, the hospital is not required to provide notice to the designated caregiver under subdivision 3 or provide information contained in the patient's discharge plan under subdivision 4.\n(d) A patient may elect to change their designated caregiver at any time, and the hospital shall record the change in the patient's medical record within 24 hours.\n(e) A designation of a caregiver by a patient or a patient's agent does not obligate the designated caregiver to perform any aftercare tasks for the patient.\n(a) A hospital shall notify, as soon as practicable, the patient's designated caregiver of the patient's discharge or transfer to another hospital or health care facility after the patient's health care provider issues a discharge or transfer order.\n(b) Failure to contact a designated caregiver or failure of the designated caregiver to be present at the hospital to receive the discharge plan and aftercare instructions described in subdivision 4 shall not interfere with or delay the discharge or transfer of the patient so long as the hospital has made a good faith effort to contact the designated caregiver within a reasonable time period. The hospital shall document the efforts made to contact the designated caregiver in the patient's medical record.\n(c) This subdivision shall not apply if the patient is transferred to another health care facility due to an emergency situation.\n(a) Prior to a patient's discharge from the hospital to the patient's residence, the hospital shall consult with the designated caregiver and the patient, and issue a discharge plan that describes the patient's aftercare needs and instructions for all aftercare tasks described in the discharge plan.\n(b) At a minimum, a discharge plan must include:\n(1) the name and contact information of the designated caregiver;\n(2) a description of and instructions for all aftercare tasks necessary to maintain the patient's ability to reside at home, taking into account the capabilities and limitations of the designated caregiver;\n(3) contact information for any health care, community resources, and long-term services and supports necessary to successfully carry out the patient's discharge plan; and\n(4) contact information of a hospital representative who can respond to questions about the discharge plan and instructions that are required to be provided under this subdivision after the patient has been discharged.\n(c) At a minimum, the instructions for aftercare tasks included in the discharge plan must include:\n(1) a live demonstration or video instruction of the aftercare tasks performed by a hospital employee, or an individual with whom the hospital has a contractual relationship who has the appropriate education and competency in the task to be performed and is authorized to perform the task, in a culturally competent manner and in accordance with the hospital's requirements to provide language access services under state and federal law; and\n(2) an opportunity for the designated caregiver and patient to ask questions about the aftercare tasks, and to provide answers to any questions in a culturally competent manner and in accordance with the hospital's requirements to provide language access services under state and federal law.\n(d) The hospital shall document the discharge plan and a description of the instructions provided in the patient's medical record, including, at a minimum, the date, time, and content of the instructions provided.\n(a) Nothing in this section shall be construed to create a separate private cause of action against a hospital, a hospital employee, or an individual with whom a hospital has a contractual relationship, or to otherwise supersede or replace existing duties, rights, or remedies under any other provision of state or federal law. This section does not establish a separate standard of care for use in an action against a hospital, health care facility, or health care provider.\n(b) Nothing in this section shall be construed to require a patient or a patient's agent to designate a caregiver.\n(c) Nothing in this section shall be construed to interfere with the powers of a health care agent operating under a valid health care directive in compliance with chapter 145C.",
	"repealed": false
}