{
	"id": "221.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.031",
	"title": "221.031 INTRASTATE CARRIER; OPERATING REQUIREMENTS, EXEMPTIONS.",
	"text": "(a) This subdivision applies to motor carriers engaged in intrastate commerce.\n(b) The commissioner shall prescribe rules for the operation of motor carriers, including their facilities; accounts; leasing of vehicles and drivers; service; safe operation of vehicles; equipment, parts, and accessories; hours of service of drivers; driver qualifications; accident reporting; identification of vehicles; installation of safety devices; inspection, repair, and maintenance; and proper automatic speed regulators if, in the opinion of the commissioner, there is a need for the rules.\n(c) The commissioner shall (1) require holders of household goods mover permits to file schedules of rates and charges, (2) regulate motor carriers in matters affecting the relationship between them and the traveling and shipping public, and (3) prescribe other rules as may be necessary to carry out the provisions of this chapter.\n(d) The commissioner shall enforce sections 169.781 to 169.783.\n(a) This subdivision applies to private carriers engaged in intrastate commerce.\n(b) Private carriers operating vehicles with a gross vehicle weight of more than 10,000 pounds shall comply with those federal regulations incorporated by reference in:\n(1) section 221.0314, subdivisions 2 to 5, for driver qualifications;\n(2) section 221.0314, subdivision 9, for hours of service of drivers;\n(3) section 221.0314, subdivision 6, for driving of motor vehicles;\n(4) section 221.0314, subdivision 7, for parts and accessories necessary for safe operation; and\n(5) section 221.0314, subdivision 10, for inspection, repair, and maintenance.\n(c) The rules for hours of service of drivers do not apply to private carriers who are (1) public utilities as defined in section 216B.02, subdivision 4; (2) cooperative electric associations organized under chapter 308A; (3) telephone companies as defined in section 237.01, subdivision 7; or (4) engaged in the transportation of construction materials, tools and equipment from shop to job site or job site to job site, for use by the private carrier in the new construction, remodeling, or repair of buildings, structures or their appurtenances.\n(d) The rules for driver qualifications and hours of service of drivers do not apply to vehicles controlled by a farmer and operated by a farmer or farm employee to transport agricultural products, farm machinery, or supplies to or from a farm if the vehicle is not used in the operations of a motor carrier and not carrying hazardous materials of a type or quantity that requires the vehicle to be marked or placarded in accordance with section 221.033.\n(e) The rules for driver qualifications do not apply to a driver employed by a private carrier while operating a lightweight vehicle.\n(a) Notwithstanding the provisions of subdivision 2, private carriers engaged in intrastate commerce and operating vehicles transporting agricultural and other farm products within an area having a 50-mile radius from the business location of the private carrier must comply only with the rules for driver qualifications; driving of motor vehicles; and parts and accessories necessary for safe operation, except as provided in paragraphs (b) and (c).\n(b) A rear-end dump truck or other rear-unloading truck while being used for hauling agricultural and other farm products from a place of production or on-farm storage site to a place of processing or storage, is not subject to any rule of the commissioner requiring rear-end protection, including a federal regulation adopted by reference.\n(c) A private carrier operating a commercial motor vehicle as defined in section 169.781, subdivision 1, must comply with sections 169.781 to 169.783.\n[Repealed, 2009 c 64 s 57]\n(a) For the purposes of this subdivision, \"covered farm vehicle\" has the meaning given in Code of Federal Regulations, title 49, section 390.5.\n(b) A covered farm vehicle that is not carrying hazardous materials of a type or quantity that requires the vehicle to be placarded in accordance with Code of Federal Regulations, title 49, section 172.504, including the operator of the vehicle, is exempt from the federal regulations incorporated by reference in:\n(1) section 221.0314, subdivision 2, that consist of Code of Federal Regulations, title 49, parts 391.41 to 391.45, for physical qualifications and examinations;\n(2) section 221.0314, subdivision 9, for hours of service; and\n(3) section 221.0314, subdivision 10, for inspection, repair, and maintenance.\nThe federal regulations incorporated in section 221.0314, subdivision 9, for hours of service do not apply to drivers engaged in intrastate transportation within a 150-air-mile radius from the source of the commodities, or from the retail or wholesale distribution point of the farm supplies, for:\n(1) agricultural commodities; or\n(2) farm supplies for agricultural purposes.\nA pipeline welding truck, as defined in Code of Federal Regulations, title 49, section 390.38, paragraph (b), including an individual operating a pipeline welding truck and the employer of the individual, is exempt from any requirement relating to:\n(1) registration as a motor carrier, including the requirement to obtain and display a United States Department of Transportation number under subdivision 6 and section 168.185;\n(2) driver qualifications under section 221.0314, subdivision 2;\n(3) driving of commercial motor vehicles under section 221.0314, subdivision 6;\n(4) parts, accessories, and inspection, repair, and maintenance of commercial motor vehicles under section 221.0314, subdivisions 7 and 10; and\n(5) hours of service of drivers, including maximum driving and on-duty time under section 221.0314, subdivision 9.\n(a) The federal regulations incorporated in section 221.0314, subdivision 9, for hours of service do not apply to drivers engaged in intrastate transportation of utility construction materials within a 50-mile radius from the site of a construction or maintenance project.\n(b) For purposes of this subdivision, \"utility construction materials\" include supplies and materials used in a project to construct or maintain: (1) a street or highway; (2) equipment or facilities to furnish electric transmission service; (3) a telecommunications system or cable communications system; (4) a waterworks system, sanitary sewer, or storm sewer; (5) a gas heating service line; (6) a pipeline; and (7) a facility for other similar utility service.\n(a) This subdivision applies to persons engaged in intrastate commerce who operate vehicles providing transportation described in section 221.025 with a gross vehicle weight in excess of 10,000 pounds, except school buses, commuter vans, and authorized emergency vehicles.\n(b) Persons providing transportation described in section 221.025, clause (6), (10), (11), or (12), must comply with the rules for driving of motor vehicles and for parts and accessories necessary for safe operation.\n(c) Persons providing transportation described in section 221.025, except for persons providing transportation described in clause (6), (10), (11), or (12), must comply with the rules for driving of motor vehicles; parts and accessories necessary for safe operation; and the rules for driver qualifications.\n(a) Notwithstanding subdivision 3, providers of passenger transportation service under contract to and with operating assistance from the department or the Metropolitan Council must comply with rules for driver qualifications; driving of motor vehicles; parts and accessories necessary for safe operation; hours of service of drivers; inspection, repair, and maintenance; and the rules adopted in section 221.0314, subdivision 8, for accident reporting.\n(b) This subdivision does not apply to (1) a local transit commission, (2) a transit authority created by the legislature, (3) special transportation service certified by the commissioner under section 174.30, or (4) special transportation service defined in section 174.29, subdivision 1, when provided by a volunteer driver operating a private passenger vehicle defined in section 169.011, subdivision 52.\n(a) A person who transports passengers for hire in intrastate commerce, who is not made subject to the rules adopted in section 221.0314 by any other provision of this section, must comply with the rules for hours of service of drivers while transporting employees of an employer who is directly or indirectly paying the cost of the transportation.\n(b) This subdivision does not apply to:\n(1) a local transit commission;\n(2) a transit authority created by law; or\n(3) persons providing transportation:\n(i) in a school bus as defined in section 169.011, subdivision 71;\n(ii) in a Head Start bus as defined in section 169.011, subdivision 34;\n(iii) in a commuter van;\n(iv) in an authorized emergency vehicle as defined in section 169.011, subdivision 3;\n(v) in special transportation service certified by the commissioner under section 174.30;\n(vi) that is special transportation service as defined in section 174.29, subdivision 1, when provided by a volunteer driver, as defined in section 65B.472, subdivision 1, paragraph (h), operating a private passenger vehicle as defined in section 169.011, subdivision 52;\n(vii) in a limousine the service of which is licensed by the commissioner under section 221.84; or\n(viii) in a taxicab, if the fare for the transportation is determined by a meter inside the taxicab that measures the distance traveled and displays the fare accumulated.\nPersons providing transportation described in section 221.025, clause (2), must comply with the rules for driver qualifications; hours of service of drivers; driving of motor vehicles; parts and accessories necessary for safe operation; and inspection, repair, and maintenance. A local government unit, as defined in section 115A.03, subdivision 17, shall not enact or enforce laws, ordinances, or regulations for the operation of solid waste transporters that are inconsistent with the rules adopted in section 221.0314.\n[Repealed, 1984 c 520 s 26]\nThe department shall investigate the operation of carriers subject to the rules adopted in section 221.0314, their compliance with rules of the commissioner and with the provisions of this chapter, and may institute and prosecute actions and proceedings in the proper district court for enforcement of those rules.\nThe following carriers shall comply with section 168.185 and with the requirements for marking commercial motor vehicles in Code of Federal Regulations, title 49, section 390.21, which is incorporated by reference:\n(1) motor carriers, regardless of the weight of the vehicle, except that this requirement does not apply to a limousine as defined in section 168.002, subdivision 15, that is equipped with \"LM\" license plates;\n(2) interstate and intrastate private carriers operating vehicles with a gross vehicle weight of more than 10,000 pounds; and\n(3) vehicles providing transportation described in section 221.025 with a gross vehicle weight of more than 10,000 pounds except those providing transportation described in section 221.025, clauses (1), (3), and (4).\nVehicles described in section 168.185, paragraph (d), are not required to comply with the vehicle identification rule of the commissioner.\nWhile in the state, the driver for a motor carrier of passengers engaged in intrastate commerce who has in possession a license with a school bus endorsement under section 171.321 or rules of the commissioner of public safety is not required to have in possession or to present a separate medical examiner's certificate otherwise required by Code of Federal Regulations, title 49, sections 391.41 to 391.49.\nFor purposes of regulating commercial motor vehicles as defined in section 169.781, subdivision 1, the exemption provided in Code of Federal Regulations, title 49, section 396.11, paragraph (a), clause (5), applies in Minnesota only to driveaway-towaway operations.\nThe North American Standard Out-Of-Service Criteria developed and adopted by the Federal Highway Administration and the Commercial Vehicle Safety Alliance are adopted in Minnesota.\nNo intrastate carrier, private carrier engaged in intrastate commerce, or person providing intrastate transportation service described in section 221.025 shall operate a commercial motor vehicle in Minnesota while a motor carrier out-of-service order issued by the Federal Motor Carrier Safety Administration under Code of Federal Regulations, title 49, part 385 or 386, is in effect.\nThe state of Minnesota, a political subdivision of the state, or any person required to comply with the alcohol and controlled substances testing requirements of Code of Federal Regulations, title 49, part 219, 382, 653, or 654, is exempt from sections 181.950 to 181.957 if the testing also complies with the procedures for transportation workplace drug and alcohol testing programs in Code of Federal Regulations, title 49, part 40.",
	"repealed": false
}