{
	"id": "163.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.07",
	"title": "163.07 COUNTY HIGHWAY ENGINEER.",
	"text": "The county board of each county shall appoint and employ, as hereinafter provided, a county highway engineer who may have charge of the highway work of the county and the forces employed thereon, and who shall make and prepare all surveys, estimates, plans, and specifications which are required of the engineer. The county highway engineer may be removed by the county board during the term of office for which appointed only for incompetency or misconduct shown after a hearing upon due notice and upon stated charges. The burden of proving incompetency or misconduct shall rest upon the party alleging the same.\nThe county highway engineer shall be a registered highway or civil engineer, registered under the laws of the state of Minnesota. The county board may appoint a new county engineer for a term of only one year. All reappointments shall be for a term of four years, and shall be made in May of the year in which the term expires. The county highway engineer's salary shall be fixed by the county board and shall be payable the same as other county officers are paid. The salary shall not be reduced during the county highway engineer's term of office.\nNotwithstanding the provisions of subdivision 2 as to the term of office of the county highway engineer, the county board of any county may reappoint a county highway engineer for a term of office less than four years when such county highway engineer to be reappointed will reach the age of mandatory retirement within the normal four-year term provided for in subdivision 2.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\nThe commissioner of management and budget shall allocate a state civil service classification to any city or county highway engineer, or an engineer of any other governmental agency as may be from time to time requested by the commissioner of transportation. The allocation shall be made on the same basis and subject to the same provisions of law as pertain to engineering and similar positions in the state classified service. The commissioner of management and budget shall give consideration to the education, professional attainments and experience of the city, county highway engineer, or engineer of any other governmental agency for purposes of transfer to the state service. All city, county highway engineers, or engineers of any other governmental agency who have not less than two years service prior to the transfer may be transferred to the state classification so allocated without examination, but subject to a six months probationary period, in the state classified service. The commissioner of management and budget shall establish procedure for the transfer.\nThe commissioner of transportation may certify any city or county highway engineer that the commissioner may deem qualified to the commissioner of management and budget as eligible to take any specific promotional examination held for civil engineer or civil engineering aid as classified by the state civil service commission. The service rating of such engineer shall include past service with the state and as city or county highway engineer, if the engineer had prior service with the state Transportation Department as a supervisory engineer.\nThe county highway engineer shall devote the entire time to official duties and, before entering upon the duties of office, give bond to the state in the penal sum of $25,000, to be approved and filed in the same manner as are the bonds of the other county officers. All premiums for the bond shall be paid by the county. The state, the several governmental subdivisions thereof, or any person damaged by any wrongful act or omission of the county highway engineer in the performance of official duties may maintain an action on the bond for the recovery of the damages so sustained.\nThe county highway engineer shall prepare and submit to the county board annually a full and complete report covering all county highway work, and shall prepare and submit such other reports relating to the county highway system as the county board directs.\nMS 1967 [Repealed, 1969 c 304 s 2]\nIn lieu of appointing and employing a county highway engineer in accordance with the provisions of this section, a county may contract for the services of a county highway engineer with a county that appoints and employs such an engineer upon such terms as are mutually agreed upon. An engineer acting as a county highway engineer under contract for a county shall exercise every duty and responsibility imposed by law upon a county highway engineer. A copy of each contract executed between counties under this subdivision shall be filed in the office of the commissioner of transportation.\nThis subdivision shall not apply to any county containing a city of the first class.",
	"repealed": false
}