{
	"id": "144G.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.90",
	"title": "144G.90 REQUIRED NOTICES.",
	"text": "(a) An assisted living facility must provide the resident a written notice of the rights under section 144G.91 before the initiation of services to that resident. The facility shall make all reasonable efforts to provide notice of the rights to the resident in a language the resident can understand.\n(b) In addition to the text of the assisted living bill of rights in section 144G.91, the notice shall also contain the following statement describing how to file a complaint or report suspected abuse:\n\"If you want to report suspected abuse, neglect, or financial exploitation, you may contact the Minnesota Adult Abuse Reporting Center (MAARC). If you have a complaint about the facility or person providing your services, you may contact the Office of Health Facility Complaints, Minnesota Department of Health. If you would like to request advocacy services, you may contact the Office of Ombudsman for Long-Term Care or the Office of Ombudsman for Mental Health and Developmental Disabilities.\"\n(c) The statement must include contact information for the Minnesota Adult Abuse Reporting Center and the telephone number, website address, email address, mailing address, and street address of the Office of Health Facility Complaints at the Minnesota Department of Health, the Office of Ombudsman for Long-Term Care, and the Office of Ombudsman for Mental Health and Developmental Disabilities. The statement must include the facility's name, address, email, telephone number, and name or title of the person at the facility to whom problems or complaints may be directed. It must also include a statement that the facility will not retaliate because of a complaint.\n(d) A facility must obtain written acknowledgment from the resident of the resident's receipt of the assisted living bill of rights or shall document why an acknowledgment cannot be obtained. Acknowledgment of receipt shall be retained in the resident's record.\nA facility must provide all notices in plain language that residents can understand and make reasonable accommodations for residents who have communication disabilities and those whose primary language is a language other than English.\nAn assisted living facility with dementia care shall make available in written or electronic form, to residents and families or other persons who request it, a description of the training program and related training it provides, including the categories of employees trained, the frequency of training, and the basic topics covered. A hard copy of this notice must be provided upon request.\nA facility shall provide each resident with identifying and contact information about the persons who can assist with health care or supportive services being provided. A facility shall keep each resident informed of changes in the personnel referenced in this subdivision.\n(a) A facility must provide written notice to the resident, legal representative, or designated representative of a change of ownership within seven calendar days after the facility receives a new license.\n(b) A facility must provide prompt written notice to the resident, legal representative, or designated representative, of any change of legal name, telephone number, and physical mailing address, which may not be a public or private post office box, of:\n(1) the manager of the facility, if applicable; and\n(2) the authorized agent.\nFor any notice to a resident, legal representative, or designated representative provided under this chapter or under Minnesota Rules, chapter 4659, that is required to include information regarding the Office of Ombudsman for Long-Term Care and the Office of Ombudsman for Mental Health and Developmental Disabilities, the notice must contain the following language: \"You may contact the Ombudsman for Long-Term Care for questions about your rights as an assisted living facility resident and to request advocacy services. As an assisted living facility resident, you may contact the Ombudsman for Mental Health and Developmental Disabilities to request advocacy regarding your rights, concerns, or questions on issues relating to services for mental health, developmental disability, or substance use disorder.\"",
	"repealed": false
}