{
	"id": "299F.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.51",
	"title": "299F.51 REQUIREMENTS FOR CARBON MONOXIDE ALARMS.",
	"text": "(a) Every single-family dwelling and every dwelling unit in a multifamily dwelling must have an approved and operational carbon monoxide alarm installed within ten feet of each room lawfully used for sleeping purposes.\n(b) Every guest room in a hotel or lodging house must have an approved and operational carbon monoxide alarm installed in each room lawfully used for sleeping purposes.\n(a) The owner of a multifamily dwelling unit which is required to be equipped with one or more approved carbon monoxide alarms must:\n(1) provide and install one approved and operational carbon monoxide alarm within ten feet of each room lawfully used for sleeping; and\n(2) replace any required carbon monoxide alarm that has been stolen, removed, found missing, or rendered inoperable during a prior occupancy of the dwelling unit and which has not been replaced by the prior occupant prior to the commencement of a new occupancy of a dwelling unit.\n(b) The owner of a hotel or lodging house that is required to be equipped with one or more approved carbon monoxide alarms must:\n(1) provide and install one approved and operational carbon monoxide alarm in each room lawfully used for sleeping; and\n(2) replace any required carbon monoxide alarm that has been stolen, removed, found missing, or rendered inoperable during a prior occupancy and that has not been replaced by the prior occupant prior to the commencement of a new occupancy of a hotel guest room or lodging house.\nThe occupant of each dwelling unit in a multifamily dwelling in which an approved and operational carbon monoxide alarm has been provided and installed by the owner must:\n(1) keep and maintain the device in good repair; and\n(2) replace any device that is stolen, removed, missing, or rendered inoperable during the occupancy of the dwelling unit.\nNo person shall remove batteries from, or in any way render inoperable, a required carbon monoxide alarm.\n(a) In lieu of requirements of subdivision 1, multifamily dwellings may have approved and operational carbon monoxide detectors installed between 15 and 25 feet of carbon monoxide-producing central fixtures and equipment, provided there is a centralized alarm system or other mechanism for responsible parties to hear the alarm at all times.\n(b) An owner of a multifamily dwelling that contains minimal or no sources of carbon monoxide may be exempted from the requirements of subdivision 1, provided that such owner certifies to the commissioner of public safety that such multifamily dwelling poses no foreseeable carbon monoxide risk to the health and safety of the dwelling units.\n(c) The requirements of this section do not apply to facilities owned or operated by the state of Minnesota.\nA first violation of this section shall not result in a penalty, but is punishable by a safety warning. A second or subsequent violation is a petty misdemeanor.",
	"repealed": false
}