{
	"id": "330.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/330.11",
	"title": "330.11 APPLICATION BY NONRESIDENT.",
	"text": "A resident of another state which issues auctioneers' licenses to citizens of the state of Minnesota on the same or similar basis as to citizens of such state may be licensed as an auctioneer in the state of Minnesota upon compliance with the laws of the state of Minnesota relating to auctioneers' licenses. Eligibility of a nonresident applicant shall be tested by reference to the law of the resident state, and in no case shall it be tested by reference to the law of some other state having reciprocity with the state of Minnesota in which the nonresident may qualify.\nA nonresident applicant must submit to the county auditor with the application a duly certified copy of the applicant's auctioneer's license, if one was issued by the resident state, and a copy of the state auction laws such as exist in the resident state, certified by the secretary of state or other authorized state official of such state, that the submitted copy is a true copy of the auction laws of such state, as they exist at the date of application, in order that the attorney general of the state of Minnesota may determine whether reciprocity exists.\nIf, subsequent to the issuance of a nonresident license, the laws of the state of such nonresident shall not be reciprocal with the state of Minnesota, it shall result in the automatic revocation of the nonresident auctioneer's license issued to any resident of such state under the provisions of this chapter.\nEvery nonresident applicant shall file an irrevocable consent that suits and actions may be commenced against such applicant in any court of competent jurisdiction in this state by the service on the secretary of state of any summons, process, or pleadings authorized by the laws of the state of Minnesota. This consent shall stipulate that the service of such process or pleadings on the secretary of state shall be taken and held in all courts to be as valid and binding as if due service had been made upon the applicant in the state of Minnesota. In case any summons, process, or pleadings are served upon the secretary of state, it shall be according to section 5.25.",
	"repealed": false
}