{
	"id": "617.246",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.246",
	"title": "617.246 USE OF MINORS IN SEXUAL PERFORMANCE PROHIBITED.",
	"text": "(a) For the purpose of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Minor\" means any person under the age of 18.\n(c) \"Promote\" means to produce, direct, publish, manufacture, issue, or advertise.\n(d) \"Sexual performance\" means any play, dance or other exhibition presented before an audience or for purposes of visual or mechanical reproduction that uses a minor to depict actual or simulated sexual conduct as defined by clause (e).\n(e) \"Sexual conduct\" means any of the following:\n(1) an act of sexual intercourse, normal or perverted, including genital-genital, anal-genital, or oral-genital intercourse, whether between human beings or between a human being and an animal;\n(2) sadomasochistic abuse, meaning flagellation, torture, or similar demeaning acts inflicted by or upon a person who is nude or clad in undergarments or in a revealing costume, or the condition of being fettered, bound or otherwise physically restrained on the part of one so clothed;\n(3) masturbation;\n(4) lewd exhibitions of the genitals; or\n(5) physical contact with the clothed or unclothed pubic areas or buttocks of a human male or female, or the breasts of the female, whether alone or between members of the same or opposite sex or between humans and animals in an act of apparent sexual stimulation or gratification.\n(f) \"Pornographic work\" means:\n(1) an original or reproduction of a picture, film, photograph, negative, slide, videotape, videodisc, or drawing of a sexual performance involving a minor; or\n(2) any visual depiction, including any photograph, film, video, picture, drawing, negative, slide, or computer-generated image or picture, whether made or produced by electronic, mechanical, or other means that:\n(i) uses a minor to depict actual or simulated sexual conduct;\n(ii) has been created, adapted, or modified to appear that an identifiable minor is engaging in sexual conduct; or\n(iii) is advertised, promoted, presented, described, or distributed in such a manner that conveys the impression that the material is or contains a visual depiction of a minor engaging in sexual conduct.\nFor the purposes of this paragraph, an identifiable minor is a person who was a minor at the time the depiction was created or altered, whose image is used to create the visual depiction.\n(a) It is unlawful for a person to promote, employ, use or permit a minor to engage in or assist others to engage minors in posing or modeling alone or with others in any sexual performance or pornographic work if the person knows or has reason to know that the conduct intended is a sexual performance or a pornographic work.\nAny person who violates this paragraph is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both.\n(b) A person who violates paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $40,000, or both, if:\n(1) the person has a prior conviction or delinquency adjudication for violating this section or section 617.247;\n(2) the violation occurs when the person is a registered predatory offender under section 243.166; or\n(3) the violation involved a minor under the age of 14 years.\n(a) A person who owns or operates a business in which a pornographic work, as defined in this section, is disseminated to an adult or a minor or is reproduced, and who knows the content and character of the pornographic work disseminated or reproduced, is guilty of a felony and may be sentenced to imprisonment for not more than ten years, or to payment of a fine of not more than $20,000, or both.\n(b) A person who violates paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $40,000, or both, if:\n(1) the person has a prior conviction or delinquency adjudication for violating this section or section 617.247;\n(2) the violation occurs when the person is a registered predatory offender under section 243.166; or\n(3) the violation involved a minor under the age of 14 years.\n(a) A person who, knowing or with reason to know its content and character, disseminates for profit to an adult or a minor a pornographic work, as defined in this section, is guilty of a felony and may be sentenced to imprisonment for not more than ten years, or to payment of a fine of not more than $20,000, or both.\n(b) A person who violates paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $40,000, or both, if:\n(1) the person has a prior conviction or delinquency adjudication for violating this section or section 617.247;\n(2) the violation occurs when the person is a registered predatory offender under section 243.166; or\n(3) the violation involved a minor under the age of 14 years.\nNeither consent to sexual performance by a minor or the minor's parent, guardian, or custodian nor mistake as to the minor's age is a defense to a charge of violation of this section.\nIt shall be an affirmative defense to a charge of violating this section that the sexual performance or pornographic work was produced using only persons who were 18 years or older.\nNotwithstanding the statutory maximum sentence otherwise applicable to the offense or any provision of the sentencing guidelines, when a court commits a person to the custody of the commissioner of corrections for violating this section, the court shall provide that after the person has been released from prison, the commissioner shall place the person on conditional release for five years. If the person has previously been convicted of a violation of this section, section 609.342, 609.343, 609.344, 609.345, 609.3451, 609.3453, or 617.247, or any similar statute of the United States, this state, or any state, the commissioner shall place the person on conditional release for 15 years. The terms of conditional release are governed by section 609.3455, subdivision 8.",
	"repealed": false
}