{
	"id": "153.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/153.21",
	"title": "153.21 MENTAL EXAMINATION; ACCESS TO MEDICAL DATA.",
	"text": "If the board has probable cause to believe that a doctor of podiatric medicine falls within the provisions of section 153.19, subdivision 1, clause (12), it may direct the doctor to submit to a mental or physical examination or substance use disorder evaluation. For the purpose of this subdivision, a doctor of podiatric medicine licensed under this chapter is considered to have consented to submit to a mental or physical examination when directed in writing by the board and further to have waived all objections to the admissibility of the examiner's testimony or examination reports on the ground that the same constitute a privileged communication. Failure of a podiatrist to submit to an examination when directed constitutes an admission of the allegations against the podiatrist, unless the failure was due to circumstance beyond the podiatrist's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A podiatrist affected under this subdivision shall at reasonable intervals be given an opportunity to demonstrate that the podiatrist can resume the competent practice of podiatric medicine with reasonable skill and safety to patients. In any proceeding under this subdivision, neither the record of proceedings nor the orders entered by the board shall be used against a podiatrist in any other proceeding.\nIn addition to ordering a physical or mental examination or substance use disorder evaluation, the board may, notwithstanding section 13.384, 144.651, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the licensee's or applicant's consent if the board has probable cause to believe that a doctor of podiatric medicine falls within the provisions of section 153.19, subdivision 1, clause (12). The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (h), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this section and is not liable in any action for damages for releasing the data requested by the board if the data are released in accordance with a written request under this section, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false.",
	"repealed": false
}