{
	"id": "53B.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.44",
	"title": "53B.44 CHANGE OF KEY INDIVIDUALS; NOTICE AND INFORMATION REQUIREMENTS.",
	"text": "(a) A licensee that adds or replaces any key individual must:\n(1) provide notice, in a manner prescribed by the commissioner, within 15 days after the effective date of the key individual's appointment; and\n(2) provide the information required under section 53B.39 within 45 days of the effective date of the key individual's appointment.\n(b) Within 90 days of the date on which the notice provided under paragraph (a) was determined to be complete, the commissioner may issue a notice of disapproval of a key individual if the commissioner finds that the competence, business experience, character, or integrity of the individual is not in the best interests of the public or the customers of the licensee.\n(c) A notice of disapproval must contain a statement of the basis for disapproval and must be sent to the licensee and the disapproved individual. A licensee may appeal a notice of disapproval pursuant to chapter 14 within 30 days of the date the notice of disapproval is received.\n(d) If the notice provided under paragraph (a) is not disapproved within 90 days after the date on which the notice was determined to be complete, the key individual is deemed approved.\n(e) If a multistate licensing process includes a key individual notice review and disapproval process under this section and the licensee avails itself of or is otherwise subject to the multistate licensing process:\n(1) the commissioner is authorized to accept the determination of another state if the investigating state has sufficient staffing, expertise, and minimum standards for the purposes of this section; or\n(2) if Minnesota is a lead investigative state, the commissioner is authorized to investigate the applicant under paragraph (b) and the time frames established by agreement through the multistate licensing process.",
	"repealed": false
}