{
	"id": "290.0683",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0683",
	"title": "290.0683 MINNESOTA HOUSING TAX CREDIT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Agency\" means the Minnesota Housing Finance Agency.\n(c) \"Minnesota housing tax credit contribution account\" or \"account\" means the account established in section 462A.40.\n(d) \"Qualified project\" means a project that qualifies for a grant or loan under section 462A.40.\n(e) \"Taxpayer\" means a taxpayer as defined in section 290.01, subdivision 6, or a taxpayer as defined in section 297I.01, subdivision 16.\n(a) A taxpayer is allowed a credit against the tax imposed under this chapter or the premiums tax under chapter 297I for contributions of no less than $1,000 and no more than $2,000,000 to the Minnesota housing tax credit contribution account. The credit equals 85 percent of the amount the taxpayer contributed to the account during the taxable year.\n(b) The credit may be claimed only after certification by the agency as provided in subdivision 3.\n(c) To receive the credit, a taxpayer must claim the credit in the manner prescribed by the commissioner and file with the return a copy of the credit certificate issued by the agency under subdivision 3, paragraph (c).\n(d) The taxpayer must claim the credit for the taxable year in which the contribution payment is received by the account.\n(e) If the amount of the credit under this section exceeds the taxpayer's liability for tax under this chapter, the excess is a credit carryover to each of the ten succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit that may be added under this paragraph may not exceed the taxpayer's liability for tax, less any credit for the current taxable year.\n(f) The contribution amount used to calculate the credit under this section may not be used to calculate any other state income tax deduction or credit allowed by law.\n(g) For nonresidents and part-year residents, the credit must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\n(a) To qualify for the credit, a taxpayer must contribute to the Minnesota housing tax credit contribution account. A taxpayer may indicate that a contribution is intended for a specific qualified project. A taxpayer is prohibited from contributing to certain projects as provided in section 462A.40, subdivision 3.\n(b) The aggregate amount of tax credits allowed to all eligible contributors is limited to $9,900,000 annually.\n(c) Within 30 days after a taxpayer contributes to the account, the agency must file with the contributing taxpayer a credit certificate statement or return any amounts to the taxpayer as provided in this paragraph. The agency must send a copy of the credit certificate to the commissioner. If there are insufficient credits to match the contribution, the agency must not issue a credit certificate for the amount of the contribution for which there are insufficient credits, and must return that amount to the taxpayer before issuing any credit certificate.\n(d) The credit certificate must state the dollar amount of the contribution made by the taxpayer and the date the payment was received by the account, and indicate if the contribution was intended for a specific qualified project.\nCredits granted to a partnership, a limited liability company taxed as a partnership, an S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each partner, member, shareholder, or owner based on their share of the entity's assets or as specially allocated in their organizational documents or any other executed document, as of the last day of the taxable year.\n(a) Credits claimed under this section are not subject to recapture.\n(b) If a grant or loan made under section 462A.40 is canceled or recaptured, the grant or loan is returned to the account. The agency is not required to return contributions to taxpayers who indicated that a contribution was intended for a project for which the loan or grant is recaptured or canceled.\nNotwithstanding the credit certificate issued by the commissioner of the Minnesota Housing Finance Agency under subdivision 3, the commissioner may use any audit and examination powers under chapter 270C or 289A to the extent necessary to verify that the taxpayer is eligible for the credit and to assess for the amount of any improperly claimed credit.\nThis section expires after December 31, 2028, except that the agency's authority to issue credit certificates under subdivision 3 based on contributions received before January 1, 2029, and allocation certificates that were issued before February 1, 2029, remains in effect through January 1, 2030. The reporting requirements in section 462A.40, subdivision 5, remain in effect through the year following the year in which all allocation certificates have either been canceled or resulted in issuance of credit certificates, or January 1, 2031, whichever is earlier. The expiration of this section does not affect the commissioner's authority to audit or power of examination and assessment for credits claimed under this section.\nBeginning in fiscal year 2023, $100,000 is annually appropriated from the general fund to the commissioner of revenue for a transfer to the Minnesota Housing Finance Agency for costs associated with personnel and administrative expenses related to administering the credit. This subdivision expires on June 30, 2028.",
	"repealed": false
}