{
	"id": "299C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.10",
	"title": "299C.10 IDENTIFICATION DATA REQUIRED.",
	"text": "(a) Sheriffs, peace officers, and community corrections agencies operating secure juvenile detention facilities shall take or cause to be taken immediately fingerprints and thumbprints, photographs, distinctive physical mark identification data, information on any known aliases or street names, and other identification data requested or required by the superintendent of the bureau, of the following:\n(1) persons arrested for, appearing in court on a charge of, or convicted of a felony, gross misdemeanor, or targeted misdemeanor;\n(2) juveniles arrested for, appearing in court on a charge of, adjudicated delinquent for, or alleged to have committed felonies or gross misdemeanors as distinguished from those committed by adult offenders;\n(3) adults and juveniles admitted to jails or detention facilities;\n(4) persons reasonably believed by the arresting officer to be fugitives from justice;\n(5) persons in whose possession, when arrested, are found concealed firearms or other dangerous weapons, burglar tools or outfits, high-power explosives, or articles, machines, or appliances usable for an unlawful purpose and reasonably believed by the arresting officer to be intended for such purposes;\n(6) juveniles referred by a law enforcement agency to a diversion program for a felony or gross misdemeanor offense; and\n(7) persons currently involved in the criminal justice process, on probation, on parole, or in custody for any offense whom the superintendent of the bureau identifies as being the subject of a court disposition record which cannot be linked to an arrest record, and whose fingerprints are necessary to reduce the number of suspense files, or to comply with the mandates of section 299C.111, relating to the reduction of the number of suspense files. This duty to obtain fingerprints for the offenses in suspense at the request of the bureau shall include the requirement that fingerprints be taken in post-arrest interviews, while making court appearances, while in custody, or while on any form of probation, diversion, or supervised release.\n(b) Unless the superintendent of the bureau requires a shorter period, within 24 hours of taking the fingerprints and data, the fingerprint records and other identification data specified under paragraph (a) must be electronically entered into a bureau-managed searchable database in a manner as may be prescribed by the superintendent.\n(c) Prosecutors, courts, and probation officers and their agents, employees, and subordinates shall attempt to ensure that the required identification data is taken on a person described in paragraph (a). Law enforcement may take fingerprints of an individual who is presently on probation.\n(d) Fingerprints and thumbprints must be obtained no later than:\n(1) release from booking; or\n(2) if not booked prior to acceptance of a plea of guilty or not guilty.\nPrior to acceptance of a plea of guilty or not guilty, an individual's finger and thumb prints must be submitted to the Bureau of Criminal Apprehension for the offense. If finger and thumb prints have not been successfully received by the bureau, an individual may, upon order of the court, be taken into custody for no more than eight hours so that the taking of prints can be completed. Upon notice and motion of the prosecuting attorney, this time period may be extended upon a showing that additional time in custody is essential for the successful taking of prints.\n(e) For purposes of this section, a targeted misdemeanor is a misdemeanor violation of section 169A.20 (driving while impaired), 518B.01 (order for protection violation), 609.224 (fifth-degree assault), 609.2242 (domestic assault), 609.746 (interference with privacy), 609.748 (harassment or restraining order violation), 609.79 (obscene or harassing telephone calls), 617.23 (indecent exposure), or 629.75 (domestic abuse no contact order).\nThe superintendent of the bureau shall inform a prosecuting authority that a person prosecuted by that authority is the subject of a court disposition record in suspense which requires fingerprinting under this section. Upon being notified by the superintendent or otherwise learning of the suspense status of a court disposition record, any prosecuting authority may bring a motion in district court to compel the taking of the person's fingerprints upon a showing to the court that the person is the subject of the court disposition record in suspense.\nThe sheriffs and police officers who take finger and thumb prints must obtain training in the proper methods of taking and transmitting fingerprints under this section consistent with bureau requirements.\nThe bureau must convert into an electronic format for entry in the criminal records system fingerprints, thumbprints, and other identification data within three business days after they are received under this section if the fingerprints, thumbprints, and other identification data were not electronically entered by a criminal justice agency.\nThe superintendent shall collect a fee in an amount to cover the expense for each background check provided for a purpose not directly related to the criminal justice system or required by section 624.7131, 624.7132, or 624.714. The proceeds of the fee must be deposited in a special account. Money in the account is annually appropriated to the commissioner to maintain and improve the quality of the criminal record system in Minnesota. The superintendent shall collect an additional handling fee of $7 for FBI background fingerprint checks.\nThe superintendent may charge a fee of $10 to take fingerprints for the public when required by an employer or government entity for either employment or licensing. No fee will be charged when there is a question whether the person is the subject of a criminal history record. The proceeds of the fee must be deposited in an account in the special revenue fund. Money in the account is annually appropriated to the commissioner to maintain and improve the quality of the criminal record system in Minnesota.",
	"repealed": false
}