{
	"id": "125A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.65",
	"title": "125A.65 ATTENDANCE AT ACADEMIES FOR THE DEAF AND BLIND.",
	"text": "Responsibility for special instruction and services for a blind/visually impaired or deaf/hard-of-hearing child attending the Minnesota State Academy for the Deaf or the Minnesota State Academy for the Blind must be determined in subdivisions 2 to 10.\nThe legal residence of the child is the district in which the child's parent or guardian resides.\n(a) When it is determined pursuant to section 125A.69, subdivision 1 or 2, that the child is entitled to attend either school, the board of the Minnesota State Academies must provide the appropriate educational program for the child.\n(b) For fiscal year 2006, the board of the Minnesota State Academies must make a tuition charge to the child's district of residence for the cost of providing the program. The amount of tuition charged must not exceed the sum of (1) the general education revenue formula allowance times the pupil unit weighting factor pursuant to section 126C.05 for that child, for the amount of time the child is in the program, plus (2), if the child was enrolled at the Minnesota State Academies on October 1 of the previous fiscal year, the compensatory education revenue attributable to that child under section 126C.10, subdivision 3. The district of the child's residence must pay the tuition and may claim general education aid for the child. Tuition received by the board of the Minnesota State Academies, except for tuition for compensatory education revenue under this paragraph and tuition received under subdivision 4, must be deposited in the state treasury as provided in subdivision 8.\n(c) For fiscal year 2007 and later, the district of the child's residence shall claim general education revenue for the child, except as provided in this paragraph. Notwithstanding section 127A.47, subdivision 1, an amount equal to the general education revenue formula allowance times the pupil unit weighting factor pursuant to section 126C.05 for that child for the amount of time the child is in the program, as adjusted according to subdivision 8, paragraph (d), must be paid to the Minnesota State Academies. Notwithstanding section 126C.15, subdivision 2, paragraph (d), the compensatory education revenue under section 126C.10, subdivision 3, attributable to children enrolled at the Minnesota State Academies on October 1 of the previous fiscal year must be paid to the Minnesota State Academies. General education aid paid to the Minnesota State Academies under this paragraph must be credited to their general operation account. Other general education aid attributable to the child must be paid to the district of the child's residence.\n(a) For fiscal year 2006, in addition to the tuition charge allowed in subdivision 3, the academies may charge the child's district of residence for the academy's unreimbursed cost of providing an instructional aide assigned to that child, after deducting the special education aid under section 125A.76, attributable to the child, if that aide is required by the child's individualized education program. Tuition received under this paragraph must be used by the academies to provide the required service.\n(b) For fiscal year 2008 and later, the special education aid paid to the academies shall be increased by the academy's unreimbursed cost of providing one to one instructional and behavioral management aides assigned to a child, after deducting the special education aid under section 125A.76 attributable to the child, if the aides are required by the child's individualized education program. Aid received under this paragraph must be used by the academies to provide the required service.\n(c) For fiscal year 2008 and later, the special education aid paid to the district of the child's residence shall be reduced by the amount paid to the academies for district residents under paragraph (b).\n(d) Notwithstanding section 127A.45, subdivision 3, beginning in fiscal year 2008, the commissioner shall make an estimated final adjustment payment to the Minnesota State Academies for general education aid and special education aid for the prior fiscal year by August 15.\n(e) For fiscal year 2007, the academies may retain receipts received through mutual agreements with school districts for one to one behavior management aides.\nWhen it is determined that the child can benefit from public school enrollment but that the child should also remain in attendance at the applicable school, the district where the institution is located must provide an appropriate educational program for the child and must make a tuition charge to the board of the Minnesota State Academies for the actual cost of providing the program, less any amount of aid received pursuant to section 125A.75. The board of the Minnesota State Academies must pay the tuition and other program costs including the unreimbursed transportation costs. Aids for children with a disability must be paid to the district providing the special instruction and services. Special transportation must be provided by the district providing the educational program and the state must reimburse that district within the limits provided by law.\nNotwithstanding the provisions of subdivisions 3 and 5, the board of the Minnesota State Academies may agree to make a tuition charge, or receive an aid adjustment, as applicable, for less than the amount specified in subdivision 3 for pupils attending the applicable school who are residents of the district where the institution is located and who do not board at the institution, if that district agrees to make a tuition charge to the board of the Minnesota State Academies for less than the amount specified in subdivision 5 for providing appropriate educational programs to pupils attending the applicable school.\nNotwithstanding the provisions of subdivisions 3 and 5, the board of the Minnesota State Academies may agree to supply staff from the Minnesota State Academy for the Deaf and the Minnesota State Academy for the Blind to participate in the programs provided by the district where the institutions are located when the programs are provided to students in attendance at the state schools.\n(a) On May 1, 1996, and each year thereafter, the board of the Minnesota State Academies shall count the actual number of Minnesota resident special education eligible students enrolled and receiving education services at the Minnesota State Academy for the Deaf and the Minnesota State Academy for the Blind.\n(b) For fiscal year 2006, the board of the Minnesota State Academies shall deposit in the state treasury an amount equal to all tuition received for the basic revenue according to subdivision 3, less the amount calculated in paragraph (c).\n(c) For fiscal year 2006, the Minnesota State Academies shall credit to their general operation account an amount equal to the tuition received which represents tuition earned for the total number of students over 175 based on:\n(1) the total number of enrolled students on May 1 less 175; times\n(2) the ratio of the number of students in that grade category to the total number of students on May 1; times\n(3) the general education revenue formula allowance; times\n(4) the pupil unit weighting factor pursuant to section 126C.05.\n(d) For fiscal year 2007 and later, the Minnesota State Academies shall report to the department the number of students by grade level counted according to paragraph (a). The amount paid to the Minnesota State Academies under subdivision 3, paragraph (c), must be reduced by an amount equal to:\n(1) the ratio of 175 to the total number of students on May 1; times\n(2) the total basic revenue determined according to subdivision 3, paragraph (c).\nThe sum provided by the calculation in subdivision 8 must be deposited in the state treasury and credited to the general operation account of the Minnesota State Academy for the Deaf and the Minnesota State Academy for the Blind.\nThere is annually appropriated to the department for the Minnesota State Academies the tuition or aid payment amounts received and credited to the general operation account of the academies under this section. A balance in an appropriation under this paragraph does not cancel but is available in successive fiscal years.\nThe Minnesota State Academies must seek reimbursement under section 125A.21 from third parties for the cost of services provided by the Minnesota State Academies whenever the services provided are otherwise covered by a child's public or private health plan.",
	"repealed": false
}