{
	"id": "296A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.18",
	"title": "296A.18 APPORTIONMENT OF TAX; DEPOSIT OF PROCEEDS.",
	"text": "All gasoline received in this state and all gasoline produced in or brought into this state except aviation gasoline and marine gasoline shall be determined to be intended for use in motor vehicles in this state.\nApproximately 1-1/2 percent of all gasoline received in this state and 1-1/2 percent of all gasoline produced or brought into this state, except gasoline used for aviation purposes, is being used as fuel for the operation of motorboats on the waters of this state and of the total revenue derived from the imposition of the gasoline fuel tax for uses other than for aviation purposes, 1-1/2 percent of the revenue is the amount of tax on fuel used in motorboats operated on the waters of this state. The amount of unrefunded tax paid on gasoline used for motor boat purposes as computed in this chapter shall be paid into the state treasury and credited to a water recreation account in the special revenue fund for acquisition, development, maintenance, and rehabilitation of sites for public access and boating facilities on public waters; lake and river improvement; and boat and water safety.\nApproximately one percent of all gasoline received in and produced or brought into this state, except gasoline used for aviation purposes, is being used as fuel for the operation of snowmobiles in this state, and of the total revenue derived from the imposition of the gasoline fuel tax for uses other than for aviation purposes, one percent of such revenues is the amount of tax on fuel used in snowmobiles operated in this state.\nApproximately 0.27 of one percent of all gasoline received in or produced or brought into this state, except gasoline used for aviation purposes, is being used for the operation of all-terrain vehicles in this state, and of the total revenue derived from the imposition of the gasoline fuel tax, 0.27 of one percent is the amount of tax on fuel used in all-terrain vehicles operated in this state.\nApproximately 0.046 of one percent of all gasoline received or produced in or brought into this state, except gasoline used for aviation purposes, is being used for the operation of off-highway motorcycles in this state, and of the total revenue derived from the imposition of the gasoline fuel tax for uses other than for aviation purposes, 0.046 of one percent is the amount of tax on fuel used in off-highway motorcycles operated in this state.\nApproximately 0.164 of one percent of all gasoline received or produced in or brought into this state, except gasoline used for aviation purposes, is being used for the off-road operation of off-road vehicles, as defined in section 84.797, in this state, and of the total revenue derived from the imposition of the gasoline fuel tax for uses other than aviation purposes, 0.164 of one percent is the amount of tax on fuel used for off-road operation of off-road vehicles in this state.\nThe nonhighway use amounts determined in subdivisions 2 to 6 must be transferred from the highway user tax distribution fund to the accounts as provided for in sections 84.794, 84.803, 84.83, 84.927, and 86B.706. These amounts, together with interest and penalties for delinquency in payment, paid or collected pursuant to the provisions of this chapter, must be computed for each six-month period ending June 30 and December 31 and must be transferred on November 1 and April 1 following each six-month period.\nApproximately 0.116 percent of the total annual unrefunded revenue from the gasoline fuel tax on all gasoline and special fuel received in, produced, or brought into this state, except gasoline and special fuel used for aviation purposes, is derived from the operation of motor vehicles on state forest roads and county forest access roads. This revenue, together with interest and penalties for delinquency in payment, paid or collected pursuant to the provisions of this chapter, is appropriated from the highway user tax distribution fund and must be transferred and credited in equal installments on July 1 and January 1 to the state forest road account established in section 89.70. Of this amount, 0.0605 percent is annually derived from motor vehicles operated on state forest roads and 0.0555 percent is annually derived from motor vehicles operated on county forest access roads in this state. An amount equal to 0.0555 percent of the unrefunded revenue must be annually transferred to counties for the management and maintenance of county forest roads.\nThe revenues derived from the excise taxes on aviation gasoline and on special fuel received, sold, stored, or withdrawn from storage as substitutes for aviation gasoline, shall be paid into the state treasury and credited to the state airports fund. There is hereby appropriated such sums as are needed to carry out the provisions of this subdivision.\n[Repealed, 2011 c 112 art 9 s 6]",
	"repealed": false
}