{
	"id": "66A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.07",
	"title": "66A.07 MEMBERSHIP; MEETINGS; NOTICES; VOTING.",
	"text": "Every policyholder in a mutual insurance company, other than a life insurance company, shall be a member thereof while the policy is in force, entitled to one vote for each policy held, and notified of the time and place of holding its meetings either personally or by imprint upon the front or back of every policy, or in the premium notice, receipt or certificate of renewal, substantially as follows:\n\"NOTICE OF ANNUAL MEETING\nThe policyholder named herein is hereby notified: while this policy is in force you are by virtue thereof a member of the (name of company) and that the annual meeting of said company is held at its home office at (address) on the ..... day of ..... each year at ..... o'clock ...... m.\"\nNotice given in this manner is deemed to comply with the requirements of section 302A.435.\n(a) Unless otherwise approved by the commissioner of commerce, a domestic mutual life insurance company member is any person who is listed on the records of the company as the owner of an in-force policy, and each member is entitled to one vote regardless of the number of policies owned by the member or the amounts of coverage provided to the member. For purposes of this section, \"policy\" means a policy or contract of insurance, including an annuity contract issued by the company, but excluding individual noncontributory insurance policies for which the premiums are paid by a financial institution, association, employer, or other institutional entity. Except as otherwise provided in the company's certificate or bylaws, a person covered under a group policy is not a member by virtue of such coverage, except that a person insured under a group life insurance policy is a member if: (1) the person is insured under a group life policy under which cash value has accumulated and some cash value is allocated to the insured person; and (2) the group policyholder makes no contribution to the premiums or deposits for the policy.\n(b) Every member of a mutual life insurance company must be notified of its annual meetings by a written notice mailed to the member's address, or by an imprint on the front or back of the policy, premium notice, receipt, or certificate of renewal, substantially as follows:\n\"The policy owner is hereby notified that by virtue of his or her ownership of this policy, the policy owner is a member of the .......... Insurance Company, and that the annual meetings of said company are held at its home office on the .... day of .... in each year, at .... o'clock.\"\nFor mutual life insurance holding companies, the notice of the annual meeting may be modified to reflect that the policy owner, by virtue of his or her ownership of a policy issued by a subsidiary insurance company reorganized under section 66A.40, is a member of the mutual insurance holding company. Notice given in this manner is deemed to comply with the requirements of section 302A.435.\n(a) Except as otherwise provided in paragraphs (b) and (c), proxies for voting at meetings of members of domestic mutual insurance companies are governed by the provisions of section 302A.449, subdivisions 1 to 6 and 8.\n(b) A member may vote by proxy at any regular or special meeting of the members by filing a written proxy appointment with the secretary of the company at its home office at least five days before the first meeting at which it is to be used, unless a different time period is specified in the company's bylaws.\n(c) A member may cast or authorize the casting of a vote by telephonic transmission or authenticated electronic communication, in accordance with section 302A.449, if permitted by the bylaws of the company.\nA domestic mutual insurance company must keep a list of members as part of its books and records. Membership interest in a domestic mutual insurance company must be uncertificated. A membership interest in a domestic mutual insurance company does not constitute a security as defined in section 80A.41 (30). No member of a mutual insurance company may transfer or pledge membership in the mutual insurance company or any right arising from the membership except as attendant to the valid transfer or assignment of the member's policy issued by the mutual insurance company. A member of a mutual insurance company is not, as a member, personally liable for the acts, debts, liabilities, or obligations of the company. No assessments of any kind may be imposed upon the members of a mutual insurance company by the directors or members, or because of any liability of any company owned or controlled by the mutual insurance company or because of any act, debt, or liability of the mutual insurance company, except as may otherwise be provided in the company's articles or bylaws. A member's interest in the mutual insurance company shall automatically terminate upon cancellation, nonrenewal, expiration, or termination of the member's policy with the insurance company that gave rise to the member's membership interest.\nThe number of members present in person or by proxy at a member meeting are a quorum for the transaction of business, unless a larger proportion or number is provided in the articles or bylaws. If a quorum is present when a duly called or held meeting is convened, the members present may continue to transact business until adjournment, even though the withdrawal of members originally present leaves less than the proportion or number otherwise required for a quorum.",
	"repealed": false
}