{
	"id": "16E.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.036",
	"title": "16E.036 ADVISORY COUNCIL.",
	"text": "(a) The Technology Advisory Council is created to advise the governor, the executive branch, and the state chief information officer. The council shall consist of 15 voting members. The governor shall appoint six members who are individuals actively involved in business planning for state executive branch agencies, one county member designated by the Association of Minnesota Counties, one member appointed by the governor as a representative of a union that represents state information technology employees, and one member appointed by the governor to represent private businesses. The governor shall also select six additional members with private-sector or public-sector information technology experience or experience in academia pertaining to information technology. The council shall have the following four ex-officio nonvoting members:\n(1) a member of the house of representatives selected by the speaker of the house;\n(2) a member of the house of representatives selected by the minority leader of the house of representatives;\n(3) a member of the senate selected by the majority leader of the senate; and\n(4) a member of the senate selected by the minority leader of the senate.\nThe governor shall designate one of the 15 voting members to serve as the council's chair.\n(b) Membership terms, removal of members, and filling of vacancies are as provided in section 15.059. Members do not receive compensation or reimbursement for expenses.\n(c) The chief information officer shall provide administrative support to the council.\n(d) The council shall advise the chief information officer on:\n(1) development and implementation of the state information technology strategic plan;\n(2) critical information technology initiatives for the state;\n(3) standards for state information architecture;\n(4) identification of business and technical needs of state agencies;\n(5) strategic information technology portfolio management, project prioritization, and investment decisions;\n(6) the department's performance measures and fees for service agreements with executive branch agencies;\n(7) management of the state MNIT services revolving fund; and\n(8) the efficient and effective operation of the department.",
	"repealed": false
}