{
	"id": "375.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.162",
	"title": "375.162 IMPREST CASH FUNDS.",
	"text": "The county board may establish one or more imprest funds for the payment in cash of any proper claim against the county which it is impractical to pay in any other manner. No claim for salary or personal expenses of a county officer or employee shall be paid from an imprest fund. The county board shall appoint a custodian of each imprest fund who shall be responsible for its safekeeping and disbursement according to law. Money for the operation of an imprest fund shall be secured by a warrant issued on the general revenue fund. A claim itemizing all the various demands for which disbursements have been made from the fund shall be presented to the county board at the next county board meeting after the month in which the disbursements have been made. The county board shall act upon it as in the case of other claims and a warrant shall be issued to the custodian for the amount allowed. The custodian shall use the proceeds of the warrant to replenish the fund, and if the county board fails to approve the claim in full for any sufficient reason, the custodian shall be personally responsible for the difference.\nThe county board may authorize an imprest fund for the purpose of advancing money to officers or employees to pay their actual and necessary expenses in attending meetings outside the county or for other travel that is related to the performance of their job duties. The county board shall appoint a custodian of the fund who shall be responsible for its safekeeping and disbursement according to law. Attendance at meetings and other travel outside the county shall be authorized in advance by the county board. At a meeting of the county board in the month after approved travel outside the county, the officer or employee shall submit an itemized claim for the actual and necessary expenses incurred and paid related to the approved travel. The county board shall act upon it as in the case of other claims and a warrant shall be issued to the officer or employee for the amount allowed. The officer or employee shall use the proceeds of the warrant to repay the amount advanced from the fund. If the amount approved by the county board is insufficient to repay the advance, the officer or employee shall be personally responsible for the difference.",
	"repealed": false
}