{
	"id": "65A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/65A.33",
	"title": "65A.33 DEFINITIONS.",
	"text": "As used in sections 65A.31 to 65A.42, unless the context otherwise requires, the terms defined in this section have the following meanings given to them.\n\"Insurer\" means any insurance company or other organization licensed to write and engaged in writing property or liability insurance business, including the property or liability insurance components of multiperil policies, on a direct basis, in this state, except where such insurer is specifically exempted by statute from participation in this program.\n\"Property or liability insurance\" means the coverage against direct loss to real or tangible personal property at a fixed location that is provided in the standard fire policy, extended coverage endorsement, homeowners insurance, as defined in section 65A.27, subdivision 4, cooperative housing insurance, condominium unit owners insurance, builders risk, and such vandalism and malicious mischief insurance and such other classes of insurance as may be added to the program with respect to said property by amendment as hereinafter provided. Property or liability insurance does not include automobile, commercial liability, or such manufacturing risks as may be excluded by the commissioner.\n\"Minnesota FAIR plan,\" or \"plan,\" means the organization formed by insurers to assist applicants in securing property or liability insurance and to administer the FAIR plan.\n[Repealed, 2003 c 40 s 21]\n\"Member\" means any insurer as defined in subdivision 2.\n\"Premiums written\" means direct written premiums charged during the second preceding calendar year with respect to property in this state for fire, allied lines, homeowners, the nonliability component of farm policies, and the nonliability component of commercial multiperil policies, as reported by the members to the NAIC.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota.\n[Repealed, 1993 c 248 s 17]\n\"Board\" means the governing board of directors of the Minnesota FAIR plan.\n\"NAIC\" means the National Association of Insurance Commissioners.",
	"repealed": false
}