{
	"id": "144A.479",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.479",
	"title": "144A.479 HOME CARE PROVIDER RESPONSIBILITIES; BUSINESS OPERATION.",
	"text": "The original current license must be displayed in the home care provider's principal business office and copies must be displayed in any branch office. The home care provider must provide a copy of the license to any person who requests it.\nHome care providers shall not use false, fraudulent, or misleading advertising in the marketing of services. For purposes of this section, advertising includes any verbal, written, or electronic means of communicating to potential clients about the availability, nature, or terms of home care services.\nThe home care provider shall engage in quality management appropriate to the size of the home care provider and relevant to the type of services the home care provider provides. The quality management activity means evaluating the quality of care by periodically reviewing client services, complaints made, and other issues that have occurred and determining whether changes in services, staffing, or other procedures need to be made in order to ensure safe and competent services to clients. Documentation about quality management activity must be available for two years. Information about quality management must be available to the commissioner at the time of the survey, investigation, or renewal.\n(a) This subdivision does not apply to licensees that are Minnesota counties or other units of government.\n(b) A home care provider or staff cannot accept powers-of-attorney from clients for any purpose, and may not accept appointments as guardians or conservators of clients.\n(c) A home care provider cannot serve as a client's representative.\n(a) A home care provider may assist clients with household budgeting, including paying bills and purchasing household goods, but may not otherwise manage a client's property. A home care provider must provide a client with receipts for all transactions and purchases paid with the client's funds. When receipts are not available, the transaction or purchase must be documented. A home care provider must maintain records of all such transactions.\n(b) A home care provider or staff may not borrow a client's funds or personal or real property, nor in any way convert a client's property to the home care provider's or staff's possession.\n(c) Nothing in this section precludes a home care provider or staff from accepting gifts of minimal value, or precludes the acceptance of donations or bequests made to a home care provider that are exempt from income tax under section 501(c) of the Internal Revenue Code of 1986.\n(a) All home care providers must comply with requirements for the reporting of maltreatment of minors in chapter 260E and the requirements for the reporting of maltreatment of vulnerable adults in section 626.557. Each home care provider must establish and implement a written procedure to ensure that all cases of suspected maltreatment are reported.\n(b) Each home care provider must develop and implement an individual abuse prevention plan for each vulnerable minor or adult for whom home care services are provided by a home care provider. The plan shall contain an individualized review or assessment of the person's susceptibility to abuse by another individual, including other vulnerable adults or minors; the person's risk of abusing other vulnerable adults or minors; and statements of the specific measures to be taken to minimize the risk of abuse to that person and other vulnerable adults or minors. For purposes of the abuse prevention plan, the term abuse includes self-abuse.\nThe home care provider must maintain current records of each paid employee, regularly scheduled volunteers providing home care services, and of each individual contractor providing home care services. The records must include the following information:\n(1) evidence of current professional licensure, registration, or certification, if licensure, registration, or certification is required by this statute or other rules;\n(2) records of orientation, required annual training and infection control training, and competency evaluations;\n(3) current job description, including qualifications, responsibilities, and identification of staff providing supervision;\n(4) documentation of annual performance reviews which identify areas of improvement needed and training needs;\n(5) for individuals providing home care services, verification that any health screenings required by infection control programs established under section 144A.4798 have taken place and the dates of those screenings; and\n(6) documentation of the background study as required under section 144.057.\nEach employee record must be retained for at least three years after a paid employee, home care volunteer, or contractor ceases to be employed by or under contract with the home care provider. If a home care provider ceases operation, employee records must be maintained for three years.\nA home care provider shall comply with the labor market reporting requirements described in section 256B.4912, subdivision 1a.",
	"repealed": false
}