{
	"id": "473.843",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.843",
	"title": "473.843 METROPOLITAN SOLID WASTE LANDFILL FEE.",
	"text": "The operator of a mixed municipal solid waste disposal facility in the metropolitan area shall pay a fee on solid waste accepted and disposed at the facility as follows:\n(a) A facility that weighs the waste that it accepts must pay a fee of $6.66 per ton of waste accepted at the entrance of the facility.\n(b) A facility that does not weigh the waste but that measures the volume of the waste that it accepts must pay a fee of $2 per cubic yard of waste accepted at the entrance of the facility. This fee and the tipping fee must be calculated on the same basis.\n(c) Waste residue, from recycling facilities at which recyclable materials are separated or processed for the purposes of recycling, or from energy and resource recovery facilities at which solid waste is processed for the purpose of extracting, reducing, converting to energy, or otherwise separating and preparing solid waste for reuse, is exempt from the fee imposed by this subdivision if there is at least an 85 percent weight reduction in the solid waste processed. To qualify for exemption under this clause, waste residue must be brought to a disposal facility separately. The commissioner of revenue, with the advice and assistance of the agency, shall prescribe procedures for determining the amount of waste residue qualifying for exemption.\nThe proceeds of the fees imposed under this section, including interest and penalties, must be deposited as follows:\n(1) three-fourths of the proceeds must be deposited in the environmental fund for metropolitan landfill abatement for the purposes described in section 473.844; and\n(2) one-fourth of the proceeds must be deposited in the metropolitan landfill contingency action trust account in the remediation fund established in sections 116.155 and 473.845.\nOn or before the 20th day of each month each operator shall pay the fee due under this section for the previous month, using a form provided by the commissioner of revenue.\nAn operator having a fee of $10,000 or more during a fiscal year ending June 30 must pay all fees in all subsequent calendar years by electronic means.\nNotwithstanding the provisions of section 116.075, the agency may provide the commissioner of revenue with the information necessary for the enforcement of this section. Information disclosed in a return filed under this section is public information. Information exchanged between the commissioner and the agency is public unless the information is of the type determined to be for the confidential use of the agency under section 116.075 or is trade secret information classified under section 13.37. Information obtained in the course of an audit by the Department of Revenue is private or nonpublic data to the extent that it would not be directly divulged in a return.\nThe audit, penalty, and enforcement provisions applicable to corporate franchise taxes imposed under chapter 290 apply to the fees imposed under this section. The commissioner of revenue shall administer the provisions.\nThe commissioner of revenue may adopt rules necessary to implement this section.\nMS 1984 [Repealed, 1985 c 274 s 47]",
	"repealed": false
}