{
	"id": "626A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.09",
	"title": "626A.09 AUTHORIZATION FOR DISCLOSURE AND USE OF INTERCEPTED WIRE, ELECTRONIC, OR ORAL COMMUNICATIONS.",
	"text": "Any investigative or law enforcement officer who, by any means authorized by this chapter, has obtained knowledge of the contents of any wire, electronic, or oral communication, or evidence derived therefrom may disclose such contents to another investigative or law enforcement officer to the extent that such disclosure is appropriate to the proper performance of the official duties of the officer making or receiving the disclosure.\nAny investigative or law enforcement officer who, by any means authorized by this chapter, has obtained knowledge of the contents of any wire, electronic, or oral communication or evidence derived therefrom may use such contents to the extent such use is appropriate to the proper performance of official duties.\nAny person who has received, by any means authorized by this chapter, any information concerning a wire, electronic, or oral communication, or evidence derived therefrom intercepted in accordance with the provisions of this chapter may disclose the contents of that communication or such derivative evidence while giving testimony under oath or affirmation in any criminal proceeding in any court of the United States or of any state or in any federal or state grand jury proceeding.\nNo otherwise privileged wire, electronic, or oral communication intercepted in accordance with, or in violation of, the provisions of this chapter shall lose its privileged character.\nWhen an investigative or law enforcement officer, while engaged in intercepting wire, electronic, or oral communications in the manner authorized herein, intercepts wire, electronic, or oral communications relating to offenses other than those specified in the order of authorization or approval, the contents thereof, and evidence derived therefrom, may be disclosed or used as provided in subdivisions 1 and 2. Such contents and any evidence derived therefrom may be used under subdivision 3 when authorized or approved by a judge of the district court where such judge finds on subsequent application that the contents were otherwise intercepted in accordance with the provisions of this chapter. Such application shall be made as soon as practicable.",
	"repealed": false
}