{
	"id": "121A.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.49",
	"title": "121A.49 APPEAL.",
	"text": "A party to an exclusion or expulsion decision made under sections 121A.40 to 121A.56 may appeal the decision to the commissioner of education within 21 calendar days of school board action. Upon being served with a notice of appeal, the district shall provide the commissioner and the parent or guardian with a complete copy of the hearing record within five days of its receipt of the notice of appeal. All written submissions by the appellant must be submitted and served on the respondent within ten days of its actual receipt of the transcript. All written submissions by the respondent must be submitted and served on the appellant within ten days of its actual receipt of the written submissions of the appellant. The decision of the school board must be implemented during the appeal to the commissioner.\nIn an appeal under this section, the commissioner may affirm the decision of the agency, may remand the decision for additional findings, or may reverse or modify the decision if the substantial rights of the petitioners have been prejudiced because the administrative findings, inferences, conclusions, or decisions are:\n(1) in violation of constitutional provisions;\n(2) in excess of the statutory authority or jurisdiction of the school district;\n(3) made upon unlawful procedure, except as provided in section 121A.48;\n(4) affected by other error of law;\n(5) unsupported by substantial evidence in view of the entire record submitted; or\n(6) arbitrary or capricious.\nThe commissioner or the commissioner's representative shall make a final decision based upon the record. The commissioner shall issue a decision within 30 calendar days of receiving the entire record and the parties' written submission on appeal. The commissioner's decision shall be final and binding upon the parties after the time for appeal expires under section 121A.50.",
	"repealed": false
}