{
	"id": "60L.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.04",
	"title": "60L.04 AUTHORIZED INVESTMENTS.",
	"text": "Subject to the provisions of sections 60L.01 to 60L.15, an insurer may loan or invest its funds, and may buy, sell, hold title to, possess, occupy, pledge, convey, manage, protect, insure, and deal with its investments, property, and other assets to the same extent as any other corporation or other person under the laws of this state or the United States.\nWith respect to all of the insurer's investments, the board of directors of an insurer shall exercise the judgment and care, under the circumstances then prevailing, that persons of reasonable prudence, discretion, and intelligence exercise in the management of a like enterprise, not in regard to speculating but in regard to the permanent disposition of their funds, considering the probable income as well as the probable safety of their capital. Investments must be of sufficient value, liquidity, and diversity to ensure the insurer's ability to meet its outstanding obligations based on reasonable assumptions as to new business production for current lines of business. As part of its exercise of judgment and care, the board of directors shall take into account the prudence evaluation criteria specified under section 60L.05.\nThe insurer shall establish and implement internal controls and procedures to ensure compliance with investment policies and procedures to ensure that:\n(1) the insurer's investment staff and any consultants used are reputable and capable;\n(2) a periodic evaluation and monitoring process occurs for assessing the effectiveness of investment policy and strategies;\n(3) management's performance is assessed in meeting the stated objectives within the investment policy; and\n(4) appropriate analyses are undertaken of the degree to which asset cash flows are adequate to meet liability cash flows under different economic environments. The analyses must be conducted at least annually and make specific reference to economic conditions.\nCompliance with sections 60L.01 to 60L.15 is determined in light of the facts and circumstances existing at the time of the insurer's decision or action and not by hindsight.",
	"repealed": false
}