{
	"id": "244.0513",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.0513",
	"title": "244.0513 CONDITIONAL RELEASE OF NONVIOLENT CONTROLLED SUBSTANCE OFFENDERS; TREATMENT.",
	"text": "The commissioner of corrections has the authority to release offenders committed to the commissioner's custody who meet the requirements of this section and of any rules adopted by the commissioner.\nAn offender who has been committed to the commissioner's custody may petition the commissioner for conditional release from prison before the offender's scheduled supervised release date or target release date if:\n(1) the offender is serving a sentence for violating section 152.021, subdivision 2 or 2a; 152.022, subdivision 2; 152.023, subdivision 2; 152.024; or 152.025;\n(2) the offender committed the crime as a result of a controlled substance use disorder;\n(3) the offender has served at least:\n(i) 18 months or one-half of the offender's term of imprisonment, whichever is less, if the offense for which the offender is seeking conditional release is a violation of section 152.024 or 152.025; or\n(ii) 36 months or one-half of the offender's term of imprisonment, whichever is less, if the offense for which the offender is seeking conditional release is a violation of section 152.021, subdivision 2 or 2a, 152.022, subdivision 2, or 152.023, subdivision 2;\n(4) the offender successfully completed treatment recommendations as determined by a comprehensive substance use disorder assessment while incarcerated;\n(5) the offender has not previously been conditionally released under this section; and\n(6) the offender has not within the past ten years been convicted or adjudicated delinquent for a violent crime as defined in section 609.1095 other than the current conviction for the controlled substance offense.\nThe commissioner shall offer all offenders meeting the criteria described in subdivision 2, clauses (1), (2), (5), and (6), the opportunity to begin a suitable substance use disorder treatment program of the type described in this section within 160 days after the offender's term of imprisonment begins or as soon after 160 days as possible.\n(a) The substance use disorder treatment program described in subdivisions 2 and 3 must:\n(1) contain a structured schedule for the offender;\n(2) contain individual or group counseling or both to help the offender identify and address needs related to substance use and develop strategies to avoid harmful substance use after discharge and to help the offender obtain the services necessary to establish a lifestyle free of the harmful effects of substance use disorder;\n(3) contain programs designed to promote the offender's self-worth and the offender's acceptance of responsibility for the consequences of the offender's own decisions;\n(4) be designed to serve the inmate population; and\n(5) require that each offender submit to a substance use disorder assessment and that the offender receive the appropriate level of treatment as indicated by the assessment.\n(b) The commissioner may expel from the substance use disorder treatment program any offender who:\n(1) commits a material violation of or repeatedly fails to follow the rules of the program;\n(2) commits any criminal offense while in the program; or\n(3) presents any risk to other inmates based on the offender's behavior or attitude.\nTo be eligible for release under this section, an offender shall sign a written contract with the commissioner agreeing to comply with the requirements of this section and the conditions imposed by the commissioner. In addition, the offender shall agree to submit to random drug and alcohol tests and electronic or home monitoring as determined by the commissioner or the offender's supervising agent. The commissioner may impose additional requirements on the offender that are necessary to carry out the goals of this section.\n[Repealed, 2016 c 160 s 22]\nThe commissioner may deny conditional release to an offender under this section if the commissioner determines that the offender's release may reasonably pose a danger to the public or an individual. In making this determination, the commissioner shall follow the procedures in section 244.05, subdivision 5, and the rules adopted by the commissioner under that subdivision. The commissioner shall consider whether the offender was involved in criminal gang activity during the offender's prison term. The commissioner shall also consider the offender's custody classification and level of risk of violence and the availability of appropriate community supervision for the offender. Conditional release granted under this section continues until the offender's sentence expires, unless release is rescinded under subdivision 8. The commissioner may not grant conditional release unless a release plan is in place for the offender that addresses, at a minimum, plans for aftercare, community-based substance use disorder treatment, gaining employment, and securing housing.\nThe conditions of release granted under this section are governed by the statutes and rules governing supervised release under this chapter, except that release may be rescinded without hearing by the commissioner if the commissioner determines that continuation of the conditional release poses a danger to the public or to an individual. If the commissioner rescinds an offender's conditional release, the offender shall be returned to prison and shall serve the remaining portion of the offender's sentence.\nAn offender who is serving both a sentence for an offense described in subdivision 2 and an offense not described in subdivision 2 is not eligible for release under this section unless the offender has completed the offender's full term of imprisonment for the other offense.\nUpon receiving an offender's petition for release under subdivision 2, the commissioner shall notify the prosecuting authority responsible for the offender's conviction and the sentencing court. The commissioner shall give the authority and court a reasonable opportunity to comment on the offender's potential release. If the authority or court elects to comment, the comments must specify the reasons for the authority or court's position.",
	"repealed": false
}