{
	"id": "123B.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.76",
	"title": "123B.76 EXPENDITURES; REPORTING.",
	"text": "District expenditures must be recognized and reported on the district books of account in accordance with this section.\nFiscal year-end recognition of expenditures and the related offsetting liabilities must be recorded in each fund in accordance with the uniform financial accounting and reporting standards for Minnesota school districts. Encumbrances outstanding at the end of the fiscal year do not constitute expenditures or liabilities.\nDeviations from the principles set forth in this subdivision must be evaluated and explained in footnotes to audited financial statements.\nExpenditures for any legal purpose of the district not accounted for elsewhere must be accounted for in the general fund.\n(a) For the purposes of this section, \"building\" means education site as defined in section 123B.04, subdivision 1.\n(b) Each district shall maintain separate accounts to identify general fund expenditures for each building. All expenditures for regular instruction, secondary vocational instruction, and school administration must be reported to the department separately for each building. All expenditures for special education instruction, instructional support services, and pupil support services provided within a specific building must be reported to the department separately for each building. Salary expenditures reported by building must reflect actual salaries for staff at the building and must not be based on districtwide averages. All other general fund expenditures may be reported by building or on a districtwide basis.\n(c) The department must annually report information showing school district general fund expenditures per pupil by program category for each building and estimated school district general fund revenue generated by pupils attending each building on its website. For purposes of this report:\n(1) expenditures not reported by building shall be allocated among buildings on a uniform per pupil basis;\n(2) basic skills revenue shall be allocated according to section 126C.10, subdivision 4;\n(3) secondary sparsity revenue and elementary sparsity revenue shall be allocated according to section 126C.10, subdivisions 7 and 8;\n(4) alternative teacher compensation revenue shall be allocated according to section 122A.415, subdivision 1;\n(5) other general education revenue shall be allocated on a uniform per pupil unit basis;\n(6) state and federal special education aid and Title I aid shall be allocated in proportion to district expenditures for these programs by building; and\n(7) other general fund revenues shall be allocated on a uniform per pupil basis, except that the department may allocate other revenues attributable to specific buildings directly to those buildings.",
	"repealed": false
}