{
	"id": "245C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.04",
	"title": "245C.04 WHEN BACKGROUND STUDY MUST OCCUR.",
	"text": "(a) The commissioner shall conduct a background study of an individual required to be studied under section 245C.03, subdivision 1, at least upon application for initial license for all license types.\n(b) The commissioner shall conduct a background study of an individual required to be studied under section 245C.03, subdivision 1, including a child care background study subject as defined in section 245C.02, subdivision 6a, in a family child care program, licensed child care center, certified license-exempt child care center, or legal nonlicensed child care provider, on a schedule determined by the commissioner. Except as provided in section 245C.05, subdivision 5a, a child care background study must include submission of fingerprints for a national criminal history record check and a review of the information under section 245C.08. A background study for a child care program must be repeated within five years from the most recent study conducted under this paragraph.\n(c) At reauthorization or when a new background study is needed under section 142E.16, subdivision 2, for a legal nonlicensed child care provider authorized under chapter 142E:\n(1) for a background study affiliated with a legal nonlicensed child care provider, the individual shall provide information required under section 245C.05, subdivision 1, paragraphs (a), (b), and (d), to the commissioner and be fingerprinted and photographed under section 245C.05, subdivision 5; and\n(2) the commissioner shall verify the information received under clause (1) and submit the request in NETStudy 2.0 to complete the background study.\n(d) At reapplication for a family child care license:\n(1) for a background study affiliated with a licensed family child care center, the individual shall provide information required under section 245C.05, subdivision 1, paragraphs (a), (b), and (d), to the county agency, and be fingerprinted and photographed under section 245C.05, subdivision 5;\n(2) the county agency shall verify the information received under clause (1) and forward the information to the commissioner and submit the request in NETStudy 2.0 to complete the background study; and\n(3) the background study conducted by the commissioner under this paragraph must include a review of the information required under section 245C.08.\n(e) The commissioner is not required to conduct a study of an individual at the time of reapplication for a license if the individual's background study was completed by the commissioner of human services and the following conditions are met:\n(1) a study of the individual was conducted either at the time of initial licensure or when the individual became affiliated with the license holder;\n(2) the individual has been continuously affiliated with the license holder since the last study was conducted; and\n(3) the last study of the individual was conducted on or after October 1, 1995.\n(f) The commissioner of human services shall conduct a background study of an individual specified under section 245C.03, subdivision 1, paragraph (a), clauses (2) to (6), who is newly affiliated with a child foster family setting license holder:\n(1) the county or private agency shall collect and forward to the commissioner the information required under section 245C.05, subdivisions 1 and 5, when the child foster family setting applicant or license holder resides in the home where child foster care services are provided; and\n(2) the background study conducted by the commissioner of human services under this paragraph must include a review of the information required under section 245C.08, subdivisions 1, 3, and 4.\n(g) The commissioner shall conduct a background study of an individual specified under section 245C.03, subdivision 1, paragraph (a), clauses (2) to (6), who is newly affiliated with an adult foster care or family adult day services and with a family child care license holder or a legal nonlicensed child care provider authorized under chapter 142E and:\n(1) except as provided in section 245C.05, subdivision 5a, the county shall collect and forward to the commissioner the information required under section 245C.05, subdivision 1, paragraphs (a) and (b), and subdivision 5, paragraph (b), for background studies conducted by the commissioner for all family adult day services, for adult foster care when the adult foster care license holder resides in the adult foster care residence, and for family child care and legal nonlicensed child care authorized under chapter 142E;\n(2) the license holder shall collect and forward to the commissioner the information required under section 245C.05, subdivisions 1, paragraphs (a) and (b); and 5, paragraphs (a) and (b), for background studies conducted by the commissioner for adult foster care when the license holder does not reside in the adult foster care residence; and\n(3) the background study conducted by the commissioner under this paragraph must include a review of the information required under section 245C.08, subdivision 1, paragraph (a), and subdivisions 3 and 4.\n(h) Applicants for licensure, license holders, and other entities as provided in this chapter must submit completed background study requests to the commissioner using the electronic system known as NETStudy before individuals specified in section 245C.03, subdivision 1, begin positions allowing direct contact in any licensed program.\n(i) For an individual who is not on the entity's active roster, the entity must initiate a new background study through NETStudy when:\n(1) an individual returns to a position requiring a background study following an absence of 120 or more consecutive days; or\n(2) a program that discontinued providing licensed direct contact services for 120 or more consecutive days begins to provide direct contact licensed services again.\nThe license holder shall maintain a copy of the notification provided to the commissioner under this paragraph in the program's files. If the individual's disqualification was previously set aside for the license holder's program and the new background study results in no new information that indicates the individual may pose a risk of harm to persons receiving services from the license holder, the previous set-aside shall remain in effect.\n(j) For purposes of this section, a physician licensed under chapter 147, advanced practice registered nurse licensed under chapter 148, or physician assistant licensed under chapter 147A is considered to be continuously affiliated upon the license holder's receipt from the commissioner of health or human services of the physician's, advanced practice registered nurse's, or physician assistant's background study results.\n(k) For purposes of family child care, a substitute caregiver must receive repeat background studies at the time of each license renewal.\n(l) A repeat background study at the time of license renewal is not required if the family child care substitute caregiver's background study was completed by the commissioner on or after October 1, 2017, and the substitute caregiver is on the license holder's active roster in NETStudy 2.0.\n(m) Before and after school programs authorized under chapter 142E, are exempt from the background study requirements under section 123B.03, for an employee for whom a background study under this chapter has been completed.\n[See Note.]\nApplicants and license holders under the jurisdiction of other state agencies who are required in other statutory sections to initiate background studies under this chapter must submit completed background study forms to the commissioner before the background study subject begins in a position allowing direct contact in the licensed program or, where applicable, prior to being employed.\n(a) The commissioner shall conduct a background study of an individual required to be studied under section 245C.03, subdivision 2, at least upon application for initial enrollment under sections 256B.0651 to 256B.0654 and 256B.0659.\n(b) Organizations required to initiate background studies under sections 256B.0651 to 256B.0654 and 256B.0659 for individuals described in section 245C.03, subdivision 2, must submit a completed background study request to the commissioner using the electronic system known as NETStudy before those individuals begin a position allowing direct contact with persons served by the organization.\n(c) Organizations required to initiate background studies under sections 256B.0651 to 256B.0654 and 256B.0659 for individuals described in section 245C.03, subdivision 2, must initiate a new background study through NETStudy when an individual returns to a position requiring a background study following an absence of 120 or more consecutive days.\n(a) The commissioner shall conduct a background study of an individual required to be studied under section 245C.03, subdivision 3, at least upon application for registration under section 144A.71, subdivision 1.\n(b) Each supplemental nursing services agency must initiate background studies using the electronic system known as NETStudy before an individual begins a position allowing direct contact with persons served by the agency and annually thereafter.\n(c) A supplemental nursing services agency that initiates background studies through NETStudy 2.0 is exempt from the requirement to initiate annual background studies under paragraph (b) for individuals who are on the agency's active roster.\n(a) The commissioner shall develop and implement an electronic process as a part of NETStudy 2.0 for the regular transfer of new criminal case information that is added to the Minnesota court information system. The commissioner's system must include for review only information that relates to individuals who are on the master roster.\n(b) The commissioner shall develop and implement an online system as a part of NETStudy 2.0 for agencies that initiate background studies under this chapter to access and maintain records of background studies initiated by that agency. The system must show all active background study subjects affiliated with that agency and the status of each individual's background study. Each agency that initiates background studies must use this system to notify the commissioner of discontinued affiliation for purposes of the processes required under paragraph (a).\n(c) After an entity initiating a background study has paid the applicable fee for the study and has provided the individual with the privacy notice required under section 245C.05, subdivision 2c, NETStudy 2.0 shall immediately inform the entity whether the individual requires a background study or whether the individual is immediately eligible to provide services based on a previous background study. If the individual is immediately eligible, the entity initiating the background study shall be able to view the information previously supplied by the individual who is the subject of a background study as required under section 245C.05, subdivision 1, including the individual's photograph taken at the time the individual's fingerprints were recorded. The commissioner shall not provide any entity initiating a subsequent background study with information regarding the other entities that initiated background studies on the subject.\n(d) Verification that an individual is eligible to provide services based on a previous background study is dependent on the individual voluntarily providing the individual's Social Security number to the commissioner at the time each background study is initiated. When an individual does not provide the individual's Social Security number for the background study, that study is not transferable and a repeat background study on that individual is required if the individual seeks a position requiring a background study under this chapter with another entity.\n(a) Agencies, programs, and individuals who initiate background studies under section 245C.03, subdivision 4, must initiate the studies annually using the electronic system known as NETStudy.\n(b) Agencies, programs, and individuals who initiate background studies through NETStudy 2.0 are exempt from the requirement to initiate annual background studies under paragraph (a) for individuals who are on the agency's or program's active roster.\n(a) Providers required to initiate background studies under section 256B.4912 must initiate a study using the electronic system known as NETStudy before the individual begins in a position allowing direct contact with persons served by the provider.\n(b) Except as provided in paragraphs (c) and (d), the providers must initiate a background study annually of an individual required to be studied under section 245C.03, subdivision 6.\n(c) After an initial background study under this subdivision is initiated on an individual by a provider of both services licensed by the commissioner and the unlicensed services under this subdivision, a repeat annual background study is not required if:\n(1) the provider maintains compliance with the requirements of section 245C.07, paragraph (a), regarding one individual with one address and telephone number as the person to receive sensitive background study information for the multiple programs that depend on the same background study, and that the individual who is designated to receive the sensitive background information is capable of determining, upon the request of the commissioner, whether a background study subject is providing direct contact services in one or more of the provider's programs or services and, if so, at which location or locations; and\n(2) the individual who is the subject of the background study provides direct contact services under the provider's licensed program for at least 40 hours per year so the individual will be recognized by a probation officer or corrections agent to prompt a report to the commissioner regarding criminal convictions as required under section 245C.05, subdivision 7.\n(d) A provider who initiates background studies through NETStudy 2.0 is exempt from the requirement to initiate annual background studies under paragraph (b) for individuals who are on the provider's active roster.\n(a) For a background study completed on an individual required to be studied under section 245C.03, the license holder or other entity that initiated the background study must initiate a new background study using the electronic system known as NETStudy when an individual who is affiliated with the license holder or other entity undergoes a legal name change.\n(b) For background studies subject to a fee paid through the NETStudy system, the entity that initiated the study may initiate a new study under paragraph (a) or notify the commissioner of the name change through a notice to the commissioner.\n(a) Before the implementation of NETStudy 2.0, current or prospective contractors who are required to have a background study under section 245C.03, subdivision 1, who provide services for multiple family child care license holders in a single county, and will have direct contact with children served in the family child care setting are required to have only one background study which is transferable to all family child care programs in that county if:\n(1) the county agency maintains a record of the contractor's background study results which verify the contractor is approved to have direct contact with children receiving services;\n(2) the license holder contacts the county agency and obtains notice that the current or prospective contractor is in compliance with background study requirements and approved to have direct contact; and\n(3) the contractor's background study is repeated every two years.\n(b) For a family child care license holder operating under NETStudy 2.0, the license holder's active roster shall be the system used to document when a background study subject is affiliated with the license holder.\n(a) The commissioner shall conduct a background study of an individual required to be studied under section 245C.03, subdivision 9, at least upon application for initial enrollment under section 256B.85.\n(b) Before an individual described in section 245C.03, subdivision 9, begins a position allowing direct contact with a person served by an organization required to initiate a background study under section 256B.85, the organization must receive a notice from the commissioner that the support worker is:\n(1) not disqualified under section 245C.14; or\n(2) disqualified, but the individual has received a set-aside of the disqualification under section 245C.22.\nThe commissioner shall conduct background studies of employees of county social services and local welfare agencies having responsibility for child protection duties when the background study is initiated according to section 260E.36, subdivision 3.\nApplicants and license holders for children's residential facilities and foster residence settings must submit a background study request to the commissioner using the electronic system known as NETStudy 2.0:\n(1) before the commissioner issues a license to an applicant;\n(2) before an individual age 13 or older, who is not currently receiving services from the licensed facility or setting, may live in the licensed program or setting;\n(3) before a volunteer has unsupervised direct contact with persons that the program serves;\n(4) before an individual becomes a controlling individual as defined in section 245A.02, subdivision 5a;\n(5) before an adult, regardless of whether or not the individual will have direct contact with persons served by the facility, begins working in the facility or setting;\n(6) when directed to by the commissioner for an individual who resides in the household as described in section 245C.03, subdivision 1, paragraph (a), clause (5); and\n(7) when directed to by the commissioner for an individual who may have unsupervised access to children or vulnerable adults as described in section 245C.03, subdivision 1, paragraph (a), clause (6).",
	"repealed": false
}