{
	"id": "332.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.74",
	"title": "332.74 DEBTOR REMEDIES.",
	"text": "A debtor alleging violation of section 332.72 may petition for equitable relief in the district court in the county where the debtor lives or where the coerced debt was incurred. The petition must include:\n(1) the notice to the creditor required under section 332.73, subdivision 1;\n(2) consistent with Rule 11 of the Minnesota Rules of General Practice, information identifying (i) the account or accounts associated with the coerced debt, and (ii) the person in whose name the debt was incurred; and\n(3) the identity and, if known, contact information of the person who caused the debtor to incur coerced debt, unless the debtor signs a sworn statement that disclosing the information is likely to result in domestic abuse or other harm to the debtor, the debtor's children, parents, other relatives, or a family pet.\nThe court must take appropriate steps necessary to prevent abuse of the debtor or to the debtor, the debtor's children, parents, other relatives, or a family pet. For purposes of this subdivision, appropriate steps include but are not limited to sealing the file, marking the file as confidential, redacting personally identifiable information about the debtor, and directing that any deposition or evidentiary hearing be conducted remotely.\n(a) If a debtor shows by a preponderance of the evidence that the debtor has been aggrieved by a violation of section 332.72 and the debtor has incurred coerced debt, the debtor is entitled to one or more of the following:\n(1) a declaratory judgment that the debt or portion of a debt is coerced debt;\n(2) an injunction prohibiting the creditor from (i) holding or attempting to hold the debtor liable for the debt or portion of a debt, or (ii) enforcing a judgment related to the coerced debt; and\n(3) an order dismissing any cause of action brought by the creditor to enforce or collect the coerced debt from the debtor or, if only a portion of the debt is established as coerced debt, an order directing that the judgment, if any, in the action be amended to reflect only the portion of the debt that is not coerced debt.\n(b) If the court orders relief for the debtor under paragraph (a), the court, after the creditor's motion has been personally served on the person who violated section 332.72, or if personal service cannot be made, after service by United States mail to the last known address of the person and one-week published notice under section 645.11, must issue a judgment in favor of the creditor against the person in the amount of the debt or a portion thereof.\n(c) This subdivision applies regardless of the judicial district in which the creditor's action or the debtor's petition was filed.\nIn an action against a debtor to satisfy a debt, it is an affirmative defense that the debtor incurred coerced debt.\nIn any affirmative action taken under subdivision 1 or any affirmative defense asserted in subdivision 4, the debtor bears the burden to show by a preponderance of the evidence that the debtor incurred coerced debt. There is a presumption that the debtor has incurred coerced debt if the person alleged to have caused the debtor to incur the coerced debt has been convicted of or received a stay of adjudication for a violation of section 609.27, 609.282, 609.322, or 609.527.\n(a) The statute of limitations under section 541.05 is tolled during the pendency of a proceeding instituted under this section.\n(b) A creditor is prohibited from filing a collection action regarding a debt that is the subject of a proceeding instituted under this section while the proceeding is pending.\n(c) If a debtor commences a proceeding under this section while a collection action is pending against the debtor regarding a debt that is subject to the proceeding, the court must immediately stay the collection action pending the disposition of the proceeding under this section.",
	"repealed": false
}