{
	"id": "62Q.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.17",
	"title": "62Q.17 VOLUNTARY PURCHASING POOLS.",
	"text": "Notwithstanding section 62A.10, employers, groups, and individuals may voluntarily form purchasing pools, solely for the purpose of negotiating and purchasing health plan coverage from health plan companies for members of the pool.\nAll participants in a purchasing pool must live within a common geographic region, be employed in a similar occupation, or share some other common factor as approved by the commissioner of commerce. The membership criteria must not be designed to include disproportionately employers, groups, or individuals likely to have low costs of health coverage, or to exclude disproportionately employers, groups, or individuals likely to have high costs of health coverage.\nEach pool must have a governing structure controlled by its members. The governing structure of the pool is responsible for administration of the pool. The governing structure shall review and evaluate all bids for coverage from health plan companies, shall determine criteria for joining and leaving the pool, and may design incentives for healthy lifestyles and health promotion programs. The governing structure may design uniform entrance standards for all employers, except small employers as defined under section 62L.02. Small employers must be permitted to enter any pool if the small employer meets the pool's membership requirements. Pools must provide as much choice in health plans to members as is financially possible. The governing structure may charge all members a fee for administrative purposes.\nPools must have an annual open enrollment period of not less than 15 days, during which all individuals or groups that qualify for membership may enter the pool without any preexisting condition limitations or exclusions or exclusionary riders, except those permitted under chapter 62L for groups or section 62A.65 for individuals. Pools must reach and maintain an enrolled population of at least 1,000 members within six months of formation. If a pool fails to reach or maintain the minimum enrollment, all coverage subsequently purchased through the purchasing pool must be regulated through existing applicable laws and forgo all advantages under this section.\nThe governing structure of the pool shall set a minimum time period for membership. Members must stay in the purchasing pool for the entire minimum period to avoid paying a penalty. Penalties for early withdrawal from the purchasing pool shall be established by the governing structure.\nEmployer-based purchasing pools must, with respect to small employers as defined in section 62L.02, meet all the requirements of chapter 62L. The experience of the pool must be pooled and the rates blended across all groups.\nPurchasing pools that contain individual members must meet all of the underwriting and rate restrictions found in the individual health plan market.\nPrior to the initial effective date of coverage, and annually on July 1 thereafter, each pool shall file a report with the information clearinghouse and the commissioner of commerce. The information clearinghouse must use the report to promote the purchasing pools. The annual report must contain the following information:\n(1) the number of lives in the pool;\n(2) the geographic area the pool intends to cover;\n(3) the number of health plans offered;\n(4) a description of the benefits under each plan;\n(5) a description of the premium structure, including any co-payments or deductibles, of each plan offered;\n(6) evidence of compliance with chapter 62L;\n(7) a sample of marketing information, including a phone number where the pool may be contacted; and\n(8) a list of all administrative fees charged.\nPurchasing pools must register prior to offering coverage, and annually on July 1 thereafter, with the commissioner of commerce on a form prescribed by the commissioner. The commissioner of commerce shall enforce this section and all other state laws with respect to purchasing pools, and has for that purpose all general rulemaking and enforcement powers otherwise available to the commissioner of commerce. The commissioner may charge an annual registration fee sufficient to meet the costs of the commissioner's duties under this section.",
	"repealed": false
}