{
	"id": "53B.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.61",
	"title": "53B.61 MAINTENANCE OF PERMISSIBLE INVESTMENTS.",
	"text": "(a) A licensee must maintain at all times permissible investments that have a market value computed in accordance with United States generally accepted accounting principles of not less than the aggregate amount of all of the licensee's outstanding money transmission obligations.\n(b) Except for permissible investments enumerated in section 53B.62, paragraph (a), the commissioner may by administrative rule or order, with respect to any licensee, limit the extent to which a specific investment maintained by a licensee within a class of permissible investments may be considered a permissible investment, if the specific investment represents undue risk to customers not reflected in the market value of investments.\n(c) Permissible investments, even if commingled with other assets of the licensee, are held in trust for the benefit of the purchasers and holders of the licensee's outstanding money transmission obligations in the event of insolvency; the filing of a petition by or against the licensee under the United States Bankruptcy Code, United States Code, title 11, sections 101 to 110, as amended or recodified from time to time, for bankruptcy or reorganization; the filing of a petition by or against the licensee for receivership; the commencement of any other judicial or administrative proceeding for the licensee's dissolution or reorganization; or in the event of an action by a creditor against the licensee who is not a beneficiary of this statutory trust. No permissible investments impressed with a trust pursuant to this paragraph are subject to attachment, levy of execution, or sequestration by order of any court, except for a beneficiary of the statutory trust.\n(d) Upon the establishment of a statutory trust in accordance with paragraph (c), or when any funds are drawn on a letter of credit pursuant to section 53B.62, paragraph (a), clause (4), the commissioner must notify the applicable regulator of each state in which the licensee is licensed to engage in money transmission, if any, of the establishment of the trust or the funds drawn on the letter of credit, as applicable. Notice is deemed satisfied if performed pursuant to a multistate agreement or through NMLS. Funds drawn on a letter of credit, and any other permissible investments held in trust for the benefit of the purchasers and holders of the licensee's outstanding money transmission obligations, are deemed held in trust for the benefit of the purchasers and holders of the licensee's outstanding money transmission obligations on a pro rata and equitable basis in accordance with statutes pursuant to which permissible investments are required to be held in Minnesota and other states, as defined by a substantially similar statute in the other state. Any statutory trust established under this section terminates upon extinguishment of all of the licensee's outstanding money transmission obligations.\n(e) The commissioner may by rule or by order allow other types of investments that the commissioner determines are of sufficient liquidity and quality to be a permissible investment. The commissioner is authorized to participate in efforts with other state regulators to determine that other types of investments are of sufficient liquidity and quality to be a permissible investment.",
	"repealed": false
}