{
	"id": "114D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.30",
	"title": "114D.30 CLEAN WATER COUNCIL.",
	"text": "A Clean Water Council is created to advise on the administration and implementation of this chapter, and foster coordination and cooperation as described in section 114D.20, subdivision 1. The council may also advise on the development of appropriate processes for expert scientific review as described in section 114D.35, subdivision 2. The Pollution Control Agency shall provide administrative support for the council with the support of other member agencies. The members of the council shall elect a chair from the voting members of the council.\n(a) The commissioners of natural resources, agriculture, health, and the Pollution Control Agency, the executive director of the Board of Water and Soil Resources, the Board of Regents of the University of Minnesota, and the Metropolitan Council shall each appoint one person from their respective entity to serve as a nonvoting member of the council. Two members of the house of representatives, including one member from the majority party and one member from the minority party, appointed by the speaker and two senators, including one member from the majority party and one member from the minority party, appointed according to the rules of the senate shall serve at the pleasure of the appointing authority as nonvoting members of the council. Members appointed under this paragraph serve as nonvoting members of the council.\n(b) Seventeen voting members of the council shall be appointed by the governor as follows:\n(1) two members representing statewide farm organizations;\n(2) two members representing business organizations;\n(3) two members representing environmental organizations;\n(4) one member representing soil and water conservation districts;\n(5) one member representing watershed districts;\n(6) one member representing nonprofit organizations focused on improvement of Minnesota lakes or streams;\n(7) two members representing organizations of county governments, one member representing the interests of rural counties and one member representing the interests of counties in the seven-county metropolitan area;\n(8) two members representing organizations of city governments;\n(9) one member representing township officers;\n(10) one member representing the interests of tribal governments;\n(11) one member representing statewide hunting organizations; and\n(12) one member representing statewide fishing organizations.\nMembers appointed under this paragraph must not be registered lobbyists or legislators. In making appointments, the governor must attempt to provide for geographic balance. The members of the council appointed by the governor are subject to the advice and consent of the senate.\nA Clean Water Council member may not participate in or vote on a decision of the council relating to an organization in which the member has either a direct or indirect personal financial interest. While serving on the Clean Water Council, a member shall avoid any potential conflict of interest.\nThe terms of members representing the state agencies and the Metropolitan Council are four years and are coterminous with the governor. The terms of other nonlegislative members of the council shall be as provided in section 15.059, subdivision 2. Members may serve until their successors are appointed and qualify. Compensation and removal of nonlegislative council members is as provided in section 15.059, subdivisions 3 and 4, except that a nonlegislative member may be compensated at the rate of up to $125 a day. Compensation of legislative members is as determined by the appointing authority. The Pollution Control Agency may reimburse legislative members for expenses. A vacancy on the council may be filled by the appointing authority provided in subdivision 1 for the remainder of the unexpired term.\nThe Clean Water Council shall recommend a plan for implementation of this chapter and the provisions of article XI, section 15, of the Minnesota Constitution relating to clean water. The recommended plan shall address general procedures and time frames for implementing this chapter, and shall include a more specific implementation work plan for the next fiscal biennium and a framework for setting priorities to address impaired waters consistent with section 114D.20, subdivisions 2 to 7. The council shall issue a revised plan by December 1 of each even-numbered year.\n(a) The Clean Water Council must submit recommendations to the governor and the legislature on how money from the clean water fund should be appropriated for the purposes stated in article XI, section 15, of the Minnesota Constitution and section 114D.50.\n(b) The council's recommendations must:\n(1) be to protect, enhance, and restore water quality in lakes, rivers, and streams and to protect groundwater from degradation and ensure that at least five percent of the clean water fund is spent only to protect drinking water sources;\n(2) be consistent with the purposes, policies, goals, and priorities in this chapter; and\n(3) allocate adequate support and resources to identify degraded groundwater and impaired waters, develop TMDLs, implement restoration of groundwater and impaired waters, and provide assistance and incentives to prevent groundwater and surface waters from becoming degraded or impaired and improve the quality of surface waters which are listed as impaired but have no approved TMDL.\n(c) The council must recommend methods of ensuring that awards of grants, loans, or other funds from the clean water fund specify the outcomes to be achieved as a result of the funding and specify standards to hold the recipient accountable for achieving the desired outcomes. Expenditures from the fund must be appropriated by law.\nBy January 15 each odd-numbered year, the council must submit a report to the legislature that includes:\n(1) a summary of the activities for which money has been or will be spent in the current biennium;\n(2) the recommendations required under subdivision 6 for how money in the clean water fund should be spent in the next biennium, including recommended legislative bill language; and\n(3) the impact on economic development of the implementation of efforts to protect and restore groundwater and the impaired waters program.",
	"repealed": false
}