{
	"id": "120B.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.123",
	"title": "120B.123 READ ACT IMPLEMENTATION.",
	"text": "(a) A district must administer an approved evidence-based reading screener to students in kindergarten through grade 3 within the first six weeks of the school year, by February 15 each year, and again within the last six weeks of the school year. The screener must be one of the screening tools approved by the Department of Education. A district must identify any screener it uses in the district's annual literacy plan, and submit screening data with the annual literacy plan by June 15.\n(b) Starting in the 2024-2025 school year, district staff, contractors, and volunteers may only use screeners that have been approved by the Department of Education.\nA district must implement progress monitoring, as defined in section 120B.119, for a student not reading at grade level.\nA district must use evidence-based curriculum and intervention materials at each grade level that are designed to ensure student mastery of phonemic awareness, phonics, vocabulary development, reading fluency, and reading comprehension. Starting July 1, 2023, when a district purchases new literacy curriculum, or literacy intervention or supplementary materials, the curriculum or materials must be evidence-based as defined in section 120B.119.\nA district is encouraged to use a data-based decision-making process within the MTSS framework to determine the evidence-based core reading instruction and Tier 2 or Tier 3 intervention required to meet a student's identified needs.\n(a) A district must provide training from a menu of approved evidence-based training programs to the following teachers and staff by July 1, 2026:\n(1) reading intervention teachers working with students in kindergarten through grade 12;\n(2) all classroom teachers of students in kindergarten through grade 3 and children in prekindergarten programs;\n(3) special education teachers;\n(4) curriculum directors;\n(5) instructional support staff, contractors, and volunteers who assist in providing Tier 2 interventions;\n(6) employees who select literacy instructional materials for a district; and\n(7) teachers licensed to teach English to multilingual learners.\n(b) A district must provide training from a menu of approved evidence-based training programs to the following teachers by July 1, 2027:\n(1) teachers who provide reading instruction to students in grades 4 to 12; and\n(2) teachers who provide instruction to students in a state-approved alternative program.\n(c) The commissioner of education may grant a district an extension to the deadlines in this subdivision.\n(d) Training provided by a department-approved certified trained facilitator may satisfy the professional development requirements under this subdivision.\n(e) For the 2024-2025 school year only, the hours of instruction requirement under section 120A.41 for students in an elementary school, as defined in section 120A.05, subdivision 9, is reduced by 5-1/2 hours for a district that enters into an agreement with the exclusive representative of the teachers that requires teachers to receive at least 5-1/2 hours of approved evidence-based training required under this subdivision, on a day when other students in the district receive instruction. If a charter school's teachers are not represented by an exclusive representative, the charter school may reduce the number of instructional hours for students in an elementary school, as defined in section 120A.05, subdivision 9, by 5-1/2 hours after consulting with its teachers in order to provide teachers with at least 5-1/2 hours of evidence-based training required under this subdivision on a day when other students receive instruction.\n(a) By August 30, 2025, a district must employ or contract with a literacy lead, or be actively supporting a designated literacy specialist through the process of becoming a literacy lead. A board may satisfy the requirements of this subdivision by contracting with another school board or cooperative unit under section 123A.24 for the services of a literacy lead by August 30, 2025.\n(b) A district literacy lead must collaborate with district administrators and staff to support the district's implementation of requirements under the Read Act.\n(a) By July 1, 2023, the department must make available to districts a list of approved evidence-based screeners in accordance with section 120B.12. A district must use an approved screener to assess students' mastery of foundational reading skills in accordance with section 120B.12.\n(b) The Department of Education must partner with CAREI as required under section 120B.124 to approve professional development programs, subject to final determination by the department. After the implementation partnership under section 120B.124 ends, the department must continue to regularly provide districts with information about professional development opportunities available throughout the state on reading instruction that is evidence-based.\n(c) The department and CAREI must identify training required for a literacy lead and literacy specialist employed by a district or Minnesota service cooperatives.\n(d) The department must employ one or more literacy specialists to provide support to districts implementing the Read Act and coordinate duties assigned to the department under the Read Act. The literacy specialist must work on state efforts to improve literacy tracking and implementation.\n(e) The department must develop a template for a local literacy plan in accordance with section 120B.12, subdivision 4a.\n(f) The department must partner with CAREI as required under section 120B.124 to approve literacy intervention models, subject to final determination by the department. The department must make a list of the 15 approved evidence-based intervention models available to districts as they are approved by CAREI, starting November 1, 2025. Upon approval of the evidence-based intervention models, the department must ensure the models are reviewed by a contracted third party for culturally responsive guidance and materials, and make those findings available to districts once the review process is complete. The department must notify districts of the two-step review process for all materials approved under the Read Act for effectiveness as evidence-based structured literacy, and for cultural responsiveness.\n(g) The department and CAREI must provide ongoing coaching, mentoring, and support to certified trained facilitators.",
	"repealed": false
}