{
	"id": "152.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.135",
	"title": "152.135 RESTRICTIONS ON SALES, MARKETING, AND POSSESSION OF EPHEDRINE.",
	"text": "Except as provided in this section, a material, compound, mixture, or preparation that contains any quantity of ephedrine, a salt of ephedrine, an optical isomer of ephedrine, or a salt of an optical isomer of ephedrine, may be dispensed only upon the prescription of a duly licensed practitioner authorized by the laws of the state to prescribe prescription drugs.\n(a) A drug product containing ephedrine, its salts, optical isomers, and salts of optical isomers is exempt from subdivision 1 if the drug product:\n(1) may be lawfully sold over the counter without a prescription under the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 321, et seq.;\n(2) is labeled and marketed in a manner consistent with the pertinent OTC Tentative Final or Final Monograph;\n(3) is manufactured and distributed for legitimate medicinal use in a manner that reduces or eliminates the likelihood of abuse;\n(4) is not marketed, advertised, or labeled for the indication of stimulation, mental alertness, weight loss, muscle enhancement, appetite control, or energy;\n(5) is in solid oral dosage forms, including soft gelatin caplets, that combine 400 milligrams of guaifenesin and 25 milligrams of ephedrine per dose, according to label instructions; or is an anorectal preparation containing not more than five percent ephedrine; and\n(6) is sold in a manner that does not conflict with section 152.02, subdivision 6.\n(b) Subdivisions 1 and 3 shall not apply to products containing ephedra or ma huang and lawfully marketed as dietary supplements under federal law.\nThe marketing, advertising, or labeling of a product containing ephedrine, a salt of ephedrine, an optical isomer of ephedrine, or a salt of an optical isomer of ephedrine for the indication of stimulation, mental alertness, weight loss, appetite control, or energy, is prohibited. In determining compliance with this subdivision, the following factors may be considered:\n(1) the packaging of the drug product;\n(2) the name and labeling of the product;\n(3) the manner of distribution, advertising, and promotion of the product;\n(4) verbal representations made concerning the product; and\n(5) the duration, scope, and significance of abuse or misuse of the product.\n[Repealed, 1Sp2003 c 2 art 8 s 19]\nIt is unlawful for a person to sell, distribute, or otherwise make available a product containing ephedrine, pseudoephedrine, or phenylpropanolamine or their salts, optical isomers, or salts of optical isomers if the person knows or reasonably should know that the product will be used as a precursor to an illegal substance.\nA person who violates this section is guilty of a misdemeanor.",
	"repealed": false
}