{
	"id": "115.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.03",
	"title": "115.03 POWERS AND DUTIES.",
	"text": "(a) The commissioner is given and charged with the following powers and duties:\n(1) to administer and enforce all laws relating to the pollution of any of the waters of the state;\n(2) to investigate the extent, character, and effect of the pollution of the waters of this state and to gather data and information necessary or desirable in the administration or enforcement of pollution laws, and to make such classification of the waters of the state as it may deem advisable;\n(3) to establish and alter such reasonable pollution standards for any waters of the state in relation to the public use to which they are or may be put as it shall deem necessary for the purposes of this chapter and, with respect to the pollution of waters of the state, chapter 116;\n(4) to encourage waste treatment, including advanced waste treatment, instead of stream low-flow augmentation for dilution purposes to control and prevent pollution;\n(5) to adopt, issue, reissue, modify, deny, revoke, reopen, enter into, or enforce reasonable orders, permits, variances, standards, rules, schedules of compliance, and stipulation agreements, under such conditions as it may prescribe, in order to prevent, control or abate water pollution, or for the installation or operation of disposal systems or parts thereof, or for other equipment and facilities:\n(i) requiring the discontinuance of the discharge of sewage, industrial waste or other wastes into any waters of the state resulting in pollution in excess of the applicable pollution standard established under this chapter;\n(ii) prohibiting or directing the abatement of any discharge of sewage, industrial waste, or other wastes, into any waters of the state or the deposit thereof or the discharge into any municipal disposal system where the same is likely to get into any waters of the state in violation of this chapter and, with respect to the pollution of waters of the state, chapter 116, or standards or rules promulgated or permits issued pursuant thereto, and specifying the schedule of compliance within which such prohibition or abatement must be accomplished;\n(iii) prohibiting the storage of any liquid or solid substance or other pollutant in a manner which does not reasonably assure proper retention against entry into any waters of the state that would be likely to pollute any waters of the state;\n(iv) requiring the construction, installation, maintenance, and operation by any person of any disposal system or any part thereof, or other equipment and facilities, or the reconstruction, alteration, or enlargement of its existing disposal system or any part thereof, or the adoption of other remedial measures to prevent, control or abate any discharge or deposit of sewage, industrial waste or other wastes by any person;\n(v) establishing, and from time to time revising, standards of performance for new sources taking into consideration, among other things, classes, types, sizes, and categories of sources, processes, pollution control technology, cost of achieving such effluent reduction, and any nonwater quality environmental impact and energy requirements. Said standards of performance for new sources shall encompass those standards for the control of the discharge of pollutants which reflect the greatest degree of effluent reduction which the agency determines to be achievable through application of the best available demonstrated control technology, processes, operating methods, or other alternatives, including, where practicable, a standard permitting no discharge of pollutants. New sources shall encompass buildings, structures, facilities, or installations from which there is or may be the discharge of pollutants, the construction of which is commenced after the publication by the agency of proposed rules prescribing a standard of performance which will be applicable to such source. Notwithstanding any other provision of the law of this state, any point source the construction of which is commenced after May 20, 1973, and which is so constructed as to meet all applicable standards of performance for new sources shall, consistent with and subject to the provisions of section 306(d) of the Amendments of 1972 to the Federal Water Pollution Control Act, not be subject to any more stringent standard of performance for new sources during a ten-year period beginning on the date of completion of such construction or during the period of depreciation or amortization of such facility for the purposes of section 167 or 169, or both, of the Federal Internal Revenue Code of 1954, whichever period ends first. Construction shall encompass any placement, assembly, or installation of facilities or equipment, including contractual obligations to purchase such facilities or equipment, at the premises where such equipment will be used, including preparation work at such premises;\n(vi) establishing and revising pretreatment standards to prevent or abate the discharge of any pollutant into any publicly owned disposal system, which pollutant interferes with, passes through, or otherwise is incompatible with such disposal system;\n(vii) requiring the owner or operator of any disposal system or any point source to establish and maintain such records, make such reports, install, use, and maintain such monitoring equipment or methods, including where appropriate biological monitoring methods, sample such effluents in accordance with such methods, at such locations, at such intervals, and in such a manner as the agency shall prescribe, and providing such other information as the agency may reasonably require;\n(viii) notwithstanding any other provision of this chapter, and with respect to the pollution of waters of the state, chapter 116, requiring the achievement of more stringent limitations than otherwise imposed by effluent limitations in order to meet any applicable water quality standard by establishing new effluent limitations, based upon section 115.01, subdivision 13, clause (b), including alternative effluent control strategies for any point source or group of point sources to insure the integrity of water quality classifications, whenever the agency determines that discharges of pollutants from such point source or sources, with the application of effluent limitations required to comply with any standard of best available technology, would interfere with the attainment or maintenance of the water quality classification in a specific portion of the waters of the state. Prior to establishment of any such effluent limitation, the agency shall hold a public hearing to determine the relationship of the economic and social costs of achieving such limitation or limitations, including any economic or social dislocation in the affected community or communities, to the social and economic benefits to be obtained and to determine whether or not such effluent limitation can be implemented with available technology or other alternative control strategies. If a person affected by such limitation demonstrates at such hearing that, whether or not such technology or other alternative control strategies are available, there is no reasonable relationship between the economic and social costs and the benefits to be obtained, such limitation shall not become effective and shall be adjusted as it applies to such person;\n(ix) modifying, in its discretion, any requirement or limitation based upon best available technology with respect to any point source for which a permit application is filed after July 1, 1977, upon a showing by the owner or operator of such point source satisfactory to the agency that such modified requirements will represent the maximum use of technology within the economic capability of the owner or operator and will result in reasonable further progress toward the elimination of the discharge of pollutants;\n(x) requiring that applicants for wastewater discharge permits evaluate in their applications the potential reuses of the discharged wastewater; and\n(xi) when appropriate, requiring parties who enter into a negotiated agreement to settle an enforcement matter with the agency to reimburse the agency for oversight costs. The agency may recover oversight costs only if the agency's costs exceed $25,000. If oversight costs exceed $25,000, the agency may recover all the oversight costs incurred by the agency that are associated with implementing the negotiated agreement. Oversight costs may include but are not limited to any costs associated with inspections, sampling, monitoring, modeling, risk assessment, permit writing, engineering review, economic analysis and review, and other record or document review. Estimates of anticipated oversight costs must be disclosed in the negotiated agreement, and estimates must be periodically updated and disclosed to the parties to the negotiated agreement. The agency's legal and litigation costs are not recoverable under this clause. In addition to settlement agreements, the commissioner has discretion as to whether to apply this clause in cases when the agency is using schedules of compliance to bring a class of regulated parties into compliance;\n(6) to require to be submitted and to approve plans and specifications for disposal systems or point sources, or any part thereof and to inspect the construction thereof for compliance with the approved plans and specifications thereof;\n(7) to prescribe and alter rules, not inconsistent with law, for the conduct of the agency and other matters within the scope of the powers granted to and imposed upon it by this chapter and, with respect to pollution of waters of the state, in chapter 116, provided that every rule affecting any other department or agency of the state or any person other than a member or employee of the agency shall be filed with the secretary of state;\n(8) to conduct such investigations, issue such notices, public and otherwise, and hold such hearings as are necessary or which it may deem advisable for the discharge of its duties under this chapter and, with respect to the pollution of waters of the state, under chapter 116, including, but not limited to, the issuance of permits, and to authorize any member, employee, or agent appointed by it to conduct such investigations or, issue such notices and hold such hearings;\n(9) for the purpose of water pollution control planning by the state and pursuant to the Federal Water Pollution Control Act, as amended, to establish and revise planning areas, adopt plans and programs and continuing planning processes, including, but not limited to, basin plans and areawide waste treatment management plans, and to provide for the implementation of any such plans by means of, including, but not limited to, standards, plan elements, procedures for revision, intergovernmental cooperation, residual treatment process waste controls, and needs inventory and ranking for construction of disposal systems;\n(10) to train water pollution control personnel and charge training fees as are necessary to cover the agency's costs. All such fees received must be paid into the state treasury and credited to the Pollution Control Agency training account;\n(11) to provide chloride reduction training and charge training fees as necessary to cover the agency's costs not to exceed $350. All training fees received must be paid into the state treasury and credited to the Pollution Control Agency training account;\n(12) to impose as additional conditions in permits to publicly owned disposal systems appropriate measures to insure compliance by industrial and other users with any pretreatment standard, including, but not limited to, those related to toxic pollutants, and any system of user charges ratably as is hereby required under state law or said Federal Water Pollution Control Act, as amended, or any regulations or guidelines promulgated thereunder;\n(13) to set a period not to exceed five years for the duration of any national pollutant discharge elimination system permit or not to exceed ten years for any permit issued as a state disposal system permit only;\n(14) to require each governmental subdivision identified as a permittee for a wastewater treatment works to evaluate in every odd-numbered year the condition of its existing system and identify future capital improvements that will be needed to attain or maintain compliance with a national pollutant discharge elimination system or state disposal system permit;\n(15) to train subsurface sewage treatment system personnel, including persons who design, construct, install, inspect, service, and operate subsurface sewage treatment systems, and charge fees as necessary to pay the agency's costs. All fees received must be paid into the state treasury and credited to the agency's training account. Money in the account is appropriated to the agency to pay expenses related to training; and\n(16) to encourage practices that enable the recovery and use of waste heat from wastewater treatment operations.\n(b) The information required in paragraph (a), clause (14), must be submitted in every odd-numbered year to the commissioner on a form provided by the commissioner. The commissioner shall provide technical assistance if requested by the governmental subdivision.\n(c) The powers and duties given the agency in this subdivision also apply to permits issued under chapter 114C.\nIn any hearing or investigation conducted pursuant to this chapter and chapters 114C, 116, and 116F, any employee or agent thereto authorized by the agency, may administer oaths, examine witnesses and issue, in the name of the agency, subpoenas requiring the attendance and testimony of witnesses and the production of evidence relevant to any matter involved in any such hearing or investigation. Witnesses shall receive the same fees and mileage as in civil actions.\nIn case of contumacy or refusal to obey a subpoena issued under this section, the district court of the county where the proceeding is pending or in which the person guilty of such contumacy or refusal to obey is found or resides, shall have jurisdiction upon application of the agency or its authorized member, employee or agent to issue to such person an order requiring the person to appear and testify or produce evidence, as the case may require, and any failure to obey such order of the court may be punished by said court as a contempt thereof.\nIt is unlawful for any person to issue or grant a building permit for, or otherwise permit, the construction, enlargement, or relocation of a commercial or industrial building to be used as the place of employment of more than 12 persons, or any other commercial or industrial building to house a process producing industrial or other wastes, unless the sewage or industrial or other waste originating in such buildings is or will be discharged into a disposal system for which a permit has first been granted by the agency unless the agency has cause not to apply this requirement, provided that this subdivision shall not apply to building permits issued for buildings, which have an estimated value of less than $500,000, located or to be located within an incorporated municipality. After January 1, 1975, such permits shall be acted upon by the agency within 90 days after submitted, provided that the agency, for good cause, may order said 90-day period to be extended for a reasonable time.\n(a) The following definitions apply to this subdivision:\n(1) \"section 401 certification\" means a water quality certification required under section 401 of the federal Clean Water Act, United States Code, title 33, section 1341; and\n(2) \"nationwide permit\" means a nationwide general permit issued by the United States Army Corps of Engineers and listed in Code of Federal Regulations, title 40, part 330, appendix A.\n(b) The agency is responsible for providing section 401 certifications for nationwide permits.\n(c) Before making a final decision on a section 401 certification for regional conditions on a nationwide permit, the agency shall hold at least one public meeting outside the seven-county metropolitan area.\n(d) In addition to other notice required by law, the agency shall provide written notice of a meeting at which the agency will be considering a section 401 certification for regional conditions on a nationwide permit at least 21 days before the date of the meeting to the members of the senate and house of representatives environment and natural resources committees, the senate Agriculture and Rural Development Committee, and the house of representatives Agriculture Committee.\n(a) Notwithstanding any other provisions prescribed in or pursuant to this chapter and, with respect to the pollution of waters of the state, in chapter 116, or otherwise, the agency shall have the authority to perform any and all acts minimally necessary including, but not limited to, the establishment and application of standards, procedures, rules, orders, variances, stipulation agreements, schedules of compliance, and permit conditions, consistent with and, therefore not less stringent than the provisions of the Federal Water Pollution Control Act, as amended, applicable to the participation by the state of Minnesota in the national pollutant discharge elimination system (NPDES); provided that this provision shall not be construed as a limitation on any powers or duties otherwise residing with the agency pursuant to any provision of law.\n(b) An activity that conveys or connects waters of the state without subjecting the transferred water to intervening industrial, municipal, or commercial use does not require a national pollutant discharge elimination system permit. This exemption does not apply to pollutants introduced by the activity itself to the water being transferred.\nThe commissioner must give public notice of a completed national pollutant discharge elimination system permit application for new municipal discharges in the official county newspaper of the county where the discharge is proposed.\n[Repealed, 2003 c 128 art 1 s 120]\n(a) The agency may issue a general permit to any category or subcategory of point source stormwater discharges that it deems administratively reasonable and efficient without making any findings under agency rules. Nothing in this subdivision precludes the agency from requiring an individual permit for a point source stormwater discharge if the agency finds that it is appropriate under applicable legal or regulatory standards.\n(b) Pursuant to this paragraph, the legislature authorizes the agency to adopt and enforce rules regulating point source stormwater discharges. No further legislative approval is required under any other legal or statutory provision whether enacted before or after May 29, 2003.\n(c) The agency shall develop performance standards, design standards, or other tools to enable and promote the implementation of low-impact development and other stormwater management techniques. For the purposes of this section, \"low-impact development\" means an approach to stormwater management that mimics a site's natural hydrology as the landscape is developed. Using the low-impact development approach, stormwater is managed on site and the rate and volume of predevelopment stormwater reaching receiving waters is unchanged. The calculation of predevelopment hydrology is based on native soil and vegetation.\nThe commissioner must provide an applicant for a national pollution discharge elimination system permit with a written summary of all available methods for the applicant to participate in the permit process, including an explanation of all procedures for challenging and appealing a decision of the agency or a permit requirement included in any draft of a final permit.\nThe commissioner must not require a sugar beet company that has a current national pollutant discharge elimination system permit or state disposal system permit to install an engineered liner for a stormwater runoff pond at a remote storage site for sugar beets unless a risk assessment confirms that there is significant impact on groundwater and that an engineered liner is necessary to prevent, control, or abate water pollution. For purposes of this subdivision, \"remote storage site for sugar beets\" means an area where sugar beets are temporarily stored before delivery to a sugar beet processing facility and that is not located on land adjacent to the processing facility.\n(a) In addition to its other powers and duties, the agency shall prepare the certification statement required to be submitted by an applicant for a pollution control equipment loan under the provisions of section 7(g) of the Small Business Act and section 8 of the Federal Water Pollution Control Act, as amended.\n(b) The agency certification shall state whether the loan applicant's proposed additions to, or alterations in, equipment facilities or methods of operation are necessary and adequate to comply with the requirements established under the Federal Water Pollution Control Act, as amended. The agency's certification statement shall comply with the requirements of Code of Federal Regulations, title 40, part 21.\n(c) The agency may identify small businesses eligible for loans under section 7(g) of the Small Business Act and section 8 of the Federal Water Pollution Control Act, as amended and assist in the preparation of loan application.\n(d) No fee shall be required of an applicant for any assistance provided under this subdivision.\nIn addition to its other powers and duties, the agency shall disseminate information and provide assistance regarding the small business administration program to guarantee payments or rentals on pollution control facility revenue bonds pursuant to Public Law 94-305 (June 4, 1976). The agency shall also encourage and assist governmental units to coordinate the joint or cooperative issuance of bonds guaranteed under this program to the end that the total amount of the bonds is sufficient in size to allow convenient sale.\nThe commissioner may not adopt rules under this section that regulate the use of the following aboveground storage tanks:\n(1) farm or residential tanks of 1,100 gallons or less capacity used for storing motor fuel for noncommercial purposes;\n(2) tanks of 1,100 gallons or less capacity used for storing heating oil for consumptive use on the premises where stored;\n(3) tanks used for storing liquids that are gaseous at atmospheric temperature and pressure; or\n(4) tanks used for storing agricultural chemicals regulated under chapter 18B, 18C, or 18D.\nAgency permits for major aboveground storage facilities may be issued for a term of up to ten years.\nState disposal system permits that are issued without a national pollutant discharge elimination system permit to feedlots shall be issued for a term of ten years. A feedlot with a permit under this subdivision is required to be in compliance with agency rules. A facility or operation change may require a permit modification if required under agency rules.\nThe commissioner shall, by January 15, 1998, and each even-numbered year thereafter, provide the chairs of the house of representatives and senate committees with primary jurisdiction over the agency's budget with the following information:\n(1) an updated list of all wastewater treatment upgrade and construction projects the agency has identified to meet existing and proposed water quality standards and regulations;\n(2) an estimate of the total costs associated with the projects listed in clause (1), and the projects' priority ranking under Minnesota Rules, chapter 7077. The costs of projects necessary to meet existing standards must be identified separately from the costs of projects necessary to meet proposed standards;\n(3) the commissioner's best estimate, developed in consultation with the commissioner of employment and economic development and affected permittees, of the increase in sewer service rates to the residents in the municipalities required to construct the projects listed in clause (1) resulting from the cost of these projects; and\n(4) a list of existing and proposed state water quality standards which are more stringent than is necessary to comply with federal law, either because the standard has no applicable federal water quality criteria, or because the standard is more stringent than the applicable federal water quality criteria.\n(a) The Pollution Control Agency may issue or amend permits to authorize pollutant discharges to a receiving water and may authorize reductions in loading from other sources to the same receiving water, if together the changes achieve a net decrease in the pollutant loading to the receiving water. A point source participating in a water quality offset authorized by this subdivision must have pollutant load reduction requirements for the traded pollutants based on water quality based effluent limits or wasteload allocations in place prior to the offset. The pollutant load reduction requirements in place prior to the offset must meet the requirements of this chapter and Minnesota Rules, parts 7050.0150, subpart 8; 7053.0205; and 7053.0215, including, but not limited to, requirements related to pollutant form, spatial loading, and temporal loading. The agency must require significant offset ratios for offsets between permitted sources and nonpermitted sources and must demonstrate how nonpermitted source offset credits make progress toward ensuring attainment of water quality standards. The agreement of a source to participate in an offset is voluntary. The agency shall track the pollutant offsets or \"trades\" implemented under this subdivision.\n(b) The legislature intends this subdivision to confirm and clarify the authority of the Pollution Control Agency to issue the authorized permits under prior law. The subdivision must not be construed as a legislative interpretation within the meaning of section 645.16, clause (8), or otherwise as the legislature's intent that the agency did not have authority to issue such a permit under prior law.\n(a) The agency may issue under requirement of the federal government national pollutant discharge elimination system permits for pesticide applications for the following designated use patterns:\n(1) mosquitoes and other flying insect pests;\n(2) forest canopy pests;\n(3) aquatic nuisance animals; and\n(4) vegetative pests and algae.\n(b) If the federal government no longer requires a permit for a designated use pattern, the agency must immediately terminate the permit. The agency shall not require permits for aquatic pesticide applications other than those designated use patterns required by the federal government.\n(c) The agency shall not regulate or require permits for the terrestrial application of pesticides or any other pesticide related permit except as provided in paragraph (a).",
	"repealed": false
}