{
	"id": "103F.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.421",
	"title": "103F.421 ENFORCEMENT.",
	"text": "(a) An adversely affected landowner, an elected or appointed official of the local government, or a soil and water conservation district board member may submit a written complaint to the local government if conditions exist that indicate there is excessive soil loss from a tract of land that affects another tract of land or body of water. The written complaint must contain:\n(1) the name and address of the landowner whose land is causing excessive soil loss;\n(2) the location of the tract of land with the excessive soil loss;\n(3) a description of land or water that is affected by the excessive soil loss; and\n(4) a description of the nature of the excessive soil loss and resulting sedimentation.\n(b) The local government shall submit the complaint to the soil and water conservation district for soil loss determination.\n(a) The soil and water conservation district shall determine the average soil loss in tons per acre per year of the tract of land cited in the complaint.\n(b) Representatives of the soil and water conservation district may enter public or private land to make an inspection for the determination of soil loss or to complete the report required by paragraph (c). The landowners must be notified of the time of the inspection and be given an opportunity to be present when the inspection is made.\n(c) The soil and water conservation district shall submit a report to the local government that states the average soil loss in tons per acre per year for each tract of land and whether the soil loss is excessive under the applicable soil loss limits. If the soil loss is excessive the report must include identification of existing management practices and a conservation plan and time schedule that will prevent excessive soil loss or reduce the soil loss to the most practicable extent.\n(a) If the soil and water conservation district report shows that soil loss from the tract of land is excessive and alternative practices are available to reduce the soil loss, the local government shall request the allegedly offending landowner to participate in mediation with the local government.\n(b) The local government may appoint the planning and zoning director, a planning commissioner, or other county official to act as a mediator. The local government may also contract with a mediation center to provide mediation services.\n(c) The landowner and the local government or its agent must attempt to agree on conservation practices and times to implement the practice that will reduce soil loss to the local soil loss limits.\n(d) A mediated settlement must be in writing and filed with the local government.\n(e) If the local government and the landowner do not agree to a mediated settlement, or if the landowner refuses to participate in mediation, the local government shall forward the complaint to the county attorney. The county attorney may dismiss the complaint or petition for a hearing under section 103F.425.\nThe landowner has 90 days after a complaint is substantiated to apply for state cost-sharing funds. Fifty percent of the cost share will be provided if the application is not made within 90 days after the settlement is filed, unless the soil and water conservation district or the board provides an extension. An extension must be granted if funds are not available.\n[Repealed, 1Sp2015 c 4 art 4 s 150]\nNothing in this section is intended to preclude the application of other applicable state or federal law.",
	"repealed": false
}