{
	"id": "84.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.153",
	"title": "84.153 PROPERTY; LEASING, RENTING.",
	"text": "(a) The commissioner is hereby authorized at public or private vendue and at such prices and under such terms and conditions as the commissioner may prescribe, to lease any buildings or lands not now authorized to be leased, acquired in the name of the state of Minnesota by any of the several divisions of the department which are not presently needed for the uses and purposes of any of the divisions of the department. The purposes for which such leases may be executed shall be in the furtherance of the interests of conservation and such uses shall not result in any permanent injury to the land. No such lease shall be made for a term to exceed two years and shall contain a provision for cancellation at any time by the commissioner upon three months written notice. All money received from these leases shall be credited to the fund from which the property was acquired, except an amount equal to the cost of maintenance of the leased property shall be credited to the fund charged with the cost of maintenance. Money credited for leased property maintenance is appropriated to the commissioner for that purpose.\n(b) The commissioner is hereby authorized to rent or lease to employees of the various divisions of the department such cabins, buildings, or living quarters as are now or may hereafter be constructed upon state-owned lands under the control of the several divisions of the department, when this occupancy is found to be necessary or beneficial to the work of the department. These leases or rental agreements shall be upon a month to month basis and provide for surrender by the lessee upon demand at any time the lessee's services with the state may be terminated, without the necessity of any written notice. All receipts from rents shall be paid in to the commissioner of management and budget and credited to the fund charged with the cost of maintenance of such buildings and are hereby appropriated for such use.\n(c) All instruments and transactions so negotiated shall be approved as to form, validity, and execution by the attorney general.\n(d) Hunting of wild game is prohibited on any land which has been posted by the lessee to prohibit hunting. Such prohibition shall apply to all persons including the lessee.",
	"repealed": false
}