{
	"id": "116.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.37",
	"title": "116.37 PCB; PROHIBITED USE.",
	"text": "Beginning January 1, 1978, no person shall use, possess, sell, purchase or manufacture PCB or any product containing PCB unless the use, possession, sale, purchase or manufacture of PCB or products containing PCB is exempted by the agency. If the agency finds after there is opportunity for a public hearing on an application presented by any person, that no substitutes or feasible alternatives are reasonably available for PCB or a product containing PCB or class of products containing PCB, it shall grant a certificate of exemption which shall clearly set out the permitted use, possession, sale or purchase of PCB or a PCB product containing PCB. If the agency grants a certificate of exemption, it shall be valid for all subsequent uses of PCB or products containing PCB if the subsequent uses are consistent with the terms and conditions of the certificate of exemption. In granting certificates of exemption the agency shall at all times consider the public health and safety threatened by the use of PCB. In the consideration of certificates of exemption for the use or replacement of existing electrical transformers and capacitors the agency shall review, but not be limited to, considerations of the safety of proven alternatives, replacement costs and rules controlling the final disposal of PCB.\nIn no event shall the certificate of exemption requirement or the labeling requirement of this section apply to any individual person who purchases or otherwise acquires a product containing PCB intended for consumer use in the home, provided that the use has previously been exempted by the agency and that the use is consistent with the terms and conditions of the certificate of exemption. Wastepaper, pulp, or other wood fiber materials purchased for use within this state in the manufacture of recycled paper products are exempt from the requirements of this section.\nBeginning July 1, 1977, no person in this state shall add PCB in the manufacture of any new item, product or material, nor shall any person in this state sell any new item, product or material to which PCB has been added unless the PCB or products containing PCB are conspicuously labeled to disclose the presence of PCB and the concentrations of PCB.\nThe agency shall promulgate rules by January 1, 1977, governing the granting of certificates of exemption and the requirements of labels specified in subdivision 3. The rules governing the requirement of labels specified in subdivision 3 may require other information relating to the public health and environmental effects of PCB and shall apply to persons holding certificates of exemption.\nViolations of this section and sections 116.36 and 116D.045 shall be subject to the provisions of section 115.071.",
	"repealed": false
}