{
	"id": "144E.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.011",
	"title": "144E.011 OFFICE OF EMERGENCY MEDICAL SERVICES.",
	"text": "The Office of Emergency Medical Services is established with the powers and duties established in law. In administering this chapter, the office must promote the public health and welfare, protect the safety of the public, and effectively regulate and support the operation of the emergency medical services system in this state.\nThe governor must appoint a director for the office with the advice and consent of the senate. The director must be in the unclassified service and must serve at the pleasure of the governor. The salary of the director shall be determined according to section 15A.0815. The director shall direct the activities of the office.\nThe director has the following powers and duties:\n(1) to administer and enforce this chapter and adopt rules as needed to implement this chapter. Rules for which notice is published in the State Register before July 1, 2026, may be adopted using the expedited rulemaking process in section 14.389;\n(2) to license ambulance services in the state and regulate their operation;\n(3) to establish and modify primary service areas;\n(4) to designate an ambulance service as authorized to provide service in a primary service area and to remove an ambulance service's authorization to provide service in a primary service area;\n(5) to register medical response units in the state and regulate their operation;\n(6) to certify emergency medical technicians, advanced emergency medical technicians, community emergency medical technicians, paramedics, and community paramedics and to register emergency medical responders;\n(7) to approve education programs for ambulance service personnel and emergency medical responders and to administer qualifications for instructors of education programs;\n(8) to administer grant programs related to emergency medical services;\n(9) to report to the legislature, by February 15 each year, on the work of the office and the advisory councils in the previous calendar year and with recommendations for any needed policy changes related to emergency medical services, including but not limited to improving access to emergency medical services, improving service delivery by ambulance services and medical response units, and improving the effectiveness of the state's emergency medical services system. The director must develop the reports and recommendations in consultation with the office's deputy directors and advisory councils;\n(10) to investigate complaints against and hold hearings regarding ambulance services, ambulance service personnel, and emergency medical responders and to impose disciplinary action or otherwise resolve complaints; and\n(11) to perform other duties related to the provision of emergency medical services in the state.\nThe director may employ personnel in the classified service and unclassified personnel as necessary to carry out the duties of this chapter.\nThe director must prepare a work plan to guide the work of the office. The work plan must be updated biennially.",
	"repealed": false
}