{
	"id": "171.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.05",
	"title": "171.05 INSTRUCTION PERMIT.",
	"text": "(a) Any person who is 18 or more years of age and who, except for a lack of instruction in operating a motor vehicle, would otherwise be qualified to obtain a class D driver's license under this chapter, may apply for an instruction permit and the department shall issue the permit. The instruction permit entitles the applicant to drive a motor vehicle for which a class D license is valid upon the highways for a period of two years if the permit holder:\n(1) has the permit in immediate possession; and\n(2) is driving the vehicle while accompanied by an adult licensed driver who is actually occupying a seat beside the driver.\n(b) Any license of a lower class may be used as an instruction permit to operate a vehicle requiring a higher class license for a period of six months after passage of the written test or tests required for the higher class and when the licensee is accompanied by and receiving instruction from a holder of the appropriate higher class license. A copy of the record of examination taken for the higher class license must be carried by the driver while using the lower class license as an instruction permit.\nAn applicant who has received an instruction permit under subdivision 1 and has not previously been licensed to drive in Minnesota or in another jurisdiction must possess the instruction permit for not less than six months for an applicant who is 18 years of age, and not less than three months for all other applicants, before qualifying for a driver's license. An applicant with an instruction permit from another jurisdiction must be credited with the amount of time that permit has been held.\nNotwithstanding subdivision 1, the commissioner shall not issue an instruction permit to a person under age 18 if the person has ever been convicted of a violation of section 169A.20, 169A.33, or 169A.35; a violation of a provision of sections 169A.50 to 169A.53; a violation of section 171.177; or a crash-related moving violation.\n(a) The department may issue an instruction permit to an applicant who is 15, 16, or 17 years of age and who:\n(1) has completed a course of driver education in another state, has a previously issued valid license from another state, or:\n(i) is enrolled in behind-the-wheel training in a driver education program; and\n(ii) has completed:\n(A) the classroom phase of instruction in a driver education program that includes classroom and behind-the-wheel training;\n(B) 15 hours of classroom instruction in a driver education program that presents classroom and behind-the-wheel instruction concurrently;\n(C) home-classroom driver training, when the student is receiving full-time instruction in a home school within the meaning of sections 120A.22 and 120A.24, the student is working toward a home school diploma, the home-classroom driver training materials are approved by the commissioner of public safety, and the student's parent has certified the student's home school and home-classroom driver training status on the form approved by the commissioner;\n(D) a teleconference driver education program authorized by section 171.395; or\n(E) an online driver education program authorized by section 171.396;\n(2) has passed a test of the applicant's eyesight;\n(3) has passed a department-administered test of the applicant's knowledge of traffic laws;\n(4) has completed the required application, which must be approved by (i) either parent when both reside in the same household as the minor applicant or, if otherwise, then (ii) the parent or spouse of the parent having custody or, in the event there is no court order for custody, then (iii) the parent or spouse of the parent with whom the minor is living or, if items (i) to (iii) do not apply, then (iv) the guardian having custody of the minor, (v) the foster parent or the director of the transitional living program in which the child resides or, in the event a person under the age of 18 has no living father, mother, or guardian, or is married or otherwise legally emancipated, then (vi) the applicant's adult spouse, adult close family member, or adult employer; provided, that the approval required by this clause contains a verification of the age of the applicant and the identity of the parent, guardian, adult spouse, adult close family member, or adult employer; and\n(5) has paid all fees required in section 171.06, subdivision 2.\n(b) In addition, the applicant may submit a certification stating that a primary driving supervisor has completed the supplemental parental curriculum under section 171.0701, subdivision 1a, for the purposes of provisional license requirements under section 171.055, subdivision 1, paragraph (a), clause (6). The certification must be completed by a driver education instructor, as defined under section 171.0701, subdivision 1a.\n(c) For the purposes of determining compliance with the certification of paragraph (a), clause (1), item (ii), subitem (C), the commissioner may request verification of a student's home school status from the superintendent of the school district in which the student resides and the superintendent shall provide that verification.\n(d) A driver education program under this subdivision includes a public, private, or commercial program and must be approved by the commissioner.\n(e) The instruction permit is valid for two years from the date of application and may be renewed upon payment of a fee equal to the fee for issuance of an instruction permit under section 171.06, subdivision 2.\nAn applicant who has applied for and received an instruction permit pursuant to subdivision 2 must possess the instruction permit for not less than six months before qualifying for a driver's license.\n(a) This subdivision applies to persons who have applied for and received an instruction permit under subdivision 2.\n(b) The permit holder may, with the permit in possession, operate a motor vehicle, but must be accompanied by and be under the supervision of a certified driver education instructor, the permit holder's parent or guardian, or another licensed driver age 21 or older. The supervisor must occupy the seat beside the permit holder.\n(c) The permit holder may not operate a vehicle while communicating over, or otherwise operating, a cellular or wireless telephone, whether handheld or hands free, when the vehicle is in motion. The permit holder may assert as an affirmative defense that the violation was made for the sole purpose of obtaining emergency assistance to prevent a crime about to be committed, or in the reasonable belief that a person's life or safety was in danger. Violation of this paragraph is a petty misdemeanor subject to section 169.89, subdivision 2.\n(d) The permit holder must maintain a driving record free of convictions for moving violations, as defined in section 171.04, subdivision 1, and free of convictions for violation of section 169A.20, 169A.33, 169A.35, sections 169A.50 to 169A.53, or section 171.177. If the permit holder drives a motor vehicle in violation of the law, the commissioner shall suspend, cancel, or revoke the permit in accordance with the statutory section violated.\nNotwithstanding any provision in subdivision 1 to the contrary, the department, upon application and payment of the fee prescribed in section 171.02, subdivision 3, may issue a motorized bicycle instruction permit to an applicant who is 15 years of age and who has successfully completed the written portion of the examination prescribed by the commissioner. The holder of this instruction permit who has the permit in possession may operate a motorized bicycle within one mile of the holder's residence for the purpose of practicing to take the operator portion of the examination prescribed by the commissioner.\nThe commissioner of public safety shall adopt rules to carry out the provisions of this section. The rules adopted under this section are exempt from the rulemaking provisions of chapter 14. The rules are subject to section 14.386, except that section 14.386, paragraph (b), does not apply.",
	"repealed": false
}