{
	"id": "148.9984",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9984",
	"title": "148.9984 LICENSE RENEWAL REQUIREMENTS.",
	"text": "A license must be renewed every two years.\nAt least 60 calendar days before the renewal deadline date, the board must mail a renewal notice to the licensee's last known address on file with the board. The notice must include instructions for accessing an online application for license renewal, the renewal deadline, and notice of fees required for renewal. The licensee's failure to receive notice does not relieve the licensee of the obligation to meet the renewal deadline and other requirements for license renewal.\n(a) To renew a license, a licensee must submit to the board:\n(1) a completed and signed application for license renewal;\n(2) the license renewal fee as specified under section 148.9995; and\n(3) evidence satisfactory to the board that the licensee holds a current and active national certification as a behavior analyst from the certifying entity or otherwise meets renewal requirements as established by the board, in consultation with the advisory council.\n(b) The application for license renewal and fee must be postmarked or received by the board by the end of the day on which the license expires or the following business day if the expiration date falls on a Saturday, Sunday, or holiday. A renewal application that is not completed and signed, or that is not accompanied by the correct fee, is void and must be returned to the licensee.\nIf a licensee's application for license renewal is postmarked or received by the board by the end of the business day on the expiration date of the license or the following business day if the expiration date falls on a Saturday, Sunday, or holiday, the licensee may continue to practice after the expiration date while the application for license renewal is pending with the board.\nIf the application for license renewal is postmarked or received after the expiration date of the license or the following business day if the expiration date falls on a Saturday, Sunday, or holiday, the licensee must pay a biennial renewal late fee as specified by section 148.9995, in addition to the renewal fee, before the licensee's application for license renewal will be considered by the board.",
	"repealed": false
}