{
	"id": "383A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.12",
	"title": "383A.12 HEALTH DEPARTMENT.",
	"text": "It is the purpose of this subdivision to provide enabling authority for Ramsey County to establish a comprehensive health department and to provide coordinated public and mental health services to the residents of Ramsey County. The term \"department\" means the comprehensive health department established in Ramsey County. This subdivision is in addition to any statutory authority now existing for the establishment of a health department for Ramsey County.\nRamsey County may create a county health department which is under the supervision and control of the county board.\n(a) The responsibilities assigned to the department shall include but not be limited to all or some of the responsibilities as set forth in paragraphs (b) to (m).\n(b) The powers and duties vested in or imposed upon a local health board as provided in Minnesota Statutes 1969, chapter 145, for the area of all of Ramsey County.\n(c) The powers and duties imposed upon a board of county commissioners to employ public health nurses as provided in Minnesota Statutes 1969, chapter 145.\n(d) Health services for school children vested in or imposed upon a school district when the board of education of the school district petitions the county to provide the services by contract or otherwise for its district.\n(e) The powers and duties vested in or imposed upon the agent of a community health board as authorized under section 145A.04 of a city inside the county of Ramsey who has elected to maintain local registration of vital records and the powers and duties of the court administrator of the district court of Ramsey County as local registrar of vital records.\n(f) The county may authorize the health department to operate a mental health program and may utilize the authorities of the community mental health boards as set forth in sections 245.61 to 245.66. When so authorized, the county board shall suffice to function in lieu of the community mental health board provided for in section 245.66.\n(g) Prepare and have published an annual report of the work of the health department.\n(h) Recommend to the governing body of a governmental unit inside the county of Ramsey local legislation pertaining to public health.\n(i) The department may be authorized to provide other health services as may be directed by the county board if the services are authorized by law to be provided by the county or by any agency or department thereof.\n(j) The department may be authorized to buy services from other agencies, public or private, that are providing services consistent with health department purposes.\n(k) The department may be authorized to establish fee schedules based on ability to pay for services rendered.\n(l) The county may adopt and enforce rules for the preservation of public health applicable to the whole or a part of the county, but no rule may supersede higher standards established by statute, the rules of the commissioner of the state department of health, or provisions of the charter or ordinances of a municipality inside the county pertaining to the same subject. Nothing in this paragraph shall prohibit a municipality from adopting ordinances or resolutions for the regulation of the public health setting higher standards than those of the commissioner of the state Department of Health, the county board, or state law.\n(m) The health department shall cause all laws and rules relating to public health to be obeyed and enforced inside its jurisdictional area.\nThe health department shall be operated and maintained from funds appropriated for and fees collected by the department together with the state, federal, and private grants that are made available to it or to any of the local governmental units in the county of Ramsey for health purposes.\nThe county shall annually prepare and approve a budget of the department's proposed expenditures for the ensuing fiscal year.\nUpon assignment by the county board of the responsibilities under subdivision 2, the powers and duties of a department board, agency, governmental subdivision, or bureau whose powers and duties have been placed in the health department shall end and its records and personnel relating to the powers and duties are transferred to the health department.\nThe county shall appoint an authorized agent who shall be designated the director of public health and who shall be responsible for the operation of the department. The county shall fix the officer's salary.\nThe authorized agent must be a licensed physician experienced or trained in public health administration, or instead a person, other than a physician with training or experience in public health administration. If the appointee is not a physician, the county board shall provide, in addition, the services of a licensed physician that are necessary on either a part-time or full-time basis and provide reasonable compensation therefor. The director of the department shall select subordinate personnel subject to the approval of the county board.\nEach person transferred to the health department by this subdivision and each employee under a merit system governing public employees is considered to have qualified for a permanent position of similar class and grade in the classified civil service of Ramsey County, without reduction in pay or seniority, and without examination. Each other person so transferred who is a full-time officer or employee shall take, within six months after the organization of the health department, and subject to civil service rules of Ramsey County, a noncompetitive, practical, qualifying examination. The qualifying examination may involve only the duties of the position occupied immediately prior to the organization of the health department or the position occupied on the date the examination is given, whichever examination the officer or employee elects to take. A person taking the qualifying examination who possesses the ability and capacity to perform the duties of the position, in a reasonably efficient manner, shall be given a permanent civil service status in the Ramsey County civil service. A person who willfully refuses to take the examination when offered without reasonable excuse shall be removed from the position held immediately. A person taking the examination who fails to pass shall be removed from the position held at the end of 60 days after receipt of notice of failure to pass. A person required to take a qualifying examination shall not be laid off, suspended, discharged, or reduced in pay or position except in accordance with the provisions of laws applicable to members of the classified Ramsey County civil service having civil service status without having completed the qualifying examination and being notified of the result thereof.\nA part-time officer or employee of a department, board, agency, governmental subdivision or bureau whose powers and duties are placed in the health department may be transferred upon the organization of the health department and may become officers or employees thereof.\nNo resolution adopted by the Board of County Commissioners of Ramsey County establishing a county health department is effective inside each of the following governmental units unless approved by the governing body of the particular unit, namely: city of Saint Paul; city of White Bear Lake; cities of Arden Hills, Blaine, Falcon Heights, Gem Lake, Little Canada, Lauderdale, Maplewood, Mounds View, New Brighton, North Oaks, North Saint Paul, Roseville, Saint Anthony, Shoreview, Spring Lake Park, Vadnais Heights; town of White Bear. The resolution is effective in a unit upon the approval of that unit's governing body.\nThe Ramsey County nursing service presently existing shall not be discontinued unless the discontinuance is approved by two-thirds of the governing bodies of the governmental units listed in subdivision 7.\nNo governmental unit listed in subdivision 7 shall pay for any services provided by this section until its governing body has approved the resolution as provided in subdivision 7.\nNone of the functions of the presently existing city health departments in the county of Ramsey may be abandoned by the county health department without proper provision for the exercise of the function by some agency of government.",
	"repealed": false
}