{
	"id": "221.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.091",
	"title": "221.091 LOCAL GOVERNMENT AUTHORITY.",
	"text": "Sections 221.012 to 221.291 do not authorize the use by a carrier of a public highway in a city of the first class in violation of a charter provision or ordinance of the city in effect January 1, 1925, unless the charter provision or ordinance is repealed after that date. In addition, sections 221.012 to 221.291 do not (1) curtail the right of a city to reasonably regulate or control the routing, parking, speed, or safety of operation of a motor vehicle operated by a carrier under the terms of those sections, (2) curtail the general police power of the city over its highways, or (3) abrogate any provision of the city's charter requiring certain conditions to be complied with before a carrier can use the highways of the city; and these rights and powers are expressly reserved and granted to the city. However, no city shall prohibit or deny the use of the public highways within its territorial boundaries by a carrier for transporting passengers or property received within its boundaries to destinations beyond the city's boundaries, or for transporting passengers or property from points beyond the city's boundaries to destinations within the city's boundaries, or for transporting passengers or property from points beyond the city's boundaries through the city to points beyond the city's boundaries when the carrier is operating pursuant to a certificate of registration issued under this chapter or a permit issued by the commissioner under section 221.84.\n(a) A statutory or home rule charter city that licenses and regulates small vehicle passenger service must do so by ordinance. The ordinance must, at a minimum, provide for driver qualifications, insurance, vehicle safety, and periodic vehicle inspections.\n(b) A statutory or home rule charter city that has adopted an ordinance complying with this subdivision may enforce the registration requirement in section 221.021.\n(c) A statutory or home rule charter city that regulates, by ordinance, pedicabs, rickshaws, or other similar vehicles used for passenger service may permit authorized vehicles to be equipped with an electric motor that meets the requirements for an electric-assisted bicycle under section 169.011, subdivision 27, clause (3).\nNotwithstanding any other law:\n(a) The Metropolitan Airports Commission may regulate ground transportation to and from an airport under its jurisdiction, subject to paragraphs (b), (c), (d), and (e). The authority under this paragraph includes, but is not limited to, regulating the number and types of transportation services, making concession agreements, and establishing vehicle standards.\n(b) The Metropolitan Airports Commission may regulate small passenger vehicles, including taxicabs, serving an airport under its jurisdiction only by ordinance. An ordinance adopted under this paragraph must at a minimum (1) define taxicabs, (2) provide for driver qualifications, insurance, and vehicle safety, and (3) provide for issuance of permits to taxicabs and other small passenger vehicles. An ordinance under this paragraph may limit the number of permits issued to taxicabs. An ordinance under this paragraph may not provide for making concession agreements relating to small passenger vehicle service, including taxicabs.\n(c) If the Metropolitan Airports Commission determines that it is in the public interest to reduce the number of annual taxicab permits issued at the Minneapolis-St. Paul International Airport, the commission shall first reduce the number of permits in the following order:\n(1) permits held by permit holders who have not picked up a passenger at the Minneapolis-St. Paul International Airport within three months immediately preceding the decision to reduce permits;\n(2) permits issued to permit holders who have not continuously held an annual or semiannual permit prior to and since January 1, 2005; and\n(3) permits issued to corporations that have sold or transferred at least a majority of the shares of the corporation since January 1, 2005.\n(d) In deciding whether it is in the public interest to reduce the number of taxicab permits, the commission shall consider, at a minimum, the following factors:\n(1) the number of taxicab permits issued in relation to the number of taxicab customers at the Minneapolis-St. Paul International Airport;\n(2) the wait times for taxicab drivers; and\n(3) the impact to current permit holders, including, but not limited to, permit holders who have held a permit during a permitting period prior to January 1, 2005.\n(e) If the Metropolitan Airports Commission allows for taxicab permit transfers, the commission shall not prohibit permit transfers between sole proprietors, individual owner taxicab operators, or corporations, unless the commission also prohibits permit transfers from one corporation to another corporation.",
	"repealed": false
}