{
	"id": "256I.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/256I.04",
	"title": "256I.04 ELIGIBILITY FOR HOUSING SUPPORT PAYMENT.",
	"text": "An individual is eligible for and entitled to a housing support payment to be made on the individual's behalf if the agency has approved the setting where the individual will receive housing support and the individual meets the requirements in paragraph (a), (b), (c), or (d).\n(a) The individual is aged, blind, or is over 18 years of age with a disability as determined under the criteria used by the title II program of the Social Security Act, and meets the resource restrictions and standards of section 256P.02, and the individual's countable income after deducting the (1) exclusions and disregards of the SSI program, (2) the medical assistance personal needs allowance under section 256B.35, and (3) an amount equal to the income actually made available to a community spouse by an elderly waiver participant under the provisions of sections 256B.0575, paragraph (a), clause (4), and 256B.058, subdivision 2, is less than the monthly rate specified in the agency's agreement with the provider of housing support in which the individual resides.\n(b) The individual meets a category of eligibility under section 256D.05, subdivision 1, paragraph (a), clauses (1), (3), (4) to (8), and (13), and paragraph (b), if applicable, and the individual's resources are less than the standards specified by section 256P.02, and the individual's countable income as determined under section 256P.06, less the medical assistance personal needs allowance under section 256B.35 is less than the monthly rate specified in the agency's agreement with the provider of housing support in which the individual resides.\n(c) The individual lacks a fixed, adequate, nighttime residence upon discharge from a residential behavioral health treatment program, as determined by treatment staff from the residential behavioral health treatment program. An individual is eligible under this paragraph for up to three months, including a full or partial month from the individual's move-in date at a setting approved for housing support following discharge from treatment, plus two full months.\n(d) The individual meets the criteria related to establishing a certified disability or disabling condition in paragraph (a) or (b) and lacks a fixed, adequate, nighttime residence upon discharge from a correctional facility, as determined by an authorized representative from a Minnesota-based correctional facility. An individual is eligible under this paragraph for up to three months, including a full or partial month from the individual's move-in date at a setting approved for housing support following release, plus two full months. Any income received by people who meet the disabling condition criteria established in paragraph (a) or (b) is not countable for the duration of eligibility under this paragraph.\n(a) A county agency may not approve a housing support payment for an individual in any setting with a rate in excess of the MSA equivalent rate for more than 30 days in a calendar year unless the individual has a professional statement of need under section 256I.03, subdivision 12.\n(b) If a county agency determines that an applicant is ineligible due to not meeting eligibility requirements under this section, a county agency may accept a signed personal statement from the applicant in lieu of documentation verifying ineligibility.\n(c) Effective July 1, 2016, to be eligible for supplementary service payments, providers must enroll in the provider enrollment system identified by the commissioner.\nHousing support payments made on behalf of persons eligible under subdivision 1, paragraph (a), are optional state supplements to the SSI program.\nHousing support payments made on behalf of persons eligible under subdivision 1, paragraph (b), are considered interim assistance payments to applicants for the federal SSI program.\nAn individual who has met the eligibility requirements of subdivision 1 shall have a housing support payment made on the individual's behalf from the first day of the month of the date of application or the first day of the month in which all eligibility factors have been met, whichever is later.\n(a) Except as provided in paragraph (b), an agency may not enter into an agreement with an establishment to provide housing support unless:\n(1) the establishment is licensed by the Department of Health as a hotel and restaurant; a board and lodging establishment; a boarding care home before March 1, 1985; or a supervised living facility, and the service provider for residents of the facility is licensed under chapter 245A. However, an establishment licensed by the Department of Health to provide lodging need not also be licensed to provide board if meals are being supplied to residents under a contract with a food vendor who is licensed by the Department of Health;\n(2) the residence is: (i) licensed by the commissioner of human services under Minnesota Rules, parts 9555.5050 to 9555.6265; (ii) certified by a county human services agency prior to July 1, 1992, using the standards under Minnesota Rules, parts 9555.5050 to 9555.6265; (iii) licensed by the commissioner under Minnesota Rules, parts 2960.0010 to 2960.0120, with a variance under section 245A.04, subdivision 9; or (iv) licensed under section 245D.02, subdivision 4a, as a community residential setting by the commissioner of human services; or\n(3) the facility is licensed under chapter 144G and provides three meals a day.\n(b) The requirements under paragraph (a) do not apply to establishments exempt from state licensure because they are:\n(1) located on Indian reservations and subject to tribal health and safety requirements; or\n(2) supportive housing establishments where an individual has an approved habitability inspection and an individual lease agreement.\n(c) Supportive housing establishments that serve individuals who have experienced long-term homelessness and emergency shelters must participate in the homeless management information system and a coordinated assessment system as defined by the commissioner.\n(d) Effective July 1, 2016, an agency shall not have an agreement with a provider of housing support unless all staff members who have direct contact with recipients:\n(1) have skills and knowledge acquired through one or more of the following:\n(i) a course of study in a health- or human services-related field leading to a bachelor of arts, bachelor of science, or associate's degree;\n(ii) one year of experience with the target population served;\n(iii) experience as a mental health certified peer specialist according to section 256B.0615; or\n(iv) meeting the requirements for unlicensed personnel under sections 144A.43 to 144A.483;\n(2) hold a current driver's license appropriate to the vehicle driven if transporting recipients;\n(3) complete training on vulnerable adults mandated reporting and child maltreatment mandated reporting, where applicable; and\n(4) complete housing support orientation training offered by the commissioner.\n(a) Agreements between agencies and providers of housing support must be in writing on a form developed and approved by the commissioner and must specify the name and address under which the establishment subject to the agreement does business and under which the establishment, or service provider, if different from the establishment, is licensed by the Department of Health or the Department of Human Services; the specific license or registration from the Department of Health or the Department of Human Services held by the provider and the number of beds subject to that license; the address of the location or locations at which housing support is provided under this agreement; the per diem and monthly rates that are to be paid from housing support funds for each eligible resident at each location; the number of beds at each location which are subject to the agreement; whether the license holder is a not-for-profit corporation under section 501(c)(3) of the Internal Revenue Code; and a statement that the agreement is subject to the provisions of sections 256I.01 to 256I.06 and subject to any changes to those sections.\n(b) Providers are required to verify the following minimum requirements in the agreement:\n(1) current license or registration, including authorization if managing or monitoring medications;\n(2) all staff who have direct contact with recipients meet the staff qualifications;\n(3) the provision of housing support;\n(4) the provision of supplementary services, if applicable;\n(5) reports of adverse events, including recipient death or serious injury;\n(6) submission of residency requirements that could result in recipient eviction; and\n(7) confirmation that the provider will not limit or restrict the number of hours an applicant or recipient chooses to be employed, as specified in subdivision 5.\n(c) Agreements may be terminated with or without cause by the commissioner, the agency, or the provider with two calendar months prior notice. The commissioner may immediately terminate an agreement under subdivision 2d.\n(a) Effective July 1, 2016, a provider of housing support must initiate background studies in accordance with chapter 245C of the following individuals:\n(1) controlling individuals as defined in section 245A.02;\n(2) managerial officials as defined in section 245A.02; and\n(3) all employees and volunteers of the establishment who have direct contact with recipients, or who have unsupervised access to recipients, their personal property, or their private data.\n(b) The provider of housing support must maintain compliance with all requirements established for entities initiating background studies under chapter 245C.\n(c) Effective July 1, 2017, a provider of housing support must demonstrate that all individuals required to have a background study according to paragraph (a) have a notice stating either that:\n(1) the individual is not disqualified under section 245C.14; or\n(2) the individual is disqualified, but the individual has been issued a set-aside of the disqualification for that setting under section 245C.22.\n(a) Housing support must be provided to the satisfaction of the commissioner, as determined at the sole discretion of the commissioner's authorized representative, and in accordance with all applicable federal, state, and local laws, ordinances, rules, and regulations, including business registration requirements of the Office of the Secretary of State. A provider shall not receive payment for room and board or supplementary services found by the commissioner to be performed or provided in violation of federal, state, or local law, ordinance, rule, or regulation.\n(b) The commissioner has the right to suspend or terminate the agreement immediately when the commissioner determines the health or welfare of the housing or service recipients is endangered, or when the commissioner has reasonable cause to believe that the provider has breached a material term of the agreement under subdivision 2b.\n(c) Notwithstanding paragraph (b), if the commissioner learns of a curable material breach of the agreement by the provider, the commissioner shall provide the provider with a written notice of the breach and allow ten days to cure the breach. If the provider does not cure the breach within the time allowed, the provider shall be in default of the agreement and the commissioner may terminate the agreement immediately thereafter. If the provider has breached a material term of the agreement and cure is not possible, the commissioner may immediately terminate the agreement.\n(a) Except for facilities with only a board and lodging license, when housing support staff are also operating under a license issued by the Department of Health or the Department of Human Services, the minimum staff qualification requirements for the setting shall be the qualifications listed under the related licensing standards.\n(b) A background study completed for the licensed service must also satisfy the background study requirements under this section, if the provider has established the background study contact person according to chapter 245C and as directed by the Department of Human Services.\n(a) In authorized settings under subdivision 2a, providers shall ensure that participants have at a minimum:\n(1) food preparation and service for three nutritional meals a day on site;\n(2) a bed, clothing storage, linen, bedding, laundering, and laundry supplies or service;\n(3) housekeeping, including cleaning and lavatory supplies or service; and\n(4) maintenance and operation of the building and grounds, including heat, water, garbage removal, electricity, telephone for the site, cooling, supplies, and parts and tools to repair and maintain equipment and facilities.\n(b) In addition, when providers serve participants described in subdivision 1, paragraph (c), the providers are required to assist the participants in applying for continuing housing support payments before the end of the eligibility period.\nSecure crisis shelters for victims of domestic abuse and their children designated by the Minnesota Department of Public Safety are not eligible for housing support under this chapter.\nProviders of supplementary services shall ensure that recipients have, at a minimum, assistance with services as identified in the recipient's professional statement of need under section 256I.03, subdivision 12. Providers of supplementary services shall maintain case notes with the date and description of services provided to individual recipients.\n(a) Agencies shall not enter into agreements for new housing support beds with total rates in excess of the MSA equivalent rate except:\n(1) for establishments licensed under chapter 245D provided the facility is needed to meet the census reduction targets for persons with developmental disabilities at regional treatment centers;\n(2) up to 80 beds in a single, specialized facility located in Hennepin County that will provide housing for chronic inebriates who are repetitive users of detoxification centers and are refused placement in emergency shelters because of their state of intoxication, and planning for the specialized facility must have been initiated before July 1, 1991, in anticipation of receiving a grant from the Housing Finance Agency under section 462A.05, subdivision 20a, paragraph (b);\n(3) notwithstanding the provisions of subdivision 2a, for up to 226 supportive housing units in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County for homeless adults with a mental illness, a history of substance abuse, or human immunodeficiency virus or acquired immunodeficiency syndrome. For purposes of this section, \"homeless adult\" means a person who is living on the street or in a shelter or discharged from a regional treatment center, community hospital, or residential treatment program and has no appropriate housing available and lacks the resources and support necessary to access appropriate housing. At least 70 percent of the supportive housing units must serve homeless adults with mental illness, substance abuse problems, or human immunodeficiency virus or acquired immunodeficiency syndrome who are about to be or, within the previous six months, have been discharged from a regional treatment center, or a state-contracted psychiatric bed in a community hospital, or a residential mental health or substance use disorder treatment program. If a person meets the requirements of subdivision 1, paragraph (a), and receives a federal or state housing subsidy, the housing support rate for that person is limited to the supplementary rate under section 256I.05, subdivision 1a, and is determined by subtracting the amount of the person's countable income that exceeds the MSA equivalent rate from the housing support supplementary service rate. A resident in a demonstration project site who no longer participates in the demonstration program shall retain eligibility for a housing support payment in an amount determined under section 256I.06, subdivision 8, using the MSA equivalent rate. Service funding under section 256I.05, subdivision 1a, will end June 30, 1997, if federal matching funds are available and the services can be provided through a managed care entity. If federal matching funds are not available, then service funding will continue under section 256I.05, subdivision 1a;\n(4) for an additional two beds, resulting in a total of 32 beds, for a facility located in Hennepin County providing services for men with and recovering from substance use disorder that has had a housing support contract with the county and has been licensed as a board and lodge facility with special services since 1980;\n(5) for a housing support provider located in the city of St. Cloud, or a county contiguous to the city of St. Cloud, that operates a 40-bed facility, that received financing through the Minnesota Housing Finance Agency Ending Long-Term Homelessness Initiative and serves clientele with substance use disorder, providing 24-hour-a-day supervision;\n(6) for a new 65-bed facility in Crow Wing County that will serve persons with substance use disorder, operated by a housing support provider that currently operates a 304-bed facility in Minneapolis, and a 44-bed facility in Duluth;\n(7) for a housing support provider that operates two ten-bed facilities, one located in Hennepin County and one located in Ramsey County, that provide community support and 24-hour-a-day supervision to serve the mental health needs of individuals who have chronically lived unsheltered; and\n(8) for a facility authorized for recipients of housing support in Hennepin County with a capacity of up to 48 beds that has been licensed since 1978 as a board and lodging facility and that until August 1, 2007, operated as a licensed substance use disorder treatment program.\n(b) An agency may enter into a housing support agreement for beds with rates in excess of the MSA equivalent rate in addition to those currently covered under a housing support agreement if the additional beds are only a replacement of beds with rates in excess of the MSA equivalent rate which have been made available due to closure of a setting, a change of licensure or certification which removes the beds from housing support payment, or as a result of the downsizing of a setting authorized for recipients of housing support. The transfer of available beds from one agency to another can only occur by the agreement of both agencies.\nFor participants in the Minnesota supportive housing demonstration program under subdivision 3, paragraph (a), clause (3), notwithstanding the provisions of section 256I.06, subdivision 8, the amount of the room and board rate must be calculated by subtracting 30 percent of the recipient's adjusted income as defined by the United States Department of Housing and Urban Development for the Section 8 program from the fair market rent established for the recipient's living unit by the federal Department of Housing and Urban Development. This payment shall be regarded as a state housing subsidy for the purposes of subdivision 3. Notwithstanding the provisions of section 256I.06, subdivision 6, the recipient's countable income will only be adjusted when a change of greater than $100 in a month occurs or upon annual redetermination of eligibility, whichever is sooner.\nA provider is prohibited from limiting or restricting the number of hours an applicant or recipient is employed.",
	"repealed": false
}