{
	"id": "123B.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.58",
	"title": "123B.58 DISABILITY ACCESS AND FIRE SAFETY IMPROVEMENTS TO SCHOOL BUILDINGS.",
	"text": "If a board has insufficient money in its capital expenditure fund to remove architectural barriers from a building it owns in order to allow a pupil to attend a school in the pupil's attendance area or to meet the needs of an employee with a disability, a district may submit an application to the commissioner containing at least the following:\n(1) program modifications that the board considered, such as relocating classrooms, providing an accessible unisex bathroom, providing alternative library resources, or using special equipment, such as bookcarts, and the reasons the modifications were not feasible;\n(2) a description of the proposed building modifications and the cost of the modifications; and\n(3) the age and market value of the building.\nIndividuals developing an application for a district shall complete a workshop, developed jointly by the commissioner and the Council on Disability, about access criteria.\nIn consultation with the Council on Disability, the commissioner shall develop criteria to determine the cost-effectiveness of removing barriers in older buildings.\nThe commissioner shall approve or disapprove an application within 60 days of receiving it.\nIf a district has insufficient money in its capital expenditure fund to make modifications to a school building required by a fire inspection conducted according to section 299F.47, the district may submit an application to the commissioner containing information required by the commissioner. The commissioner shall approve or disapprove of the application according to criteria established by the commissioner. The criteria shall take into consideration the cost-effectiveness of making modifications to older buildings.\nThe district may levy up to $300,000 under this section, as approved by the commissioner. The approved amount may be levied over eight or fewer years.\nNotwithstanding subdivision 3, a district that has combined or consolidated may levy up to 50 percent times $300,000 times the number of former districts that operated on June 30, 1991, in the area that now makes up the combined or consolidated district. The approved amount is reduced by any amount levied under subdivision 3 in the consolidated or combined district or in the former districts that make up the consolidated or combined district. Levy authority under this subdivision expires at the same time as levy authority under subdivision 3.",
	"repealed": false
}