{
	"id": "518A.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.34",
	"title": "518A.34 COMPUTATION OF CHILD SUPPORT OBLIGATIONS.",
	"text": "(a) To determine the presumptive child support obligation of a parent, the court shall follow the procedure set forth in this section.\n(b) To determine the obligor's basic support obligation, the court shall:\n(1) determine the gross income of each parent under section 518A.29;\n(2) calculate the parental income for determining child support (PICS) of each parent, by subtracting from the gross income the credit, if any, for each parent's nonjoint children under section 518A.33;\n(3) determine the percentage contribution of each parent to the combined PICS by dividing the combined PICS into each parent's PICS;\n(4) determine the combined basic support obligation by application of the guidelines in section 518A.35;\n(5) determine each parent's share of the combined basic support obligation by multiplying the percentage figure from clause (3) by the combined basic support obligation in clause (4); and\n(6) apply the parenting expense adjustment formula provided in section 518A.36 to determine the obligor's basic support obligation.\n(c) If the parents have split custody of joint children, child support must be calculated for each joint child as follows:\n(1) the court shall determine each parent's basic support obligation under paragraph (b) and include the amount of each parent's obligation in the court order. If the basic support calculation results in each parent owing support to the other, the court shall offset the higher basic support obligation with the lower basic support obligation to determine the amount to be paid by the parent with the higher obligation to the parent with the lower obligation. For the purpose of the cost-of-living adjustment required under section 518A.75, the adjustment must be based on each parent's basic support obligation prior to offset. For the purposes of this paragraph, \"split custody\" means that there are two or more joint children and each parent has at least one joint child more than 50 percent of the time;\n(2) if each parent pays all child care expenses for at least one joint child, the court shall calculate child care support for each joint child as provided in section 518A.40. The court shall determine each parent's child care support obligation and include the amount of each parent's obligation in the court order. If the child care support calculation results in each parent owing support to the other, the court shall offset the higher child care support obligation with the lower child care support obligation to determine the amount to be paid by the parent with the higher obligation to the parent with the lower obligation; and\n(3) if each parent pays all medical or dental insurance expenses for at least one joint child, medical support shall be calculated for each joint child as provided in section 518A.41. The court shall determine each parent's medical support obligation and include the amount of each parent's obligation in the court order. If the medical support calculation results in each parent owing support to the other, the court shall offset the higher medical support obligation with the lower medical support obligation to determine the amount to be paid by the parent with the higher obligation to the parent with the lower obligation. Unreimbursed and uninsured medical expenses are not included in the presumptive amount of support owed by a parent and are calculated and collected as provided in section 518A.41.\n(d) The court shall determine the child care support obligation for the obligor as provided in section 518A.40.\n(e) The court shall determine the medical support obligation for each parent as provided in section 518A.41. Unreimbursed and uninsured medical expenses are not included in the presumptive amount of support owed by a parent and are calculated and collected as described in section 518A.41.\n(f) The court shall determine each parent's total child support obligation by adding together each parent's basic support, child care support, and health care coverage obligations as provided in this section.\n(g) If Social Security benefits or veterans' benefits are received by one parent as a representative payee for a joint child based on the other parent's eligibility, the court shall subtract the amount of benefits from the other parent's net child support obligation, if any. Any benefit received by the obligee for the benefit of the joint child based upon the obligor's disability or past earnings in any given month in excess of the child support obligation must not be treated as an arrearage payment or a future payment.\n(h) The final child support order shall separately designate the amount owed for basic support, child care support, and medical support. If applicable, the court shall use the self-support adjustment and minimum support adjustment under section 518A.42 to determine the obligor's child support obligation.",
	"repealed": false
}