{
	"id": "290B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/290B.08",
	"title": "290B.08 TERMINATION OF DEFERRAL; PAYMENT OF DEFERRED TAXES.",
	"text": "(a) The deferral of taxes granted under this chapter terminates when one of the following occurs:\n(1) the property is sold or transferred;\n(2) the death of all qualifying homeowners;\n(3) the homeowner notifies the commissioner in writing that the homeowner desires to discontinue the deferral; or\n(4) the property no longer qualifies as a homestead.\n(b) A property is not terminated from the program because no deferred property tax amount is determined on the homestead for any given year after the homestead's initial enrollment into the program.\nUpon the termination of the deferral under subdivision 1, the amount of deferred taxes, penalties, interest, and special assessments and interest, plus the recording or filing fees under both section 290B.04, subdivision 2, and this subdivision becomes due and payable to the commissioner within 90 days of termination of the deferral for terminations under subdivision 1, paragraph (a), clauses (1) and (2), and within one year of termination of the deferral for terminations under subdivision 1, paragraph (a), clauses (3) and (4). No additional interest is due on the deferral if timely paid. On receipt of payment, the commissioner shall within ten days notify the auditor of the county in which the parcel is located, identifying the parcel to which the payment applies and shall remit the recording or filing fees under section 290B.04, subdivision 2, and this subdivision to the auditor. A notice of termination of deferral, containing the legal description and the recording or filing data for the notice of qualification for deferral under section 290B.04, subdivision 2, shall be prepared and recorded or filed by the county auditor in the same office in which the notice of qualification for deferral under section 290B.04, subdivision 2, was recorded or filed, and the county auditor shall mail a copy of the notice of termination to the property owner. The property owner shall pay the recording or filing fees. Upon recording or filing of the notice of termination of deferral, the notice of qualification for deferral under section 290B.04, subdivision 2, and the lien created by it are discharged. If the deferral is not timely paid, the penalty, interest, lien, forfeiture, and other rules for the collection of ad valorem property taxes apply.",
	"repealed": false
}