{
	"id": "47.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.28",
	"title": "47.28 SAVINGS BANKS MAY CONVERT INTO SAVINGS ASSOCIATIONS.",
	"text": "Any savings bank organized and existing under and by virtue of the law of this state may amend its articles of incorporation so as to convert itself into a savings association, by complying with the following requirements and procedure:\nThe savings bank by a two-thirds vote of the entire board of directors, at any regular or special meeting of said board duly called for that purpose, shall (a) pass a resolution declaring their intention to convert the savings bank into a savings association, and (b) cause an application in writing to be executed, by such persons as the directors may direct, in the form prescribed by the Department of Commerce, requesting a certificate of authorization (charter) as a savings association to transact business at the place and in the name stated in the application. The amendments proposed to the articles of incorporation and bylaws shall be included as part of the application.\nThe application shall be submitted to, considered and acted upon by the Department of Commerce in the same manner and by the same standards as applications are submitted, considered and acted upon under chapter 51A.\nIf the certificate of authorization (charter) be issued, the articles of incorporation may then be amended so as to convert the savings bank into a savings association by following the procedure prescribed for amending articles of incorporation of savings banks.\nUpon receipt of the fees required for filing and recording amended articles of incorporation of savings banks, the commissioner of commerce shall record the amended articles of incorporation and certify that fact thereon, whereupon the conversion of such savings bank into a savings association shall become final and complete and thereafter said corporation shall have the powers and be subject to the duties and obligations prescribed by the laws of this state applicable to savings associations.\n[Repealed by amendment, 1995 c 171 s 16]\nThe resulting association shall as soon as practicable and within such time not extending beyond three years from the date the conversion becomes final and complete and by such methods as the department of commerce shall direct, cause its organization, its securities and investments, the character of its business, and the methods of transacting the same to conform to the laws applicable to savings associations.",
	"repealed": false
}