{
	"id": "18B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.26",
	"title": "18B.26 PESTICIDE REGISTRATION.",
	"text": "(a) Except as provided in paragraphs (b) to (e), a person may not use or distribute a pesticide in this state unless it is registered with the commissioner. Pesticide registrations expire on December 31 of each year and may be renewed on or before that date for the following calendar year.\n(b) Registration is not required if a pesticide is shipped from one plant or warehouse to another plant or warehouse operated by the same person and used solely at the plant or warehouse as an ingredient in the formulation of a pesticide that is registered under this chapter.\n(c) An unregistered pesticide that was previously registered with the commissioner may be used for a period of two years following the cancellation of the registration of the pesticide, unless the commissioner determines that the continued use of the pesticide would cause unreasonable adverse effects on the environment, or with the written permission of the commissioner. To use the unregistered pesticide at any time after the two-year period, the pesticide end user must demonstrate to the satisfaction of the commissioner, if requested, that the pesticide has been continuously registered under a different brand name or by a different manufacturer and has similar composition, or, the pesticide end user obtains the written permission of the commissioner.\n(d) The commissioner may allow specific pesticide products that are not registered with the commissioner to be distributed in this state for use in another state.\n(e) A substance or mixture of substances being tested only to determine its potential efficacy as a pesticide, or to determine its toxicity or other properties, and not requiring the issuance of an experimental use permit under United States Environmental Protection Agency criteria specified in federal regulations, is not required to be registered.\n(f) Each pesticide with a unique United States Environmental Protection Agency pesticide registration number or a unique brand name must be registered with the commissioner.\n(g) It is unlawful for a person to distribute or use a pesticide in the state, or to sell into the state for use in the state, any pesticide product that has not been registered by the commissioner and for which the applicable pesticide registration application fee, gross sales fee, or waste pesticide program surcharge is not paid pursuant to subdivisions 3 and 4.\n(h) Every person who sells for use in the state a pesticide product that has been registered by the commissioner shall pay to the commissioner the applicable registration application fees, sales fees, and waste pesticide program surcharges. These sales expressly include all sales made electronically, telephonically, or by any other means that result in a pesticide product being shipped to or used in the state. There is a rebuttable presumption that pesticide products that are sold or distributed in or into the state by any person are sold or distributed for use in the state.\n(a) A person must file an application for registration with the commissioner. The application must include:\n(1) the name and address of the applicant and the name and address of the person whose name will appear on the label, if other than the applicant;\n(2) the brand name of the pesticide;\n(3) other necessary information required by the registration application form;\n(4) a true and complete copy of the labeling accompanying the pesticide as provided for in FIFRA; and\n(5) current material safety data sheets for each pesticide.\n(b) As part of the application, the commissioner may require the submission of any relevant information including the complete formula of a pesticide, including the active and inert ingredients. The commissioner may also require the registrant to supply analytical standards and methods for the pesticide, pesticide breakdown products, or metabolites.\n(a) For an agricultural pesticide, a registrant shall pay an annual registration application fee for each agricultural pesticide of $350. The fee is due by December 31 preceding the year for which the application for registration is made. The fee is nonrefundable.\n(b) For a nonagricultural pesticide, a registrant shall pay a minimum annual registration application fee for each nonagricultural pesticide of $350. The fee is due by December 31 preceding the year for which the application for registration is made. The fee is nonrefundable. If the registrant's annual gross sales of the nonagricultural pesticide exceeded $70,000 in the previous calendar year, the registrant shall pay, in addition to the $350 minimum fee, a fee equal to 0.5 percent of that portion of the annual gross sales over $70,000. For purposes of this subdivision, gross sales includes both nonagricultural pesticide sold in the state and nonagricultural pesticide sold into the state for use in this state. No additional fee is required if the fee due amount based on percent of annual gross sales of a nonagricultural pesticide is less than $10. The registrant shall secure sufficient sales information of nonagricultural pesticides distributed into this state from distributors and dealers, regardless of distributor location, to make a determination. Sales of nonagricultural pesticides in this state and sales of nonagricultural pesticides for use in this state by out-of-state distributors are not exempt and must be included in the registrant's annual report, as required under paragraph (g), and fees shall be paid by the registrant based upon those reported sales. Sales of nonagricultural pesticides in the state for use outside of the state are exempt from the gross sales fee in this paragraph if the registrant properly documents the sale location and distributors. A registrant paying more than the minimum fee shall pay the balance due by March 1 based on the gross sales of the nonagricultural pesticide by the registrant for the preceding calendar year. A pesticide determined by the commissioner to be a sanitizer or disinfectant is exempt from the gross sales fee.\n(c) For agricultural pesticides, a licensed agricultural pesticide dealer or licensed pesticide dealer shall pay a gross sales fee of 0.55 percent of annual gross sales of the agricultural pesticide in the state and the annual gross sales of the agricultural pesticide sold into the state for use in this state.\n(d) In those cases where a registrant first sells an agricultural pesticide in or into the state to a pesticide end user, the registrant must first obtain an agricultural pesticide dealer license and is responsible for payment of the annual gross sales fee under paragraph (c), record keeping under paragraph (i), and all other requirements of section 18B.316.\n(e) If the total annual revenue from fees collected in fiscal year 2011, 2012, or 2013, by the commissioner on the registration and sale of pesticides is less than $6,600,000, the commissioner, after a public hearing, may increase proportionally the pesticide sales and product registration fees under this chapter by the amount necessary to ensure this level of revenue is achieved. The authority under this section expires on June 30, 2014. The commissioner shall report any fee increases under this paragraph 60 days before the fee change is effective to the senate and house of representatives agriculture budget divisions.\n(f) An additional fee of 50 percent of the registration application fee must be paid by the applicant for each pesticide to be registered if the application is a renewal application that is submitted after December 31.\n(g) A registrant must annually report to the commissioner the amount, type and annual gross sales of each registered nonagricultural pesticide sold, offered for sale, or otherwise distributed in the state. The report shall be filed by March 1 for the previous year's registration. The commissioner shall specify the form of the report or approve the method for submittal of the report and may require additional information deemed necessary to determine the amount and type of nonagricultural pesticide annually distributed in the state. The information required shall include the brand name, United States Environmental Protection Agency registration number, and amount of each nonagricultural pesticide sold, offered for sale, or otherwise distributed in the state, but the information collected, if made public, shall be reported in a manner which does not identify a specific brand name in the report.\n(h) A licensed agricultural pesticide dealer or licensed pesticide dealer must annually report to the commissioner the amount, type, and annual gross sales of each registered agricultural pesticide sold, offered for sale, or otherwise distributed in the state or into the state for use in the state. The report must be filed by January 31 for the previous year's sales. The commissioner shall specify the form, contents, and approved electronic method for submittal of the report and may require additional information deemed necessary to determine the amount and type of agricultural pesticide annually distributed within the state or into the state. The information required must include the brand name, United States Environmental Protection Agency registration number, and amount of each agricultural pesticide sold, offered for sale, or otherwise distributed in the state or into the state.\n(i) A person who registers a pesticide with the commissioner under paragraph (b), or a registrant under paragraph (d), shall keep accurate records for five years detailing all distribution or sales transactions into the state or in the state and subject to a fee and surcharge under this section.\n(j) The records are subject to inspection, copying, and audit by the commissioner and must clearly demonstrate proof of payment of all applicable fees and surcharges for each registered pesticide product sold for use in this state. A person who is located outside of this state must maintain and make available records required by this subdivision in this state or pay all costs incurred by the commissioner in the inspecting, copying, or auditing of the records.\n(k) The commissioner may adopt by rule regulations that require persons subject to audit under this section to provide information determined by the commissioner to be necessary to enable the commissioner to perform the audit.\n(l) A registrant who is required to pay more than the minimum fee for any pesticide under paragraph (b) must pay a late fee penalty of $100 for each pesticide application fee paid after March 1 in the year for which the license is to be issued.\nIf a registration is in effect on December 31 and a renewal application has been made and the application fee paid, the registration continues in full force and effect until the commissioner notifies the applicant that the registration is denied or canceled, or the renewed registration expires.\n(a) The commissioner may not deny the registration of a pesticide because the commissioner determines the pesticide is not essential.\n(b) The commissioner shall review each application and may approve, deny, or cancel the registration of any pesticide. The commissioner may impose state use and distribution restrictions on a pesticide as part of the registration to prevent unreasonable adverse effects on the environment.\n(c) The commissioner must notify the applicant of the approval, denial, cancellation, state use or distribution restrictions.\n(d) The applicant may request a hearing on any adverse action of the commissioner within 30 days after being notified.\n(e) The commissioner may exempt pesticides that have been deregulated or classified as minimum risk by the United States Environmental Protection Agency from the requirement of registration.\n(a) To ensure the complete withdrawal from distribution or further use of a pesticide, a person who intends to discontinue a pesticide registration must:\n(1) terminate a further distribution within the state and continue to register the pesticide annually for two successive years; and\n(2) initiate and complete a total recall of the pesticide from all distribution in the state within 60 days from the date of notification to the commissioner of intent to discontinue registration.\n(b) Upon the request of a registrant, the commissioner may immediately cancel registration of a pesticide product. The commissioner may immediately cancel registration of a pesticide product at the commissioner's discretion. When requesting that the commissioner immediately cancel registration of a pesticide product, a registrant must provide the commissioner with:\n(1) a statement that the pesticide product is no longer in distribution; and\n(2) documentation of pesticide gross sales from the previous year supporting the statement under clause (1).\n(a) Beginning January 1, 2026, a pesticide registrant must annually provide a statement that a product contains no intentionally added PFAS or, for products that contain intentionally added PFAS, a pesticide registrant must submit to the commissioner the following information:\n(1) the name and purpose for which PFAS are used in the pesticide, including in any product components;\n(2) the amount of each PFAS in the product, identified by its name, chemical structure, analytical methods, chemical abstracts service registry number, or other unique method approved by the commissioner; and\n(3) any additional information required by the commissioner.\n(b) The commissioner may waive all or part of the notification requirement under paragraph (a) if the commissioner determines that substantially equivalent information is available. The commissioner may extend the deadline for the submission of the information required under paragraph (a) if the commissioner determines that more time is needed by the registrant to comply with the submission requirement.\n(a) Beginning January 1, 2026, the commissioner may not register a cleaning product if the product contains intentionally added PFAS unless the commissioner determines that the use of PFAS is a currently unavoidable use.\n(b) Beginning January 1, 2032, the commissioner may not register a pesticide product that contains intentionally added PFAS unless the commissioner determines that the use of PFAS is a currently unavoidable use.",
	"repealed": false
}