{
	"id": "116J.9924",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.9924",
	"title": "116J.9924 TARGETED COMMUNITY CAPITAL PROJECT GRANT PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Capital project\" or \"project\" means the acquisition or betterment of buildings or other fixed assets and other improvements of a capital nature.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Economically disadvantaged persons or groups\" means one or more persons or groups that:\n(1) qualify as a low-income person as defined under section 116M.14, subdivision 4a; or\n(2) live in a low-income area as defined under section 116M.14, subdivision 4.\n(e) \"Government entity\" means a city, township, county, or any political subdivision, or an American Indian Tribal government entity located within a federally recognized American Indian reservation.\n(f) \"Nonprofit organization\" means a not-for-profit corporation under section 501(c)(3) of the Internal Revenue Code or a Tribal nonprofit under section 7871 of the Internal Revenue Code that serves underserved communities or economically disadvantaged persons or groups.\n(g) \"Underserved community\" means one or more persons or groups that qualify as:\n(1) a minority person as defined under section 116M.14, subdivision 6; or\n(2) persons with disabilities as defined under section 116M.14, subdivision 9.\n(a) The commissioner shall make competitive grants for capital projects to nonprofit organizations and government entities that provide, increase, or expand services to underserved communities or economically disadvantaged persons or groups.\n(b) The commissioner shall give priority to applicants under subdivision 3 that:\n(1) do not have a history of receiving capital grants from the state;\n(2) demonstrate local support for the project;\n(3) address needs for an underserved community, an economically disadvantaged area, or people or groups who are economically disadvantaged;\n(4) provide community benefits; or\n(5) have previously received phased grant funds as described under subdivision 4.\n(c) In selecting projects for grants, the commissioner must equitably divide the total appropriation between the metropolitan areas and greater Minnesota.\nA prospective grantee under this section must submit a written application to the commissioner in the form, at the time, and in the manner prescribed by the commissioner. The written application must include:\n(1) a description of the capital project to be funded by the grant;\n(2) the rationale for the project, including a description of the services provided and populations served by the applicant;\n(3) the total cost of the project and the cost of individual phases of the project, including but not limited to predesign, design, construction, engineering, furnishing, and equipping;\n(4) the requested grant amount;\n(5) the property owner of the facility to be improved;\n(6) the sources and amounts of state and nonstate funds previously received and committed to the project;\n(7) the public purpose achieved by the project;\n(8) an estimated timeline of the project; and\n(9) any additional information requested by the commissioner.\n(a) The commissioner shall award grants in an amount not to exceed $1,500,000 per grant.\n(b) A grant awarded under this section must be no less than the amount required to complete one or more phases of the project, less any nonstate funds already committed for such activities.\n(a) The commissioner may not award a grant for which the applicant does not provide nonstate funds for the project unless the applicant:\n(1) is located in an area with a very low net tax capacity;\n(2) the applicant is experiencing hardship; or\n(3) the applicant serves underserved communities or economically disadvantaged persons or groups.\n(b) For the purposes of this section, \"area with a very low net tax capacity\" means a city with a net tax capacity per capita that is less than the median net tax capacity per capita among all cities statewide.\nThe provisions of chapter 16A that apply to general fund appropriations for capital projects also apply to grants under this section. Money granted under this section is available until the project is completed or abandoned subject to section 16A.642.\nUp to five percent of any appropriation for the program under this section is for administration and monitoring of the program. The commissioner must also use the funds under this subdivision to provide technical assistance, education, and support for program applicants, as needed, and may contract with a third-party to provide such services.\nOn or before January 31, 2022, and every January 31 thereafter, the commissioner must submit a report as required under section 3.195 that details the grants awarded under this section, including the total grants distributed, the recipients of the grants, the services supported by the grants, and any other information the commissioner deems pertinent. A copy of this report must also be sent to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over capital investment and economic development.",
	"repealed": false
}