{
	"id": "259.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.58",
	"title": "259.58 COMMUNICATION OR CONTACT AGREEMENTS.",
	"text": "Adoptive parents and a birth relative or foster parents may enter an agreement regarding communication with or contact between an adopted minor, adoptive parents, and a birth relative or foster parents under this section. An agreement may be entered between:\n(1) adoptive parents and a birth parent;\n(2) adoptive parents and any other birth relative or foster parent with whom the child resided before being adopted; or\n(3) adoptive parents and any other birth relative if the child is adopted by a birth relative upon the death of both birth parents.\nFor purposes of this section, \"birth relative\" means a parent, stepparent, grandparent, brother, sister, uncle, or aunt of a minor adoptee. This relationship may be by blood, adoption, or marriage. For an Indian child, birth relative includes members of the extended family as defined by the law or custom of the Indian child's tribe or, in the absence of laws or custom, nieces, nephews, or first or second cousins, as provided in the Indian Child Welfare Act, United States Code, title 25, section 1903.\n(a) An agreement regarding communication with or contact between minor adoptees, adoptive parents, and a birth relative is not legally enforceable unless the terms of the agreement are contained in a written court order entered in accordance with this section. An order may be sought at any time before a decree of adoption is granted. The order must be issued within 30 days of being submitted to the court or by the granting of the decree of adoption, whichever is earlier. The court shall not enter a proposed order unless the terms of the order have been approved in writing by the prospective adoptive parents, a birth relative or foster parent who desires to be a party to the agreement, and, if the child is in the custody of or under the guardianship of an agency, a representative of the agency. A birth parent must approve in writing of an agreement between adoptive parents and any other birth relative or foster parent, unless an action has been filed against the birth parent by a county under chapter 260. An agreement under this section need not disclose the identity of the parties to be legally enforceable. The court shall not enter a proposed order unless the court finds that the communication or contact between the minor adoptee, the adoptive parents, and a birth relative as agreed upon and contained in the proposed order would be in the minor adoptee's best interests. The court shall mail a certified copy of the order to the parties to the agreement or their representatives at the addresses provided by the petitioners.\n(b) Failure to comply with the terms of an agreed order regarding communication or contact that has been entered by the court under this section is not grounds for:\n(1) setting aside an adoption decree; or\n(2) revocation of a written consent to an adoption after that consent has become irrevocable.\n(c) An agreed order entered under this section may be enforced by filing a petition or motion with the family court that includes a certified copy of the order granting the communication, contact, or visitation, but only if the petition or motion is accompanied by an affidavit that the parties have mediated or attempted to mediate any dispute under the agreement or that the parties agree to a proposed modification. The prevailing party may be awarded reasonable attorney's fees and costs. The court shall not modify an agreed order under this section unless it finds that the modification is necessary to serve the best interests of the minor adoptee, and:\n(1) the modification is agreed to by the parties to the agreement; or\n(2) exceptional circumstances have arisen since the agreed order was entered that justify modification of the order.\n(d) For children under state guardianship when there is a written communication or contact agreement between prospective adoptive parents and birth relatives other than birth parents it must be included in the final adoption decree unless all the parties agree to omit it. If the adoptive parents or birth relatives do not comply with the communication or contact agreement, the court shall determine the terms of the communication and contact agreement.",
	"repealed": false
}