{
	"id": "480B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/480B.01",
	"title": "480B.01 COMMISSION ON JUDICIAL SELECTION.",
	"text": "If a judge of the district court or Workers' Compensation Court of Appeals dies, resigns, retires, or is removed during the judge's term of office, or if a new district or Workers' Compensation Court of Appeals judgeship is created, the resulting vacancy must be filled by the governor as provided in this section.\n(a) A Commission on Judicial Selection is established. It is composed of permanent members chosen as described in paragraphs (b) to (f).\n(b) The governor shall appoint seven at-large members to the commission who serve at the pleasure of the governor. The governor shall appoint one of these members as chair of the commission. The chair may but does not have to be an attorney. The governor may appoint attorneys to fill no more than four of the remaining six positions.\n(c) The justices of the supreme court shall appoint two at-large members to the commission to serve four-year terms, ending on the same day the governor's term of office ends. The justices may appoint an attorney to fill no more than one of the two positions.\n(d) The governor shall appoint two district members to the commission in each judicial district who serve at the pleasure of the governor. The governor may appoint an attorney to fill no more than one of the two positions.\n(e) The justices of the supreme court shall appoint two district members to the commission from each judicial district to serve four-year terms, ending on the same day the governor's term of office ends. The justices may appoint an attorney to fill no more than one of the two positions.\n(f) The appointing authorities shall ensure that the permanent members of the commission include women and minorities.\nIndividuals appointed as district members under subdivision 2, paragraphs (d) and (e), may participate in commission meetings and deliberations only when the commission is considering applicants to fill a vacancy on the district court in the judicial district from which those individuals were appointed.\nIf a vacancy occurs on the commission by reason of the death or resignation of a member or by the removal of a member appointed under subdivision 2, the appointing or electing authority shall appoint or elect an individual to fill the vacancy for the unexpired term.\nA quorum of the commission is seven members.\nMembers of the commission who would otherwise be eligible to hold judicial office may not be considered or appointed to fill a district court judicial vacancy while they are members of the commission or for one year following the end of their membership on the commission.\nThe commission shall prepare and make available to the public and file with the clerk of the appellate courts and the secretary of state an outline of the process the commission will follow in recruiting and evaluating candidates to fill judicial vacancies. The commission shall actively seek out and encourage qualified individuals, including women and minorities, to apply for judicial offices.\nThe commission shall evaluate the extent to which candidates have the following qualifications for judicial office: integrity, maturity, health if job related, judicial temperament, diligence, legal knowledge, ability and experience, and community service. The commission shall give consideration to women and minorities. The commission shall solicit, in writing, recommendations from attorney associations in the judicial district and from organizations that represent minority or women attorneys in the judicial district who have requested solicitation.\nWithin ten days after a judicial vacancy occurs or the governor has been notified that a vacancy will occur on a named date, the governor shall give notice of the vacancy to the chair of the Commission on Judicial Selection. A meeting of the commission to consider the candidates for the vacancy must be held not less than 21 days nor more than 42 days after the governor provides notification of the vacancy.\nUpon receiving notice from the governor that a judicial vacancy has occurred or will occur on a specified date, the chair shall provide notice of the following information:\n(1) the office that is or will be vacant;\n(2) that applications from qualified persons or on behalf of qualified persons are being accepted by the commission;\n(3) that application forms may be obtained from the governor or the commission at a named address; and\n(4) that application forms must be returned to the commission by a named date.\nFor a district court vacancy, the notice must be made available to attorney associations in the judicial district where the vacancy has occurred or will occur and to at least one newspaper of general circulation in each county in the district. For a Workers' Compensation Court of Appeals vacancy, the notice must be given to state attorney associations and all forms of the public media.\nWithin 60 days after the receipt of a notice of a judicial vacancy, the committee shall recommend to the governor no fewer than three and no more than five nominees for each judicial vacancy. The names of the nominees must be made public. The governor may fill the vacancy from the nominees recommended by the commission. If the governor declines to select a nominee to fill the vacancy from the list of nominees, or if no list is submitted to the governor under this subdivision, the governor may select a person to fill the vacancy without regard to the commission's recommendation. If fewer than 60 days remain in the term of office of a governor who will not succeed to another term, the governor may fill a vacancy without waiting for the commission to recommend a list of nominees.\nMeetings of the commission may be closed to discuss the candidates. The commission shall file an annual tabulation with the governor of the number of applicants for judicial office and the age, sex, and race of applicants.",
	"repealed": false
}