{
	"id": "43A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.17",
	"title": "43A.17 SALARY LIMITS, RATES, RANGES AND EXCEPTIONS.",
	"text": "As used in subdivisions 1 to 9, \"salary\" means hourly, monthly, or annual rate of pay including any lump-sum payments and cost-of-living adjustment increases but excluding payments due to overtime worked, shift or equipment differentials, work out of class as required by collective bargaining agreements or plans established under section 43A.18, and back pay on reallocation or other payments related to the hours or conditions under which work is performed rather than to the salary range or rate to which a class is assigned. For presidents of state universities, \"salary\" does not include a housing allowance provided through a compensation plan approved under section 43A.18, subdivision 3a.\nFor classes or positions covered under the provisions of section 43A.18, subdivision 1, the commissioner shall negotiate compensation. For classes or positions covered under the provisions of section 43A.18, subdivisions 2 and 3, the commissioner shall establish compensation. Employees covered under section 43A.18 shall receive salary at the appropriate single rate or within the limits of the salary range to which their class is assigned or their position compared except for any lump-sum payments including cost of living lump-sum payments. The commissioner may grant further exemptions from this subdivision as provided in subdivisions 3, 5, 6, and 7.\n(a) Upon the request of the appointing authority, and when the commissioner determines that changes in employment situations create difficulties in attracting or retaining employees, the commissioner may approve an unusual employment situation increase to advance an employee within the salary range.\n(b) The following conditions apply to a request under paragraph (a) to advance an employee within a salary range:\n(1) the appointing authority making the request must submit a detailed written statement for each position contained in the request, specifying the changes in employment situations that create difficulties in attracting or retaining an employee for the position;\n(2) the commissioner shall review each proposal giving due consideration to salary rates paid to other employees in the same class and agency and, if other conditions in this paragraph are met, may approve any request that in the commissioner's judgment is in the best interest of the state;\n(3) the action must be consistent with applicable provisions of collective bargaining agreements or plans adopted under section 43A.18;\n(4) each increase or exemption must be separately documented for each employee or position and may not be applied to groups of employees; and\n(5) the commissioner shall report the granting of a request to the chair of the Legislative Coordinating Commission within three working days.\n[Repealed, 2013 c 142 art 6 s 13]\nThe commissioner may, upon request of an appointing authority, approve payment of an employee with permanent status at a salary rate above the maximum of the class to which the employee is demoted. The commissioner shall take such action as required by collective bargaining agreements or plans pursuant to section 43A.18. If the action is justified by the employee's long or outstanding service, exceptional or technical qualifications, age, health, or substantial changes in work assignment beyond the control of the employee, the commissioner may approve a rate up to and including the employee's salary immediately prior to demotion. Thereafter, so long as the employee remains in the same position, the employee shall not be eligible to receive any increase in salary until the employee's salary is within the range of the class to which the employee's position is allocated unless such increases are specifically provided in collective bargaining agreements or plans pursuant to section 43A.18.\nThe commissioner may authorize an employee transferring between two classes established as equivalent for purposes of transfer to retain a rate of compensation above the maximum of the range of the class to which the employee is transferring. The commissioner shall take such action as required by a collective bargaining agreement or plans pursuant to section 43A.18. Thereafter, so long as the employee remains in the same class, the employee shall receive an increase in salary only as provided pursuant to applicable collective bargaining agreements or plans pursuant to section 43A.18, until the employee's salary is within the range of the class to which the position is allocated.\nNotwithstanding section 176.021, subdivision 5, the commissioner may provide for injured on duty pay through collective bargaining agreements or plans pursuant to section 43A.18.\nThe commissioner shall not agree to a collective bargaining agreement or recommend a compensation plan pursuant to section 43A.18, subdivisions 1, 2, 3, and 4, nor shall an arbitrator issue an award under sections 179A.01 to 179A.25, if the compensation plan, agreement, or award permits an employee to convert accumulated vacation leave into cash before separation from state service.\nThis section does not prohibit the commissioner from negotiating a collective bargaining agreement or recommending approval of a compensation plan which: (1) permits an employee to receive payment for accumulated vacation leave upon beginning an unpaid leave of absence approved for more than one year in duration if the leave of absence is not for the purpose of accepting an unclassified position in state civil service; (2) permits an employee to receive payment for accumulated vacation leave upon layoff; or (3) permits an employee to receive payment for accumulated vacation leave if a change in employment results in the employee being ineligible to accrue further vacation leave.\nMS 2022 [Repealed, 2023 c 62 art 3 s 22]\nThe compensation plan for an elected official of a statutory or home rule charter city, county, or town may not include a provision for vacation or sick leave. The salary of an official covered by this subdivision may not be diminished because of the official's absence from official duties because of vacation or sickness.\n(a) For purposes of this subdivision, \"highly compensated employee\" means an employee of the state whose estimated annual compensation is greater than 60 percent of the governor's annual salary, and who is not covered by a collective bargaining agreement negotiated under chapter 179A or a compensation plan authorized under section 43A.18, subdivision 3a.\n(b) Severance pay for a highly compensated employee includes benefits or compensation with a quantifiable monetary value, that are provided for an employee upon termination of employment and are not part of the employee's annual wages and benefits and are not specifically excluded by this subdivision. Severance pay does not include payments for accumulated vacation, accumulated sick leave, and accumulated sick leave liquidated to cover the cost of group term insurance. Severance pay for a highly compensated employee does not include payments of periodic contributions by an employer toward premiums for group insurance policies. The severance pay for a highly compensated employee must be excluded from retirement deductions and from any calculations of retirement benefits. Severance pay for a highly compensated employee must be paid in a manner mutually agreeable to the employee and the employee's appointing authority over a period not to exceed five years from retirement or termination of employment. If a retired or terminated employee dies before all or a portion of the severance pay has been disbursed, the balance due must be paid to a named beneficiary or, lacking one, to the deceased's estate. Except as provided in paragraph (c), severance pay provided for a highly compensated employee leaving employment may not exceed the lesser of:\n(1) six months pay; or\n(2) the highly compensated employee's regular rate of pay multiplied by 35 percent of the highly compensated employee's accumulated but unused sick leave hours.\n(c) Severance pay for a highly compensated employee may exceed the limit prescribed in paragraph (b) if the severance pay is part of an early retirement incentive offer approved by the state and the same early retirement incentive offer is also made available to all other employees of the appointing authority who meet generally defined criteria relative to age or length of service.\n(d) An appointing authority may make severance payments to a highly compensated employee, up to the limits prescribed in this subdivision, only if doing so is authorized by a compensation plan under section 43A.18 that governs the employee, provided that the following highly compensated employees are not eligible for severance pay:\n(1) a commissioner, deputy commissioner, or assistant commissioner of any state department or agency as listed in section 15.01 or 15.06, including the state chief information officer; and\n(2) any unclassified employee who is also a public official, as defined in section 10A.01, subdivision 35.\n(e) Severance pay shall not be paid to a highly compensated employee who has been employed by the appointing authority for less than six months or who voluntarily terminates employment.\n[Repealed, 1999 c 221 s 9]\n(a) For purposes of this subdivision, the term \"law enforcement officers\" means all licensed peace officers employed by the state who are included in the state units under section 179A.10, subdivision 2, including without limitation: Minnesota State Patrol troopers, Bureau of Criminal Apprehension agents, and Alcohol and Gambling Enforcement agents, in the Department of Public Safety; Department of Natural Resources conservation officers; Department of Corrections Fugitive Apprehension Unit members; and Commerce Fraud Bureau agents in the Department of Commerce.\n(b) When the commissioner of management and budget negotiates a collective bargaining agreement establishing compensation for law enforcement officers, the commissioner must use compensation and benefit data from the most recent salary and benefits survey conducted pursuant to section 299D.03, subdivision 2a, to compare salaries to ensure appropriate increases are made to law enforcement officer salaries and benefits.\n[See Note.]",
	"repealed": false
}