{
	"id": "413.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/413.02",
	"title": "413.02 CHANGE OF CITY NAME.",
	"text": "When 20 percent of the legal voters of any statutory or home rule charter city shall petition the governing body thereof for a change of its name, the question of such change of name may be submitted to the voters of the city at any general or special election; and, if a majority of all the votes cast upon the question are in favor of such change, the governing body may by ordinance change the name of the city.\nUpon the filing of a certified copy of the ordinance with the auditor of the county in which the city is located and with the state auditor and the secretary of state, the name of the city shall be changed as in the ordinance provided. The change in name shall in no way affect any liability, obligation, power, duty, law, or ordinance, or other matter or thing in any way relating to the city, excepting that the new name of the city shall thereafter be substituted for and used in the place of its old name.\nThe name of any statutory city in this state may be changed to the same name as the post office therein, by an ordinance of the statutory city so declaring, duly and legally adopted by the council thereof, when the name of the statutory city is different from the name of the post office therein as designated by the United States postal authorities.\nUpon the filing of a certified copy of such ordinance with the auditor of the county in which the city is located, and with the state auditor and the secretary of state, the name of the city shall be changed as in such ordinance provided. Such change in name shall in no way affect any liability, obligation, power, duty, law, or ordinance, or other matter or thing in any way relating to the city, excepting that the new name of the city shall thereafter be substituted for and used in place of its old name.\nAny statutory city which was a village or a borough on December 31, 1973, may continue to employ the term \"village\" or \"borough\" for any purpose including, but not limited to, internal administration, public communications, and published and posted notices; provided, however, that in all proceedings governed by statute or rule of a state agency and in all legal proceedings to which the city is a party, the term \"city\" shall be employed. The validity of any proceeding commenced or action taken by a village or borough prior to January 1, 1974 in which the term \"village\" or \"borough\" was employed shall not be affected by the provisions of this subdivision.",
	"repealed": false
}