{
	"id": "268A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/268A.01",
	"title": "268A.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section shall have the meanings given them.\n\"Department\" means the Department of Employment and Economic Development.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Vocational rehabilitation services\" means those services and goods so defined in the federal Rehabilitation Act of 1973, as amended, and section 268A.03, clause (2).\n\"Person with a disability\" means an \"individual with a disability\" as defined in the federal Rehabilitation Act of 1973, as amended.\n\"Community rehabilitation provider\" means an entity which meets the definition of community rehabilitation program in the federal Rehabilitation Act of 1973, as amended. However, for the purposes of sections 268A.03, clause (1), 268A.06, 268A.085, and 268A.15, community rehabilitation provider means a nonprofit or public entity that provides at least one extended employment subprogram for persons with the most significant disabilities.\n[Repealed, 1995 c 224 s 126]\n\"Center for independent living\" means a private nonprofit organization incorporated under Minnesota law and operated for the purpose of providing independent living services to persons with disabilities. Boards of directors for the center for independent living are composed of community representatives. Fifty-one percent of the board members must be individuals with disabilities.\n\"Center-based employment subprogram\" means employment which provides paid work on the premises of a rehabilitation facility and training services or other services necessary for employment on or off the premises of the rehabilitation facility.\n\"Extended employment program\" means noncompetitive employment and supported employment subprograms.\n[Repealed, 1995 c 224 s 126]\n[Repealed, 1995 c 224 s 126]\n(a) \"Supported employment\" means employment of a person with a disability so severe that the person needs ongoing training and support to get and keep a job in which:\n(1) the person engages in paid work in a position removed from the service vendor's site where individuals without disabilities who do not require public subsidies also may be employed;\n(2) public funds are necessary to provide ongoing training and support services throughout the period of the person's employment; and\n(3) the person has the opportunity for social interaction with individuals who do not have disabilities and who are not paid caregivers.\n(b) If the commissioner has certified a rehabilitation facility setting as integrated, then employment at that site may be considered supported employment.\n\"Affirmative business enterprise employment\" means employment which provides paid work on the premises of an affirmative business enterprise as certified by the commissioner.\nAffirmative business enterprise employment is considered community employment for purposes of funding under Minnesota Rules, parts 3300.2005 to 3300.2055, provided that the wages for individuals reported must be at or above customary wages for the same employer. The employer must also provide one benefit package that is available to all employees at the specific site certified as an affirmative business enterprise.\n\"Noncompetitive employment\" means paid work:\n(1) that is performed on a full-time or part-time basis, including self-employment, for which the person is compensated at a rate that is less than the higher rate specified in the Fair Labor Standards Act of 1938, United States Code, title 29, section 206, subsection (a)(1), or the rate specified in the applicable state or local minimum wage law; and\n(2)(i) for which the person is paid less than the customary rate paid by the employer for the same or similar work performed by other nondisabled employees who are similarly situated in similar occupations by the same employer and who have similar training, experience, and skills; or\n(ii) which is performed at a location where the employee does not interact with nondisabled persons, not including supervisory personnel or persons who are providing services to the employee, to the same extent that nondisabled persons who are in comparable positions interact with other persons.",
	"repealed": false
}