{
	"id": "177.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.44",
	"title": "177.44 HIGHWAY CONTRACTS; HOURS OF LABOR; WAGE RATES; PENALTY.",
	"text": "A laborer or mechanic employed by a contractor, subcontractor, agent, or other person doing or contracting to do all or part of the work under a contract based on bids as provided in Minnesota Statutes 1971, section 161.32, to which the state is a party, for the construction or maintenance of a highway, may not be permitted or required to work longer than the prevailing hours of labor unless the laborer or mechanic is paid for all hours in excess of the prevailing hours at a rate of at least 1-1/2 times the hourly basic rate of pay of the laborer or mechanic. The laborer or mechanic must be paid at least the prevailing wage rate in the same or most similar trade or occupation in the area.\nThis section does not apply to wage rates and hours of employment of laborers or mechanics engaged in the processing or manufacture of materials or products, or to the delivery of materials or products by or for commercial establishments which have a fixed place of business from which they regularly supply the processed or manufactured materials or products. This section applies to laborers or mechanics who deliver mineral aggregate such as sand, gravel, or stone which is incorporated into the work under the contract by depositing the material substantially in place, directly or through spreaders, from the transporting vehicle.\nThe Department of Labor and Industry shall conduct investigations and hold public hearings necessary to define classes of laborers and mechanics and to determine the hours of labor and wage rates prevailing in all areas of the state for all classes of labor and mechanics commonly employed in highway construction work, so as to determine prevailing hours of labor, prevailing wage rates, and hourly basic rates of pay.\nThe department shall determine the nature of the equipment furnished by truck drivers who own and operate trucks on contract work to determine minimum rates for the equipment, and shall establish by rule minimum rates to be computed into the prevailing wage rate.\nThe commissioner of labor and industry shall at least once a year certify the prevailing hours of labor, the prevailing wage rate, and the hourly basic rate of pay for all classes of laborers and mechanics referred to in subdivision 3 in each area. The certification must also include future hours and rates when they can be determined for classes of laborers and mechanics in an area. The certification must specifically state the effective dates of future hours and rates when they are certified. If a construction project extends into more than one area there shall be only one standard of hours of labor and wage rates for the entire project. A person aggrieved by a final determination of the commissioner may petition the commissioner for reconsideration of findings. A person aggrieved by a decision of the commissioner after reconsideration may within 20 days after the decision petition the commissioner for a public hearing as in a contested case under sections 14.57 to 14.61. If the commissioner finds that a change in the certified prevailing hours of labor, prevailing wage rate, and the hourly basic rate of pay for a class of laborers or mechanics in any area is required, the commissioner may at any time certify that change.\nThe prevailing hours of labor, the prevailing wage rates, the hourly basic rates of pay, and classifications for all labor as certified by the commissioner must be specifically stated in the proposals and contracts for each highway construction contract to which the state is a party. These hours, rates, and classifications, together with the provisions of subdivision 6, must be kept posted on the project by the employer in at least one conspicuous place for the information of employees working on the project.\nA contractor, subcontractor, or agent who violates this section is guilty of a misdemeanor and may be fined not more than $300 or imprisoned not more than 90 days or both. Each day that the violation continues is a separate offense.\nWhoever induces a job applicant or employee on any project subject to this section to give up or forgo any part of the wages to which entitled under the contract governing the project by threat not to employ, by threat of dismissal from employment, or by any other means may be fined not exceeding $1,000 or imprisoned not more than one year or both.\nAny employee under this section who knowingly permits the contractor or subcontractor to pay less than the prevailing wage rate set forth in the contract, or who gives up any part of the compensation to which entitled under the contract, may be fined not exceeding $40 or imprisoned not more than 30 days or both. Each day any violation of this paragraph continues is a separate offense.\nThe Department of Transportation shall require adherence to this section. The commissioner of transportation may demand and every contractor and subcontractor shall furnish copies of payrolls. The commissioner of transportation may examine all records relating to hours of work and the wages paid laborers and mechanics on work to which this section applies. Upon request of the Department of Transportation or upon complaint of alleged violation, the county attorney of the county in which the work is located shall investigate and prosecute violations in a court of competent jurisdiction.",
	"repealed": false
}