{
	"id": "61B.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/61B.24",
	"title": "61B.24 ASSESSMENTS.",
	"text": "For the purpose of providing the funds necessary to carry out the powers and duties of the association, the board of directors shall assess the member insurers, separately for each account or subaccount, at the times and for the amounts as the board finds necessary. Assessments are due not less than 30 days after prior written notice to the member insurers and accrue interest on and after the due date at the then applicable rate determined under section 549.09, subdivision 1, paragraph (c).\nThere are two classes of assessments, as follows:\n(1) class A assessments must be made for the purpose of meeting administrative and legal costs and other expenses and examinations conducted under the authority of section 61B.27. Class A assessments may be made whether or not related to a particular impaired or insolvent insurer; and\n(2) class B assessments must be made to the extent necessary to carry out the powers and duties of the association under section 61B.23 with regard to an impaired or an insolvent insurer.\n(a) The amount of a class A assessment shall be determined by the board and may be made on a pro rata or nonpro rata basis. If pro rata, the board may provide that it be credited against future class B assessments.\n(b) The amount of any class B assessment, except for assessments related to long-term care insurance, must be allocated for assessment purposes between the accounts and among the subaccounts of the life insurance and annuity account pursuant to an allocation formula which may be based on the premiums or reserves of the impaired or insolvent insurer or any other standard considered by the board in its sole discretion as being fair and reasonable under the circumstances.\n(c) The amount of the Class B assessment for long-term care insurance written by the impaired or insolvent insurer shall be allocated according to a methodology included in the plan of operation and approved by the commissioner. The methodology shall provide for 50 percent of the assessment to be allocated to health insurance member insurers and 50 percent to be allocated to life and annuity member insurers.\n(d) Class B assessments against member insurers for each subaccount or account must be in the proportion that the average annual premiums received on business in this state by each assessed member insurer on policies or contracts covered by each subaccount or account for the three most recent calendar years for which information is available preceding the calendar year in which the member insurer became impaired or insolvent, as the case may be, bears to the average annual premiums received on business in this state by all assessed member insurers on policies or contracts covered by that subaccount or account for those same calendar years. If the impaired insurer becomes insolvent, the date of insolvency must be used to determine the assessment. Premiums for purposes of calculating average annual premium for calendar years prior to 1993 shall be determined in accordance with Minnesota Statutes 1992, sections 61B.01 to 61B.16.\n(e) Assessments for funds to meet the requirements of the association with respect to an impaired or insolvent insurer must not be made until necessary to implement the purposes of sections 61B.18 to 61B.32. Classification of assessments under subdivision 2 and computation of assessments under this subdivision must be made with a reasonable degree of accuracy, recognizing that exact determinations may not always be possible.\nThe association may abate or defer, in whole or in part, the assessment of a member insurer if, in the opinion of the board, payment of the assessment would endanger the ability of the member insurer to fulfill its contractual obligations. In the event an assessment against a member insurer is abated, or deferred in whole or in part, the amount by which the assessment is abated or deferred may be assessed against the other member insurers in a manner consistent with the basis for assessments as provided in this section. Once the conditions which caused a deferral have been removed or rectified, the member insurer shall pay all assessments that were deferred pursuant to a repayment plan approved by the association.\n(a) The total of all assessments upon a member insurer for each subaccount of the life and annuity account and for the health account shall not in any one calendar year exceed two percent of that member insurer's average annual premiums as calculated in subdivision 3, paragraph (d), on policies or contracts covered by that account or subaccount. If two or more assessments are made with respect to member insurers that become impaired or insolvent in different calendar years, average annual premiums for purposes of the assessment percentage limitation are based upon the higher of the three-year averages calculated under subdivision 3, paragraph (d). If an impaired insurer becomes insolvent, the date of impairment must be used to determine the assessment. If the maximum assessment for any subaccount of the life and annuity account in any one calendar year will not provide an amount sufficient to carry out the responsibilities of the association, then pursuant to subdivision 3, the board of directors shall assess based on the other subaccounts of the life and annuity account for the necessary additional amount, subject to the maximum of two percent stated above for each subaccount.\n(b) If the maximum assessment for an account, together with the other assets of the association in that account, does not provide in any one calendar year in that account an amount sufficient to carry out the responsibilities of the association, the necessary additional funds must be assessed as soon as permitted by sections 61B.18 to 61B.32.\n(c) The board may adopt general principles in the plan of operation for allocating funds among claims, whether relating to one or more impaired or insolvent insurers, when the maximum assessment will be insufficient to cover anticipated claims.\n(d) If assessments under this section are inadequate to pay all obligations of the impaired insurer that are or become due and owing, then the association shall prepare a plan approved by the commissioner for prioritization of payments. If the association adopts general principles in the plan of operations, the association shall use the general principles in preparing the plan required under this paragraph. No formerly impaired or insolvent insurer may be reinstated until all payments of or on account of the insurer's or health maintenance organization's contractual obligations by the guaranty association, along with all expenses thereof and interest on all such payments and expenses, shall have been repaid to the guaranty association or a plan of repayment by the insurer or health maintenance organization shall have been approved by the commissioner.\nThe board may, by an equitable method as established in the plan of operation, refund to member insurers, in proportion to the contribution of each member insurer to that account or subaccount, the amount by which the assets of the account or subaccount exceed the amount the board finds is necessary to carry out during the coming year the obligations of the association with regard to that account or subaccount, including assets accruing from assignment, subrogation, net realized gains, and income from investments. A reasonable amount may be retained in any account or subaccount to provide funds for the continuing expenses of the association and for future losses.\nA member insurer may, in determining its premium rates and policy owner dividends as to any kind of insurance or health maintenance organization business within the scope of sections 61B.18 to 61B.32, consider the amount reasonably necessary to meet its assessment obligations under sections 61B.18 to 61B.32.\nThe association shall issue to each member insurer paying an assessment under sections 61B.18 to 61B.32, other than a class A assessment, a certificate of contribution, in a form prescribed by the commissioner, for the amount of the assessment so paid. All outstanding certificates must be of equal dignity and priority without reference to amounts or dates of issue. A certificate of contribution may be shown by the member insurer in its financial statement as an asset in the form and for the amount, if any, and period of time as the commissioner may approve.\nIn the event a member insurer engages in any reorganization, including any merger, consolidation, restructuring, incorporation, or reincorporation, the member's obligations under this chapter shall survive the reorganization with respect to assessments for impairments or insolvencies occurring before the date of the reorganization.\n(a) A member insurer that wishes to protest all or part of an assessment shall pay when due the full amount of the assessment as set forth in the notice provided by the association. The payment is available to meet association obligations during the pendency of the protest or any subsequent appeal. Payment must be accompanied by a statement in writing that the payment is made under protest and setting forth a brief statement of the grounds for the protest.\n(b) Within 60 days following the payment of an assessment under protest by a member insurer, the association shall notify the member insurer in writing of its determination with respect to the protest unless the association notifies the member insurer that additional time is required to resolve the issues raised by the protest.\n(c) Within 30 days after a final decision has been made, the association shall notify the protesting member insurer in writing of that final decision. Within 60 days of receipt of notice of the final decision, the protesting member insurer may appeal that final action to the commissioner.\n(d) In the alternative to rendering a final decision with respect to a protest based on a question regarding the assessment base, the association may refer the protest to the commissioner for a final decision, with or without a recommendation from the association.\n(e) If the protest or appeal on the assessment is upheld, the amount paid in error or excess shall be returned to the member insurer. Interest on a refund due a protesting member insurer shall be paid at the rate actually earned by the association.\nThe association may request information of member insurers in order to aid in the exercise of its power under this section and member insurers shall promptly comply with a request.",
	"repealed": false
}