{
	"id": "326.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.01",
	"title": "326.01 DEFINITIONS.",
	"text": "For the purpose of this chapter, the terms defined in this section have the meanings ascribed to them.\nMS 2006 [Renumbered 326B.31, subd 9]\nMS 2006 [Renumbered 326B.31, subd 8]\n[Repealed, 2007 c 140 art 5 s 33; art 13 s 3]\nMS 2006 [Renumbered 326B.31, subd 18]\nMS 2006 [Renumbered 326B.31, subd 19]\nMS 2006 [Renumbered 326B.31, subd 20]\nMS 2006 [Renumbered 326B.31, subd 21]\nMS 2006 [Renumbered 326B.31, subd 22]\nMS 2006 [Renumbered 326B.31, subd 14]\nMS 2006 [Renumbered 326B.31, subd 13]\nMS 2006 [Renumbered 326B.31, subd 12]\nMS 2006 [Renumbered 326B.31, subd 7]\nMS 2006 [Renumbered 326B.31, subd 11]\n[Repealed, 2003 c 58 s 8]\nMS 2006 [Renumbered 326B.31, subd 23]\nMS 2006 [Renumbered 326B.31, subd 17]\nMS 2006 [Renumbered 326B.31, subd 16]\n[Repealed, 2007 c 140 art 13 s 3]\nMS 2006 [Renumbered 326B.31, subd 15]\nMS 2006 [Renumbered 326B.31, subd 27]\nMS 2006 [Renumbered 326B.31, subd 25]\nMS 2006 [Renumbered 326B.31, subd 29]\nMS 2006 [Renumbered 326B.31, subd 26]\nMS 2006 [Renumbered 326B.42, subd 3]\nMS 2006 [Renumbered 326B.42, subd 4]\n[Repealed, 2007 c 140 art 6 s 16]\n[Repealed, 2007 c 140 art 13 s 3]\n[Repealed, 2007 c 140 art 13 s 3]\n[Repealed, 2007 c 140 art 13 s 3]\n[Repealed, 2007 c 140 art 13 s 3]\nThe term \"person\" includes an individual, partnership, association, joint stock company, trust, or corporation.\nThe term \"distributor\" includes any person who engages, or contracts to engage, in the distribution of motion picture films and is a resident of, or legally authorized to do business in, this state.\nThe term \"exhibitor\" includes any person who engages, or contracts to engage, in the exhibition of motion picture films and is a resident of, or legally authorized to do business in, this state.\nThe term \"license\" includes the offering, intending or making of a license agreement, contract, or any type of agreement whereby a film, the distribution of which is controlled by one of the parties is to be supplied to and exhibited in a theatre owned, controlled, or operated by the other party.\nThe term \"feature motion picture film\" means all motion pictures, whether copyrighted or uncopyrighted, including positive and negative prints and copies or reproductions of such prints, which films contain photoplays or other subjects and are produced for public exhibition. The term shall not include films commonly known as short subjects, newsreels, trailers, serials, reissues, foreign, and western pictures, and road shows.\nThe term \"exhibition season\" means a period of 12 months as may be selected by the producer-distributor, but there shall be no lapse of time between the termination of one season and the beginning of the next.\n[Repealed, 1992 c 464 art 1 s 19]\n[Repealed, 1989 c 209 art 1 s 33]",
	"repealed": false
}