{
	"id": "297E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.05",
	"title": "297E.05 DISTRIBUTOR REPORTS AND RECORDS.",
	"text": "A distributor shall keep at each place of business complete and accurate records for that place of business, including itemized invoices of gambling product held, purchased, manufactured, or brought in or caused to be brought in from without this state, and of all sales of gambling product. The records must show the names and addresses of purchasers, the inventory at the close of each period for which a return is required of all gambling product on hand, and other pertinent papers and documents relating to the purchase, sale, or disposition of gambling product. Books, records, itemized invoices, and other papers and documents required by this section must be kept for a period of at least 3-1/2 years after the date of the documents, or the date of the entries appearing in the records, unless the commissioner of revenue authorizes in writing their destruction or disposal at an earlier date.\nA distributor must maintain a record of all gambling product that it sells. The record must include:\n(1) the identity of the person from whom the distributor purchased the product;\n(2) the registration number of the product;\n(3) the name, address, and license or exempt permit number of the organization or person to which the sale was made;\n(4) the date of the sale;\n(5) the name of the person who ordered the product;\n(6) the name of the person who received the product;\n(7) the type of product;\n(8) the serial number of the product;\n(9) the name, form number, or other identifying information for each game; and\n(10) in the case of bingo hard cards or sheets sold on and after January 1, 1991, the individual number of each card or sheet.\nA distributor shall give with each sale of gambling product an itemized invoice showing the distributor's name and address, the purchaser's name and address, the date of the sale, description of the deals, including the ideal gross from every deal of pull-tabs and every deal of tipboards.\nA distributor shall report monthly to the commissioner, on a form the commissioner prescribes, its sales of each type of gambling product. This report must be filed monthly on or before the 20th day of the month succeeding the month in which the sale was made. The commissioner shall prescribe the content, format, and manner of returns or other documents pursuant to section 270C.30.\nThe commissioner may, upon request, require a distributor to furnish a certified physical inventory of all gambling product in stock. The inventory must contain the information required by the commissioner.",
	"repealed": false
}