{
	"id": "515A.2-119",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-119",
	"title": "515A.2-119 AMENDMENT OF DECLARATION.",
	"text": "(a) Except in cases of amendments which may be executed by a declarant under sections 515A.2-110(c) and (d), 515A.2-111(a); the association under section 515A.1-107(a); or certain unit owners under sections 515A.2-114, 515A.2-115, or 515A.2-120(b), and except as limited by subsection (d), the declaration may be amended by the association only by a vote or written agreement of unit owners to which at least 67 percent of the votes in the association are allocated, and 67 percent of the first mortgagees of the units (each mortgagee having one vote per unit financed) or any larger or smaller majority the declaration specifies. The declaration may specify any percentage if all of the units are restricted exclusively to nonresidential use.\n(b) Every amendment to the declaration shall be recorded in every county in which any portion of the condominium is located, and is effective only when recorded.\n(c) Except to the extent expressly permitted or required by other provisions of sections 515A.1-101 to 515A.4-117, no amendment may create or increase special declarant rights, increase the number of units, convert common elements to limited common elements, or change the boundaries of any unit, the common element interest, common expense liability, or voting strength in the association allocated to a unit, or the uses to which any unit is restricted, in the absence of unanimous written agreement of the unit owners and holders of an interest as security for an obligation.\n(d) Limited common elements shall not be altered without the written agreement of the unit owners and holders of an interest to secure an obligation of the units to which the limited common elements are allocated.\n(e) An affidavit of the secretary of the association stating that the votes or agreements required by this section have occurred, shall be attached to the amendment and shall constitute prima facie evidence of the representations contained therein.",
	"repealed": false
}