{
	"id": "62Q.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.58",
	"title": "62Q.58 ACCESS TO SPECIALTY CARE.",
	"text": "A health plan company shall establish a procedure by which an enrollee may apply for and, if appropriate, receive a standing referral to a health care provider who is a specialist if a referral to a specialist is required for coverage. This procedure for a standing referral must specify the necessary managed care review and approval an enrollee must obtain before such a standing referral is permitted.\n(a) An enrollee who requests a standing referral to a specialist qualified to treat the specific condition described in clauses (1) to (5) must be given a standing referral for visits to such a specialist if benefits for such treatment are provided under the health plan and the enrollee has any of the following conditions:\n(1) a chronic health condition;\n(2) a life-threatening mental or physical illness;\n(3) pregnancy beyond the first trimester of pregnancy;\n(4) a degenerative disease or disability; or\n(5) any other condition or disease of sufficient seriousness and complexity to require treatment by a specialist.\n(b) Nothing in this section limits the application of section 62Q.52 specifying direct access to obstetricians and gynecologists.\n(c) Paragraph (a) does not apply to health plans issued under sections 43A.23 to 43A.31.\nAn enrollee with a standing referral to a specialist may request primary care services from that specialist. The specialist, in agreement with the enrollee and primary care provider or primary care group, may elect to provide primary care services to the enrollee, authorize tests and services, and make secondary referrals according to procedures established by the health plan company. The health plan company may limit the primary care services, tests and services, and secondary referrals authorized under this subdivision to those that are related to the specific condition or conditions for which the standing referral was made.\nInformation regarding referral procedures must be included in member contracts or certificates of coverage and must be provided to an enrollee or prospective enrollee by a health plan company upon request.\n(a) If a standing referral is authorized under subdivision 1 or is mandatory under subdivision 1a, the health plan company must provide a referral to an appropriate participating specialist who is reasonably available and accessible to provide the treatment or to a nonparticipating specialist if the health plan company does not have an appropriate participating specialist who is reasonably available and accessible to treat the enrollee's condition or disease.\n(b) If an enrollee receives services from a nonparticipating specialist because a participating specialist is not available, services must be provided at no additional cost to the enrollee beyond what the enrollee would otherwise pay for services received from a participating specialist.",
	"repealed": false
}