{
	"id": "49.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.02",
	"title": "49.02 ASSESSMENTS ON STOCK; STOCK UNPAID OR CAPITAL IMPAIRED.",
	"text": "Every bank or trust company which shall have failed to pay up its capital stock as required by law, or the capital of which shall have become impaired, within 90 days after receiving notice thereof from the commissioner, shall make up the deficiency by a pro rata assessment on the capital stock, to be made by the stockholders at a meeting called for that purpose, and, in case of its refusal to do so, the commissioner may proceed forthwith to take possession of its property and business and liquidate it as hereinafter provided; but, with the commissioner's consent and approval it may reduce its paid-up capital stock, as provided by law, pay in any remaining deficiency, and thereupon continue business upon the reduced capital.\nThe directors of any bank or trust company receiving notice from the commissioner to make good an impairment of capital shall fix the time when the assessment made at the stockholders' meeting shall become due and payable, which time shall be not less than 15, nor more than 30, days after the assessment is levied. Notice of this assessment shall be mailed to each stockholder at the office address as shown by the stock books of the bank or trust company.\nIf any stockholder shall fail to pay in cash the amount of the assessment against stock for a period of 30 days after the same shall become due and payable, the directors of the bank or trust company shall sell the same at public sale upon ten days' notice, to be given by posting copies of the notice of sale in three public places in the city, town, or community where the bank or trust company is located, or at a private sale, after giving the stockholder ten days' written notice by certified mail addressed to the post office address as shown by the stock books of the bank or trust company.\nUpon sale of any stock, as herein provided, the purchaser shall forthwith become liable for, and shall pay in cash, the amount of the assessment thereon.\nThis stock shall not be sold for less than the amount due thereon and the expense of sale, and any excess shall be paid to the delinquent stockholder. If no bidder offers the amount due and expenses of sale, the amount previously paid on the stock shall be forfeited, and the stock sold by order of the directors within six months thereafter, or canceled and deducted from the capital of the corporation; and when, by reason of this cancellation and reduction, the capital is reduced below the minimum required by law, the deficiency shall be paid in within 30 days, or the commissioner shall take possession of the property and business of said bank or trust company and may proceed to liquidate it as hereinafter provided.",
	"repealed": false
}