{
	"id": "473.173",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.173",
	"title": "473.173 COUNCIL REVIEW; METROPOLITAN SIGNIFICANCE.",
	"text": "The council shall review all proposed matters of metropolitan significance to be undertaken by any private organization, independent commission, board or agency, local governmental unit, or any state agency in accordance with the rules adopted pursuant to this section and the provisions of any other relevant statute.\nThe council shall adopt and put into effect rules establishing standards, guidelines and procedures for determining whether any proposed matter is of metropolitan significance, and establishing a procedure for the review of and final determination on such matters in accordance with the powers and requirements set forth in this section. The purpose of these rules shall be to promote the orderly and economical development, public and private, of the metropolitan area.\nIn developing the rules, the council and the advisory metropolitan land use committee, as defined in section 473.852, shall give consideration to all factors deemed relevant including but not limited to the following:\n(1) The impact a proposed matter will have on the orderly, economical development, public and private, of the metropolitan area and its consistency with the Metropolitan Development Guide;\n(2) The relationship a proposed matter will have to the policy statement goals, standards, programs, and other applicable provisions of the development guide;\n(3) The impact a proposed matter will have on policy plans adopted by the council;\n(4) Functions of municipal governments in respect to control of land use as provided for under the Municipal Planning Act.\n(a) The rules shall include, without limitation, provisions to effectuate and comply with the following powers and requirements.\n(b) No applicant shall be required to submit a proposed matter for review more than once unless it is materially altered.\n(c) A public hearing shall be held prior to the final determination with regard to a proposed matter.\n(d) The council shall be empowered to suspend action on a proposed matter during the period of review and for a period not to exceed 12 months following the issuance of its final determination. In its final determination, the council may prescribe appropriate conditions with regard to a proposed matter which, if incorporated or complied with, would cause the council to remove the suspension.\n(e) The council's recommendation or determination concerning a proposed matter, including the determination as to its metropolitan significance, shall be issued within 90 days following its receipt of a proposal accompanied by adequate supporting information, unless all parties consent in writing to an extension. The council shall extend the time to complete the proceeding by an additional 30 days if the council determines that a fair hearing cannot be completed in the time allowed. To avoid duplication, the review may be suspended for not more than 90 days to await completion of review of a matter by another public agency.\n(f) The council shall be required to review a proposed matter upon request of an affected local governmental unit. The rules shall include a procedure for review of a proposed matter upon petition by a specified number of residents of the metropolitan area 18 years of age or older.\n(g) The council shall be empowered to review all proposed matters of metropolitan significance regardless of whether the council has received a request from an affected body to conduct that review.\n(h) The council shall review all proposed matters determined to be of metropolitan significance as to their consistency with and effect upon metropolitan system plans as defined in section 473.852 and their adverse effects on other local governmental units.\n(i) The council's approved policy plans and areas of operational authority shall not be subject to review under this section.\n(j) When announcing the scope of a significance review in the notice commencing the review, the council shall state with particularity, with respect to each issue identified in the scoping document, the policies, provisions, statements, or other elements in Metropolitan Development Guide chapters or policy plans and any other criteria or standards that will be considered or relied on in assessing and determining the metropolitan significance of the proposed project. The statement may be amended by notice to all parties given at least seven days before the public hearing. The statement does not preclude council comment on the consistency of the proposed project with any plans or policies of the council.\n(k) Hearings must be conducted in accordance with the following procedures, unless waived in writing by the parties:\n(1) The parties have the right to counsel.\n(2) All testimony must be under oath.\n(3) A complete and accurate record of all proceedings must be maintained.\n(4) Any party or witness may be questioned by the hearing committee or judge, or by other parties.\n(5) The burden of proof that a matter is of metropolitan significance is on the council.\n(6) Decisions of the council on the metropolitan significance of a project must be based on a fair preponderance of the relevant evidence contained in the record and on written findings.\nThe rules and any major alteration or amendment thereto shall be developed and promulgated by the council in accordance with the provisions of this section and, to the extent not inconsistent or at variance with this section, in accordance with the Administrative Procedure Act, chapter 14, and rules pursuant to thereto. Once the development of all of the rules has been completed by the council and the committee, and no later than 30 days prior to the date specified for their adoption, the council shall hold a public hearing for the purpose of considering the developed rules and receiving comments and recommendations thereon. Notice of the hearing shall be published in appropriate newspapers of general circulation in the metropolitan area and mailed to all persons who have registered for that purpose under chapter 14, appropriate state and regional agencies and all cities, counties, towns, school districts, and watershed districts within the metropolitan area no later than 30 days prior to the hearing. In adopting or amending the rules the enactment of this section shall be deemed to establish or show the need for and to provide evidence in support of the rules or amendments as required in chapter 14, and rules pursuant thereto, but the council shall prepare for distribution a written summary describing the basis for the composition of the draft rules or amendments submitted for hearing and shall afford to all interested persons an opportunity at the hearing to question and make suggestions concerning their composition. Following the hearing, the council may revise the proposed rules, giving consideration to all comments received, and thereafter the council shall finally adopt these rules.\nThe council and the advisory metropolitan land use committee shall review and assess the rules following their effective date and at least every two years thereafter. No major alteration or amendments to standards for determining metropolitan significance shall be put into effect by the council until 90 days have elapsed following a report to the legislature in which the alteration or amendment was proposed and recommended by the council in the form of a proposed rule published under section 14.14, subdivision 1a, or 14.22. The report to the legislature must be made during the month of January.",
	"repealed": false
}