{
	"id": "21.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.85",
	"title": "21.85 COMMISSIONER'S POWERS AND DUTIES.",
	"text": "[Repealed, 2003 c 128 art 8 s 22]\n(a) The commissioner must establish and maintain a seed laboratory for seed testing, employing necessary agents and assistants to administer and enforce sections 21.80 to 21.92, who shall be governed by chapter 43A.\n(b) The laboratory procedures for testing official seed samples are the procedures set forth in the Rules for Testing Seeds that is published annually by the Association of Official Seed Analysts. If a laboratory procedure rule does not exist for a particular type of seed, then laboratory procedures from other recognized seed testing sources may be used, including procedures under the Code of Federal Regulations, title 7, part 201, or the International Rules for Testing Seeds.\n(c) The commissioner must apply the following tolerances when comparing the label claims made for required label categories, minimum standards not specifically required to be labeled, or other label claims that can be verified by laboratory analysis:\n(1) tolerances for pure seed, weed seed, other crop seed, and inert matter according to Code of Federal Regulations, title 7, section 201.60, including additional tolerances for chaffy seeds and mixtures containing chaffy seeds;\n(2) tolerances for the presence of prohibited noxious weed seeds and rate of occurrence of restricted weed seeds according to Code of Federal Regulations, title 7, section 201.65;\n(3) tolerances for germination, hard seed, dormant seed, total viable seed, and pure live seed percentages of kinds of seeds required to be labeled as agricultural seed according to Code of Federal Regulations, title 7, section 201.63; and\n(4) minimum germination standards:\n(i) for vegetable seed germination, in accordance with section 21.82, subdivision 7, paragraph (a), and the germination standards for vegetable seeds prepared for use by home gardeners in Code of Federal Regulations, title 7, section 201.31; and\n(ii) for flower seed germination, in accordance with section 21.82, subdivision 8, paragraph (a), and the germination standards for flower seeds prepared for use by home gardeners as listed in the Recommended Uniform State Seed Law.\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\n[Repealed, 2003 c 128 art 8 s 22]\nIn the event of acute shortages of any seed or seeds, or the occurrence of other conditions which in the opinion of the commissioner create an emergency which would make impractical the enforcement of any requirement of sections 21.80 to 21.92 relating to the percentage of purity, weed seed content, and the variety name of any seed or seeds, the commissioner may temporarily change and alter any requirement relating to percentage of purity, weed seed content, and the variety name for the duration of the emergency.\nThe commissioner may adopt rules under this chapter. A violation of the rules is a violation of this chapter.\nThe commissioner shall provide for purity and germination tests of seeds and identification of seeds and plants for farmers, dealers, and others, and shall establish schedules to recover the cost of services provided. Money collected must be deposited in the laboratory services account in the agricultural fund.\nThe commissioner may sample agricultural, vegetable, flower, wildflower, tree, or shrub seeds which are destined for export to other countries, and may establish and collect suitable fees from the exporter for this service.\nThe commissioner shall cooperate with the United States Department of Agriculture in Seed Law enforcement.\nThe commissioner, in consultation with the Seed Program Advisory Committee, must determine species that are considered prohibited weed seeds and restricted noxious weed seeds and the allowable rate of occurrence of restricted noxious weed seeds subject to sections 21.80 to 21.92. The commissioner must prepare, publish, and revise at least once every three years, a list of prohibited and restricted noxious weed seeds. The commissioner must distribute the list to the public and may request the help of the United States Department of Agriculture's published All-States Noxious Weed Seed List or any other organization that the commissioner considers appropriate to assist in the distribution. The commissioner may, in consultation with the Seed Program Advisory Committee, accept and consider noxious weed seed designation petitions from Minnesota citizens or Minnesota organizations or associations including the Noxious Weed Advisory Committee.",
	"repealed": false
}