{
	"id": "136A.1792",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1792",
	"title": "136A.1792 PROMOTION OF FEDERAL PUBLIC SERVICE LOAN FORGIVENESS PROGRAMS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Employer\" means an organization, agency, or entity that is a public service organization under Code of Federal Regulations, title 34, part 685, section 219, provided that the following are not employers:\n(1) a federal or tribal government organization, agency, or entity; and\n(2) a tribal college or university.\n(c) \"Employment certification form\" means the form used by the United States Department of Education to certify an individual's employment at a public service organization for the purposes of the federal public service loan forgiveness program.\n(d) \"Federal loan forgiveness program\" means a loan forgiveness program offered under Code of Federal Regulations, title 34, part 685.\n(e) \"Public service loan forgiveness program\" means the loan forgiveness program under Code of Federal Regulations, title 34, part 685, section 219.\n(f) \"Public service organization\" means a public service organization under Code of Federal Regulations, title 34, part 685, section 219.\n(a) The commissioner must develop and distribute informational materials designed to increase awareness of federal public service loan forgiveness programs among Minnesota residents who are eligible for those programs. At a minimum, the commissioner must develop and distribute informational materials that public service organizations may use to promote awareness of the federal public service loan forgiveness program, including:\n(1) a one-page letter addressed to individuals who may be eligible for the public service loan forgiveness program that briefly summarizes the program, provides information on what an eligible individual must do in order to participate, and recommends that they contact their student loan servicer or servicers for additional information;\n(2) a detailed fact sheet describing the public service loan forgiveness program; and\n(3) a document containing answers to frequently asked questions about the public service loan forgiveness program.\n(b) In place of developing and publishing an informational document required under paragraph (a), the commissioner may distribute a document published by a federal agency that meets the requirements of paragraph (a).\nThe commissioner must make the informational materials required under subdivision 2 available on the office's website and must verify each biennium that the informational materials contain current information. The commissioner must update and correct any informational materials that the commissioner finds inaccurate or outdated.\n(a) An employer must provide an employee with information about the employee's potential eligibility for the federal public service loan forgiveness program. An employer must annually provide to each employee in written or electronic form the one-page letter, fact sheet, and frequently asked questions required under subdivision 2. In addition, an employer must provide a newly hired employee with that information within two weeks of the employee's first day of employment.\n(b) At an employee's request, an employer must provide the employee with a copy of the employment certification form.",
	"repealed": false
}