{
	"id": "103F.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.311",
	"title": "103F.311 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 103F.311 to 103F.345.\n\"Commissioner\" means the commissioner of natural resources.\n\"Free-flowing\" means existing in natural condition without significant artificial modification such as impoundment, diversion, or straightening. The existence, however, of low dams, diversion works or other minor structures at the time any river is proposed for inclusion does not automatically bar its inclusion as a wild, scenic, or recreational river.\n\"Recreational rivers\" are those rivers that may have undergone some impoundment or diversion in the past and may have adjacent lands that are considerably developed, but that are still capable of being managed so as to further the purposes of sections 103F.301 to 103F.345.\n\"River\" means a flowing body of water such as a stream or a segment or tributary of a stream and may include lakes through which the river or stream flows.\n\"Scenic easement\" means an interest in land, less than the fee title, that limits the use of the land to protect the scenic, recreational, or natural characteristics of a wild, scenic, or recreational river area. Unless otherwise expressly and specifically provided by the parties, the easement must be:\n(1) perpetually held for the benefit of the people of the state;\n(2) specifically enforceable by its holder or any beneficiary;\n(3) binding upon the holder of the servient estate, and the holder's heirs, successors, and assigns; and\n(4) restricted so as not to give the holder or any beneficiary the right to enter on the land except for enforcement of the easement.\n\"Scenic rivers\" are those rivers that exist in a free-flowing state and with adjacent lands that are largely undeveloped.\n\"System\" means the state wild and scenic rivers system.\n\"Wild rivers\" are those rivers that exist in a free-flowing state, with excellent water quality, and with adjacent lands that are essentially primitive.",
	"repealed": false
}