{
	"id": "161.3203",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.3203",
	"title": "161.3203 CONTRACTS FOR WORK FOR TRUNK HIGHWAY.",
	"text": "For purposes of this section, \"privatization transportation contract\" means an enforceable agreement, or combination or series of agreements, by which a private contractor agrees with the commissioner of transportation to provide work (1) that is incidental to the construction or improvement of trunk highways, or (2) for maintenance of trunk highways. A privatization transportation contract does not include a design-build contract as defined in section 161.3410, subdivision 3, contracts awarded pursuant to section 161.32, work related to utility relocation, utility relocation agreements, state aid agreements, municipal agreements, interagency agreements, joint powers agreements, partnership agreements, and grant agreements. Privatization transportation contracts also do not include contracts related to aerial photos, asbestos investigation or abatement, communications, computer and information technology, construction contract administration, cultural resource investigations, electronic communications, environmental investigations, expert witnesses, contaminated soil investigations and remediation, geographic information systems, hydraulic and geotechnical studies, intelligent transportation systems, management support, mapping and photogrammetrics, market research, medical analysis, planning, public relations, right-of-way appraisals or acquisitions and field title investigations, research, relocation services, special studies, traffic studies and modeling, and employee training, and does not include services by persons licensed under sections 326.02 to 326.15.\nThis section applies to privatization transportation contracts in a total amount greater than $100,000. The requirements imposed by this section are in addition to, and do not supersede, the requirements of any other applicable section of law.\n(a) Before entering into a privatization transportation contract, the commissioner of transportation shall prepare a comprehensive written estimate of the cost of having the same work provided in the most cost-effective manner by agency employees. The cost estimate must include all costs of having agency employees provide the work, including the cost of pension, insurance, and other employee benefits. The cost estimate is nonpublic data, as defined in section 13.02, subdivision 9, until the day after the deadline for receipt of responses under paragraph (b), when it becomes public data.\n(b) After soliciting and receiving responses, the commissioner shall publicly designate the responder to which it proposes to award the privatization contract. The commissioner shall prepare a comprehensive written estimate of the cost of the proposal based on the designated responder's bid, including the cost of a transition from public to private provision of the work, any additional unemployment and retirement benefits resulting from the transfer, and costs associated with monitoring the proposed contract. If the designated responder proposes to perform any or all of the desired services outside the state, the commissioner of transportation shall include in the cost estimate, as nearly as possible, any loss of sales and income tax revenue to the state. The cost estimate must not include trade secret data which is classified as nonpublic data under section 13.37, subdivision 2.\n(c) Before entering into a privatization transportation contract for $250,000 or more, the commissioner shall determine that:\n(1) the cost estimated under paragraph (b) will be lower than the cost estimated under paragraph (a);\n(2) the quality of the work to be provided by the designated responder is likely to equal or exceed the quality of services that could be provided by Department of Transportation employees;\n(3) the contract, together with other privatization transportation contracts to which the department is or has been party, will not reduce full-time equivalent positions within the department or result in layoffs; and\n(4) the proposed privatization contract is in the public interest.\n(a) By September 1 of each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance.\n(b) The report must list all privatization transportation contracts that were executed or performed, whether wholly or in part, in the previous fiscal year. The report must identify, with respect to each contract:\n(1) the contractor;\n(2) contract amount;\n(3) duration;\n(4) work, provided or to be provided;\n(5) the comprehensive estimate derived under subdivision 3, paragraph (a);\n(6) the comprehensive estimate derived under subdivision 3, paragraph (b);\n(7) the actual cost to the agency of the contractor's performance of the contract; and\n(8) for contracts of at least $250,000, a statement containing the commissioner's determinations under subdivision 3, paragraph (c).\n(c) The report must collect aggregate data on each of the commissioner's district offices and the bridge office on barriers and challenges to the reduction of transportation contract privatization. The aggregate data must identify areas of concern related to transportation contract privatization and include information on:\n(1) recruitment and retention of staff;\n(2) expertise gaps;\n(3) access to appropriate equipment; and\n(4) the effects of geography, demographics, and socioeconomic data on transportation contract privatization rates.\nThis section may be cited as the \"Taxpayers' Transportation Accountability Act.\"",
	"repealed": false
}