{
	"id": "161.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.44",
	"title": "161.44 RELINQUISHMENT OF LAND NO LONGER NEEDED.",
	"text": "The commissioner may convey and quitclaim any lands, including any improvements thereon, owned in fee by the state for trunk highway purposes but no longer needed therefor. Notwithstanding any provisions in this section or in section 161.23 to the contrary, fee title to or an easement in all or part of the lands and lands previously acquired in fee for trunk highways or acquired pursuant to section 161.23, in excess of what is needed for highway purposes may be conveyed and quitclaimed for public purposes to any political subdivision, Indian tribal government, or agency of the state upon the terms and conditions as may be agreed upon between the commissioner and the political subdivision, Indian tribal government, or agency.\n(a) The commissioner is encouraged to examine all real property owned by the state and under the custodial control of the department to decide whether any real property may be suitable for sale or some other means of disposal.\n(b) The commissioner may not sell or otherwise dispose of property under this subdivision unless: (1) an analysis, which must consider any relevant nonmotorized transportation plans or in the absence of such plans, demographic and development factors affecting the region, demonstrates that (i) the property or a portion of it is not reasonably suitable for bicycle or pedestrian facilities, and (ii) there is not a likelihood of bicycle or pedestrian facility development involving the property; or (2) the use of the property for bicycle or pedestrian facilities is protected by deed restriction, easement, agreement, or other means.\n(c) The commissioner shall report the findings under paragraph (a) to the house of representatives and senate committees with jurisdiction over transportation policy and finance by March 1 of each odd-numbered year. The report may be submitted electronically.\nIf the lands were part of a larger tract and the remainder of the tract is still owned by the person or the person's surviving spouse from whom the lands were acquired, or if the lands constituted an entire tract, the lands must first be offered for reconveyance to the previous owner or the owner's surviving spouse. When lands are offered for reconveyance, the amount of money to be repaid for those lands must be the appraised current market value of the lands to be reconveyed. The offer must be made by certified mail addressed to the person at the person's last known address. The person or the person's surviving spouse shall have 60 days from the date of mailing the offer to accept and to tender to the commissioner the required sum of money.\nIf the lands were part of a larger tract and the remainder of the tract is no longer owned by the person or the person's surviving spouse from whom the lands were acquired, the lands shall be offered for conveyance to the person owning the remaining tract in the same manner and on the same terms as provided in subdivision 2.\nIf the lands were part of a larger tract and if the tract has been platted or divided into smaller tracts and sold, the commissioner may offer the lands to the owners of the smaller tracts or lots abutting upon the lands in the same manner and on the same terms as provided in subdivision 2, or the commissioner may proceed to sell the lands to the highest responsible bidder as provided in subdivisions 5 and 6.\nIf the larger tract has been platted into lots or divided into smaller tracts and the commissioner elects to proceed under this subdivision, the lands constituted an entire tract and the person from whom the lands were acquired and the person's spouse are deceased, or the offers as provided for are not accepted and the amount of money not tendered within the time prescribed, the lands may be sold and conveyed to the owner of the land abutting upon the lands in the same manner and under the same terms provided under subdivision 2, or the commissioner may sell the lands to the highest responsible bidder upon three weeks' published notice of such sale in a newspaper or other periodical of general circulation in the general area where the lands are located. All bids may be rejected and new bids received upon like advertisement.\nIn lieu of the advertisement for sale and conveyance to the highest responsible bidder, such lands may be offered for sale and sold at public auction to the highest responsible bidder. Such sale shall be made after publication of notice thereof in a newspaper of general circulation in the area where the property is located for at least two successive weeks and such other advertising as the commissioner may direct. If the sale is made at public auction a duly licensed auctioneer may be retained to conduct such sale, the auctioneer's fees for such service to be paid from the proceeds, and there is appropriated from such proceeds an amount sufficient to pay such fees.\nIf the lands are withdrawn from sale under subdivision 6b, the commissioner may retain the services of a licensed real estate broker to find a buyer. The sale price may be negotiated by the broker, but must not be less than 80 percent of the appraised market value as determined by the commissioner. The broker's fee must be established by prior agreement between the commissioner and the broker, and must not exceed ten percent of the sale price for sales of $10,000 or more. The broker's fee must be paid to the broker from the proceeds of the sale.\nIf lands remain unsold after being offered for sale to the highest bidder, the commissioner may offer the remaining lands to any person who agrees to pay at least 80 percent of the minimum bid established for the public sale. Any offers less than 100 percent of the minimum bid must be approved by the commissioner prior to a sale. The sale must continue until all eligible lands have been sold or the commissioner withdraws the remaining lands from sale. The lands to be sold must be listed on the department's Unsold Property Inventory list.\nIn all cases as hereinbefore specified, if the lands to be reconveyed were acquired for gravel or borrow pit purposes and the commissioner has determined that all materials suitable or needed for trunk highway purposes have been removed from such pit, the amount to be repaid therefor need not be at least the amount paid for such pit by the state, but in no event shall the amount to be so repaid to the state therefor be less than the estimated market value thereof. In all other respects the procedures for the reconveyance of gravel or borrow pits shall be the same as the procedures for the reconveyance of other lands as provided in this section.\nThe deed may contain restrictive clauses limiting the use of the lands or the estate conveyed when the commissioner determines that such restrictions are reasonably necessary in the interest of safety and convenient public travel.\nMoneys received from the sale of such lands and properties less any fees paid under subdivision 6a, must be paid into the trunk highway fund.\nMS 1965 [Repealed, 1967 c 214 s 6]\nNothing contained in this section shall apply to the lease or other agreement for the use of air space above and the subsurface area below the right-of-way of any trunk highway or the surface of any trunk highway right-of-way as provided in section 161.433, subdivision 1.",
	"repealed": false
}