{
	"id": "62L.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.22",
	"title": "62L.22 ASSESSMENTS.",
	"text": "For the purpose of providing the funds necessary to carry out the purposes of the association, the board of directors shall assess members as provided in subdivisions 2, 3, and 4 at the times and for the amounts the board of directors finds necessary. Assessments are due and payable on the date specified by the board of directors, but not less than 30 days after written notice to the member. Assessments accrue interest at the rate of six percent per year on or after the due date.\nThe interim board of directors shall determine the initial capital operating requirements for the association. The board shall assess each licensed health carrier $100 for the initial capital requirements of the association. The assessment is due and payable no later than January 1, 1993.\nOn or before July 1 of each year, the administering carrier shall determine the association's net loss, if any, for the previous calendar year, the program expenses of administration, and other appropriate gains and losses. If reinsurance premium charges are not sufficient to satisfy the operating and administrative expenses incurred or estimated to be incurred by the association, the board of directors shall assess each member participating in the association in proportion to each member's respective share of the total insurance premiums, subscriber contract payments, health maintenance organization payments, and other health benefit plan revenue derived from or on behalf of small employers during the preceding calendar year. The assessments must be calculated by the board of directors based on annual statements and other reports considered necessary by the board of directors and filed by members with the association. The amount of the assessment shall not exceed four percent of the member's small group market premium. In establishing this assessment, the board shall consider a formula based on total small employer premiums earned and premiums earned from newly issued small employer plans. A member's assessment may not be reduced or increased by more than 50 percent as a result of using that formula, which includes a reasonable cap on assessments on any premium category or premium classification. The board of directors may provide for interim assessments as it considers necessary to appropriately carry out the association's responsibilities. The board of directors may establish operating rules to provide for changes in the assessment calculation.\nIf the board of directors determines that the retrospective assessment formula described in subdivision 3 is insufficient to meet the obligations of the association, the board of directors shall assess each member not participating in the reinsurance association, but which is providing health plan coverage in the small employer market, in proportion to each member's respective share of the total insurance premiums, subscriber contract payments, health maintenance organization payments, and other health benefit plan revenue derived from or on behalf of small employers during the preceding calendar year. The assessment must be calculated by the board of directors based on annual statements and other reports considered necessary by the board of directors and filed by members with the association. The amount of the assessment may not exceed one percent of the member's small group market premium. Members who paid the retrospective assessment described in subdivision 3 are not subject to the additional assessment.\nIf the additional assessment is insufficient to meet the obligations of the association, the board of directors may assess members participating in the association who paid the retrospective assessment described in subdivision 3 up to an additional one percent of the member's small group market premium.\nThe association may abate or defer, in whole or in part, the retrospective assessment of a member if, in the opinion of the commissioner, payment of the assessment would endanger the ability of the member to fulfill its contractual obligations or the member is placed under an order of rehabilitation, liquidation, receivership, or conservation by a court of competent jurisdiction. In the event that a retrospective assessment against a member is abated or deferred, in whole or in part, the amount by which the assessment is abated or deferred may be assessed against other members in accordance with the methodology specified in subdivisions 3 and 4.\nThe board of directors may refund to members, in proportion to their contributions, the amount by which the assets of the association exceed the amount the board of directors finds necessary to carry out its responsibilities during the next calendar year. A reasonable amount may be retained to provide funds for the continuing expenses of the association and for future losses.\nA health carrier may appeal to the commissioner of commerce within 30 days of notice of an assessment by the board of directors. A final action or order of the commissioner is subject to judicial review in the manner provided in chapter 14.\nEmployer liability for other costs of a health carrier resulting from assessments made by the association under this section are limited by the rate spread restrictions specified in section 62L.08.",
	"repealed": false
}