{
	"id": "473.4065",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4065",
	"title": "473.4065 TRANSIT RIDER ACTIVITY.",
	"text": "(a) The council must adopt a rider code of conduct for transit passengers. The council must post a copy of the code of conduct in a prominent location at each light rail transit station, bus rapid transit station, and transit center.\n(b) The code of conduct must not prohibit sleeping in a manner that does not otherwise violate conduct requirements.\n(c) Prior to adoption of the rider code of conduct, or a revision, the council must perform a stakeholder engagement process. At a minimum, the process must include solicitation and consideration of public comments on conduct requirements and the rider experience.\nAn authorized transit representative, as defined in section 609.855, subdivision 7, paragraph (g), may order a person to depart a transit vehicle or transit facility for a violation of the rider code of conduct established under subdivision 1 if the person continues to act in violation of the code of conduct after being warned once to stop.\nThe council must establish and clearly designate paid fare zones at each light rail transit station where the council utilizes self-service barrier-free fare collection.\n(a) The council must implement and maintain public safety monitoring and response activities at light rail transit facilities that include:\n(1) placement of security cameras and sufficient associated lighting that provide live coverage for the entire area at each light rail transit station and each light rail transit vehicle;\n(2) installation of a public address system at each light rail transit station that is capable of providing information and warnings to passengers; and\n(3) real-time active monitoring of passenger activity and potential violations throughout the light rail transit system.\n(b) The monitoring activities must include timely maintenance or replacement of malfunctioning cameras or public address systems.",
	"repealed": false
}