{
	"id": "501B.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.53",
	"title": "501B.53 ORDER OF CONFIRMATION; CONTENTS AND SUBSEQUENT PROCEDURES; DISTRIBUTION OF ASSETS.",
	"text": "If an agreement reported to the court under section 501B.52 is found by the court to conform to the order described in section 501B.51, the court shall make an order approving and confirming the agreement and directing the trustee or receiver to execute and deliver the deed, mortgage, or lease of real property required by the agreement.\nThe order of confirmation may direct that each participant in the proceeding be paid reasonable costs of the proceeding incurred by the participant. The order of confirmation may make appropriate allowances to persons who have served in the proceeding as receiver, guardian ad litem, or counsel, and may direct the manner of payment of these allowances.\nThe order of confirmation must include appropriate provisions for the safekeeping, management, and distribution of assets derived from the ordered transaction. In the case of assets derived from a transaction executed by a trustee under section 501B.51, subdivision 2, paragraph (a), distribution must be made to the trustee for administration as trust assets. In the case of assets derived from a transaction executed by a receiver under section 501B.51, subdivision 2, paragraph (b), distribution must be made to the owners, at the time of the sale or mortgage, of present possessory interests in the real property that was sold or mortgaged, and to the owners of leased real property who would be entitled to possession on the present termination of the lease. Notwithstanding any contrary provision in the terms of the instrument creating the interests in real property sold, mortgaged, or leased under this subdivision, the same possessory and future interests exist in the assets distributed as existed in the real property, and any provision in the creating instrument for forfeiture of an interest in real property upon a sale or other assignment must be disregarded by the court in directing distribution or other assignment of interests in the proceeds of a sale.\nThe trustee or receiver shall obtain from the court a time and place for the court's hearing on the confirmation of the agreement and shall give mailed notice of the time and place of the hearing to the interested parties described in section 501B.51 at least 15 days before the date of that hearing. The order of confirmation is final and conclusive as to all matters determined by it and binding in rem on all persons interested in the real property, whether their interests are vested or contingent, even though a person is a minor or incapacitated, as defined in section 524.5-102, subdivision 6 or 10, or otherwise under conservatorship, unascertained, or not in being, except that appeal may be taken in the manner provided in the Rules of Appellate Procedure.\nIn appropriate circumstances, proceedings under this section and section 501B.52 may be combined with proceedings under sections 501B.46 to 501B.51.",
	"repealed": false
}