{
	"id": "216B.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.62",
	"title": "216B.62 REGULATORY EXPENSES.",
	"text": "[Repealed, 1980 c 614 s 191]\nWhenever the commission or department, in a proceeding upon its own motion, on complaint, or upon an application to it, shall deem it necessary, in order to carry out the duties imposed under this chapter (1) to investigate the books, accounts, practices, and activities of, or make appraisals of the property of, any public utility, (2) to render any engineering or accounting services to any public utility, or (3) to intervene before an energy regulatory agency, the public utility shall pay the expenses reasonably attributable to the investigation, appraisal, service, or intervention. The commission and department shall ascertain the expenses, and the department shall render a bill therefor to the public utility, either at the conclusion of the investigation, appraisal, or services, or from time to time during its progress, which bill shall constitute notice of the assessment and a demand for payment. The amount of the bills so rendered by the department shall be paid by the public utility into the state treasury within 30 days from the date of rendition. The total amount, in any one calendar year, for which any public utility shall become liable, by reason of costs incurred by the commission within that calendar year, shall not exceed two-fifths of one percent of the gross operating revenue from retail sales of gas, or electric service by the public utility within the state in the last preceding calendar year. Where, pursuant to this subdivision, costs are incurred within any calendar year which are in excess of two-fifths of one percent of the gross operating revenues, the excess costs shall not be chargeable as part of the remainder under subdivision 3, but shall be paid out of the general appropriation to the department and commission. In the case of public utilities offering more than one public utility service only the gross operating revenues from the public utility service in connection with which the investigation is being conducted shall be considered when determining this limitation.\nThe department and commission shall quarterly, at least 30 days before the start of each quarter, estimate the total of their expenditures in the performance of their duties relating to public utilities under sections 216B.01 to 216B.67, other than amounts chargeable to public utilities under subdivision 2, 6, 7, or 8. The remainder shall be assessed by the commission and department to the several public utilities in proportion to their respective gross operating revenues from retail sales of gas or electric service within the state during the last calendar year. The assessment shall be paid into the state treasury within 30 days after the bill has been transmitted via mail, personal delivery, or electronic service to the several public utilities, which shall constitute notice of the assessment and demand of payment thereof. The total amount which may be assessed to the public utilities, under authority of this subdivision, shall not exceed one-sixth of one percent of the total gross operating revenues of the public utilities during the calendar year from retail sales of gas or electric service within the state. The assessment for the third quarter of each fiscal year shall be adjusted to compensate for the amount by which actual expenditures by the commission and department for the preceding fiscal year were more or less than the estimated expenditures previously assessed.\nIn addition to other assessments in subdivision 3, the commission may assess up to $800,000 per year for supplemental staffing to implement requirements of this chapter. The amount in this subdivision shall be assessed to the several public utilities in proportion to their respective gross operating revenues from retail sales of gas or electric service within the state during the last calendar year and shall be deposited into an account in the special revenue fund. An assessment made under this subdivision is not subject to the cap on assessments provided in subdivision 3 or any other law.\nIn addition to other assessments in subdivision 3, the department may assess up to $1,000,000 per fiscal year to perform the duties under section 216A.07, subdivision 3a, and to conduct analysis that assesses energy grid reliability at state, regional, and national levels. The amount in this subdivision shall be assessed to energy utilities in proportion to their respective gross operating revenues from retail sales of gas or electric service within the state during the last calendar year and shall be deposited into an account in the special revenue fund and is appropriated to the commissioner of commerce for the purposes of section 216A.07, subdivision 3a. An assessment made under this subdivision is not subject to the cap on assessments provided in subdivision 3 or any other law. For the purpose of this subdivision, an \"energy utility\" means public utilities, generation and transmission cooperative electric associations, and municipal power agencies providing natural gas or electric service in the state.\nWithin 30 days after the date of the transmittal of any bill as provided by subdivisions 2, 3, 7, and 8, the public utility against which the bill has been rendered may file with the commission objections setting out the grounds upon which it is claimed the bill is excessive, erroneous, unlawful, or invalid. The commission shall within 60 days hold a hearing and issue an order in accordance with its findings. The order shall be appealable in the same manner as other final orders of the commission.\nThe commission and department may charge cooperative electric associations, generation and transmission cooperative electric associations, municipal power agencies, and municipal electric utilities their proportionate share of the expenses incurred in the review and disposition of resource plans, adjudication of service area disputes, proceedings under section 216B.1691, 216B.2425, or 216B.243, and the costs incurred in the adjudication of complaints over service standards, practices, and rates. Cooperative electric associations electing to become subject to rate regulation by the commission pursuant to section 216B.026, subdivision 4, are also subject to this section. Neither a cooperative electric association nor a municipal electric utility is liable for costs and expenses in a calendar year in excess of the limitation on costs that may be assessed against public utilities under subdivision 2. A cooperative electric association, generation and transmission cooperative electric association, municipal power agency, or municipal electric utility may object to and appeal bills of the commission and department as provided in subdivision 4.\nThe commission and department may charge transmission companies their proportionate share of the expenses incurred in the review and disposition of proceedings under sections 216B.2425, 216B.243, 216B.48, 216B.50, and 216B.79. A transmission company is not liable for costs and expenses in a calendar year in excess of the limitation on costs that may be assessed against public utilities under subdivision 2. A transmission company may object to and appeal bills of the commission and department as provided in subdivision 4.\nThe commission and department may charge a railroad, as defined in section 237.045, subdivision 1, paragraph (e), and a utility as defined in section 237.045, subdivision 1, paragraph (f), for the railroad and utility's proportionate share of expenses incurred by the commission and department in the review and disposition of disputes contained in petitions filed under section 237.045. A railroad or utility that objects to an assessment of the commission or department made under this subdivision has the same right to appeal the assessment under subdivision 4 as does a public utility.\nAny amounts billed to the commission or the department by the Office of Administrative Hearings for public utility contested case hearings shall be assessed by the commission or the department against the public utility. The assessment shall be paid into the state treasury within 30 days after a bill, which constitutes notice of the assessment and demand for payment of it, has been transmitted to the public utility. Money received shall be credited to a special account and is appropriated to the commission or the department for payment to the Office of Administrative Hearings.\nThe department shall assess public utilities, cooperative electric associations, and municipal utilities for the costs of activities under chapter 216C. The department shall not assess for costs of grants, loans, or other aids or for costs that can be recovered through other assessment authority. Each public utility, cooperative, and municipal utility shall be assessed in the proportion that its gross operating revenue for the sale of gas and electric service within the state for the last calendar year bears to the total of those revenues for all public utilities, cooperatives, and municipalities.\nThe audit investigation account is created as a separate account in the special revenue fund in the state treasury. If the commission, in a proceeding upon its own motion, on complaint, or upon an application to it, determines that it is necessary, in order to carry out its duties imposed under this chapter or chapter 216, 216A, 216E, 216F, or 216G, to conduct an investigation or audit of any public utility operations, practices, or policies requiring specialized technical professional investigative services for the inquiry, the commission may request the commissioner of commerce to seek authority from the commissioner of management and budget to incur costs reasonably attributable to the specialized services. If the investigation or audit is approved by the commissioner of management and budget, the commissioner of commerce shall carry out the investigation in the manner directed by the commission and shall render separate bills to the public utility for the costs incurred for such technical professional investigative services. The bill constitutes notice of the assessment and demand for payment. The amount assessed must be paid by the public utility to the commissioner of commerce within 30 days after the date of assessment. Money received under this subdivision must be deposited in the state treasury and credited to the audit investigation account, and is appropriated to the commissioner of commerce for the purposes of this subdivision.",
	"repealed": false
}