{
	"id": "609.3751",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3751",
	"title": "609.3751 DISCHARGE AND DISMISSAL.",
	"text": "A person is eligible for a discharge and dismissal under this section, if the person:\n(1) has not been previously convicted of a felony under the laws of this state or elsewhere;\n(2) has not been previously convicted of a violation of section 609.375 or of a similar offense in this state or elsewhere;\n(3) has not previously participated in or completed a diversion program relating to a charge of violating section 609.375; and\n(4) has not previously been placed on probation without a judgment of guilty for violation of section 609.375.\nFor a person eligible under subdivision 1 who is charged with violating section 609.375, the court may after trial or upon a plea of guilty, without entering a judgment of guilty and with the consent of the person, defer further proceedings and place the person on probation upon such reasonable conditions as it may require and for a period not to exceed the maximum sentence provided for the violation. At a minimum, the conditions must require the defendant to:\n(1) provide the public authority responsible for child support enforcement with an affidavit attesting to the defendant's present address, occupation, employer, current income, assets, and account information, as defined in section 13B.06; and\n(2) execute a written payment agreement regarding both current support and arrearages that is approved by the court.\nIn determining whether to approve a payment agreement under clause (2), the court shall apply the provisions of chapter 518A consistent with the obligor's ability to pay.\nUpon violation of a condition of the probation, including a failure to comply with the written payment agreement approved by the court under subdivision 2, clause (2), the court may enter an adjudication of guilt and proceed as otherwise provided in law.\nThe court may, in its discretion, dismiss the proceedings against the person and discharge the person from probation before the expiration of the maximum period prescribed for the person's probation but may do so only if the full amount of any arrearages has been brought current.\n(a) For purposes of this subdivision, \"not public\" has the meaning given in section 13.02, subdivision 8a.\n(b) If during the period of probation the person does not violate any of the conditions of the probation, then upon expiration of the period the court shall discharge the person and dismiss the proceedings against that person. Discharge and dismissal under this subdivision shall be without court adjudication of guilt, but a not public record of it shall be retained by the Bureau of Criminal Apprehension for the purpose of use by the courts in determining the merits of subsequent proceedings against the person. The not public record may also be opened only upon court order for purposes of a criminal investigation, prosecution, or sentencing. Upon request by law enforcement, prosecution, or corrections authorities, the bureau shall notify the requesting party of the existence of the not public record and the right to seek a court order to open it pursuant to this section. The court shall forward a record of any discharge and dismissal under this section to the bureau which shall make and maintain the not public record of it as provided under this section. The discharge or dismissal shall not be deemed a conviction for purposes of disqualifications or disabilities imposed by law upon conviction of a crime or for any other purpose.",
	"repealed": false
}