{
	"id": "145C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/145C.10",
	"title": "145C.10 PRESUMPTIONS.",
	"text": "(a) The principal is presumed to have the capacity to execute a health care directive and to revoke a health care directive, absent clear and convincing evidence to the contrary.\n(b) A health care provider or health care agent may presume that a health care directive is legally sufficient absent actual knowledge to the contrary. A health care directive is presumed to be properly executed, absent clear and convincing evidence to the contrary.\n(c) A health care agent, and a health care provider acting pursuant to the direction of a health care agent, are presumed to be acting in good faith, absent clear and convincing evidence to the contrary.\n(d) A health care directive is presumed to remain in effect until the principal modifies or revokes it, absent clear and convincing evidence to the contrary.\n(e) This chapter does not create a presumption concerning the intention of an individual who has not executed a health care directive and, except as otherwise provided by section 145C.15, does not impair or supersede any right or responsibility of an individual to consent, refuse to consent, or withdraw consent to health care on behalf of another in the absence of a health care directive.\n(f) A copy of a health care directive is presumed to be a true and accurate copy of the executed original, absent clear and convincing evidence to the contrary, and must be given the same effect as an original.\n(g) When a patient lacks decision-making capacity and is pregnant, and in reasonable medical judgment there is a real possibility that if health care to sustain her life and the life of the fetus is provided the fetus could survive to the point of live birth, the health care provider shall presume that the patient would have wanted such health care to be provided, even if the withholding or withdrawal of such health care would be authorized were she not pregnant. This presumption is negated by health care directive provisions described in section 145C.05, subdivision 2, paragraph (a), clause (10), that are to the contrary, or, in the absence of such provisions, by clear and convincing evidence that the patient's wishes, while competent, were to the contrary.",
	"repealed": false
}