{
	"id": "169.451",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.451",
	"title": "169.451 INSPECTING SCHOOL AND HEAD START BUSES; RULES; MISDEMEANOR.",
	"text": "The Minnesota State Patrol shall inspect every school bus and every Head Start bus annually to ascertain whether its construction, design, equipment, and color comply with all provisions of law.\nExcept as provided in subdivision 2a, no person shall drive, or no owner shall knowingly permit or cause to be driven, any school bus or Head Start bus unless there is displayed thereon a certificate issued by the commissioner of public safety stating that, in the month specified on the certificate, a member of the Minnesota State Patrol inspected the bus and found that on the date of inspection the bus complied with the applicable provisions of state law relating to construction, design, equipment, and color. The certificate is valid for 12 months after the month specified on the certificate.\nIn lieu of the certificate required in subdivision 2, a new or used school bus being sold by a dealer in this state may display an interim inspection certificate. The school bus dealer completing the preregistration certificate required in section 168.102 may inspect the bus to determine if the bus complies with the applicable provisions of state law relating to construction, design, equipment, and color. If the bus complies with the applicable provisions of state law, the dealer may affix the interim inspection certificate to the school bus, indicating that on the date of the inspection, the bus complied with the applicable provisions of state law relating to construction, design, equipment, and color. The interim certificate must include the date of the inspection and must be valid until the owner's next scheduled annual inspection, but must not be valid for more than 12 months following the month of the initial inspection. The commissioner must provide the prescribed interim inspection certificates at no cost to the dealer.\n(a) The commissioner of public safety must inspect school buses in accordance with the School Bus Inspection Manual as prescribed in section 169.4501, subdivision 3. Upon completion of an inspection, the commissioner must provide a printed or electronic vehicle examination report to the carrier or school district.\n(b) A school bus displaying a defect as defined in the \"School Bus Recommended Out-of-Service Criteria\" in the most recent edition of the \"National School Transportation Specification and Procedures\" adopted by the National Congress on School Transportation is deemed unsafe for student transportation. A member of the State Patrol must affix a rejection sticker to the lower left corner of the windshield. A person may remove the rejection sticker only upon authorization from a member of the State Patrol who has determined that all defects have been corrected. Pending reinspection and certification of the vehicle by a member of the State Patrol, a bus bearing a rejection sticker may be used to transport students for up to 30 days provided the defects have been corrected and the vehicle examination report is signed by the owner or a designee certifying that all defects have been corrected. The signed report must be carried in the first aid kit on the bus.\n(c) A school bus that has had an inspection completed in which no out-of-service defects were identified has passed the inspection and a member of the State Patrol must affix an inspection certificate to the lower left corner of the windshield. All defects identified must be repaired within 14 days of the inspection. The person completing the repairs must sign and date the inspection report indicating the repairs were made. The inspection report must be retained at the principal place of business of the carrier or school district for 12 months following the inspection and must be available for review by a representative of the commissioner of public safety.\n(d) A defect discovered during an inspection that was identified by a member of the State Patrol during a previous inspection but has not been corrected results in a failed inspection. A member of the State Patrol must affix a rejection sticker to the lower left corner of the windshield.\n(a) The State Patrol must enforce subdivisions 2 to 3.\n(b) A person who operates a school bus without a valid inspection certificate issued pursuant to subdivision 2 or an interim inspection certificate issued pursuant to subdivision 2a is guilty of a misdemeanor.\n(c) A person who operates, or an owner who knowingly permits the operation of, a school bus displaying a rejection sticker issued in accordance with subdivision 3, paragraph (b), and has not fulfilled all the requirements specified in subdivision 3, paragraph (b), is guilty of a gross misdemeanor.\nIn addition to the annual inspection, the Minnesota State Patrol has authority to conduct random, unannounced spot inspections of any school bus or Head Start bus being operated within the state to ascertain whether it is in compliance with provisions of law, including the Minnesota school bus equipment standards in sections 169.4501 to 169.4504, subject to the procedures approved by the commissioner.\nFor purposes of this section, a member of the State Patrol includes an employee of the Department of Public Safety described in section 299D.06.",
	"repealed": false
}