{
	"id": "157.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/157.175",
	"title": "157.175 DOGS; OUTDOOR FOOD AND BEVERAGE SERVICE ESTABLISHMENTS.",
	"text": "A statutory or home rule charter city may adopt an ordinance to permit food and beverage service establishments to allow dogs to accompany persons patronizing designated outdoor areas of food and beverage establishments.\nThe ordinance must prohibit dangerous and potentially dangerous dogs, as defined in section 347.50, from accompanying patrons to food and beverage establishments.\nThe ordinance may not prohibit a food and beverage establishment from banning dogs. A person accompanied by a dog who remains at an establishment knowing that the operator of the establishment or its agent has posted a sign banning dogs or otherwise informed the person that dogs are not permitted in the establishment may be ordered to leave the premises.\n(a) The ordinance must require participating establishments to apply for and receive a permit from the city before allowing patrons' dogs on their premises. The city shall require from the applicant such information as the local government deems reasonably necessary, but shall require, at a minimum, the following information:\n(1) the name, location, and mailing address of the establishment;\n(2) the name, mailing address, and telephone contact information of the permit applicant;\n(3) a description of the designated outdoor areas in which the permit applicant intends to allow dogs; and\n(4) a description of the days of the week and hours of operation that patrons' dogs will be permitted in the designated outdoor areas.\n(b) A permit issued pursuant to the authority granted in this section must not be transferred to a subsequent owner upon the sale of a food and beverage establishment but must expire automatically upon the sale of the establishment. The subsequent owner shall be required to reapply for a permit pursuant to this section if the subsequent owner wishes to continue to accommodate patrons' dogs.\n(c) A city may incorporate the permit requirements of this section into a permit or license issued under an existing ordinance if the city ensures that current and future permit and license holders comply with the requirements of this section. A city may exempt current permit and license holders from reapplying for a permit, if the current permit or license holder provides the city with the information required in paragraph (a) and any other information that the city requests.\nThe ordinance must include such regulations and limitations as the local government deems reasonably necessary to protect the health, safety, and general welfare of the public, but must require, at a minimum, the following requirements, which must be clearly printed on a sign or signs posted on premises in a manner and place that are conspicuous to employees and patrons:\n(1) employees must be prohibited from touching, petting, or otherwise handling dogs;\n(2) employees and patrons must not allow dogs to come into contact with serving dishes, utensils, tableware, linens, paper products, or any other items involved in food service operations;\n(3) patrons must keep their dogs on a leash at all times and must keep their dogs under reasonable control;\n(4) dogs must not be allowed on chairs, tables, or other furnishings; and\n(5) dog waste must be cleaned immediately and the area sanitized.\nNothing in this statute, or an ordinance adopted pursuant to this statute, shall be construed to limit:\n(1) the right of a person with disabilities to access places of public accommodation while accompanied by a service animal as provided in sections 256C.02 and 363A.19; or\n(2) the lawful use of a service animal by a licensed peace officer.\nThe ordinance must include a definition of \"designated outdoor area\" that is consistent with applicable rules adopted by the commissioner of health.",
	"repealed": false
}