{
	"id": "325F.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.245",
	"title": "325F.245 LANDSCAPE APPLICATION CONTRACTS.",
	"text": "For the purposes of this section, the following terms have the meanings given them:\n(a) \"Landscape application\" means pesticide applications, fertilizer applications, and other chemical applications of any kind for grass, turf, shrubs, or ornamental plants.\n(b) \"Commercial application company\" means a person or business that provides landscape application for hire.\n(a) A contract for landscape application must be in writing, and must be signed by both the commercial application company and the property owner or the owner's agent. The contract must, at a minimum, contain the following information:\n(1) the name, address, and phone number of the commercial application company;\n(2) the total number of the regularly scheduled landscape applications to be performed each year;\n(3) the cost of each regularly scheduled application and the yearly cost for all landscape applications; and\n(4) the ending date of the contract.\n(b) The commercial application company shall provide the property owner with a copy of the written contract.\n(a) Every contract must contain a stated ending date.\n(b) To extend service beyond the stated ending date, the commercial application company and property owner must enter into a separate written contract. The contract must conform in all respects to the requirements of this section.\nIf a contract is for more than one year, then the commercial application company shall each year provide written notice to the property owner that the contract remains in effect and that landscape applications will resume according to the terms of the contract. The written notice must be provided to the property owner at least 15 days prior to the first landscape application of the year.\n(a) A contract shall be canceled by the property owner upon the sale of the property that is the subject of the contract. To cancel the contract, the property owner shall notify the commercial application company that the property owner is canceling the contract.\n(b) The commercial application company shall provide written notice to the property owner, in the contract or in another manner, that the contract must be canceled upon the sale of the property.\n(c) A contract between a commercial application company and a property owner may not be enforced by the commercial application company against any subsequent owner of the property.\nThis section does not apply to:\n(1) pesticide, fertilizer, or chemical applications for the purpose of producing agricultural commodities or any commodity for sale;\n(2) pesticide applications around or near the foundation of a building for the purpose of structural or indoor pest control;\n(3) any single or isolated landscape application where the property owner or its agent verbally consents to the single or isolated application; or\n(4) pesticide or fertilizer applications by a licensed, commercial application company that provides customers with the ability to cancel or discontinue the agreement at any time, for any reason, with full refund of any prepaid services that were not provided and without any cancellation or discontinuance penalty. Prior to the first application of the season, the commercial application company must provide annual written notice to the customer of the customer's ability to cancel or discontinue the agreement at any time. The customer must be allowed to cancel or discontinue the agreement at any time by communication to the company in writing, electronically, verbally by telephone, or in person to company representatives or on-site service personnel.\nA person who violates this section is subject to the penalties and remedies, including a private right of action, as provided in section 8.31.",
	"repealed": false
}