{
	"id": "453.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/453.52",
	"title": "453.52 DEFINITIONS.",
	"text": "The terms defined in this section have the following meanings whenever used in sections 453.51 to 453.62 unless the context requires otherwise.\n\"Agency agreement\" means the written agreement between or among two or more cities or existing municipal power agencies establishing a municipal power agency.\n\"City\" means a city organized and existing under the laws of Minnesota or a city charter adopted pursuant thereto, and authorized by such laws or charter to engage in the local distribution and sale of electric energy; provided that any city so engaged on January 1, 1976, is authorized to continue such distribution and sale, and every city now or hereafter so authorized may exercise, either individually or as a member of a municipal power agency, all of the powers granted in sections 453.51 to 453.62. \"City\" also includes a city organized and existing under the laws of another state or a city charter adopted pursuant thereto which participates in a municipal power agency with Minnesota cities and pays a full pro rata share of the expenses of the agency.\n\"City\" also includes a park and recreation board in a city of the first class.\n\"City council\" means the city council or other similar board, commission, or body within a city which is charged by law or its charter with the general control of the city's governmental affairs.\n\"Distribution\" means the conveyance of electric energy to retail consumers from a transmission system, or from a generation facility situated within or in the immediate vicinity of a city.\n\"Generation\" means the production of electricity by any means and the acquisition of fuel of any kind for that purpose, and includes but is not limited to the acquisition of fuel deposits and the acquisition or construction and operation of facilities for extracting fuel from natural deposits, for converting it for use in another form, for burning it in place, and for transportation and storage.\n(a) \"Governing body,\" with respect to a city, means the city council or, if another board, commission, or body is empowered by law or its charter or by resolution of the city council to establish and regulate rates and charges for the distribution of electric energy within the city, such board, commission, or body shall be deemed to be the \"governing body\"; provided, however, that when the levy of a tax or the incurring of an obligation payable from taxes or any other action of such board, commission, or body requires the concurrence, approval, or independent action of the city council or another body under the city's charter or any other law, such action shall not be exercised under sections 453.51 to 453.62 until such concurrence or approval is received or such independent action is taken; and provided further, that the concurrence of the city council or other elected body charged with the general management of a city shall be required, prior to the adoption by the city of any resolution approving an agency agreement or any amendment thereto.\n(b) With respect to an existing municipal power agency, \"governing body\" means the agency's board of directors.\n\"Municipal power agency\" means a separate political subdivision and municipal corporation created by agreement between or among two or more cities or existing municipal power agencies pursuant to section 453.53 to exercise any of the powers of acquisition, construction, reconstruction, operation, repair, extension, or improvement of electric generation or transmission facilities or the acquisition of any interest therein or any right to part or all of the capacity thereof.\n\"Person\" means a natural person, a public agency, or a private corporation, firm, partnership, cooperative association, or business trust of any nature whatsoever, organized and existing under the laws of any state or of the United States or of any other country or political subdivision thereof and shall also include other countries and their political subdivisions, departments, agencies and instrumentalities.\n\"Project\" means any plant, works, system, facilities, and real and personal property of any nature whatsoever, together with all parts thereof and appurtenances thereto, used or useful in the generation, production, transmission, purchase, sale, exchange, or interchange of electric energy or any interest therein or capacity thereof.\n\"Public agency\" means any city or other municipal corporation, political subdivision, governmental unit, or public corporation created by or pursuant to the laws of this state or of another state or of the United States, and any state or the United States, and any person, board, or other body declared by the laws of any state or the United States to be a department, agency, or instrumentality thereof.\n\"Real property\" means lands, structures, franchises, and interests in land, including but not limited to lands under water, riparian rights, fees simple absolute, lesser interests such as easements, rights-of-way, uses, leases, licenses, and all other incorporeal hereditaments, legal and equitable estates, interests, and rights, terms of years, liens on real property by way of judgments, mortgages, or otherwise, and claims for damage to real property.\n\"Transmission\" means the transfer of electric energy from a generating facility to, between, or among one or more cities or municipal power agencies or other persons with whom they may contract, and includes but is not limited to conversion of current and voltage and transfer of energy from another source in exchange for energy supplied by such contracting parties, but does not include distribution.",
	"repealed": false
}