{
	"id": "275.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.72",
	"title": "275.72 LEVY LIMIT ADJUSTMENTS FOR CONSOLIDATION AND ANNEXATION.",
	"text": "If all of the area included in two or more local governmental units is consolidated, merged, or otherwise combined to constitute a single governmental unit, the levy limit base for the resulting governmental unit in the first levy year in which the consolidation is effective shall be equal to (1) the highest tax rate in any of the merging governmental units in the previous year multiplied by the net tax capacity of all the merging governmental units in the previous year, minus (2) the sum of all levies in the merging governmental units in the previous year that qualify as special levies under section 275.70, subdivision 5.\nIf a local governmental unit increases its tax base through annexation of an area which is not the area of an entire local governmental unit and the area of annexation contains a population of 50 or more, the levy limit base of the local governmental unit in the first year in which the annexation is effective shall be equal to its levy limit base for the current levy year multiplied by the ratio of the net tax capacity in the local governmental unit after the annexation compared to its net tax capacity before the annexation.\nIf a local governmental unit, as a result of an annexation agreement, has different tax rates in various parts of the jurisdiction due to different service levels, it may petition the commissioner of revenue to adjust its levy limits established under section 275.71. The commissioner shall adjust the levy limits to reflect scheduled changes in tax rates related to increasing service levels in areas currently receiving less city services. The local governmental unit shall provide the commissioner with any information the commissioner deems necessary in making the levy limit adjustment.\nIf a function or service of one local governmental unit is transferred to another local governmental unit, the levy limits established under section 275.71 must be adjusted by the commissioner of revenue in such manner so as to fairly and equitably reflect the reduced or increased property tax burden resulting from the transfer. The aggregate of the adjusted limitations must not exceed the aggregate of the limitations prior to adjustment.\nAnnexations, mergers, and shifts in services and functional responsibilities that are effective by June 30 of the levy year are included in the calculation of the levy limit for that levy year. Annexations, mergers, and shifts in services and functional responsibilities that are effective after June 30 of a levy year are not included in the calculation of the levy limit until the subsequent levy year.",
	"repealed": false
}