{
	"id": "340A.513",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.513",
	"title": "340A.513 SALE OF BEER KEGS.",
	"text": "For purposes of this section:\n(a) \"Beer keg\" means any brewery-sealed, single container that contains not less than seven gallons of malt liquor.\n(b) \"Off-sale retailer\" means a holder of a license under this chapter to sell alcoholic beverages at off-sale or a municipal liquor store.\nNo off-sale retailer shall sell beer kegs unless that retailer affixes an identification label or tag to each beer keg. An identification label or tag shall consist of paper, plastic, metal, or another durable material that is not easily damaged or destroyed. Identification labels used may contain a nonpermanent adhesive material in order to apply the label directly to an outside surface of a beer keg at the time of sale. Identification tags shall be attached to beer kegs at the time of sale with nylon ties or cording, wire ties or other metal attachment devices, or another durable means of tying or attachment of the tag to the beer keg. The identification information contained on the label or tag shall include the licensed off-sale retailer's name, address, and telephone number; a unique beer keg number assigned by the retailer; and a prominently visible warning that intentional removal or defacement of the label or tag is a criminal offense. Upon return of a beer keg to the off-sale retailer that sold the beer keg and attached the identification label or tag, the off-sale retailer shall be responsible for the complete and thorough removal of the entire identification label or tag, and any adhesive or attachment devices of the label or tag. The identification label or tag must be kept on file with the retailer for not less than 90 days from the date of return.\nAn off-sale retailer may not sell a beer keg unless the beer keg has attached an identification label or tag complying with the standards established under subdivision 2.\n(a) An off-sale retailer who sells a beer keg must at the time of the sale record:\n(1) the number of the purchaser's driver's license, Minnesota identification card, military identification card, or valid United States or foreign passport;\n(2) the date and time of the purchase;\n(3) the beer keg identification number required under subdivision 3; and\n(4) the purchaser's signature.\n(b) The record must be retained for not less than 90 days after the date of the sale.\nAn off-sale retailer required to retain records under subdivision 4 must make the records available during regular business hours for inspection by a peace officer, the commissioner, or an agent of the commissioner.\n(a) A person required to record information under subdivision 4 may not knowingly make a materially false entry in the book or register required under subdivision 4. In a prosecution under this subdivision, it is a defense for the defendant to prove by a preponderance of the evidence that the defendant reasonably and in good faith relied upon the identification provided by the purchaser of a beer keg.\n(b) No person other than an off-sale retailer, a licensed wholesaler of malt beverages, a peace officer, the commissioner, or an agent of the commissioner may intentionally remove identification placed on a beer keg in compliance with subdivision 3. No person may intentionally deface or damage the identification on a beer keg to make it unreadable.",
	"repealed": false
}