{
	"id": "469.3193",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.3193",
	"title": "469.3193 CERTIFICATION OF CONTINUING ELIGIBILITY FOR JOBZ BENEFITS.",
	"text": "(a) By October 15 of each year, every qualified business must certify to the commissioner of revenue, on a form prescribed by the commissioner of revenue, whether it is in compliance with any agreement required as a condition for eligibility for benefits listed under section 469.315. A business that fails to submit the certification, or any business, including those still operating in the zone, that submits a certification that the commissioner of revenue later determines materially misrepresents the business's compliance with the agreement, is subject to the repayment provisions under section 469.319 from January 1 of the year in which the report is due or the date that the business became subject to section 469.319, whichever is earlier. Any such business is permanently barred from obtaining benefits under section 469.315. For purposes of this section, the bar applies to an entity and also applies to any individuals or entities that have an ownership interest of at least 20 percent of the entity.\n(b) Before the sanctions under paragraph (a) apply to a business that fails to submit the certification, the commissioner of revenue shall send notice to the business, demanding that the certification be submitted within 30 days and advising the business of the consequences for failing to do so. The commissioner of revenue shall notify the commissioner of employment and economic development and the appropriate job opportunity subzone administrator whenever notice is sent to a business under this paragraph.\n(c) The certification required under this section is public.\n(d) The commissioner of revenue shall promptly notify the commissioner of employment and economic development of all businesses that certify that they are not in compliance with the terms of their business subsidy agreement and all businesses that fail to file the certification.",
	"repealed": false
}