{
	"id": "80G.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/80G.01",
	"title": "80G.01 DEFINITIONS.",
	"text": "For purposes of this chapter, the following terms have the meanings given to them in this section.\n\"Bullion product\" means any coin, round, bar, or ingot containing silver, gold, platinum, palladium, or other precious metal.\n(a) Subject to the exceptions in paragraph (b), a \"dealer\" means any person who buys, sells, solicits, or markets bullion products or investments in bullion products to consumers and conducts Minnesota transactions.\n(b) A dealer does not include any of the following persons:\n(1) a person who engages only in wholesale bullion product transactions with other persons who engage only in wholesale bullion product transactions or with dealers who buy or sell at retail and are properly registered under this chapter;\n(2) a person who engages only in transactions at occasional garage or yard sales held at the seller's residence, farm auctions held at the seller's residence, or estate sales held at the decedent's residence;\n(3) a person who is properly registered pursuant to chapter 80A, or the federal Securities Exchange Act of 1934 and rules promulgated thereunder as a securities broker dealer or broker dealer agent;\n(4) an auctioneer who auctions bullion products on behalf of an owner, if the auctioneer does not take title or ownership of the bullion products, or the operator of an Internet website that allows users to offer the sale of bullion products through that website, does not set the price, is not the seller of record, and does not take possession of any bullion products to be offered;\n(5) a person who engages only in transactions at no more than 12 trade shows per year where the consumer is present and the transaction is made at the trade show; or\n(6) a federally or state-chartered bank, bank and trust, savings bank, savings association, or credit union or any operating subsidiary of them.\n\"Dealer representative\" means any natural person acting as an employee, contractor, or agent of a dealer and who has interactions with consumers for the purpose of the buying, selling, solicitation, or marketing of bullion products or investments in bullion products. This term does not mean a natural person who has interactions with consumers solely for administrative purposes.\n\"Commissioner\" means the commissioner of commerce.\n\"Minnesota transaction\" means a bullion product transaction conducted:\n(1) by a dealer that is incorporated, registered, domiciled, or otherwise located in Minnesota;\n(2) by a dealer representative at a location in Minnesota;\n(3) between a dealer and a consumer who lives in Minnesota; or\n(4) between a dealer and a Minnesota consumer when the transaction involves:\n(i) delivering or shipping a bullion product to an address in Minnesota;\n(ii) delivering to or shipping from a precious metal depository on behalf of a Minnesota resident; or\n(iii) making payment to a consumer or receiving a payment from a consumer at an address in Minnesota, unless the transaction occurs when the consumer is at a business location outside of Minnesota.\n\"Owner\" means any person who has an ownership interest in a dealer, regardless of whether directly or indirectly, of more than ten percent and who is actively engaged in the direction, management, oversight, or operation of the dealer or its business affairs.\n\"Person\" has the same meaning given in section 325F.68, subdivision 3.\n\"Precious metal content\" means the quantity, measured in grams or troy ounces, of gold, silver, platinum, palladium, or other precious metal in a bullion product and the percentage that the precious metal constitutes of the total weight of the bullion product.",
	"repealed": false
}