{
	"id": "402.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/402.03",
	"title": "402.03 ADVISORY COMMITTEE.",
	"text": "Each human services board shall appoint an advisory committee, which shall actively participate in the formulation of the plan for the development, implementation, and operation of the programs and services by the board, and shall make a formal recommendation to the board at least annually concerning the annual budget of the board and the implementation of the plan during the ensuing year.\nMembership on the advisory committee shall consist of no more than 25 persons serving two-year terms not to exceed three consecutive terms. Up to one-half of the terms of the initial advisory committee may be for one year; upon their expiration all terms shall be for two years. The chair shall be appointed by the human services board and may not be a member of a county board.\nOne-third of the members of the advisory committee shall be representatives of those persons receiving services provided by the human services board. Up to one-third may be providers or employees of providers of services and must include representatives of private providers if such providers exist in the county or counties party to the agreement. At least one member shall be a member of the corrections advisory board established pursuant to section 401.08, if any. The remaining members shall represent the citizens of the counties.\nThe advisory committee shall appoint permanent task forces to assist in planning for corrections, social, mental health and public health services.\nTask force membership shall be constituted to fulfill state agency requirements for receiving categorical funds. Where appropriately constituted, these task forces may, at the option of the human services boards, replace those advisory bodies required by statute and rule to advise local social services agencies and other county and area boards. Individuals not members of the advisory committee may be appointed to the task forces; provided, however, that each task force shall be chaired by a member of the advisory committee.\nThe human services board shall provide staff assistance to the advisory committee.",
	"repealed": false
}