{
	"id": "221.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/221.124",
	"title": "221.124 INITIAL MOTOR CARRIER CONTACT PROGRAM.",
	"text": "The initial motor carrier contact program consists of an initial contact, for educational purposes, between a motor carrier required to participate and representatives of the Department of Transportation. The initial contact may be through an educational seminar or, at the discretion of the department, through a personal contact with a representative of the department. The initial contact must consist of a discussion of the statutes, rules, and regulations that apply to motor carriers. Topics discussed must include: insurance requirements; accident reporting; accident countermeasures; identification of vehicles; driver qualifications; maximum hours of service of drivers; the safe operation of vehicles; equipment, parts, and accessories; and inspection, repair, and maintenance. The department shall provide written documentation of proof of compliance with the requirements of subdivision 2 and shall give a copy of the document to the motor carrier.\nA motor carrier that first registers with or receives a permit from the commissioner after January 1, 2000, shall participate in the initial motor carrier contact program. A motor carrier required to participate in the program must have in attendance at least one motor carrier official having a substantial interest or control, directly or indirectly, in or over the operations conducted or to be conducted under the carrier's registration or permit.\nA motor carrier required by subdivision 2 to participate in the program must do so within 90 days of the service date of the order granting the permit or within 90 days of registering, unless the commissioner extends the time for compliance. Failure to comply with the requirement of subdivision 2 makes the order granting the permit or the carrier's registration void upon expiration of the time for compliance.",
	"repealed": false
}