{
	"id": "103B.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.211",
	"title": "103B.211 JOINT POWERS WATERSHED MANAGEMENT ORGANIZATION.",
	"text": "(a) Any agreement under section 471.59 to jointly or cooperatively manage or plan for the management of surface water in a watershed delineated pursuant to subdivision 2, as required by sections 103B.205 to 103B.255, may provide, in addition to other provisions authorized by section 471.59, for a joint board having:\n(1) the authority to prepare, adopt, and implement a plan for the watershed meeting the requirements of section 103B.231;\n(2) the authority to review and approve local water management plans as provided in section 103B.235;\n(3) the authority of a watershed district under chapter 103D to regulate the use and development of land in the watershed when one or more of the following conditions exists:\n(i) the local government unit exercising planning and zoning authority over the land under Minnesota Statutes 2020, sections 366.10 to 366.181, or sections 394.21 to 394.37, or 462.351 to 462.364, does not have a local water management plan approved and adopted in accordance with the requirements of section 103B.235 or has not adopted the implementation program described in the plan;\n(ii) an application to the local government unit for a permit for the use and development of land requires an amendment to or variance from the adopted local water management plan or implementation program of the local unit; or\n(iii) the local government unit has authorized the organization to require permits for the use and development of land;\n(4) the authority of a watershed district under section 103D.625, to accept the transfer of drainage systems in the watershed, to repair, improve, and maintain the transferred drainage systems, and to construct all new drainage systems and improvements of existing drainage systems in the watershed, provided that: (i) projects may be carried out under the powers granted in sections 103B.205 to 103B.255 or chapter 103D or 103E; and (ii) proceedings of the board with respect to the systems must be in conformance with the watershed plan adopted under section 103B.231;\n(5) the authority of a watershed district under section 103D.911 to adopt a budget and decide on the total amount necessary to be raised from ad valorem tax levies to meet the budget;\n(6) the authority of a watershed district under section 103D.915 to certify its budget with the auditor of each county having territory within the joint powers watershed management organization;\n(7) the authority of a watershed district under section 103D.901 to file approved assessment statements with each affected county; and\n(8) other powers necessary to exercise the authority under clauses (1) to (3), including the power to enter into contracts for the performance of functions with governmental units or persons.\n(b) The Board of Water and Soil Resources shall adopt rules prescribing minimum requirements for the content of watershed management organization joint powers agreements.\n(c) Decisions by a joint powers board may not require more than a majority vote, except a decision on a capital improvement project, which may require no more than a two-thirds vote.\nBefore commencing planning under section 103B.231, a watershed management organization established pursuant to section 471.59 and this section shall submit a map delineating the boundaries of the watershed to the Board of Water and Soil Resources for review and comment on the conformance of the boundaries with the requirements of sections 103B.205 to 103B.255. The board shall have 60 days to comment.\n(a) A watershed management organization established by agreement pursuant to subdivision 1 may exercise the authority provided in the agreement throughout the watershed delineated, including territory in statutory and home rule charter cities and towns that are not members of the organization, if the cities and towns that are not members consent to the exercise of authority within their jurisdictions and if the membership of the organization includes:\n(1) the county or counties having jurisdiction over all of the territory of the watershed that is within the cities and towns that are not members of the organization; and\n(2) either cities and towns having jurisdiction over at least 50 percent of the land area of the watershed and comprising at least three-quarters of all of the cities and towns having territory in the watershed, or cities and towns having jurisdiction over at least 75 percent of the land area of the watershed.\n(b) The county or counties identified in paragraph (a), clause (1), are responsible for watershed management activities and may exercise authority under sections 103B.205 to 103B.255 in and for consenting cities and towns that are not members of the organization.\n(a) This subdivision applies in Hennepin and Ramsey Counties to the following public waters:\n(1) a public water basin or wetland wholly within the county that is less than 500 acres; or\n(2) a protected watercourse that has a drainage area of less than 50 square miles.\n(b) An appropriation of water that is below the minimum established in section 103G.271, subdivision 4, for a nonessential use, as defined under section 103G.291, is prohibited unless a permit is obtained from the watershed district or watershed management organization having jurisdiction over the public water basin, wetland, or watercourse. The watershed district or watershed management organization may impose a fee to cover the cost of issuing the permit. This subdivision must be enforced by the home rule charter or statutory city where the appropriation occurs. Violation of this subdivision is a petty misdemeanor, except that a second violation within a year is a misdemeanor. Affected cities shall mail notice of this law to affected riparian and adjoining landowners.\n[Repealed, 1991 c 199 art 1 s 16]",
	"repealed": false
}