{
	"id": "340A.503",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.503",
	"title": "340A.503 PERSONS UNDER 21; ILLEGAL ACTS.",
	"text": "(a) It is unlawful for any:\n(1) retail intoxicating liquor or 3.2 percent malt liquor licensee, municipal liquor store, or bottle club permit holder under section 340A.414, to permit any person under the age of 21 years to drink alcoholic beverages on the licensed premises or within the municipal liquor store; or\n(2) person under the age of 21 years to consume any alcoholic beverages. If proven by a preponderance of the evidence, it is an affirmative defense to a violation of this clause that the defendant consumed the alcoholic beverage in the household of the defendant's parent or guardian and with the consent of the parent or guardian.\n(b) An offense under paragraph (a), clause (2), may be prosecuted either in the jurisdiction where consumption occurs or the jurisdiction where evidence of consumption is observed.\n(c) As used in this subdivision, \"consume\" includes the ingestion of an alcoholic beverage and the physical condition of having ingested an alcoholic beverage.\nIt is unlawful for any person:\n(1) to sell, barter, furnish, or give alcoholic beverages to a person under 21 years of age;\n(2) under the age of 21 years to purchase or attempt to purchase any alcoholic beverage unless under the supervision of a responsible person over the age of 21 for training, education, or research purposes. Prior notification of the licensing authority is required unless the supervised alcohol purchase attempt is for professional research conducted by postsecondary educational institutions or state, county, or local health departments; or\n(3) to induce a person under the age of 21 years to purchase or procure any alcoholic beverage, or to lend or knowingly permit the use of the person's driver's license, permit, Minnesota identification card, or other form of identification by a person under the age of 21 years for the purpose of purchasing or attempting to purchase an alcoholic beverage.\nIf proven by a preponderance of the evidence, it shall be an affirmative defense to a violation of clause (1) that the defendant is the parent or guardian of the person under 21 years of age and that the defendant gave or furnished the alcoholic beverage to that person solely for consumption in the defendant's household.\nIt is unlawful for a person under the age of 21 years to possess any alcoholic beverage with the intent to consume it at a place other than the household of the person's parent or guardian. Possession at a place other than the household of the parent or guardian creates a rebuttable presumption of intent to consume it at a place other than the household of the parent or guardian. This presumption may be rebutted by a preponderance of the evidence.\n(a) It is unlawful for a person under the age of 21 years to enter an establishment licensed for the sale of alcoholic beverages or any municipal liquor store for the purpose of purchasing or having served or delivered any alcoholic beverage.\n(b) Notwithstanding section 340A.509, no ordinance enacted by a statutory or home rule charter city may prohibit a person 18, 19, or 20 years old from entering an establishment licensed under this chapter to:\n(1) perform work for the establishment, including the serving of alcoholic beverages, unless otherwise prohibited by section 340A.412, subdivision 10;\n(2) consume meals; and\n(3) attend social functions that are held in a portion of the establishment where liquor is not sold.\nIt is unlawful for a person under the age of 21 years to claim to be 21 years old or older for the purpose of purchasing alcoholic beverages.\nWith respect to purchasing, possessing, consuming, selling, furnishing, and serving alcoholic beverages, a person is not 21 years of age until 8:00 a.m. on the day of that person's 21st birthday.\n(a) Proof of age for purchasing or consuming alcoholic beverages may be established only by one of the following:\n(1) a valid driver's license or identification card issued by Minnesota, another state, or a province of Canada, and including the photograph and date of birth of the licensed person;\n(2) a valid military identification card issued by the United States Department of Defense;\n(3) a valid passport issued by the United States;\n(4) a valid instructional permit issued under section 171.05 to a person of legal age to purchase alcohol which includes a photograph and the date of birth of the person issued the permit; or\n(5) in the case of a foreign national, by a valid passport.\n(b) In a prosecution under subdivision 2, clause (1), it is a defense for the defendant to prove by a preponderance of the evidence that the defendant reasonably and in good faith relied upon representations of proof of age authorized in paragraph (a) in selling, bartering, furnishing, or giving the alcoholic beverage.\n(c) A licensed retailer or municipal liquor store may seize a form of identification listed under paragraph (a) if the retailer or municipal liquor store has reasonable grounds to believe that the form of identification has been altered or falsified or is being used to violate any law. A retailer or municipal liquor store that seizes a form of identification as authorized under this paragraph must deliver it to a law enforcement agency, within 24 hours of seizing it.\nMS 1988 [Repealed, 1989 c 351 s 19]\n(a) A person is not subject to prosecution under subdivision 1, paragraph (a), clause (2), or subdivision 3, if the person contacts a 911 operator to report that the person or another person is in need of medical assistance for an immediate health or safety concern, provided that the person who initiates contact is the first person to make such a report, provides a name and contact information, remains on the scene until assistance arrives, and cooperates with the authorities at the scene.\n(b) The person who receives medical assistance shall also be immune from prosecution under paragraph (a).\n(c) Paragraph (a) also applies to one or two persons acting in concert with the person initiating contact provided that all the requirements of paragraph (a) are met.",
	"repealed": false
}