{
	"id": "363A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.33",
	"title": "363A.33 COURT ACTIONS, SUITS BY PRIVATE PARTIES, INTERVENTION, DISTRICT COURT JURISDICTION, ATTORNEY'S FEES, AND COSTS.",
	"text": "The commissioner or a person may bring a civil action seeking redress for an unfair discriminatory practice directly to district court. In addition, a person may bring a civil action:\n(1) within 90 days after receipt of notice that the commissioner has dismissed a charge because it is frivolous or without merit, because the charging party has failed to provide required information, because the commissioner has determined that further use of department resources is not warranted, or because the commissioner has determined that there is no probable cause to credit the allegations contained in a charge filed with the commissioner;\n(2) within 90 days after receipt of notice that the commissioner has reaffirmed a determination of no probable cause if the charging party requested a reconsideration of the no probable cause determination, or has decided not to reopen a dismissed case that the charging party has asked to be reopened; or\n(3) after 45 days from the filing of a charge pursuant to section 363A.28, subdivision 1, if a hearing has not been held pursuant to section 363A.29 or if the commissioner has not entered into a conciliation agreement to which the charging party is a signator. The charging party shall notify the commissioner of an intention to bring a civil action, which shall be commenced within 90 days of giving the notice.\nFor purposes of clauses (1) and (2), receipt of notice is presumed to be five days from the date of service by mail of the written notice.\nIf the commissioner has issued both probable cause and no probable cause determinations on separate issues in the same charge, the charging party may, if a hearing is held, require that all matters be heard at the hearing or may bring a civil action for the no probable cause charges at the same time as the probable cause charges under the rules and time frames that govern the probable cause charges.\nA charging party bringing a civil action shall mail by registered or certified mail, or electronically with the receiving party's consent, a copy of the summons and complaint to the commissioner, and upon their receipt the commissioner shall terminate all proceedings in the department relating to the charge. No charge shall be filed or reinstituted with the commissioner after a civil action relating to the same unfair discriminatory practice has been brought unless the civil action has been dismissed without prejudice.\nUpon application by the complaining party to the district court at a special term and under circumstances the court deems just, the court may appoint an attorney for the person and may authorize the commencement of the action without payment of fees, costs, or security.\nUpon timely application, the court may permit the department to intervene in a civil action brought pursuant to this section upon certification that the case is of general public importance.\nAny action brought pursuant to this section shall be filed in the district court of the county wherein the unlawful discriminatory practice is alleged to have been committed or where the respondent resides or has a principal place of business.\nA person bringing a civil action seeking redress for an unfair discriminatory practice or a respondent is entitled to a jury trial.\nIf the court or jury finds that the respondent has engaged in an unfair discriminatory practice, it shall issue an order or verdict directing appropriate relief as provided by this section.\nWhen the court issues an order providing for payment to the state of a civil penalty pursuant to this section, it shall serve a copy of that order upon the attorney general at the same time as it makes service upon the parties.\nIn any action or proceeding brought pursuant to this section the court, in its discretion, may allow the prevailing party a reasonable attorney's fee as part of the costs. In any case brought by the department, the court shall order a respondent who is determined to have engaged in an unfair discriminatory practice to reimburse the department and the attorney general for all appropriate litigation and court costs expended in preparing for and conducting the hearing, unless payment of the costs would impose a financial hardship on the respondent. Appropriate costs include but are not limited to the costs of services rendered by the attorney general, private attorneys if engaged by the department, court costs, court reporters, and expert witnesses as well as the costs of transcripts and other necessary supplies and materials.\n(a) The court shall order any respondent found to be in violation of any provision of sections 363A.08 to 363A.19 and 363A.28, subdivision 10, to pay a civil penalty to the state. This penalty is in addition to all damages recoverable at law and punitive damages to be paid to an aggrieved party. The court shall determine the amount of the civil penalty to be paid, taking into account the seriousness and extent of the violation, the public harm occasioned by the violation, whether the violation was intentional, and the financial resources of the respondent. Any penalties imposed under this provision shall be paid into the general fund of the state. In all cases where the court finds that the respondent has engaged in an unfair discriminatory practice, the court shall order the respondent to pay an aggrieved party who has suffered discrimination compensatory damages, including mental anguish or suffering, in an amount up to three times the actual damages sustained. In all cases, the court may also order the respondent to pay an aggrieved party punitive damages pursuant to section 549.20. In any case under this chapter that is decided by a jury, the jury shall determine the amount of all damages to be awarded.\n(b) In any case where a political subdivision is a respondent, the total of punitive damages awarded an aggrieved party may not exceed $25,000 and if there are two or more respondents the punitive damages may be apportioned among them. Punitive damages may only be assessed against a political subdivision in its capacity as a corporate entity and no regular or ex officio member of a governing body of a political subdivision shall be personally liable for payment of punitive damages pursuant to this section.\nIn addition to the remedies in subdivision 8, where a case involves discrimination in:\n(1) employment, the court may order: (i) the hiring, reinstatement, or upgrading of an aggrieved party who has suffered discrimination, with or without back pay; (ii) admission or restoration to membership in a labor organization; (iii) admission to or participation in an apprenticeship training program, on-the-job training program, or other retraining program; or (iv) any other relief the court deems just and equitable; or\n(2) housing, the court may order: (i) the sale, lease, or rental of the housing accommodation or other real property to an aggrieved party who has suffered discrimination; (ii) the sale, lease, or rental of a like accommodation or other real property owned by or under the control of the person against whom the complaint was filed, according to the terms as listed with a real estate broker, or if no such listing has been made, as advertised or offered by the vendor or lessor; or (iii) any other relief the court deems just and equitable.",
	"repealed": false
}