{
	"id": "43A.346",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.346",
	"title": "43A.346 POSTRETIREMENT OPTION.",
	"text": "For purposes of this section, \"terminated state employee\" means a person who occupied a civil service position in the executive or legislative branch of state government, the Minnesota State Retirement System, the Public Employees Retirement Association, the Office of the Legislative Auditor, or a person who was employed by the Metropolitan Council.\n(a) This section applies to a terminated state employee who:\n(1) for at least the five years immediately preceding separation under clause (2), was regularly scheduled to work 1,044 or more hours per year in a position covered by a pension plan administered by the Minnesota State Retirement System or the Public Employees Retirement Association;\n(2) terminated state or Metropolitan Council employment;\n(3) at the time of termination under clause (2), met the age and service requirements necessary to receive an unreduced retirement annuity from the plan and satisfied requirements for the commencement of the retirement annuity or, for a terminated employee under the unclassified employees retirement plan, met the age and service requirements necessary to receive an unreduced retirement annuity from the plan and satisfied requirements for the commencement of the retirement annuity or elected a lump-sum payment; and\n(4) agrees to accept a postretirement option position with the same or a different appointing authority, working a reduced schedule that is both (i) a reduction of at least 25 percent from the employee's number of previously regularly scheduled work hours; and (ii) 1,044 hours or less in state or Metropolitan Council service.\n(b) For purposes of this section, an unreduced retirement annuity includes a retirement annuity computed under a provision of law which permits retirement, without application of an earlier retirement reduction factor, whenever age plus years of allowable service total at least 90.\n(c) For purposes of this section, as it applies to state employees who are members of the Public Employees Retirement Association who are at least age 62, the length of separation requirement and termination of service requirement prohibiting return to work agreements under section 353.01, subdivisions 11a and 28, are not applicable.\nNotwithstanding any law to the contrary, state postretirement option positions shall be in the unclassified service but shall not be covered by the Minnesota State Retirement System unclassified employees plan.\nNotwithstanding any law to the contrary, the provisions of section 352.115, subdivision 10, or 353.37 governing annuities of reemployed annuitants, shall not apply for the duration of a terminated state employee's employment in a postretirement option position.\nThe appointing authority has sole discretion to determine if and the extent to which a postretirement option position under this section is available to a terminated state employee. Any offer of such a position must be made in writing to the person by the appointing authority on a form prescribed by the Department of Management and Budget and the Minnesota State Retirement System or the Public Employees Retirement Association. If the person is under age 62, an offer of a postretirement option position and any related verbal offer or agreement must not be made until at least 30 days after the person terminated employment. The appointing authority may not require a person to waive any rights under a collective bargaining agreement or unrepresented employee compensation plan as a condition of participation.\nPostretirement option employment is for an initial period not to exceed one year. During that period, the appointing authority may not modify the conditions specified in the written offer without the person's consent, except as required by law or by the collective bargaining agreement or compensation plan applicable to the person. At the end of the initial period, the appointing authority has sole discretion to determine if the offer of a postretirement option position will be renewed, renewed with modifications, or terminated. Postretirement option employment may be renewed for periods of up to one year, not to exceed a total duration of five years. No person may be employed in one or a combination of postretirement option positions under this section for a total of more than five years.\nThe appointing authority shall provide the Minnesota State Retirement System or the Public Employees Retirement Association with a copy of the offer, the terminated state employee's acceptance of the terms, and any subsequent renewal agreement.\nNotwithstanding any law to the contrary, a person may not earn service credit in the Minnesota State Retirement System or the Public Employees Retirement Association for employment covered under this section, and employer contributions and payroll deductions for the retirement fund must not be made based on earnings of a person working under this section. No change shall be made to a monthly annuity or retirement allowance based on employment under this section.\nNotwithstanding any law to the contrary, the appointing authority must make an employer insurance contribution for a person who is employed in a postretirement option position under this section and who is not receiving any other state-paid or Metropolitan Council-paid employer insurance contribution. The amount of the contribution must be equal to the percent time worked in the postretirement option position (hours scheduled to be worked annually divided by 2,088) times 1.5 times the full employer contribution for employee-only health and dental coverage. The appointing authority must contribute that amount to a health reimbursement arrangement.\nIf a person has been in a postretirement option position and accepts any other position in state or Metropolitan Council-paid service, in the subsequent state or Metropolitan Council-paid employment the person may not earn service credit in the Minnesota State Retirement System or Public Employees Retirement Association, no employer contributions or payroll deductions for the retirement fund shall be made, and the provisions of section 352.115, subdivision 10, or section 353.37, shall apply.",
	"repealed": false
}