{
	"id": "256P.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256P.02",
	"title": "256P.02 PERSONAL PROPERTY LIMITATIONS.",
	"text": "(a) The agency must apply paragraphs (b) to (e) to determine the value of personal property. The agency must use the equity value of legally available personal property to determine whether an applicant or participant is eligible for assistance.\n(b) When personal property is jointly owned by two or more persons, the agency shall assume that each person owns an equal share, except that either person owns the entire sum of a joint personal checking or savings account. When an applicant or participant documents greater or lesser ownership, the agency must use that greater or lesser share to determine the equity value held by the applicant or participant. Other types of ownership must be evaluated according to law.\n(c) Personal property owned by the applicant or participant must be presumed legally available to the applicant or participant unless the applicant or participant documents that the property is not legally available to the applicant or participant. When personal property is not legally available, its equity value must not be applied against the limits of subdivision 2.\n(d) An applicant must disclose whether the applicant has transferred personal property valued in excess of the property limits in subdivision 2 for which reasonable compensation was not received within one year prior to application. A participant must disclose all transfers of property valued in excess of these limits, according to the reporting requirements in section 142G.20, subdivision 5. When a transfer of personal property without reasonable compensation has occurred:\n(1) the person who transferred the property must provide the property's description, information needed to determine the property's equity value, the names of the persons who received the property, and the circumstances of and reasons for the transfer; and\n(2) when the transferred property can be reasonably reacquired, or when reasonable compensation can be secured, the property is presumed legally available to the applicant or participant.\n(e) A participant may build the equity value of personal property to the limits in subdivision 2.\nParticipants who qualify for child care assistance programs under chapter 142E are exempt from this section, except that the personal property identified in subdivision 2 is counted toward the asset limit of the child care assistance program under chapter 142E. Census income is not counted toward the asset limit of the child care assistance program under chapter 142E.\nThe equity value of an assistance unit's personal property listed in clauses (1) to (5) must not exceed $10,000 for applicants and participants. For purposes of this subdivision, personal property is limited to:\n(1) cash not excluded under subdivisions 4 and 6;\n(2) bank accounts not excluded under subdivision 5;\n(3) liquid stocks and bonds that can be readily accessed without a financial penalty;\n(4) vehicles not excluded under subdivision 3; and\n(5) the full value of business accounts used to pay expenses not related to the business.\nOne vehicle per assistance unit member age 16 or older shall be excluded when determining the equity value of personal property. If the assistance unit owns more than one vehicle per assistance unit member age 16 or older, the agency shall determine the trade-in values of all additional vehicles and apply the values to the personal property limitations in subdivision 2. To establish the trade-in values of vehicles, an agency must use the National Automobile Dealers Association online car values and car prices guide. When a vehicle is not listed in the online guide, or when the applicant or participant disputes the trade-in value listed in the online guide as unreasonable given the condition of the particular vehicle, the agency may require the applicant or participant to document the trade-in value by securing a written statement from a motor vehicle dealer licensed under section 168.27, stating the amount that the dealer would pay to purchase the vehicle. The agency shall reimburse the applicant or participant for the cost of a written statement that documents a lower loan value.\nIncome received from lived-experience engagement, as defined in section 256P.01, subdivision 5a, shall be excluded when determining the equity value of personal property.\nFamily asset accounts under section 142F.20 and individual development accounts authorized under the Assets for Independence Act, Title IV of the Community Opportunities, Accountability, and Training and Educational Services Human Services Reauthorization Act of 1998, Public Law 105-285, shall be excluded when determining the equity value of personal property.\nCensus income is excluded when determining the equity value of personal property.",
	"repealed": false
}