{
	"id": "379.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/379.01",
	"title": "379.01 ORGANIZATION.",
	"text": "When a majority of the registered voters of any congressional township containing not less than 25 legal voters petition the county board to be organized as a town such board shall forthwith call an election on the question. If a majority of the vote in the township is in favor of organization, the county board shall proceed to fix and determine the boundaries of such new town and name the same and make and file with the auditor a full report of its proceedings in relation to the establishment thereof. Towns thus formed shall be named in accordance with the expressed wish of a majority of its voters. If they fail to request a name, the board shall select one.\nWhen a majority of the resident freeholders of any one, two, three, four, or five congressional townships containing in the aggregate not less than 25 freeholders who are legal voters petition the county board to be organized as a town such board shall forthwith call an election on the question. If a majority of the vote in the townships is in favor of organization, the county board shall proceed to fix and determine the boundaries of such new town and name the same and make and file with the county auditor a full report of its proceedings in relation to the establishment thereof. For the purposes of this section, the word \"freeholders\" shall be construed to include any person who is a legal voter in any such town occupying real estate therein under the homestead or preemption laws of the United States or under contract of purchase from any person or corporation or from the state of Minnesota.\nIf the result of an election held under this section is in the affirmative, the county shall arrange for the holding of the first organizational meeting not more than 30 days after the election in the township to be organized.\nThe county auditor shall have the ballots printed for an election under this section and shall otherwise make preparation for the election including having a notice published in the official newspaper of the county once a week for two successive weeks stating the date of the election and the question to be voted on. The last publication shall be no later than ten days before the election. The cost of the election shall be borne by the county.",
	"repealed": false
}