{
	"id": "62A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.17",
	"title": "62A.17 TERMINATION OF OR LAYOFF FROM EMPLOYMENT; CONTINUATION AND CONVERSION RIGHTS.",
	"text": "Every group insurance policy, group subscriber contract, and health care plan included within the provisions of section 62A.16, except policies, contracts, or health care plans covering employees of an agency of the federal government, shall contain a provision which permits every covered employee who is voluntarily or involuntarily terminated or laid off from employment, if the policy, contract, or health care plan remains in force for active employees of the employer, to elect to continue the coverage for the employee and dependents.\nAn employee shall be considered to be laid off from employment if there is a reduction in hours to the point where the employee is no longer eligible under the policy, contract, or health care plan. Termination shall not include discharge for gross misconduct.\nUpon request by the terminated or laid off employee, a health carrier must provide the instructions necessary to enable the employee to elect continuation of coverage.\nEvery covered employee electing to continue coverage shall pay the former employer, on a monthly basis, the cost of the continued coverage. The policy, contract, or plan must require the group policyholder or contract holder to, upon request, provide the employee with written verification from the insurer of the cost of this coverage promptly at the time of eligibility for this coverage and at any time during the continuation period. If the policy, contract, or health care plan is administered by a trust, every covered employee electing to continue coverage shall pay the trust the cost of continued coverage according to the eligibility rules established by the trust. In no event shall the amount of premium charged exceed 102 percent of the cost to the plan for such period of coverage for similarly situated employees with respect to whom neither termination nor layoff has occurred, without regard to whether such cost is paid by the employer or employee. The employee shall be eligible to continue the coverage until the employee becomes covered under another group health plan, or for a period of 18 months after the termination of or lay off from employment, whichever is shorter. For an individual age 19 or older, if the employee becomes covered under another group policy, contract, or health plan and the new group policy, contract, or health plan contains any preexisting condition limitations, the employee may, subject to the 18-month maximum continuation limit, continue coverage with the former employer until the preexisting condition limitations have been satisfied. The new policy, contract, or health plan is primary except as to the preexisting condition. In the case of a newborn child who is a dependent of the employee, the new policy, contract, or health plan is primary upon the date of birth of the child, regardless of which policy, contract, or health plan coverage is deemed primary for the mother of the child.\n[Repealed by amendment, 1987 c 337 s 50]\nAfter timely receipt of the monthly payment from a covered employee, if the employer, or the trustee, if the policy, contract, or health care plan is administered by a trust, fails to make the payment to the insurer, nonprofit health service plan corporation, or health maintenance organization, with the result that the employee's coverage is terminated, the employer or trust shall become liable for the employee's coverage to the same extent as the insurer, nonprofit health service plan corporation, or health maintenance organization would be if the coverage were still in effect.\nIn the case of a policy, contract or plan administered by a trust, the employer must notify the trustee within 30 days of the termination or layoff of a covered employee of the name and last known address of the employee.\nIf the employer or trust fails to notify a covered employee, the employer or trust shall continue to remain liable for the employee's coverage to the same extent as the insurer would be if the coverage were still in effect.\nUpon the termination of or lay off from employment of an eligible employee, the employer shall inform the employee within 14 days after termination or lay off of:\n(1) the right to elect to continue the coverage;\n(2) the amount the employee must pay monthly to the employer to retain the coverage;\n(3) the manner in which and the office of the employer to which the payment to the employer must be made; and\n(4) the time by which the payments to the employer must be made to retain coverage.\nIf the policy, contract, or health care plan is administered by a trust, the employer is relieved of the obligation imposed by clauses (1) to (4). The trust shall inform the employee of the information required by clauses (1) to (4).\nThe employee shall have 60 days within which to elect coverage. The 60-day period shall begin to run on the date plan coverage would otherwise terminate or on the date upon which notice of the right to coverage is received, whichever is later.\nNotice must be in writing and sent by first class mail to the employee's last known address which the employee has provided the employer or trust.\nA notice in substantially the following form shall be sufficient: \"As a terminated or laid off employee, the law authorizes you to maintain your group medical insurance for a period of up to 18 months. To do so you must notify your former employer within 60 days of your receipt of this notice that you intend to retain this coverage and must make a monthly payment of $.......... to ........... at .......... by the ............... of each month.\"\nMS 2008 [Expired, 2009 c 33 s 1]\n(a) An employer that maintains a group health plan that is not described in Internal Revenue Code, section 6432(b)(1) or (2), as added by section 3001(a)(12)(A) of the American Recovery and Reinvestment Act of 2009 (ARRA), must notify the health carrier of the termination of, or the layoff from, employment of a covered employee, and the name and last known address of the employee, within the later of ten days after the termination or layoff event, or June 8, 2009.\n(b) The health carrier for a group health plan that is not described in Internal Revenue Code, section 6432(b)(1) or (2), as added by section 3001(a)(12)(A) of the ARRA, must provide the notice of extended election rights which is required by subdivision 5a, paragraph (a), as well as any other notice that is required by the ARRA regarding the availability of premium reduction rights, to the individual within 30 days after the employer notifies the health carrier as required by paragraph (a).\n(c) The notice responsibilities set forth in this subdivision end when the premium reduction provisions under ARRA expire.\n(a) An individual policy or contract issued as a conversion policy prior to January 1, 2014, shall be renewable at the option of the individual as long as the individual is not covered under another qualified plan as defined in section 62E.02, subdivision 4. Any revisions in the table of rate for the individual policy shall apply to the covered person's original age at entry and shall apply equally to all similar conversion policies issued by the insurer.\n(b) Notwithstanding paragraph (a), an issuer with five or fewer covered individuals that are not part of the single risk pool, as defined in section 62A.65, subdivision 3b, may nonrenew those conversion policies in accordance with this paragraph. An issuer nonrenewing coverage under this paragraph must notify the commissioner 180 days before the effective date of the nonrenewal, and must provide the commissioner with a complete list of affected policyholders and a copy of the proposed policyholder notice described in this paragraph. The issuer must provide written notice to each policyholder covered under the conversion policy at least 120 days before the effective date of the nonrenewal. This notice must include information on how to obtain individual or family health coverage and contact information for the state agencies regulating health insurance.",
	"repealed": false
}