{
	"id": "15A.0825",
	"url": "https://www.revisor.mn.gov/statutes/cite/15A.0825",
	"title": "15A.0825 LEGISLATIVE SALARY COUNCIL.",
	"text": "(a) The Legislative Salary Council consists of the following members:\n(1) one person, who is not a judge, from each congressional district, appointed by the chief justice of the supreme court; and\n(2) one person from each congressional district, appointed by the governor.\n(b) If Minnesota has an odd number of congressional districts, the governor and the chief justice must each appoint an at-large member, in addition to a member from each congressional district.\n(c) One-half of the members appointed by the governor and one-half of the members appointed by the chief justice must belong to the political party that has the most members in the legislature. One-half of the members appointed by the governor and one-half of the members appointed by the chief justice must belong to the political party that has the second most members in the legislature.\n(d) None of the members of the council may be:\n(1) a current or former legislator, or the spouse of a current legislator;\n(2) a current or former lobbyist registered under Minnesota law;\n(3) a current employee of the legislature;\n(4) a current or former judge;\n(5) a current or former governor, lieutenant governor, attorney general, secretary of state, or state auditor; or\n(6) a current employee of an entity in the executive or judicial branch.\nAppointing authorities must make their appointments after the first Monday in January and before January 15 in each odd-numbered year. Appointing authorities who determine that a vacancy exists under subdivision 3, paragraph (b), must make an appointment to fill that vacancy by January 15 in each odd-numbered year. The governor shall designate one member to convene and chair the first meeting of the council, that must occur by February 15 of each odd-numbered year. At its first meeting, the council must elect a chair from among its members.\n(a) Except for the first term following redistricting, a term is four years or until new appointments are made after congressional redistricting as provided in subdivision 4. Members may serve no more than two full terms or portions of two consecutive terms.\n(b) If a member ceases to reside in the congressional district that the member resided in at the time of appointment as a result of moving or redistricting, the appointing authority who appointed the member must appoint a replacement who resides in the congressional district to serve the unexpired term.\nAppointing authorities shall make appointments after a congressional redistricting plan is adopted. Appointing authorities shall make appointments in accordance with the timing requirements in subdivision 2. Members that reside in an even-numbered district shall be appointed to a term of two years following redistricting. Members that reside in an odd-numbered district shall be appointed to a term of four years following redistricting.\nMembers may be removed only for cause, after notice and a hearing, for missing three consecutive meetings, or as a result of redistricting. The chair of the council or a designee shall inform the appointing authority of a member missing three consecutive meetings. After the second consecutively missed meeting and before the next meeting, the chair or a designee shall notify the member in writing that the member may be removed for missing the next meeting. In the case of a vacancy on the council, the appointing authority shall appoint a person to fill the vacancy for the remainder of the unexpired term.\nMembers shall be compensated under section 15.059, subdivision 3.\nBy March 31 of each odd-numbered year, the council must prescribe salaries for legislators to take effect July 1 of that year. In setting salaries, the council must take into account any other legislative compensation provided to the legislators by the state and the most recent budget forecast. The council must submit a report by March 31 of each odd-numbered year with the prescribed salaries to the governor, the majority and minority leaders of the senate and the house of representatives, the chairs of the committees in the senate and the house of representatives with jurisdiction over the legislature's budget, and the chairs of the committees in the senate and house of representatives with jurisdiction over finance. The report must describe the council's rationale for selecting the prescribed salaries.\nThe council shall elect a chair from among its members.\nThe Legislative Coordinating Commission shall provide administrative and support services for the council. The provision of administrative and support services under this subdivision shall not be considered ex parte communication under subdivision 10.\nMembers may not have any communication with a member of the legislature during the period after the first meeting is convened under subdivision 2 and the date the legislator salaries are submitted under subdivision 7.",
	"repealed": false
}