{
	"id": "256.9686",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.9686",
	"title": "256.9686 DEFINITIONS.",
	"text": "For purposes of this section and sections 256.969 and 256.9695, the following terms and phrases have the meanings given.\n\"Base year\" means a hospital's fiscal year or years that is recognized by the Medicare program or a hospital's fiscal year specified by the commissioner if a hospital is not required to file information by the Medicare program from which cost and statistical data are used to establish medical assistance payment rates.\n\"Case mix index\" means a hospital's distribution of relative values among the diagnostic categories.\n\"Charges\" means the usual and customary payment requested of the general public.\n\"Commissioner\" means the commissioner of human services.\n\"Hospital\" means a facility defined in section 144.696, subdivision 3, and licensed under sections 144.50 to 144.58, an out-of-state facility licensed to provide acute care under the requirements of that state in which it is located, or an Indian health service facility designated to provide acute care by the federal government.\n\"Medical assistance\" means the program established under chapter 256B and Title XIX of the Social Security Act.\n\"Medical review agent\" means the representative of the commissioner who is authorized by the commissioner to administer medical record reviews; conduct administrative reconsiderations as defined by section 256.9685, subdivision 1a; and perform other functions as stipulated in the terms of the agent's contract with the department. Medical records reviews and administrative reconsiderations will be performed by medical professionals within their scope of expertise, including but not limited to physicians, physician assistants, advanced practice registered nurses, and registered nurses. The medical professional performing the review or reconsideration must be on staff with the medical review agent, in good standing, and licensed to practice in the state where the medical professional resides.\n\"Rate year\" means a calendar year from January 1 to December 31. Effective with the 2012 base year, rate year means a state fiscal year from July 1 to June 30.\n\"Relative value\" means the average allowable cost of inpatient services provided within a diagnostic category divided by the average allowable cost of inpatient services provided in all diagnostic categories.",
	"repealed": false
}