{
	"id": "115B.412",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.412",
	"title": "115B.412 PROGRAM OPERATION.",
	"text": "Any person who the commissioner has reason to believe has or may obtain information related to the generation, composition, transportation, treatment, or disposal of waste in a qualified facility or who has or may obtain information related to the ownership or operation of a facility shall furnish to the commissioner or the commissioner's designee any information that person may have or may reasonably obtain that is relevant to a release or threatened release at a qualified facility.\n(a) The commissioner or a person designated by the commissioner, on presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda, or data of any person who has a duty to provide information to the agency under subdivision 1; and\n(2) enter upon any property, public or private, for the purpose of taking any action authorized by sections 115B.39 to 115B.43 including obtaining information from any person who has a duty to provide the information under subdivision 1, conducting surveys or investigations, and taking response action.\n(b) This subdivision and subdivision 1 are enforceable under sections 115.071 and 116.072. If the commissioner prevails in an enforcement action under this subdivision, the commissioner may recover all costs, including court costs, attorney fees, and administrative costs, related to the enforcement action.\nThe commissioner may acquire and dispose of real property the commissioner deems reasonably necessary for environmental response actions at or related to a qualified facility under section 115B.17, subdivisions 15 and 16.\n(a) The commissioner shall provide to affected local government units, to be available as public information, and shall make available to others, on request, a description of the real property described in the original and any revised permits for a qualified facility, along with a description of activities that will be or have been taken on the property under sections 115B.39 to 115B.43 and a reasonably accurate description of the types, locations, and potential movement of hazardous substances, pollutants and contaminants, or decomposition gases related to the facility. The commissioner shall provide and make this information available at the time the facility is placed on the priority list under section 115B.40, subdivision 2; shall revise, provide, and make the information available when response actions, other than long-term maintenance actions, have been completed; and shall revise the information over time if significant changes occur that make the information obsolete or misleading.\n(b) A local government unit that receives information from the commissioner under paragraph (a) shall incorporate that information in any land use plan that includes the affected property and shall notify any person who applies for a permit related to development of the affected property of the existence of the information and, on request, provide a copy of the information.\nAn environmental lien for environmental response costs incurred, including reimbursements made under section 115B.43, by the commissioner under sections 115B.39 to 115B.445 attaches in the same manner as a lien under sections 514.671 to 514.676 to all the real property described in the original and any revised permits for a qualified facility and any adjacent property owned by the facility owner or operator from the date the first assessment, closure, postclosure care, or response activities related to the facility are undertaken by the commissioner. For the purposes of filing an environmental lien under this subdivision, the term \"cleanup action\" as used in sections 514.671 to 514.676 includes all of the costs incurred by the commissioner to assess, close, maintain, monitor, and respond to releases at qualified facilities under sections 115B.39 to 115B.445. Notwithstanding section 514.672, subdivision 4, a lien under this paragraph takes precedence over all other liens on the property regardless of when the other liens were or are perfected. For the purpose of this subdivision, \"owner or operator\" has the meaning given it in section 115B.41, subdivision 4.\nThe commissioner shall, to the extent practicable, ensure that contracts for activities or consulting services under this section are entered into with contractors or consultants located within the region where the facility subject to the contracts is located. The commissioner shall tailor specifications in requests for proposals to the types of activities or services that need to be undertaken at a specific facility or group of facilities located in the same region and shall not include specifications that require specialized expertise or laboratory work not available within the region unless it is necessary to do so to meet the requirements of this section.\nThe commissioner shall maintain separate accounting for each qualified facility regarding:\n(1) the amount of financial assurance funds transferred under section 115B.40, subdivisions 4 and 5; and\n(2) costs of response actions taken at the facility.\nThe owner of a qualified facility may, as part of the owner's activities under section 115B.40, subdivision 4 or 5, offer to transfer title to all or any portion of the property described in the facility's most recent permit, including any property adjacent to that property the owner wishes to transfer, to the commissioner. The commissioner may accept the transfer of title if the commissioner determines that to do so is in the best interest of the state. If, after transfer of title to the property, the commissioner determines that no further response actions are required on the portion of the property being disposed of under sections 115B.39 to 115B.445 and it is in the best interest of the state to dispose of property acquired under this subdivision, the commissioner may do so under section 115B.17, subdivision 16. The property disposed of under this subdivision is no longer part of the qualified facility.\nThe commissioner may modify the boundaries of a qualified facility to exclude certain property if the commissioner determines that no further response actions are required to be conducted under sections 115B.39 to 115B.445 on the excluded property and the excluded property is not affected by disposal activities on the remaining portions of the qualified facility. Any property excluded under this subdivision is no longer part of the qualified facility.\nIf all solid waste from a qualified facility has been relocated outside the qualified facility's boundaries and the commissioner has determined that no further response actions are required on the property under sections 115B.39 to 115B.445, the commissioner may delist the facility by removing it from the priority list established under section 115B.40, subdivision 2, after which the property shall no longer be a qualified facility. The commissioner has no further responsibilities under sections 115B.39 to 115B.445 for a facility delisted under this subdivision.\n(a) The commissioner shall develop a land use plan for each qualified facility. All local land use plans must be consistent with a land use plan developed under this subdivision. Plans developed under this subdivision must include provisions to prevent any use that disturbs the integrity of the final cover, liners, any other components of any containment system, or the function of any monitoring systems unless the commissioner finds that the disturbance:\n(1) is necessary to the proposed use of the property, and will not increase the potential hazard to human health or the environment; or\n(2) is necessary to reduce a threat to human health or the environment.\n(b) Before completing any plan under this subdivision, the commissioner shall consult with the commissioner of management and budget regarding any restrictions that the commissioner of management and budget deems necessary on the disposition of property resulting from the use of bond proceeds to pay for response actions on the property, and shall incorporate the restrictions in the plan.\n[Repealed, 2014 c 248 s 19]\nThe commissioner may adopt rules necessary to implement sections 115B.39 to 115B.43.",
	"repealed": false
}