{
	"id": "52.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.20",
	"title": "52.20 VOLUNTARY DISSOLUTION.",
	"text": "A credit union may be voluntarily liquidated after two-thirds of the members present and entitled to vote shall have voted such liquidation at a special meeting called by a majority of the board of directors for that purpose, upon 14 days mailed written notice to each member at the member's last known address clearly stating the purpose of the special meeting, or at any regular meeting after like notice of the purpose has been given. By a majority vote of the members present and entitled to vote at the meeting, a committee of three members shall be elected to liquidate the credit union.\nVacancies in this committee shall be filled by the remaining members of the committee, acting jointly with the board of directors serving at the time of the vote for liquidation, or by and with the approval of any ten or more shareholders. In case the remaining members of the committee or a majority of said board of directors shall notify the commissioner of commerce that a vacancy can not be filled in the manner therein provided, the commissioner shall have authority to fill the vacancy from the membership of the credit union as it existed at the time of the vote for liquidation.\nImmediately after this meeting and before the committee shall proceed with the liquidation, the officers of the credit union shall file with the commissioner of commerce a certified copy of the minutes of this meeting, a written statement outlining the plan of liquidation, and a verified statement, in writing, signed by a majority of the officers, consenting to this liquidation containing the names and addresses of all officers and directors of the credit union. After the commissioner of commerce shall, by proper examination, determine that the credit union is solvent, the commissioner shall, within 60 days, issue a certificate of approval of the liquidation, which certificate shall be recorded with the county recorder in the county where the credit union is located. A \"solvent\" credit union is one which is able to pay all of its debts and deposits. From and after this special meeting the credit union shall cease to do business except for purposes of liquidation. Before commencing the liquidation the committee shall execute and file with the commissioner of commerce a bond running to the state of Minnesota for the benefit of the members and creditors of the credit union in such amount and with such sureties and in such form as shall be approved by the commissioner of commerce, conditioned for the faithful performance of all duties of its trust. A bond may be waived in case of a bulk sale of assets to one or more purchasers upon terms approved by the commissioner of commerce. Such purchasers may include other credit unions or an association of credit unions.\nUpon recording this certificate with the county recorder, the credit union shall be deemed dissolved and its corporate existence terminated except for the purpose of discharging its debts, collecting and distributing its assets, and doing all other acts required in order to liquidate. The credit union shall have a corporate existence and may sue and be sued.\nIf the credit union shall not be completely liquidated and its assets discharged within three years after the special meeting of the members, the commissioner of commerce may take possession of the books, records and assets and proceed to complete liquidation. If the commissioner determines after one year from the commencement of liquidation proceedings that the liquidation is not proceeding in a reasonable and expeditious manner under all of the circumstances, the commissioner may take possession of the books, records, and assets and appoint a liquidating agent who shall give a bond running to the state of Minnesota.\nFunds representing unclaimed dividends in liquidation in the hands of the liquidating committee or the commissioner of commerce for six months after date of final dividend, shall be deposited with the commissioner of management and budget, who shall, within one year thereafter, pay over the money so held to the persons respectively entitled thereto upon being furnished satisfactory evidence of their right to the same, and at the end of that year the commissioner of management and budget shall credit all residue of the deposit to the general fund.\nThere is hereby appropriated to the persons entitled to such amounts, from the funds or accounts in the state treasury to which the money was credited, an amount sufficient to make the payment.\nUpon completion of the liquidation by the liquidating committee, it shall file with the commissioner of commerce a verified statement in writing signed by the members of the committee stating that all debts of the credit union, and all deposits, and all shares, or portions of shares which can be paid from the liquidation proceeds, have been paid, except any unclaimed dividends, and if any such, the amount thereof, the names of the persons entitled thereto, with their last known addresses, and all books and papers of the credit union shall thereupon be deposited with the commissioner of commerce.",
	"repealed": false
}