{
	"id": "151.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.415",
	"title": "151.415 LONG-TERM CARE RESIDENT ACCESS TO PHARMACEUTICALS ACT.",
	"text": "This section may be cited as the \"Long-Term Care Resident Access to Pharmaceuticals Act.\"\nFor the purposes of this section, the following terms have the meanings given them unless otherwise provided by text:\n(a) \"Board\" means the Board of Pharmacy.\n(b) \"Contract pharmacy\" means a pharmacy, licensed under this chapter, which is under contract to a long-term care facility.\n(c) \"Long-term care facility\" means a nursing home licensed under sections 144A.02 to 144A.10, or a boarding care home licensed under sections 144.50 to 144.56. Facilities not certified under title XIX of the federal Social Security Act are not included in this definition.\n(d) \"Original dispensing pharmacy\" shall mean a pharmacy, licensed in any state in the United States, which dispenses drugs in bulk prescription containers to a person who is a resident in a long-term care facility.\n(a) A contract pharmacist or pharmacy may repackage a resident's prescription drugs, which have been lawfully dispensed from bulk prescription containers by an original dispensing pharmacy, into a unit-dose system compatible with the system used by the long-term care facility.\n(b) A long-term care facility may administer drugs to residents of the facility that have been repackaged according to this subdivision. The contract pharmacy shall notify the long-term care facility whenever medications have been dispensed according to this subdivision and must certify that the repackaging and dispensing has been done in accordance with this subdivision.\n(c) Drugs may be dispensed for a resident of a long-term care facility according to this subdivision, provided that:\n(1) the drug is dispensed by the original dispensing pharmacy according to a current, valid prescription;\n(2) the original bulk prescription container for the resident is delivered by the original dispensing pharmacy directly to the contract pharmacist or pharmacy;\n(3) the contract pharmacist or pharmacy verifies the name and strength of the drug, the name of the manufacturer of the drug, the manufacturer's lot or control number, the manufacturer's expiration date for the drug, and the date the drug was dispensed by the original dispensing pharmacy;\n(4) the contract pharmacist or pharmacy verifies the validity and accuracy of the current prescription order;\n(5) the contract pharmacist or pharmacy repackages the drug in board-approved unit-dose packaging, with labeling that complies with Minnesota Rules, part 6800.6300, and that identifies that the drug has been repackaged according to this section;\n(6) the resident for whom the medication is repackaged obtains medications from or receives medications at a discounted rate from the original dispensing pharmacy under the resident's state or federal health assistance program or a private health insurance plan; and\n(7) the resident for whom the medication is to be repackaged, or the resident's authorized representative, has signed an informed consent form provided by the facility which includes an explanation of the repackaging process and which notifies the resident of the immunities from liability provided in this section.\nFor each drug repackaged by a contract pharmacy under this section, the contract pharmacy shall maintain a record for at least two years of the following information:\n(1) the name, manufacturer, manufacturer's lot number, manufacturer's expiration date, and quantity of the drug prescribed;\n(2) the name and address of the resident for whom the drug was repackaged;\n(3) the name and address or other identifier of the prescriber;\n(4) the date the prescription was issued and the date the drug was repackaged;\n(5) the date the repackaged drug was delivered to the long-term care facility;\n(6) the directions for use;\n(7) a copy of the label that was affixed to the repackaged drug;\n(8) the initials of the packager;\n(9) the initials of the supervising pharmacist; and\n(10) the name and business address of the original dispensing pharmacy.\nUpon request of the resident, the resident's authorized representative, or a contract pharmacy or licensed health care facility acting on behalf of the resident, the original dispensing pharmacy is required to deliver medications dispensed for the resident directly to the contract pharmacist or pharmacy. The original dispensing pharmacy is further required to provide the contract pharmacist or pharmacy with the name and strength of the drug, the name of the manufacturer of the drug, the manufacturer's lot or control number, the manufacturer's expiration date for the drug, and the date the drug was dispensed.\nUnused drugs repackaged according to this section that are returned to any pharmacy shall not be redispensed.\n(a) A contract pharmacist or pharmacy and its employees or agents repackaging a drug acquired from an original dispensing pharmacy shall be immune from civil liability arising from harm caused by the drug due to acts or omissions of other persons outside of the contract pharmacist or pharmacy if the contract pharmacist or pharmacy properly repackages the drug according to this section.\n(b) A long-term care facility and the facility's employees or agents who properly administer a drug repackaged by a contract pharmacist or pharmacy under this section shall be immune from civil liability arising from harm caused by the drug due to acts or omissions of other persons outside the long-term care facility.\nA contract pharmacist or pharmacy may charge a monthly fee of no more than 250 percent of the medical assistance program dispensing fee for each drug repackaged according to this section, but no more than $100 per month for each individual resident.",
	"repealed": false
}