{
	"id": "216C.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.45",
	"title": "216C.45 RESIDENTIAL ELECTRIC PANEL UPGRADE GRANT PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Area median income\" means the median income of the geographic area in which a single-family or multifamily building whose owner is applying for a grant under this section is located, as reported by the United States Department of Housing and Urban Development.\n(c) \"Automatic overcurrent protection device\" means a device that protects against excess current by interrupting the flow of current.\n(d) \"Bus\" means a metallic strip or bar that carries current.\n(e) \"Electric panel\" means an enclosed box or cabinet containing a building's electric panels, including subpanels, that consists of buses, automatic overcurrent protection devices, and equipment, with or without switches to control light, heat, and power circuits. Electric panel includes a smart panel.\n(f) \"Electrical work\" has the meaning given in section 326B.31, subdivision 17.\n(g) \"Eligible applicant\" means:\n(1) an owner of a single-family building whose occupants have an annual household income no greater than 150 percent of the area median income; or\n(2) an owner of a multifamily building in which at least 50 percent of the units are occupied by households whose annual income is no greater than 150 percent of the area median income.\n(h) \"Multifamily building\" means a building containing two or more units.\n(i) \"Smart panel\" means an electrical panel that may be electronically programmed to manage electricity use in a building automatically.\n(j) \"Unit\" means a residential living space in a multifamily building occupied by an individual or a household.\n(k) \"Upgrade\" means:\n(1) for a single-family residence:\n(i) the installation of equipment, devices, and wiring necessary to increase an electrical panel's capacity to a total rating:\n(A) of not less than 200 amperes; or\n(B) that allows all the building's energy needs to be provided solely by electricity, as calculated using the National Electrical Code adopted in Minnesota; or\n(ii) the installation of a smart panel with or without additional equipment, devices, or wiring; and\n(2) for a multifamily building, the installation of equipment, devices, and wiring necessary to increase the capacity of an electric panel, including feeder panels, to a total rating that allows all the building's energy needs to be provided solely by electricity, as calculated using the National Electrical Code adopted in Minnesota.\nA residential electric panel upgrade grant program is established in the department to provide financial assistance to owners of single-family residences and multifamily buildings to upgrade residential electric panels.\n(a) The residential electric panel upgrade grant account is established as a separate account in the special revenue fund in the state treasury. The commissioner shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund, but remains in the account until expended. The commissioner shall manage the account.\n(b) Money in the account is appropriated to the commissioner to award electric panel upgrade grants and to reimburse the reasonable costs of the department to administer this section.\nAn applicant seeking a grant under this section must submit an application to the commissioner on a form developed by the commissioner. The commissioner must develop administrative procedures to govern the application and grant award process. The commissioner may contract with a third party to conduct some or all of the program's operations.\nA grant may be awarded under this section to:\n(1) an eligible applicant; or\n(2) with the written permission of an eligible applicant submitted to the commissioner, a contractor performing an upgrade or a third party on behalf of the eligible applicant.\n(a) Subject to the limits of paragraphs (b) to (e), a grant awarded under this section may be used to pay 100 percent of the equipment and installation costs of an upgrade.\n(b) The commissioner may not award a grant to an eligible applicant under this section which, in combination with a federal grant awarded to the eligible applicant under the federal Inflation Reduction Act of 2022, Public Law 117-189, for the same electric panel upgrade, exceeds 100 percent of the equipment and installation costs of the upgrade.\n(c) The maximum grant amount under this section that may be awarded to an eligible applicant who owns a single-family residence is:\n(1) $3,000 for an owner whose annual household income is less than 80 percent of area median income; and\n(2) $2,000 for an owner whose annual household income exceeds 80 percent but is not greater than 150 percent of area median income.\n(d) The maximum grant amount that may be awarded under this section to an eligible applicant who owns a multifamily building is the sum of $5,000, plus $500 multiplied by the number of units containing a separate electric panel receiving an upgrade in the multifamily building, not to exceed $50,000 per multifamily building.\n(e) The commissioner may approve a grant amount that exceeds the maximum grant amount in paragraph (c) or (d), up to 100 percent of the equipment and installation costs of the upgrade, if the commissioner determines that a larger grant amount is necessary in order to complete the upgrade.\nNo more than one grant may be awarded to an owner under this section for work conducted at the same single-family residence or multifamily building.\nThe department must publicize the availability of grants under this section to, at a minimum:\n(1) income-eligible households;\n(2) community action agencies and other public and private nonprofit organizations that provide weatherization and other energy services to income-eligible households; and\n(3) multifamily property owners and property managers.\nContractors and subcontractors performing electrical work under a grant awarded under this section:\n(1) must comply with the provisions of sections 326B.31 to 326B.399;\n(2) must certify that the electrical work is performed by a licensed journeyworker electrician or a registered unlicensed individual under the direct supervision of a licensed journeyworker electrician or master electrician employed by the same licensed electrical contractor; and\n(3) must pay workers the prevailing wage rate, as defined in section 177.42, and are subject to the requirements and enforcement provisions in sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\nBeginning January 1, 2025, and each January 1 through 2033, the department must submit a report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over climate and energy policy describing the activities and expenditures under the program established in this section. The report must include, at a minimum:\n(1) the number of units in multifamily buildings and the number of single-family residences whose owners received grants;\n(2) the geographic distribution of grant recipients; and\n(3) the average amount of grants awarded per building in multifamily buildings and in single-family residences.",
	"repealed": false
}