{
	"id": "325K.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/325K.18",
	"title": "325K.18 COLLECTION BASED ON SUITABLE GUARANTY.",
	"text": "(a) If the suitable guaranty is a surety bond, a person may recover from the surety the full amount of a qualified right to payment against the principal named in the bond.\n(b) If the suitable guaranty is a letter of credit, a person may recover from the issuing financial institution the full amount of a qualified right to payment only in accordance with the terms of the letter of credit.\n(c) If the suitable guaranty is a policy of insurance, a person may recover under the terms of the policy.\n(d) Claimants may recover successively on the same suitable guaranty.\n(a) Subject to paragraph (b), in addition to recovering the amount of a qualified right to payment, a claimant may recover from the proceeds of the guaranty, until depleted:\n(1) the attorneys' fees, reasonable in amount; and\n(2) court costs incurred by the claimant in collecting the claim.\n(b) However, the total liability on the suitable guaranty to all persons making qualified rights of payment or recovering attorneys' fees during its term must not exceed the amount of the suitable guaranty.\n(a) To recover a qualified right to payment against a surety or issuer of a suitable guaranty, the claimant must:\n(1) file written notice of the claim with the issuer of the suitable guarantee stating the name and address of the claimant, the amount claimed, and the grounds for the qualified right to payment; and\n(2) append to the notice a certified copy of the judgment on which the qualified right to payment is based.\n(b) Recovery of a qualified right to payment from the proceeds of the suitable guaranty is barred unless the claimant substantially complies with this subdivision.\nRecovery of a qualified right to payment from the proceeds of a suitable guaranty are forever barred unless notice of the claim is filed as required in subdivision 3, paragraph (a), clause (1), within three years after the occurrence of the violation of this chapter that is the basis for the claim. Notice under this subdivision need not include the requirement imposed by subdivision 3, paragraph (a), clause (2).",
	"repealed": false
}