{
	"id": "54.294",
	"url": "https://www.revisor.mn.gov/statutes/cite/54.294",
	"title": "54.294 ANNUAL EXAMINATION; INFORMATIONAL REPORTS; COST OF EXAMINATION.",
	"text": "Notwithstanding the examination frequency prescribed by section 46.04, the examination of the face amount certificate companies described in Minnesota Statutes 1974, section 54.26, shall be carried out on an annual basis by the commissioner. In conducting such examination, the commissioner may utilize reports which have been audited and attested to by independent certified public accountants. The procedures employed by the independent certified public accountants shall conform to generally accepted auditing standards. Each face amount certificate investment company shall file with the commissioner copies of its prospectuses, semiannual and annual reports to shareholders, S-1 registration statements and amendments thereto, and annual reports to the United States Securities and Exchange Commission, all as filed pursuant to the requirements of the Securities Act of 1933, as amended and the rules and regulations adopted pursuant thereto, the Securities Exchange Act of 1934, as amended and the rules and regulations adopted pursuant thereto, and the Investment Company Act of 1940, as amended and the rules and regulations adopted pursuant thereto. The commissioner may accept as filed copies of the foregoing material previously filed with the commissioner of commerce. Other face amount certificate investment companies described in Minnesota Statutes 1974, section 54.26, shall file with the commissioner copies of their semiannual and annual reports, which annual reports have been audited and attested to by independent certified public accountants as to assets maintained on deposit and the value thereof, and semiannual and annual reports, which annual reports have been certified by independent certified public accountants, as to certificate liabilities.\nFace amount certificate investment companies subject to the supervision of the commissioner of commerce shall pay to the commissioner of commerce the actual necessary expenses incurred by the commissioner of commerce in the performance of duties and the exercise of powers of examination, including all salaries, wages, and expenses of examiners employed by the commissioner to make examinations provided for by law. In addition, such companies shall be assessed and shall pay examination fees in accordance with the provisions of section 46.131.",
	"repealed": false
}