{
	"id": "629.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.341",
	"title": "629.341 ALLOWING PROBABLE CAUSE ARRESTS FOR DOMESTIC VIOLENCE; IMMUNITY FROM LIABILITY.",
	"text": "Notwithstanding section 629.34 or any other law or rule, a peace officer may arrest a person anywhere without a warrant, including at the person's residence, if the peace officer has probable cause to believe that within the preceding 72 hours, exclusive of the day probable cause was established, the person has committed nonfelony domestic abuse, as defined in section 518B.01, subdivision 2. The arrest may be made even though the assault did not take place in the presence of the peace officer.\nA peace officer acting in good faith and exercising due care in making an arrest pursuant to subdivision 1 is immune from civil liability that might result from the officer's action.\nThe peace officer shall tell the victim whether a shelter or other services are available in the community and give the victim immediate notice of the legal rights and remedies available. The notice must include furnishing the victim a copy of the following statement:\n\"IF YOU ARE THE VICTIM OF DOMESTIC VIOLENCE, you can ask the city or county attorney to file a criminal complaint. You also have the right to go to court and file a petition requesting an order for protection from domestic abuse. The order could include the following:\n(1) an order restraining the abuser from further acts of abuse;\n(2) an order directing the abuser to leave your household;\n(3) an order preventing the abuser from entering your residence, school, business, or place of employment;\n(4) an order awarding you or the other parent custody of or parenting time with your minor child or children; or\n(5) an order directing the abuser to pay support to you and the minor children if the abuser has a legal obligation to do so.\"\nThe notice must include the resource listing, including telephone number, for the area program that provides services to victims of domestic abuse as shelter, designated by the Office of Justice Programs in the Department of Public Safety.\nWhenever a peace officer investigates an allegation that an incident described in subdivision 1 has occurred, whether or not an arrest is made, the officer shall make a written police report of the alleged incident. The report must contain at least the following information: the name, address and telephone number of the victim, if provided by the victim, a statement as to whether an arrest occurred, the name of the arrested person, and a brief summary of the incident. Data that identify a victim who has made a request under section 13.82, subdivision 17, paragraph (d), and that are private data under that subdivision, shall be private in the report required by this section. A copy of this report must be provided upon request, at no cost, to the victim of domestic abuse, the victim's attorney, or organizations designated by the Office of Justice Programs in the Department of Public Safety that are providing services to victims of domestic abuse. The officer shall submit the report to the officer's supervisor or other person to whom the employer's rules or policies require reports of similar allegations of criminal activity to be made.\nThe Board of Peace Officer Standards and Training shall provide a copy of this section to every law enforcement agency in this state on or before June 30, 1983.\nUpon request of the Board of Peace Officer Standards and Training to the Bureau of Criminal Apprehension, at least one training course must include instruction about domestic abuse. A basic skills course required for initial licensure as a peace officer must, after January 1, 1985, include at least three hours of training in handling domestic violence cases.",
	"repealed": false
}