{
	"id": "116.931",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.931",
	"title": "116.931 WHEEL WEIGHTS AND BALANCING PRODUCTS; LEAD AND MERCURY PROHIBITION.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Motor vehicle\" means a self-propelled vehicle or a vehicle propelled or drawn by a self-propelled vehicle that is operated on a highway, on a railroad track, on the ground, in the water, or in the air.\n(c) \"New motor vehicle\" means a motor vehicle that has not been previously sold to a person except a distributor, wholesaler, or motor vehicle dealer for resale.\nWhen replacing or balancing a tire on a motor vehicle or aircraft, a person may not use a wheel weight or other product for balancing motor vehicle or aircraft wheels if the weight or other balancing product contains lead or mercury that was intentionally added during the manufacture of the product.\nA person may not sell or offer to sell or distribute weights or other products for balancing motor vehicle or aircraft wheels if the weight or other balancing product contains lead or mercury that was intentionally added during the manufacture of the product.\nA person may not sell a new motor vehicle or aircraft that is equipped with a weight or other product for balancing wheels if the weight or other balancing product contains lead or mercury that was intentionally added during the manufacture of the product.\nA person may not shred or crush, or market for shredding or crushing, any motor vehicle, aircraft, watercraft, or railroad or industrial equipment, or any portion thereof, without:\n(1) inspecting the vehicle or equipment; and\n(2) removing all weights or other products for balancing wheels or other equipment if the weights or balancing products contain lead or mercury that was intentionally added during the manufacture of the weights or balancing products.\nMercury in wheel weights and other balancing products for motor vehicle and aircraft wheels must be recycled or otherwise managed to comply with sections 115A.932 and 116.92 and to ensure that it does not become part of the solid waste stream and is not released to the environment. Lead in wheel weights and other balancing products for motor vehicle and aircraft wheels must be recycled to ensure that it does not become part of the solid waste stream and is not released to the environment.\nPrior to January 1, 2016, the agency shall produce and distribute educational materials on the prohibitions required under this section to businesses subject to the prohibitions and shall conduct additional outreach and education activities to those businesses.",
	"repealed": false
}