{
	"id": "142D.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.091",
	"title": "142D.091 SCHOOL BOARD RESPONSIBILITIES.",
	"text": "Every school board must provide for a mandatory program of early childhood developmental screening for children at least once before school entrance, targeting children who are between three and four years old. This screening program must be established either by one board, by two or more boards acting in cooperation, by service cooperatives, by early childhood family education programs, or by other existing programs. This screening examination is a mandatory requirement for a student to continue attending kindergarten or first grade in a public school. A child need not submit to developmental screening provided by a board if the child's health records indicate to the board that the child has received comparable developmental screening from a public or private health care organization or individual health care provider. A student identification number, as defined by the commissioner of education, shall be assigned at the time of early childhood developmental screening or at the time of the provision of health records indicating a comparable screening. Each school district must provide the essential data in accordance with section 125B.07, subdivision 6, to the Department of Education. Districts are encouraged to reduce the costs of preschool developmental screening programs by utilizing volunteers and public or private health care organizations or individual health care providers in implementing the program.\nA child must not be enrolled in kindergarten in a public school unless the parent or guardian of the child submits to the school principal or other person having general control and supervision of the school a record indicating the months and year the child received developmental screening and the results of the screening not later than 30 days after the first day of attendance. If a child is transferred from one kindergarten to another, the parent or guardian of the child must be allowed 30 days to submit the child's record, during which time the child may attend school.\n(a) A screening program must include at least the following components: developmental assessments, including virtual developmental screening for families who make the request based on their immunocompromised health status or other health conditions, hearing and vision screening or referral, immunization review and referral, the child's height and weight, the date of the child's most recent comprehensive vision examination, if any, identification of risk factors that may influence learning, an interview with the parent about the child, and referral for assessment, diagnosis, and treatment when potential needs are identified. The district and the person performing or supervising the screening must provide a parent or guardian with clear written notice that the parent or guardian may decline to answer questions or provide information about family circumstances that might affect development and identification of risk factors that may influence learning. The notice must state \"Early childhood developmental screening helps a school district identify children who may benefit from district and community resources available to help in their development. Early childhood developmental screening includes a vision screening that helps detect potential eye problems but is not a substitute for a comprehensive eye exam.\" The notice must clearly state that declining to answer questions or provide information does not prevent the child from being enrolled in kindergarten or first grade if all other screening components are met. If a parent or guardian is not able to read and comprehend the written notice, the district and the person performing or supervising the screening must convey the information in another manner. The notice must also inform the parent or guardian that a child need not submit to the district screening program if the child's health records indicate to the school that the child has received comparable developmental screening performed within the preceding 365 days by a public or private health care organization or individual health care provider. The notice must be given to a parent or guardian at the time the district initially provides information to the parent or guardian about screening and must be given again at the screening location.\n(b) All screening components shall be consistent with the standards of the state commissioner of health for early developmental screening programs. A developmental screening program must not provide laboratory tests or a physical examination to any child. The district must request from the public or private health care organization or the individual health care provider the results of any laboratory test or physical examination within the 12 months preceding a child's scheduled screening. For the purposes of this section, \"comprehensive vision examination\" means a vision examination performed by an optometrist or ophthalmologist.\n(c) If a child is without health coverage, the school district must refer the child to an appropriate health care provider.\n(d) A board may offer additional components such as nutritional, physical and dental assessments, review of family circumstances that might affect development, blood pressure, laboratory tests, and health history.\n(e) If a statement signed by the child's parent or guardian is submitted to the administrator or other person having general control and supervision of the school that the child has not been screened because of conscientiously held beliefs of the parent or guardian, the screening is not required.\nIf any child's screening indicates a condition which requires diagnosis or treatment, the child's parents shall be notified of the condition and the board shall ensure that an appropriate follow-up and referral process is available.\n(a) The board must inform each resident family with a child eligible to participate in the developmental screening program, and a charter school that provides screening must inform families that apply for admission to the charter school, about the availability of the program and the state's requirement that a child receive a developmental screening or provide health records indicating that the child received a comparable developmental screening from a public or private health care organization or individual health care provider not later than 30 days after the first day of attending kindergarten in a public school. A school district must inform all resident families with eligible children under age seven, and a charter school that provides screening must inform families that apply for admission to the charter school, that their children may receive a developmental screening conducted either by the school district or by a public or private health care organization or individual health care provider and that the screening is not required if a statement signed by the child's parent or guardian is submitted to the administrator or other person having general control and supervision of the school that the child has not been screened.\n(b) A school district that enrolls students from an adjoining state under section 124D.041 may inform a nonresident child whose family resides at a Minnesota address as assigned by the United States Postal Service about the availability of the developmental screening program and may provide screening under this section to that child.\nA board may contract with or purchase service from an approved early developmental screening program in the area. Developmental screening must be conducted by either an individual who is licensed as, or has training that is similar to a special education teacher, school psychologist, kindergarten teacher, prekindergarten teacher, school nurse, public health nurse, registered nurse, or physician. The individual may be a volunteer.\nThe district must provide the parent or guardian of the child screened with a record indicating the month and year the child received developmental screening and the results of the screening. The district must keep a duplicate copy of the record of each child screened.\nEvery board must integrate and utilize volunteer screening programs in implementing sections 142D.091 to 142D.093 wherever possible.\nIn selecting personnel to implement the screening program, the district must give priority first to qualified volunteers.",
	"repealed": false
}