{
	"id": "13.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.073",
	"title": "13.073 PUBLIC INFORMATION POLICY TRAINING PROGRAM.",
	"text": "The commissioner may establish a program for training state and local government officials and employees on public information policy, including government data practices laws and official records and records management statutes. The program may provide for the development of broad-based expertise within state and local government entities. The program components may include basic training, specific training for specialized service sectors, and policy analysis and support.\nThe commissioner may publicize the development and implementation of the training program under this section and seek input from state and local government entities. The commissioner may prepare a training guide that includes an overview of the training program and its components.\nThe basic training component should be designed to meet the basic information policy needs of all government employees and public officials with a focus on key data practices laws and procedures that apply to all government entities. The commissioner should design the basic training component in a manner that minimizes duplication of the effort and cost for government entities to provide basic training. The commissioner may develop general programs and materials for basic training such as video presentations, data practices booklets, and training guides. The commissioner may assist state and local government entities in developing training expertise within their own entities and offer assistance for periodic training sessions for this purpose.\n(a) The sector-specific training component should be designed to provide for the development of specific expertise needed to deal with information policy issues within a particular service area. Service areas may include government entities such as state agencies, counties, cities, or school districts, or functional areas such as education, human services, child protection, or law enforcement. This component should focus on training individuals who implement or administer data practices and other information policy laws within their government entity.\n(b) The commissioner may provide technical assistance and support and help coordinate efforts to develop sector-specific training within different sectors. Elements of sector-specific training should include:\n(1) designation, training, and coordination of data practices specialists with responsibility for clarification and resolution of sector-specific information policy issues;\n(2) development of telephone hot lines within different sectors for handling information policy inquiries;\n(3) development of forums under which individuals with ongoing information policy administrative responsibilities may meet to discuss issues arising within their sectors;\n(4) availability of expertise for coaching and consultation on specific issues; and\n(5) preparation of publications, including reference guides to materials and resource persons.\nThe policy analysis and support component should be designed to address information policy issues at the policy level and to provide ongoing consultation and support regarding major areas of concern with a goal of developing a coherent and coordinated approach to information policy within the state. The commissioner may assist in the development and implementation of information policy and provide a clearinghouse for ideas, information, and resources. The commissioner may review public information policy and identify how that policy can be updated, simplified, and made consistent.\nThe commissioner shall, in consultation with affected government entities, prepare model policies and procedures to assist government entities in complying with the requirements of this chapter that relate to public access to government data and rights of subjects of data. Upon completion of a model for a governmental level, the commissioner shall offer that model for formal adoption by that level of government. Government entities may adopt or reject the model offered by the commissioner. A government entity that adopts the commissioner's model shall notify the commissioner in a form prescribed by the commissioner.",
	"repealed": false
}