{
	"id": "161.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.321",
	"title": "161.321 SMALL BUSINESS CONTRACTS.",
	"text": "For purposes of this section the following terms have the meanings given them, except where the context clearly indicates a different meaning is intended.\n(a) \"Award\" means the granting of a contract in accordance with all applicable laws and rules governing competitive bidding except as otherwise provided in this section.\n(b) \"Contract\" means an agreement entered into between a business entity and the state of Minnesota for the construction of transportation improvements.\n(c) \"Subcontractor\" means a business entity which enters into a legally binding agreement with another business entity which is a party to a contract as defined in paragraph (b).\n(d) \"Targeted group business\" means a business designated under section 16C.16, subdivision 5.\n(e) \"Veteran-owned small business\" means a business designated under section 16C.16, subdivision 6a.\n(a) The commissioner may award up to a 12 percent preference in the amount bid for specified construction work to small targeted group businesses.\n(b) The commissioner may designate a contract for construction work for award only to small targeted group businesses if the commissioner determines that at least three small targeted group businesses are likely to bid.\n(c) The commissioner may award up to a four percent preference in the amount bid for specified construction work to small businesses located in an economically disadvantaged area as defined in section 16C.16, subdivision 7.\n(a) The commissioner may set goals for targeted group business participation in contracts. As a condition of award, the prime contractor is required to either meet the goal or demonstrate good faith efforts to meet the goal. The commissioner must establish a procedure for evaluating the good faith efforts of contractors that do not meet the goal. The commissioner may establish (1) financial incentives for prime contractors who exceed the goals set for the use of subcontractors under this subdivision; and (2) sanctions for prime contractors who fail to make good faith efforts to meet the goals set under this subdivision.\n(b) The small targeted group business subcontracting requirements of this subdivision do not apply to prime contractors who are small targeted group businesses.\n(a) The commissioner may award up to a 12 percent preference in the amount bid for specified construction work to veteran-owned small businesses, except when prohibited by the federal government as a condition of receiving federal funds. When a bid preference is provided under this section, the percentage of preference in bid amount under this subdivision may not be less than the percentage of bid preference provided to any small targeted group business under subdivision 2.\n(b) When a bid preference is provided under this subdivision, the commissioner must be as inclusive as possible in specifying contracts for construction work, as well as for construction-related professional and technical services, available under this bid preference program for veteran-owned small businesses. The term \"construction\" must be given broad meaning for purposes of specifying and letting contracts for veteran-owned small businesses and must include, but is not limited to, preplanning, planning, and all other construction-related professional and technical services.\n(c) When a bid preference is provided under this subdivision, the commissioner must strive to ensure that contracts will be awarded on a proportional basis with contracts awarded under subdivision 2.\n(d) The commissioner may designate a contract for construction work for award only to veteran-owned small businesses, if the commissioner determines that at least three veteran-owned small businesses are likely to bid.\n(a) The commissioner may set goals for veteran-owned small business participation in contracts, except when prohibited by federal law or rule as a condition of receiving federal funds. As a condition of award, the prime contractor must either meet the goal or demonstrate good faith efforts to meet the goals. The commissioner must establish a procedure for evaluating the good faith efforts of contractors that do not meet the goal. The commissioner may establish (1) financial incentives for prime contractors who exceed the goals set for the use of subcontractors under this subdivision; and (2) sanctions for prime contractors who fail to make good faith efforts to meet goals set under this subdivision.\n(b) The subcontracting requirements of this subdivision do not apply to prime contractors who are veteran-owned small businesses.\nAt least 75 percent of subcontracts awarded to small targeted group businesses must be performed by the business to which the subcontract is awarded or another small targeted group business.\nAt least 75 percent of subcontracts awarded to veteran-owned small businesses must be performed by the business to which the subcontract is awarded or another veteran-owned small business.\nThe commissioner may elect to subject contracts awarded under this section to limitations contained in rules adopted by the commissioner of administration.\nThe commissioner shall cooperate with the commissioner of administration to periodically reevaluate the targeted group businesses to determine whether there is a statistical disparity between the percentage of construction contracts awarded to businesses owned by targeted group members and the representation of businesses owned by targeted group members among all businesses in the state in the construction category. The commissioner of administration shall designate targeted groups pursuant to section 16C.16, subdivision 5.\nIf the commissioner is unable to award a contract pursuant to the provisions of subdivisions 2 to 4a, the award may be placed pursuant to the normal solicitation and award provisions set forth in this chapter and chapter 16C.\nThe rules adopted by the commissioner of administration to define small businesses and to set time and other eligibility requirements for participation in programs under sections 16C.16 to 16C.19 apply to this section. The commissioner may promulgate other rules necessary to carry out this section.\nThe commissioner is encouraged to purchase from small targeted group businesses and veteran-owned small businesses designated under section 16C.16 when making purchases that are not subject to competitive bidding procedures.\n(a) The commissioner shall report to the commissioner of administration on compliance with this section. The information must be reported at the time and in the manner requested by the commissioner of administration.\n(b) By February 1 of each even-numbered year, the commissioner of transportation shall submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance and veterans policy and finance concerning contract awards during the preceding biennium under this section. At a minimum, the report must include:\n(1) a summary of the program;\n(2) a review of the use of preferences for contracting during the preceding biennium, including frequency of establishment of a preference and frequency and amount of contract awards to:\n(i) small targeted group businesses; and\n(ii) veteran-owned small businesses;\n(3) a review of goals and good faith efforts to use small targeted group businesses and veteran-owned small businesses in subcontracts, including analysis of methods used for, and effectiveness of, good faith efforts;\n(4) a summary of any financial incentives used or sanctions imposed;\n(5) agency commentary on any perceived impediments, whether statutory, administrative, or otherwise, that may be limiting the participation of small targeted group businesses and veteran-owned small businesses in the agency's contract preference program;\n(6) information on each reevaluation under subdivision 4a, including details on the methodology for reevaluation; and\n(7) any recommendations for legislative or programmatic changes.\nThe purpose of the state contracting bid preference program for veteran-owned small businesses is to facilitate the healthy transition of veterans from military to civilian life, and to help compensate veterans for their sacrifices including, but not limited to, their sacrifice of health and time to the state and nation during their military service, as well as to enhance economic development within Minnesota.",
	"repealed": false
}