{
	"id": "144.4811",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4811",
	"title": "144.4811 PERIODIC REVIEW AND RELEASE FROM DETENTION.",
	"text": "If the carrier has been detained in a treatment facility or has been isolated pursuant to a court order, the commissioner shall submit a report to the court, the carrier, and the carrier's counsel within 90 days of the date of the court-ordered detention and every 90 days thereafter, until the carrier is released. The report must state the treatment the carrier receives, whether the carrier is cured or noninfectious, and whether the carrier will continue to be detained. If the carrier contests the commissioner's determination for continued detention, the carrier may request a hearing. The hearing on continued detention is governed by the provisions for a final hearing under section 144.4810, excluding subdivision 5 of that section. The court shall order continued detention of the carrier if it finds that such detention is reasonable. This subdivision does not apply to consent orders or other confinement that has been voluntarily agreed upon by the parties.\nIf the carrier is detained in a treatment facility or isolated pursuant to a court order, the carrier may make a good faith request for release from confinement prior to the 90-day review under subdivision 1 by filing a petition and notice of hearing with the court that ordered the confinement and by serving the petition and notice on the commissioner. The hearing on continued confinement is governed by the provisions for a final hearing under section 144.4810, excluding subdivision 5 of that section. The court shall order continued detention of the carrier if it finds that such detention is reasonable.\nA carrier who has been detained in a treatment facility under a court order to compel the carrier to submit to a diagnostic tuberculosis examination shall be released only after:\n(1) the commissioner determines that the carrier does not have active tuberculosis; or\n(2) the commissioner determines that the carrier is not an endangerment to the public health.\nA carrier who is detained in a treatment facility or isolated under a court order because the carrier is an endangerment to the public health shall be released only after:\n(1) the commissioner determines that the carrier is cured; or\n(2) the commissioner determines that the carrier is no longer an endangerment to the public health.",
	"repealed": false
}