{
	"id": "245G.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.06",
	"title": "245G.06 INDIVIDUAL TREATMENT PLAN.",
	"text": "Each client must have a person-centered individual treatment plan developed by an alcohol and drug counselor within ten days from the day of service initiation for a residential program, by the end of the tenth day on which a treatment session has been provided from the day of service initiation for a client in a nonresidential program, not to exceed 30 days. Opioid treatment programs must complete the individual treatment plan within 21 days from the day of service initiation. The number of days to complete the individual treatment plan excludes the day of service initiation. The individual treatment plan must be signed by the client and the alcohol and drug counselor and document the client's involvement in the development of the plan. The individual treatment plan is developed upon the qualified staff member's dated signature. Treatment planning must include ongoing assessment of client needs. An individual treatment plan must be updated based on new information gathered about the client's condition, the client's level of participation, and on whether methods identified have the intended effect. A change to the plan must be signed by the client and the alcohol and drug counselor. If the client chooses to have family or others involved in treatment services, the client's individual treatment plan must include how the family or others will be involved in the client's treatment. If a client is receiving treatment services or an assessment via telehealth and the alcohol and drug counselor documents the reason the client's signature cannot be obtained, the alcohol and drug counselor may document the client's verbal approval or electronic written approval of the treatment plan or change to the treatment plan in lieu of the client's signature.\n(a) After completing a client's comprehensive assessment, the license holder must complete an individual treatment plan. The license holder must:\n(1) base the client's individual treatment plan on the client's comprehensive assessment;\n(2) use a person-centered, culturally appropriate planning process that allows the client's family and other natural supports to observe and participate in the client's individual treatment services, assessments, and treatment planning;\n(3) identify the client's treatment goals in relation to any or all of the applicable ASAM six dimensions identified in section 254B.04, subdivision 4, to ensure measurable treatment objectives, a treatment strategy, and a schedule for accomplishing the client's treatment goals and objectives;\n(4) document the ASAM level of care identified in section 254B.19, subdivision 1, under which the client is receiving services;\n(5) identify the participants involved in the client's treatment planning. The client must participate in the client's treatment planning. If applicable, the license holder must document the reasons that the license holder did not involve the client's family or other natural supports in the client's treatment planning;\n(6) identify resources to refer the client to when the client's needs will be addressed concurrently by another provider; and\n(7) identify maintenance strategy goals and methods designed to address relapse prevention and to strengthen the client's protective factors.\nMS 2022 [Repealed, 2023 c 50 art 2 s 63; 2023 c 61 art 4 s 28]\nThe license holder must ensure that the staff member who provides the treatment service documents in the client record the date, type, and amount of each treatment service provided to a client and the client's response to each treatment service within seven days of providing the treatment service.\n(a) The license holder must document in the client record any significant event that occurs at the program within 24 hours of the event. A significant event is an event that impacts the client's relationship with other clients, staff, or the client's family, or the client's treatment plan.\n(b) A residential treatment program must document in the client record the following items on the day that each occurs:\n(1) medical and other appointments the client attended;\n(2) concerns related to medications that are not documented in the medication administration record; and\n(3) concerns related to attendance for treatment services, including the reason for any client absence from a treatment service.\n(c) Each entry in a client's record must be accurate, legible, signed, dated, and include the job title or position of the staff person that made the entry. A late entry must be clearly labeled \"late entry.\" A correction to an entry must be made in a way in which the original entry can still be read.\nA treatment plan review must be completed by the alcohol and drug counselor responsible for the client's treatment plan. The review must indicate the span of time covered by the review and must:\n(1) document client goals addressed since the last treatment plan review and whether the identified methods continue to be effective;\n(2) document monitoring of any physical and mental health problems and include toxicology results for alcohol and substance use, when available;\n(3) document the participation of others involved in the individual's treatment planning, including when services are offered to the client's family or significant others;\n(4) if changes to the treatment plan are determined to be necessary, document staff recommendations for changes in the methods identified in the treatment plan and whether the client agrees with the change;\n(5) include a review and evaluation of the individual abuse prevention plan according to section 245A.65; and\n(6) document any referrals made since the previous treatment plan review.\n(a) A license holder must ensure that the alcohol and drug counselor responsible for a client's treatment plan completes and documents a treatment plan review that meets the requirements of subdivision 3 in each client's file, according to the frequencies required in this subdivision. All ASAM levels referred to in this chapter are those described in section 254B.19, subdivision 1.\n(b) For a client receiving residential ASAM level 3.3 or 3.5 high-intensity services or residential hospital-based services, a treatment plan review must be completed once every 14 days.\n(c) For a client receiving residential ASAM level 3.1 low-intensity services or any other residential level not listed in paragraph (b), a treatment plan review must be completed once every 30 days.\n(d) For a client receiving nonresidential ASAM level 2.5 partial hospitalization services, a treatment plan review must be completed once every 14 days.\n(e) For a client receiving nonresidential ASAM level 1.0 outpatient or 2.1 intensive outpatient services or any other nonresidential level not included in paragraph (d), a treatment plan review must be completed once every 30 days.\n(f) For a client receiving nonresidential opioid treatment program services according to section 245G.22, a treatment plan review must be completed:\n(1) weekly for the ten weeks following completion of the treatment plan; and\n(2) monthly thereafter.\nTreatment plan reviews must be completed more frequently when clinical needs warrant.\n(g) Notwithstanding paragraphs (e) and (f), clause (2), for a client in a nonresidential program with a treatment plan that clearly indicates less than five hours of skilled treatment services will be provided to the client each month, a treatment plan review must be completed once every 90 days. Treatment plan reviews must be completed more frequently when clinical needs warrant.\n(a) An alcohol and drug counselor must write a service discharge summary for each client. The service discharge summary must be completed within five days of the client's service termination. A copy of the client's service discharge summary must be provided to the client upon the client's request.\n(b) The service discharge summary must be recorded in the six dimensions listed in section 254B.04, subdivision 4, and include the following information:\n(1) the client's issues, strengths, and needs while participating in treatment, including services provided;\n(2) the client's progress toward achieving each goal identified in the individual treatment plan;\n(3) a risk rating and description for each of the ASAM six dimensions;\n(4) the reasons for and circumstances of service termination. If a program discharges a client at staff request, the reason for discharge and the procedure followed for the decision to discharge must be documented and comply with the requirements in section 245G.14, subdivision 3, clause (3);\n(5) the client's living arrangements at service termination;\n(6) continuing care recommendations, including transitions between more or less intense services, or more frequent to less frequent services, and referrals made with specific attention to continuity of care for mental health, as needed; and\n(7) service termination diagnosis.",
	"repealed": false
}