{
	"id": "184B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/184B.01",
	"title": "184B.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Amusement ride\" means a mechanical device that carries or conveys passengers along, around, or over a fixed or restricted route or course for the purpose of giving its passengers amusement, pleasure, thrills, or excitement.\n\"Amusement ride\" does not include:\n(1) a coin-operated ride that is manually, mechanically, or electrically operated and customarily placed in a public location and that does not normally require the supervision or services of an operator; or\n(2) nonmechanized playground equipment, including but not limited to swings, seesaws, stationary spring-mounted animal features, rider-propelled merry-go-rounds, climbers, playground slides, trampolines, and physical fitness devices.\n\"Certified amusement ride inspector\" means an individual who holds one or more of the following current certifications:\n(1) a Level II Amusement Ride and Device Inspector certification issued by the National Association of Amusement Ride Safety Officials (NAARSO);\n(2) a Level III Amusement Ride and Device Inspector certification issued by the National Association of Amusement Ride Safety Officials (NAARSO);\n(3) a Level II Certified Maintenance Technician certification issued by the Amusement Industry Manufacturers and Suppliers (AIMS) International;\n(4) a Level III Certified Maintenance Professional certification issued by the Amusement Industry Manufacturers and Suppliers (AIMS) International;\n(5) a Level II Certified Operations Technician certification issued by the Amusement Industry Manufacturers and Suppliers (AIMS) International; or\n(6) a Level III Certified Operations Professional certification issued by the Amusement Industry Manufacturers and Suppliers (AIMS) International.\n\"Commissioner\" means the commissioner of labor and industry.\n\"Operator\" means the individual having direct control of the starting, stopping, or speed control of an amusement ride.\n\"Owner\" means a person who owns, leases, or manages the operation of an amusement ride.\n(a) \"Rider\" means an individual who is in the immediate vicinity of an amusement ride, including an individual:\n(1) waiting in the immediate vicinity of an amusement ride;\n(2) getting on an amusement ride;\n(3) on an amusement ride before, during, and after its operation;\n(4) getting off an amusement ride; or\n(5) leaving or approaching an amusement ride and in its immediate vicinity.\n(b) \"Rider\" does not include:\n(1) any operator while operating the amusement ride or any employees, agents, or servants of an operator while engaged in the duties of employment; or\n(2) any owner or any employees, agents, or servants of an owner while engaged in the duties of employment.",
	"repealed": false
}