{
	"id": "62S.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/62S.08",
	"title": "62S.08 COVERAGE OUTLINE.",
	"text": "An outline of coverage must be delivered to a prospective applicant for long-term care insurance at the time of initial solicitation through means that prominently direct the attention of the recipient to the document and its purpose. In the case of agent solicitations, an agent must deliver the outline of coverage before the presentation of an application or enrollment form. In the case of direct response solicitations, the outline of coverage must be presented in conjunction with an application or enrollment form.\nThe outline of coverage must be a freestanding document, using no smaller than ten-point type, and may not contain material of an advertising nature. Text which is capitalized or underscored in the standard format outline of coverage may be emphasized by other means which provide prominence equivalent to the capitalization or underscoring.\nThe following standard format outline of coverage must be used, unless otherwise specifically indicated:\nCOMPANY NAME\nADDRESS - CITY AND STATE\nTELEPHONE NUMBER\nLONG-TERM CARE INSURANCE\nOUTLINE OF COVERAGE\nPolicy Number or Group Master Policy and Certificate Number\n(Except for policies or certificates which are guaranteed issue, the following caution statement, or language substantially similar, must appear as follows in the outline of coverage.)\nCAUTION: The issuance of this long-term care insurance (policy) (certificate) is based upon your responses to the questions on your application. A copy of your (application) (enrollment form) (is enclosed) (was retained by you when you applied). If your answers are incorrect or untrue, the company has the right to deny benefits or rescind your policy. The best time to clear up any questions is now, before a claim arises. If, for any reason, any of your answers are incorrect, contact the company at this address: (insert address).\n(1) This policy is (an individual policy of insurance) (a group policy) which was issued in the (indicate jurisdiction in which group policy was issued).\n(2) PURPOSE OF OUTLINE OF COVERAGE. This outline of coverage provides a very brief description of the important features of the policy. You should compare this outline of coverage to outlines of coverage for other policies available to you. This is not an insurance contract, but only a summary of coverage. Only the individual or group policy contains governing contractual provisions. This means that the policy or group policy sets forth in detail the rights and obligations of both you and the insurance company. Therefore, if you purchase this coverage, or any other coverage, it is important that you READ YOUR POLICY (OR CERTIFICATE) CAREFULLY.\n(3) THIS PLAN IS INTENDED TO BE A QUALIFIED LONG-TERM CARE INSURANCE CONTRACT AS DEFINED UNDER SECTION 7702(B)(b) OF THE INTERNAL REVENUE CODE OF 1986.\n(4) TERMS UNDER WHICH THE POLICY OR CERTIFICATE MAY BE CONTINUED IN FORCE OR DISCONTINUED.\n(a) (For long-term care health insurance policies or certificates describe one of the following permissible policy renewability provisions:)\n(1) (Policies and certificates that are guaranteed renewable shall contain the following statement:) RENEWABILITY: THIS POLICY (CERTIFICATE) IS GUARANTEED RENEWABLE. This means you have the right, subject to the terms of your policy, (certificate) to continue this policy as long as you pay your premiums on time. (Company name) cannot change any of the terms of your policy on its own, except that, in the future, IT MAY INCREASE THE PREMIUM YOU PAY.\n(2) (Policies and certificates that are noncancelable shall contain the following statement:) RENEWABILITY: THIS POLICY (CERTIFICATE) IS NONCANCELABLE. This means that you have the right, subject to the terms of your policy, to continue this policy as long as you pay your premiums on time. (Company name) cannot change any of the terms of your policy on its own and cannot change the premium you currently pay. However, if your policy contains an inflation protection feature where you choose to increase your benefits, (company name) may increase your premium at that time for those additional benefits.\n(b) (For group coverage, specifically describe continuation/conversion provisions applicable to the certificate and group policy.)\n(c) (Describe waiver of premium provisions or state that there are not such provisions.)\n(5) TERMS UNDER WHICH THE COMPANY MAY CHANGE PREMIUMS.\n(In bold type larger than the maximum type required to be used for the other provisions of the outline of coverage, state whether or not the company has a right to change the premium and, if a right exists, describe clearly and concisely each circumstance under which the premium may change.)\n(6) TERMS UNDER WHICH THE POLICY OR CERTIFICATE MAY BE RETURNED AND PREMIUM REFUNDED.\n(a) (Provide a brief description of the right to return -- \"free look\" provision of the policy.)\n(b) (Include a statement that the policy either does or does not contain provisions providing for a refund or partial refund of premium upon the death of an insured or surrender of the policy or certificate. If the policy contains such provisions, include a description of them.)\n(7) THIS IS NOT MEDICARE SUPPLEMENT COVERAGE. If you are eligible for Medicare, review the Medicare Supplement Buyer's Guide available from the insurance company.\n(a) (For agents) neither (insert company name) nor its agents represent Medicare, the federal government, or any state government.\n(b) (For direct response) (insert company name) is not representing Medicare, the federal government, or any state government.\n(8) LONG-TERM CARE COVERAGE. Policies of this category are designed to provide coverage for one or more necessary or medically necessary diagnostic, preventive, therapeutic, rehabilitative, maintenance, or personal care services, provided in a setting other than an acute care unit of a hospital, such as in a nursing home, in the community, or in the home.\nThis policy provides coverage in the form of a fixed dollar indemnity benefit for covered long-term care expenses, subject to policy (limitations), (waiting periods), and (coinsurance) requirements. (Modify this paragraph if the policy is not an indemnity policy.)\n(9) BENEFITS PROVIDED BY THIS POLICY.\n(a) (Covered services, related deductible(s), waiting periods, elimination periods, and benefit maximums.)\n(b) (Institutional benefits, by skill level.)\n(c) (Noninstitutional benefits, by skill level.)\n(d) (Eligibility for payment of benefits.)\n(Activities of daily living and cognitive impairment shall be used to measure an insured's need for long-term care and must be defined and described as part of the outline of coverage.)\n(Any benefit screens must be explained in this section. If these screens differ for different benefits, explanation of the screen should accompany each benefit description. If an attending physician, advanced practice registered nurse, physician assistant, or other specified person must certify a certain level of functional dependency in order to be eligible for benefits, this too must be specified. If activities of daily living (ADLs) are used to measure an insured's need for long-term care, then these qualifying criteria or screens must be explained.)\n(10) LIMITATIONS AND EXCLUSIONS:\nDescribe:\n(a) preexisting conditions;\n(b) noneligible facilities/provider;\n(c) noneligible levels of care (e.g., unlicensed providers, care or treatment provided by a family member, etc.);\n(d) exclusions/exceptions; and\n(e) limitations.\n(This section should provide a brief specific description of any policy provisions which limit, exclude, restrict, reduce, delay, or in any other manner operate to qualify payment of the benefits described in paragraph (8).)\nTHIS POLICY MAY NOT COVER ALL THE EXPENSES ASSOCIATED WITH YOUR LONG-TERM CARE NEEDS.\n(11) RELATIONSHIP OF COST OF CARE AND BENEFITS. Because the costs of long-term care services will likely increase over time, you should consider whether and how the benefits of this plan may be adjusted. As applicable, indicate the following:\n(a) that the benefit level will not increase over time;\n(b) any automatic benefit adjustment provisions;\n(c) whether the insured will be guaranteed the option to buy additional benefits and the basis upon which benefits will be increased over time if not by a specified amount or percentage;\n(d) if there is such a guarantee, include whether additional underwriting or health screening will be required, the frequency and amounts of the upgrade options, and any significant restrictions or limitations; and\n(e) whether there will be any additional premium charge imposed and how that is to be calculated.\n(12) ALZHEIMER'S DISEASE AND OTHER ORGANIC BRAIN DISORDERS. (State that the policy provides coverage for insureds clinically diagnosed as having Alzheimer's disease or related degenerative and dementing illnesses. Specifically, describe each benefit screen or other policy provision which provides preconditions to the availability of policy benefits for such an insured.)\n(13) PREMIUM.\n(a) State the total annual premium for the policy.\n(b) If the premium varies with an applicant's choice among benefit options, indicate the portion of annual premium which corresponds to each benefit option.\n(14) ADDITIONAL FEATURES.\n(a) Indicate if medical underwriting is used.\n(b) Describe other important features.\n(15) CONTACT THE STATE DEPARTMENT OF COMMERCE OR SENIOR LINKAGE LINE IF YOU HAVE GENERAL QUESTIONS REGARDING LONG-TERM CARE INSURANCE. CONTACT THE INSURANCE COMPANY IF YOU HAVE SPECIFIC QUESTIONS REGARDING YOUR LONG-TERM CARE INSURANCE POLICY OR CERTIFICATE.\nThe outline of coverage must include the inflation protection information required under section 62S.23, subdivision 3, and the notice to buyer requirements specified under section 62S.29, subdivision 1, clause (3).",
	"repealed": false
}