{
	"id": "121A.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.80",
	"title": "121A.80 STUDENT JOURNALISM; STUDENT EXPRESSION.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"School-sponsored media\" means material that is:\n(1) prepared, wholly or substantially written, published, broadcast, or otherwise disseminated by a student journalist enrolled in a school district or charter school;\n(2) distributed or generally made available to students in the school; and\n(3) prepared by a student journalist under the supervision of a student media adviser.\nSchool-sponsored media does not include material prepared solely for distribution or transmission in the classroom in which the material is produced, or a yearbook.\n(c) \"School official\" means a school principal under section 123B.147 or other person having administrative control or supervision of a school.\n(d) \"Student journalist\" means a school district or charter school student in grades 6 through 12 who gathers, compiles, writes, edits, photographs, records, or otherwise prepares information for dissemination in school-sponsored media.\n(e) \"Student media adviser\" means a qualified teacher, as defined in section 122A.16, that a school district or charter school employs, appoints, or designates to supervise student journalists or provide instruction relating to school-sponsored media.\n(a) Except as provided in subdivision 3, a student journalist has the right to exercise freedom of speech and freedom of the press in school-sponsored media regardless of whether the school-sponsored media receives financial support from the school or district, uses school equipment or facilities in its production, or is produced as part of a class or course in which the student journalist is enrolled. Freedom of speech includes freedom to express political viewpoints. Consistent with subdivision 3, a student journalist has the right to determine the news, opinion, feature, and advertising content of school-sponsored media. A school district or charter school must not discipline a student journalist for exercising rights or freedoms under this paragraph or the First Amendment of the United States Constitution.\n(b) A school district or charter school must not retaliate or take adverse employment action against a student media adviser for supporting a student journalist exercising rights or freedoms under paragraph (a) or the First Amendment of the United States Constitution.\n(c) Notwithstanding the rights or freedoms of this subdivision or the First Amendment of the United States Constitution, nothing in this section inhibits a student media adviser from teaching professional standards of English and journalism to student journalists.\n(a) This section does not authorize or protect student expression that:\n(1) is defamatory;\n(2) is profane, harassing, threatening, or intimidating;\n(3) constitutes an unwarranted invasion of privacy;\n(4) violates federal or state law;\n(5) causes a material and substantial disruption of school activities; or\n(6) is directed to inciting or producing imminent lawless action on school premises or the violation of lawful school policies or rules, including a policy adopted in accordance with section 121A.03 or 121A.031.\n(b) Nothing in this section authorizes the publication of an advertisement by school-sponsored media that promotes the purchase of a product or service that is unlawful for purchase or use by minors.\n(c) A school or district must not authorize any prior restraint of school-sponsored media except under this subdivision.\nSchool districts and charter schools must adopt and post on the district or charter school website a student journalist policy consistent with this section.",
	"repealed": false
}