{
	"id": "16E.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.14",
	"title": "16E.14 MNIT SERVICES REVOLVING FUND.",
	"text": "The MNIT services revolving fund is created in the state treasury.\nMoney in the MNIT services revolving fund is appropriated annually to the chief information officer to operate information and telecommunications services, including management, consultation, and design services.\nExcept as specifically provided otherwise by law, each agency shall reimburse the MNIT services revolving fund for the cost of all services, supplies, materials, labor, and depreciation of equipment, including reasonable overhead costs, which the chief information officer is authorized and directed to furnish an agency. The chief information officer shall report the rates to be charged for the revolving fund no later than July 1 each year to the chair of the committee or division in the senate and house of representatives with primary jurisdiction over the budget of the Department of Information Technology Services.\n(a) The commissioner of management and budget shall make appropriate transfers to the revolving fund when requested by the chief information officer. The chief information officer may make allotments and encumbrances in anticipation of such transfers. In addition, the chief information officer, with the approval of the commissioner of management and budget, may require an agency to make advance payments to the revolving fund sufficient to cover the office's estimated obligation for a period of at least 60 days. All reimbursements and other money received by the chief information officer under this section must be deposited in the MNIT services revolving fund.\n(b) Each biennium, the commissioner of management and budget is authorized to provide cash flow assistance of up to $60,000,000 from the special revenue fund or other statutory general fund as defined in section 16A.671, subdivision 3, paragraph (a), to the Department of Information Technology Services for the purpose of managing revenue and expenditure differences. These funds shall be repaid with interest by the end of the closing period of the second fiscal year of the same biennium.\nIf the MNIT services revolving fund is abolished or liquidated, the total net profit from the operation of the fund must be distributed to the various funds from which purchases were made. The amount to be distributed to each fund must bear to the net profit the same ratio as the total purchases from each fund bears to the total purchases from all the funds during the same period of time.",
	"repealed": false
}