{
	"id": "120B.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.12",
	"title": "120B.12 READ ACT GOAL AND INTERVENTIONS.",
	"text": "(a) The legislature seeks to have every child reading at or above grade level every year, beginning in kindergarten, and to support multilingual learners and students receiving special education services in achieving their individualized reading goals in order to meet grade-level proficiency. By the 2026-2027 school year, districts must provide evidence-based reading instruction through a focus on student mastery of the foundational reading skills of phonemic awareness, phonics, and fluency, as well as the development of oral language, vocabulary, and reading comprehension skills. Students must receive evidence-based instruction that is proven to effectively teach children to read, consistent with sections 120B.118 to 120B.124.\n(b) To meet this goal, each district must provide teachers and instructional support staff with responsibility for teaching reading with training on evidence-based reading instruction that is approved by the Department of Education by the deadlines provided in section 120B.123, subdivision 5.\n(c) Districts are strongly encouraged to adopt a MTSS framework. The framework should include a process for monitoring student progress, evaluating program fidelity, and analyzing student outcomes and needs in order to design and implement ongoing evidenced-based instruction and interventions.\n(a) Each school district must screen every student enrolled in kindergarten, grade 1, grade 2, and grade 3 using a screening tool approved by the Department of Education three times each school year: (1) within the first six weeks of the school year; (2) by February 15 each year; and (3) within the last six weeks of the school year. Students enrolled in kindergarten, grade 1, grade 2, and grade 3, including multilingual learners and students receiving special education services, must be universally screened for mastery of foundational reading skills, including phonemic awareness, phonics, decoding, fluency, oral language, and for characteristics of dyslexia as measured by a screening tool approved by the Department of Education. The screening for characteristics of dyslexia may be integrated with universal screening for mastery of foundational skills and oral language. A district must submit data on student performance in kindergarten, grade 1, grade 2, and grade 3 on foundational reading skills, including phonemic awareness, phonics, decoding, fluency, and oral language to the Department of Education in the annual local literacy plan submission due on June 15.\n(b) Students in grades 4 and above, including multilingual learners and students receiving special education services, who do not demonstrate mastery of foundational reading skills, including phonemic awareness, phonics, decoding, fluency, and oral language, must be screened using a screening tool approved by the Department of Education for characteristics of dyslexia, and must continue to receive evidence-based instruction, interventions, and progress monitoring until the students achieve grade-level proficiency. A parent, in consultation with a teacher, may opt a student out of the literacy screener if the parent and teacher decide that continuing to screen would not be beneficial to the student. In such limited cases, the student must continue to receive progress monitoring and literacy interventions.\n(c) Reading screeners in English, and in the predominant languages of district students where practicable, must identify and evaluate students' areas of academic need related to literacy. The district also must monitor the progress and provide reading instruction appropriate to the specific needs of multilingual learners. The district must use an approved, developmentally appropriate, and culturally responsive screener and annually report summary screener results to the commissioner by June 15 in the form and manner determined by the commissioner.\n(d) The district also must include in its literacy plan under subdivision 4a, a summary of the district's efforts to screen, identify, and provide interventions to students who demonstrate characteristics of dyslexia as measured by a screening tool approved by the Department of Education. Districts are strongly encouraged to use a MTSS framework. With respect to students screened or identified under paragraph (a), the report must include:\n(1) a summary of the district's efforts to screen for dyslexia;\n(2) the number of students universally screened for that reporting year;\n(3) the number of students demonstrating characteristics of dyslexia for that year; and\n(4) an explanation of how students identified under this subdivision are provided with alternate instruction and interventions under section 125A.56, subdivision 1.\nA district must administer an approved reading screener to students in kindergarten through grade 3 within the first six weeks of the school year, by February 15 each year, and again within the last six weeks of the school year. Schools, after administering each screener, must give the parent of each student who is not reading at or above grade level timely information about:\n(1) the student's reading proficiency as measured by a screener approved by the Department of Education;\n(2) reading-related services currently being provided to the student and the student's progress; and\n(3) strategies for parents to use at home in helping their student succeed in becoming grade-level proficient in reading in English and in their native language.\nA district may not use this section to deny a student's right to a special education evaluation.\n(a) For each student identified under subdivision 2, the district shall provide reading intervention to accelerate student growth and reach the goal of reading at or above grade level by the end of the current grade and school year. A district is encouraged to provide reading intervention through a MTSS framework. If a student does not read at or above grade level by the end of the current school year, the district must continue to provide reading intervention until the student reads at grade level. District intervention methods shall encourage family engagement and, where possible, collaboration with appropriate school and community programs that specialize in evidence-based instructional practices and measure mastery of foundational reading skills, including phonemic awareness, phonics, decoding, fluency, and oral language. Intervention may include but is not limited to requiring student attendance in summer school, intensified reading instruction that may require that the student be removed from the regular classroom for part of the school day, extended-day programs, or programs that strengthen students' cultural connections.\n(b) A district or charter school is strongly encouraged to provide a personal learning plan for a student who is unable to demonstrate grade-level proficiency, as measured by the statewide reading assessment in grade 3 or a screener identified by the Department of Education under section 120B.123. The district or charter school must determine the format of the personal learning plan in collaboration with the student's educators and other appropriate professionals. The school must develop the learning plan in consultation with the student's parent or guardian. The personal learning plan must include targeted instruction that is evidence-based and ongoing progress monitoring, and address knowledge gaps and skill deficiencies through strategies such as specific exercises and practices during and outside of the regular school day, group interventions, periodic assessments or screeners, and reasonable timelines. The personal learning plan may include grade retention, if it is in the student's best interest; a student may not be retained solely due to delays in literacy or not demonstrating grade-level proficiency. A school must maintain and regularly update and modify the personal learning plan until the student reads at grade level. This paragraph does not apply to a student under an individualized education program.\n(c) Starting in the 2025-2026 school year, a district must use only evidence-based literacy interventions. Districts are strongly encouraged to use intervention materials approved by the Department of Education under the Read Act.\n(d) Starting in the 2026-2027 school year, to provide a Tier 2 literacy intervention, a paraprofessional or other unlicensed person, including a volunteer, must be supervised by a licensed teacher who has completed training in evidence-based reading instruction approved by the Department of Education, and has completed evidence-based training developed under the Read Act by CAREI or the regional literacy networks under section 120B.124, subdivision 4, or a training that the department has determined meets or exceeds the requirements of section 120B.124, subdivision 4.\n(a) A district must provide training on evidence-based structured literacy instruction to teachers and instructional staff in accordance with subdivision 1, paragraphs (b) and (c). The training must include teaching in the areas of phonemic awareness, phonics, vocabulary development, reading fluency, reading comprehension, and culturally and linguistically responsive pedagogy.\n(b) Each district shall use the data under subdivision 2 to identify the staff development needs so that:\n(1) elementary teachers are able to implement explicit, systematic, evidence-based instruction in the five reading areas of phonemic awareness, phonics, fluency, vocabulary, and comprehension with emphasis on mastery of foundational reading skills as defined in section 120B.119 and other literacy-related areas including writing until the student achieves grade-level reading and writing proficiency;\n(2) elementary teachers receive training to provide students with evidence-based reading and oral language instruction that meets students' developmental, linguistic, and literacy needs using the intervention methods or programs selected by the district for the identified students;\n(3) licensed teachers employed by the district have opportunities to improve reading and writing instruction through approved professional development identified in the local literacy plan;\n(4) licensed teachers recognize students' diverse needs in cross-cultural settings and are able to serve the oral language and linguistic needs of students who are multilingual learners by maximizing strengths in their native languages in order to cultivate students' English language development, including oral academic language development, and build academic literacy; and\n(5) licensed teachers are trained in culturally responsive pedagogy that enables students to master content, develop skills to access content, and build relationships.\n(c) A district that offers early childhood programs, including voluntary prekindergarten for eligible four-year-old children, early childhood special education, and school readiness programs, must provide classroom teachers in early childhood programs training approved by the Department of Education to provide children in early childhood programs with explicit, systematic instruction in phonological and phonemic awareness; oral language, including listening comprehension; vocabulary; and letter-sound correspondence.\n(a) Consistent with this section, a school district must adopt a local literacy plan to have every child reading at or above grade level every year beginning in kindergarten and to support multilingual learners and students receiving special education services in achieving their individualized reading goals. A district must update and submit the plan to the commissioner by June 15 each year. The plan must be consistent with the Read Act, and include the following:\n(1) a process to assess students' foundational reading skills, oral language, and level of reading proficiency and the approved screeners used, by school site and grade level, under section 120B.123;\n(2) a process to notify and involve parents;\n(3) a description of how schools in the district will determine the targeted reading instruction that is evidence-based and includes an intervention strategy for a student and the process for intensifying or modifying the reading strategy in order to obtain measurable reading progress;\n(4) evidence-based intervention methods for students who are not reading at or above grade level and progress monitoring to provide information on the effectiveness of the intervention;\n(5) identification of staff development needs, including a plan to meet those needs;\n(6) the curricula used by school site and grade level and, if applicable, the district plan and timeline for adopting approved curricula and materials starting in the 2025-2026 school year;\n(7) a statement of whether the district has adopted a MTSS framework;\n(8) student data using the measures of foundational literacy skills and mastery identified by the Department of Education for the following students:\n(i) students in kindergarten through grade 3;\n(ii) students who demonstrate characteristics of dyslexia; and\n(iii) students in grades 4 to 12 who are identified as not reading at grade level;\n(9) the number of teachers and other staff who have completed training approved by the department;\n(10) the number of teachers and other staff proposed for training in structured literacy; and\n(11) how the district used funding provided under the Read Act to implement the requirements of the Read Act.\n(b) The district must post its literacy plan on the official school district website and submit it to the commissioner of education using the template developed by the commissioner of education beginning June 15, 2024.\n(c) By March 1, 2024, the commissioner of education must develop a streamlined template for local literacy plans that meets the requirements of this subdivision and requires all reading instruction and teacher training in reading instruction to be evidence-based. The template must require a district to report information using the student categories required in the commissioner's report under paragraph (d). The template must focus district resources on improving students' foundational reading skills while reducing paperwork requirements for teachers.\n(d) By December 1, 2025, the commissioner of education must submit a report to the legislative committees with jurisdiction over prekindergarten through grade 12 education summarizing the local literacy plans submitted to the commissioner. The summary must include the following information:\n(1) the number of teachers and other staff who have completed training approved by the Department of Education;\n(2) the number of teachers and other staff required to complete the training under section 120B.123, subdivision 5, who have not completed the training;\n(3) the number of teachers exempt under section 120B.123, subdivision 5, from completing training approved by the Department of Education;\n(4) by school site and grade, the approved screeners and the reading curriculum used; and\n(5) by school site and grade, using the measurements of foundational literacy skills and mastery identified by the department, both aggregated data and disaggregated data on student performance on the approved screeners using the student categories under section 120B.35, subdivision 3, paragraph (a), clause (2).\n(e) By December 1, 2026, and December 1, 2027, the commissioner of education must submit updated reports containing the information required under paragraph (d) to the legislative committees with jurisdiction over prekindergarten through grade 12 education.\nThe commissioner must recommend to districts multiple screening tools to assist districts and teachers with identifying students under subdivision 2 and to assess students' reading proficiency. The commissioner must identify screeners that may be used for both purposes. A district must administer an approved screener according to section 120B.123, subdivision 1.",
	"repealed": false
}