{
	"id": "353.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.46",
	"title": "353.46 SAVINGS CLAUSES.",
	"text": "[Repealed, 1981 c 180 s 18]\n[Repealed, 2010 c 359 art 5 s 28]\n(a) The entitlement of a deferred annuitant or other former member of the general employees retirement plan of the Public Employees Retirement Association, the public employees police and fire retirement plan, or the local government correctional employees retirement plan to receive an annuity under the law in effect at the time the person terminated public service is preserved.\n(b) The entitlement of a deferred annuitant or former member of the Minneapolis Employees Retirement Fund, upon merger with the general employees retirement plan of the Public Employees Retirement Association, continues under the provisions of Minnesota Statutes 2008, section 422A.16.\n[Repealed, 1977 c 429 s 65]\n[Repealed, 1Sp2005 c 8 art 10 s 81]\n[Repealed, 1973 c 753 s 85]\nAny coordinated member of the general employees retirement plan of the Public Employees Retirement Association who, before July 1, 1979, was a member of the former coordinated program of the former Minneapolis Municipal Employees Retirement Fund and who, before July 1, 1978, was a member of the basic program of the Minneapolis Municipal Employees Retirement Fund is entitled to receive a retirement annuity when otherwise qualified, the calculation of which must utilize the formula accrual rates specified in Minnesota Statutes 2008, section 422A.15, subdivision 1, for that portion of credited service which was rendered before July 1, 1978, and the formula accrual rates specified in section 353.29, subdivision 3, for the remainder of credited service, both applied to the average salary as specified in section 353.01, subdivision 17a. The formula accrual rates to be used in calculating the retirement annuity must recognize the service after July 1, 1978, as a member of the former coordinated program of the former Minneapolis Municipal Employees Retirement Fund and after July 1, 1979, as a member of the general employees retirement plan of the Public Employees Retirement Association as a continuation of service rendered before July 1, 1978. The annuity amount attributable to service as a member of the basic program of the former Minneapolis Municipal Employees Retirement Fund and the annuity amount attributable to all other service is payable from the general employees retirement fund of the Public Employees Retirement Association.",
	"repealed": false
}