{
	"id": "103D.625",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.625",
	"title": "103D.625 DRAINAGE SYSTEMS IN WATERSHED DISTRICT.",
	"text": "(a) The managers shall take over a joint county or county drainage system within the watershed district and the right to repair and maintain the drainage system if directed by a joint county drainage authority or a county board. The transfer may be initiated by:\n(1) the joint county drainage authority or county board;\n(2) a petition from a person interested in the drainage system; or\n(3) the managers.\n(b) The transfer may not be made until the joint county drainage authority or county board has held a hearing on the transfer. Notice of the proposed transfer with the time and place of hearing must be given by two weeks' published notice in a legal newspaper of general circulation in the area where the transfer is to occur. All interested persons may appear and be heard.\n(c) After the hearing, the joint county drainage authority or county board shall order the watershed district to take over the joint county or county drainage system, unless it appears that the takeover would not serve the purpose of this chapter and would not be for the public welfare or be in the public interest.\nA joint county or county drainage system that is taken over in whole or in part is part of the works of the watershed district to the extent taken over.\nAfter the transfer is ordered, all proceedings for repair and maintenance must conform to chapter 103E, except for repairs and maintenance done pursuant to section 103D.621, subdivision 4.\nConstruction of new drainage systems or improvements of existing drainage systems in the watershed district must be initiated by filing a petition with the managers. The proceedings for the construction or improvement of drainage systems in the watershed district must conform to chapter 103E, except for repairs and maintenance done pursuant to section 103D.621, subdivision 4.",
	"repealed": false
}