{
	"id": "120A.414",
	"url": "https://www.revisor.mn.gov/statutes/cite/120A.414",
	"title": "120A.414 E-LEARNING DAYS.",
	"text": "\"E-learning day\" means a school day where a school offers full access to online instruction provided by students' individual teachers due to inclement weather. A school district or charter school that chooses to have e-learning days may have up to five e-learning days in one school year. An e-learning day is counted as a day of instruction and included in the hours of instruction under section 120A.41.\nA school board, including the board of a charter school, may adopt an e-learning day plan after meeting and negotiating with the exclusive representative of the teachers. If a charter school's teachers are not represented by an exclusive representative, the charter school may adopt an e-learning day plan after consulting with its teachers. The plan must include accommodations for students without Internet access at home and for digital device access for families without the technology or an insufficient amount of technology for the number of children in the household. A school's e-learning day plan must provide accessible options for students with disabilities under chapter 125A.\nA school district or charter school must notify parents and students of the e-learning day plan at the beginning of the school year.\nOn an e-learning day declared by the school, a school district or charter school must notify parents and students at least two hours prior to the normal school start time that students need to follow the e-learning day plan for that day.\nEach student's teacher must be accessible both online and by telephone during normal school hours on an e-learning day to assist students and parents.\nA school district or charter school that declares an e-learning day must continue to pay the full wages for scheduled work hours and benefits of all school employees for the duration of the e-learning period. During the e-learning period, school employees must be allowed to work from home to the extent practicable, be assigned to work in an alternative location, or be retained on an on-call basis for any potential need.",
	"repealed": false
}