{
	"id": "287.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/287.20",
	"title": "287.20 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of sections 287.21 to 287.31, have the meanings given to them in this section.\n(a) \"Consideration\" means generally the total monetary value that is given in return for a conveyance of real property in this state and includes all lump-sum payments, all prior or future installment payments that are required under the agreement between the parties, and the fair market value of any property taken, or to be taken, in exchange.\n(b) Consideration does not include the reasonable and lawful amounts of interest paid for the privilege of paying the purchase price in installments and the fair market value of any items of intangible personal property that are conveyed by the taxable instrument.\n(c) Consideration does not include the amount paid for the personal property located on the real property being conveyed and transferred as a part of the total consideration, except that the amount paid for the personal property located on the real property being conveyed must be included if the real property being conveyed is a one-, two-, or three-unit residential structure.\n(d) When a conveyance of real property is made pursuant to a contract for deed, the consideration is the price for the real property reflected in the contract; except that, subject to the limitations under section 287.221, if the contract for deed, or other agreement entered into as a condition to the seller executing the contract, requires the property to be improved during the term of the contract and the price of the real property as reflected in the contract does not include the consideration for the required improvements, then the consideration is the price for the real property as reflected in the contract and the consideration for the required improvements added during the term of the contract.\n(e) \"Total consideration\" has the same meaning as consideration.\n(f) \"Consideration, exclusive of the value of any lien or encumbrance remaining at the time of sale\" or \"net consideration\" means the amount of consideration as reduced by the amount outstanding under any lien that attached to the real property prior to the time of sale and that is not released or satisfied as a result of the sale.\n(g) Except in the case of a gift, when the amount of the consideration for a conveyance includes something other than money or promises to pay money, the consideration for that conveyance is rebuttably presumed to equal the fair market value of the real property being conveyed.\n\"Consolidation\" or \"merger\" means the combination of all of the assets of two or more corporations, limited liability companies, or partnerships, or any combination of these entities, whether or not title to the assets is taken by a newly created entity or by a preexisting entity that survives the consolidation or merger in an altered form.\n\"Designated transfer\" means any of the following:\n(1) a transfer between (i) an entity owned by a sole owner, and (ii) that sole owner;\n(2) a transfer between (i) an entity in which one or both spouses who are married to each other are the sole owners, and (ii) one or both of the spouses;\n(3) a transfer between (i) an entity with multiple co-owners, and (ii) all of the co-owners, so long as each of the co-owners maintains the same percentage ownership interest in the transferred real property, whether directly or through ownership of a percentage of the entity;\n(4) a transfer between (i) a revocable trust, and (ii) the grantor or grantors of the revocable trust; or\n(5) a transfer of substantially all of the assets of one or more entities pursuant to a reorganization, as defined in section 287.20, subdivision 9.\nFor purposes of this definition of designated transfer, an interest in an entity that is owned, directly or indirectly, by or for another entity shall be considered as being owned proportionately by or for the owners of the other entity under provisions similar to those of section 267(c)(1) and (5) of the Internal Revenue Code.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\n\"Lien\" means any legal claim, other than an easement, created by contract, statute, or law on the real property of another as security for a debt or obligation. For purposes of the deed tax, the term \"encumbrance\" is synonymous with the term \"lien\" and an easement is not a lien.\n\"Partition\" means the division by conveyance of real property that is held jointly or in common by two or more persons into individually owned interests. If one of the co-owners gives consideration for all or a part of the individually owned interest conveyed to them, that portion of the conveyance is not a part of the partition.\n\"Person\" includes any individual, partner, officer, director, firm, partnership, joint venture, limited liability company, association, cooperative, social club, fraternal organization, municipal or private corporation, whether organized for profit or not, estate, trusts, business trusts, receiver, trustee, syndicate, the United States, a state, any political subdivision of a state, or any group or combination acting as a unit, and the plural as well as the singular. The term includes directors and officers of corporations, governors and managers of a limited liability company, or members of partnerships who, either individually or jointly with others, have control, supervision, or responsibility of making or authorizing payment of the tax imposed by section 287.21. The term includes any agent of any individual or organization enumerated in this subdivision.\n\"Real property,\" \"real estate,\" and \"land\" mean any fee simple estate, and any estate for life, as defined in chapter 500, and the purchaser's interest under a contract for the conveyance of such an estate.\n\"Record,\" \"recorded,\" and \"recording\" each mean that a document has been delivered to and filed in the office of the county recorder or registrar of titles, whichever office maintains the records for the real property described in the document.\n\"Reorganization\" means the transfer of substantially all of the assets of a corporation, a limited liability company, or a partnership not in the usual or regular course of business if at the time of the transfer the transfer qualifies as: (i) a corporate reorganization under section 368(a) of the Internal Revenue Code; or (ii) a transfer from a partnership to another partnership when the transferee is treated as a continuation of the transferor under section 708 of the Internal Revenue Code.\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.",
	"repealed": false
}