{
	"id": "270C.722",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.722",
	"title": "270C.722 REVOCATION OF SALES TAX PERMITS.",
	"text": "(a) If: (1) a person fails to comply with chapter 297A or the sales and use tax provisions of chapter 289A or the rules related to sales tax, or (2) any retailer purchases for resale from an unlicensed seller more than 20,000 cigarettes or $500 or more worth of tobacco products, without reasonable cause, the commissioner may give the person 30 days' notice in writing, specifying the violations, and stating that based on the violations the commissioner intends to revoke the person's permit issued under section 297A.84. The notice must also advise the person of the right to contest the revocation under this subdivision. It must also explain the general procedures for a contested case hearing under chapter 14. The notice may be served personally or by mail in the manner prescribed for service of an order of assessment.\n(b) If the person does not request a hearing within 30 days after the date of the notice of intent, the commissioner may serve a notice of revocation of permit upon the person, and the permit is revoked. If a hearing is timely requested, and held, the permit is revoked after the commissioner serves an order of revocation of permit under section 14.62, subdivision 1.\n(a) The commissioner shall not issue a new permit after revocation or reinstate a revoked permit unless the taxpayer applies for a permit and provides reasonable evidence of intention to comply with the sales and use tax laws and rules. The commissioner may require the applicant to provide security, in addition to that authorized by section 297A.92, in an amount reasonably necessary to ensure compliance with the sales and use tax laws and rules. If the commissioner issues or reinstates a permit not in conformance with the requirements of this subdivision or applicable rules, the commissioner may cancel the permit upon notice to the permit holder. The notice must be served by first class and certified mail at the permit holder's last known address. The cancellation shall be effective immediately, subject to the right of the permit holder to show that the permit was issued in conformance with the requirements of this subdivision and applicable rules. Upon such showing, the permit must be reissued.\n(b) If a taxpayer has had a permit or permits revoked three times in a five-year period, the commissioner may refuse to issue a new permit or reinstate the revoked permit until 24 months have elapsed after revocation and the taxpayer has satisfied the conditions for reinstatement of a revoked permit or issuance of a new permit imposed by this section and rules adopted under this section.\n(c) For purposes of this subdivision, \"taxpayer\" means:\n(1) an individual, if a revoked permit was issued to or in the name of an individual, or a corporation or partnership, if a revoked permit was issued to or in the name of a corporation or partnership; and\n(2) an officer of a corporation, a member of a partnership, or an individual who is liable for delinquent sales taxes, either for the entity for which the new or reinstated permit is at issue, or for another entity for which a permit was previously revoked, or personally as a permit holder.",
	"repealed": false
}