{
	"id": "148.5193",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5193",
	"title": "148.5193 CONTINUING EDUCATION REQUIREMENTS.",
	"text": "(a) An applicant for licensure renewal as a speech-language pathologist or audiologist must meet the requirements for continuing education stipulated by the American Speech-Language-Hearing Association or the American Board of Audiology, or satisfy the requirements described in paragraphs (b) to (e).\n(b) Within one month following expiration of a license, an applicant for licensure renewal as either a speech-language pathologist or an audiologist must provide evidence to the commissioner of a minimum of 30 contact hours of continuing education obtained within the two years immediately preceding licensure expiration. A minimum of 20 contact hours of continuing education must be directly related to the licensee's area of licensure. Ten contact hours of continuing education may be in areas generally related to the licensee's area of licensure. Licensees who are issued licenses for a period of less than two years shall prorate the number of contact hours required for licensure renewal based on the number of months licensed during the biennial licensure period. Licensees shall receive contact hours for continuing education activities only for the biennial licensure period in which the continuing education activity was performed.\n(c) An applicant for licensure renewal as both a speech-language pathologist and an audiologist must attest to and document completion of a minimum of 36 contact hours of continuing education offered by a continuing education sponsor within the two years immediately preceding licensure renewal. A minimum of 15 contact hours must be received in the area of speech-language pathology and a minimum of 15 contact hours must be received in the area of audiology. Six contact hours of continuing education may be in areas generally related to the licensee's areas of licensure. Licensees who are issued licenses for a period of less than two years shall prorate the number of contact hours required for licensure renewal based on the number of months licensed during the biennial licensure period. Licensees shall receive contact hours for continuing education activities only for the biennial licensure period in which the continuing education activity was performed.\n(d) If the licensee is licensed by the Professional Educator Licensing and Standards Board:\n(1) activities that are approved in the categories of Minnesota Rules, part 8710.7200, subpart 3, items A and B, and that relate to speech-language pathology, shall be considered:\n(i) offered by a sponsor of continuing education; and\n(ii) directly related to speech-language pathology;\n(2) activities that are approved in the categories of Minnesota Rules, part 8710.7200, subpart 3, shall be considered:\n(i) offered by a sponsor of continuing education; and\n(ii) generally related to speech-language pathology; and\n(3) one clock hour as defined in Minnesota Rules, part 8710.7200, subpart 1, is equivalent to 1.0 contact hours of continuing education.\n(e) Contact hours may not be accumulated in advance and transferred to a future continuing education period.\n[See Note.]\nAn applicant for licensure renewal as a speech-language pathology assistant must meet the requirements for continuing education established by the American Speech-Language-Hearing Association and submit evidence of attending continuing education courses. A licensee must receive contact hours for continuing education activities only for the biennial licensure period in which the continuing education activity was completed. Continuing education contact hours obtained in one licensure period must not be transferred to a future licensure period.\n[See Note.]\nThe commissioner will accept continuing education provided by sponsors if the continuing education activity meets the following standards:\n(1) constitutes an organized program of learning;\n(2) reasonably expects to advance the knowledge and skills of the speech-language pathologist or audiologist;\n(3) pertains to subjects that relate to the practice of speech-language pathology or audiology;\n(4) is conducted by individuals who have education, training, and experience by reason of which said individuals should be considered experts concerning the subject matter of the activity; and\n(5) is presented by a sponsor who has a mechanism to verify participation and maintains attendance records for four years.\n[Repealed, 2000 c 460 s 66]\n(a) A licensee who teaches continuing education courses or presents or publishes for educational purposes may obtain contact hour equivalents according to paragraphs (b) to (d).\n(b) The sponsor of the course must meet the requirements of subdivision 2.\n(c) A licensee may not obtain more than six contact hours in any two-year continuing education period by teaching continuing education courses.\n(d) A licensee may obtain two contact hours for each hour spent teaching a course. Contact hours may be claimed only once for teaching the same course in any two-year continuing education period.\n[Repealed, 2000 c 460 s 66]\n(a) A licensee must maintain for four years records of attending the continuing education contact hours required for licensure renewal.\n(b) An applicant for licensure renewal must submit documentation demonstrating compliance with continuing education requirements of the American Speech-Language-Hearing Association or the American Board of Audiology or an equivalent, or the following information on a form provided by the commissioner: the sponsoring organization, the dates of the course, the course name, the number of contact hours completed, and the name and signature of the licensee.\n(a) The commissioner may audit a percentage of the continuing education reports based on random selection. A licensee shall maintain all documentation required by this section for two years after the last day of the biennial licensure period in which the contact hours were earned.\n(b) All renewal applications that are received after the expiration date may be subject to a continuing education report audit.\n(c) Any licensee against whom a complaint is filed may be subject to a continuing education report audit.\n(d) The licensee shall make the following information available to the commissioner for auditing purposes:\n(1) a copy of the completed continuing education report form for the continuing education reporting period that is the subject of the audit including all supporting documentation required by subdivision 5;\n(2) a description of the continuing education activity prepared by the presenter or sponsor that includes the course title or subject matter, date, place, number of program contact hours, presenters, and sponsors;\n(3) documentation of self-study programs by materials prepared by the presenter or sponsor that includes the course title, course description, name of sponsor or author, and the number of hours required to complete the program;\n(4) documentation of university, college, or vocational school courses by a course syllabus, listing in a course bulletin, or equivalent documentation that includes the course title, instructor's name, course dates, number of contact hours, and course content, objectives, or goals; and\n(5) verification of attendance by:\n(i) a signature of the presenter or a designee at the continuing education activity on the continuing education report form or a certificate of attendance with the course name, course date, and licensee's name;\n(ii) a summary or outline of the educational content of an audio or video educational activity to verify the licensee's participation in the activity if a designee is not available to sign the continuing education report form;\n(iii) verification of self-study programs by a certificate of completion or other documentation indicating that the individual has demonstrated knowledge and has successfully completed the program; or\n(iv) verification of attendance at a university, college, or vocational course by an official transcript.\nThe commissioner may request a licensee or continuing education sponsor to verify the continuing education to which the licensee attested. Documentation may come directly from the licensee, the continuing education sponsor, or from a national accrediting or certifying organization which maintains the records.\nThe commissioner may grant a waiver of the requirements of this section in cases where the requirements would impose an undue burden on the licensee. A licensee must request in writing a waiver of the requirements of this section. The request for a waiver must cite this section, the reasons for requesting the waiver, the period of time the licensee wishes to have the continuing education requirement waived, and the alternative measures that will be taken if a waiver is granted. The commissioner shall set forth, in writing, the reasons for granting or denying the waiver. Waivers granted by the commissioner shall specify in writing the time limitation and required alternative measures to be taken by the licensee.",
	"repealed": false
}