{
	"id": "160.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.20",
	"title": "160.20 DRAINAGE.",
	"text": "When the course of natural drainage of any land runs to a highway, the owner of the land shall have the right to enter upon the highway for the purpose of connecting a drain or ditch with any drain or ditch constructed along or across the highway, but before making the connections, shall first obtain a written permit for the connections from the road authority having jurisdiction. The connections shall be made in accordance with specifications set forth in the permits. The road authority shall have power to prescribe and enforce reasonable rules and regulations with reference to the connections. The highway shall be left in as good condition in every way as it was before the connection was made.\nIf any person desires during construction or reconstruction of a highway to install a tile drain for agricultural benefits in a natural drainage line in lands adjacent to any highway, and if a satisfactory outlet cannot be secured on the upper side of the right-of-way and the tile line must be projected across the right-of-way to a suitable outlet, the expense of both material and labor used in installing the tile drain across the roadbed shall be paid from funds available for the roads affected provided the road authority is notified of the necessity of the tile drain in advance of the construction of the roadbed so that the drain may be placed and the roadbed constructed in the same operation.\nWhen the course of natural drainage of any land runs to a highway, the owner of the land who has been granted a permit as provided in subdivision 4 may install drain tile along or across the highway right-of-way along the general course of the natural drainageway, provided further that there will be no diversion of drainage waters away from the natural receiving drainageway immediately downstream from the highway. Any installation shall be made in accordance with specifications set forth in the permit and any rules that apply to the installations. When any installation is made pursuant to this subdivision the highway shall be left in as good condition in every respect as it was before the installation was made.\n(a) A road authority may accept applications for permits for installation of drain tile along or across the right-of-way under its jurisdiction. The road authority may adopt reasonable rules for the installations and may require a bond before granting a permit. Permits for installation along a highway right-of-way must ensure that the length of the installation is restricted to the minimum necessary to achieve the desired agricultural benefits. A permit must not allow open trenches to be left on the right-of-way after installation of the drain tile is completed. A road authority that grants a permit for tile drain installation is not responsible for damage to that installation resulting from the action of the authority or any other permittee utilizing the right-of-way.\n(b) A person who installs drain tile along or across a highway right-of-way without obtaining a permit as provided in this section is guilty of a misdemeanor.\n(c) The commissioner shall take no action under this section which will result in the loss of federal aid for highway construction in the state.\n(d) For the purpose of subdivisions 2 to 4, \"highway\" means any highway as defined in section 160.02 which is located outside the corporate limits of a home rule charter or statutory city.",
	"repealed": false
}