{
	"id": "256B.0623",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0623",
	"title": "256B.0623 ADULT REHABILITATIVE MENTAL HEALTH SERVICES COVERED.",
	"text": "Subject to federal approval, medical assistance covers medically necessary adult rehabilitative mental health services when the services are provided by an entity meeting the standards in this section. The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner, using instruments and protocols approved by the commissioner.\nFor purposes of this section, the following terms have the meanings given them.\n(a) \"Adult rehabilitative mental health services\" means the services described in section 245I.02, subdivision 33.\n(b) \"Medication education services\" means services provided individually or in groups which focus on educating the recipient about mental illness and symptoms; the role and effects of medications in treating symptoms of mental illness; and the side effects of medications. Medication education is coordinated with medication management services and does not duplicate it. Medication education services are provided by physicians, advanced practice registered nurses, pharmacists, physician assistants, or registered nurses.\n(c) \"Transition to community living services\" means services which maintain continuity of contact between the rehabilitation services provider and the recipient and which facilitate discharge from a hospital, residential treatment program, board and lodging facility, or nursing home. Transition to community living services are not intended to provide other areas of adult rehabilitative mental health services.\nAn eligible recipient is an individual who:\n(1) is age 18 or older;\n(2) is diagnosed with a medical condition, such as mental illness or traumatic brain injury, for which adult rehabilitative mental health services are needed;\n(3) has substantial disability and functional impairment in three or more of the areas listed in section 245I.10, subdivision 9, paragraph (a), clause (4), so that self-sufficiency is markedly reduced; and\n(4) has had a recent standard diagnostic assessment by a qualified professional that documents adult rehabilitative mental health services are medically necessary to address identified disability and functional impairments and individual recipient goals.\n(a) The provider entity must be certified by the state following the certification process and procedures developed by the commissioner.\n(b) The certification process is a determination as to whether the entity meets the standards in this section and chapter 245I, as required in section 245I.011, subdivision 5. The certification must specify which adult rehabilitative mental health services the entity is qualified to provide.\n(c) State-level recertification must occur at least every three years.\n(d) The commissioner may intervene at any time and decertify providers with cause. The decertification is subject to appeal to the state. A county board may recommend that the state decertify a provider for cause.\n(e) The adult rehabilitative mental health services provider entity must meet the following standards:\n(1) have capacity to recruit, hire, manage, and train qualified staff;\n(2) have adequate administrative ability to ensure availability of services;\n(3) ensure that staff are skilled in the delivery of the specific adult rehabilitative mental health services provided to the individual eligible recipient;\n(4) ensure enough flexibility in service delivery to respond to the changing and intermittent care needs of a recipient as identified by the recipient and the individual treatment plan;\n(5) assist the recipient in arranging needed crisis assessment, intervention, and stabilization services;\n(6) ensure that services are coordinated with other recipient mental health services providers and the county mental health authority and the federally recognized American Indian authority and necessary others after obtaining the consent of the recipient. Services must also be coordinated with the recipient's case manager or care coordinator if the recipient is receiving case management or care coordination services;\n(7) keep all necessary records required by law;\n(8) deliver services as required by section 245.461;\n(9) be an enrolled Medicaid provider; and\n(10) maintain a quality assurance plan to determine specific service outcomes and the recipient's satisfaction with services.\nAdult rehabilitative mental health services must be provided by qualified individual provider staff of a certified provider entity. Individual provider staff must be qualified as:\n(1) a mental health professional who is qualified according to section 245I.04, subdivision 2;\n(2) a certified rehabilitation specialist who is qualified according to section 245I.04, subdivision 8;\n(3) a clinical trainee who is qualified according to section 245I.04, subdivision 6;\n(4) a mental health practitioner qualified according to section 245I.04, subdivision 4;\n(5) a mental health certified peer specialist who is qualified according to section 245I.04, subdivision 10;\n(6) a mental health rehabilitation worker who is qualified according to section 245I.04, subdivision 14; or\n(7) a licensed occupational therapist, as defined in section 148.6402, subdivision 14.\n[See Note.]\n(a) A treatment supervisor providing treatment supervision required by section 245I.06 must:\n(1) meet with staff receiving treatment supervision at least monthly to discuss treatment topics of interest and treatment plans of recipients; and\n(2) meet at least monthly with the directing clinical trainee or mental health practitioner, if there is one, to review needs of the adult rehabilitative mental health services program, review staff on-site observations and evaluate mental health rehabilitation workers, plan staff training, review program evaluation and development, and consult with the directing clinical trainee or mental health practitioner.\n(b) An adult rehabilitative mental health services provider entity must have a treatment director who is a mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner. The treatment director must:\n(1) ensure the direct observation of mental health rehabilitation workers required by section 245I.06, subdivision 3, is provided;\n(2) ensure immediate availability by phone or in person for consultation by a mental health professional, certified rehabilitation specialist, clinical trainee, or a mental health practitioner to the mental health rehabilitation worker during service provision;\n(3) model service practices which: respect the recipient, include the recipient in planning and implementation of the individual treatment plan, recognize the recipient's strengths, collaborate and coordinate with other involved parties and providers;\n(4) ensure that clinical trainees, mental health practitioners, and mental health rehabilitation workers are able to effectively communicate with the recipients, significant others, and providers; and\n(5) oversee the record of the results of direct observation, progress note evaluation, and corrective actions taken to modify the work of the clinical trainees, mental health practitioners, and mental health rehabilitation workers.\n(c) A clinical trainee or mental health practitioner who is providing treatment direction for a provider entity must receive treatment supervision at least monthly to:\n(1) identify and plan for general needs of the recipient population served;\n(2) identify and plan to address provider entity program needs and effectiveness;\n(3) identify and plan provider entity staff training and personnel needs and issues; and\n(4) plan, implement, and evaluate provider entity quality improvement programs.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) Providers of adult rehabilitative mental health services must complete a written functional assessment according to section 245I.10, subdivision 9, for each recipient.\n(b) When a provider of adult rehabilitative mental health services completes a written functional assessment, the provider must also complete a level of care assessment as defined in section 245I.02, subdivision 19, for the recipient.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) Providers of adult rehabilitative mental health services must comply with the requirements relating to referrals for case management in section 245.467, subdivision 4.\n(b) Adult rehabilitative mental health services are provided for most recipients in the recipient's home and community. Services may also be provided at the home of a relative or significant other, job site, psychosocial clubhouse, drop-in center, social setting, classroom, or other places in the community. Except for \"transition to community services,\" the place of service does not include a regional treatment center, nursing home, residential treatment facility licensed under Minnesota Rules, parts 9520.0500 to 9520.0670 (Rule 36), or section 245I.23, or an acute care hospital.\n(c) Adult rehabilitative mental health services may be provided in group settings if appropriate to each participating recipient's needs and individual treatment plan. A group is defined as two to ten clients, at least one of whom is a recipient, who is concurrently receiving a service which is identified in this section. The service and group must be specified in the recipient's individual treatment plan. No more than two qualified staff may bill Medicaid for services provided to the same group of recipients. If two adult rehabilitative mental health workers bill for recipients in the same group session, they must each bill for different recipients.\n(d) Adult rehabilitative mental health services are appropriate if provided to enable a recipient to retain stability and functioning, when the recipient is at risk of significant functional decompensation or requiring more restrictive service settings without these services.\n(e) Adult rehabilitative mental health services instruct, assist, and support the recipient in areas including: interpersonal communication skills, community resource utilization and integration skills, crisis planning, relapse prevention skills, health care directives, budgeting and shopping skills, healthy lifestyle skills and practices, cooking and nutrition skills, transportation skills, medication education and monitoring, mental illness symptom management skills, household management skills, employment-related skills, parenting skills, and transition to community living services.\n(f) Community intervention, including consultation with relatives, guardians, friends, employers, treatment providers, and other significant individuals, is appropriate when directed exclusively to the treatment of the client.\nThe following services are excluded from reimbursement as adult rehabilitative mental health services:\n(1) recipient transportation services;\n(2) a service provided and billed by a provider who is not enrolled to provide adult rehabilitative mental health service;\n(3) adult rehabilitative mental health services performed by volunteers;\n(4) provider performance of household tasks, chores, or related activities, such as laundering clothes, moving the recipient's household, housekeeping, and grocery shopping for the recipient;\n(5) direct billing of time spent \"on call\" when not delivering services to recipients;\n(6) activities which are primarily social or recreational in nature, rather than rehabilitative, for the individual recipient, as determined by the individual's needs and treatment plan;\n(7) job-specific skills services, such as on-the-job training;\n(8) provider service time included in case management reimbursement;\n(9) outreach services to potential recipients;\n(10) a mental health service that is not medically necessary; and\n(11) any services provided by a hospital, board and lodging, or residential facility to an individual who is a patient in or resident of that facility.\nWhen rehabilitative services are provided by qualified state staff who are assigned to pilot projects under section 245.4661, the county or other local entity to which the qualified state staff are assigned may consider these staff part of the local provider entity for which certification is sought under this section and may bill the medical assistance program for qualifying services provided by the qualified state staff. Payments for services provided by state staff who are assigned to adult mental health initiatives shall only be made from federal funds.",
	"repealed": false
}