{
	"id": "290.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.21",
	"title": "290.21 DEDUCTIONS ALLOWED TO CORPORATIONS.",
	"text": "The following deductions shall be allowed only to corporations and shall be deductions from a corporation's taxable net income.\n[Repealed, 1980 c 607 art 9 s 2]\n[Repealed, 1Sp2001 c 5 art 9 s 30]\n[Repealed, 1983 c 342 art 1 s 44]\n(a)(1) Fifty percent of dividends received by a corporation during the taxable year from another corporation, in which the recipient owns 20 percent or more of the stock, by vote and value, not including stock described in section 1504(a)(4) of the Internal Revenue Code when the corporate stock with respect to which dividends are paid does not constitute the stock in trade of the taxpayer or would not be included in the inventory of the taxpayer, or does not constitute property held by the taxpayer primarily for sale to customers in the ordinary course of the taxpayer's trade or business, or when the trade or business of the taxpayer does not consist principally of the holding of the stocks and the collection of the income and gains therefrom; and\n(2)(i) the remaining 50 percent of dividends if the dividends received are the stock in an affiliated company transferred in an overall plan of reorganization and the dividend is eliminated in consolidation under Treasury Department Regulation 1.1502-14(a), as amended through December 31, 1989;\n(ii) the remaining 50 percent of dividends if the dividends are received from a corporation which is subject to tax under section 290.36 and which is a member of an affiliated group of corporations as defined by the Internal Revenue Code and the dividend is eliminated in consolidation under Treasury Department Regulation 1.1502-14(a), as amended through December 31, 1989, or is deducted under an election under section 243(b) of the Internal Revenue Code; or\n(iii) the remaining 50 percent of the dividends if the dividends are received from a property and casualty insurer as defined under section 60A.60, subdivision 8, which is a member of an affiliated group of corporations as defined by the Internal Revenue Code and either: (A) the dividend is eliminated in consolidation under Treasury Regulation 1.1502-14(a), as amended through December 31, 1989; or (B) the dividend is deducted under an election under section 243(b) of the Internal Revenue Code.\n(b) Forty percent of dividends received by a corporation during the taxable year from another corporation in which the recipient owns less than 20 percent of the stock, by vote or value, not including stock described in section 1504(a)(4) of the Internal Revenue Code when the corporate stock with respect to which dividends are paid does not constitute the stock in trade of the taxpayer, or does not constitute property held by the taxpayer primarily for sale to customers in the ordinary course of the taxpayer's trade or business, or when the trade or business of the taxpayer does not consist principally of the holding of the stocks and the collection of income and gain therefrom.\n(c) The dividend deduction provided in this subdivision shall be allowed only with respect to dividends that are included in a corporation's Minnesota taxable net income for the taxable year.\nThe dividend deduction provided in this subdivision does not apply to a dividend from a corporation which, for the taxable year of the corporation in which the distribution is made or for the next preceding taxable year of the corporation, is a corporation exempt from tax under section 501 of the Internal Revenue Code.\nThe dividend deduction provided in this subdivision does not apply to a dividend received from a real estate investment trust as defined in section 856 of the Internal Revenue Code.\nThe dividend deduction provided in this subdivision applies to the amount of regulated investment company dividends only to the extent determined under section 854(b) of the Internal Revenue Code.\nThe dividend deduction provided in this subdivision shall not be allowed with respect to any dividend for which a deduction is not allowed under the provisions of section 246(c) or 246A of the Internal Revenue Code.\n(d) If dividends received by a corporation that does not have nexus with Minnesota under the provisions of Public Law 86-272 are included as income on the return of an affiliated corporation permitted or required to file a combined report under section 290.17, subdivision 4, or 290.34, subdivision 2, then for purposes of this subdivision the determination as to whether the trade or business of the corporation consists principally of the holding of stocks and the collection of income and gains therefrom shall be made with reference to the trade or business of the affiliated corporation having a nexus with Minnesota.\n(e) The deduction provided by this subdivision does not apply if the dividends are paid by a FSC as defined in section 922 of the Internal Revenue Code.\n(f) If one or more of the members of the unitary group whose income is included on the combined report received a dividend, the deduction under this subdivision for each member of the unitary business required to file a return under this chapter is the product of: (1) 100 percent of the dividends received by members of the group; (2) the percentage allowed pursuant to paragraph (a) or (b); and (3) the percentage of the taxpayer's business income apportionable to this state for the taxable year under section 290.191 or 290.20.\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1982 c 523 art 1 s 72]\n[Repealed, 1988 c 719 art 2 s 56]\nThe net income of a corporation that is included pursuant to section 951 of the Internal Revenue Code is dividend income.\nAny amounts included in taxable income pursuant to section 951A of the Internal Revenue Code, are dividend income.",
	"repealed": false
}