{
	"id": "125A.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.515",
	"title": "125A.515 PLACEMENT OF STUDENTS; APPROVAL OF EDUCATION PROGRAM.",
	"text": "The commissioner shall approve on-site education programs for placement of children and youth in residential facilities including detention centers, before being licensed by the Department of Human Services or the Department of Corrections. Education programs in these facilities shall conform to state and federal education laws including the Individuals with Disabilities Education Act (IDEA). This section applies only to placements in children's residential facilities licensed by the Department of Human Services or the Department of Corrections. For purposes of this section, \"on-site education program\" means the educational services provided directly on the grounds of the children's residential facility to children and youth placed for care and treatment.\n[Repealed, 2006 c 263 art 3 s 17]\n(a) The district in which the children's residential facility is located must provide education services, including special education if eligible, to all students placed in a facility. If a child's district of residence, district of open enrollment under section 124D.03, or charter school of enrollment under section 124E.11 is authorized to provide online learning instruction under state statutes, the district in which the children's residential facility is located may utilize that online learning program in fulfilling its education services responsibility under this section if the child, or the child's parent or guardian for a pupil under the age of 18, agrees to that form of instruction.\n(b) For education programs operated by the Department of Corrections, the providing district shall be the Department of Corrections. For students remanded to the commissioner of corrections, the providing and resident district shall be the Department of Corrections.\nA school district is not required to provide education services under this section to a student who:\n(1) is not a resident of Minnesota;\n(2) does not have an individualized education program; and\n(3) does not have a tuition arrangement or agreement to pay the cost of education from the placing authority.\n(a) Education services must be provided to a student beginning within three business days after the student enters the children's residential facility. The first four days of the student's placement may be used to screen the student for educational and safety issues.\n(b) If the student does not meet the eligibility criteria for special education, regular education services must be provided to that student.\n(a) When a student is placed in a children's residential facility under this section that has an on-site education program, the providing district, upon notice from the children's residential facility, must contact the resident district within one business day to determine if a student has been identified as having a disability, and to request at least the student's transcript, and for students with disabilities, the most recent individualized education program (IEP) and evaluation report. The resident district must send a facsimile copy to the providing district within two business days of receiving the request.\n(b) If a student placed under this section has been identified as having a disability and has an individualized education program in the resident district:\n(1) the providing agency must conduct an individualized education program meeting to reach an agreement about continuing or modifying special education services in accordance with the current individualized education program goals and objectives and to determine if additional evaluations are necessary; and\n(2) at least the following people shall receive written notice or documented phone call to be followed with written notice to attend the individualized education program meeting:\n(i) the person or agency placing the student;\n(ii) the resident district;\n(iii) the appropriate teachers and related services staff from the providing district;\n(iv) appropriate staff from the children's residential facility;\n(v) the parents or legal guardians of the student; and\n(vi) when appropriate, the student.\n(c) For a student who has not been identified as a student with a disability, a screening must be conducted by the providing districts as soon as possible to determine the student's educational and behavioral needs and must include a review of the student's educational records.\nIf a student has been placed in a facility under this section for 15 or more business days, the providing district must prepare an exit report summarizing the regular education, special education, evaluation, educational progress, and service information and must send the report to the resident district and the next providing district if different, the parent or legal guardian, and any appropriate social service agency. For students with disabilities, this report must include the student's IEP.\nWhen a student is placed in a children's residential facility under this section, at a minimum, the providing district is responsible for:\n(1) the education necessary, including summer school services, for a student who is not performing at grade level as indicated in the education record or IEP; and\n(2) a school day, of the same length as the school day of the providing district, unless the unique needs of the student, as documented through the IEP or education record in consultation with treatment providers, requires an alteration in the length of the school day.\nWhen a student's treatment and educational needs allow, education shall be provided in a regular educational setting. The determination of the amount and site of integrated services must be a joint decision between the student's parents or legal guardians and the treatment and education staff. When applicable, educational placement decisions must be made by the IEP team of the providing district. Educational services shall be provided in conformance with the least restrictive environment principle of the Individuals with Disabilities Education Act. The providing district and children's residential facility shall cooperatively develop discipline and behavior management procedures to be used in emergency situations that comply with the Minnesota Pupil Fair Dismissal Act and other relevant state and federal laws and regulations.\n(a) Education services provided to students who have been placed under this section are reimbursable in accordance with special education and general education statutes.\n(b) Indirect or consultative services provided in conjunction with regular education prereferral interventions and assessment provided to regular education students suspected of being disabled and who have demonstrated learning or behavioral problems in a screening are reimbursable with special education categorical aids.\n(c) Regular education, including screening, provided to students with or without disabilities is not reimbursable with special education categorical aids.\nStudents who are absent from, or predicted to be absent from, school for 15 consecutive or intermittent days, and placed at home or in facilities not licensed by the Departments of Corrections or Human Services are entitled to regular and special education services consistent with this section or Minnesota Rules, part 3525.2325. These students include students with and without disabilities who are home due to accident or illness, in a hospital or other medical facility, or in a day treatment center.",
	"repealed": false
}