{
	"id": "16E.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.30",
	"title": "16E.30 GEOSPATIAL INFORMATION OFFICE.",
	"text": "The Minnesota Geospatial Information Office is created under the supervision of the chief geospatial information officer, who is appointed by the chief information officer.\nThe office has authority to provide coordination, guidance, and leadership, and to plan the implementation of Minnesota's geospatial information technology. The office must identify, coordinate, and guide strategic investments in geospatial information technology systems, data, and services to ensure effective implementation and use of Geospatial Information Systems (GIS) by state agencies to maximize benefits for state government as an enterprise.\nThe office must:\n(1) coordinate and guide the efficient and effective use of available federal, state, local, and public-private resources to develop statewide geospatial information technology, data, and services;\n(2) provide leadership and outreach, and ensure cooperation and coordination for all Geospatial Information Systems (GIS) functions in state and local government, including coordination between state agencies, intergovernment coordination between state and local units of government, and extragovernment coordination, which includes coordination with academic and other private and nonprofit sector GIS stakeholders;\n(3) review state agency and intergovernment geospatial technology, data, and services development efforts involving state or intergovernment funding, including federal funding;\n(4) provide information to the legislature regarding projects reviewed, and recommend projects for inclusion in the governor's budget under section 16A.11;\n(5) coordinate management of geospatial technology, data, and services between state and local governments;\n(6) provide coordination, leadership, and consultation to integrate government technology services with GIS infrastructure and GIS programs;\n(7) work to avoid or eliminate unnecessary duplication of existing GIS technology services and systems, including services provided by other public and private organizations while building on existing governmental infrastructures;\n(8) promote and coordinate consolidated geospatial technology, data, and services and shared geospatial web services for state and local governments; and\n(9) promote and coordinate geospatial technology training, technical guidance, and project support for state and local governments.\n[Repealed, 2013 c 95 s 5]\n[Repealed, 2013 c 95 s 5]\nThe chief geospatial information officer is appointed by the Minnesota chief information officer who shall advise on technology projects, standards, and services.\nThe office may:\n(1) review the Geospatial Information Systems (GIS) technology infrastructure of regions of the state and cooperate with and make recommendations to the governor, legislature, state agencies, local governments, local technology development agencies, the federal government, private businesses, and individuals for the realization of GIS information and technology infrastructure development potential;\n(2) sponsor, support, and facilitate innovative and collaborative geospatial systems technology, data, and services projects; and\n(3) review and recommend alternative sourcing strategies for state geospatial information systems technology, data, and services.\n(a) The chief information officer must utilize a governance structure that includes an advisory council to provide recommendations for improving the operations and management of geospatial technology within state government and also on issues of importance to users of geospatial technology throughout the state.\n(b) The Geospatial Advisory Council must advise the Minnesota Geospatial Information Office regarding the improvement of services statewide through the coordinated, affordable, reliable, and effective use of geospatial technology. The chief information officer must appoint the members of the council. The members must represent a cross-section of organizations including counties, cities, universities, business, nonprofit organizations, federal agencies, tribal governments, and state agencies. In addition, the chief geospatial information officer must be a nonvoting member.\n(c) Members of the Geospatial Advisory Council must be recommended by a process that ensures that each member is designated to represent a clearly identified agency or interested party category. Members of the Geospatial Advisory Council must be selected in compliance with the state's open appointment process. Members shall serve a term of two years.\n(d) The Minnesota Geospatial Information Office must provide administrative support for the Geospatial Advisory Council.\n[Repealed, 2011 c 68 s 2]\n\"Electronic geospatial data\" means digital data using geographic or projected map coordinate values, identification codes, and associated descriptive data to locate and describe boundaries or features on, above, or below the surface of the earth or characteristics of the earth's inhabitants or its natural or human-constructed features.\n(a) The definitions in section 13.02 apply to this subdivision.\n(b) Electronic geospatial government data must be shared at no cost with government entities, the notification center established under section 216D.03, and federal and tribal government agencies. Data received under this subdivision may be reproduced or shared with other government entities or agencies. A release of data under this subdivision must include metadata or other documentation that identifies the original authoritative data source. Government entities providing data under this subdivision are not required to provide data in an alternate format specified by the requestor. A government entity is not required to provide the same data to the same requestor more than four times per year, unless required by law or court order. Government entities and agencies sharing and receiving electronic geospatial data under this subdivision are immune from civil liability arising out of the use of the shared electronic geospatial data. This subdivision does not authorize the release of data that are not public data.",
	"repealed": false
}