{
	"id": "332B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.06",
	"title": "332B.06 WRITTEN DEBT SETTLEMENT SERVICES AGREEMENT; DISCLOSURES; TRUST ACCOUNT.",
	"text": "(a) A debt settlement services provider may not perform, or impose any charges or receive any payment for, any debt settlement services until the provider and the debtor have executed a debt settlement services agreement that contains all terms of the agreement between the debt settlement services provider and the debtor, and the provider complies with all the applicable requirements of this chapter.\n(b) A debt settlement services agreement must:\n(1) be in writing, dated, and signed by the debt settlement services provider and the debtor;\n(2) conspicuously indicate whether or not the debt settlement services provider is registered with the Minnesota Department of Commerce and include any registration number; and\n(3) be written in the debtor's primary language if the debt settlement services provider advertises in that language, or in the language in which the agreement was negotiated, regardless of whether the debt settlement services provider advertises in that language.\n(c) The registrant must furnish the debtor with a copy of the signed contract upon execution.\nNo person may provide debt settlement services for a debtor or execute a debt settlement services agreement unless the person first has:\n(1) informed the debtor, in writing, that debt settlement is not appropriate for all debtors and that there are other ways to deal with debt, including using credit counseling or debt management services, or filing bankruptcy;\n(2) prepared in writing and provided to the debtor, in a form the debtor may keep, an individualized financial analysis of the debtor's financial circumstances, including income and liabilities, and made a determination supported by the individualized financial analysis that:\n(i) the debt settlement plan proposed for addressing the debt is suitable for the individual debtor;\n(ii) the debtor can reasonably meet the requirements of the proposed debt settlement services plan; and\n(iii) based on the totality of the circumstances, there is a net tangible benefit to the debtor of entering into the proposed debt settlement services plan; and\n(3) provided, on a document separate from any other document, the total amount and an itemization of fees, including any origination fees, monthly fees, and settlement fees reasonably anticipated to be paid by the debtor over the term of the agreement.\n(a) Before executing a debt settlement services agreement or providing any services, a debt settlement services provider must make a determination, supported by sufficient bases, which creditors listed by the debtor are reasonably likely, and which are not reasonably likely, to participate in the debt settlement services plan set forth in the debt settlement services agreement.\n(b) A debt settlement services provider has a defense against a claim that no sufficient basis existed to make a determination that a creditor was likely to participate if the debt settlement services provider can produce:\n(1) written confirmation from the creditor that, at the time the determination was made, the creditor and the debt settlement services provider were engaged in negotiations to settle a debt for another debtor; or\n(2) evidence that the provider and the creditor had entered into a settlement of a debt for another debtor within the six months prior to the date of the determination.\n(c) The debt settlement services provider must notify the debtor as soon as practicable after the provider has made a determination of the likelihood of participation or nonparticipation of all the creditors listed for inclusion in the debt settlement services agreement or debt settlement services plan. If not all creditors listed in the debt settlement services agreement are reasonably likely to participate in the debt settlement services plan, the debt settlement services provider must obtain the written authorization from the debtor to proceed with the debt settlement services agreement without the likely participation of all listed creditors.\n(a) A person offering to provide or providing debt settlement services must disclose both orally and in writing whether or not the person is registered with the Minnesota Department of Commerce and any registration number.\n(b) No person may provide debt settlement services unless the person first has provided, both orally and in writing, on a single sheet of paper, separate from any other document or writing, the following verbatim notice:\n\"CAUTION\nWe CANNOT GUARANTEE that you will successfully reduce or eliminate your debt.\nIf you stop paying your creditors, there is a strong likelihood some or all of the following may happen:\n• YOUR WAGES OR BANK ACCOUNT MAY STILL BE GARNISHED.\n• YOU MAY STILL BE CONTACTED BY CREDITORS.\n• YOU MAY STILL BE SUED BY CREDITORS for the money you owe.\n• FEES, INTEREST, AND OTHER CHARGES WILL CONTINUE TO MOUNT UP DURING THE (INSERT NUMBER) MONTHS THIS PLAN IS IN EFFECT.\nEven if we do settle your debt, YOU MAY STILL HAVE TO PAY TAXES on the amount forgiven.\nYour credit rating may be adversely affected.\"\n(c) The heading, \"CAUTION,\" must be in bold, underlined, 28-point type, and the remaining text must be in 14-point type, with a double space between each statement.\n(d) The disclosures and notices required under this subdivision must be provided in the debtor's primary language if the debt settlement services provider advertises in that language, or in the language in which the agreement was negotiated, regardless of whether the debt settlement services provider advertises in that language.\n(a) Each debt settlement services agreement must contain on the front page of the agreement, segregated by bold lines from all other information on the page and disclosed prominently and clearly in bold print, the total amount and an itemization of fees, including any origination fees, monthly fees, and settlement fees reasonably anticipated to be paid by the debtor over the term of the agreement.\n(b) Each debt settlement services agreement must also contain the following:\n(1) a prominent statement describing the terms upon which the debtor may cancel the contract as set forth in section 332B.07;\n(2) a detailed description of all services to be performed by the debt settlement services provider for the debtor;\n(3) the debt settlement services provider's refund policy;\n(4) the debt settlement services provider's principal business address, which must not be a post office box, and the name and address of its agent in this state authorized to receive service of process; and\n(5) the name of each creditor the debtor has listed and the aggregate debt owed to each creditor that will be the subject of settlement.\nA debt settlement services agreement may not contain any of the terms prohibited under section 332A.10, subdivision 4.\n(a) Separate and additional debt settlement services agreements that comply with this chapter may be entered into by the debt settlement services provider and the debtor, provided that no additional origination fee may be charged by the debt settlement services provider.\n(b) Any modification of an existing debt settlement services agreement, including any increase in the number or amount of debts included in the debt settlement services agreement, must be in writing and signed by both parties. No fee may be charged to modify an existing agreement.\nDebtor funds may be held in trust for the purpose of writing exchange checks for no longer than 42 days. If the registrant holds debtor funds, the registrant must maintain a separate trust account, except that the registrant may commingle debtor funds with the registrant's own funds, in the form of an imprest fund, to the extent necessary to ensure maintenance of a minimum balance, if the financial institution at which the trust account is held requires a minimum balance to avoid the assessment of fees or penalties for failure to maintain a minimum balance.",
	"repealed": false
}