{
	"id": "103B.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.155",
	"title": "103B.155 STATE WATER AND RELATED LAND RESOURCE PLAN.",
	"text": "The commissioner of natural resources, in cooperation with other state and federal agencies, regional development commissions, the Metropolitan Council, local governmental units, and citizens, shall prepare a statewide framework and assessment water and related land resources plan for presentation to the legislature by November 15, 1975, for its review and approval or disapproval. This plan must relate each of the programs of the Department of Natural Resources for specific aspects of water management to the others. The statewide plan must include:\n(1) regulation of improvements and land development by abutting landowners of the beds, banks, and shores of lakes, streams, watercourses, and marshes by permit or otherwise to preserve them for beneficial use;\n(2) regulation of construction of improvements on and prevention of encroachments in the floodplains of the rivers, streams, lakes, and marshes of the state;\n(3) reclamation or filling of wet and overflowed lands;\n(4) repair, improvement, relocation, modification or consolidation in whole or in part of previously established public drainage systems within the state;\n(5) preservation of wetland areas;\n(6) management of game and fish resources as related to water resources;\n(7) control of water weeds;\n(8) control or alleviation of damages by floodwaters;\n(9) alteration of stream channels for conveyance of surface waters, navigation, and any other public purposes;\n(10) diversion or changing of watercourses in whole or in part;\n(11) regulation of the flow of streams and conservation of their waters;\n(12) regulation of lake water levels;\n(13) maintenance of water supply for municipal, domestic, industrial, recreational, agricultural, aesthetic, wildlife, fishery, or other public use;\n(14) sanitation and public health and regulation of uses of streams, ditches, or watercourses to dispose of waste and maintain water quality;\n(15) preventive or remedial measures to control or alleviate land and soil erosion and siltation of affected watercourses or bodies of water;\n(16) regulation of uses of water surfaces; and\n(17) identification of high priority regions for wetland preservation, enhancement, restoration, and establishment.",
	"repealed": false
}