{
	"id": "123B.78",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.78",
	"title": "123B.78 CASH FLOW; SCHOOL DISTRICT REVENUES; BORROWING FOR CURRENT OPERATING COSTS; CAPITAL EXPENDITURE DEFICITS.",
	"text": "The commissioner of management and budget shall remit all payments of state aids to districts in conformance with the dates provided by law or, when not so provided, with a schedule of aid payments to be established by the commissioner of education in consultation with other affected state agencies.\nThe auditors or finance officers of Minnesota counties shall remit all payments of taxes to the districts in conformance with the provisions of section 276.11. Districts which have need for tax remittance advances may secure them from the counties by making formal requests in conformance with section 276.11.\nMinnesota school districts may issue tax and aid anticipation certificates in conformance with the provisions of sections 126C.50 to 126C.56, with the additional provision that the proceeds of such borrowing or any other method of borrowing shall be recorded as liabilities of funds for which the taxes were levied, or for which the aids are receivable. Nothing in this subdivision provides authority for borrowing against the tax levies and aids of one district fund for the purpose of increasing the available cash balance of another fund.\nUnless otherwise provided by law, a district must not, for the purpose of increasing the available cash balance of another fund, borrow or transfer funds from the building construction fund, debt redemption fund, trust and agency fund, or from any sinking fund for outstanding bonds issued for any purpose. However, if the contemplated use for which funds were originally placed in the building construction fund or a sinking fund is afterwards abandoned or if a balance remains after the use is accomplished, a district may devote these funds as provided in section 475.65. For the purpose of insuring fund integrity, on determining that a district is in violation of this subdivision or section 123B.75, the commissioner shall require that such district maintain separate bank accounts for building construction funds, debt redemption funds, trust and agency funds, and sinking funds for outstanding bonds. Nothing in this subdivision shall be construed to prohibit the use of common bank accounts for other funds unless prohibited by law.\nUpon approval by the commissioner, a district may incur a deficit in the reserve for operating capital account for a period not to exceed three years to provide money for capital projects. The commissioner shall approve a description of the project and a financial plan to recover the deficit prior to the initiation of the project.",
	"repealed": false
}