{
	"id": "282.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.01",
	"title": "282.01 TAX-FORFEITED LANDS; CLASSIFICATION, SALE.",
	"text": "(a) When acting on behalf of the state under laws allowing the county board to classify and manage tax-forfeited lands held by the state in trust for the local units as provided in section 281.25, the county board has the discretion to decide that some lands in public ownership should be retained and managed for public benefits while other lands should be returned to private ownership. Parcels of land becoming the property of the state in trust under law declaring the forfeiture of lands to the state for taxes must be classified by the county board of the county in which the parcels lie as conservation or nonconservation. In making the classification the board shall consider the present use of adjacent lands, the productivity of the soil, the character of forest or other growth, accessibility of lands to established roads, schools, and other public services, their peculiar suitability or desirability for particular uses, and the suitability of the forest resources on the land for multiple use and sustained yield management. The classification, furthermore, must: (1) encourage and foster a mode of land utilization that will facilitate the economical and adequate provision of transportation, roads, water supply, drainage, sanitation, education, and recreation; (2) facilitate reduction of governmental expenditures; (3) conserve and develop the natural resources; and (4) foster and develop agriculture and other industries in the districts and places best suited to them.\n(b) Whenever the county board deems it appropriate, the board may hold a meeting for the purpose of reclassifying tax-forfeited land that has not been sold or released from the trust. The criteria and procedures for reclassification are the same as those required for an initial classification.\n(c) Prior to meeting for the purpose of classifying or reclassifying tax-forfeited lands, the county board must give notice of its intent to meet for that purpose as provided in this paragraph. The notice must be given no more than 90 days and no less than 60 days before the date of the meeting; provided that if the meeting is rescheduled, notice of the new date, time, and location must be given at least 14 days before the date of the rescheduled meeting. The notice must be posted on a website. The notice must also be mailed or otherwise delivered to each person who has filed a request for notice of special meetings with the public body, regardless of whether the matter is considered at a regular or special meeting. The notice must be mailed or delivered at least 60 days before the date of the meeting. If the meeting is rescheduled, notice of the new date, time, and location must be mailed or delivered at least 14 days before the date of the rescheduled meeting. The public body shall publish the notice once, at least 30 days before the meeting, in a newspaper of general circulation within the area of the public body's authority. The board must also mail a notice by electronic means to each person who requests notice of meetings dealing with this subject and who agrees as provided in chapter 325L to accept notice that is mailed by electronic means. Receipt of actual notice under the conditions specified in section 13D.04, subdivision 7, satisfies the notice requirements of this paragraph.\nThe board may classify or reclassify tax-forfeited lands at any regular or special meeting, as those terms are defined in chapter 13D and may conduct only this business, or this business as well as other business or activities at the meeting.\n(d) At the meeting, the county board must allow any person or agency possessing pertinent information to make or submit comments and recommendations about the pending classification or reclassification. In addition, representatives of governmental entities in attendance must be allowed to describe plans, ideas, or projects that may involve use or acquisition of the property by that or another governmental entity. The county board must solicit and consider any relevant components of current municipal or metropolitan comprehensive land use plans that incorporate the area in which the land is located. After allowing testimony, the board may classify, reclassify, or delay taking action on any parcel or parcels. In order for a state agency or a governmental subdivision of the state to preserve its right to request a purchase or other acquisition of a forfeited parcel, it may, at any time following forfeiture, file a written request to withhold the parcel from sale or lease to others under the provisions of subdivision 1a.\n(e) When classifying, reclassifying, appraising, and selling lands under this chapter, the county board may designate the tracts as assessed and acquired, or may by resolution provide for the subdivision of the tracts into smaller units or for the grouping of several tracts into one tract when the subdivision or grouping is deemed advantageous for conservation or sale purposes. This paragraph does not authorize the county board to subdivide a parcel or tract of tax-forfeited land that, as assessed and acquired, is withheld from sale under section 282.018, subdivision 1.\n(f) A county board may by resolution elect to use the classification and reclassification procedures provided in paragraphs (g), (h), and (i), instead of the procedures provided in paragraphs (b), (c), and (d). Once an election is made under this paragraph, it is effective for a minimum of five years.\n(g) The classification or reclassification of tax-forfeited land that has not been sold or released from the trust may be made by the county board using information made available to it by any office or department of the federal, state, or local governments, or by any other person or agency possessing pertinent information at the time the classification is made.\n(h) If the lands are located within the boundaries of an organized town or incorporated municipality, a classification or reclassification and sale must first be approved by the town board of the town or the governing body of the municipality in which the lands are located. The town board of the town or the governing body of the municipality is considered to have approved the classification or reclassification and sale if the county board is not notified of the disapproval of the classification or reclassification and sale within 60 days of the date the request for approval was transmitted to the town board of the town or governing body of the municipality. If the town board or governing body disapproves of the classification or reclassification and sale, the county board must follow the procedures in paragraphs (c) and (d), with regard to the parcel, and must additionally cause to be published in a newspaper a notice of the date, time, location, and purpose of the required meeting.\n(i) If a town board or a governing body of a municipality or a park and recreation board in a city of the first class desires to acquire any parcel lying in the town or municipality by procedures authorized in this section, it may file a written request under subdivision 1a, paragraph (a).\n(a) Upon written request from a state agency or a governmental subdivision of the state, a parcel of unsold tax-forfeited land must be withheld from sale or lease to others for a maximum of six months. The request must be submitted to the county auditor. Upon receipt, the county auditor must withhold the parcel from sale or lease to any other party for six months, and must confirm the starting date of the six-month withholding period to the requesting agency or subdivision. If the request is from a governmental subdivision of the state, the governmental subdivision must pay the maintenance costs incurred by the county during the period the parcel is withheld. The county board may approve a sale or conveyance to the requesting party during the withholding period. A conveyance of the property to the requesting party terminates the withholding period.\nA governmental subdivision of the state must not make, and a county auditor must not act upon, a second request to withhold a parcel from sale or lease within 18 months of a previous request for that parcel. A county may reject a request made under this paragraph if the request is made more than 30 days after the county has given notice to the requesting state agency or governmental subdivision of the state that the county intends to sell or otherwise dispose of the property.\n(b) Nonconservation tax-forfeited lands may be sold by the county board, for their market value as determined by the county board, to an organized or incorporated governmental subdivision of the state for any public purpose for which the subdivision is authorized to acquire property. When the term \"market value\" is used in this section, it means an estimate of the full and actual market value of the parcel as determined by the county board, but in making this determination, the board and the persons employed by or under contract with the board in order to perform, conduct, or assist in the determination, are exempt from the licensure requirements of chapter 82B.\n(c) Nonconservation tax-forfeited lands may be sold by the county board, for their market value as determined by the county board, to a state agency for any public purpose for which the agency is authorized to acquire property.\n(d) Nonconservation tax-forfeited lands may be sold by the county board to an organized or incorporated governmental subdivision of the state or state agency for less than their market value if:\n(1) the county board determines that a sale at a reduced price is in the public interest because a reduced price is necessary to provide an incentive to correct the blighted conditions that make the lands undesirable in the open market, or the reduced price will lead to the development of affordable housing; and\n(2) the governmental subdivision or state agency has documented its specific plans for correcting the blighted conditions or developing affordable housing, and the specific law or laws that empower it to acquire real property in furtherance of the plans.\nIf the sale under this paragraph is to a governmental subdivision of the state, the commissioner of revenue must convey the property on behalf of the state by quitclaim deed. If the sale under this paragraph is to a state agency, the property is released from the trust in favor of the taxing districts and the commissioner of revenue must convey the property on behalf of the state by quitclaim deed to the agency.\n(e) Nonconservation tax-forfeited land held in trust in favor of the taxing districts may be conveyed by the commissioner of revenue in the name of the state to a governmental subdivision for an authorized public use, if an application is submitted to the commissioner which includes a statement of facts as to the use to be made of the tract and the favorable recommendation of the county board. For the purposes of this paragraph, \"authorized public use\" means a use that allows an indefinite segment of the public to physically use and enjoy the property in numbers appropriate to its size and use, or is for a public service facility. Authorized public uses as defined in this paragraph are limited to:\n(1) a road, or right-of-way for a road;\n(2) a park that is both available to, and accessible by, the public that contains improvements such as campgrounds, playgrounds, athletic fields, trails, or shelters;\n(3) trails for walking, bicycling, snowmobiling, or other recreational purposes, along with a reasonable amount of surrounding land maintained in its natural state;\n(4) transit facilities for buses, light rail transit, commuter rail or passenger rail, including transit ways, park-and-ride lots, transit stations, maintenance and garage facilities, and other facilities related to a public transit system;\n(5) public beaches or boat launches;\n(6) public parking;\n(7) civic recreation or conference facilities; and\n(8) public service facilities such as fire halls, police stations, lift stations, water towers, sanitation facilities, water treatment facilities, and administrative offices.\nNo monetary compensation or consideration is required for the conveyance, except as provided in subdivision 1g, but the conveyance is subject to the conditions provided in law, including, but not limited to, the reversion provisions of subdivisions 1c and 1d.\n(f) The commissioner of revenue shall convey a parcel of nonconservation tax-forfeited land to a local governmental subdivision of the state by quitclaim deed on behalf of the state upon the favorable recommendation of the county board if the governmental subdivision has certified to the board that prior to forfeiture the subdivision was entitled to the parcel under a written development agreement or instrument, but the conveyance failed to occur prior to forfeiture. No compensation or consideration is required for, and no conditions attach to, the conveyance.\n(g) The commissioner of revenue shall convey a parcel of nonconservation tax-forfeited land to the association of a common interest community by quitclaim deed upon the favorable recommendation of the county board if the association certifies to the board that prior to forfeiture the association was entitled to the parcel under a written agreement, but the conveyance failed to occur prior to forfeiture. No compensation or consideration is required for, and no conditions attach to, the conveyance.\n(h) Conservation tax-forfeited land may be sold to a governmental subdivision of the state for less than its market value for either: (1) creation or preservation of wetlands; (2) drainage or storage of stormwater under a stormwater management plan; or (3) preservation, or restoration and preservation, of the land in its natural state. The deed must contain a restrictive covenant limiting the use of the land to one of these purposes for 30 years or until the property is reconveyed back to the state in trust. At any time, the governmental subdivision may reconvey the property to the state in trust for the taxing districts. The deed of reconveyance is subject to approval by the commissioner of revenue. No part of a purchase price determined under this paragraph shall be refunded upon a reconveyance, but the amount paid for a conveyance under this paragraph may be taken into account by the county board when setting the terms of a future sale of the same property to the same governmental subdivision under paragraph (b) or (d). If the lands are unplatted and located outside of an incorporated municipality and the commissioner of natural resources determines there is a mineral use potential, the sale is subject to the approval of the commissioner of natural resources.\n(i) A park and recreation board in a city of the first class is a governmental subdivision for the purposes of this section.\n(j) Tax-forfeited land held in trust in favor of the taxing districts may be conveyed by the commissioner of revenue in the name of the state to a governmental subdivision for a school forest under section 89.41. An application that includes a statement of facts as to the use to be made of the tract and the favorable recommendation of the county board and the commissioner of natural resources must be submitted to the commissioner of revenue. No monetary compensation or consideration is required for the conveyance, but the conveyance is subject to the conditional use and reversion provisions of subdivisions 1c and 1d, paragraph (e). At any time, the governmental subdivision may reconvey the property back to the state in trust for the taxing districts. The deed of reconveyance is subject to approval by the commissioner of revenue.\nNotwithstanding subdivision 1a, in the case of tax-forfeited lands located in a targeted community in a city of the first class, the commissioner of revenue shall convey by quitclaim deed in the name of the state any tract of tax-forfeited land held in trust in favor of the taxing districts, to a political subdivision of the state that submits an application to the commissioner of revenue and the favorable recommendation of the county board. For purposes of this subdivision, the term \"targeted community\" has the meaning given in section 469.201, subdivision 10, except that the land must be located within a first class city.\nThe deed conveying property for an authorized public use under the authorities in this section, must be on a form approved by the attorney general and must be conditioned on continued use of the property for the purpose stated in the application as provided in this section. All deeds conveying property for an authorized public use, regardless of when executed, are conditional use deeds that convey a defeasible estate. Reversion of the estate occurs by operation of law and without the requirement for any affirmative act by or on behalf of the state when there is a failure to put the property to the approved authorized public use for which it was conveyed, or an abandonment of that use, except as provided in subdivision 1d.\n(a) After three years from the date of any conveyance of tax-forfeited land to a governmental subdivision for an authorized public use as provided in this section, regardless of when the deed for the authorized public use was executed, if the governmental subdivision has failed to put the land to that use, or abandons that use, the governing body of the subdivision must: (1) with the approval of the county board, purchase the property for an authorized public purpose at the present market value as determined by the county board, or (2) authorize the proper officers to convey the land, or the part of the land not required for an authorized public use, to the state of Minnesota in trust for the taxing districts. If the governing body purchases the property under clause (1), the commissioner of revenue shall, upon proper application submitted by the county auditor and upon the reconveyance of the land subject to the conditional use deed to the state, convey the property on behalf of the state by quitclaim deed to the subdivision free of a use restriction and the possibility of reversion or defeasement. If the governing body decides to reconvey the property to the state under this clause, the officers shall execute a deed of conveyance immediately. The conveyance is subject to the approval of the commissioner and its form must be approved by the attorney general. For 15 years from the date of the conveyance, there is no failure to put the land to the authorized public use and no abandonment of that use if a formal plan of the governmental subdivision, including, but not limited to, a comprehensive plan or land use plan, shows an intended future use of the land for the authorized public use.\n(b) Property held by a governmental subdivision of the state under a conditional use deed executed under this section by the commissioner of revenue on or after January 1, 2007, may be acquired by that governmental subdivision after 15 years from the date of the conveyance if the commissioner determines upon written application from the subdivision that the subdivision has in fact put the property to the authorized public use for which it was conveyed, and the subdivision has made a finding that it has no current plans to change the use of the lands. Prior to conveying the property, the commissioner shall inquire whether the county board where the land is located objects to a conveyance of the property to the subdivision without conditions and without further act by or obligation of the subdivision. If the county does not object within 60 days, and the commissioner makes a favorable determination, the commissioner shall issue a quitclaim deed on behalf of the state unconditionally conveying the property to the governmental subdivision. For purposes of this paragraph, demonstration of an intended future use for the authorized public use in a formal plan of the governmental subdivision does not constitute use for that authorized public use.\n(c) Property held by a governmental subdivision of the state under a conditional use deed executed under this section by the commissioner of revenue before January 1, 2007, is released from the use restriction and possibility of reversion on January 1, 2022, if the county board records a resolution describing the land and citing this paragraph. The county board may authorize the county treasurer to deduct the amount of the recording fees from future settlements of property taxes to the subdivision.\n(d) Except for tax-forfeited land conveyed to establish a school forest under section 89.41, property conveyed under a conditional use deed executed under this section by the commissioner of revenue, regardless of when the deed for the authorized public use was executed, is released from the use restriction and reverter, and any use restriction or reverter for which no declaration of reversion has been recorded with the county recorder or registrar of titles, as appropriate, is nullified on the later of: (1) January 1, 2015; (2) 30 years from the date the deed was acknowledged; or (3) final resolution of an appeal to district court under subdivision 1e, if a lis pendens related to the appeal is recorded in the office of the county recorder or registrar of titles, as appropriate, prior to January 1, 2015.\n(e) Notwithstanding paragraphs (a) to (d), tax-forfeited land conveyed to establish a school forest under section 89.41 is subject to a perpetual conditional use deed and reverter. The property reverts to the state in trust for the taxing districts by operation of law if the commissioner of natural resources determines and reports to the commissioner of revenue under section 89.41, subdivision 3, that the governmental subdivision has failed to use the land for school forest purposes for three consecutive years. The commissioner of revenue shall record a declaration of reversion for land that has reverted under this paragraph.\nIf the tax-forfeited land is not either purchased or conveyed to the state in accordance with subdivision 1d, the commissioner of revenue shall by written instrument, in form approved by the attorney general, declare the land to have reverted to the state, and shall serve a notice of reversion, with a copy of the declaration, by certified mail upon the clerk or recorder of the governmental subdivision concerned. No declaration of reversion under this subdivision shall be made earlier than 60 days after the expiration of the three-year period described in subdivision 1d. The commissioner shall file the original declaration in the commissioner's office, with verified proof of service. The governmental subdivision may appeal to the district court of the county in which the land lies by filing with the court administrator a notice of appeal, specifying the grounds of appeal and the description of the land involved, mailing a copy of the notice of appeal by certified mail to the commissioner of revenue, and filing a copy for record with the county recorder or registrar of titles, all within 30 days after the mailing of the notice of reversion. The appeal shall be tried by the court in like manner as a civil action. If no appeal is taken as provided in this subdivision, the declaration of reversion is final. The commissioner of revenue shall file for record with the county recorder or registrar of titles, of the county within which the land lies, a certified copy of the declaration of reversion and proof of service.\nA city of the first class with a population of 450,000, or over, or its board of park commissioners, which has acquired tax-forfeited land for a specified public use under this section, may convey the land in exchange for other land of substantially equal worth located in the city. The land conveyed to the city, or its board of park commissioners, in exchange is subject to the public use and reversionary provisions of this section. The tax-forfeited land so conveyed is thereafter free from the public use and reversionary provisions of this section. The exchange shall in no way affect the mineral rights of the state of Minnesota, if any, in the lands exchanged.\n(a) A governmental subdivision of the state applying for a conditional use deed under subdivision 1a, paragraph (e), must submit a fee of $250 to the commissioner of revenue along with the application. If the application is denied, the commissioner shall refund $150 of the application fee.\n(b) The proceeds from the fees must be deposited in a Department of Revenue conditional use deed revolving fund. The sums deposited into the revolving fund are appropriated to the commissioner of revenue for the purpose of making the refunds described in this subdivision and administering conditional use deed laws.\nThe instruments of conveyance executed and issued by the commissioner of revenue under subdivision 1a, paragraphs (c), (d), (e), (f), (g), and (h), and subdivision 1d, paragraph (b), must be on a form approved by the attorney general and are prima facie evidence of the facts stated therein and that the execution and issuance of the conveyance complies with the applicable laws.\n(a) Lands classified as conservation lands must be held under the supervision of the county board of the county within which the parcels lie and must not be conveyed or sold unless the lands are:\n(1) reclassified as nonconservation lands;\n(2) conveyed to a governmental subdivision of the state under subdivision 1a;\n(3) released from the trust in favor of the taxing districts as provided in paragraph (b); or\n(4) conveyed or sold under the authority of another general or special law.\n(b) The county board may, by resolution duly adopted, resolve that certain lands classified as conservation lands shall be devoted to conservation uses and may submit a resolution to the commissioner of natural resources. If, upon investigation, the commissioner of natural resources determines that the lands covered by the resolution, or any part thereof, can be managed and developed for conservation purposes, the commissioner shall make a certificate describing the lands and reciting the acceptance thereof on behalf of the state. The commissioner shall transmit the certificate to the county auditor, who shall note the same upon the auditor's records and record the same with the county recorder. The title to all lands so accepted shall be held by the state free from any trust in favor of any and all taxing districts and the lands shall be devoted thereafter to the purposes of forestry, water conservation, flood control, parks, game refuges, controlled game management areas, public shooting grounds, or other public recreational or conservation uses, and managed, controlled, and regulated under the jurisdiction of the commissioner of natural resources and the divisions of the department.\n(c) All proceeds derived from the sale of timber, lease of crops of hay, or other revenue from lands under the jurisdiction of the commissioner of natural resources shall be credited to the general fund of the state.\n(d) If the commissioner of natural resources determines that any tract of land acquired by the state under paragraph (b) and situated within or adjacent to the boundaries of any governmental subdivision of the state is suitable for use by the subdivision for any authorized public purpose, the commissioner may convey the tract by deed in the name of the state to the subdivision upon the filing with the commissioner of a resolution adopted by a majority vote of all the members of the governing body thereof, stating the purpose for which the land is desired. The deed of conveyance shall be upon a form approved by the attorney general and must be conditioned upon continued use for the purpose stated in the resolution.\n(e) The county auditor, with the approval of the county board, may lease conservation lands remaining under the supervision of the county board and sell timber and hay stumpage thereon in the manner hereinafter provided, and all proceeds derived therefrom shall be distributed in the same manner as provided in section 282.04.\n(a) All parcels of land classified as nonconservation, except those which may be reserved, shall be sold as provided, if it is determined, by the county board of the county in which the parcels lie, that it is advisable to do so, having in mind their accessibility, their proximity to existing public improvements, and the effect of their sale and occupancy on the public burdens. Any parcels of land proposed to be sold shall be first appraised by the county board of the county in which the parcels lie. The parcels may be reappraised whenever the county board deems it necessary to carry out the intent of sections 282.01 to 282.13.\n(b) In an appraisal the value of the land and any standing timber on it shall be separately determined. No parcel of land containing any standing timber may be sold until the appraised value of the timber on it and the sale of the land have been approved by the commissioner of natural resources. The commissioner shall base review of a proposed sale on the policy and considerations specified in subdivision 1. The decision of the commissioner shall be in writing and shall state the reasons for it. The commissioner's decision is exempt from the rulemaking provisions of chapter 14 and section 14.386 does not apply. The county may appeal the decision of the commissioner in accordance with chapter 14.\n(c) In any county in which a state forest or any part of it is located, the county auditor shall submit to the commissioner at least 60 days before the first publication of the list of lands to be offered for sale a list of all lands included on the list which are situated outside of any incorporated municipality. If, at any time before the opening of the sale, the commissioner notifies the county auditor in writing that there is standing timber on any parcel of land, the parcel shall not be sold unless the requirements of this section respecting the separate appraisal of the timber and the approval of the appraisal by the commissioner have been complied with. The commissioner may waive the requirement of the 60-day notice as to any parcel of land which has been examined and the timber value approved as required by this section.\n(d) If any public improvement is made by a municipality after any parcel of land has been forfeited to the state for the nonpayment of taxes, and the improvement is assessed in whole or in part against the property benefited by it, the clerk of the municipality shall certify to the county auditor, immediately upon the determination of the assessments for the improvement, the total amount that would have been assessed against the parcel of land if it had been subject to assessment; or if the public improvement is made, petitioned for, ordered in or assessed, whether the improvement is completed in whole or in part, at any time between the appraisal and the sale of the parcel of land, the cost of the improvement shall be included as a separate item and added to the appraised value of the parcel of land at the time it is sold. No sale of a parcel of land shall discharge or free the parcel of land from lien for the special benefit conferred upon it by reason of the public improvement until the cost of it, including penalties, if any, is paid. The county board shall determine the amount, if any, by which the value of the parcel was enhanced by the improvement and include the amount as a separate item in fixing the appraised value for the purpose of sale.\n(a) The sale authorized under subdivision 3 must be conducted by the county auditor at the county seat of the county in which the parcels lie, except that in St. Louis and Koochiching Counties, the sale may be conducted in any designated facility within the county. The sale must not be for less than the appraised value except as provided in subdivision 7a. The parcels must be sold for cash only, unless the county board of the county has adopted a resolution providing for their sale on terms, in which event the resolution controls with respect to the sale. When the sale is made on terms other than for cash only (1) a payment of at least ten percent of the purchase price must be made at the time of purchase, and the balance must be paid in no more than ten equal annual installments, or (2) the payments must be made in accordance with county board policy, but in no event may the board require more than 12 installments annually, and the contract term must not be for more than ten years. Standing timber or timber products must not be removed from these lands until an amount equal to the appraised value of all standing timber or timber products on the lands at the time of purchase has been paid by the purchaser. If a parcel of land bearing standing timber or timber products is sold at public auction for more than the appraised value, the amount bid in excess of the appraised value must be allocated between the land and the timber in proportion to their respective appraised values. In that case, standing timber or timber products must not be removed from the land until the amount of the excess bid allocated to timber or timber products has been paid in addition to the appraised value of the land. The purchaser is entitled to immediate possession, subject to the provisions of any existing valid lease made in behalf of the state.\n(b) For sales occurring on or after July 1, 1982, the unpaid balance of the purchase price is subject to interest at the rate determined pursuant to section 549.09. The unpaid balance of the purchase price for sales occurring after December 31, 1990, is subject to interest at the rate determined in section 279.03, subdivision 1a. The interest rate is subject to change each year on the unpaid balance in the manner provided for rate changes in section 549.09 or 279.03, subdivision 1a, whichever, is applicable. Interest on the unpaid contract balance on sales occurring before July 1, 1982, is payable at the rate applicable to the sale at the time that the sale occurred.\n(c) Notwithstanding subdivision 7, a county board may by resolution provide for the listing and sale of individual parcels by other means, including through a real estate broker. However, if the buyer under this paragraph could have repurchased a parcel of property under section 282.012 or 282.241, that buyer may not purchase that same parcel of property at the sale under this subdivision for a purchase price less than the sum of all taxes, assessments, penalties, interest, and costs due at the time of forfeiture computed under section 282.251, and any special assessments for improvements certified as of the date of sale. This subdivision shall be liberally construed to encourage the sale and utilization of tax-forfeited land in order to eliminate nuisances and dangerous conditions and to increase compliance with land use ordinances.\nWhen sales hereafter are made on terms the purchaser shall receive a certificate from the county auditor in such form, consistent with the provisions of sections 282.01 to 282.13 and setting forth the terms of sale, as may be prescribed by the attorney general. Failure of the purchaser or any person claiming under the purchaser, to pay any of the deferred installments with interest, or the current taxes, or to comply with any conditions that may have been stipulated in the notice of sale or in the auditor's certificate herein provided for, shall constitute default; and the state may, by order of the county board, during the continuance of such default, declare such certificate canceled and take possession of such lands and may thereafter resell or lease the same in the same manner and under the same rules as other lands forfeited to the state for taxes are sold or leased. When the county board shall have adopted a resolution ordering the cancellation of such certificate or certificates and the cancellation shall have been completed in accord with section 282.40, then a reentry shall be deemed to have been made on the part of the state without any other act or deed, and without any right of redemption by the purchaser or any one claiming under the purchaser; and the original purchaser in default or any person claiming under the original purchaser, who shall remain in possession or enter thereon shall be deemed a willful trespasser and shall be punished as such.\nWhen the cancellation of such certificate has been completed the county auditor shall cancel all taxes and tax liens, delinquent and current, and special assessments, delinquent or otherwise, imposed upon the lands described in the certificate after its issuance.\n(a) When any sale has been made by the county auditor under sections 282.005 to 282.13, the auditor shall immediately certify to the commissioner of revenue such information relating to such sale, on such forms as the commissioner of revenue may prescribe as will enable the commissioner of revenue to prepare an appropriate deed if the sale is for cash, or keep necessary records if the sale is on terms; and not later than October 31 of each year the county auditor shall submit to the commissioner of revenue a statement of all instances wherein any payment of principal, interest, or current taxes on lands held under certificate, due or to be paid during the preceding calendar years, are still outstanding at the time such certificate is made. When such statement shows that a purchaser or the purchaser's assignee is in default, the commissioner of revenue may instruct the county board of the county in which the land is located to cancel said certificate of sale in the manner provided by subdivision 5, provided that upon recommendation of the county board, and where the circumstances are such that the commissioner of revenue after investigation is satisfied that the purchaser has made every effort reasonable to make payment of both the annual installment and said taxes, and that there has been no willful neglect on the part of the purchaser in meeting these obligations, then the commissioner of revenue may extend the time for the payment for such period as the commissioner may deem warranted, not to exceed one year. On payment in full of the purchase price, appropriate conveyance in fee, in such form as may be prescribed by the attorney general, shall be issued by the commissioner of revenue, which conveyance must be recorded by the county and shall have the force and effect of a patent from the state subject to easements and restrictions of record at the date of the tax judgment sale, including, but without limitation, permits for telephone and electric power lines either by underground cable or conduit or otherwise, sewer and water lines, highways, railroads, and pipe lines for gas, liquids, or solids in suspension.\n(b) The commissioner of revenue shall issue an appropriate conveyance in fee when approval from the county auditor is given based upon written confirmation from a licensed closing agent, title insurer, or title insurance agent as specified in section 82.641. For purposes of this paragraph, \"written confirmation\" means a written commitment or approval that the funding for the conveyance is held in an escrow account available for disbursement upon delivery of a conveyance. The county recorder or registrar of titles must not record or file a conveyance issued under this paragraph unless the conveyance contains a certification signed by the county auditor where the land is located stating that the recorder or registrar of titles can accept the conveyance for recording or filing. The conveyance issued by the commissioner of revenue shall not be effective as a conveyance until it is recorded. The conveyance shall be issued to the county auditor where the land is located. Upon receipt of the conveyance, the county auditor shall hold the conveyance until the conveyance is requested from a licensed closing agent, title insurer, or title insurance agent to settle and close on the conveyance. If a request for the conveyance is not made within 30 days of the date the conveyance is issued by the commissioner of revenue, the county auditor shall return the conveyance to the commissioner. If the conveyance is delivered to the licensed closing agent, title insurer, or title insurance agent and the closing does not occur within ten days of the request, the licensed closing agent, title insurer, or title insurance agent shall immediately return the conveyance to the county auditor and, upon receipt, the county auditor shall return the conveyance to the commissioner of revenue. The commissioner of revenue shall cancel and destroy all conveyances returned by the county auditor pursuant to this subdivision. The licensed closing agent, title insurer, or title insurance agent must promptly record the conveyance after the closing and must deliver an attested or certified copy to the county auditor and to the grantee or grantees named on the conveyance.\nThe sale must commence at the time determined by the county board of the county in which the parcels are located. The county auditor shall offer the parcels of land in order in which they appear in the notice of sale, and shall sell them to the highest bidder, but not for a sum less than the appraised value, until all of the parcels of land have been offered. Then the county auditor shall sell any remaining parcels to anyone offering to pay the appraised value, except that if the person could have repurchased a parcel of property under section 282.012 or 282.241, that person may not purchase that same parcel of property at the sale under this subdivision for a purchase price less than the sum of all taxes, assessments, penalties, interest, and costs due at the time of forfeiture computed under section 282.251, and any special assessments for improvements certified as of the date of sale. The sale must continue until all the parcels are sold or until the county board orders a reappraisal or withdraws any or all of the parcels from sale. The list of lands may be added to and the added lands may be sold at any time by publishing the descriptions and appraised values. The added lands must be: (1) parcels of land that have become forfeited and classified as nonconservation since the commencement of any prior sale; (2) parcels classified as nonconservation that have been reappraised; (3) parcels that have been reclassified as nonconservation; or (4) other parcels that are subject to sale but were omitted from the existing list for any reason. The descriptions and appraised values must be published in the same manner as provided for the publication of the original list. Parcels added to the list must first be offered for sale to the highest bidder before they are sold at appraised value. All parcels of land not offered for immediate sale, as well as parcels that are offered and not immediately sold, continue to be held in trust by the state for the taxing districts interested in each of the parcels, under the supervision of the county board. Those parcels may be used for public purposes until sold, as directed by the county board.\nLand located in a home rule charter or statutory city, or in a town which cannot be improved because of noncompliance with local ordinances regarding minimum area, shape, frontage or access may be sold by the county auditor pursuant to this subdivision if the auditor determines that a nonpublic sale will encourage the approval of sale of the land by the city or town and promote its return to the tax rolls. If the physical characteristics of the land indicate that its highest and best use will be achieved by combining it with an adjoining parcel and the city or town has not adopted a local ordinance governing minimum area, shape, frontage, or access, the land may also be sold pursuant to this subdivision. If the property consists of an undivided interest in land or land and improvements, the property may also be sold to the other owners under this subdivision. The sale of land pursuant to this subdivision shall be subject to any conditions imposed by the county board pursuant to section 282.03. The governing body of the city or town may recommend to the county board conditions to be imposed on the sale. The county auditor may restrict the sale to owners of lands adjoining the land to be sold. The county auditor shall conduct the sale by sealed bid or may select another means of sale. The land shall be sold to the highest bidder and may be sold for less than its appraised value. All owners of land adjoining the land to be sold shall be given a written notice at least 30 days prior to the sale.\nThis subdivision shall be liberally construed to encourage the sale and utilization of tax-forfeited land, to eliminate nuisances and dangerous conditions and to increase compliance with land use ordinances.\nIn case the commissioner of natural resources shall notify the county auditor of any county in writing that the minerals in any tax-forfeited land or tax-forfeited stockpiled metallic minerals material located on tax-forfeited land in such county have been designated as a mining unit as provided by law, or that such minerals or tax-forfeited stockpiled metallic minerals material are subject to a mining permit or lease issued therefor as provided by law, the surface of such tax-forfeited land shall be subject to disposal and use for mining purposes pursuant to such designation, permit, or lease, and shall be withheld from sale or lease by the county auditor until the commissioner shall notify the county auditor that such land has been removed from the list of mining units or that any mining permit or lease theretofore issued thereon is no longer in force; provided, that the surface of such tax-forfeited land may be leased by the county auditor as provided by law, with the written approval of the commissioner, subject to disposal and use for mining purposes as herein provided and to any special conditions relating thereto that the commissioner may prescribe, also subject to cancellation for mining purposes on three months written notice from the commissioner to the county auditor.\nMS 2008 [Repealed, 2010 c 389 art 9 s 14]\nMS 2008 [Repealed, 2010 c 389 art 9 s 14]\nMS 2008 [Repealed, 2010 c 389 art 9 s 14]\nIf a governmental subdivision that acquired a parcel for public use under this section later determines to change the use, it must hold a public hearing on the proposed use change. The governmental subdivision must mail written notice of the proposed use change and the public hearing to each owner of property that is within 400 feet of the parcel at least ten days and no more than 60 days before it holds the hearing. The notice must identify: (1) the parcel, (2) its current use, (3) the proposed use, (4) the date, time, and place of the public hearing, and (5) where to submit written comments on the proposal and that the public is invited to testify at the public hearing.\nA county board, or a county auditor if the auditor has been delegated such authority under section 282.135, may sell tax-forfeited lands through an online auction. When an online auction is used to sell tax-forfeited lands, the county auditor shall post a physical notice of the online auction and shall publish a notice of the online auction on its website not less than ten days before the online auction begins, in addition to any other notice required.",
	"repealed": false
}