{
	"id": "325E.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.66",
	"title": "325E.66 INSURANCE CLAIMS FOR RESIDENTIAL CONTRACTING GOODS AND SERVICES.",
	"text": "(a) A residential contractor providing home repair or improvement services to be paid by an insured from the proceeds of a property or casualty insurance policy shall not:\n(1) as an inducement to the sale or provision of goods or services to an insured, advertise or promise to pay, directly or indirectly, all or part of any applicable insurance deductible or offer to compensate an insured for providing any service to the insured. The prohibition under this clause includes but is not limited to offering compensation in exchange for:\n(i) allowing the residential contractor to conduct an inspection of the covered property;\n(ii) making an insurance claim for damage to the covered property; or\n(iii) referring the residential contractor's services to others when insurance proceeds are payable;\n(2) provide an insured with an agreement authorizing repairs without also providing a good faith estimate of the itemized and detailed cost of services and materials undertaken pursuant to a property and casualty claim; or\n(3) interpret policy provisions or advise an insured regarding coverages or duties under the insured's policy, or adjust a property insurance claim on behalf of the insured, unless the contractor has a license as a public adjuster under chapter 72B.\n(b) If a residential contractor violates this section, the insurer to whom the insured tendered the claim shall not be obligated to consider the estimate prepared by the residential contractor. The residential contractor must provide a written notification of the requirements of this section with its initial estimate. The adjuster or insurer must provide a written notification of the requirements of this section in the initial estimate relating to the claim.\n(c) For purposes of this section, \"residential contractor\" means a residential roofer, as defined in section 326B.802, subdivision 14; a residential building contractor, as defined in section 326B.802, subdivision 11; and a residential remodeler, as defined in section 326B.802, subdivision 12.\nIf a residential contractor violates subdivision 1, the insured or the applicable insurer may bring an action against the residential contractor in a court of competent jurisdiction for damages sustained by the insured or insurer as a consequence of the residential contractor's violation.\nThe commissioner of labor and industry shall enforce this section under sections 326B.081 to 326B.085.",
	"repealed": false
}