{
	"id": "515A.4-109",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.4-109",
	"title": "515A.4-109 RELEASE OF INTERESTS AS SECURITY FOR AN OBLIGATION.",
	"text": "(a) Before conveying a unit to a purchaser other than a declarant, the seller shall furnish to the purchaser releases for that unit and its common element interest of all interests as security for an obligation affecting more real estate than that unit and its common element interest, or if the purchaser expressly agrees, a policy of title insurance insuring against loss or damage by reason of such interests. Failure to furnish the releases does not of itself invalidate the lien or the conveyance. This subsection does not apply to conveyance of all of the units in the condominium or to deeds in lieu of foreclosure.\n(b) Whether perfected before or after creation of the condominium, if a lien other than a mortgage, including a lien attributable to work performed or materials supplied before creation of the condominium, becomes effective against two or more units, the unit owner of such a unit may pay to the lienholder the amount of the lien attributable to that owner's unit, and the lienholder, upon receipt of payment, shall promptly deliver a release of the lien covering that unit and its common element interest. The amount of the payment shall be proportionate to the ratio which that unit owner's common expense liability bears to the common expense liabilities of all unit owners whose units are subject to the lien. After payment, the association may not assess or have a lien against that unit owner's unit for any portion of the common expenses incurred in connection with that lien.\n(c) Labor performed or materials furnished for the common elements, if duly authorized by the association, shall be deemed to be performed or furnished with the express consent of each unit owner and shall be the basis for the filing of a lien pursuant to the lien law against each of the units and shall be subject to the provisions of subsection (b).",
	"repealed": false
}