{
	"id": "275.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.62",
	"title": "275.62 TAX LEVIES; REPORT TO THE COMMISSIONER OF REVENUE.",
	"text": "The commissioner of revenue shall establish procedures for the annual reporting of local government levies. Each local governmental unit shall submit a report to the commissioner by December 30 of the year in which the tax is levied. The report shall include, but is not limited to, information on the amount of the tax levied by the governmental unit for the following purposes:\n(1) social services and related programs, which include taxes levied for the purposes defined in Minnesota Statutes 1991 Supplement, section 275.50, subdivision 5, clauses (a), (j), and (v);\n(2) the amounts levied for each of the purposes listed in section 275.70, subdivision 5; and\n(3) other levies, which include the taxes levied for all purposes not included in clauses (1) or (2).\nFor purposes of this section, \"local governmental unit\" means a county, home rule charter or statutory city with a population greater than 2,500.\nFor the purposes of this section, the population of a local governmental unit shall be that established by the last federal census, by a census taken under section 275.14, or by an estimate made by the Metropolitan Council or by the state demographer made under section 4A.02, whichever is the most recent as to the stated date of count or estimate for the calendar year preceding the current levy year.\nIf a local government unit fails to submit the report required in subdivision 1 by January 30 of the year after the year in which the tax was levied, aid payments to the local governmental unit in the year after the year in which the tax was levied shall be reduced as follows:\n(1) for a county, the aid amount under chapter 256M shall be reduced by five percent; and\n(2) for other local governmental units, the aid certified to be received under sections 477A.011 to 477A.014 shall be reduced by five percent.",
	"repealed": false
}