{
	"id": "317A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.011",
	"title": "317A.011 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in this section have the meanings given them, unless the language or context clearly shows that a different meaning is intended.\n\"Address\" means mailing address, including a zip code, except that in the case of a registered office, address means the mailing address and the actual office location, which may not be a post office box.\n\"Articles\" means, in the case of a corporation incorporated under or governed by this chapter, articles of incorporation, articles of amendment, a resolution of election to become governed by this chapter, a statement of change of registered office, registered agent, or name of registered agent, articles of merger, articles of consolidation, articles of abandonment, and articles of dissolution. In the case of a foreign corporation, the term includes documents serving a similar function required to be filed with the secretary of state or other officer of the corporation's state of incorporation.\n\"Authenticated\" means, with respect to an electronic communication, that the communication is delivered to the principal place of business of the corporation, or to an officer or agent of the corporation authorized by the corporation to receive the communication, and that the communication sets forth information from which the corporation can reasonably conclude that the communication was sent by the purported sender.\n\"Ballot\" means a written ballot or a ballot transmitted by electronic communication.\n\"Board of directors\" or \"board\" means the group of persons vested with the general management of the internal affairs of a corporation, regardless of how they are identified.\n\"Bylaws\" means the code adopted for the regulation or management of the internal affairs of a corporation, regardless of how designated.\n\"Corporation\" means a corporation that is governed by this chapter. A corporation may not:\n(1) be formed for a purpose involving pecuniary gain to its members, other than to members that are nonprofit organizations or subdivisions, units, or agencies of the United States or a state or local government; and\n(2) pay dividends or other pecuniary remuneration, directly or indirectly, to its members, other than to members that are nonprofit organizations or subdivisions, units, or agencies of the United States or a state or local government.\n\"Director\" means a member of the board.\n\"Electronic communication\" means any form of communication, not directly involving the physical transmission of paper, that creates a record that may be retained, retrieved, and reviewed by a recipient of the communication, and that may be directly reproduced in paper form by the recipient through an automated process.\n\"Filed with the secretary of state\" means that a document meeting the requirements of this chapter, signed, and accompanied by a filing fee of $35, has been delivered to the secretary of state of this state. The secretary of state shall endorse on the original the word \"Filed\" and the month, day, and year of filing, record the document in the Office of the Secretary of State, and return a document to the person who delivered it for filing.\n\"Foreign corporation\" means a corporation that is formed under laws other than the laws of this state.\n\"Good faith\" means honesty in fact in the conduct of an act or transaction.\n\"Legal representative\" means a person empowered to act for another person, including, but not limited to, an agent, officer, partner, or associate of an organization; a trustee of a trust; a personal representative; a trustee in bankruptcy; or a receiver, guardian, custodian, or conservator.\n\"Member\" means a person with membership rights in a corporation under its articles or bylaws, regardless of how the person is identified.\n\"Members with voting rights\" means members or a class of members that has voting rights with respect to the purpose or matter involved.\n(a) \"Notice\" is given by a member of a corporation to the corporation or an officer of the corporation when in writing and mailed or delivered to the corporation or the officer at the registered office of the corporation.\n(b) Notice is given by the corporation to a director, officer, member, or other person:\n(1) when mailed to the person at an address designated by the person, at the last known address of the person or, in the case of a director, officer, or member, at the address of the person in the corporate records;\n(2) when communicated to the person orally;\n(3) when handed to the person;\n(4) when left at the office of the person with a clerk or other person in charge of the office, or if there is no one in charge, when left in a conspicuous place in the office;\n(5) if the person's office is closed or the person to be notified has no office, when left at the dwelling or usual place of abode of the person with a person of suitable age and discretion residing in the house;\n(6) when provided to the person by means of electronic communication as provided under section 317A.231 or 317A.450; or\n(7) when the method is fair and reasonable when all the circumstances are considered.\n(c) Notice by mail is given when deposited in the United States mail with sufficient postage. Notice is considered received when it is given.\n\"Officer\" means the president, the treasurer, however designated, a person elected, appointed, or otherwise designated as an officer pursuant to section 317A.311, and a person deemed elected an officer under section 317A.321.\n\"Organization\" means a domestic or foreign business or nonprofit corporation, limited liability company, whether domestic or foreign, partnership, limited partnership, joint venture, association, trust, estate, enterprise, or other legal or commercial entity.\n\"Registered office\" means the place in this state designated in the articles of a corporation as the registered office of the corporation.\n\"Related organization\" means an organization that controls, is controlled by, or is under common control with, another corporation. Control exists if an organization:\n(1) owns, directly or indirectly, at least 50 percent of the stock ownership or membership interests of another organization;\n(2) has the right, directly or indirectly, to elect, appoint, or remove 50 percent or more of the members with voting rights of the governing body of another organization; or\n(3) has the power, directly or indirectly, to direct or cause the direction of the management and policies of another organization, whether through the ownership of voting interests, by contract, or otherwise.\n\"Remote communication\" means communication via electronic communication, conference telephone, video conference, the Internet, or such other means by which persons not physically present in the same location may communicate with each other on a substantially simultaneous basis.\n(a) \"Signed\" means that the signature of a person is written on a document, as provided in section 645.44, subdivision 14. A document required by this chapter to be filed with the secretary of state must be signed by a person authorized to do so by this chapter, the articles or bylaws, or a resolution approved by the directors, as required by section 317A.237, or the members with voting rights, if any, if required by section 317A.443.\n(b) A signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.\n\"Written action\" means a record signed by all persons required to take the action or consented to by authenticated electronic communication by all persons required to take the action. The term also means the counterparts of a record signed or consented to by authenticated electronic communication by any of the persons taking the action. A counterpart is the action of the persons signing or consenting to it, and all counterparts are one written action by all persons signing or consenting to them.",
	"repealed": false
}