{
	"id": "260E.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.32",
	"title": "260E.32 TOXICOLOGY TESTS REQUIRED.",
	"text": "(a) A physician shall administer a toxicology test to a pregnant woman under the physician's care or to a woman under the physician's care within eight hours after delivery to determine whether there is evidence that she has ingested a controlled substance if the woman has obstetrical complications that are a medical indication of possible use of a controlled substance for a nonmedical purpose.\n(b) If the test results are positive, the physician shall report the results under section 260E.31. A negative test result does not eliminate the obligation to report under section 260E.31 if other evidence gives the physician reason to believe the patient has used a controlled substance for a nonmedical purpose.\n(a) A physician shall administer to each newborn infant born under the physician's care a toxicology test to determine whether there is evidence of prenatal exposure to a controlled substance if the physician has reason to believe, based on a medical assessment of the mother or the infant, that the mother used a controlled substance for a nonmedical purpose during pregnancy.\n(b) If the test results are positive, the physician shall report the results as neglect under section 260E.03. A negative test result does not eliminate the obligation to report under this chapter if other medical evidence of prenatal exposure to a controlled substance is present.\nPhysicians shall report to the Department of Health the results of tests performed under subdivisions 1 and 2. A report shall be made on the certificate of live birth medical supplement or the report of fetal death medical supplement. The reports are medical data under section 13.384.\nA positive test result reported under this section must be obtained from a confirmatory test performed by a drug testing laboratory that meets the requirements of section 181.953 and must be performed according to the requirements for performance of confirmatory tests imposed by the licensing, accreditation, or certification program listed in section 181.953, subdivision 1, in which the laboratory participates.",
	"repealed": false
}