{
	"id": "165.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/165.12",
	"title": "165.12 MAINTENANCE OF BRIDGE ON TOWN ROAD.",
	"text": "(a) Notwithstanding any law to the contrary, a county has the following authority regarding town bridges within its jurisdictional boundaries.\n(b) When it becomes necessary to reconstruct or repair a bridge on any town road in any town or upon any town line in this state, and the bridge is unsafe for travel or has been condemned by the proper authorities, and the town or towns charged with the duty of maintaining the bridge fail, neglect, or omit to construct, reconstruct, or repair the same or provide for the expense or cost of so constructing, reconstructing, or repairing the same, as identified in the report provided to the town or towns under section 165.03, subdivision 3, the county board of the county in which the town or towns are located shall have the power and authority to reconstruct and repair the bridge upon giving notice to the town board of the town or towns of its intention to do so and fixing a time and place for a hearing as to the necessity and advisability of the reconstruction or repair.\n(c) If a load rating analysis is required and has not been performed within 90 days of the date the report required in section 165.03, subdivision 3, was delivered to the town, the county is authorized to perform the analysis. Before it performs an analysis on a town bridge, the county shall notify the town or towns that if the town or towns do not perform the analysis within 90 days the county will perform the analysis and bill the town or towns for all related expenses. If the town performs the analysis, a copy shall be provided to the county engineer. If the county performs the analysis, a copy shall be provided to the town clerk.\n(d) If a load rating analysis determines a new or different load posting is required on a town bridge, the town or towns charged with the duty of maintaining the bridge shall provide the required posting within 30 days. If the town or towns fail to provide the required posting, the county is authorized to provide the required posting. Before posting a load limit on a town bridge, the county shall notify the town or towns that if the town or towns do not provide the posting within 30 days the county will provide the required posting and bill the town or towns for all related expenses, unless the town or towns and the county agree to post the bridge in less than 30 days and at an agreed-upon cost.\n(e) If a bridge constitutes a critical risk to public safety because its deficiencies, if not immediately corrected, could result in collapse or partial collapse, the county engineer is authorized to immediately close the bridge. The bridge shall remain closed until the necessary steps are taken to remove the threat of collapse or partial collapse, or until a subsequent inspection determines the issues resulting in closure are resolved. The county may bill the town or towns for all related expenses.\n(f) A county is not liable for a town's or towns' failure to act as required by this section or section 165.03.\nWhen any county shall have reconstructed or repaired any such bridge, the county board shall prepare an itemized statement of the cost thereof. The original shall be filed with the county auditor. Certified copies shall be filed with the clerk of the town or towns charged with the responsibility of maintaining the bridge. If two or more towns were responsible for the bridge the statement shall also show the portion of the cost apportioned to each town. The proportion of the cost to be apportioned to each town shall be determined at the hearing provided in subdivision 1.\nThe town clerk, upon receipt of the statement, shall forthwith notify the several members of the town board that a statement has been filed, and that a meeting of the town board to act thereon will be held at a time and place specified in the notice. The meeting shall be held not later than ten days after the filing of the statement. The town board shall meet at the time and place specified in the notice so given by the clerk, and shall levy a special tax upon all the taxable property of the town in an amount sufficient to pay one-half of the amount expended by the county. If two or more towns were responsible for the bridge, each town shall levy a tax in an amount sufficient to pay one-half of the cost apportioned to it.\nThe tax so levied shall be certified to the county auditor on or before October 15 next succeeding, and the county auditor shall extend the same with other town taxes upon the tax list of the town. If the town board, for any reason, fails to act as herein provided, the county auditor shall levy the tax provided herein and shall extend the same with other town taxes upon the tax list of the town.\nThe tax shall be collected and the payment enforced in the same manner and subject to the same penalties and interest as other town taxes. When collected the tax shall be paid into the county treasury and credited to the county road and bridge fund.",
	"repealed": false
}