{
	"id": "353E.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/353E.07",
	"title": "353E.07 SURVIVOR BENEFITS.",
	"text": "If a member or former member of the local government correctional service retirement plan who has attained the age of at least 50 years and who is vested under section 353.01, subdivision 47, dies before the annuity or disability benefit has become payable, notwithstanding any designation of beneficiary to the contrary, the surviving spouse may elect to receive, in lieu of a refund with interest provided in section 353.32, subdivision 1, a surviving spouse annuity equal to the 100 percent joint and survivor annuity for which the member could have qualified had the member terminated service on the date of death.\nIf the member was under age 50, dies, and was vested under section 353.01, subdivision 47, on the date of death but did not yet qualify for retirement, the surviving spouse may elect to receive a 100 percent joint and survivor annuity based on the age of the employee and the surviving spouse at the time of death. The annuity is payable using the early retirement reduction under section 353E.04, subdivision 4, to age 50 and one-half the early retirement reduction from age 50 to the age payment begins. Sections 353.34, subdivision 3, and 353.71, subdivision 2, apply to a deferred annuity or surviving spouse benefit payable under this subdivision.\nA surviving spouse election under subdivisions 1 and 2 may be made at any time after the date of death of a member. The surviving spouse benefit begins to accrue as of the first of the next month following the date on which the application for the benefit was filed.\nIn lieu of the 100 percent optional annuity under subdivision 1, the surviving spouse of a deceased member may elect to receive survivor coverage in a term certain of ten, 15, or 20 years. The monthly term certain annuity must be actuarially equivalent to the 100 percent optional annuity under subdivision 1 and must be based on tables approved by the actuary retained under section 356.214. The optional annuity ceases upon the expiration of the term certain period. If a survivor elects a term certain annuity and dies before the expiration of the specified term certain period, the commuted value of the remaining annuity payments must be paid in a lump sum to the survivor's estate.\nIf a deceased member has no surviving spouse eligible for benefits under subdivisions 1, 2, and 4, the member's dependent child as defined in section 353.01, subdivision 15, is eligible for a survivor benefit. Benefits to a dependent child must be paid from the date of the employee's death to the date the dependent child attains age 23. The payment to a dependent child is an amount actuarially equivalent to the value of a 100 percent joint and survivor optional annuity using the age of the member and the age of the dependent child at the date of the member's death in lieu of the age of the surviving spouse. If there is more than one dependent child, each dependent child must receive a proportionate share of the actuarial value of the 100 percent joint and survivor optional annuity, with the amount of the benefit payable to each child to be determined based on the portion of the total eligibility period that each child is eligible. The process for calculating the survivor benefit must be approved by the actuary retained under section 356.214.\nAn amount equal to any excess of the accumulated contributions that were credited to the account of the deceased employee over and above the total of the annuities paid and payable to the surviving spouse or dependent children must be paid to the deceased member's last designated beneficiary or, if none, to the legal representative of the estate of the deceased member.\nA member may specify in writing, with the signed consent of the spouse, that this section does not apply and that payment must be made only to the designated beneficiary, as otherwise provided by this chapter.\nA survivor benefit under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}