{
	"id": "31B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/31B.02",
	"title": "31B.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Commissioner\" means the commissioner of agriculture.\n\"Dealer\" means a person, other than a market agency in the business of buying or selling livestock, either on the person's own account or as the employee or agent of the vendor or purchaser.\n\"Livestock\" means live or dead cattle, sheep, swine, horses, mules, farmed Cervidae, as defined in section 35.153, subdivision 3, llamas, as defined in section 17.455, subdivision 2, Ratitae, as defined in section 17.453, subdivision 3, bison (buffalo), or goats.\n\"Livestock products\" means products and by-products other than meats and meat food products of the slaughtering and meat-packing industry derived in whole or in part from livestock.\n\"Market agency\" means a person engaged in the business of (1) buying or selling livestock on a commission basis, or (2) furnishing stockyard services and includes a person who sells or offers for sale livestock located in this state by satellite video auction.\n\"Meat food products\" means edible products and by-products of the slaughtering and meat-packing industry.\n\"Packer\" means a person in the business of (1) buying livestock for purposes of slaughter, (2) manufacturing or preparing meats or meat food products for sale or shipment, or (3) marketing meats, meat food products, or livestock products in an unmanufactured form acting as a wholesale broker, dealer, or distributor.\n\"Stockyard\" means a place, establishment, or facility commonly known as a stockyard conducted, operated, or managed for profit or nonprofit as a public market for livestock producers, feeders, market agencies, and buyers, consisting of pens, or other enclosures, and their appurtenances, in which live cattle, sheep, swine, horses, mules, or goats are received, held, or kept for sale or shipment.\n\"Stockyard owner\" means a person in the business of conducting or operating a stockyard.\n\"Stockyard services\" means services or facilities furnished at a stockyard in connection with the receiving, buying, or selling on a commission basis or otherwise, marketing, feeding, watering, holding, delivery, shipment, weighing, or handling of livestock.",
	"repealed": false
}