{
	"id": "282.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.19",
	"title": "282.19 COUNTY COLLECTS PAYMENTS; REPORTS; EXPENSES.",
	"text": "The county treasurer shall collect all payments made under sections 282.14 to 282.22 and place the same in a special fund and forthwith submit to the natural resources commissioner a copy of the receipt specifying the name and address of the person making the payment and the date and amount thereof, whether for principal, timber, improvements or interest, the fund to which it is applicable, and the number of the certificate. Such receipt shall be countersigned by the auditor of such county, and shall have the same force and effect as if given by the commissioner of management and budget. The county treasurer shall report all collections to the commissioner of natural resources on June 30 and December 31 of each year and at such other times when requested by the commissioner. There shall be transferred from such special fund to the revenue fund of the county the cost of giving the notices herein required and there may be paid from such fund to the members of the county board, upon warrant of the county auditor, a per diem pursuant to section 375.055, subdivision 1 and mileage as now or hereafter fixed by law, and to the county auditor and the county treasurer for their additional duties such sums as the county board may by resolution determine, not to exceed to each annually one percent of the annual receipts under sections 282.14 to 282.22, and to help to defray the costs of equipment and supplies, and for additional clerk hire in the county auditor's office such amount as the county board may by resolution determine, not to exceed annually ten percent of the annual receipts under sections 282.14 to 282.22, but in any event not to exceed the sum of $1,000 for equipment, supplies and clerk hire in any fiscal year. Where a county board has appointed a land commissioner under the provisions of section 282.13 the actual expenses of the land commissioner, together with mileage reimbursement in accordance with section 471.665 for necessary travel in gathering data and information to assist the county board in making classifications and appraisals under sections 282.14 to 282.22, shall be paid from this fund upon warrant of the county auditor. The amount remaining in the fund shall be transmitted by the county treasurer to the commissioner of natural resources as of June 30 and December 31 each year, and at such other times when requested by the commissioner, and disposed of as provided by the laws governing the fund derived from the respective areas in which the lands sold were situated.",
	"repealed": false
}