{
	"id": "85.018",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.018",
	"title": "85.018 TRAIL USE; VEHICLES REGULATED, RESTRICTED.",
	"text": "For the purposes of this section:\n(a) \"All-terrain vehicle\" has the meaning given in section 84.92, subdivision 8.\n(b) \"Commissioner\" means the commissioner of the state agency from which the grants-in-aid are received.\n(c) \"Off-road vehicle\" has the meaning given in section 84.797, subdivision 7.\n(d) \"Snowmobile\" has the meaning given in section 84.81, subdivision 3.\n(e) \"Trail\" means a recreational trail that is funded in whole or in part by state grants-in-aid to a local unit of government.\n(a) A local government unit that receives state grants-in-aid for any trail, with the concurrence of the commissioner, and the landowner or land lessee, may:\n(1) designate the trail for use by snowmobiles or for nonmotorized use from December 1 to April 1 of any year; and\n(2) issue any permit required under subdivisions 3 to 5.\n(b) A local government unit that receives state grants-in-aid under section 84.794, subdivision 2, 84.803, subdivision 2, or 84.927, subdivision 2, for any trail, with the concurrence of the commissioner, and landowner or land lessee, may:\n(1) designate the trail specifically for use at various times of the year by all-terrain or off-road vehicles or off-highway motorcycles, for nonmotorized use such as ski touring, snowshoeing, and hiking, and for multiple use; and\n(2) issue any permit required under subdivisions 3 to 5.\n(c) A local unit of government that receives state grants-in-aid for any trail, with the concurrence of the commissioner and landowner or land lessee, may designate certain trails for joint use by snowmobiles, off-highway motorcycles, all-terrain vehicles, and off-road vehicles.\n(d) A local unit of government may not prohibit or otherwise restrict operation of an electric-assisted bicycle, as defined in section 169.011, subdivision 27, on any trail under this section designated for bicycle use or nonmotorized use that includes bicycles, unless the local unit of government determines that operation of the electric-assisted bicycle is not consistent with (1) the safety or general welfare of trail users; or (2) the terms of any property conveyance.\nPermits may be issued for motorized vehicles, other than those designated, to use a trail designated for use by snowmobiles, off-highway motorcycles, all-terrain or off-road vehicles. Notice of the permit must be conspicuously posted, at the expense of the permit holder, at no less than one-half mile intervals along the trail, for the duration of the permit. Permits shall require that permit holders return the trail and any associated facility to their original condition if any damage is done by the permittee. Limited permits for special events such as races may be issued and shall require the removal of any trail markers, banners and other material used in connection with the special event.\nNo motorized vehicle shall be operated on a trail designated for nonmotorized use. This subdivision does not apply to (1) motorized wheelchairs or other motorized devices operated by an individual who is physically disabled; or (2) electric-assisted bicycles, as defined in section 169.011, subdivision 27.\n(a) From December 1 to April 1 in any year no use of a motorized vehicle other than a snowmobile, unless authorized by permit, lease, or easement, shall be permitted on a trail designated for use by snowmobiles.\n(b) No use of a motorized vehicle other than an all-terrain or off-road vehicle and an off-highway motorcycle, unless authorized by permit, lease, or easement, shall be permitted on a trail designated for use by all-terrain vehicles, off-road vehicles, or both, and off-highway motorcycles.\nThe following motor vehicles are exempt from the provisions of subdivisions 3 to 5:\n(1) military, fire, emergency or law enforcement vehicles used for official or emergency purposes;\n(2) vehicles registered to the county, state or federal government;\n(3) vehicles authorized by permit, lease or contract;\n(4) vehicles owned by private persons engaged in the upkeep and maintenance of the trail systems under the direction of the local unit of government that manages the trail; and\n(5) vehicles registered to or operated with the permission of a landowner on whose lands the trail system has been constructed, but only with respect to operation on the land of that owner.\nThis section does not apply to any portion of a trail located on any street or highway as defined in section 169.011.\nThe provisions of this section may be enforced by officers of the Department of Natural Resources as provided in sections 97A.201 to 97A.235.",
	"repealed": false
}