{
	"id": "84.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.83",
	"title": "84.83 SNOWMOBILE TRAILS AND ENFORCEMENT ACCOUNT; RECEIPTS AND ALLOCATIONS.",
	"text": "There is created in the state treasury an account known as the snowmobile trails and enforcement account in the natural resources fund.\nFees from the registration of snowmobiles and from the issuance of snowmobile state trail passes and the unrefunded gasoline tax attributable to snowmobile use pursuant to section 296A.18 shall be deposited in the state treasury and credited to the snowmobile trails and enforcement account.\n[See Note.]\n(a) The money deposited in the account and interest earned on that money may be expended only as appropriated by law for the following purposes:\n(1) for a grant-in-aid program to counties and municipalities for construction and maintenance of snowmobile trails that are determined by the commissioner to be part of the state's grant-in-aid system, including maintenance of trails on lands and waters of Voyageurs National Park; on Lake of the Woods; on Rainy Lake; on the following lakes in St. Louis County: Burntside, Crane, Little Long, Mud, Pelican, Shagawa, and Vermilion; and on the following lakes in Cook County: Devil Track and Hungry Jack. The commissioner may establish a performance-based funding formula for annual grants-in-aid. The procedures and criteria for grants-in-aid are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. In administering the performance-based grants-in-aid, the commissioner must:\n(i) determine annual grant amounts based on a funding formula that includes consideration of historical costs, snowfall, use, and tourism;\n(ii) make grant payments based on:\n(A) successful completion of performance benchmarks;\n(B) reimbursement of eligible expenditures; or\n(C) a combination of subitems (A) and (B); and\n(iii) assess penalties to nonperforming grant-in-aid recipients, which may include withholding grant payments or making the grantee or trail system ineligible for future grant-in-aid funding;\n(2) to acquire, develop, and maintain state recreational snowmobile trails;\n(3) for snowmobile safety programs; and\n(4) to administer and enforce sections 84.81 to 84.9011 and appropriated grants to local law enforcement agencies.\n(b) No less than 60 percent of revenue collected from snowmobile registration and snowmobile state trail pass fees must be expended for grants-in-aid to develop, maintain, and groom trails and acquire easements.\n[See Note.]\n(a) Recipients of Minnesota trail assistance program funds must be afforded the same protection and be held to the same standard of liability as a political subdivision under chapter 466 for activities associated with the administration, design, construction, maintenance, and grooming of snowmobile trails.\n(b) Recipients of Minnesota trail assistance program funds who maintain ice trails on public waters listed under subdivision 3, clause (1), or on waters of Voyageurs National Park are expressly immune from liability under section 466.03, subdivision 6e.\nWhen the commissioner acquires lands with easements or other agreements for snowmobile trails that have received grant-in-aid financing under this section, the commissioner shall:\n(1) continue the easements or other agreements for the snowmobile trail; or\n(2) develop an alternative route for the trail, including acquiring any necessary easements or other agreements for the trail right-of-way and providing funding for all expenses associated with clearing and marking the snowmobile trail.\nFines and forfeited bail collected from prosecutions of violations of sections 84.81 to 84.90 or rules adopted thereunder must be deposited in the state treasury. Half the receipts must be credited to the general fund, and half the receipts must be credited to the snowmobile trails and enforcement account in the natural resources fund.",
	"repealed": false
}