{
	"id": "349.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.30",
	"title": "349.30 DEFINITIONS.",
	"text": "For the purposes of sections 349.30 to 349.39, unless a different meaning is indicated by the context, the words, terms, and phrases defined in this section shall have the meanings given them.\n\"Gambling device\" has the meaning given it in section 609.75, subdivision 4.\n\"Person\" means an individual, a copartnership, an association, a corporation, or any other entity or organization.\n\"Municipality\" means any county, city, or town.\n\"License\" includes permits of every kind, nature and description issued pursuant to any statute or ordinance for the carrying on of any business, trade, vocation, commercial enterprise or undertaking.\n\"Licensee\" means any person to whom a license of any kind is issued, but does not include a common carrier transporting, or a public warehouse operator storing, any gambling device for hire, or a manufacturer or distributor of such devices keeping the same only for the purpose of sale or distribution to others or repairing of same.\n\"Licensed business\" means any business, trade, vocation, commercial enterprise, or undertaking for which a license is issued.\n\"Licensed premises\" means the place or building, or the room in a building, designated in the license as the place where the licensed business is to be carried on, and all land adjacent thereto and used in connection with and in the operation of a licensed business, and all adjacent or contiguous rooms or buildings operated or used in connection with the buildings where the licensed business is carried on. If no place is described in any license, then \"licensed premises\" means the building or place where the licensed business is carried on under such license.\n\"Issuing authority\" and \"authority issuing the license\" mean and include the officer, board, bureau, department, commission, or agency of the state, or of any of its municipalities, by whom any license is issued and include the councils and governing bodies of all municipalities.",
	"repealed": false
}