{
	"id": "326B.956",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.956",
	"title": "326B.956 HISTORICAL BOILERS.",
	"text": "For the purpose of sections 326B.95 to 326B.998, the term \"historical boiler\" means a boiler that is used only for display and demonstration purposes. The terms \"historical boiler,\" \"show boiler,\" \"steam farm traction engine,\" and \"hobby boiler\" are synonymous. In recognition of the historical significance of show boilers in maintaining a working reminder of Minnesota's agricultural, transportation, and lumber industries, show boilers and engines are considered to be historical artifacts.\n(a) Historical boilers shall be inspected every two years. All historical boilers shall be inspected by ultrasonic examination and hydrostatic testing, alternating the type of inspection every two years. Any historical boiler not previously inspected in Minnesota shall be subject to both ultrasonic examination and hydrostatic testing prior to operation unless the historical boiler has a current operating certificate under paragraph (d).\n(b) Except as provided in paragraph (d), historical boilers must display a certificate of inspection issued by the department before use.\n(c) Standards for inspection of historical boilers shall be those established by the National Board Inspection Code ANSI/NB23 and by the rules adopted by the department and as follows:\n(1) the boiler may be subjected to other methods of nondestructive examination, at the owner's expense, as deemed necessary by the boiler inspector to determine soundness and safety of the boiler;\n(2) if a historical boiler has any longitudinal cracks in riveted longitudinal seams, the vessel shall be sealed and not approved for use in Minnesota. If the historical boiler is jacketed, the jacket must be removed prior to inspection; and\n(3) repairs and alterations made to historical boilers must be made pursuant to the National Board Inspection Code ANSI/NB34.\n(d) If a historical boiler has not been inspected in Minnesota and has a current operating certificate issued by another state or Canadian province, then that historical boiler can be operated in Minnesota without inspection in Minnesota as long as:\n(1) the chief boiler inspector has determined that the requirements for certification in the other state or Canadian province are equal to or greater than the requirements for certification in Minnesota;\n(2) the historical boiler displays the certificate from the other state or Canadian province; and\n(3) the historical boiler is not operated in Minnesota for more than two years without inspection in Minnesota.\nThe fee for inspecting historical boilers shall be the hourly rate pursuant to section 326B.986, subdivision 4.\nWhen a historical boiler is in operation at any location that is open to the public, an individual licensed under this subdivision or exempt from licensure under this subdivision must be in attendance at the boiler at all times. A license to operate historical boilers shall be issued to an applicant who:\n(1) is 16 years of age or older;\n(2) has provided to the commissioner an affidavit attesting to the applicant's competence in operating historical boilers and attesting that the applicant has demonstrated the ability to perform each task on a list, developed and approved by the chief boiler inspector, of tasks associated with the operation of historical boilers. The affidavit shall be signed by a licensed historical boiler engineer or an engineer licensed as second class grade A or higher;\n(3) has at least 50 hours of operating experience on the devices, eight hours of which must be operating the boiler under load, and up to 16 hours of which may be satisfied by attendance at a school of instruction in operating the devices;\n(4) passes a written test for competence in operating the devices; and\n(5) pays the required fee.\nA license is valid for the lifetime of the licensee unless revoked for cause. A onetime fee pursuant to section 326B.986, subdivision 5, shall be charged for the license.\n(a) Any licensed steam engineer may operate historical boilers, subject to the equipment and horsepower limitations set forth in section 326B.978, without obtaining a license under subdivision 4.\n(b) Any individual who holds a current historical boiler operator license issued by another state or Canadian province may operate historical boilers in Minnesota if the chief boiler inspector has determined that the requirements under which the individual obtained licensure in the other state or Canadian province are equal to or greater than the requirements for an applicant making application in Minnesota for a historical boiler license.\n[Repealed by amendment, 2010 c 287 s 4]",
	"repealed": false
}