{
	"id": "604A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.21",
	"title": "604A.21 RECREATIONAL LAND USE; DEFINITIONS.",
	"text": "For the purposes of sections 604A.20 to 604A.27, the terms defined in this section have the meanings given them, except where the context clearly indicates otherwise.\n\"Charge\" means any admission price asked or charged for services, entertainment, recreational use, or other activity or the offering of products for sale to the recreational user by a commercial for profit enterprise directly related to the use of the land.\n\"Dedicated\" means made available by easement, license, permit, or other authorization.\n\"Land\" means any of the following which is privately owned or leased or in which a municipal power agency has rights: land, easements, rights-of-way, roads, water, watercourses, private ways and buildings, structures, and other improvements to land, and machinery or equipment when attached to land.\n\"Owner\" means the possessor of a fee interest or a life estate, tenant, lessee, occupant, holder of a utility easement, or person in control of the land.\n\"Recreational purpose\" includes, but is not limited to, hunting; trapping; fishing; swimming; boating; camping; picnicking; hiking; rock climbing; cave exploring; bicycling; horseback riding; firewood gathering; pleasure driving, including snowmobiling and the operation of any motorized vehicle or conveyance upon a road or upon or across land in any manner, including recreational trail use; nature study; water skiing; winter sports; noncommercial aviation activities; and viewing or enjoying historical, archaeological, scenic, or scientific sites. \"Rock climbing\" means the climbing of a naturally exposed rock face. \"Cave exploring\" means the planned exploration of naturally occurring cavities in rock, including passage through any structures placed for the purpose of safe access, access control, or conservation, but does not include the exploration of other man-made cavities such as tunnels, mines, and sewers. \"Noncommercial aviation activities\" means the use of private, nonstaffed airstrips for takeoffs and landings related to other recreational purposes under this subdivision that are not commercial operations under section 360.013, subdivision 45.\n\"Recreational trail use\" means use on or about a trail, including but not limited to, hunting, trapping, fishing, hiking, bicycling, skiing, horseback riding, snowmobile riding, and motorized trail riding.",
	"repealed": false
}