{
	"id": "268.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.18",
	"title": "268.18 UNEMPLOYMENT BENEFIT OVERPAYMENTS.",
	"text": "(a) Any applicant who (1) because of a determination or amended determination issued under section 268.07 or 268.101, or any other section of this chapter, or (2) because of an unemployment law judge's decision under section 268.105, has received any unemployment benefits that the applicant was held not entitled to, is overpaid the benefits, and must promptly repay the benefits to the trust fund.\n(b) If the applicant fails to repay the unemployment benefits overpaid, including any penalty and interest assessed under subdivisions 2 and 2b, the total due may be collected by the methods allowed under state and federal law.\n(a) An applicant has committed misrepresentation if the applicant is overpaid unemployment benefits by making a false statement or representation without a good faith belief as to the correctness of the statement or representation.\nAfter the discovery of facts indicating misrepresentation, the commissioner must issue a determination of overpayment penalty assessing a penalty equal to 40 percent of the amount overpaid. This penalty is in addition to penalties under section 268.183.\n(b) Unless the applicant files an appeal within 45 calendar days after the sending of a determination of overpayment penalty to the applicant by mail or electronic transmission, the determination is final. Proceedings on the appeal are conducted in accordance with section 268.105.\n(c) A determination of overpayment penalty must state the methods of collection the commissioner may use to recover the overpayment, penalty, and interest assessed. Money received in repayment of overpaid unemployment benefits, penalties, and interest is first applied to the benefits overpaid, then to the penalty amount due, then to any interest due. 62.5 percent of the payments made toward the penalty are credited to the contingent account and 37.5 percent credited to the trust fund.\n(d) The department is authorized to issue a determination of overpayment penalty under this subdivision within 48 months of the establishment of the benefit account upon which the unemployment benefits were obtained through misrepresentation.\n[Renumbered subd 3a]\nOn any unemployment benefits obtained by misrepresentation, and any penalty amounts assessed under subdivision 2, the commissioner must assess interest on any amount that remains unpaid beginning 30 calendar days after the date of a determination of overpayment penalty. Interest is assessed at the rate of one percent per month or any part of a month. A determination of overpayment penalty must state that interest will be assessed. Interest is not assessed on unpaid interest. Interest collected under this subdivision is credited to the trust fund.\n[Renumbered 268.182]\n(a) The commissioner may offset from any future unemployment benefits otherwise payable the amount of a nonmisrepresentation overpayment. Except when the nonmisrepresentation overpayment resulted because the applicant failed to report deductible earnings or deductible or benefit delaying payments, no single offset may exceed 50 percent of the amount of the payment from which the offset is made.\n(b) Overpayments of unemployment benefits under a federal program, may be recovered by offset from future benefits otherwise payable.\n(c) If an applicant has been overpaid unemployment benefits under the law of another state, the commissioner may offset from future benefits otherwise payable the amount of overpayment.\n(d) Nonmisrepresentation unemployment benefit overpayments may be recovered by offset from future benefits otherwise payable under a federal program.\n(a) If unemployment benefits overpaid for reasons other than misrepresentation are not repaid or offset from subsequent benefits within six years after the date of the determination or decision holding the applicant overpaid, the commissioner must cancel the overpayment balance, and no administrative or legal proceedings may be used to enforce collection of those amounts.\n(b) If unemployment benefits overpaid because of misrepresentation including penalties and interest are not repaid within ten years after the date of the determination of overpayment penalty, the commissioner must cancel the overpayment balance and any penalties and interest due, and no administrative or legal proceeding may be used to enforce collection of those amounts.\n(c) The commissioner may cancel at any time any overpayment, including penalties and interest, that the commissioner determines is uncollectible because of death or bankruptcy.\n(a) If the department is required to pay any court fees in an attempt to enforce collection of overpaid unemployment benefits, penalties, or interest, the amount of the court fees may be added to the total amount due.\n(b) If an applicant who has been overpaid unemployment benefits because of misrepresentation seeks to have any portion of the debt discharged under the federal bankruptcy code, and the department files an objection in bankruptcy court to the discharge, the cost of any court fees may be added to the debt if the bankruptcy court does not discharge the debt.\n(c) If the Internal Revenue Service assesses the department a fee for offsetting from a federal tax refund the amount of any overpayment, including penalties and interest, the amount of the fee may be added to the total amount due. The offset amount must be put in the trust fund and that amount credited to the total amount due from the applicant.\n[Repealed, 1997 c 66 s 81]\n(a) Any method undertaken to recover an overpayment of unemployment benefits, including any penalties and interest, is not an election of a method of recovery.\n(b) Intervention or lack thereof, in whole or in part, in a workers' compensation matter under section 176.361 is not an election of a remedy and does not prevent the commissioner from determining an applicant ineligible for unemployment benefits.\n[Renumbered 268.184]\n(a) The commissioner may not compromise the amount of any overpaid unemployment benefits including penalties and interest.\n(b) The commissioner has discretion regarding the recovery of any overpayment for reasons other than misrepresentation. Regardless of any law to the contrary, the commissioner is not required to refer any overpayment for reasons other than misrepresentation to a public or private collection agency, including agencies of this state.\n(c) Amounts overpaid for reasons other than misrepresentation are not considered a \"debt\" to the state of Minnesota for purposes of any reporting requirements to the commissioner of management and budget.\n(d) A pending appeal under section 268.105 does not suspend the assessment of interest, penalties, or collection of an overpayment.\n(e) Section 16A.626 applies to the repayment by an applicant of any overpayment, penalty, or interest.",
	"repealed": false
}