{
	"id": "342.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.61",
	"title": "342.61 TESTING.",
	"text": "(a) Cannabis businesses and hemp businesses shall not sell or offer for sale cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products to another cannabis business or hemp business, or to a customer or patient, or otherwise transfer cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products to another cannabis business or hemp business, unless:\n(1) a representative sample of the batch of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products has been tested according to this section and rules adopted under this chapter;\n(2) the testing was completed by a cannabis testing facility licensed under this chapter or meeting the requirements of paragraph (b); and\n(3) the tested sample of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products was found to meet testing standards established by the office.\n(b) Testing of lower-potency hemp edibles and hemp-derived consumer products that do not contain intoxicating cannabinoids may be performed by any laboratory that has been accredited pursuant to standard ISO/IEC 17025 of the International Organization for Standardization with specific accreditation for cannabis testing until January 1, 2026.\n(a) The office shall by rule establish procedures governing the sampling, handling, testing, storage, and transportation of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products tested under this section; the contaminants for which cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products must be tested; standards for potency and homogeneity testing; and procedures applicable to cannabis businesses, hemp businesses, and cannabis testing facilities regarding cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products that fail to meet the standards for allowable levels of contaminants established by the office, that fail to meet the potency limits in this chapter, or that do not conform with the content of the cannabinoid profile listed on the label.\n(b) All testing required under this section must be performed in a manner that is consistent with general requirements for testing and calibration activities.\nThe office shall by rule establish standards for allowable levels of contaminants in cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products, and growing media. Contaminants for which the office must establish allowable levels must include but are not limited to residual solvents, foreign material, microbiological contaminants, heavy metals, pesticide residue, and mycotoxins.\n(a) On a schedule determined by the office, every cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis wholesaler with an endorsement to import products, lower-potency hemp edible manufacturer, or medical cannabis combination business shall make each batch of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products grown, manufactured, or imported by the cannabis business or hemp business available to a cannabis testing facility.\n(b) A cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis wholesaler with an endorsement to import products, lower-potency hemp edible manufacturer, or medical cannabis combination business must disclose all known information regarding pesticides, fertilizers, solvents, or other foreign materials, including but not limited to catalysts used in creating artificially derived cannabinoids, applied or added to the batch of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products subject to testing. Disclosure must be made to the cannabis testing facility and must include information about all applications by any person, whether intentional or accidental.\n(c) The cannabis testing facility shall select one or more representative samples from each batch, test the samples for the presence of contaminants, and test the samples for potency and homogeneity and to allow the cannabis flower, cannabis product, artificially derived cannabinoid, lower-potency hemp edible, or hemp-derived consumer product to be accurately labeled with its cannabinoid profile. Testing for contaminants must include testing for residual solvents, foreign material, microbiological contaminants, heavy metals, pesticide residue, mycotoxins, and any items identified pursuant to paragraph (b), and may include testing for other contaminants. A cannabis testing facility must destroy or return to the cannabis business or hemp business any part of the sample that remains after testing.\n(a) If a sample meets the applicable testing standards, a cannabis testing facility shall issue a certification to a cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis wholesaler with an endorsement to import products, lower-potency hemp edible manufacturer, or medical cannabis combination business and the cannabis business or hemp business may then sell or transfer the batch of cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products from which the sample was taken to another cannabis business or hemp business, or offer the cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products for sale to customers or patients. If a sample does not meet the applicable testing standards or if the testing facility is unable to test for a substance identified pursuant to subdivision 4, paragraph (b), the batch from which the sample was taken shall be subject to procedures established by the office for such batches, including destruction, remediation, or retesting.\n(b) A cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis wholesaler with an endorsement to import products, lower-potency hemp edible manufacturer, or medical cannabis combination business must maintain the test results for cannabis flower, cannabis products, artificially derived cannabinoids, lower-potency hemp edibles, or hemp-derived consumer products grown, manufactured, or imported by that cannabis business or hemp business for at least five years after the date of testing.\n(c) A cannabis microbusiness, cannabis mezzobusiness, cannabis cultivator, cannabis manufacturer, cannabis wholesaler with an endorsement to import products, lower-potency hemp edible manufacturer, or medical cannabis combination business shall make test results maintained by that cannabis business or hemp business available for review by any member of the public, upon request. Test results made available to the public must be in plain language.",
	"repealed": false
}