{
	"id": "62A.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.042",
	"title": "62A.042 FAMILY COVERAGE; COVERAGE OF NEWBORN INFANTS.",
	"text": "(a) No policy of individual accident and sickness insurance which provides for insurance for more than one person under section 62A.03, subdivision 1, clause (3), and no individual health maintenance contract which provides for coverage for more than one person under chapter 62D, shall be renewed to insure or cover any person in this state or be delivered or issued for delivery to any person in this state unless the policy or contract includes as insured or covered members of the family any newborn infants immediately from the moment of birth and thereafter which insurance or contract shall provide coverage for illness, injury, congenital malformation, or premature birth. For purposes of this paragraph, \"newborn infants\" includes grandchildren who are financially dependent upon a covered grandparent and who reside with that covered grandparent continuously from birth. No policy or contract covered by this section may require notification to a health carrier as a condition for this dependent coverage. However, if the policy or contract mandates an additional premium for each dependent, the health carrier shall be entitled to all premiums that would have been collected had the health carrier been aware of the additional dependent. The health carrier may withhold payment of any health benefits for the new dependent until it has been compensated with the applicable premium which would have been owed if the health carrier had been informed of the additional dependent immediately.\n(b) The coverage under paragraph (a) includes benefits for inpatient or outpatient expenses arising from medical and dental treatment up to the limiting age for coverage of the dependent, including orthodontic and oral surgery treatment, involved in the management of birth defects known as cleft lip and cleft palate. Benefits for individuals age 19 up to the limiting age for coverage of the dependent are limited to inpatient or outpatient expenses arising from medical and dental treatment that was scheduled or initiated prior to the dependent turning age 19. If orthodontic services are eligible for coverage under a dental insurance plan and another policy or contract, the dental plan shall be primary and the other policy or contract shall be secondary in regard to the coverage required under paragraph (a). Payment for dental or orthodontic treatment not related to the management of the congenital condition of cleft lip and cleft palate shall not be covered under this provision.\n(a) No group accident and sickness insurance policy and no group health maintenance contract which provide for coverage of family members or other dependents of an employee or other member of the covered group shall be renewed to cover members of a group located in this state or delivered or issued for delivery to any person in this state unless the policy or contract includes as insured or covered family members or dependents any newborn infants immediately from the moment of birth and thereafter which insurance or contract shall provide coverage for illness, injury, congenital malformation, or premature birth. For purposes of this paragraph, \"newborn infants\" includes grandchildren who are financially dependent upon a covered grandparent and who reside with that covered grandparent continuously from birth. No policy or contract covered by this section may require notification to a health carrier as a condition for this dependent coverage. However, if the policy or contract mandates an additional premium for each dependent, the health carrier shall be entitled to all premiums that would have been collected had the health carrier been aware of the additional dependent. The health carrier may reduce the health benefits owed to the insured, certificate holder, member, or subscriber by the amount of past due premiums applicable to the additional dependent.\n(b) The coverage under paragraph (a) includes benefits for inpatient or outpatient expenses arising from medical and dental treatment up to the limiting age for coverage of the dependent, including orthodontic and oral surgery treatment, involved in the management of birth defects known as cleft lip and cleft palate. Benefits for individuals age 19 up to the limiting age for coverage of the dependent are limited to inpatient or outpatient expenses arising from medical and dental treatment that was scheduled or initiated prior to the dependent turning age 19. If orthodontic services are eligible for coverage under a dental insurance plan and another policy or contract, the dental plan shall be primary and the other policy or contract shall be secondary in regard to the coverage required under paragraph (a). Payment for dental or orthodontic treatment not related to the management of the congenital condition of cleft lip and cleft palate shall not be covered under this provision.",
	"repealed": false
}