{
	"id": "144.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.292",
	"title": "144.292 PATIENT RIGHTS.",
	"text": "Patients have the rights specified in this section regarding the treatment the patient receives and the patient's health record.\nUpon request, a provider shall supply to a patient within 30 calendar days of receiving a written request for medical records complete and current information possessed by that provider concerning any diagnosis, treatment, and prognosis of the patient in terms and language the patient can reasonably be expected to understand.\nA patient's right specified in this section and sections 144.293 to 144.298 are in addition to the rights specified in sections 144.651 and 144.652 and any other provision of law relating to the access of a patient to the patient's health records.\nA provider shall provide to patients, in a clear and conspicuous manner, a written notice concerning practices and rights with respect to access to health records. The notice must include an explanation of:\n(1) disclosures of health records that may be made without the written consent of the patient, including the type of records and to whom the records may be disclosed; and\n(2) the right of the patient to have access to and obtain copies of the patient's health records and other information about the patient that is maintained by the provider.\nThe notice requirements of this subdivision are satisfied if the notice is included with the notice and copy of the patient and resident bill of rights under section 144.652 or if it is displayed prominently in the provider's place of business. The commissioner of health shall develop the notice required in this subdivision and publish it in the State Register.\nExcept as provided in section 144.296, upon a patient's written request, a provider, at a reasonable cost to the patient, shall furnish to the patient within 30 calendar days of receiving a written request for medical records:\n(1) copies of the patient's health record, including but not limited to laboratory reports, x-rays, prescriptions, and other technical information used in assessing the patient's health conditions; or\n(2) the pertinent portion of the record relating to a condition specified by the patient.\nWith the consent of the patient, the provider may instead furnish only a summary of the record. The provider may exclude from the health record written speculations about the patient's health condition, except that all information necessary for the patient's informed consent must be provided.\n(a) When a patient requests a copy of the patient's record for purposes of reviewing current medical care, the provider must not charge a fee.\n(b) When a provider or its representative makes copies of patient records upon a patient's request under this section, the provider or its representative may charge the patient or the patient's representative no more than the following amount, unless other law or a rule or contract provide for a lower maximum charge:\n(1) for paper copies, $1 per page, plus $10 for time spent retrieving and copying the records;\n(2) for x-rays, a total of $30 for retrieving and reproducing x-rays; and\n(3) for electronic copies, a total of $20 for retrieving the records.\n(c) For any copies of paper records provided under paragraph (b), clause (1), a provider or the provider's representative may not charge more than a total of:\n(1) $10 if there are no records available;\n(2) $30 for copies of records of up to 25 pages;\n(3) $50 for copies of records of up to 100 pages;\n(4) $50, plus an additional 20 cents per page for pages 101 and above; or\n(5) $500 for any request.\n(d) A provider or its representative may charge a $10 retrieval fee, but must not charge a per page fee or x-ray fee to provide copies of records requested by a patient or the patient's authorized representative if the request for copies of records is for purposes of appealing a denial of Social Security disability income or Social Security disability benefits under title II or title XVI of the Social Security Act. Notwithstanding the foregoing, a provider or its representative must not charge a fee, including a retrieval fee, to provide copies of records requested by a patient or the patient's authorized representative if the request for copies of records is for purposes of appealing a denial of Social Security disability income or Social Security disability benefits under title II or title XVI of the Social Security Act when the patient is receiving public assistance, represented by an attorney on behalf of a civil legal services program, or represented by a volunteer attorney program based on indigency. The patient or the patient's representative must submit one of the following to show that they are entitled to receive records without charge under this paragraph:\n(1) a public assistance statement from the county or state administering assistance;\n(2) a request for records on the letterhead of the civil legal services program or volunteer attorney program based on indigency; or\n(3) a benefits statement from the Social Security Administration.\nFor the purpose of further appeals, a patient may receive no more than two medical record updates without charge, but only for medical record information previously not provided.\nFor purposes of this paragraph, a patient's authorized representative does not include units of state government engaged in the adjudication of Social Security disability claims.\n(a) If a provider, as defined in section 144.291, subdivision 2, paragraph (i), clause (1), reasonably determines that the information is detrimental to the physical or mental health of the patient, or is likely to cause the patient to inflict self harm, or to harm another, the provider may withhold the information from the patient and may supply the information to an appropriate third party or to another provider, as defined in section 144.291, subdivision 2, paragraph (i), clause (1). The other provider or third party may release the information to the patient.\n(b) A provider, as defined in section 144.291, subdivision 2, paragraph (i), clause (3), shall release information upon written request unless, prior to the request, a provider, as defined in section 144.291, subdivision 2, paragraph (i), clause (1), has designated and described a specific basis for withholding the information as authorized by paragraph (a).\nBy January 1, 2008, the Department of Health must develop a form that may be used by a patient to request access to health records under this section. A form developed by the commissioner must be accepted by a provider as a legally enforceable request under this section.",
	"repealed": false
}