{
	"id": "364.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/364.09",
	"title": "364.09 EXCEPTIONS.",
	"text": "(a) This chapter does not apply to the licensing process for peace officers; to law enforcement agencies as defined in section 626.84, subdivision 1, paragraph (f); to fire protection agencies; to eligibility for a private detective or protective agent license; to the licensing and background study process under chapters 245A and 245C; to the licensing and background investigation process under chapter 240; to eligibility for school bus driver endorsements; to eligibility for special transportation service endorsements; to eligibility for a commercial driver training instructor license, which is governed by section 171.35 and rules adopted under that section; to emergency medical services personnel, or to the licensing by political subdivisions of taxicab drivers, if the applicant for the license has been discharged from sentence for a conviction within the ten years immediately preceding application of a violation of any of the following:\n(1) sections 609.185 to 609.2114, 609.221 to 609.223, 609.342 to 609.3451, or 617.23, subdivision 2 or 3; or Minnesota Statutes 2012, section 609.21;\n(2) any provision of chapter 152 that is punishable by a maximum sentence of 15 years or more; or\n(3) a violation of chapter 169 or 169A involving driving under the influence, leaving the scene of an accident, or reckless or careless driving.\nThis chapter also shall not apply to eligibility for juvenile corrections employment, where the offense involved child physical or sexual abuse or criminal sexual conduct.\n(b) This chapter does not apply to a school district or to eligibility for a license issued or renewed by the Professional Educator Licensing and Standards Board or the commissioner of education.\n(c) Nothing in this section precludes the Minnesota Police and Peace Officers Training Board or the state fire marshal from recommending policies set forth in this chapter to the attorney general for adoption in the attorney general's discretion to apply to law enforcement or fire protection agencies.\n(d) This chapter does not apply to a license to practice medicine that has been denied or revoked by the Board of Medical Practice pursuant to section 147.091, subdivision 1a.\n(e) This chapter does not apply to any person who has been denied a license to practice chiropractic or whose license to practice chiropractic has been revoked by the board in accordance with section 148.10, subdivision 7.\n(f) This chapter does not apply to any license, registration, or permit that has been denied or revoked by the Board of Nursing in accordance with section 148.261, subdivision 1a.\n(g) This chapter does not apply to any license, registration, permit, or certificate that has been denied or revoked by the commissioner of health according to section 148.5195, subdivision 5; or 153A.15, subdivision 2.\n(h) This chapter does not supersede a requirement under law to conduct a criminal history background investigation or consider criminal history records in hiring for particular types of employment.",
	"repealed": false
}