{
	"id": "142A.612",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.612",
	"title": "142A.612 ADMINISTRATION AND APPEALS.",
	"text": "(a) The financially responsible agency shall determine the eligibility for Northstar Care for Children for children in foster care under section 142A.604, and for those children determined eligible, shall further determine each child's eligibility for title IV-E of the Social Security Act, provided the agency has such authority under the state title IV-E plan.\n(b) Subject to commissioner review and approval, the financially responsible agency shall prepare the eligibility determination for Northstar Care for Children for children in Northstar kinship assistance under section 142A.605 and children in adoption assistance under section 142A.606. The AFDC relatedness determination, when necessary to determine a child's eligibility for title IV-E funding, shall be made only by an authorized agency according to policies and procedures prescribed by the commissioner.\n(c) The financially responsible agency is responsible for the administration of Northstar Care for Children for children in foster care. The agency designated by the commissioner is responsible for assisting the commissioner with the administration of Northstar Care for Children for children in Northstar kinship assistance and adoption assistance by conducting assessments, reassessments, negotiations, and other activities as specified by the commissioner under subdivision 2.\nThe commissioner shall specify procedures, requirements, and deadlines for the administration of Northstar Care for Children in accordance with sections 142A.60 to 142A.612, including for children transitioning into Northstar Care for Children under subdivision 7. The commissioner shall periodically review all procedures, requirements, and deadlines, including the assessment tool and process under section 142A.607, in consultation with counties, tribes, and representatives of caregivers, and may alter them as needed.\nThe title IV-E foster care, Northstar kinship assistance, and adoption assistance programs must operate within the statutes, rules, and policies set forth by the federal government in the Social Security Act.\nThe commissioner shall specify required fiscal and statistical reports under section 142A.03, subdivision 2, paragraph (o), and other reports as necessary.\nFamilies who adopt a child under the commissioner's guardianship must be informed as to the adoption tax credit. The commissioner shall actively seek ways to promote the Northstar kinship assistance and adoption assistance programs, including informing prospective caregivers of eligible children of the availability of Northstar kinship assistance and adoption assistance.\n(a) A caregiver has the right to appeal to the commissioner under section 142A.20 when eligibility for Northstar Care for Children is denied, and when payment or the agreement for an eligible child is modified or terminated.\n(b) A relative custodian or adoptive parent has additional rights to appeal to the commissioner pursuant to section 142A.20. These rights include when the commissioner terminates or modifies the Northstar kinship assistance or adoption assistance agreement or when the commissioner denies an application for Northstar kinship assistance or adoption assistance. A prospective relative custodian or adoptive parent who disagrees with a decision by the commissioner before transfer of permanent legal and physical custody or finalization of the adoption may request review of the decision by the commissioner or may appeal the decision under section 142A.20. A Northstar kinship assistance or adoption assistance agreement must be signed and in effect before the court order that transfers permanent legal and physical custody or the adoption finalization; however, in some cases, there may be extenuating circumstances as to why an agreement was not entered into before finalization of permanency for the child. Caregivers who believe that extenuating circumstances exist in the case of their child may request a fair hearing. Caregivers have the responsibility of proving that extenuating circumstances exist. Caregivers must be required to provide written documentation of each eligibility criterion at the fair hearing. Examples of extenuating circumstances include: relevant facts regarding the child were known by the placing agency and not presented to the caregivers before transfer of permanent legal and physical custody or finalization of the adoption, or failure by the commissioner or a designee to advise potential caregivers about the availability of Northstar kinship assistance or adoption assistance for children in the state foster care system. If a human services judge finds through the fair hearing process that extenuating circumstances existed and that the child met all eligibility criteria at the time the transfer of permanent legal and physical custody was ordered or the adoption was finalized, the effective date and any associated federal financial participation shall be retroactive from the date of the request for a fair hearing.\n(a) A child in foster care who remains with the same caregiver shall continue to receive benefits under the pre-Northstar Care for Children foster care program under section 142A.418. Transitions to Northstar Care for Children must occur as provided in section 142A.604, subdivision 6.\n(b) The commissioner may seek to transition into Northstar Care for Children a child who is in pre-Northstar Care for Children relative custody assistance under section 142A.65or pre-Northstar Care for Children adoption assistance under chapter 259A, in accordance with these priorities, in order of priority:\n(1) financial and budgetary constraints;\n(2) complying with federal regulations;\n(3) converting pre-Northstar Care for Children relative custody assistance under section 142A.65 to the Northstar kinship assistance component of Northstar Care for Children;\n(4) improving permanency for a child or children;\n(5) maintaining permanency for a child or children;\n(6) accessing additional federal funds; and\n(7) administrative simplification.\n(c) Transitions shall be accomplished according to procedures, deadlines, and requirements specified by the commissioner under subdivision 2.\n(d) The commissioner may accomplish a transition of a child from pre-Northstar Care for Children relative custody assistance under section 142A.65 to the Northstar kinship assistance component of Northstar Care for Children by declaration and appropriate notice to the caregiver, provided that the benefit for a child under this paragraph is not reduced.\n(e) The commissioner may offer a transition of a child from pre-Northstar Care for Children adoption assistance under chapter 259A to the adoption assistance component of Northstar Care for Children by contacting the caregiver with an offer. The transition must be accomplished only when the caregiver agrees to the offer. The caregiver shall have a maximum of 90 days to review and accept the commissioner's offer. If the commissioner's offer is not accepted within 90 days, the pre-Northstar Care for Children adoption assistance agreement remains in effect until it terminates or a subsequent offer is made by the commissioner.\n(f) For a child transitioning into Northstar Care for Children, the commissioner shall assign an equivalent assessment level based on the most recently completed supplemental difficulty of care level assessment, unless the commissioner determines that arranging for a new assessment under section 142A.607 would be more appropriate based on the priorities specified in paragraph (b).\n(g) For a child transitioning into Northstar Care for Children, regardless of the age of the child, the commissioner shall use the rates under section 142A.609, subdivision 5, unless the rates under section 142A.609, subdivisions 3 and 4, are more appropriate based on the priorities specified in paragraph (b), as determined by the commissioner.\nThe commissioner may reimburse the placing agency for appropriate adoption services for children eligible under section 259A.75.",
	"repealed": false
}