{
	"id": "79A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.09",
	"title": "79A.09 SECURITY FUND.",
	"text": "The self-insurers' security fund is established as a nonprofit corporation pursuant to the Minnesota Nonprofit Corporation Act, sections 317A.001 to 317A.909. If any provision of the Minnesota Nonprofit Corporation Act conflicts with any provision of this chapter, the provisions of this chapter apply. Each private self-insurer who is self-insured on July 1, 1988, or who becomes self-insured thereafter, shall participate as a member in the security fund. This participation shall be a condition of maintaining its certificate to self-insure.\nThe security fund shall be governed by a nine-member board of trustees. Five of the trustees shall be representatives of private self-insurers who shall be elected by the members of the security fund, other than group self-insurers, each member having one vote. One of the trustees shall be a representative of the private group self-insurers who shall be elected by the members of the security fund who are group self-insurers, each group having one vote. Three of the trustees, including the group self-insurer trustee, initially elected by the members shall serve two-year terms, and three shall serve four-year terms. Thereafter, trustees shall be elected to four-year terms, and shall serve until their successors are elected and assume office pursuant to the bylaws of the security fund. Three additional trustees shall be appointed by the commissioner. Two of these trustees shall serve four-year terms. One of these trustees shall serve a two-year term. Thereafter, the trustees shall be appointed to four-year terms, and shall serve until their successors are appointed and assume office pursuant to the bylaws of the security fund. In addition to the nine trustees elected by the members or appointed by the commissioner, the commissioner of labor and industry or the commissioner's designee shall be an ex officio, nonvoting member of the board of trustees. A member of the board of trustees may designate another person to act in the member's place as though the member were acting and the designee's actions shall be deemed those of the member.\nThe security fund shall establish bylaws and a plan of operation, subject to the prior approval of the commissioner, necessary to the purposes of this chapter and to carry out the responsibilities of the security fund. The security fund may carry out its responsibilities directly or by contract, and may purchase services and insurance and borrow funds as it deems necessary for the protection of the members and their employees.\nThe security fund may receive private data concerning the financial condition of private self-insurers whose liabilities to pay compensation have become its responsibility. The data shall become public data upon its receipt by the security fund.\nSecurity fund employees are not state employees and are not subject to any state civil service regulations.",
	"repealed": false
}