{
	"id": "41A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.30",
	"title": "41A.30 SUSTAINABLE AVIATION FUEL; TAX CREDITS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Aircraft\" has the meaning given in section 296A.01, subdivision 3.\n(c) \"Aviation gasoline\" has the meaning given in section 296A.01, subdivision 7.\n(d) \"Commissioner\" means the commissioner of agriculture.\n(e) \"Jet fuel\" has the meaning given in section 296A.01, subdivision 8.\n(f) \"Qualifying taxpayer\" means a taxpayer, as defined in section 290.01, subdivision 6, that is engaged in the business of:\n(1) producing sustainable aviation fuel; or\n(2) blending sustainable aviation fuel with aviation gasoline or jet fuel.\n(g) \"Sustainable aviation fuel\" means liquid fuel that:\n(1) is derived from biomass, as defined in section 41A.15, subdivision 2e;\n(2) is not derived from palm fatty acid distillates; and\n(3) achieves at least a 50 percent life cycle greenhouse gas emissions reduction in comparison with petroleum-based aviation gasoline, aviation turbine fuel, and jet fuel as determined by a test that shows:\n(i) that the fuel production pathway achieves at least a 50 percent life cycle greenhouse gas emissions reduction in comparison with petroleum-based aviation gasoline, aviation turbine fuel, and jet fuel utilizing the most recent version of Argonne National Laboratory's Greenhouse Gases, Regulated Emissions, and Energy Use in Technologies (GREET) model that accounts for reduced emissions throughout the fuel production process; or\n(ii) that the fuel production pathway achieves at least a 50 percent reduction of the aggregate attributional core life cycle emissions and the positive induced land use change values under the life cycle methodology for sustainable aviation fuels adopted by the International Civil Aviation Organization with the agreement of the United States.\n(a) A qualifying taxpayer may claim a tax credit against the tax due under chapter 290 equal to $1.50 for each gallon of sustainable aviation fuel that is:\n(1) produced in Minnesota or blended with aviation or gasoline or jet fuel in Minnesota; and\n(2) sold in Minnesota to a purchaser who certifies that the sustainable aviation fuel is for use as fuel in an aircraft departing from an airport in Minnesota.\n(b) The credit may be claimed only after approval and certification by the commissioner and is limited to the amount stated on the credit certificate issued under subdivision 3. A qualifying taxpayer must apply to the commissioner for certification and allocation of a credit in a form and manner prescribed by the commissioner.\n(c) A qualifying taxpayer may claim a credit for blending or producing sustainable aviation fuel, but not both. If sustainable aviation fuel is blended with aviation gasoline or jet fuel, the credit is allowed only for the portion of sustainable aviation fuel that is included in the blended fuel.\n(d) If the amount of credit that the taxpayer is eligible to receive under this section exceeds the liability for tax under chapter 290, the commissioner of revenue must refund the excess to the taxpayer.\n(a) A business must apply to the commissioner to be eligible for a credit certificate as a qualifying taxpayer within two months after the close of its taxable year for all sustainable aviation fuel sold under subdivision 2, paragraph (a), in the taxable year. The application must be in the form and be made under the procedures specified by the commissioner and must include:\n(1) evidence of production or blending in Minnesota required under subdivision 2, paragraph (a), clause (1); and\n(2) a purchaser's certification that the sustainable aviation fuel is for use as fuel in an aircraft departing from an airport in Minnesota, as required under subdivision 2, paragraph (a), clause (2).\n(b) Within 30 days of receiving an application for certification under this subdivision, the commissioner must:\n(1) issue a credit certificate under paragraph (c);\n(2) request additional information from the business; or\n(3) reject the application for certification.\nIf the commissioner requests additional information from the business, the commissioner must either issue a credit certificate or reject the application within 30 days of receiving the additional information. If a business fails to submit the additional information within 30 days or if the commissioner neither issues a credit certificate within 30 days of receiving the original application or within 30 days of receiving the additional information requested, whichever is later, the application is deemed rejected.\n(c) A credit certificate must state:\n(1) the fiscal year for which the credit certificate is issued;\n(2) the amount of the tax credit; and\n(3) the taxable year for which the taxpayer may claim the tax credit under section 290.0688.\n(a) The commissioner must certify qualifying taxpayers as eligible for the tax credit under subdivision 2 and issue credit certificates under subdivision 3 subject to the allocation limits under subdivision 5.\n(b) Notwithstanding any other law to the contrary, the commissioner must share information with the commissioner of revenue to the extent necessary to administer the provisions under this section and section 290.0688. For credit certificates issued under subdivision 3, the commissioner must notify the commissioner of revenue of the issuance within 30 days.\n(c) Applications for credit certificates must be made available on the department's website by July 1 of each year identified under subdivision 5.\n(d) The commissioner must allocate credit certificates on a first-come, first-served basis beginning on August 1 of each year listed under subdivision 5.\n(a) For tax credits allowed under subdivision 2, the commissioner must not issue credit certificates for more than:\n(1) $7,400,000 for fiscal year 2025; and\n(2) $2,100,000 for each of fiscal years 2026 and 2027.\n(b) If the entire amount authorized under paragraph (a) is not allocated in fiscal year 2025 or 2026, any remaining amount is available for allocation through fiscal year 2030 until the entire allocation has been made. The commissioner must not issue any credit certificates for fiscal years beginning after June 30, 2030, and any unallocated amounts cancel on that date.\n(a) Any decision of the commissioner under this section may be challenged as a contested case under chapter 14. The contested case proceeding must be initiated within 60 days of the date of written notification by the commissioner.\n(b) If a taxpayer challenges a decision of the commissioner under this subdivision, upon perfection of the appeal, the commissioner must notify the commissioner of revenue of the challenge within five days.\n(c) Nothing in this subdivision affects the commissioner of revenue's authority to audit, review, correct, or adjust returns claiming the credit.\n(d) The commissioner may not hold credit amounts in reserve pending any contested case hearing under this subdivision.\nThis section expires for taxable years beginning after December 31, 2030.",
	"repealed": false
}