{
	"id": "290.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.17",
	"title": "290.17 GROSS INCOME, ALLOCATION TO STATE.",
	"text": "(a) The income of resident individuals is not subject to allocation outside this state. The allocation rules apply to nonresident individuals, estates, trusts, nonresident partners of partnerships, nonresident shareholders of corporations treated as \"S\" corporations under section 290.9725, and all corporations not having such an election in effect. If a partnership or corporation would not otherwise be subject to the allocation rules, but conducts a trade or business that is part of a unitary business involving another legal entity that is subject to the allocation rules, the partnership or corporation is subject to the allocation rules.\n(b) Expenses, losses, and other deductions (referred to collectively in this paragraph as \"deductions\") must be allocated along with the item or class of gross income to which they are definitely related for purposes of assignment under this section or apportionment under section 290.191, 290.20, or 290.36. Deductions definitely related to any item of gross income assigned under subdivision 2, paragraph (e), are assigned to the taxpayer's domicile.\n(c) In the case of an individual who is a resident for only part of a taxable year, the individual's income, gains, losses, and deductions from the distributive share of a partnership, S corporation, trust, or estate are not subject to allocation outside this state to the extent of the distributive share multiplied by a ratio, the numerator of which is the number of days the individual was a resident of this state during the tax year of the partnership, S corporation, trust, or estate, and the denominator of which is the number of days in the taxable year of the partnership, S corporation, trust, or estate.\n[Repealed, 1987 c 268 art 1 s 127]\nThe income of a taxpayer subject to the allocation rules that is not derived from the conduct of a trade or business must be assigned in accordance with paragraphs (a) to (f):\n(a)(1) Subject to paragraphs (a)(2) and (a)(3), income from wages as defined in section 3401(a), (f), and (i) of the Internal Revenue Code is assigned to this state if, and to the extent that, the work of the employee is performed within it; all other income from such sources is treated as income from sources without this state.\nSeverance pay shall be considered income from labor or personal or professional services.\n(2) In the case of an individual who is a nonresident of Minnesota and who is an athlete or entertainer, income from compensation for labor or personal services performed within this state shall be determined in the following manner:\n(i) the amount of income to be assigned to Minnesota for an individual who is a nonresident salaried athletic team employee shall be determined by using a fraction in which the denominator contains the total number of days in which the individual is under a duty to perform for the employer, and the numerator is the total number of those days spent in Minnesota. For purposes of this paragraph, off-season training activities, unless conducted at the team's facilities as part of a team imposed program, are not included in the total number of duty days. Bonuses earned as a result of play during the regular season or for participation in championship, play-off, or all-star games must be allocated under the formula. Signing bonuses are not subject to allocation under the formula if they are not conditional on playing any games for the team, are payable separately from any other compensation, and are nonrefundable; and\n(ii) the amount of income to be assigned to Minnesota for an individual who is a nonresident, and who is an athlete or entertainer not listed in item (i), for that person's athletic or entertainment performance in Minnesota shall be determined by assigning to this state all income from performances or athletic contests in this state.\n(3) For purposes of this section, amounts received by a nonresident as \"retirement income\" as defined in section (b)(1) of the State Income Taxation of Pension Income Act, Public Law 104-95, are not considered income derived from carrying on a trade or business or from wages or other compensation for work an employee performed in Minnesota, and are not taxable under this chapter.\n(b) Income or gains from tangible property located in this state that is not employed in the business of the recipient of the income or gains must be assigned to this state.\n(c) Income or gains from intangible personal property not employed in the business of the recipient of the income or gains must be assigned to this state if the recipient of the income or gains is a resident of this state or is a resident trust or estate.\nGain on the sale of a partnership interest is allocable to this state in the ratio of the original cost of partnership tangible property in this state to the original cost of partnership tangible property everywhere, determined at the time of the sale. If more than 50 percent of the value of the partnership's assets consists of intangibles, gain or loss from the sale of the partnership interest is allocated to this state in accordance with the sales factor of the partnership for its first full tax period immediately preceding the tax period of the partnership during which the partnership interest was sold.\nGain on the sale of an interest in a single member limited liability company that is disregarded for federal income tax purposes is allocable to this state as if the single member limited liability company did not exist and the assets of the limited liability company are personally owned by the sole member.\nGain on the sale of goodwill or income from a covenant not to compete that is connected with a business operating all or partially in Minnesota is allocated to this state to the extent that the income from the business in the year preceding the year of sale was allocable to Minnesota under subdivision 3.\nWhen an employer pays an employee for a covenant not to compete, the income allocated to this state is in the ratio of the employee's service in Minnesota in the calendar year preceding leaving the employment of the employer over the total services performed by the employee for the employer in that year.\n(d) Income from winnings on a bet made by an individual while in Minnesota is assigned to this state. In this paragraph, \"bet\" has the meaning given in section 609.75, subdivision 2, as limited by section 609.75, subdivision 3, clauses (1), (2), and (3).\n(e) All items of gross income not covered in paragraphs (a) to (d) and not part of the taxpayer's income from a trade or business shall be assigned to the taxpayer's domicile.\n(f) For the purposes of this section, working as an employee shall not be considered to be conducting a trade or business.\nAll income of a trade or business is subject to apportionment except nonbusiness income. Income derived from carrying on a trade or business must be assigned to this state if the trade or business is conducted wholly within this state, assigned outside this state if conducted wholly without this state and apportioned between this state and other states and countries under this subdivision if conducted partly within and partly without this state. For purposes of determining whether a trade or business is carried on exclusively within or without this state:\n(a) A trade or business physically located exclusively within this state is nevertheless carried on partly within and partly without this state if any of the principles set forth in section 290.191 for the allocation of sales or receipts within or without this state when applied to the taxpayer's situation result in the allocation of any sales or receipts without this state.\n(b) A trade or business physically located exclusively without this state is nevertheless carried on partly within and partly without this state if any of the principles set forth in section 290.191 for the allocation of sales or receipts within or without this state when applied to the taxpayer's situation result in the allocation of any sales or receipts within this state. The jurisdiction to tax such a business under this chapter must be determined in accordance with sections 290.014 and 290.015.\n(a) If a trade or business conducted wholly within this state or partly within and partly without this state is part of a unitary business, the entire income of the unitary business is subject to apportionment pursuant to section 290.191. Notwithstanding subdivision 2, paragraph (c), none of the income of a unitary business is considered to be derived from any particular source and none may be allocated to a particular place except as provided by the applicable apportionment formula. The provisions of this subdivision do not apply to business income subject to subdivision 5, income of an insurance company, or income of an investment company determined under section 290.36.\n(b) The term \"unitary business\" means business activities or operations which result in a flow of value between them. The term may be applied within a single legal entity or between multiple entities and without regard to whether each entity is a sole proprietorship, a corporation, a partnership or a trust.\n(c) Unity is presumed whenever there is unity of ownership, operation, and use, evidenced by centralized management or executive force, centralized purchasing, advertising, accounting, or other controlled interaction, but the absence of these centralized activities will not necessarily evidence a nonunitary business. Unity is also presumed when business activities or operations are of mutual benefit, dependent upon or contributory to one another, either individually or as a group.\n(d) Where a business operation conducted in Minnesota is owned by a business entity that carries on business activity outside the state different in kind from that conducted within this state, and the other business is conducted entirely outside the state, it is presumed that the two business operations are unitary in nature, interrelated, connected, and interdependent unless it can be shown to the contrary.\n(e) Unity of ownership does not exist when two or more corporations are involved unless more than 50 percent of the voting stock of each corporation is directly or indirectly owned by a common owner or by common owners, either corporate or noncorporate, or by one or more of the member corporations of the group. For this purpose, the term \"voting stock\" shall include membership interests of mutual insurance holding companies formed under section 66A.40.\n(f) The net income and apportionment factors under section 290.191 or 290.20 of foreign corporations and other foreign entities, but excluding a disqualified captive insurance company, which are part of a unitary business shall not be included in the net income or the apportionment factors of the unitary business; except that the income and apportionment factors of a foreign entity, other than an entity treated as a C corporation for federal income tax purposes, that are included in the federal taxable income, as defined in section 63 of the Internal Revenue Code as amended through the date named in section 290.01, subdivision 19, of a domestic corporation, domestic entity, or individual must be included in determining net income and the factors to be used in the apportionment of net income pursuant to section 290.191 or 290.20. A foreign corporation or other foreign entity which is not included on a combined report and which is required to file a return under this chapter shall file on a separate return basis.\n(g) For purposes of determining the net income of a unitary business and the factors to be used in the apportionment of net income pursuant to section 290.191 or 290.20, there must be included only the income and apportionment factors of domestic corporations or other domestic entities that are determined to be part of the unitary business pursuant to this subdivision, notwithstanding that foreign corporations or other foreign entities might be included in the unitary business; except that the income and apportionment factors of a foreign entity, other than an entity treated as a C corporation for federal income tax purposes, that is included in the federal taxable income, as defined in section 63 of the Internal Revenue Code as amended through the date named in section 290.01, subdivision 19, of a domestic corporation, domestic entity, or individual must be included in determining net income and the factors to be used in the apportionment of net income pursuant to section 290.191 or 290.20.\n(h) Each corporation or other entity, except a sole proprietorship, that is part of a unitary business must file combined reports as the commissioner determines. On the reports, all intercompany transactions between entities included pursuant to paragraph (g) must be eliminated and the entire net income of the unitary business determined in accordance with this subdivision is apportioned among the entities by using each entity's Minnesota factors for apportionment purposes in the numerators of the apportionment formula and the total factors for apportionment purposes of all entities included pursuant to paragraph (g) in the denominators of the apportionment formula. Except as otherwise provided by paragraph (f), all sales of the unitary business made within this state pursuant to section 290.191 or 290.20 must be included on the combined report of a corporation or other entity that is a member of the unitary business and is subject to the jurisdiction of this state to impose tax under this chapter.\n(i) If a corporation has been divested from a unitary business and is included in a combined report for a fractional part of the common accounting period of the combined report:\n(1) its income includable in the combined report is its income incurred for that part of the year determined by proration or separate accounting; and\n(2) its sales, property, and payroll included in the apportionment formula must be prorated or accounted for separately.\n(j) For purposes of this subdivision, \"insurance company\" means an insurance company, as defined in section 290.01, subdivision 5b, that is not a disqualified captive insurance company.\nNotwithstanding subdivisions 3 and 4, all income from the operation of an athletic team when the visiting team does not share in the gate receipts is assigned to the state in which the team's operation is based.\nNonbusiness income is income of the trade or business that cannot be apportioned by this state because of the United States Constitution or the Constitution of the state of Minnesota and includes income that cannot constitutionally be apportioned to this state because it is derived from a capital transaction that solely serves an investment function. Nonbusiness income must be allocated under subdivision 2.\n[Repealed, 1991 c 291 art 7 s 26]",
	"repealed": false
}