{
	"id": "144.698",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.698",
	"title": "144.698 REPORTING REQUIREMENTS.",
	"text": "Each hospital and each outpatient surgical center, which has not filed the financial information required by this section with a voluntary, nonprofit reporting organization pursuant to section 144.702, shall file annually with the commissioner of health after the close of the fiscal year:\n(1) a balance sheet detailing the assets, liabilities, and net worth of the hospital or outpatient surgical center;\n(2) a detailed statement of income and expenses;\n(3) a copy of its most recent cost report, if any, filed pursuant to requirements of Title XVIII of the United States Social Security Act;\n(4) a copy of all changes to articles of incorporation or bylaws;\n(5) information on services provided to benefit the community, including services provided at no cost or for a reduced fee to patients unable to pay, teaching and research activities, or other community or charitable activities;\n(6) information required on the revenue and expense report form set in effect on July 1, 1989, or as amended by the commissioner in rule;\n(7) information on changes in ownership or control;\n(8) other information required by the commissioner in rule;\n(9) information on the number of available hospital beds that are dedicated to certain specialized services, as designated by the commissioner, and annual occupancy rates for those beds, separately for adult and pediatric care;\n(10) from outpatient surgical centers, the total number of surgeries; and\n(11) a report on health care capital expenditures during the previous year, as required by section 62J.17.\nIf more than one licensed hospital or outpatient surgical center is operated by the reporting organization, the commissioner of health may require that the information be reported separately for each hospital and each outpatient surgical center.\nThe commissioner of health may require attestation by responsible officials of the hospital or outpatient surgical center that the contents of the reports are true.\nAll reports, except privileged medical information, filed pursuant to this section, section 144.701 or section 144.702, subdivision 3 or 4 shall be open to public inspection.\nIf the report is not filed or the commissioner of health has reason to believe the report is incomplete or false, the commissioner shall have the right to inspect hospital and outpatient surgical center books, audits, and records.",
	"repealed": false
}