{
	"id": "148.907",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.907",
	"title": "148.907 LICENSED PSYCHOLOGIST.",
	"text": "No person shall engage in the independent practice of psychology unless that person is licensed as a licensed psychologist or is exempt under section 148.9075.\nTo become licensed by the board as a licensed psychologist, an applicant shall comply with the following requirements:\n(1) pass an examination in psychology;\n(2) pass a professional responsibility examination on the practice of psychology;\n(3) pass any other examinations as required by board rules;\n(4) pay nonrefundable fees to the board for applications, processing, testing, renewals, and materials;\n(5) attained the age of majority, be of good moral character, and have no unresolved disciplinary action or complaints pending in the state of Minnesota or any other jurisdiction;\n(6) earned a doctoral degree with a major in psychology from a regionally accredited educational institution meeting the standards the board has established by rule; and\n(7) completed at least one full year or the equivalent in part time of postdoctoral supervised psychological employment in no less than 12 months and no more than 60 months. If the postdoctoral supervised psychological employment goes beyond 60 months, the board may grant a variance to this requirement.\n(a) A person licensed in this state as a licensed consulting psychologist or a licensed psychologist before August 1, 1991, qualifies for licensure as a licensed psychologist, as described in subdivision 2, at the time of license renewal.\n(b) Providing all other licensure requirements have been satisfactorily met, the board shall grant licensure as a licensed psychologist to a person who:\n(1) before November 1, 1991, entered a graduate program at a regionally accredited educational institution granting a master's or doctoral degree with a major in psychology which meets the standards the board has established by rule;\n(2) before December 31, 1997, earned a master's degree or a master's equivalent in a doctoral program at a regionally accredited educational institution and complied with requirements of subdivision 2, clauses (1) to (5), except that the nonrefundable fees for licensure are payable at the time an application for licensure is submitted; and\n(3) before December 31, 1998, completed at least one full year or the equivalent in part time of post-master's supervised psychological employment.\n(c) Notwithstanding paragraph (b), the board shall not grant licensure as a licensed psychologist under this subdivision unless the applicant demonstrates that the applicant was a resident of Minnesota on October 31, 1992, and meets all the requirements for licensure under this subdivision.\nTo convert from licensure as a licensed psychologist at the master's or master's equivalent level to licensure at the doctoral level, a licensed psychologist shall have:\n(1) completed an application provided by the board;\n(2) had an official transcript documenting the conferral of the doctoral degree sent directly from the educational institution to the board;\n(3) paid a nonrefundable fee;\n(4) successfully completed one full year or the equivalent in part time of supervised psychological employment, which shall not include a predoctoral internship, after earning a master's degree or a master's equivalent in a doctoral program;\n(5) successfully completed a predoctoral internship meeting the standards the board has established by rule; and\n(6) earned a doctoral degree with a major in psychology from a regionally accredited educational institution meeting the standards the board has established by rule.\n[Repealed, 1Sp2017 c 6 art 11 s 56]",
	"repealed": false
}