{
	"id": "325F.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.71",
	"title": "325F.71 SENIOR CITIZENS AND DISABLED PERSONS; ADDITIONAL CIVIL PENALTY FOR DECEPTIVE ACTS.",
	"text": "For the purposes of this section, the following words have the meanings given them:\n(a) \"Senior citizen\" means a person who is 62 years of age or older.\n(b) \"Disabled person\" means a person who has an impairment of physical or mental function or emotional status that substantially limits one or more major life activities.\n(c) \"Major life activities\" means functions such as caring for one's self, performing manual tasks, walking, seeing, hearing, speaking, breathing, learning, and working.\n(a) In addition to any liability for a civil penalty pursuant to sections 325D.43 to 325D.48, regarding deceptive trade practices; 325F.67, regarding false advertising; and 325F.68 to 325F.70, regarding consumer fraud; a person who engages in any conduct prohibited by those statutes, and whose conduct is perpetrated against one or more senior citizens or disabled persons, is liable for an additional civil penalty not to exceed $10,000 for each violation, if one or more of the factors in paragraph (b) are present.\n(b) In determining whether to impose a civil penalty pursuant to paragraph (a), and the amount of the penalty, the court shall consider, in addition to other appropriate factors, the extent to which one or more of the following factors are present:\n(1) whether the defendant knew or should have known that the defendant's conduct was directed to one or more senior citizens or disabled persons;\n(2) whether the defendant's conduct caused senior citizens or disabled persons to suffer: loss or encumbrance of a primary residence, principal employment, or source of income; substantial loss of property set aside for retirement or for personal or family care and maintenance; substantial loss of payments received under a pension or retirement plan or a government benefits program; or assets essential to the health or welfare of the senior citizen or disabled person;\n(3) whether one or more senior citizens or disabled persons are more vulnerable to the defendant's conduct than other members of the public because of age, poor health or infirmity, impaired understanding, restricted mobility, or disability, and actually suffered physical, emotional, or economic damage resulting from the defendant's conduct; or\n(4) whether the defendant's conduct caused senior citizens or disabled persons to make an uncompensated asset transfer that resulted in the person being found ineligible for medical assistance.\nRestitution ordered pursuant to the statutes listed in subdivision 2 shall be given priority over imposition of civil penalties designated by the court under this section.\nA person injured by a violation of this section may bring a civil action and recover damages, together with costs and disbursements, including costs of investigation and reasonable attorney's fees, and receive other equitable relief as determined by the court.",
	"repealed": false
}