{
	"id": "147B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/147B.06",
	"title": "147B.06 PROFESSIONAL CONDUCT.",
	"text": "(a) Before treatment of a patient, an acupuncture practitioner shall ask whether the patient has been examined by a licensed physician or other professional, as defined by section 145.61, subdivision 2, with regard to the patient's illness or injury, and shall review the diagnosis as reported.\n(b) The practitioner shall obtain informed consent from the patient, after advising the patient of the following information which must be supplied to the patient in writing before or at the time of the initial visit:\n(1) the practitioner's qualifications including:\n(i) education;\n(ii) license information; and\n(iii) outline of the scope of practice of acupuncturists in Minnesota; and\n(2) side effects which may include the following:\n(i) some pain in the treatment area;\n(ii) minor bruising;\n(iii) infection;\n(iv) needle sickness; or\n(v) broken needles.\n(c) The practitioner shall obtain acknowledgment by the patient in writing that the patient has been advised to consult with the patient's primary care physician about the acupuncture treatment if the patient circumstances warrant or the patient chooses to do so.\n(d) The practitioner shall inquire whether the patient has a pacemaker or bleeding disorder.\nAn acupuncture practitioner shall use sterilized equipment that has been sterilized under standards of the National Centers for Disease Control and Prevention.\nAn acupuncture practitioner shall comply with all applicable state and municipal requirements regarding public health.\nThe scope of practice of acupuncture includes, but is not limited to, the following:\n(1) using Oriental medical theory to assess and diagnose a patient;\n(2) using Oriental medical theory to develop a plan to treat a patient. The treatment techniques that may be chosen include:\n(i) insertion of sterile acupuncture needles through the skin;\n(ii) acupuncture stimulation including, but not limited to, electrical stimulation or the application of heat;\n(iii) cupping;\n(iv) dermal friction;\n(v) acupressure;\n(vi) herbal therapies;\n(vii) dietary counseling based on traditional Chinese medical principles;\n(viii) breathing techniques;\n(ix) exercise according to Oriental medical principles; or\n(x) Oriental massage.\nAn acupuncturist shall maintain a patient record for each patient treated, including:\n(1) a copy of the informed consent;\n(2) evidence of a patient interview concerning the patient's medical history and current physical condition;\n(3) evidence of a traditional acupuncture examination and diagnosis;\n(4) record of the treatment including points treated; and\n(5) evidence of evaluation and instructions given to the patient.\nReferral to other health care practitioners is required when an acupuncturist practitioner sees patients with potentially serious disorders including, but not limited to:\n(1) cardiac conditions including uncontrolled hypertension;\n(2) acute, severe abdominal pain;\n(3) acute, undiagnosed neurological changes;\n(4) unexplained weight loss or gain in excess of 15 percent of the body weight in less than a three-month period;\n(5) suspected fracture or dislocation;\n(6) suspected systemic infections;\n(7) any serious undiagnosed hemorrhagic disorder; and\n(8) acute respiratory distress without previous history.\nThe acupuncturist shall request a consultation or written diagnosis from a licensed physician for patients with potentially serious disorders.\nData maintained on an acupuncture patient by an acupuncture practitioner is subject to section 144.336.",
	"repealed": false
}