{
	"id": "142A.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.611",
	"title": "142A.611 FEDERAL, STATE, AND LOCAL SHARES.",
	"text": "For the purposes of determining a child's eligibility under title IV-E of the Social Security Act for a child in foster care, the financially responsible agency shall use the eligibility requirements outlined in section 472 of the Social Security Act. For a child who qualifies for Northstar kinship assistance or adoption assistance, the financially responsible agency and the commissioner shall use the eligibility requirements outlined in section 473 of the Social Security Act. In each case, the agency paying the maintenance payments must be reimbursed for the costs from the federal money available for this purpose.\nThe commissioner shall pay the state share of the maintenance payments as determined under subdivision 4, and an identical share of the pre-Northstar Care foster care program under section 260C.4411, subdivision 1, the relative custody assistance program under section 142A.65, and the pre-Northstar Care for Children adoption assistance program under chapter 259A.\n(a) The financially responsible agency at the time of placement for foster care or finalization of the agreement for Northstar kinship assistance or adoption assistance shall pay the local share of the maintenance payments as determined under subdivision 4, and an identical share of the pre-Northstar Care for Children foster care program under section 260C.4411, subdivision 1, the relative custody assistance program under section 142A.65, and the pre-Northstar Care for Children adoption assistance program under chapter 259A.\n(b) The financially responsible agency shall pay the entire cost of any initial clothing allowance, administrative payments to child caring agencies specified in section 317A.907, or other support services it authorizes, except as provided under other provisions of law.\n(c) In cases of federally required adoption assistance where there is no financially responsible agency as provided in section 142A.606, subdivision 5, the commissioner shall pay the local share.\n(d) When an Indian child being placed in Minnesota meets title IV-E eligibility defined in section 473(d) of the Social Security Act and is receiving Northstar kinship assistance or adoption assistance, the agency or entity assuming responsibility for the child is responsible for the nonfederal share of the payment.\n(a) The commissioner shall establish a percentage share of the maintenance payments, reduced by federal reimbursements under title IV-E of the Social Security Act, to be paid by the state and to be paid by the financially responsible agency.\n(b) These state and local shares must initially be calculated based on the ratio of the average appropriate expenditures made by the state and all financially responsible agencies during calendar years 2011, 2012, 2013, and 2014. For purposes of this calculation, appropriate expenditures for the financially responsible agencies must include basic and difficulty of care payments for foster care reduced by federal reimbursements, but not including any initial clothing allowance, administrative payments to child care agencies specified in section 317A.907, child care, or other support or ancillary expenditures. For purposes of this calculation, appropriate expenditures for the state shall include adoption assistance and relative custody assistance, reduced by federal reimbursements.\n(c) For each of the periods January 1, 2015, to June 30, 2016, and fiscal years 2017, 2018, and 2019, the commissioner shall adjust this initial percentage of state and local shares to reflect the relative expenditure trends during calendar years 2011, 2012, 2013, and 2014, taking into account appropriations for Northstar Care for Children and the turnover rates of the components. In making these adjustments, the commissioner's goal shall be to make these state and local expenditures other than the appropriations for Northstar Care for Children to be the same as they would have been had Northstar Care for Children not been implemented, or if that is not possible, proportionally higher or lower, as appropriate. Except for adjustments so that the costs of the phase-in are borne by the state, the state and local share percentages for fiscal year 2019 must be used for all subsequent years.\n(a) The commissioner shall adjust the expenditures under subdivision 4 by each financially responsible agency so that its relative share is proportional to its foster care expenditures, with the goal of making the local share similar to what the county or tribe would have spent had Northstar Care for Children not been enacted.\n(b) For the period January 1, 2015, to June 30, 2016, the relative shares must be as determined under subdivision 4 for calendar years 2011, 2012, 2013, and 2014 compared with similar costs of all financially responsible agencies.\n(c) For subsequent fiscal years, the commissioner shall update the relative shares based on actual utilization of Northstar Care for Children by the financially responsible agencies during the previous period, so that those using relatively more than they did historically are adjusted upward and those using less are adjusted downward.\n(d) The commissioner must ensure that the adjustments are not unduly influenced by onetime events, anomalies, small changes that appear large compared to a narrow historic base, or fluctuations that are the results of the transfer of responsibilities to tribal social service agencies authorized in section 142A.03, subdivision 9, as part of the American Indian Child Welfare Initiative.",
	"repealed": false
}