{
	"id": "458D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.02",
	"title": "458D.02 DEFINITIONS.",
	"text": "The terms defined in this section shall have the meaning given them unless otherwise provided or indicated by the context.\n\"Western Lake Superior Sanitary District\" and \"district\" mean the area over which the sanitary board has jurisdiction which shall include the area comprised on July 8, 1971, of the city of Cloquet, the cities of Carlton, Scanlon, Thomson and Wrenshall, and the townships of Knife Falls, Silver Brook, Thomson, and Twin Lakes in the county of Carlton; the city of Duluth, the city of Proctor, and the townships of Canosia, Duluth, Grand Lake, Herman, Lakewood, Midway, Rice Lake and Solway in the county of St. Louis; other territory included in the district pursuant to section 458D.22; and any waters of the state adjacent thereto.\n\"Sanitary board\" or \"board\" means the sanitary board established for the Western Lake Superior Sanitary District as provided in section 458D.03.\n\"Person\" means any individual, partnership, corporation, cooperative or other organization or entity, public or private.\n\"Local government unit\" or \"government unit\" means any municipal or public corporation or governmental or political subdivision or agency located in whole or in part in the district, authorized by law to provide for the collection and disposal of sewage.\n\"Acquisition\" and \"betterment\" shall have the meanings given to them in chapter 475.\n\"Agency\" means the Minnesota Pollution Control Agency created and established by chapter 116.\n\"Sewage\" means all liquid or water-carried waste products from whatever sources derived, together with such groundwater infiltration and surface water as may be present and shall also include shipboard effluent.\n\"Pollution\", \"sewer system\" and \"waters of the state\" shall have the meanings given them in section 115.01.\n\"Shipboard effluent\" means water-carried waste products and other wastes which are found on ships, boats and other vessels and which may pollute or tend to pollute the St. Louis River basin area or other waters of the state adjacent to the district.\n\"Treatment works\" and \"disposal system\" shall have the meanings given them in section 115.01, and shall also include facilities for the collections, removal and treatment of shipboard effluent.\n\"Interceptor\" means any sewer and necessary appurtenances thereto, including but not limited to, mains, pumping stations, and sewage flow regulating and measuring stations, which is designed for or used to conduct sewage originating in more than one local government unit, or which is designed or used to conduct all or substantially all the sewage originating in a single local government unit from a point of collection in that unit to an interceptor or treatment works outside that unit, or which is determined by the board to be a major collector of sewage used or designed to serve a substantial area in the district.\n\"District disposal system\" means any and all of the interceptors or treatment works owned, constructed or operated by the board unless designated by the board as local sanitary sewer facilities.\n\"Local sanitary sewer facilities\" means all or any part of any disposal system in the district other than the district disposal system.\n\"Municipality\" means any home rule charter or statutory city or town located in whole or in part in the district.\n\"Total costs of acquisition and betterment\" and \"costs of acquisition and betterment\" mean all acquisition and betterment expenses which are permitted to be financed out of bond proceeds issued in accordance with section 458D.14, subdivision 4, whether or not such expenses are in fact financed out of such bond proceeds.\n\"Current costs of acquisition, betterment and debt service\" means interest and principal estimated to be due during the budget year on bonds issued to finance said acquisition and betterment and all other costs of acquisition and betterment estimated to be incurred during such year but not otherwise payable out of bond proceeds and federal or state grants.\n\"Solid waste\" means garbage, refuse, sludge from a water supply treatment plant or air contaminant treatment facility, and other discarded waste materials and sludges, in solid, semisolid, liquid, or contained gaseous form, resulting from industrial, commercial, mining, and agricultural operations, and from community activities, but does not include hazardous waste; animal waste used as fertilizer; earthen fill, boulders, or rock; sewage sludge; solid or dissolved material in domestic sewage or other common pollutants in water resources, such as silt, dissolved or suspended solids in industrial wastewater effluents or discharges which are point sources subject to permits under section 402 of the Federal Water Pollution Control Act, as amended, and dissolved material in irrigation return flows; or source, special nuclear, or by-product material as defined by the Atomic Energy Act of 1954, as amended.\n\"Solid waste disposal site or facility\" means transfer stations and all property, real or personal, including negative and positive easements and water and air rights, which is or may be needed or useful for the disposal of solid waste, except property for the collection of solid waste directly from the source of generation.\n\"Transfer station\" means an intermediate solid waste disposal facility in which solid waste collected from any source is temporarily deposited to await transportation to the final disposal site or facility, but does not include the hauling of solid waste from a transfer station to a disposal site or facility, nor does it include processing of solid waste at a disposal site or facility.\n\"Collection of solid waste\" means the door-to-door pickup and hauling of solid waste from pickup point to transfer station or disposal site or facility, but does not include the hauling of solid waste from a transfer station to a disposal site or facility, nor does it include the processing of solid waste at a disposal site or facility.",
	"repealed": false
}