{
	"id": "524.5-202",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-202",
	"title": "524.5-202 PARENTAL APPOINTMENT OF GUARDIAN.",
	"text": "(a) A guardian may be appointed by will, by designation of a standby guardian pursuant to chapter 257B, or by other signed writing executed in the same manner as a health care directive under chapter 145C by a parent for any minor child the parent has or may have in the future. The appointment may specify the desired limitations on the powers to be given to the guardian. The appointing parent may revoke or amend the appointment prior to court confirmation.\n(b) Upon petition of an appointing parent and a finding that the appointing parent will likely become unable to care for the child within two years or less, and after notice as provided in section 524.5-205, paragraph (b), the court, before the appointment becomes effective, may confirm the parent's selection of a guardian and terminate the rights of others to object.\n(c) Subject to section 524.5-203, the appointment of a guardian becomes effective upon the appointing parent's death, an adjudication that the parent is an incapacitated person, or a written determination by a physician who has examined the parent that the parent is no longer able to care for the child, whichever occurs first.\n(d) The guardian becomes eligible to act upon the filing of an acceptance of appointment, which must be filed within 30 days following the effective date of the guardian's appointment. The guardian shall:\n(1) file the acceptance of appointment and a copy of the will with the court of the county in which the will was or could be probated or, in the case of another appointing instrument, file the acceptance of appointment and the appointing instrument with the court of the county in which the minor resides or is present; and\n(2) give written notice of the acceptance of appointment to the appointing parent, if living, the minor, if the minor has attained 14 years of age, and a person other than the parent having care and custody of the minor.\n(e) Unless the appointment was previously confirmed by the court, the notice given under paragraph (d), clause (2), must include a statement of the right of those notified to terminate the appointment by filing a written objection in the court as provided in section 524.5-203.\n(f) Unless the appointment was previously confirmed by the court, within 30 days after filing the notice and the appointing instrument, a guardian shall petition the court for confirmation of the appointment, giving notice in the manner provided in section 524.5-205, paragraph (b).\n(g) The appointment of a guardian by a parent does not supersede the parental rights of either parent. If both parents are dead or have been adjudged incapacitated persons, an appointment by the last parent who dies or was adjudged incapacitated has priority. An appointment by a parent which is effected by filing the guardian's acceptance under a will probated in the state of the testator's domicile is effective in this state.\n(h) The powers of a guardian who timely complies with the requirements of paragraphs (d) and (e) relate back to give acts by the guardian which are of benefit to the minor and occurred on or after the date the appointment became effective the same effect as those that occurred after the filing of the acceptance of the appointment.\n(i) The authority of a guardian appointed under this section terminates upon the first to occur of the appointment of a guardian by the court or the giving of written notice to the guardian of the filing of an objection pursuant to section 524.5-203.",
	"repealed": false
}