{
	"id": "103I.525",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.525",
	"title": "103I.525 WELL CONTRACTOR'S LICENSE; REPRESENTATIVE'S CERTIFICATION.",
	"text": "(a) A person must file an application and application fee with the commissioner to represent a well contractor.\n(b) The application must state the applicant's qualifications for certification as a representative, and other information required by the commissioner. The application must be on forms prescribed by the commissioner.\n(a) The application fee for certification as a representative of a well contractor is $75. The commissioner may not act on an application until the application fee is paid.\n(b) The renewal fee for certification as a representative of a well contractor is $75. The commissioner may not renew a certification until the renewal fee is paid.\n(c) A certified representative must file an application and a renewal application fee to renew the certification by the date stated in the certification. The renewal application must include information that the certified representative has met continuing education requirements established by the commissioner by rule.\nAfter the commissioner has approved the application, the applicant must take an examination given by the commissioner.\nIf an applicant meets the experience requirements established by rule and passes the examination as determined by the commissioner, the commissioner shall issue the applicant a certification to represent a well contractor.\nIf a person employs a certified representative, submits the bond under subdivision 5, and pays the license fee under subdivision 6, the commissioner shall issue a well contractor's license.\n(a) As a condition of being issued a well contractor's license, the applicant must submit a corporate surety bond for $25,000 approved by the commissioner. The bond must be conditioned to pay the state on performance of work in this state that is not in compliance with this chapter or rules adopted under this chapter. The bond is in lieu of other license bonds required by a political subdivision of the state.\n(b) From proceeds of the bond, the commissioner may compensate persons injured or suffering financial loss because of a failure of the applicant to perform work or duties in compliance with this chapter or rules adopted under this chapter.\nThe fee for a well contractor's license is $250.\nA well contractor's license is valid until the date prescribed in the license by the commissioner.\n(a) A licensee must file an application and a renewal application fee to renew the license by the date stated in the license.\n(b) The renewal application fee for a well contractor's license is $250.\n(c) The renewal application must include information that the certified representative of the applicant has met continuing education requirements established by the commissioner by rule.\n(d) At the time of the renewal, the commissioner must have on file all properly completed well and boring construction reports, well and boring sealing reports, reports of elevator borings, water sample analysis reports, well and boring permits, and well notifications for work conducted by the licensee since the last license renewal.\nIf a licensee fails to submit all information required for renewal in subdivision 8 or submits the application and information after the required renewal date:\n(1) the licensee must include a late fee of $75; and\n(2) the licensee may not conduct activities authorized by the well contractor's license until the renewal application, renewal application fee, late fee, and all other information required in subdivision 8 are submitted.",
	"repealed": false
}