{
	"id": "135A.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.137",
	"title": "135A.137 HUNGER-FREE CAMPUS DESIGNATION.",
	"text": "(a) A Hunger-Free Campus designation is established for public postsecondary institutions and for nonprofit degree-granting institutions physically located in Minnesota and registered with the Office of Higher Education under section 136A.63. In order to be awarded the designation, an institution must meet the following minimum criteria:\n(1) have an established on-campus food pantry or partnership with a local food bank to provide regular, on-campus food distributions;\n(2) provide information to students on SNAP, MFIP, and other programs that reduce food insecurity. The institution shall notify students in work-study employment of their potential eligibility for SNAP benefits and provide information to those students that includes eligibility criteria and how to apply for benefits;\n(3) hold or participate in one hunger awareness event per academic year;\n(4) have an established emergency assistance grant that is available to students; and\n(5) establish a hunger task force that meets a minimum of three times per academic year. The task force must include at least two students currently enrolled at the institution.\n(b) Each institution must reapply at least every four years to maintain the designation.\nThe student advisory council under section 136A.031 shall create an application process for institutions applying for grant funds. The student advisory council shall review applications and make recommendations to the commissioner. The commissioner shall have final approval for the designation and the award amount.\n(a) Institutions eligible for a grant under this subdivision include public postsecondary institutions, nonprofit private postsecondary institutions, and Tribal colleges.\n(b) The commissioner shall establish a competitive grant program to distribute grants to eligible institutions to meet and maintain the requirements under subdivision 1, paragraph (a). Initial grants shall be made to institutions that have not earned the designation and demonstrate a need for funding to meet the hunger-free campus designation requirements. Sustaining grants shall be made to institutions that have earned the designation and demonstrate both a partnership with a local food bank or organization that provides regular, on-campus food distributions and a need for funds to maintain the requirements under subdivision 1, paragraph (a).\n(c) The commissioner shall give preference to applications for initial grants and to applications from institutions with the highest number of federal Pell Grant eligible students enrolled. The commissioner shall consider the head count at the institution when awarding grants. The maximum grant award for an initial institution designation is $25,000. The maximum grant award for sustaining an institution designation is $15,000.\n(d) The commissioner, in collaboration with student associations representing eligible institutions, shall create an application process and establish selection criteria for awarding the grants.\n(e) No more than 20 percent of the total grant awards each fiscal year shall be for grants to nonprofit private postsecondary institutions.\n(a) An eligible institution that receives a grant under subdivision 3 must:\n(1) use the grant funds to meet or maintain the minimum criteria of a hunger-free campus designation under subdivision 1; and\n(2) match at least 50 percent of the grant amount awarded with funds or in-kind resources.\n(b) In addition to the requirements of paragraph (a), in order to receive a sustaining grant, an institution must demonstrate a partnership with a local food bank or organization or other source of funding that ensures regular, on-campus distributions.",
	"repealed": false
}