{
	"id": "174.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.70",
	"title": "174.70 PUBLIC SAFETY RADIO COMMUNICATIONS.",
	"text": "The commissioner of transportation may exercise the powers granted in this chapter and in sections 403.21 to 403.34, to plan and implement the communications system as provided in sections 403.21 to 403.34.\n(a) In order to facilitate construction and maintenance of the state's communications systems and to reduce the proliferation of communications towers, the commissioner may, by purchase, lease, gift, exchange, or other means, obtain sites for the erection of towers and the location of equipment and may construct buildings and structures needed for developing the state's communications systems.\n(b) The commissioner may negotiate with commercial wireless service providers and other tower owners to obtain sites, towers, and equipment. Notwithstanding sections 161.433, 161.434, 161.45, and 161.46, the commissioner may by agreement lease, allow, or permit commercial wireless service providers or other tower owners to install privately owned equipment on state-owned lands, buildings, and other structures under the jurisdiction of the commissioner when it is practical and feasible to do so. The commissioner shall annually publish a list of state-owned tower sites that are available to commercial wireless service providers and other tower owners for installation of their equipment on a first-come, first-served basis for each tower or site. The commissioner may not make agreements that grant the exclusive use of towers. After the commissioner has agreed to make space available on a specific tower or at a specific site, the commissioner shall charge a site use fee for the value of the real property or structure made available. In lieu of a site use fee, the commissioner may make agreements with commercial wireless service providers or other tower owners to place state equipment on privately owned towers and may accept improvements such as tower reinforcement, reconstruction, site development, or other site improvements to the state's communications system facilities or real or personal property.\n(c) This section does not create a right to install privately owned towers on the trunk highway right-of-way.\nFees collected under subdivision 2 must be deposited in the trunk highway fund. The fees collected are appropriated to the commissioner to pay for developing and maintaining the communications systems that serve state agencies.",
	"repealed": false
}