{
	"id": "144.1509",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1509",
	"title": "144.1509 PEDIATRIC PRIMARY CARE MENTAL HEALTH TRAINING GRANT PROGRAM.",
	"text": "The commissioner of health shall establish a pediatric primary care mental health training grant program. The commissioner shall award grants for the development of child mental health training programs that are located in outpatient primary care clinics. To be eligible for a grant, a training program must:\n(1) focus on the training of pediatric primary care providers working with multidisciplinary mental health teams;\n(2) provide training on conducting comprehensive clinical mental health assessments and potential pharmacological therapy;\n(3) provide psychiatric consultation to pediatric primary care providers during their outpatient pediatric primary care experiences;\n(4) emphasize longitudinal care for patients with behavioral health needs; and\n(5) develop partnerships with community resources.\n(a) Child mental health training grants may be awarded to eligible primary care training programs to plan and implement new programs or expand existing programs in child mental health training.\n(b) Money may be spent to cover the costs of:\n(1) planning related to implementing or expanding child mental health training in an outpatient primary care clinic setting;\n(2) training site improvements, fees, equipment, and supplies required for implementation of the training programs; and\n(3) supporting clinical training in the outpatient primary clinic sites.\nEligible primary care training programs seeking a grant must apply to the commissioner. Applications must include the location of the training; a description of the training program, including all costs associated with the training program; all sources of money for the training program; detailed uses of all money for the training program; the results expected; and a plan to maintain the training program after the grant period. The applicant must describe achievable objectives and a timetable for the training program.\nThe commissioner shall review each application to determine whether the application meets the stated goals of the grant and shall award grants to support up to four training program proposals.\nDuring the grant period, the commissioner may require and collect from grantees any information necessary to evaluate the training program.",
	"repealed": false
}