{
	"id": "117.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.085",
	"title": "117.085 COMMISSIONERS, POWERS, DUTIES.",
	"text": "The commissioners, having been duly sworn and qualified according to law, shall meet as directed by the order of appointment and hear the allegations and proofs of all persons interested touching the matters to them committed. They may adjourn from time to time and from place to place within the county, giving oral notice to those present of the time and place of their next meeting. All testimony taken by them shall be given publicly, under oath, and in their presence. They shall view the premises, and any of them may subpoena witnesses, which shall be served as subpoenas in civil actions are served, and at the cost of the parties applying therefor. If deemed necessary, they may require the petitioner or owner to furnish for their use maps, plats, and other information which the petitioner or owner may have showing the nature, character, and extent of the proposed undertaking and the situation of lands desired therefor. In proper cases they may reserve to the owner a right-of-way or other privilege in or over the land taken, or attach reasonable conditions to such taking in addition to the damages given or they may make an alternative award, conditioned upon the granting or withholding of the right specified. Without unreasonable delay they shall make a separate assessment and award of the damages which in their judgment will result to each of the owners of the land by reason of such taking and report the same to the court. The commissioners shall not reduce the amount of the damages awarded because the land being taken is, at the time of the taking, valued under section 273.111, designated as an agricultural preserve under chapter 473H. The commissioners, in all such proceedings, may in their discretion allow and show separately in addition to the award of damages, reasonable appraisal fees not to exceed a total of $1,500 for single family and two-family residential property and minimum damage acquisitions and $5,000 for other types of property, unless the appraised fee was reimbursed under section 117.036. Upon request of an owner the commissioners shall show in their report the amount of the award of damages which is to reimburse the owner and tenant or lessee for the value of the land taken, and the amount of the award of damages, if any, which is to reimburse the owner and tenant or lessee for damages to the remainder involved, whether or not described in the petition. The amounts awarded to each person shall also be shown separately. The commissioners shall, if requested by any party, make an express finding of the estimated cost of removal and remedial actions that will be necessary on the taken property because of existing environmental contamination.",
	"repealed": false
}