{
	"id": "16A.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.103",
	"title": "16A.103 FORECASTS OF REVENUE AND EXPENDITURES.",
	"text": "In February and November each year, the commissioner shall prepare a forecast of state revenue and expenditures. The November forecast must be delivered to the legislature and governor no later than December 6. The February forecast must be delivered to the legislature and governor by the end of February. Forecasts must be delivered to the legislature and governor on the same day. If requested by the Legislative Commission on Planning and Fiscal Policy, delivery to the legislature must include a presentation to the commission.\nThe forecast must assume the continuation of current laws and reasonable estimates of projected growth in the national and state economies and affected populations. Revenue must be estimated for all sources provided for in current law. Expenditures must be estimated for all obligations imposed by law and those projected to occur as a result of inflation and variables outside the control of the legislature.\nIn determining the rate of inflation, the application of inflation, the amount of state bonding as it affects debt service, the calculation of investment income, and the other variables to be included in the expenditure part of the forecast, the commissioner must consult with the chairs and lead minority members of the senate Finance Committee and the house of representatives Ways and Means Committee, and legislative fiscal staff. This consultation must occur at least three weeks before the forecast is to be released. No later than two weeks prior to the release of the forecast, the commissioner must inform the chairs and lead minority members of the senate Finance Committee and the house of representatives Ways and Means Committee, and legislative fiscal staff of any changes in these variables from the previous forecast.\nState agencies must submit any revisions in expenditure data the commissioner determines necessary for the forecast to the commissioner at least four weeks prior to the release of the forecast. The information submitted by state agencies and any modifications to that information made by the commissioner must be made available to legislative fiscal staff no later than three weeks prior to the release of the forecast.\nOn a monthly basis, the commissioner must provide legislative fiscal staff with an update of the previous month's state revenues no later than 12 days after the end of that month.\nThe commissioner must review economic information including economic forecasts with legislative fiscal staff no later than two weeks before the forecast is released. The commissioner must invite the chairs and lead minority members of the senate Finance Committee and the house of representatives Ways and Means Committee, and legislative fiscal staff to attend any meetings held with outside economic advisors. The commissioner must provide legislative fiscal staff with monthly economic forecast information received from outside sources.\nIn addition, the commissioner shall forecast Minnesota personal income for each of the years covered by the forecast and include these estimates in the forecast documents.\nA forecast prepared during the first fiscal year of a biennium must cover that biennium and the next biennium. A forecast prepared during the second fiscal year of a biennium must cover that biennium and the next two bienniums.\nThe commissioner shall report to the legislature within 14 days of a forecast under subdivision 1 on uncertainty in Minnesota's general fund revenue projections. The report shall present information on: (1) the estimated range of forecast error for revenues; and (2) the data and methods used to construct those measurements.\nBy October 15 of each odd-numbered year, the commissioner shall prepare a detailed fund balance analysis of the general fund for the previous biennium. The analysis shall include a comparison to the most recent publicly available fund balance analysis of the general fund. The commissioner shall provide this analysis to the chairs and ranking minority members of the house of representatives Ways and Means Committee and the senate Finance Committee, and shall post the analysis on the agency's website.\nIn preparing the forecast of state revenues and expenditures under subdivision 1, the commissioner must include estimates of the amount of federal reimbursement for administrative costs for the Department of Human Services and the Department of Children, Youth, and Families in the forecast as an expenditure reduction. The amount included under this subdivision must conform with generally accepted accounting principles.\nIn February and November of each year, the commissioner of revenue shall prepare and deliver to the governor and the legislature forecasts of revenue to be received by school districts as a group, counties as a group, and the group of cities and towns that have a population of more than 2,500. The forecasts must assume the continuation of current laws, projections of valuation changes in real property, and reasonable estimates of projected growth in the national and state economies and affected populations. Revenue must be estimated for property taxes, state and federal aids, local sales taxes, if any, and a single projection for all other revenue for each group of affected local governmental units.\n[Repealed, 1999 c 250 art 1 s 115]\n[Repealed, 2013 c 134 s 31]",
	"repealed": false
}