{
	"id": "116L.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.43",
	"title": "116L.43 TARGETED POPULATIONS WORKFORCE GRANTS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Community-based organization\" means a nonprofit organization that:\n(1) provides workforce development programming or services;\n(2) has its primary office located in a historically underserved community of color or low-income community; and\n(3) serves a population that generally reflects the demographics of that local community.\n(c) \"Entry level jobs\" means part-time or full-time jobs that an individual can perform without any prior education or experience.\n(d) \"High wage\" means the income needed for a family to cover minimum necessary expenses in a given geographic area, including food, child care, health care, housing, and transportation.\n(e) \"Industry specific certification\" means a credential an individual can earn to show proficiency in a particular area or skill.\n(f) \"Remedial training\" means additional training provided to staff following the identification of a need and intended to increase proficiency in performing job tasks.\n(g) \"Small business\" has the same meaning as section 645.445.\n(a) The commissioner shall establish a job and entrepreneurial skills training grant program that must provide competitive funding to community-based organizations to provide skills training that leads to employment or business development in high-growth industries.\n(b) Eligible forms of skills training include:\n(1) student tutoring and testing support services;\n(2) training and employment placement in high-wage and high-growth employment;\n(3) assistance in obtaining industry specific certifications;\n(4) remedial training leading to enrollment in further training or education;\n(5) real-time work experience or on-the-job training;\n(6) career and educational counseling;\n(7) work experience and internships;\n(8) supportive services;\n(9) tuition reimbursement for new entrants into public sector careers;\n(10) career mentorship;\n(11) postprogram case management services;\n(12) job placement services; and\n(13) the cost of corporate board of director training for people of color.\n(c) Grant awards must not exceed $750,000 per year per organization and all funding awards must be made for the duration of a biennium. An organization may partner with another organization to utilize grant awards, provided that the organizations must not be funded to deliver the same services. Grants related to entrepreneurial skills training awarded under this subdivision are not subject to section 116L.98.\n(a) The commissioner shall establish a diversity and inclusion training grant program which shall provide competitive grants to small businesses for diversity and inclusion training, including the creation and implementation of a plan to actively engage, hire, and retain people of color for both entry level and high-wage opportunities, including management and board of director positions.\n(b) Grant awards must not exceed $30,000 per business. A business may only receive one grant for diversity and inclusion training per biennium.\n(c) Applicants are required to submit a plan for use of the funds. Grant recipients are required to submit a diversity and inclusion implementation plan after training is completed.\n(d) Grants awarded under this subdivision are not subject to section 116L.98.\n(e) Sections 116J.993 to 116J.995 do not apply to assistance under this subdivision.\n(a) The commissioner shall establish a capacity building grant program to provide training services and funding for capacity building to community-based organizations.\n(b) Eligible uses of grant awards include covering the cost of workforce program delivery staff, program infrastructure costs, and workforce training related service model development.\n(c) Grant awards must not exceed $50,000 per organization and are limited to one grant per community-based organization.\n(d) Grants awarded under this subdivision are not subject to section 116L.98.\n(e) Grant recipients must submit a report to the commissioner outlining the use of grant funds and the impact of that funding on the community-based organization's future ability to provide workforce development services.",
	"repealed": false
}