{
	"id": "275.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.07",
	"title": "275.07 CITY, TOWN, COUNTY, AND SCHOOL DISTRICT TAXES.",
	"text": "(a) Except as provided under paragraph (b), the taxes voted by cities, counties, school districts, and special districts shall be certified by the proper authorities to the county auditor on or before five working days after December 20 in each year. A town must certify the levy adopted by the town board to the county auditor by September 30 each year. If the town board modifies the levy at a special town meeting after September 30, the town board must recertify its levy to the county auditor on or before five working days after December 20. If a city, town, county, school district, or special district fails to certify its levy by that date, its levy shall be the amount levied by it for the preceding year.\n(b)(i) The taxes voted by counties under sections 103B.241, 103B.245, and 103B.251 shall be separately certified by the county to the county auditor on or before five working days after December 20 in each year. The taxes certified shall not be reduced by the county auditor by the aid received under section 273.1398, subdivision 3. If a county fails to certify its levy by that date, its levy shall be the amount levied by it for the preceding year.\n(ii) For purposes of the proposed property tax notice under section 275.065 and the property tax statement under section 276.04, for the first year in which the county implements the provisions of this paragraph, the county auditor shall reduce the county's levy for the preceding year to reflect any amount levied for water management purposes under clause (i) included in the county's levy.\nMS 2002 [Repealed, 2004 c 228 art 3 s 18]\n(a) In school districts lying in more than one county, the clerk shall certify the tax levied to the auditor of the county in which the administrative offices of the school district are located.\n(b) The district must identify the portion of the school district levy that is levied for debt service at the time the levy is certified under this section. For the purposes of this paragraph, \"levied for debt service\" means levies authorized under sections 123B.53, 123B.535, and 123B.55, as adjusted by sections 126C.46 and 126C.48, net of any debt excess levy reductions under section 475.61, subdivision 4, excluding debt service amounts necessary for repayment of other postemployment benefits under section 475.52, subdivision 6.\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\n(a) On or before October 8 of each year, the county auditor shall report to the commissioner of revenue the proposed levy certified by local units of government under section 275.065, subdivision 1. If any taxing authorities have notified the county auditor that they are in the process of negotiating an agreement for sharing, merging, or consolidating services but that when the proposed levy was certified under section 275.065, subdivision 1c, the agreement was not yet finalized, the county auditor shall supply that information to the commissioner when filing the report under this section and shall recertify the affected levies as soon as practical after October 10.\n(b) On or before January 15 of each year, the county auditor shall report to the commissioner of revenue the final levy certified by local units of government under subdivision 1.\n(c) The levies must be reported in the manner prescribed by the commissioner.\nMS 2002 [Repealed, 2004 c 228 art 3 s 18]\nIf a local government's December aid or credit payments under sections 477A.011 to 477A.014 and 273.1384 are reduced due to unallotment under section 16A.152, the local government may recertify its levy under subdivision 1 by January 15 of the year in which the levy will be paid. The local government must report the recertified amount to the county auditor within two business days of January 15 or the levy will remain at the amount certified under subdivision 1. Notwithstanding subdivision 4, the county auditor shall report to the commissioner of revenue any recertified levies under this subdivision by January 30 of the year in which the levy will be paid.",
	"repealed": false
}