{
	"id": "35.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.05",
	"title": "35.05 AUTHORITY OF STATE BOARD.",
	"text": "(a) The state board may quarantine or kill any domestic animal infected with, or which has been exposed to, a contagious or infectious dangerous disease if it is necessary to protect the health of the domestic animals of the state.\n(b) The board may regulate or prohibit the arrival in and departure from the state of infected or exposed animals and, in case of violation of any rule or prohibition, may detain any animal at its owner's expense. The board may regulate or prohibit the importation of domestic animals which, in its opinion, may injure the health of Minnesota livestock.\n(c) When the governor declares an emergency under section 35.0661, the board, through its executive director, may assume control of such resources within the University of Minnesota's Veterinary Diagnostic Laboratory as necessary to effectively address the disease outbreak. The director of the laboratory and other laboratory personnel must cooperate fully in performing necessary functions related to the outbreak or threatened outbreak.\n(d) The board may test or require tests of any bovine or cervidae in the state when the board deems it necessary to achieve or maintain bovine tuberculosis accredited free state or zone status under the regulations and laws administered by the United States Department of Agriculture.\n(e) Notwithstanding section 3.3005, subdivision 2, the board may apply for, receive, and disburse federal money made available to the state for animal disease response. All federal money received by the board for this purpose must be deposited in the state treasury and is appropriated to the board for the purposes for which it was received. By January 15 each year, the board must report to the senate Committee on Finance, the house of representatives Committee on Ways and Means, and the legislative committees with jurisdiction over the board's operating budget regarding the amount of federal money received and spent in the previous fiscal year under this paragraph and the board's use of these funds.",
	"repealed": false
}