{
	"id": "3.732",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.732",
	"title": "3.732 SETTLEMENT OF CLAIMS.",
	"text": "As used in this section and section 3.736 the terms defined in this section have the meanings given them.\n(1) \"State\" includes each of the departments, boards, agencies, commissions, courts, and officers in the executive, legislative, and judicial branches of the state of Minnesota and includes but is not limited to the Housing Finance Agency, the Minnesota Office of Higher Education, the Higher Education Facilities Authority, the Health Technology Advisory Committee, the Armory Building Commission, the Zoological Board, the Department of Iron Range Resources and Rehabilitation, the Minnesota Historical Society, the State Agricultural Society, the University of Minnesota, the Minnesota State Colleges and Universities, state hospitals, and state penal institutions. It does not include a city, town, county, school district, or other local governmental body corporate and politic.\n(2) \"Employee of the state\" means all present or former officers, members, directors, or employees of the state, members of the Minnesota National Guard, members of a bomb disposal unit approved by the commissioner of public safety and employed by a municipality defined in section 466.01 when engaged in the disposal or neutralization of bombs or other similar hazardous explosives, as defined in section 299C.063, outside the jurisdiction of the municipality but within the state, or persons acting on behalf of the state in an official capacity, temporarily or permanently, with or without compensation. It does not include either an independent contractor except, for purposes of this section and section 3.736 only, a guardian ad litem acting under court appointment, or members of the Minnesota National Guard while engaged in training or duty under United States Code, title 10, or title 32, section 316, 502, 503, 504, or 505, as amended through December 31, 1983. Notwithstanding sections 43A.02 and 611.263, for purposes of this section and section 3.736 only, \"employee of the state\" includes a district public defender or assistant district public defender in the Second or Fourth Judicial District, a member of the Health Technology Advisory Committee, and any officer, agent, or employee of the state of Wisconsin performing work for the state of Minnesota pursuant to a joint state initiative.\n(3) \"Scope of office or employment\" means that the employee was acting on behalf of the state in the performance of duties or tasks lawfully assigned by competent authority.\n(4) \"Judicial branch\" has the meaning given in section 43A.02, subdivision 25.\nThe head of each department or agency of the state, or a designee, acting on behalf of the state, shall attempt to determine, adjust and settle, at any time, any claim for money damages of $7,000 or less against the state for injury to or loss of property or personal injury or death caused by an act or omission of any employee of the state while acting within the scope of office or employment, under circumstances where the state, if a private person, would be liable to the claimant. The settlement is final and conclusive on all officers of the state, unless procured by fraud. The acceptance by the claimant of a settlement is final and conclusive on the claimant and constitutes a complete release of any claim against the state and the employee of the state whose act or omission gave rise to the claim, by reason of the same subject matter.\nA settlement made under this section is not valid unless it is supported by a claim in writing, and is approved in writing by the attorney general as to its form and legality. The claim shall be in the form that the attorney general prescribes.\n[Repealed, 1978 c 793 s 98]\nNothing in this section is to be construed to deny a claimant who is not paid under this section from bringing an action at law in the courts of this state.\nThe head of each department or agency, or a designee, acting on behalf of the state, may enter into structured settlements, through the negotiation, creation, and use of annuities or similar financial plans for claimants, to resolve claims arising from the alleged negligence of the state, its agencies, or employees. Sections 16C.03, subdivision 4, 16C.05, and 16C.06 do not apply to the state's selection of and contracts with structured settlement consultants or purveyors of structured settlement plans.",
	"repealed": false
}