{
	"id": "16E.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.18",
	"title": "16E.18 STATE INFORMATION INFRASTRUCTURE.",
	"text": "(a) The state through its departments and agencies shall seek ways to meet its telecommunications needs in a manner that will help to promote investment and growth of the private sector information infrastructure throughout the state.\n(b) The chief information officer shall ensure that telecommunications services are acquired in a manner that:\n(1) promotes the availability of technologies with statewide high-speed or advanced telecommunications capability for both public and private customers in a reasonable and timely fashion;\n(2) enables the cost-effective provision of telecommunications services to the entities identified in this section;\n(3) uses standards-based open, interoperable networks to the extent practicable;\n(4) promotes fair and open competition in the delivery of telecommunications services;\n(5) allows effective state information infrastructure network management, responsiveness, and fault protection;\n(6) provides networkwide security and confidentiality as appropriate for promoting public safety, health, and welfare; and\n(7) meets performance standards that are reasonable and necessary.\n(c) The state may purchase, own, or lease customer premises equipment. Customer premises equipment consists of terminal and associated equipment and inside wire located at an end user's premises and connected with communication channels at the point established in a building or a complex to separate customer equipment from the network. Customer premises equipment also includes, but is not limited to, communications devices eligible for distribution to communications impaired persons under section 237.51, subdivision 1.\n(d) This section does not prohibit the chief information officer or other governmental entity from owning, leasing, operating, and staffing a network operation center that allows the chief information officer to test, troubleshoot, and maintain network operations.\nExcept as provided in subdivision 4, the chief information officer, through the state information infrastructure, shall arrange for the provision of information technology and telecommunications services to state agencies. The state information infrastructure may also serve educational institutions, including public schools as defined in section 120A.05, subdivisions 9, 11, 13, and 17, nonpublic, church or religious organization schools that provide instruction in compliance with sections 120A.22, 120A.24, and 120A.41, and private colleges; public corporations; Indian tribal governments; state political subdivisions; and public noncommercial educational television broadcast stations as defined in section 129D.12, subdivision 2. It is not a telephone company for purposes of chapter 237. The chief information officer may purchase, own, or lease any telecommunications network facilities or equipment after first seeking bids or proposals and having determined that the private sector cannot, will not, or is unable to provide these services, facilities, or equipment as bid or proposed in a reasonable or timely fashion consistent with policy set forth in this section. The chief information officer shall not resell or sublease any services or facilities to nonpublic entities except to serve private schools and colleges. The chief information officer has the responsibility for planning, development, and operations of the state information infrastructure in order to provide cost-effective telecommunications transmission services to state information infrastructure users consistent with the policy set forth in this section.\n(a) The chief information officer shall:\n(1) arrange for information technology and telecommunications services to the state and to political subdivisions through an account in the MNIT services revolving fund;\n(2) manage vendor relationships, network function, and capacity planning in order to be responsive to the needs of the state information infrastructure users;\n(3) set rates and fees for services;\n(4) approve contracts for services, facilities, or equipment relating to the system;\n(5) develop a system plan and the annual program and fiscal plans for the system; and\n(6) in consultation with the commissioner of education in regard to schools, assist state agencies, political subdivisions of the state, and higher education institutions, including private colleges and public and private schools, to identify their telecommunication needs, and develop plans for interoperability of the network consistent with the policies in subdivision 1, paragraphs (a) and (b). When requested, the chief information officer may also assist in identifying, purchasing, or leasing their customer premises equipment.\n(b) The chief information officer may purchase, own, or lease any telecommunications network facilities or equipment after first seeking bids or proposals and having determined that the private sector cannot, will not, or is unable to provide these services, facilities, or equipment as bid or proposed in a reasonable and timely fashion consistent with the policy set forth in this section.\nThe chief information officer may require the participation of state agencies and the commissioner of education, and may request the participation of the Board of Regents of the University of Minnesota and the Board of Trustees of the Minnesota State Colleges and Universities, in the planning and implementation of the network to provide interconnective technologies. The Board of Trustees of the Minnesota State Colleges and Universities may opt out of participation as a subscriber on the network, in whole or in part, if the board is able to secure telecommunications services from another source that ensures it will achieve the policy objectives set forth in subdivision 1.\nThe chief information officer may, but is not required to, approve community-based aggregation of demand for telecommunications services for state agencies, including Minnesota State Colleges and Universities. To be considered a community-based aggregation project:\n(1) the project must aggregate telecommunications demands of state agencies with that of the private sector in a community or a group of communities in a geographic region to the extent permitted by law; and\n(2) the aggregation must result in telecommunications infrastructure improvements that ensure the policy set forth in subdivision 1, paragraphs (a) and (b).\n(a) The chief information officer shall establish reimbursement rates in cooperation with the commissioner of management and budget to be billed to participating agencies and educational institutions sufficient to cover the operating, maintenance, and administrative costs of the system.\n(b) Except as otherwise provided in subdivision 4, a direct appropriation made to an educational institution for usage costs associated with the state information infrastructure must only be used by the educational institution for payment of usage costs of the network as billed by the chief information officer.\nMoney appropriated for the state information infrastructure and fees for telecommunications services must be deposited in an account in the MNIT services revolving fund. Money in the account is appropriated annually to the chief information officer to carry out the purposes of this section.\nThe state information network is exempt from the five- and ten-year limitation on contracts set by sections 16C.05, subdivision 2, paragraph (b); 16C.06, subdivision 3b; 16C.08, subdivision 3, clause (5); and 16C.09, clause (6). A contract compliance review must be performed by the office on a five-year basis for any contract that has a total term greater than five years. The review must detail any compliance or performance issues on the part of the contractor.",
	"repealed": false
}