{
	"id": "237.036",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.036",
	"title": "237.036 COIN-OPERATED OR PUBLIC PAY TELEPHONES.",
	"text": "(a) Neither commission approval nor a commission certificate is required to:\n(1) site a coin-operated or public pay telephone in the state; or\n(2) implement changes in service, services offered, rates, or location regarding a coin-operated or public pay telephone. Registration under section 237.64 is required to own or operate a coin-operated or public pay telephone in the state.\n(b) This section does not change the authority of other state or local government entities to regulate aspects of coin-operated or public pay telephone ownership, location, or operation; however, an entity may not regulate aspects of these services that it did not regulate prior to May 26, 1999. The commission shall retain the authority delegated to it under federal and state law to protect the public interest with regard to coin-operated or public pay telephones.\n(c) Owners and operators of coin-operated or public pay telephones are exempt from sections 237.06, 237.07, 237.075, 237.09, 237.23, and 237.295, and the annual reporting requirement of section 237.11.\n(d) Owners of coin-operated or public pay telephones shall:\n(1) provide immediate coin-free access, to the extent technically feasible, to 911 emergency service or to another approved emergency service; and\n(2) provide free access to the telecommunications relay service for people with communication disabilities.\n(e) Owners of coin-operated or public pay telephones must post at each coin-operated or public pay telephone location:\n(1) customer service and complaint information, including the name, address, and telephone number of the owner of the coin-operated or public pay telephone and the operator service handling calls from the coin-operated or public pay telephone; a toll-free number of the appropriate telephone company for the resolution of complaints; and the toll-free number of the public utilities commission; and\n(2) a toll-free number at which consumers can obtain pricing information regarding rates, charges, terms, and conditions of local and long-distance calls.",
	"repealed": false
}