{
	"id": "469.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.41",
	"title": "469.41 DESTINATION MEDICAL CENTER CORPORATION ESTABLISHED.",
	"text": "The city must establish a destination medical center corporation as a nonprofit corporation under chapter 317A to provide the city with expertise in preparing and implementing the development plan to establish the city as a destination medical center. Except as provided in sections 469.40 to 469.47, the nonprofit corporation is not subject to laws governing the city.\n(a) The corporation's governing board consists of eight members appointed as follows:\n(1) the mayor of the city, or the mayor's designee, subject to approval by the city council;\n(2) the city council president, or the city council president's designee, subject to approval by the city council;\n(3) the chair or a member of the county board, appointed by the county board;\n(4) a representative of the medical business entity, appointed by and serving at the pleasure of the medical business entity; and\n(5) four members appointed by the governor, subject to confirmation by the senate.\n(b) Appointing authorities must make their respective appointments as soon as practicable after June 22, 2013, but no later than July 22, 2013.\n(c) A quorum of the board is six members.\n(a) A member first appointed after June 22, 2013, under subdivision 2, paragraph (a), clauses (1), (2), and (3), serves for a term coterminous with the term of the elected office, but may be reappointed.\n(b) Two members first appointed after June 22, 2013, under subdivision 2, paragraph (a), clause (5), serve from the date of appointment until the first Tuesday after the first Monday in January 2017, and two members first appointed after June 22, 2013, under subdivision 2, paragraph (a), clause (5), serve from the date of appointment until the first Tuesday after the first Monday in January 2020. Thereafter, members appointed by the governor serve six-year terms.\nA vacancy occurs as provided in section 351.02 or upon a member's removal under subdivision 7. A vacancy on the board must be filled by the appointing authority for the balance of the term in the same manner as a regular appointment.\nThe board must elect a chair from among the governor's appointees. The governor must convene the first meeting within 30 days of completion of all appointments to the board.\nMembers must be compensated as provided in section 15.0575, subdivision 3. For the purposes of this subdivision, the member representing the medical business entity shall be treated as if an employee of a political subdivision. All money paid for compensation or reimbursement must be paid out of the corporation's budget.\nA member may be removed by the board for inefficiency, neglect of duty, or misconduct in office. A member may be removed only after a hearing of the board. A copy of the charges must be given to the board member at least ten days before the hearing. The board member must be given an opportunity to be heard in person or by counsel at the hearing. When written charges have been submitted against a board member, the board may temporarily suspend the member. If the board finds that those charges have not been substantiated, the board member must be immediately reinstated. If a board member is removed, a record of the proceedings, together with the charges and findings, must be filed with the office of the appointing authority.\nMeetings of the corporation and any committee or subcommittee of the corporation are subject to the open meeting law in chapter 13D. The corporation is a government entity for purposes of chapter 13.\nExcept for the member appointed by the medical business entity, a member must not be a director, officer, or employee of the medical business entity. A member must not participate in or vote on a decision of the corporation relating to any project authorized by or under consideration by the corporation in which the member has either a direct or indirect financial interest. No member may serve as a lobbyist, as defined under section 10A.01, subdivision 21.\nA member of the corporation is a public official, as defined in section 10A.01, subdivision 35.\nThe corporation may exercise any other powers that are granted by its articles of incorporation and bylaws to the extent that those powers are not inconsistent with the provisions of sections 469.40 to 469.47.\n(a) The corporation may contract for the services of the nonprofit economic development agency, financial advisors, other consultants, agents, public accountants, legal counsel, and other persons needed to perform its duties and exercise its powers. The corporation may contract with the city or county to provide administrative, clerical, and accounting services to the corporation.\n(b) The corporation must contract with the nonprofit agency for the services enumerated in section 469.43, subdivision 6, paragraph (a). The requirement to contract with the nonprofit agency does not limit the corporation's authority to contract with other providers for the services.\nA project must be approved by the corporation before it is proposed to the city. The corporation must review the project proposed for consistency with the adopted development plan.\nThe city must provide for the terms for dissolution of the corporation in the articles of incorporation.",
	"repealed": false
}