{
	"id": "80C.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/80C.145",
	"title": "80C.145 MOTOR FUEL FRANCHISES; RIGHT OF SURVIVORSHIP.",
	"text": "No motor fuel franchisor shall initially execute or renew a franchise agreement in the state after July 1, 1981 unless it contains the provisions of subdivisions 3 to 9.\nFor purposes of this section, \"designated family member\" means the spouse, child, grandchild, parent, brother, or sister of the motor fuel franchisee who, in the case of the motor fuel franchisee's death, is entitled to inherit the franchisee's interest in the motor fuel franchise under the terms of the franchisee's will or under the law of intestate succession of this state or who, in the case of an incapacitated franchisee, has been appointed by a court as the legal representative of the franchisee's property.\nAny designated family member of a deceased or incapacitated owner of a motor fuel franchise may succeed to the ownership of the existing franchise: (a) if the designated family member gives the motor fuel franchisor written notice of the intention to succeed to the motor fuel franchise within 60 days of the motor fuel franchisee's death or incapacity; (b) if the designated family member agrees to be bound by all terms and conditions of the existing franchise; and (c) unless there exists good cause for the refusal to honor the succession on the part of the motor fuel franchisor.\nAt the time of serving notice under subdivision 3, the designated family member shall provide upon the request of the motor fuel franchisor, personal and financial data that is reasonably necessary to determine whether the succession should be honored.\nIf a motor fuel franchisor believes in good faith that good cause exists for refusing to honor succession of the franchise by a designated family member of a deceased or incapacitated motor fuel franchisee, the franchisor may within 90 days after receipt of the personal and financial data requested under subdivision 4, serve notice upon the designated family member of its refusal to honor succession and of its intent to terminate the existing motor fuel franchise with the designated family member no sooner than 90 days from the date the notice is served.\nThe notice must state the specific grounds for the refusal to honor the succession and the termination of the existing franchise with the designated family member.\nIf notice of refusal and termination is not timely served upon the designated family member, the existing motor fuel franchise shall continue in effect subject to termination only as otherwise permitted by law.\nIn determining whether good cause for the refusal to honor the succession exists, the motor fuel franchisor has the burden of proving that the successor is a person who is not of good moral character or does not meet the franchisor's existing, reasonable standards.\nNotwithstanding the foregoing, in the event the motor fuel franchisee and the motor fuel franchisor have duly executed an agreement concerning the succession rights prior to the franchisee's death or incapacitation, the agreement shall be observed, even if the agreement designates an individual other than the surviving spouse or heirs of the franchisee.\nThe attorney general or any aggrieved party may institute a civil action in the district court for an injunction prohibiting a violation of this section. It is no defense to the action that the state or the aggrieved party has adequate remedies at law.",
	"repealed": false
}