{
	"id": "150A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.06",
	"title": "150A.06 LICENSURE.",
	"text": "A person of good moral character who has graduated from a dental program accredited by the Commission on Dental Accreditation, having submitted an application and fee as prescribed by the board, may be examined by the board or by an agency pursuant to section 150A.03, subdivision 1, in a manner to test the applicant's fitness to practice dentistry. A graduate of a dental college in another country must not be disqualified from examination solely because of the applicant's foreign training if the board determines that the training is equivalent to or higher than that provided by a dental college accredited by the Commission on Dental Accreditation. In the case of examinations conducted pursuant to section 150A.03, subdivision 1, applicants shall take the examination prior to applying to the board for licensure. The examination shall include an examination of the applicant's knowledge of the laws of Minnesota relating to dentistry and the rules of the board. An applicant is ineligible to retake the clinical examination required by the board after failing it twice until further education and training are obtained as specified by the board by rule. A separate, nonrefundable fee may be charged for each time a person applies. An applicant who passes the examination in compliance with subdivision 2b, abides by professional ethical conduct requirements, and meets all other requirements of the board shall be licensed to practice dentistry and granted a general dentist license by the board.\n(a) Faculty members of a school of dentistry must be licensed in order to practice dentistry as defined in section 150A.05. The board may issue to members of the faculty of a school of dentistry a license designated as either a \"limited faculty license\" or a \"full faculty license\" entitling the holder to practice dentistry within the terms described in paragraph (b) or (c). The dean of a school of dentistry and program directors of a Minnesota dental hygiene or dental assisting school accredited by the Commission on Dental Accreditation shall certify to the board those members of the school's faculty who practice dentistry but are not licensed to practice dentistry in Minnesota. A faculty member who practices dentistry as defined in section 150A.05, before beginning duties in a school of dentistry or a dental hygiene or dental assisting school, shall apply to the board for a limited or full faculty license. Pursuant to Minnesota Rules, chapter 3100, and at the discretion of the board, a limited faculty license must be renewed annually and a full faculty license must be renewed biennially. The faculty applicant shall pay a nonrefundable fee set by the board for issuing and renewing the faculty license. The faculty license is valid during the time the holder remains a member of the faculty of a school of dentistry or a dental hygiene or dental assisting school and subjects the holder to this chapter.\n(b) The board may issue to dentist members of the faculty of a Minnesota school of dentistry, dental hygiene, or dental assisting accredited by the Commission on Dental Accreditation, a license designated as a limited faculty license entitling the holder to practice dentistry within the school and its affiliated teaching facilities, but only for the purposes of teaching or conducting research. The practice of dentistry at a school facility for purposes other than teaching or research is not allowed unless the dentist was a faculty member on August 1, 1993.\n(c) The board may issue to dentist members of the faculty of a Minnesota school of dentistry, dental hygiene, or dental assisting accredited by the Commission on Dental Accreditation a license designated as a full faculty license entitling the holder to practice dentistry within the school and its affiliated teaching facilities and elsewhere if the holder of the license is employed 50 percent time or more by the school in the practice of teaching or research, and upon successful review by the board of the applicant's qualifications as described in subdivisions 1, 1c, and 4 and board rule. The board, at its discretion, may waive specific licensing prerequisites.\nA person who is a graduate of a dental school and is an enrolled graduate student or student of an accredited advanced dental education program and who is not licensed to practice dentistry in the state shall obtain from the board a license to practice dentistry as a resident dentist. The license must be designated \"resident dentist license\" and authorizes the licensee to practice dentistry only under the supervision of a licensed dentist. A University of Minnesota School of Dentistry dental resident holding a resident dentist license is eligible for enrollment in medical assistance, as provided under section 256B.0625, subdivision 9b. A resident dentist license must be renewed annually pursuant to the board's rules. An applicant for a resident dentist license shall pay a nonrefundable fee set by the board for issuing and renewing the license. The requirements of sections 150A.01 to 150A.21 apply to resident dentists except as specified in rules adopted by the board. A resident dentist license does not qualify a person for licensure under subdivision 1.\n(a) The board may grant one or more specialty licenses in the specialty areas of dentistry that are recognized by the Commission on Dental Accreditation.\n(b) An applicant for a specialty license shall:\n(1) have successfully completed a postdoctoral specialty program accredited by the Commission on Dental Accreditation, or have announced a limitation of practice before 1967;\n(2) have been certified by a specialty board approved by the Minnesota Board of Dentistry, or provide evidence of having passed a clinical examination for licensure required for practice in any state or Canadian province, or in the case of oral and maxillofacial surgeons only, have a Minnesota medical license in good standing;\n(3) have been in active practice or a postdoctoral specialty education program or United States government service at least 2,000 hours in the 36 months prior to applying for a specialty license;\n(4) if requested by the board, be interviewed by a committee of the board, which may include the assistance of specialists in the evaluation process, and satisfactorily respond to questions designed to determine the applicant's knowledge of dental subjects and ability to practice;\n(5) if requested by the board, present complete records on a sample of patients treated by the applicant. The sample must be drawn from patients treated by the applicant during the 36 months preceding the date of application. The number of records shall be established by the board. The records shall be reasonably representative of the treatment typically provided by the applicant for each specialty area;\n(6) at board discretion, pass a board-approved English proficiency test if English is not the applicant's primary language;\n(7) pass all components of the National Board Dental Examinations;\n(8) pass the Minnesota Board of Dentistry jurisprudence examination;\n(9) abide by professional ethical conduct requirements; and\n(10) meet all other requirements prescribed by the Board of Dentistry.\n(c) The application must include:\n(1) a completed application furnished by the board;\n(2) a nonrefundable fee; and\n(3) a copy of the applicant's government-issued photo identification card.\n(d) A specialty dentist holding one or more specialty licenses is limited to practicing in the dentist's designated specialty area or areas. The scope of practice must be defined by each national specialty board recognized by the Commission on Dental Accreditation.\n(e) All specialty dentists who have fulfilled the specialty dentist requirements and who intend to limit their practice to a particular specialty area or areas may apply for one or more specialty licenses.\nA person of good moral character who has graduated with a baccalaureate degree or a master's degree from a dental therapy education program that has been approved by the board or accredited by the Commission on Dental Accreditation or another board-approved national accreditation organization may apply for licensure.\nThe applicant must submit an application and fee as prescribed by the board and a diploma or certificate from a dental therapy education program. Prior to being licensed, the applicant must pass a comprehensive, competency-based clinical examination that is approved by the board and administered independently of an institution providing dental therapy education. The applicant must also pass an examination testing the applicant's knowledge of the Minnesota laws and rules relating to the practice of dentistry. An applicant who has failed the clinical examination twice is ineligible to retake the clinical examination until further education and training are obtained as specified by the board. A separate, nonrefundable fee may be charged for each time a person applies. An applicant who passes the examination in compliance with subdivision 2b, abides by professional ethical conduct requirements, and meets all the other requirements of the board shall be licensed as a dental therapist.\nA person who is a graduate of an undergraduate program and is an enrolled graduate student of an advanced dental education program shall obtain from the board a license to practice as a resident dental hygienist or dental therapist. The license must be designated \"resident dental provider license\" and authorizes the licensee to practice only under the supervision of a licensed dentist or licensed dental therapist. A resident dental provider license must be renewed annually by the board. An applicant for a resident dental provider license shall pay a nonrefundable fee set by the board for issuing and renewing the license. The requirements of sections 150A.01 to 150A.21 apply to resident dental providers except as specified in rules adopted by the board. A resident dental provider license does not qualify a person for licensure under subdivision 1d or 2.\nA person of good moral character, who has graduated from a dental hygiene program accredited by the Commission on Dental Accreditation and established in an institution accredited by an agency recognized by the United States Department of Education to offer college-level programs, may apply for licensure. The dental hygiene program must provide a minimum of two academic years of dental hygiene education. The applicant must submit an application and fee as prescribed by the board and a diploma or certificate of dental hygiene. Prior to being licensed, the applicant must pass the National Board of Dental Hygiene examination and a board approved examination designed to determine the applicant's clinical competency. In the case of examinations conducted pursuant to section 150A.03, subdivision 1, applicants shall take the examination before applying to the board for licensure. The applicant must also pass an examination testing the applicant's knowledge of the laws of Minnesota relating to the practice of dentistry and of the rules of the board. An applicant is ineligible to retake the clinical examination required by the board after failing it twice until further education and training are obtained as specified by board rule. A separate, nonrefundable fee may be charged for each time a person applies. An applicant who passes the examination in compliance with subdivision 2b, abides by professional ethical conduct requirements, and meets all the other requirements of the board shall be licensed as a dental hygienist.\nA person of good moral character, who has graduated from a dental assisting program accredited by the Commission on Dental Accreditation, may apply for licensure. The applicant must submit an application and fee as prescribed by the board and the diploma or certificate of dental assisting. In the case of examinations conducted pursuant to section 150A.03, subdivision 1, applicants shall take the examination before applying to the board for licensure. The examination shall include an examination of the applicant's knowledge of the laws of Minnesota relating to dentistry and the rules of the board. An applicant is ineligible to retake the licensure examination required by the board after failing it twice until further education and training are obtained as specified by board rule. A separate, nonrefundable fee may be charged for each time a person applies. An applicant who passes the examination in compliance with subdivision 2b, abides by professional ethical conduct requirements, and meets all the other requirements of the board shall be licensed as a dental assistant.\nWhen the Board of Dentistry administers the examination for licensure, only those board members or board-appointed deputy examiners qualified for the particular examination may administer it. An examination which the board requires as a condition of licensure must have been taken within the five years before the board receives the application for licensure.\n(a) The board shall grant a guest license to practice as a dentist, dental hygienist, or licensed dental assistant if the following conditions are met:\n(1) the dentist, dental hygienist, or dental assistant is currently licensed in good standing in another United States jurisdiction;\n(2) the dentist, dental hygienist, or dental assistant is currently engaged in the practice of that person's respective profession in another United States jurisdiction;\n(3) the dentist, dental hygienist, or dental assistant will limit that person's practice to a public health setting in Minnesota that (i) is approved by the board; (ii) was established by a nonprofit organization that is tax exempt under chapter 501(c)(3) of the Internal Revenue Code of 1986; and (iii) provides dental care to patients who have difficulty accessing dental care;\n(4) the dentist, dental hygienist, or dental assistant agrees to treat indigent patients who meet the eligibility criteria established by the clinic; and\n(5) the dentist, dental hygienist, or dental assistant has applied to the board for a guest license and has paid a nonrefundable license fee to the board.\n(b) A guest license must be renewed annually with the board and an annual renewal fee must be paid to the board. Guest licenses expire on December 31 of each year.\n(c) A dentist, dental hygienist, or dental assistant practicing under a guest license under this subdivision shall have the same obligations as a dentist, dental hygienist, or dental assistant who is licensed in Minnesota and shall be subject to the laws and rules of Minnesota and the regulatory authority of the board. If the board suspends or revokes the guest license of, or otherwise disciplines, a dentist, dental hygienist, or dental assistant practicing under this subdivision, the board shall promptly report such disciplinary action to the dentist's, dental hygienist's, or dental assistant's regulatory board in the jurisdictions in which they are licensed.\n(d) The board may grant a guest license to a dentist, dental hygienist, or dental assistant licensed in another United States jurisdiction to provide dental care to patients on a voluntary basis without compensation for a limited period of time. The board shall not assess a fee for the guest license for volunteer services issued under this paragraph.\n(e) The board shall issue a guest license for volunteer services if:\n(1) the board determines that the applicant's services will provide dental care to patients who have difficulty accessing dental care;\n(2) the care will be provided without compensation; and\n(3) the applicant provides adequate proof of the status of all licenses to practice in other jurisdictions. The board may require such proof on an application form developed by the board.\n(f) The guest license for volunteer services shall limit the licensee to providing dental care services for a period of time not to exceed ten days in a calendar year. Guest licenses expire on December 31 of each year.\n(g) The holder of a guest license for volunteer services shall be subject to state laws and rules regarding dentistry and the regulatory authority of the board. The board may revoke the license of a dentist, dental hygienist, or dental assistant practicing under this subdivision or take other regulatory action against the dentist, dental hygienist, or dental assistant. If an action is taken, the board shall report the action to the regulatory board of those jurisdictions where an active license is held by the dentist, dental hygienist, or dental assistant.\n(a) The board shall grant a waiver to the continuing education requirements under this chapter for a licensed dentist, licensed dental therapist, licensed dental hygienist, or licensed dental assistant who documents to the satisfaction of the board that the dentist, dental therapist, dental hygienist, or licensed dental assistant has retired from active practice in the state and limits the provision of dental care services to those offered without compensation in a public health, community, or tribal clinic or a nonprofit organization that provides services to the indigent or to recipients of medical assistance or MinnesotaCare programs.\n(b) The board may require written documentation from the volunteer and retired dentist, dental therapist, dental hygienist, or licensed dental assistant prior to granting this waiver.\n(c) The board shall require the volunteer and retired dentist, dental therapist, dental hygienist, or licensed dental assistant to meet the following requirements:\n(1) a licensee seeking a waiver under this subdivision must complete and document at least five hours of approved courses in infection control, medical emergencies, and medical management for the continuing education cycle; and\n(2) provide documentation of current CPR certification from completion of the American Heart Association healthcare provider course or the American Red Cross professional rescuer course.\n(a) All or any part of the examination for dentists, dental therapists, dental hygienists, or dental assistants, except that pertaining to the law of Minnesota relating to dentistry and the rules of the board, may, at the discretion of the board, be waived for an applicant who presents a certificate of having passed all components of the National Board Dental Examinations or evidence of having maintained an adequate scholastic standing as determined by the board.\n(b) The board shall waive the clinical examination required for licensure for any dentist applicant who is a graduate of a dental school accredited by the Commission on Dental Accreditation, who has passed all components of the National Board Dental Examinations, and who has satisfactorily completed a postdoctoral general dentistry residency program (GPR) or an advanced education in general dentistry (AEGD) program after January 1, 2004. The postdoctoral program must be accredited by the Commission on Dental Accreditation, be of at least one year's duration, and include an outcome assessment evaluation assessing the resident's competence to practice dentistry. The board may require the applicant to submit any information deemed necessary by the board to determine whether the waiver is applicable.\n(a) Any dentist or dental hygienist may, upon application and payment of a fee established by the board, apply for licensure based on the applicant's performance record in lieu of passing an examination approved by the board according to section 150A.03, subdivision 1, and be interviewed by the board to determine if the applicant:\n(1) has passed all components of the National Board Dental Examinations;\n(2) has been in active practice at least 2,000 hours within 36 months of the application date, or passed a board-approved reentry program within 36 months of the application date;\n(3) currently has a license in another state or Canadian province and is not subject to any pending or final disciplinary action, or if not currently licensed, previously had a license in another state or Canadian province in good standing that was not subject to any final or pending disciplinary action at the time of surrender;\n(4) is of good moral character and abides by professional ethical conduct requirements;\n(5) at board discretion, has passed a board-approved English proficiency test if English is not the applicant's primary language; and\n(6) meets other credentialing requirements specified in board rule.\n(b) An applicant who fulfills the conditions of this subdivision and demonstrates the minimum knowledge in dental subjects required for licensure under subdivision 1 or 2 must be licensed to practice the applicant's profession.\n(c) If the applicant does not demonstrate the minimum knowledge in dental subjects required for licensure under subdivision 1 or 2, the application must be denied. When denying a license, the board may notify the applicant of any specific remedy that the applicant could take which, when passed, would qualify the applicant for licensure. A denial does not prohibit the applicant from applying for licensure under subdivision 1 or 2.\n(d) A candidate whose application has been denied may appeal the decision to the board according to subdivision 4a.\nA person whose application for licensure by credentials has been denied may appeal the decision to the board. The board shall establish an appeals process and inform a denied candidate of the right to appeal and the process for filing the appeal.\nEvery person implicated in employing fraud or deception in applying for or securing a license to practice dentistry, dental hygiene, dental therapy, or dental assisting, or in annually renewing a license under sections 150A.01 to 150A.12 is guilty of a gross misdemeanor.\n(a) The renewal certificate of every licensee or registrant must be conspicuously displayed in plain sight of patients in every office in which that person practices. Duplicate renewal certificates may be obtained from the board.\n(b) Near or on the entrance door to every office where dentistry is practiced, the name of each dentist practicing there, as inscribed on the current license certificate, must be displayed in plain sight.\n(c) The board must allow the display of a mini-license for guest license holders performing volunteer dental services. There is no fee for the mini-license for guest volunteers.\nMS 1988 [Repealed, 1989 c 285 s 7]\nOn a case-by-case basis, for initial or renewal of licensure, the board may add additional remedies for deficiencies found based on the applicant's performance, character, and education.\n(a) Any dental assistant may, upon application and payment of a fee established by the board, apply for licensure based on an evaluation of the applicant's education, experience, and performance record in lieu of completing a board-approved dental assisting program for expanded functions as defined in rule, and may be interviewed by the board to determine if the applicant:\n(1) has graduated from an accredited dental assisting program accredited by the Commission on Dental Accreditation or is currently certified by the Dental Assisting National Board;\n(2) is not subject to any pending or final disciplinary action in another state or Canadian province, or if not currently certified or registered, previously had a certification or registration in another state or Canadian province in good standing that was not subject to any final or pending disciplinary action at the time of surrender;\n(3) is of good moral character and abides by professional ethical conduct requirements;\n(4) at board discretion, has passed a board-approved English proficiency test if English is not the applicant's primary language; and\n(5) has met all expanded functions curriculum equivalency requirements of a Minnesota board-approved dental assisting program.\n(b) The board, at its discretion, may waive specific licensure requirements in paragraph (a).\n(c) An applicant who fulfills the conditions of this subdivision and demonstrates the minimum knowledge in dental subjects required for licensure under subdivision 2a must be licensed to practice the applicant's profession.\n(d) If the applicant does not demonstrate the minimum knowledge in dental subjects required for licensure under subdivision 2a, the application must be denied. If licensure is denied, the board may notify the applicant of any specific remedy that the applicant could take which, when passed, would qualify the applicant for licensure. A denial does not prohibit the applicant from applying for licensure under subdivision 2a.\n(e) A candidate whose application has been denied may appeal the decision to the board according to subdivision 4a.\nA graduate of a nonaccredited dental program who successfully completes the clinical licensure examination, and meets all other applicant requirements of the board shall be licensed to practice dentistry and granted a limited general dentist license by the board. The board shall place limitations on the licensee's authority to practice by requiring the licensee to practice under the general supervision of a Minnesota-licensed dentist approved by the board. A person licensed under this subdivision must practice for three consecutive years in Minnesota pursuant to a written agreement, approved by the board, between the licensee and a Minnesota-licensed dentist who may limit the types of services authorized. At the conclusion of the three-year period, the board shall grant an unlimited license without further restrictions if all supervising dentists who had entered into written agreements with the licensee during any part of the three-year period recommend unlimited licensure, and if no corrective action or disciplinary action has been taken by the board against the licensee.\nA person licensed to practice dentistry, dental therapy, dental hygiene, or dental assisting pursuant to section 150A.05 or Minnesota Rules, part 3100.8500, who retires from active practice in the state may apply to the board for emeritus inactive licensure. An application for emeritus inactive licensure may be made on the biennial licensing form or by petitioning the board, and the applicant must pay a onetime application fee pursuant to section 150A.091, subdivision 19. In order to receive emeritus inactive licensure, the applicant must be in compliance with board requirements and cannot be the subject of current disciplinary action resulting in suspension, revocation, disqualification, condition, or restriction of the licensee to practice dentistry, dental therapy, dental hygiene, or dental assisting. An emeritus inactive license is not a license to practice, but is a formal recognition of completion of a person's dental career in good standing.\n(a) A person licensed to practice dentistry, dental therapy, dental hygiene, or dental assisting may apply for an emeritus active license if the person is retired from active practice, is in compliance with board requirements, and is not the subject of current disciplinary action resulting in suspension, revocation, disqualification, condition, or restriction of the license to practice dentistry, dental therapy, dental hygiene, or dental assisting.\n(b) An emeritus active licensee may engage only in the following types of practice:\n(1) pro bono or volunteer dental practice;\n(2) paid practice not to exceed 500 hours per calendar year for the exclusive purpose of providing licensing supervision to meet the board's requirements; or\n(3) paid consulting services not to exceed 500 hours per calendar year.\n(c) An emeritus active licensee shall not hold out as a full licensee and may only hold out as authorized to practice as described in this subdivision. The board may take disciplinary or corrective action against an emeritus active licensee based on violations of applicable law or board requirements.\n(d) A person may apply for an emeritus active license by completing an application form specified by the board and must pay the application fee pursuant to section 150A.091, subdivision 20.\n(e) If an emeritus active license is not renewed every two years, the license expires. The renewal date is the same as the licensee's renewal date when the licensee was in active practice. In order to renew an emeritus active license, the licensee must:\n(1) complete an application form as specified by the board;\n(2) pay the required renewal fee pursuant to section 150A.091, subdivision 20; and\n(3) report at least 25 continuing education hours completed since the last renewal, which must include:\n(i) at least one hour in two different required CORE areas;\n(ii) at least one hour of mandatory infection control;\n(iii) for dentists and dental therapists, at least 15 hours of fundamental credits for dentists and dental therapists, and for dental hygienists and dental assistants, at least seven hours of fundamental credits; and\n(iv) for dentists and dental therapists, no more than ten elective credits, and for dental hygienists and dental assistants, no more than six elective credits.\n(a) Any dental therapist may, upon application and payment of a fee established by the board, apply for licensure based on an evaluation of the applicant's education, experience, and performance record. The applicant may be interviewed by the board to determine if the applicant:\n(1) graduated with a baccalaureate or master's degree from a dental therapy program accredited by the Commission on Dental Accreditation;\n(2) provided evidence of successfully completing the board's jurisprudence examination;\n(3) actively practiced at least 2,000 hours within 36 months of the application date or passed a board-approved reentry program within 36 months of the application date;\n(4) either:\n(i) is currently licensed in another state or Canadian province and not subject to any pending or final disciplinary action; or\n(ii) was previously licensed in another state or Canadian province in good standing and not subject to any final or pending disciplinary action at the time of surrender;\n(5) passed a board-approved English proficiency test if English is not the applicant's primary language required at the board's discretion; and\n(6) met all curriculum equivalency requirements regarding dental therapy scope of practice in Minnesota.\n(b) The 2,000 practice hours required by clause (3) may count toward the 2,000 practice hours required for consideration for advanced dental therapy certification, provided that all other requirements of section 150A.106, subdivision 1, are met.\n(c) The board, at its discretion, may waive specific licensure requirements in paragraph (a).\n(d) The board must license an applicant who fulfills the conditions of this subdivision and demonstrates the minimum knowledge in dental subjects required for licensure under subdivision 1d to practice the applicant's profession.\n(e) The board must deny the application if the applicant does not demonstrate the minimum knowledge in dental subjects required for licensure under subdivision 1d. If licensure is denied, the board may notify the applicant of any specific remedy the applicant could take to qualify for licensure. A denial does not prohibit the applicant from applying for licensure under subdivision 1d.\n(f) A candidate may appeal a denied application to the board according to subdivision 4a.",
	"repealed": false
}