{
	"id": "271.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/271.06",
	"title": "271.06 APPEALS FROM ORDERS.",
	"text": "Except as otherwise provided in section 270C.86, or any other law, an appeal to the Tax Court may be taken, in the manner herein provided, from any official order of the commissioner of revenue respecting any tax, fee, or assessment, or any matter pertaining thereto, including the imposition of interest and penalty, or any matter over which the court is granted jurisdiction under section 271.01, subdivision 5, by any person directly interested therein or affected thereby, or by any political subdivision of the state, directly or indirectly, interested therein or affected thereby, or by the attorney general in behalf of the state, or by any resident taxpayer of the state in behalf of the state in case the attorney general, upon request, shall refuse to appeal. Notwithstanding subdivision 2, when an appeal is taken to the Tax Court in any case dealing with property valuation, assessment, or taxation for property tax purposes, the provisions of section 273.125, subdivisions 4 and 5, and chapter 278 shall apply as if the appeal had been taken to the district court.\nExcept as otherwise provided by law, within 60 days after the notice date of an order of the commissioner of revenue, the appellant, or the appellant's attorney, shall serve a notice of appeal upon the commissioner and file the original, with proof of such service, with the Tax Court administrator or with the court administrator of district court acting as court administrator of the Tax Court; provided, that the Tax Court, for cause shown, may by written order extend the time for appealing for an additional period not exceeding 30 days. For purposes of this section, \"notice date\" means the notice date designated by the commissioner on the order. The notice of appeal shall be in the form prescribed by the Tax Court. Within five days after receipt, the commissioner shall transmit a copy of the notice of appeal to the attorney general. The attorney general shall represent the commissioner, if requested, upon all such appeals except in cases where the attorney general has appealed in behalf of the state, or in other cases where the attorney general deems it against the interests of the state to represent the commissioner, in which event the attorney general may intervene or be substituted as an appellant in behalf of the state at any stage of the proceedings.\nUpon a final determination of any other matter over which the court is granted jurisdiction under section 271.01, subdivision 5, the taxpayer or the taxpayer's attorney shall file a petition or notice of appeal as provided by law with the court administrator of district court, acting in the capacity of court administrator of the Tax Court, with proof of service of the petition or notice of appeal as required by law and within the time required by law. As used in this subdivision, \"final determination\" includes a notice of assessment and equalization for the year in question received from the local assessor, an order of the local board of equalization, or an order of a county board of equalization.\nThe Tax Court shall prescribe a filing system so that the notice of appeal or petition filed with the district court administrator acting as court administrator of the Tax Court is forwarded to the Tax Court administrator. In the case of an appeal or a petition concerning property valuation for which the assessor, a local board of equalization, a county board of equalization or the commissioner of revenue has issued an order, the officer issuing the order shall be notified of the filing of the appeal. The notice of appeal or petition shall be in the form prescribed by the Tax Court.\n(a) If, after the period prescribed by subdivision 2, the original notice of appeal, proof of service upon the commissioner, and filing fee are delivered by United States mail to the Tax Court administrator or the court administrator of district court acting as court administrator of the Tax Court, then the date of filing is the date of the United States postmark stamped on the envelope or other appropriate wrapper in which the notice of appeal, proof of service upon the commissioner, and filing fee are mailed.\n(b) This subdivision applies only if the postmark date falls within the period prescribed by subdivision 2 and the original notice of appeal, proof of service upon the commissioner, and filing fee are, within the time prescribed by subdivision 2, deposited in the mail in the United States in an envelope or other appropriate wrapper, postage prepaid, properly addressed to the Tax Court administrator or the court administrator of district court acting as court administrator of the Tax Court.\n(c) Only the postmark of the United States Postal Service qualifies as proof of timely mailing under this subdivision. Private postage meters do not qualify as proof of timely filing under this subdivision. If the original notice of appeal, proof of service upon the commissioner, and filing fee are sent by United States registered mail, the date of registration is the postmark date. If the original notice of appeal, proof of service upon the commissioner, and filing fee are sent by United States certified mail and the sender's receipt is postmarked by the postal employee to whom the envelope containing the original notice of appeal, proof of service upon the commissioner, and filing fee is presented, the date of the United States postmark on the receipt is the postmark date. If the envelope or other wrapper in which the notice of appeal, proof of service upon the commissioner, and filing fee are mailed does not contain a postmark of the United States Postal Service but is delivered by United States mail to the Tax Court administrator or the court administrator of the district court acting as court administrator of the Tax Court, then the date of mailing qualifies as timely filed under this subdivision, if proof of mailing within the time prescribed by subdivision 2 is provided by affidavit of the petitioner or counsel and a dated receipt from the United States Postal Service.\n(d) A reference in this section to the United States mail must be treated as including a reference to any designated delivery service and a reference in this section to a postmark by the United States Postal Service must be treated as including a reference to any date recorded or marked by any designated delivery service in accordance with section 7502(f) of the Internal Revenue Code.\nWithin 30 days after the service and filing of the notice of appeal, unless the appeal be theretofore dismissed, the commissioner shall make, certify, and file with the Tax Court a return composed of a copy of any application or petition by which the proceeding was instituted and any other material paper preceding the order of the commissioner, a copy of the order appealed from, all relevant correspondence or other communication, and a denial, admission, or explanation with respect to each allegation of fact in the notice so far as not covered by the order; provided, that the Tax Court, for cause shown, may extend the time for filing such return for an additional period not exceeding 30 days. Where the commissioner is required to transmit a copy of the notice of appeal to the attorney general, the commissioner shall, within ten days after service of the notice of appeal upon the commissioner, transmit to the attorney general a complete copy of all papers required for the return. Allegations of new matter in the return shall be deemed to be denied by the appellant.\nAt the time of filing the notice of appeal the appellant shall pay to the court administrator of the Tax Court an appeal fee equal to the fee provided for civil actions in the district court under section 357.021, subdivision 2, clause (1); except that no appeal fee shall be required of the commissioner of revenue, the attorney general, the state or any of its political subdivisions. In Small Claims Division, the appeal fee shall be $150. The provisions of chapter 563, providing for proceedings in forma pauperis, shall also apply for appeals to the Tax Court.\nAt any time before final determination of an appeal by the Tax Court, the commissioner may, upon notice to the appellant and with the approval of the attorney general, offer to modify or rescind the order appealed from and, if such action be satisfactory to the appellant and to all other parties appearing in the proceeding, if any, and they shall stipulate thereto in writing, the proposed modification or rescission shall be made by the commissioner, and the appeal shall thereupon be dismissed, with such adjustment of costs as may be agreed upon between the commissioner and the appellant and specified in the stipulation.\n(a) The Tax Court shall hear, consider, and determine without a jury every appeal de novo. A Tax Court judge may empanel an advisory jury upon the judge's motion. The Tax Court shall hold a public hearing in every case. All such parties shall have an opportunity to offer evidence and arguments at the hearing; provided, that the order of the commissioner or the appropriate unit of government in every case shall be prima facie valid. When an appeal to the Tax Court has been taken from an order or determination of the commissioner or from the appropriate unit of government, the proceeding shall be an original proceeding in the nature of a suit to set aside or modify the order or determination. In case no appellant shall appear the Tax Court shall enter its order affirming the order of the commissioner of revenue or the appropriate unit of government from which the appeal was taken. If the Department of Revenue's sales ratio study is introduced in Tax Court as evidence, the sales ratio data from the study shall be admissible as evidence only as provided in section 278.05, subdivision 4.\n(b) The commissioner, the taxpayer, and any other party to an appeal to the Tax Court may file all necessary notices, documents, and other necessary information with the Tax Court in a manner approved by the Tax Court.\nExcept as provided in section 278.05, subdivision 6, the Rules of Evidence and Civil Procedure for the district court of Minnesota shall govern the procedures in the Tax Court, where practicable. The Rules of Civil Procedure do not apply to alter the 60-day period of time to file a notice of appeal provided in subdivision 2. The Tax Court may adopt rules under chapter 14.",
	"repealed": false
}