{
	"id": "17A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/17A.03",
	"title": "17A.03 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the meanings given them.\n\"Department\" means the Minnesota Department of Agriculture.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's representative.\n[Repealed, 1996 c 310 s 1]\n\"Livestock\" means cattle, sheep, swine, horses intended for slaughter, mules, farmed Cervidae, as defined in section 35.153, subdivision 3, llamas, as defined in section 17.455, subdivision 2, Ratitae, as defined in section 17.453, subdivision 3, bison (buffalo), and goats.\n\"Livestock market agency\" means any person who sells consigned livestock for the account of others, but does not include an occasional or special event or disposal sale.\n\"Livestock dealer\" means any person, including a packing company, engaged in the business of buying or selling livestock on a regular basis for the person's own account or for the account of others.\n\"Livestock dealer\" does not include:\n(a) persons licensed under section 28A.04 who are primarily engaged in the sale of meats at retail and persons operating as frozen food processing plants; and\n(b) persons engaged in the business of farming, when purchasing livestock for breeding or herd replacement purposes or feeding programs, and when selling the livestock they have owned and raised, fed out or fattened for slaughter in their specific farming program.\n\"Agent\" means any individual who is engaged by a livestock dealer to act as the dealer's representative.\n\"Feeder pig market\" means a trading place where producers sell feeder pigs directly to livestock dealers or other farmers.\n\"Packing plants\" and \"slaughtering houses\" means places of business where livestock purchased or acquired is slaughtered.\n\"Buying station\" means any stockyard or concentration point, other than a public stockyard, at which livestock is bought and sold or assembled for shipment to a packing plant or a public stockyard, or graded or weighed for the purpose of establishing a basis for sale or reshipment.\n\"Public stockyard\" means an assembly point operated as a public livestock market for livestock producers, feeders, market agencies and buyers; providing the services and facilities for loading and unloading, yarding and sale of all classes of livestock, for individuals or organizations granted the privilege of the market by the management of the public stockyards.\n\"State livestock weighmaster\" means a person employed by the department and appointed by the commissioner to weigh livestock and issue official certificates of state weight.\n\"Public livestock weigher\" means a person employed by the company to be responsible and accountable for weighing and recording the weights of livestock.\n\"Commercial livestock scale\" means a livestock scale or monorail scale used in the purchase or sale of livestock or livestock carcasses. For purposes of this subdivision, \"livestock scale\" means a scale equipped with stock racks and gates and adapted to weighing single or multiple heads of livestock standing on the scale platform, and \"monorail scale\" means a scale, also called an abattoir scale, a track scale, or a rail scale, the load receiving element of which is part of a monorail conveyor system and which is used primarily for the weighing of livestock carcasses.",
	"repealed": false
}