{
	"id": "237.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.74",
	"title": "237.74 REGULATION OF TELECOMMUNICATIONS CARRIER.",
	"text": "Every telecommunications carrier shall elect and keep on file with the department either a tariff or a price list for each service on or before the effective date of the tariff or price, containing the rules, rates, and classifications used by it in the conduct of the telephone business, including limitations on liability. The filings are governed by chapter 13. The department shall require each telecommunications carrier to keep open for public inspection at designated offices so much of these rates, tariffs or price lists, and rules as the department considers necessary for public information.\nNo telecommunications carrier shall offer telecommunications service within the state upon terms or rates that are unreasonably discriminatory. No telecommunications carrier shall unreasonably limit its service offerings to particular geographic areas unless facilities necessary for the service are not available and cannot be made available at reasonable costs. The rates of a telecommunications carrier must be the same in all geographic locations of the state unless for good cause the commission approves different rates. A company that offers long-distance services shall charge uniform rates and charges on all long-distance routes and in all geographic areas in the state where it offers the services. However, a carrier may offer or provide volume or term discounts or may offer or provide unique pricing to certain customers or to certain geographic locations for special promotions, and may pass through any state, municipal, or local taxes in the specific geographic areas from which the taxes originate.\nNotwithstanding any other provision of this subdivision, a telecommunications carrier may furnish service free or at reduced rates to its officers, agents, or employees in furtherance of their employment.\nExcept as prohibited by this section, prices unique to a particular customer or group of customers may be allowed for services when differences in the cost of providing a service or a service element justify a different price for a particular customer or group of customers. Individual pricing for services may be allowed when a uniform price should not be required because of market conditions. Unique or individual prices for services or service elements in effect before August 1, 1993, are deemed to be lawful under this section.\n(a) When the commission or the department believes that an investigation of any matter relating to any telephone service should for any reason be made, it may on its own motion investigate the service or matter upon notice to the carrier. However, telecommunications carriers are not subject to rate or rate of return regulation and neither the commission nor the department may investigate any matter relating to a telecommunications carrier's costs, rates, or rate of return, except the commission and the department may investigate whether a rate is unreasonably discriminatory under subdivision 2.\n(b) Upon a complaint made against a telecommunications carrier by a telephone company, by another telecommunications carrier, by the governing body of a political subdivision, or by no fewer than five percent or 100, whichever is the lesser number, of the subscribers or spouses of subscribers of the particular telecommunications carrier, that any of the rates, tolls, tariffs or price lists, charges, or schedules is in any respect unjustly discriminatory, or that any service is inadequate or cannot be obtained, the commission, after notice to the telecommunications carrier, shall investigate the matters raised by the complaint.\n(c) If, after making an investigation under paragraph (a) or (b), the commission finds that a significant factual issue raised has not been resolved to its satisfaction, the commission may order that a contested case hearing be conducted under chapter 14 unless the complainant, the telecommunications carrier, and the commission agree that an expedited hearing under section 237.61 is appropriate.\n(d) In any complaint proceeding authorized under this section, telecommunications carriers shall bear the burden of proof consistent with the allocation of the burden of proof to telephone companies in sections 237.01 to 237.73.\n(e) A full and complete record must be kept by the commission of all proceedings before it upon any formal investigation or hearing and all testimony received or offered must be taken down by the stenographer appointed by the commission and a transcribed copy of the record furnished to any party to the investigation upon the payment of the expense of furnishing the transcribed copy.\nIf the commission finds by a preponderance of the evidence presented during the complaint proceeding that existing rates, tolls, tariffs or price lists, charges, or schedules are unjustly discriminatory, or that any service is inadequate or cannot be obtained, the commission may issue its order requiring termination of the discrimination or making the service adequate or obtainable.\n(f) A copy of an order issued under this section must be served upon the person against whom it runs or the person's attorney, and notice of the order must be given to the other parties to the proceedings or their attorneys.\n(g) Any party to a proceeding before the commission or the attorney general may make and perfect an appeal from the order in accordance with chapter 14.\nIf the court finds from an examination of the record that the commission erroneously rejected evidence that should have been admitted, it shall remand the proceedings to the commission with instructions to receive the evidence rejected and any rebutting evidence and to make new findings and return them to the court for further review. Then the commission, after notice to the parties in interest, shall proceed to rehear the matter in controversy and receive the wrongfully rejected evidence and any rebutting evidence offered and make new findings, as upon the original hearing, and transmit it and the new record properly certified to the court of appeals, when the matter shall be again considered by the court in the same manner as in an original appeal.\n(h) When an appeal is taken from any order of the commission under this chapter, the commission shall, without delay, have a certified transcript made of all proceedings, pleadings and files, and testimony taken or offered before it upon which the order was based, showing particularly what, if any, evidence offered was excluded. The transcript must be made and filed with the court administrator of the district court where the appeal is pending.\nA telecommunications carrier may extend its facilities into or through a statutory or home rule charter city or town of this state for furnishing its services, subject to the provisions of sections 237.162 and 237.163. Nothing in this subdivision shall be construed to allow or prohibit facilities bypass of the local exchange telephone company, nor shall it be construed to prohibit the commission from issuing orders concerning facilities bypass of the local exchange telephone company.\n(a) Telecommunications carriers may:\n(1) decrease the rate for a service, or make any change in a tariff or price list that results in a decrease in rates, effective without notice to its customers or the commission; and\n(2) offer a new service, increase the rate for a service, or change the terms, conditions, rules, and regulations of its service offering effective upon notice to its customers. Subject to subdivisions 2 and 9, a telecommunications carrier may discontinue a service, except that a telecommunications carrier must first obtain prior commission approval before discontinuing service to another telecommunications carrier if end users would be deprived of service because of the discontinuance.\n(b) A telecommunications carrier may give notice to its customers by bill inserts, by publication in newspapers of general circulation, or by any other reasonable means. However, notice of increases for intrastate residential rates for the services referenced in section 237.662, subdivision 1, shall be made by bill inserts prominently displaying the notice of price increase on the customer's bill, or by a direct mailing or phone call to the customer. Customer notices for increases of intrastate rates for those services must include as a heading \"NOTICE OF PRICE INCREASE.\"\nA telecommunications carrier shall not be deemed to provide local exchange services within the meaning of sections 237.01 and 237.035 merely because of occasional use of the service by the customer for local exchange service related to the provision of interexchange services.\nTelecommunications carriers are subject to uniform rules pertaining to the conduct of intrastate telephone services by telecommunications carriers that the commission has prescribed and may prescribe, to the extent the rules are not inconsistent with this section. Rules, forms, or reports required by the commission must conform as nearly as practicable to the rules, forms, or reports prescribed by the Federal Communications Commission for interstate business.\nIf a physical connection exists between a telephone exchange system operated by a telephone company and the toll line or lines operated by a telecommunications carrier, neither of the companies shall have the connection severed or the service between the companies discontinued without first obtaining an order from the commission upon an application for permission to discontinue the physical connection. Upon the filing of an application for discontinuance of the connection, the department shall investigate and ascertain whether public convenience requires the continuance of the physical connection, and if the department so finds, the commission shall fix the compensation, terms, and conditions of the continuance of the physical connection and service between the telephone company and the telecommunications carrier. Prior commission approval is not required for severing connections where multiple local exchange companies are authorized to provide service. However, the commission may require the connections if it finds that the connections are in the public interest, but may not require connections with a telecommunications carrier certified to provide only interexchange service.\nSection 237.295 applies to telecommunications carriers as it does to telephone companies.\n(a) This section and rules and orders of the commission adopted or issued under this section may be enforced by criminal prosecution, action to recover civil penalties, injunction, action to compel performance, other appropriate action, or any combination of penalties and remedies.\n(b) A person who knowingly and intentionally violates this section or a rule or order of the commission adopted or issued under this section shall forfeit and pay to the state a penalty, in an amount to be determined by the court, of at least $100 and not more than $1,000 for each day of each violation. The civil penalties provided for in this paragraph may be recovered by a civil action brought by the attorney general in the name of the state. Amounts recovered under this paragraph must be paid into the state treasury.\nNo telecommunications carrier shall construct or operate any line, plant, or system, or any extension of it, or acquire ownership or control of it, either directly or indirectly, without first obtaining from the commission a determination that the present or future public convenience and necessity require or will require the construction, operation, or acquisition, and a new certificate of territorial authority. Nothing in this subdivision requires a telecommunications carrier that has been certified by the commission to provide telephone service before August 1, 1993, to be recertified under this subdivision. Nothing in this subdivision shall be construed to allow or prohibit facilities bypass of the local exchange telephone company, nor shall it be construed to prohibit the commission from issuing orders concerning facilities bypass of the local exchange telephone company.\n[See Note.]\nA telecommunications carrier, on its own or in conjunction with the telephone subscriber's provider of local telephone service, shall offer comprehensive international toll blocking of nondomestic area codes that are part of the North American numbering plans, as a condition of offering service in Minnesota.",
	"repealed": false
}