{
	"id": "61A.281",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.281",
	"title": "61A.281 INVESTMENTS; SUBSIDIARIES.",
	"text": "A domestic life insurance company may organize and hold, or acquire and hold, more than 50 percent of the capital stock of any corporation organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof, or if approved by the commissioner, elsewhere, which is one or more of the following: (1) a corporation providing investment advisory, management or sales services to an investment company or to an insurance company; or (2) a data processing or computer service corporation; or (3) a real property holding, developing, managing or leasing corporation; or (4) a mortgage loan corporation engaged in the business of making, originating, purchasing, or otherwise acquiring or investing in, and servicing or selling or otherwise disposing of loans secured by mortgages on real property; or (5) a corporation whose business is owning and managing or leasing personal property; or (6) a corporation other than a bank or an insurance company, whose business has been approved by the commissioner as complementary or supplementary to the business of a domestic life insurance company. Provided, however, that such percentage of stock may, with the approval of the commissioner, be 50 percent or less. The limits contained in the other investment sections of the insurance code shall not apply to such holdings, provided that the aggregate cost of the investments made under this subdivision shall not exceed five percent of the domestic life insurance company's admitted assets.\nA domestic life insurance company may organize and hold, or acquire and hold, more than 50 percent of the capital stock of any corporation organized under the laws of the United States or any state thereof, or the Dominion of Canada or any province thereof, or if approved by the commissioner, elsewhere, whether or not of the type of corporation enumerated in subdivision 1 or approved by the commissioner under subdivision 1. The limits contained in the other investment sections of Minnesota Statutes relating to insurance shall not apply to such holdings, provided that the aggregate cost of the investments made under authority of this subdivision shall not exceed ten percent of the capital and surplus of the domestic life insurance company.\nThe commissioner may issue such reasonable rules as may be appropriate to carry out the purposes of this section.\nA domestic life insurance company may organize or acquire a corporation domiciled in the United States and hold the capital stock thereof, provided that it shall continuously own more than 50 percent of such capital stock. The corporation so organized or acquired shall limit its activities to the investing of its assets in the same corporations, subject to the same ownership requirements, in which the insurance company may directly invest under subdivisions 1 and 2; provided that the sum of the total cost of the investments made by both it and the insurance company in corporations authorized under said subdivision 1 or said subdivision 2 shall not exceed the dollar amount which would have been applicable had the insurance company directly made such investments. The limits contained in the other investment sections of the insurance code shall not apply to any investment made by the insurance company under this subdivision, provided that the aggregate cost of the investments made by the insurance company hereunder and under said subdivisions 1 and 2 shall not exceed the sum of five percent of the insurance company's admitted assets and ten percent of the insurance company's capital and surplus.\nA domestic life insurance company may organize one or more corporations domiciled in the United States and hold the capital stock of them, provided that it shall continuously own all of the capital stock and that the corporations so organized shall limit their activities to acquiring and holding investments, other than under subdivisions 1 to 4, that a domestic life insurance company may acquire and hold. The investments of these corporations are subject to the same restrictions and requirements as apply to domestic life insurance companies, including the applicable percentage limitations for investments in individual properties and entities and limitations on the aggregate amount to be invested in any investment category. For the purposes of calculating the amount of an investment held by the life insurance company, investments in the same property, entity, or investment category that are owned by the company and all corporations qualifying under this subdivision must be aggregated.",
	"repealed": false
}