{
	"id": "518E.4011",
	"url": "https://www.revisor.mn.gov/statutes/cite/518E.4011",
	"title": "518E.4011 RETURN FROM DEPLOYMENT; NOTIFICATION REQUIREMENT.",
	"text": "(a) When a deploying parent returns from deployment and a custodial responsibility order concerning the deploying parent's child has been previously issued by the court, the deploying parent or the appropriate commanding officer must provide notice in a record regarding the return of a deploying parent from deployment as provided in this section.\n(b) The notice must be given not later than seven days after the deploying parent or the appropriate commanding officer receives the deploying parent's conclusion of service order or a letter from the deploying parent's command, on command letterhead, stating that the deploying parent has concluded service, unless the deploying parent and the commanding officer are reasonably prevented from doing so by the circumstances of the return from deployment. If the circumstances of the return from deployment prevent giving notification within seven days of receiving the deploying parent's conclusion of service order or a letter from the deploying parent's command, on command letterhead, stating that the deploying parent has concluded service, the deploying parent or the appropriate commanding officer must give the notification of return from deployment as soon as reasonably possible.\n(c) The notice of return from deployment must include the following:\n(1) the names of both parents;\n(2) the names of each child of the parents;\n(3) the case number and the heading of the case concerning the custodial responsibility or child support of the child;\n(4) the IV-D number, if applicable; and\n(5) the date of the deployed parent's return from deployment.\n(d) The notice of return from deployment must be accompanied by the following:\n(1) the conclusion of the deploying parent's service in that parent's service orders;\n(2) the conclusion of the deploying parent's service as specified in that parent's command service orders; or\n(3) a letter from the deploying parent's command, on command letterhead, stating that the deploying parent has concluded service.\n(e) The notice of return from deployment must be filed with the court and served by mail upon:\n(1) the other parent of the child;\n(2) a nonparent who was granted custodial responsibility; and\n(3) the county attorney, if a IV-D case.\n(f) If a court order currently in effect prohibits disclosure of the address or contact information of the other parent, notification of return from deployment under this section may be made only to the issuing court. If the address of the other parent is available to the issuing court, the court shall forward the notification to the other parent. The court shall keep confidential the address or contact information of the other parent.\n(g) Notification in a record under this section is not required if the parents are living in the same residence immediately after the return from deployment and both parents have actual notice of the return from deployment.",
	"repealed": false
}