{
	"id": "144A.754",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.754",
	"title": "144A.754 ENFORCEMENT.",
	"text": "(a) The commissioner may refuse to grant or renew a license, or may suspend or revoke a license, for violation of statutes or rules relating to hospice or for conduct detrimental to the welfare of a patient. Prior to any suspension, revocation, or refusal to renew a license, the hospice provider is entitled to notice and a hearing as provided by chapter 14.\n(b) In addition to any other remedy provided by law, the commissioner may, without a prior contested case hearing, temporarily suspend a license or prohibit delivery of hospice care by a provider for not more than 60 days if the commissioner determines that the health or safety of a patient is in imminent danger, provided:\n(1) advance notice is given to the provider;\n(2) after notice, the provider fails to correct the problem;\n(3) the commissioner has reason to believe that other administrative remedies are not likely to be effective; and\n(4) there is an opportunity for a contested case hearing within the 60 days.\n(c) The process of suspending or revoking a license must include a plan for transferring affected patients to other providers.\n(d) The owner and managerial officials of a hospice provider, the license of which has not been renewed or has been revoked because of noncompliance with applicable law, are not eligible to apply for and shall not be granted a license for five years following the effective date of the nonrenewal or revocation.\n(e) The commissioner shall not issue a license to a hospice provider if an owner or managerial official includes an individual who was an owner or managerial official of a hospice provider or other type of licensed home care provider whose license was not renewed or was revoked as described in paragraph (d) for five years following the effective date of nonrenewal or revocation.\n(f) Notwithstanding the provisions of paragraph (a), the commissioner shall not renew or shall suspend or revoke the license of a hospice provider that includes an individual as an owner or managerial official who was an owner or managerial official of a hospice provider whose license was not renewed or was revoked as described in paragraph (d) for five years following the effective date of the nonrenewal or revocation.\n(g) The commissioner shall notify the hospice provider 30 days in advance of the date of nonrenewal, suspension, or revocation of the license. Within ten days after the receipt of this notification, the hospice provider may request, in writing, that the commissioner stay the nonrenewal, revocation, or suspension of the license. The hospice provider shall specify the reasons for requesting the stay; the steps that will be taken to attain or maintain compliance with the licensure laws; any limits on the authority or responsibility of the owners or managerial officials whose actions resulted in the notice of nonrenewal, revocation, or suspension; and any other information to establish that the continuing affiliation with these individuals will not jeopardize patient health, safety, or well-being. The commissioner shall determine whether the stay will be granted within 30 days of receiving the provider's request. The commissioner may propose additional restrictions or limitations on the provider's license and require that the granting of the stay be contingent upon compliance with those provisions. The commissioner shall take into consideration the following factors when determining whether the stay should be granted:\n(1) the threat that continued involvement of the owners and managerial officials in the hospice provider poses to patient health, safety, and well-being;\n(2) the compliance history of the hospice provider; and\n(3) the appropriateness of any limits suggested by the hospice provider.\n(h) If the commissioner grants the stay, the order shall include any restrictions or limitations on the provider's license. The failure of the provider to comply with any restrictions or limitations shall result in the immediate removal of the stay and the commissioner shall take immediate action to suspend, revoke, or not renew the license.\n(i) The provisions contained in paragraphs (d) and (e) apply to any nonrenewal or revocation of a hospice provider license occurring after the effective date of the rules adopted under section 144A.752.\n(j) For the purposes of this subdivision, owners of a hospice provider are those individuals whose ownership interest provides sufficient authority or control to affect or change decisions related to the operation of the hospice provider. An owner includes a sole proprietor, a general partner, or any other individual whose individual ownership interest can affect the management and direction of the policies of the hospice provider. For the purposes of this subdivision, managerial officials are those individuals who had the responsibility for the ongoing management or direction of the policies, services, or employees of the hospice provider relating to the areas of noncompliance that led to the license revocation or nonrenewal.\nIn addition to any other remedy provided by law, the commissioner may bring an action in district court to enjoin a person who is involved in the management, operation, or control of a hospice provider or an employee of the hospice provider from illegally engaging in activities regulated under sections 144A.75 to 144A.755. The commissioner may bring an action under this subdivision in the district court in Ramsey County or in the district in which a hospice provider is providing hospice care. The court may grant a temporary restraining order in the proceeding if continued activity by the person who is involved in the management, operation, or control of a hospice provider or an employee of the hospice provider would create an imminent risk of harm to a recipient of hospice care.\nIn matters pending before the commissioner under sections 144A.75 to 144A.755, the commissioner may issue subpoenas and compel the attendance of witnesses and the production of all necessary papers, books, records, documents, and other evidentiary material. If a person fails or refuses to comply with a subpoena or order of the commissioner to appear or testify regarding any matter about which the person may be lawfully questioned or to produce any papers, books, records, documents, or evidentiary materials in the matter to be heard, the commissioner may apply to the district court in any district and the court shall order the person to comply with the commissioner's order or subpoena. The commissioner may administer oaths to witnesses or take their affirmation. Depositions may be taken in or outside the state in the manner provided by law for the taking of depositions in civil actions. A subpoena or other process or paper may be served upon a named person anywhere within the state by an officer authorized to serve subpoenas in civil actions, with the same fees and mileage and in the same manner as prescribed by law for process issued out of a district court. A person subpoenaed under this subdivision shall receive the same fees, mileage, and other costs that are paid in proceedings in district court.\nTo appeal the assessment of civil penalties under section 144A.752, subdivision 2, clause (4), a denial of a waiver or variance, and an action against a license under subdivision 1, a hospice provider must request a hearing no later than 15 days after the provider receives notice of the action.\n(a) Before the commissioner issues an initial or renewal license, an owner or managerial official is required to complete a background study under section 144.057. No person may be involved in the management, operation, or control of a hospice provider if the person has been disqualified under the provisions of chapter 245C. Individuals disqualified under these provisions may request a reconsideration, and if the disqualification is set aside, are then eligible to be involved in the management, operation, or control of the provider. For purposes of this section, owners of a hospice provider subject to the background check requirement are those individuals whose ownership interest provides sufficient authority or control to affect or change decisions related to the operation of the hospice provider. An owner includes a sole proprietor, a general partner, or any other individual whose individual ownership interest can affect the management and direction of the policies of the hospice provider. For the purposes of this section, managerial officials subject to the background check requirement are those individuals who provide \"direct contact\" as defined in section 245C.02, subdivision 11, or those individuals who have the responsibility for the ongoing management or direction of the policies, services, or employees of the hospice provider. Data collected under this subdivision are classified as private data under section 13.02, subdivision 12.\n(b) Employees, contractors, and volunteers of a hospice provider are subject to the background study required by section 144.057. These individuals shall be disqualified under the provisions of chapter 245C. Nothing in this section shall be construed to prohibit a hospice provider from requiring self-disclosure of criminal conviction information.\n(c) Termination of an employee in good faith reliance on information or records obtained under paragraph (a) or (b) regarding a confirmed conviction does not subject the hospice provider to civil liability or liability for unemployment benefits.",
	"repealed": false
}