{
	"id": "204C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.07",
	"title": "204C.07 CHALLENGERS.",
	"text": "At an election to fill partisan offices, the chair of an authorized committee of each major political party may appoint by written certificate voters from that political party to act as challengers of voters at the polling place for each precinct. Only one challenger from each major political party for each precinct shall be allowed to remain in the polling place at one time.\nAt an election to fill nonpartisan offices, each nonpartisan candidate may appoint by written certificate voters to act as challengers of voters at the polling place for each precinct. Only one challenger for each candidate shall be allowed to remain in the polling place for each precinct at one time.\nAt an election where a question is to be voted upon in an election jurisdiction, the appropriate mayor of a city, school board of a school district, or board of supervisors of a town, upon receiving a written petition signed by at least 25 eligible voters, shall appoint by written certificate one voter for each precinct in the municipality, or school district if applicable, to act as a challenger of voters in the polling place for that precinct. The petition must be delivered to the clerk of the municipality or school conducting the election.\nA challenger must be a resident of this state. Appointed challengers seeking admission to a polling place to serve in that capacity must prove their status as a resident of this state by presenting one of the documents listed in section 201.061, subdivision 3. Challengers need not prove residence in the precinct in which they seek to act as a challenger.\nAn election judge must not be appointed as a challenger. The election judges must permit challengers appointed pursuant to this section to be present in the polling place during the hours of voting and to remain there until the votes are counted and the results declared. A challenger must not handle or inspect registration cards, files, or lists. Challengers must not prepare in any manner any list of individuals who have or have not voted. They must not attempt to influence voting in any manner. In accordance with section 204C.12, challengers must not converse with a voter.\nChallengers and the political parties that appointed them must not compile lists of voters to challenge on the basis of mail sent by a political party that was returned as undeliverable or if receipt by the intended recipient was not acknowledged in the case of registered mail. This subdivision applies to any local, state, or national affiliate of a political party that has appointed challengers, as well as any subcontractors, vendors, or other individuals acting as agents on behalf of a political party.\nA violation of this subdivision is a gross misdemeanor.",
	"repealed": false
}