{
	"id": "18C.430",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.430",
	"title": "18C.430 COMMERCIAL ANIMAL WASTE TECHNICIAN.",
	"text": "(a) A person may not manage or apply animal wastes to the land for hire:\n(1) without a valid commercial animal waste technician applicator license;\n(2) without a valid commercial animal waste technician site manager license; or\n(3) as a sole proprietorship, company, partnership, or corporation unless a commercial animal waste technician company license is held and a commercial animal waste technical site manager is employed by the entity.\n(b) A person managing or applying animal wastes for hire must have a valid license identification card when managing or applying animal wastes for hire and must display it upon demand by an authorized representative of the commissioner or a law enforcement officer. The commissioner shall prescribe the information required on the license identification card.\n(c) A commercial animal waste technician applicator must have a minimum of two hours of certification training in animal waste management and may only manage or apply animal waste for hire under the supervision of a commercial animal waste technician site manager. The commissioner shall prescribe the conditions of the supervision and the form and format required on the certification training.\n(d) This section does not apply to a person managing or applying animal waste on land managed by the person's employer.\nA person required to be licensed under this section who performs animal waste management or application for hire or who employs a person to perform animal waste management or application for compensation is responsible for proper management or application of the animal wastes.\n(a) A commercial animal waste technician license, including applicator, site manager, and company:\n(1) is valid for one year and expires on December 31 of the year for which it is issued, unless suspended or revoked before that date;\n(2) is not transferable to another person; and\n(3) must be prominently displayed to the public in the commercial animal waste technician's place of business.\n(b) The commercial animal waste technician company license number assigned by the commissioner must appear on the application equipment when a person manages or applies animal waste for hire.\n(a) A person must apply to the commissioner for a commercial animal waste technician license on forms and in the manner required by the commissioner and must include the application fee. The commissioner shall prescribe and administer an examination or equivalent measure to determine if the applicant is eligible for the commercial animal waste technician license, site manager license, or applicator license.\n(b) The commissioner of agriculture, in cooperation with University of Minnesota Extension and appropriate educational institutions, shall establish and implement a program for training and licensing commercial animal waste technicians.\n(a) A person must apply to the commissioner of agriculture to renew a commercial animal waste technician license and must include the application fee. The commissioner may renew a commercial animal waste technician applicator or site manager license, subject to reexamination, attendance at workshops approved by the commissioner, or other requirements imposed by the commissioner to provide the animal waste technician with information regarding changing technology and to help ensure a continuing level of competence and ability to manage and apply animal wastes properly. The applicant may renew a commercial animal waste technician license within 12 months after expiration of the license without having to meet initial testing requirements. The commissioner may require additional demonstration of animal waste technician qualification if a person has had a license suspended or revoked or has had a history of violations of this section.\n(b) An applicant who meets renewal requirements by reexamination instead of attending workshops must pay a fee for the reexamination as determined by the commissioner.\n(a) A commercial animal waste technician license may not be issued unless the applicant furnishes proof of financial responsibility. The financial responsibility may be demonstrated by (1) proof of net assets equal to or greater than $50,000, or (2) a performance bond or insurance of the kind and in an amount determined by the commissioner of agriculture.\n(b) The bond or insurance must cover a period of time at least equal to the term of the applicant's license. The commissioner shall immediately suspend the license of a person who fails to maintain the required bond or insurance.\n(c) An employee of a licensed person is not required to maintain an insurance policy or bond during the time the employer is maintaining the required insurance or bond.\n(d) Applications for reinstatement of a license suspended under paragraph (b) must be accompanied by proof of satisfaction of judgments previously rendered.\n(a) A person initially applying for or renewing a commercial animal waste technician applicator license must pay a nonrefundable fee of $25. A person initially applying for or renewing a commercial animal waste technician site manager license must pay a nonrefundable application fee of $50. A person initially applying for or renewing a commercial animal waste technician company license must pay a nonrefundable application fee of $100.\n(b) A license renewal application received after March 1 in the year for which the license is to be issued is subject to a penalty fee of 50 percent of the application fee. The penalty fee must be paid before the renewal license may be issued.\n(c) An application for a duplicate commercial animal waste technician license must be accompanied by a nonrefundable fee of $10.",
	"repealed": false
}