{
	"id": "216B.096",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.096",
	"title": "216B.096 COLD WEATHER RULE; PUBLIC UTILITY.",
	"text": "This section applies only to residential customers of a utility.\n(a) The terms used in this section have the meanings given them in this subdivision.\n(b) \"Cold weather period\" means the period from October 1 through April 30 of the following year.\n(c) \"Customer\" means a residential customer of a utility.\n(d) \"Disconnection\" means the involuntary loss of utility heating service as a result of a physical act by a utility to discontinue service. Disconnection includes installation of a service or load limiter or any device that limits or interrupts utility service in any way.\n(e) \"Household income\" means the combined income, as defined in section 290A.03, subdivision 3, of all residents of the customer's household, computed on an annual basis. Household income does not include any amount received for energy assistance.\n(f) \"Reasonably timely payment\" means payment within five working days of agreed-upon due dates.\n(g) \"Reconnection\" means the restoration of utility heating service after it has been disconnected.\n(h) \"Summary of rights and responsibilities\" means a commission-approved notice that contains, at a minimum, the following:\n(1) an explanation of the provisions of subdivision 5;\n(2) an explanation of no-cost and low-cost methods to reduce the consumption of energy;\n(3) a third-party notice;\n(4) ways to avoid disconnection;\n(5) information regarding payment agreements;\n(6) an explanation of the customer's right to appeal a determination of income by the utility and the right to appeal if the utility and the customer cannot arrive at a mutually acceptable payment agreement; and\n(7) a list of names and telephone numbers for county and local energy assistance and weatherization providers in each county served by the utility.\n(i) \"Third-party notice\" means a commission-approved notice containing, at a minimum, the following information:\n(1) a statement that the utility will send a copy of any future notice of proposed disconnection of utility heating service to a third party designated by the residential customer;\n(2) instructions on how to request this service; and\n(3) a statement that the residential customer should contact the person the customer intends to designate as the third-party contact before providing the utility with the party's name.\n(j) \"Utility\" means a public utility as defined in section 216B.02, and a cooperative electric association electing to be a public utility under section 216B.026. Utility also means a municipally owned gas or electric utility for nonresident consumers of the municipally owned utility and a cooperative electric association when a complaint in connection with utility heating service during the cold weather period is filed under section 216B.17, subdivision 6 or 6a.\n(k) \"Utility heating service\" means natural gas or electricity used as a primary heating source, including electricity service necessary to operate gas heating equipment, for the customer's primary residence.\n(l) \"Working days\" means Mondays through Fridays, excluding legal holidays. The day of receipt of a personally served notice and the day of mailing of a notice shall not be counted in calculating working days.\nEach year, between August 15 and October 1, each utility must provide all customers, personally, by first class mail, or electronically for those requesting electronic billing, a summary of rights and responsibilities. The summary must also be provided to all new residential customers when service is initiated.\nBefore disconnecting utility heating service during the cold weather period, a utility must provide, personally or by first class mail, a commission-approved notice to a customer, in easy-to-understand language, that contains, at a minimum, the date of the scheduled disconnection, the amount due, and a summary of rights and responsibilities.\n(a) During the cold weather period, a utility may not disconnect and must reconnect utility heating service of a customer whose household income is at or below 50 percent of the state median income if the customer enters into and makes reasonably timely payments under a mutually acceptable payment agreement with the utility that is based on the financial resources and circumstances of the household; provided that, a utility may not require a customer to pay more than ten percent of the household income toward current and past utility bills for utility heating service.\n(b) A utility may accept more than ten percent of the household income as the payment arrangement amount if agreed to by the customer.\n(c) The customer or a designated third party may request a modification of the terms of a payment agreement previously entered into if the customer's financial circumstances have changed or the customer is unable to make reasonably timely payments.\n(d) The payment agreement terminates at the expiration of the cold weather period unless a longer period is mutually agreed to by the customer and the utility.\n(e) Each utility shall use reasonable efforts to restore service within 24 hours of an accepted payment agreement, taking into consideration customer availability, employee availability, and construction-related activity.\n(a) In verifying a customer's household income, a utility may:\n(1) accept the signed statement of a customer that the customer is income eligible;\n(2) obtain income verification from a local energy assistance provider or a government agency;\n(3) consider one or more of the following:\n(i) the most recent income tax return filed by members of the customer's household;\n(ii) for each employed member of the customer's household, paycheck stubs for the last two months or a written statement from the employer reporting wages earned during the preceding two months;\n(iii) documentation that the customer receives a pension from the Department of Human Services, the Social Security Administration, the Veteran's Administration, or other pension provider;\n(iv) a letter showing the customer's dismissal from a job or other documentation of unemployment; or\n(v) other documentation that supports the customer's declaration of income eligibility.\n(b) A customer who receives energy assistance benefits under any federal, state, or county government programs in which eligibility is defined as household income at or below 50 percent of state median income is deemed to be automatically eligible for protection under this section and no other verification of income may be required.\n(a) This subdivision applies during the cold weather period.\n(b) A utility may not charge a deposit or delinquency charge to a customer who has entered into a payment agreement or a customer who has appealed to the commission under subdivision 8.\n(c) A utility may not disconnect service during the following periods:\n(1) during the pendency of any appeal under subdivision 8;\n(2) earlier than ten working days after a utility has deposited in first class mail, or seven working days after a utility has personally served, the notice required under subdivision 4 to a customer in an occupied dwelling;\n(3) earlier than ten working days after the utility has deposited in first class mail the notice required under subdivision 4 to the recorded billing address of the customer, if the utility has reasonably determined from an on-site inspection that the dwelling is unoccupied;\n(4) on a Friday, unless the utility makes personal contact with, and offers a payment agreement consistent with this section to the customer;\n(5) on a Saturday, Sunday, holiday, or the day before a holiday;\n(6) when utility offices are closed;\n(7) when no utility personnel are available to resolve disputes, enter into payment agreements, accept payments, and reconnect service; or\n(8) when commission offices are closed.\n(d) A utility may not discontinue service until the utility investigates whether the dwelling is actually occupied. At a minimum, the investigation must include one visit by the utility to the dwelling during normal working hours. If no contact is made and there is reason to believe that the dwelling is occupied, the utility must attempt a second contact during nonbusiness hours. If personal contact is made, the utility representative must provide notice required under subdivision 4 and, if the utility representative is not authorized to enter into a payment agreement, the telephone number the customer can call to establish a payment agreement.\n(e) Each utility must reconnect utility service if, following disconnection, the dwelling is found to be occupied and the customer agrees to enter into a payment agreement or appeals to the commission because the customer and the utility are unable to agree on a payment agreement.\n(a) A utility must provide the customer and any designated third party with a commission-approved written notice of the right to appeal:\n(1) a utility determination that the customer's household income is more than 50 percent of state median household income; or\n(2) when the utility and customer are unable to agree on the establishment or modification of a payment agreement.\n(b) A customer's appeal must be filed with the commission no later than seven working days after the customer's receipt of a personally served appeal notice, or within ten working days after the utility has deposited a first class mail appeal notice.\n(c) The commission must determine all customer appeals on an informal basis, within 20 working days of receipt of a customer's written appeal. In making its determination, the commission must consider one or more of the factors in subdivision 6.\n(d) Notwithstanding any other law, following an appeals decision adverse to the customer, a utility may not disconnect utility heating service for seven working days after the utility has personally served a disconnection notice, or for ten working days after the utility has deposited a first class mail notice. The notice must contain, in easy-to-understand language, the date on or after which disconnection will occur, the reason for disconnection, and ways to avoid disconnection.\nComplaints in connection with utility heating service during the cold weather period filed against a municipal or a cooperative electric association with the commission under section 216B.17, subdivision 6 or 6a, are governed by section 216B.097.\nDuring the cold weather period, a customer whose household income is above 50 percent of state median income:\n(1) has the right to a payment agreement that takes into consideration the customer's financial circumstances and any other extenuating circumstances of the household; and\n(2) may not be disconnected and must be reconnected if the customer makes timely payments under a payment agreement accepted by a utility.\nSubdivision 7, paragraph (b), does not apply to customers whose household income is above 50 percent of state median income.\nAnnually on October 15, a utility must electronically file with the commission a report, in a format specified by the commission, specifying the number of utility heating service customers whose service is disconnected or remains disconnected for nonpayment as of September 15 and October 1. If customers remain disconnected on October 1, a utility must file a report each week between October 15 and the end of the cold weather period specifying:\n(1) the number of utility heating service customers that are or remain disconnected from service for nonpayment; and\n(2) the number of utility heating service customers that are reconnected to service each week. The utility may discontinue weekly reporting if the number of utility heating service customers that are or remain disconnected reaches zero before the end of the cold weather period.\nThe data reported under this subdivision are presumed to be accurate upon submission and must be made available through the commission's electronic filing system.",
	"repealed": false
}