{
	"id": "402A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/402A.10",
	"title": "402A.10 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given.\nA \"balanced set of program measures\" is a set of measures that, together, adequately quantify achievement toward a particular program's outcome. As directed by section 402A.16, the Human Services Performance Council must recommend to the commissioner when a particular program has a balanced set of program measures.\n\"Commissioner\" means the commissioner of human services.\n\"Council\" means the State-County Results, Accountability, and Service Delivery Redesign Council established in section 402A.20.\n\"Essential human services\" or \"essential services\" means assistance and services to recipients or potential recipients of public welfare and other services delivered by counties or tribes that are mandated in federal and state law that are to be available in all counties of the state.\nAn \"essential human services program\" for the purposes of remedies under section 402A.18 means the following programs:\n(1) child welfare, including protection, truancy, minor parent, guardianship, and adoption;\n(2) children's mental health;\n(3) children's disability services;\n(4) public assistance eligibility, including measures related to processing timelines across information services programs;\n(5) MFIP;\n(6) child support;\n(7) substance use disorder;\n(8) adult disability;\n(9) adult mental health;\n(10) adult services such as long-term care; and\n(11) adult protection.\nA \"measure\" means a quantitative indicator of a performance outcome.\nA \"performance improvement plan\" means a plan developed by a county or service delivery authority that describes steps the county or service delivery authority must take to improve performance on a specific measure or set of measures. The performance improvement plan must be negotiated with and approved by the commissioner. The performance improvement plan must require a specific numerical improvement in the measure or measures on which the plan is based and may include specific programmatic best practices or specific performance management practices that the county must implement.\nA \"performance management system for human services\" means a process by which performance data for essential human services is collected from counties or service delivery authorities and used to inform a variety of stakeholders and to improve performance over time.\n\"Service delivery authority\" means a single county, or consortium of counties operating by execution of a joint powers agreement under section 471.59 or other contractual agreement, that has voluntarily chosen by resolution of the county board of commissioners to participate in the redesign under this chapter or has been assigned by the commissioner pursuant to section 402A.18. A service delivery authority includes an Indian tribe or group of tribes that have voluntarily chosen by resolution of tribal government to participate in redesign under this chapter.\n\"Steering committee\" means the Steering Committee on Performance and Outcome Reforms.",
	"repealed": false
}