{
	"id": "179.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.02",
	"title": "179.02 BUREAU OF MEDIATION SERVICES.",
	"text": "There is established a Bureau of Mediation Services under the supervision and control of a commissioner. The commissioner shall be appointed by the governor under the provisions of section 15.06.\nThe commissioner may, from time to time, appoint special mediators to aid in the settlement of particular labor disputes or controversies who shall have the same power and authority as the commissioner with respect to such dispute and such appointment shall be for the duration only of the particular dispute. Such special mediators shall be paid a per diem allowance as determined by the commissioner, while so engaged and their necessary expenses.\nThe commissioner shall adopt rules to govern proceedings before the commissioner under the provisions of this chapter.\nThe commissioner shall maintain a roster of persons suited and qualified by training and experience to act as arbitrators of labor disputes and shall provide parties to a labor dispute with the names of persons on the roster upon written request. The commissioner shall adopt rules governing appointments to, removals from, and administration of this roster.\nThe commissioner may provide technical support and assistance to voluntary joint labor-management committees established for the purpose of improving relationships between unions and employers at area, industry, or work-site levels.\n(a) The commissioner may apply for, accept, and disburse gifts, bequests, grants, or payments for services from the United States, the state, private foundations, or any other source.\n(b) Money received by the commissioner under this subdivision must be deposited in a separate account in the state treasury and invested by the State Board of Investment. The amount deposited, including investment earnings, is appropriated to the commissioner to carry out duties of the commissioner.\n(c) The commissioner must post and maintain, on the Bureau of Mediation Services website, a list of the sources of funds and amounts received under this subdivision.",
	"repealed": false
}