{
	"id": "216C.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.331",
	"title": "216C.331 ENERGY BENCHMARKING.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Aggregated customer energy use data\" means customer energy use data that is combined into one collective data point per time interval. Aggregated customer energy use data is data with any unique identifiers or other personal information removed that a qualifying utility collects and aggregates in at least monthly intervals for an entire building on a covered property.\n(c) \"Benchmark\" means to electronically input into a benchmarking tool whole building energy use data and other descriptive information about a building that is required by a benchmarking tool.\n(d) \"Benchmarking information\" means data related to a building's energy use generated by a benchmarking tool, and other information about the building's physical and operational characteristics. Benchmarking information includes but is not limited to the building's:\n(1) address;\n(2) owner and, if applicable, the building manager responsible for operating the building's physical systems;\n(3) total floor area, expressed in square feet;\n(4) energy use intensity;\n(5) greenhouse gas emissions; and\n(6) energy performance score comparing the building's energy use with that of similar buildings.\n(e) \"Benchmarking tool\" means the United States Environmental Protection Agency's Energy Star Portfolio Manager tool or an equivalent tool determined by the commissioner.\n(f) \"Covered property\" means any property that is served by an investor-owned utility in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County, or in any city outside the metropolitan area with a population of over 50,000 residents, as determined by the Minnesota State Demographic Center, served by a municipal energy utility or investor-owned utility, and that has one or more buildings containing in sum 50,000 gross square feet or greater. Covered property does not include:\n(1) a residential property containing fewer than five dwelling units;\n(2) a property that is: (i) classified as manufacturing under the North American Industrial Classification System; (ii) an energy-intensive trade-exposed customer, as defined in section 216B.1696; (iii) an electric power generation facility; (iv) a mining facility; or (v) an industrial building otherwise incompatible with benchmarking in the benchmarking tool, as determined by the commissioner;\n(3) an agricultural building;\n(4) a multitenant building that is served by a utility that is not supplying aggregated customer usage data under subdivision 8 or is not using a customer usage data aggregation program to supply aggregated customer usage data to the benchmarking tool; or\n(5) other property types that do not meet the purposes of this section, as determined by the commissioner.\n(g) \"Customer energy use data\" means data collected from utility customer meters that reflect the quantity, quality, or timing of customers' energy use.\n(h) \"Energy\" means electricity, natural gas, steam, or another product used to: (1) provide heating, cooling, lighting, or water heating; or (2) power other end uses in a building.\n(i) \"Energy performance score\" means a numerical value from one to 100 that the Energy Star Portfolio Manager tool calculates to rate a building's energy efficiency against that of comparable buildings nationwide.\n(j) \"Energy Star Portfolio Manager\" means an interactive resource management tool developed by the United States Environmental Protection Agency that (1) enables the periodic entry of a building's energy use data and other descriptive information about a building, and (2) rates a building's energy efficiency against that of comparable buildings nationwide.\n(k) \"Energy use intensity\" means the total annual energy consumed in a building divided by the building's total floor area.\n(l) \"Financial distress\" means a covered property that, at the time benchmarking is conducted:\n(1) is the subject of a qualified tax lien sale or public auction due to property tax arrearages;\n(2) is controlled by a court-appointed receiver based on financial distress;\n(3) is owned by a financial institution through default by the borrower;\n(4) has been acquired by deed in lieu of foreclosure; or\n(5) has a senior mortgage that is subject to a notice of default.\n(m) \"Local government\" means a statutory or home rule municipality or county.\n(n) \"Owner\" means:\n(1) an individual or entity that possesses title to a covered property; or\n(2) an agent authorized to act on behalf of the covered property owner.\n(o) \"Qualifying utility\" means:\n(1) an electric or gas utility, including:\n(i) an investor-owned electric or gas utility serving customers in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County, or in any city outside the metropolitan area with a population of over 50,000 residents, as determined by the Minnesota State Demographic Center, and serving properties with one or more buildings containing in sum 50,000 gross square feet or greater; or\n(ii) a municipally owned electric or gas utility serving customers in any city with a population of over 50,000 residents, as determined by the Minnesota State Demographic Center, and serving properties with one or more buildings containing in sum 50,000 gross square feet or greater;\n(2) a natural gas supplier with five or more active commercial connections, accounts, or customers in the state and serving customers in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County, or in any city outside the metropolitan area with a population of over 50,000 residents, as determined by the Minnesota State Demographic Center, and serving properties with one or more buildings containing in sum 50,000 gross square feet or greater; or\n(3) a district steam, hot water, or chilled water provider serving customers in Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington County, or in any city outside the metropolitan area with a population of over 50,000 residents, as determined by the Minnesota State Demographic Center, and serving properties with one or more buildings containing in sum 50,000 gross square feet or greater.\n(p) \"Tenant\" means a person that occupies or holds possession of a building or part of a building or premises pursuant to a lease agreement.\n(q) \"Total floor area\" means the sum of gross square footage inside a building's envelope, measured between the outside exterior walls of the building. Total floor area includes covered parking structures.\n(r) \"Utility customer\" means the building owner or tenant listed on the utility's records as the customer liable for payment of the utility service or additional charges assessed on the utility account.\n(s) \"Whole building energy use data\" means all energy consumed in a building, whether purchased from a third party or generated at the building site or from any other source.\nThe commissioner must establish and maintain a building energy benchmarking program. The purpose of the program is to:\n(1) make a building's owners, tenants, and potential tenants aware of (i) the building's energy consumption levels and patterns, and (ii) how the building's energy use compares with that of similar buildings nationwide; and\n(2) enhance the likelihood that an owner adopts energy conservation measures in the owner's building as a way to reduce energy use, operating costs, and greenhouse gas emissions.\nFor the purposes of this section, a covered property is classified as follows:\n(a) An owner must annually benchmark all covered property owned as of December 31 in conformity with the schedule in subdivision 7. Energy use data must be compiled by:\n(1) obtaining the data from the utility providing the energy; or\n(2) reading a master meter.\n(b) Before entering information in a benchmarking tool, an owner must run all automated data quality assurance functions available within the benchmarking tool and must correct all data identified as missing or incorrect.\n(c) An owner who becomes aware that any information entered into a benchmarking tool is inaccurate or incomplete must amend the information in the benchmarking tool within 30 days of the date the owner learned of the inaccuracy.\n(d) Nothing in this subdivision prohibits an owner of property that is not a covered property from voluntarily benchmarking a property under this section.\n(a) The commissioner may exempt an owner of a specific covered property from the requirements of subdivision 4 if the owner provides evidence satisfactory to the commissioner that the covered property for which the owner is seeking an exemption:\n(1) is presently experiencing financial distress;\n(2) has been less than 50 percent occupied during the previous calendar year;\n(3) does not have a certificate of occupancy or temporary certificate of occupancy for the full previous calendar year;\n(4) was issued a demolition permit during the previous calendar year that remains current; or\n(5) received no energy services for at least 30 days during the previous calendar year.\n(b) An exemption granted under this subdivision applies only to a single calendar year. An owner must reapply to the commissioner each year an extension is sought.\n(c) Within 30 days of the date an owner makes a request under this paragraph, a tenant of a covered property subject to this section must provide the owner with any information regarding energy use of the tenant's rental unit that the property owner cannot otherwise obtain and that is needed by the owner to comply with this section. The tenant must provide the information required under this paragraph in a format approved by the commissioner.\nAn owner is exempt from the requirements of subdivision 4 for a covered property if the property is subject to a benchmarking requirement by the state, a city, or other political subdivision with a benchmarking requirement that the commissioner determines is equivalent or more stringent, as determined under subdivision 11, paragraph (b), than the benchmarking requirement established in this section. The exemption under this subdivision applies in perpetuity unless or until the benchmarking requirement is changed or revoked and the commissioner determines the benchmarking requirement is no longer equivalent nor more stringent.\n(a) An owner must annually benchmark each covered property for the previous calendar year according to the following schedule:\n(1) all Class 1 properties by June 1, 2025, and by every June 1 thereafter; and\n(2) all Class 2 properties by June 1, 2026, and by every June 1 thereafter.\n(b) Beginning June 1, 2025, for Class 1 properties, and June 1, 2026, for Class 2 properties, an owner who is selling a covered property must provide the following to the new owner at the time of sale:\n(1) benchmarking information for the most recent 12-month period, including monthly energy use by source; or\n(2) ownership of the digital property record in the benchmarking tool through an online transfer.\n(a) In implementing this section, a qualifying utility shall only aggregate customer energy use data of covered properties, and on or before January 1, 2025, a qualifying utility shall:\n(1) establish an aggregation standard whereby:\n(i) an aggregated customer energy use data set may include customer energy use data from no fewer than four customers. A single customer's energy use must not constitute more than 50 percent of total energy consumption for the requested data set; and\n(ii) customer energy use data sets containing three or fewer customers or with a single customer's energy use constituting more than 50 percent of total energy consumption may be provided upon the written consent of:\n(A) all customers included in the requested data set, in cases of three or fewer customers; or\n(B) any customer constituting more than 50 percent of total energy consumption for the requested data set; and\n(2) prepare and make available customer energy use data and aggregated customer energy use data upon the request of an owner.\n(b) Customer energy use data that a qualifying utility provides an owner pursuant to this subdivision must be:\n(1) available on, or able to be requested through, an easily navigable web portal or online request form using up-to-date standards for digital authentication;\n(2) provided to the owner within 30 days after receiving the owner's valid written or electronic request;\n(3) provided for at least 24 consecutive months of energy consumption or as many months of consumption data that are available if the owner has owned the building for less than 24 months;\n(4) directly uploaded to the owner's benchmarking tool account, delivered in the spreadsheet template specified by the benchmarking tool, or delivered in another format approved by the commissioner;\n(5) provided to the owner on at least an annual basis until the owner revokes the request for energy use data or sells the covered property; and\n(6) provided in monthly intervals, or the shortest available intervals based in billing.\n(c) Data necessary to establish, utilize, or maintain information in the benchmarking tool under this section may be collected or shared as provided by this section and are considered public data whether or not the data have been aggregated.\n(d) Notwithstanding any other provision of law, a qualifying utility shall not aggregate or anonymize customer energy use data of any customer exempted by the commissioner under section 216B.241 from contributing to investments and expenditures made by a qualifying utility under an energy and conservation optimization plan, unless the customer provides written consent to the qualifying utility.\n(e) Except as provided in paragraph (d), qualifying utilities may aggregate the customer energy use data of properties with a total floor area of less than 50,000 square feet if the property otherwise meets the definition of a covered property.\n(a) The commissioner must:\n(1) collect benchmarking information generated by a benchmarking tool and other related information for each covered property;\n(2) provide technical assistance to owners entering data into a benchmarking tool;\n(3) collaborate with the Department of Revenue to collect the data necessary for establishing the covered property list annually; and\n(4) provide technical guidance to utilities in the establishment of data aggregation and access tools.\n(b) Upon request of the commissioner, a county assessor shall provide by January 15 annually readily available property data necessary for the development of the covered property list, including but not limited to gross floor area, property type, and owner information.\n(c) The commissioner must:\n(1) rank benchmarked covered properties in each property class from highest to lowest performance score or, if a performance score is unavailable for a covered property, from lowest to highest energy use intensity;\n(2) divide covered properties in each property class into four quartiles based on the applicable measure in clause (1);\n(3) assign four stars to each covered property in the quartile of each property class with the highest performance scores or lowest energy use intensities, as applicable;\n(4) assign three stars to each covered property in the quartile of each property class with the second highest performance scores or second lowest energy use intensities, as applicable;\n(5) assign two stars to each covered property in the quartile of each property class with the third highest performance scores or third lowest energy use intensities, as applicable;\n(6) assign one star to each covered property in the quartile of each property class with the lowest performance scores or highest energy use intensities, as applicable; and\n(7) serve notice in writing to each owner identifying the number of stars assigned by the commissioner to each of the owner's covered properties.\n(a) The commissioner must post on the department's website and update by December 1 annually the following information for the previous calendar year:\n(1) annual summary statistics on energy use for all covered properties;\n(2) annual summary statistics on energy use for all covered properties, aggregated by covered property class, as defined in subdivision 3, city, and county;\n(3) the percentage of covered properties in each building class listed in subdivision 3 that are in compliance with the benchmarking requirements under subdivisions 4 to 7; and\n(4) for each covered property, at a minimum, the address, the total energy use, energy use intensity, annual greenhouse gas emissions, and an energy performance score, if available.\n(b) The commissioner must post the information required under this subdivision for:\n(1) all Class 1 properties by December 1, 2025, and by every December 1 thereafter; and\n(2) all Class 2 properties by December 1, 2026, and by every December 1 thereafter.\n(a) The commissioner shall coordinate with any state agency or local government that implements an energy benchmarking program, including with respect to reporting requirements.\n(b) This section does not restrict a local government from adopting or implementing an ordinance or resolution that imposes more stringent benchmarking requirements. For purposes of this section, a local government benchmarking program is more stringent if the program requires:\n(1) buildings to be benchmarked that are not required to be benchmarked under this section; or\n(2) benchmarking of information that is not required to be benchmarked under this section.\n(c) Benchmarking program requirements of local governments must:\n(1) be at least as comprehensive in scope and application as the program operated under this section; and\n(2) include annual enforcement of a penalty on covered properties that do not comply with the local government's benchmarking ordinance.\n(d) Local governments must notify the commissioner of the local government's existing benchmarking ordinance requirements and of new, changed, or revoked ordinance requirements that would apply to the benchmarking schedule for the following year.\n(e) The commissioner must make available to local governments upon request all benchmarking data for covered properties within the local government's jurisdiction annually by December 1.\nThe commissioner must provide disclosure materials for public display within a building to building owners, so that owners can prominently display the performance of the building. The materials must include the number of stars assigned to the building by the commissioner under subdivision 9, paragraph (c), and a relevant explanation of the rating.\nBy March 1 each year, the commissioner must notify the owner of each covered property required to benchmark for the previous calendar year of the requirement to benchmark by June 1 of the current year.\nThe commissioner may contract with an independent third party to implement any or all of the commissioner's duties required under this section. The commissioner must assist owners to increase energy efficiency and reduce greenhouse gas emissions from the owners' covered properties, including by providing outreach, training, and technical assistance to owners to help owners' covered properties comply with the benchmarking program.\n(a) An energy benchmarking program account is established as a separate account in the special revenue fund in the state treasury. The commissioner shall credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money in the account at the end of a fiscal year does not cancel to the general fund but remains available in the account until expended. The commissioner shall manage the account.\n(b) Money in the account is appropriated to the commissioner to pay the reasonable costs of the department to administer this section.\nBy June 15 each year, the commissioner must notify the owner of each covered property that has failed to comply with this section that the owner has until July 15 to bring the covered property into compliance, unless the owner requests and receives an extension until August 15. If an owner fails to comply with the requirements of this section by July 15 and fails to request an extension by that date, or is given an extension and fails to comply by August 15, the commissioner may impose a civil fine of $1,000 on the owner. The commissioner may by rule increase the civil fine to adjust for inflation.\n[See Note.]\nThe commission shall allow a public utility to recover reasonable and prudent expenses of implementing this section under section 216B.16, subdivision 6b. The costs and benefits associated with implementing this section may, at the discretion of the utility, be excluded from the calculation of net economic benefits for purposes of calculating the financial incentive to the public utility under section 216B.16, subdivision 6c. The energy and demand savings may, at the discretion of the public utility, be applied toward the calculation of overall portfolio energy and demand savings for purposes of determining progress toward annual goals under section 216B.241, subdivision 1c, and in the financial incentive mechanism under section 216B.16, subdivision 6c.",
	"repealed": false
}