{
	"id": "60A.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.092",
	"title": "60A.092 REINSURANCE CREDIT ALLOWED A DOMESTIC CEDING INSURER.",
	"text": "Credit for reinsurance shall be allowed a domestic ceding insurer as either an asset or a deduction from liability on account of reinsurance ceded only when the reinsurance is ceded to an assuming insurer which meets the requirements specified under this section.\nReinsurance is ceded to an assuming insurer if the assuming insurer is licensed to transact insurance or reinsurance in this state. For purposes of reinsuring any health risk, an insurer is defined under section 62A.63.\nReinsurance is ceded to an assuming insurer if the assuming insurer is accredited by the commissioner as a reinsurer in this state. In order to be eligible for accreditation, a reinsurer must:\n(1) file with the commissioner evidence of its submission to this state's jurisdiction;\n(2) submit to this state's authority to examine its books and records;\n(3) be licensed to transact insurance or reinsurance in at least one state, or in the case of a United States branch of an alien assuming insurer is entered through and licensed to transact insurance or reinsurance in at least one state;\n(4) file annually with the commissioner a copy of its annual statement filed with the insurance department of its state of domicile, a copy of its most recent audited financial statement, and a filing fee of $225; and\n(5)(i) demonstrate to the satisfaction of the commissioner that it has adequate financial capacity to meet its reinsurance obligations and is otherwise qualified to assume reinsurance from domestic insurers. An assuming insurer meets this requirement at the time of its application if it maintains a surplus as regards to policyholders in an amount not less than $20,000,000 and its accreditation has not been denied by the commissioner within 90 days after submission of its application; or\n(ii) maintains a surplus as regards policyholders in an amount not less than $50,000,000 for long-tail casualty reinsurers. For purposes of this section, \"long-tail casualty reinsurance\" means insurance for medical or legal malpractice, pollution liability, directors and officers liability, and products liability. The commissioner may determine that an assuming insurer that maintains a surplus as regards policyholders in an amount not less than $20,000,000 is accredited as a reinsurer if there is no detriment to policyholders and the interest of the public, and to not allow accrediting would be a hardship or detriment to the reinsurer. The commissioner shall report to the legislature on any determination to allow accrediting to a long-term casualty reinsurer maintaining a surplus in an amount less than $50,000,000.\nClause (5) does not apply to reinsurance ceded and assumed pursuant to pooling arrangements among insurers in the same holding company system.\nReinsurance is ceded to an assuming insurer if the assuming insurer is domiciled and licensed in, or in the case of a United States branch of an alien assuming insurer is entered through, a state which employs standards regarding credit for reinsurance substantially similar to those applicable under this chapter and the assuming insurer or United States branch of an alien assuming insurer (1) maintains a surplus as regards policyholders in an amount not less than $20,000,000 or maintains a surplus as regards policyholders in an amount not less than $50,000,000 for long-tail casualty reinsurers as provided under subdivision 3, clause (5), and (2) submits to the authority of this state to examine its books and records.\nClause (1) does not apply to reinsurance ceded and assumed pursuant to pooling arrangements among insurers in the same holding company system.\nThe reinsurance is ceded to an assuming insurer if the assuming insurer maintains a trust fund in a qualified United States financial institution for the payment of the valid claims, as determined by the commissioner for the purpose of determining the sufficiency of the trust fund, of its United States policyholders and ceding insurers, their assigns and successors in interest. The assuming insurer shall report annually to the commissioner information substantially the same as that required to be reported on the National Association of Insurance Commissioners annual statement form by licensed insurers to enable the commissioner to determine the sufficiency of the trust fund.\n(a) In the case of a single assuming insurer, the trust shall consist of a trusteed account representing the assuming insurer's liabilities attributable to business written in the United States and, in addition, a trusteed surplus of not less than $20,000,000 or an additional amount as the commissioner considers necessary, except as provided in paragraph (b). The assuming insurer shall maintain its surplus as regards policyholders in an amount not less than $50,000,000 for long-tail casualty reinsurers as provided under subdivision 3, clause (5).\n(b) After the assuming insurer has permanently discontinued underwriting new business secured by the trust for at least three years, the commissioner may authorize a reduction in the required trusteed surplus, but only after a finding, based on an assessment of the risk, that the new required surplus level is adequate for the protection of United States ceding insurers, policyholders, and claimants in light of reasonably foreseeable adverse loss development. The risk assessment may involve an actuarial review, including an independent analysis of reserves and cash flows, and shall consider all material risk factors, including when applicable, the lines of business involved, the stability of the incurred loss estimates, and the effect of the surplus requirements on the assuming insurer's liquidity or solvency. The minimum required trusteed surplus may not be reduced to an amount less than 30 percent of the assuming insurer's liabilities attributable to reinsurance ceded by United States ceding insurers covered by the trust.\nIn the case of a group including incorporated and individual unincorporated underwriters, the trust shall consist of a trusteed account representing the group's liabilities attributable to business written in the United States. The group shall maintain a trusteed surplus of which $100,000,000 shall be held jointly for the benefit of United States ceding insurers of any member of the group. The incorporated members of the group shall not be engaged in any business other than underwriting as a member of the group and must be subject to the same level of solvency regulation and control by the group's domiciliary regulator as are the unincorporated members. The group shall make available to the commissioner an annual certification by the group's domiciliary regulator and its independent public accountants of the solvency of each underwriter.\nA group of incorporated insurers under common administration must:\n(1) comply with the filing requirements specified in subdivision 7;\n(2) be under the supervision of the Department for International Trade of the United Kingdom;\n(3) submit to this state's authority to examine its books and records;\n(4) bear the expense of the examination;\n(5) maintain an aggregate policyholders' surplus of $10,000,000,000;\n(6) maintain the trust in an amount equal to the group's several liabilities attributable to business written in the United States; and\n(7) maintain a joint trusteed surplus of which $100,000,000 must be held jointly for the benefit of United States ceding insurers of any member of the group.\nEach member of the group shall make available to the commissioner an annual certification by the member's domiciliary regulator and its independent accountant of the member's solvency.\n(a) The trust must be established in a form approved by the commissioner of commerce. The trust instrument shall provide that contested claims shall be valid and enforceable upon the final order of any court of competent jurisdiction in the United States. The trust shall vest legal title to its assets in the trustees of the trust for its United States policyholders and ceding insurers, their assigns and successors in interest. The trust and the assuming insurer shall be subject to examination as determined by the commissioner. The trust must remain in effect for as long as the assuming insurer shall have outstanding obligations due under the reinsurance agreements subject to the trust.\n(b) No later than February 28 of each year the trustees of the trust shall report to the commissioner in writing setting forth the balance of the trust and listing the trust's investments at the preceding year end and shall certify the date of termination of the trust, if so planned, or certify that the trust shall not expire prior to the next following December 31.\n(a) Reinsurance is ceded to an assuming insurer if the assuming insurer has been certified by the commissioner as a reinsurer in this state and secures its obligations according to this subdivision.\n(b) To be eligible for certification, the assuming insurer must:\n(1) be domiciled and licensed to transact insurance or reinsurance in a qualified jurisdiction, as determined by the commissioner under paragraph (d);\n(2) maintain minimum capital and surplus, or its equivalent, in an amount to be determined by the commissioner;\n(3) maintain financial strength ratings from two or more rating agencies acceptable to the commissioner;\n(4) agree to submit to the jurisdiction of this state, appoint the commissioner as its agent for service of process in this state, and agree to provide security for 100 percent of the assuming insurer's liabilities attributable to reinsurance ceded by United States ceding insurers if it resists enforcement of a final United States judgment;\n(5) agree to meet filing requirements as determined by the commissioner, both with respect to an initial application for certification and on an ongoing basis; and\n(6) satisfy any other requirements for certification as determined by the commissioner.\n(c) An association, including incorporated and individual unincorporated underwriters, may be a certified reinsurer. In addition to satisfying the requirements of paragraph (b), an association must:\n(1) satisfy its minimum capital and surplus requirements through the capital and surplus equivalents net of liabilities of the association and its members, which includes a joint central fund that may be applied to an unsatisfied obligation of the association or any of its members, in an amount determined by the commissioner to provide adequate protection;\n(2) ensure the incorporated members of the association are not engaged in a business other than underwriting as a member of the association and are subject to the same level of regulation and solvency control by the association's domiciliary regulator as are the unincorporated members; and\n(3) within 90 days after its financial statements are due to be filed with the association's domiciliary regulator, provide to the commissioner an annual certification by the association's domiciliary regulator of the solvency of each underwriter member, or if a certification is unavailable, financial statements, prepared by independent public accountants, of each underwriter member of the association.\n(d) The commissioner shall create and publish a list of qualified jurisdictions under which an assuming insurer licensed and domiciled in the jurisdiction is eligible to be considered by the commissioner to become a certified reinsurer.\n(e) To determine whether the domiciliary jurisdiction of a non-United States assuming insurer is eligible to be recognized as a qualified jurisdiction, the commissioner shall evaluate the appropriateness and effectiveness of the reinsurance supervisory system of the jurisdiction, both initially and on an ongoing basis, and consider the rights, benefits, and extent of reciprocal recognition afforded by the non-United States jurisdiction to reinsurers licensed and domiciled in the United States. A qualified jurisdiction must agree to share information and cooperate with the commissioner with respect to all certified reinsurers domiciled within that jurisdiction. A jurisdiction may not be recognized as a qualified jurisdiction if the commissioner determines that the jurisdiction does not adequately and promptly enforce final United States judgments and arbitration awards. Additional factors may be considered at the discretion of the commissioner.\n(f) A list of qualified jurisdictions must be published through the National Association of Insurance Commissioners (NAIC) committee process. The commissioner shall consider the list in determining qualified jurisdictions. If the commissioner approves a jurisdiction as qualified that does not appear on the list of qualified jurisdictions, the commissioner shall provide thoroughly documented justification.\n(g) United States jurisdictions that meet the requirement for accreditation under the NAIC financial standards and accreditation program must be recognized as qualified jurisdictions.\n(h) If a certified reinsurer's domiciliary jurisdiction ceases to be a qualified jurisdiction, the commissioner may suspend the reinsurer's certification indefinitely, in lieu of revocation.\n(i) The commissioner shall assign a rating to each certified reinsurer, giving due consideration to the financial strength ratings that have been assigned by rating agencies acceptable to the commissioner. The commissioner shall publish a list of all certified reinsurers and their ratings.\n(j) A certified reinsurer covered by paragraphs (k) to (o) shall secure obligations assumed from United States ceding insurers at a level consistent with its rating determined under section 60A.0921, subdivision 1, paragraph (d).\n(k) In order for a domestic ceding insurer to qualify for full financial statement credit for reinsurance ceded to a certified reinsurer, the certified reinsurer must maintain security in a form acceptable to the commissioner and consistent with section 60A.093, or in a multibeneficiary trust according to subdivisions 5 to 9, except as otherwise provided in this subdivision.\n(l) If a certified reinsurer maintains a trust to fully secure its obligations subject to subdivisions 5 to 9, and chooses to secure its obligations incurred as a certified reinsurer in the form of a multibeneficiary trust, the certified reinsurer shall maintain separate trust accounts for its obligations incurred under reinsurance agreements issued or renewed as a certified reinsurer with reduced security as permitted by this subdivision or comparable laws of other United States jurisdictions and for its obligations subject to subdivisions 5 to 9. It is a condition to the grant of certification under this subdivision that the certified reinsurer shall have bound itself, by the language of the trust and agreement with the commissioner, to fund, upon termination of a trust account, any deficiency of any other trust account out of the remaining surplus of each trust.\n(m) The minimum trusteed surplus requirements provided in subdivisions 5 to 9 are not applicable with respect to a multibeneficiary trust maintained by a certified reinsurer for the purpose of securing obligations incurred under this subdivision, except that the trust shall maintain a minimum trusteed surplus of $10,000,000.\n(n) With respect to obligations incurred by a certified reinsurer under this subdivision, if the security is insufficient, the commissioner shall reduce the allowable credit by an amount proportionate to the deficiency. The commissioner may impose further reductions in allowable credit upon finding that there is a material risk that the certified reinsurer's obligations will not be paid in full when due.\n(o) For purposes of this subdivision, a certified reinsurer whose certification has been terminated for any reason must be treated as a certified reinsurer required to secure 100 percent of its obligations. As used in this subdivision, \"terminated\" means revocation, suspension, voluntary surrender, or inactive status. If the commissioner continues to assign a higher rating as permitted by other provisions of this section, the requirements of this paragraph do not apply to a certified reinsurer in inactive status or to a reinsurer whose certification has been suspended.\n(p) If an applicant for certification has been certified as a reinsurer in an NAIC-accredited jurisdiction, the commissioner may defer to that jurisdiction's certification and the rating assigned by that jurisdiction. The assuming insurer is considered to be a certified reinsurer in this state.\n(q) A certified reinsurer that ceases to assume new business in this state may request to maintain its certification in inactive status in order to continue to qualify for a reduction in security for its in-force business. An inactive certified reinsurer shall continue to comply with this subdivision, and the commissioner shall assign a rating that takes into account, if relevant, the reasons why the reinsurer is not assuming new business.\n(r) Credit for reinsurance under this section applies only to a reinsurance contract entered into or renewed on or after the effective date of the certification of the assuming insurer.\nThe reinsurance is ceded and credit allowed to an assuming insurer not meeting the requirements of subdivision 2, 3, 4, 5, 10, or 10b, but only with respect to the insurance of risks located in jurisdictions where the reinsurance is required by applicable law or regulation of that jurisdiction.\n(a) Credit shall be allowed when the reinsurance is ceded to an assuming insurer meeting each of the following conditions:\n(1) the assuming insurer must have its head office in or be domiciled in, as applicable, and be licensed in a reciprocal jurisdiction. A \"reciprocal jurisdiction\" means a jurisdiction that is:\n(i) a non-United States jurisdiction that is subject to an in-force covered agreement with the United States, each within its legal authority, or, in the case of a covered agreement between the United States and the European Union, is a member state of the European Union. For purposes of this subdivision, a \"covered agreement\" means an agreement entered into pursuant to the Dodd-Frank Wall Street Reform and Consumer Protection Act, United States Code, title 31, sections 313 and 314, that is currently in effect or in a period of provisional application and addresses the elimination, under specified conditions, of collateral requirements as a condition for entering into any reinsurance agreement with a ceding insurer domiciled in Minnesota or for allowing the ceding insurer to recognize credit for reinsurance;\n(ii) a United States jurisdiction that meets the requirements for accreditation under the National Association of Insurance Commissioners (NAIC) financial standards and accreditation program; or\n(iii) a qualified jurisdiction, as determined by the commissioner, which is not otherwise described in item (i) or (ii) and which meets the following additional requirements, consistent with the terms and conditions of in-force covered agreements:\n(A) provides that an insurer which has its head office or is domiciled in such qualified jurisdiction shall receive credit for reinsurance ceded to a United States-domiciled assuming insurer in the same manner as credit for reinsurance is received for reinsurance assumed by insurers domiciled in such qualified jurisdiction;\n(B) does not require a United States-domiciled assuming insurer to establish or maintain a local presence as a condition for entering into a reinsurance agreement with any ceding insurer subject to regulation by the non-United States jurisdiction or as a condition to allow the ceding insurer to recognize credit for such reinsurance;\n(C) recognizes the United States state regulatory approach to group supervision and group capital, by providing written confirmation by a competent regulatory authority, in such qualified jurisdiction, that insurers and insurance groups that are domiciled or maintain their headquarters in this state or another jurisdiction accredited by the NAIC shall be subject only to worldwide prudential insurance group supervision including worldwide group governance, solvency and capital, and reporting, as applicable, by the commissioner or the commissioner of the domiciliary state and will not be subject to group supervision at the level of the worldwide parent undertaking of the insurance or reinsurance group by the qualified jurisdiction; and\n(D) provides written confirmation by a competent regulatory authority in such qualified jurisdiction that information regarding insurers and their parent, subsidiary, or affiliated entities, if applicable, shall be provided to the commissioner in accordance with a memorandum of understanding or similar document between the commissioner and such qualified jurisdiction, including but not limited to the International Association of Insurance Supervisors Multilateral Memorandum of Understanding or other multilateral memoranda of understanding coordinated by the NAIC;\n(2) the assuming insurer must have and maintain, on an ongoing basis, minimum capital and surplus, or its equivalent, calculated according to the methodology of its domiciliary jurisdiction, on at least an annual basis as of the preceding December 31 or on the date otherwise statutorily reported to the reciprocal jurisdiction, in the following amounts:\n(i) no less than $250,000,000; or\n(ii) if the assuming insurer is an association, including incorporated and individual unincorporated underwriters:\n(A) minimum capital and surplus equivalents, net of liabilities, or own funds of the equivalent of at least $250,000,000; and\n(B) a central fund containing a balance of the equivalent of at least $250,000,000;\n(3) the assuming insurer must have and maintain, on an ongoing basis, a minimum solvency or capital ratio, as applicable, as follows:\n(i) if the assuming insurer has its head office or is domiciled in a reciprocal jurisdiction defined in clause (1), item (i), the ratio specified in the applicable covered agreement;\n(ii) if the assuming insurer is domiciled in a reciprocal jurisdiction defined in clause (1), item (ii), a risk-based capital ratio of 300 percent of the authorized control level, calculated in accordance with the formula developed by the NAIC; or\n(iii) if the assuming insurer is domiciled in a Reciprocal Jurisdiction defined in clause (1), item (iii), after consultation with the reciprocal jurisdiction and considering any recommendations published through the NAIC Committee Process, such solvency or capital ratio as the commissioner determines to be an effective measure of solvency;\n(4) the assuming insurer must agree and provide adequate assurance in the form of a properly executed Form RJ-1 of its agreement to the following:\n(i) the assuming insurer must provide prompt written notice and explanation to the commissioner if it falls below the minimum requirements set forth in clause (2) or (3), or if any regulatory action is taken against the assuming insurer for serious noncompliance with applicable law;\n(ii) the assuming insurer must consent in writing to the jurisdiction of the courts of Minnesota and to the appointment of the commissioner as agent for service of process. The commissioner may require that consent for service of process be provided to the commissioner and included in each reinsurance agreement. Nothing in this subdivision shall limit or in any way alter the capacity of parties to a reinsurance agreement to agree to alternative dispute resolution mechanisms, except to the extent such agreements are unenforceable under applicable insolvency or delinquency laws;\n(iii) the assuming insurer must consent in writing to pay all final judgments, wherever enforcement is sought, obtained by a ceding insurer or its legal successor, that have been declared enforceable in the jurisdiction where the judgment was obtained;\n(iv) each reinsurance agreement must include a provision requiring the assuming insurer to provide security in an amount equal to 100 percent of the assuming insurer's liabilities attributable to reinsurance ceded pursuant to that agreement if the assuming insurer resists enforcement of a final judgment that is enforceable under the law of the jurisdiction in which it was obtained or a properly enforceable arbitration award, whether obtained by the ceding insurer or by its legal successor on behalf of its resolution estate;\n(v) the assuming insurer must confirm that it is not presently participating in any solvent scheme of arrangement which involves this state's ceding insurers, and agree to notify the ceding insurer and the commissioner and to provide security in an amount equal to 100 percent of the assuming insurer's liabilities to the ceding insurer, should the assuming insurer enter into such a solvent scheme of arrangement. The security shall be in a form consistent with sections 60A.092, subdivision 10, 60A.093, 60A.096, and 60A.097. For purposes of this section, the term \"solvent scheme of arrangement\" means a foreign or alien statutory or regulatory compromise procedure subject to requisite majority creditor approval and judicial sanction in the assuming insurer's home jurisdiction either to finally commute liabilities of duly noticed classed members or creditors of a solvent debtor, or to reorganize or restructure the debts and obligations of a solvent debtor on a final basis, and which may be subject to judicial recognition and enforcement of the arrangement by a governing authority outside the ceding insurer's home jurisdiction; and\n(vi) the assuming insurer must agree in writing to meet the applicable information filing requirements set forth in clause (5);\n(5) the assuming insurer or its legal successor must provide, if requested by the commissioner, on behalf of itself and any legal predecessors, the following documentation to the commissioner:\n(i) for the two years preceding entry into the reinsurance agreement and on an annual basis thereafter, the assuming insurer's annual audited financial statements, in accordance with the applicable law of the jurisdiction of its head office or domiciliary jurisdiction, as applicable, including the external audit report;\n(ii) for the two years preceding entry into the reinsurance agreement, the solvency and financial condition report or actuarial opinion, if filed with the assuming insurer's supervisor;\n(iii) prior to entry into the reinsurance agreement and not more than semiannually thereafter, an updated list of all disputed and overdue reinsurance claims outstanding for 90 days or more, regarding reinsurance assumed from ceding insurers domiciled in the United States; and\n(iv) prior to entry into the reinsurance agreement and not more than semiannually thereafter, information regarding the assuming insurer's assumed reinsurance by ceding insurer, ceded reinsurance by the assuming insurer, and reinsurance recoverable on paid and unpaid losses by the assuming insurer to allow for the evaluation of the criteria set forth in clause (6);\n(6) the assuming insurer must maintain a practice of prompt payment of claims under reinsurance agreements. The lack of prompt payment will be evidenced if any of the following criteria is met:\n(i) more than 15 percent of the reinsurance recoverables from the assuming insurer are overdue and in dispute as reported to the commissioner;\n(ii) more than 15 percent of the assuming insurer's ceding insurers or reinsurers have overdue reinsurance recoverable on paid losses of 90 days or more which are not in dispute and which exceed for each ceding insurer $100,000, or as otherwise specified in a covered agreement; or\n(iii) the aggregate amount of reinsurance recoverable on paid losses which are not in dispute, but are overdue by 90 days or more, exceeds $50,000,000, or as otherwise specified in a covered agreement;\n(7) the assuming insurer's supervisory authority must confirm to the commissioner by December 31, 2021, and annually thereafter, or at the annual date otherwise statutorily reported to the reciprocal jurisdiction, that the assuming insurer complies with the requirements set forth in clauses (2) and (3); and\n(8) nothing in this subdivision precludes an assuming insurer from providing the commissioner with information on a voluntary basis.\n(b) The commissioner shall timely create and publish a list of reciprocal jurisdictions. The commissioner's list shall include any reciprocal jurisdiction as defined under paragraph (a), clause (1), items (i) and (ii), and shall consider any other reciprocal jurisdiction included on the NAIC list. The commissioner may approve a jurisdiction that does not appear on the NAIC list of reciprocal jurisdictions in accordance with criteria developed under rules issued by the commissioner. The commissioner may remove a jurisdiction from the list of reciprocal jurisdictions upon a determination that the jurisdiction no longer meets the requirements of a reciprocal jurisdiction, in accordance with a process set forth in rules issued by the commissioner, except that the commissioner shall not remove from the list a reciprocal jurisdiction as defined under paragraph (a), clause (1), items (i) and (ii). Upon removal of a reciprocal jurisdiction from the list, credit for reinsurance ceded to an assuming insurer which has its home office or is domiciled in that jurisdiction shall be allowed, if otherwise allowed pursuant to law.\n(c) The commissioner shall timely create and publish a list of assuming insurers that have satisfied the conditions set forth in this subdivision and to which cessions shall be granted credit in accordance with this subdivision. The commissioner may add an assuming insurer to the list if an NAIC accredited jurisdiction has added the assuming insurer to a list of assuming insurers or if, upon initial eligibility, the assuming insurer submits the information to the commissioner as required under paragraph (a), clause (4), and complies with any additional requirements that the commissioner may impose by rule, except to the extent that they conflict with an applicable covered agreement.\n(i) If an NAIC-accredited jurisdiction has determined that the conditions set forth in paragraph (a), clause (2), have been met, the commissioner has the discretion to defer to that jurisdiction's determination, and add such assuming insurer to the list of assuming insurers to which cessions shall be granted credit in accordance with this paragraph. The commissioner may accept financial documentation filed with another NAIC-accredited jurisdiction or with the NAIC in satisfaction of the requirements of paragraph (a), clause (2);\n(ii) When requesting that the commissioner defer to another NAIC-accredited jurisdiction's determination, an assuming insurer must submit a properly executed Form RJ-1 and additional information as the commissioner may require. A state that has received such a request will notify other states through the NAIC Committee Process and provide relevant information with respect to the determination of eligibility.\n(d) If the commissioner determines that an assuming insurer no longer meets one or more of the requirements under this subdivision, the commissioner may revoke or suspend the eligibility of the assuming insurer for recognition under this subdivision in accordance with procedures set forth in rule. While an assuming insurer's eligibility is suspended, no reinsurance agreement issued, amended, or renewed after the effective date of the suspension qualifies for credit, except to the extent that the assuming insurer's obligations under the contract are secured in accordance with this section. If an assuming insurer's eligibility is revoked, no credit for reinsurance may be granted after the effective date of the revocation with respect to any reinsurance agreements entered into by the assuming insurer, including reinsurance agreements entered into prior to the date of revocation, except to the extent that the assuming insurer's obligations under the contract are secured in a form acceptable to the commissioner and consistent with the provisions of this section.\n(e) Before denying statement credit or imposing a requirement to post security with respect to paragraph (d) or adopting any similar requirement that will have substantially the same regulatory impact as security, the commissioner shall:\n(1) communicate with the ceding insurer, the assuming insurer, and the assuming insurer's supervisory authority that the assuming insurer no longer satisfies one of the conditions listed in paragraph (a), clause (2);\n(2) provide the assuming insurer with 30 days from the initial communication to submit a plan to remedy the defect, and 90 days from the initial communication to remedy the defect, except in exceptional circumstances in which a shorter period is necessary for policyholder and other consumer protection;\n(3) after the expiration of 90 days or less, as set out in clause (2), if the commissioner determines that no or insufficient action was taken by the assuming insurer, the commissioner may impose any of the requirements as set out in this paragraph; and\n(4) provide a written explanation to the assuming insurer of any of the requirements set out in this paragraph.\n(f) If subject to a legal process of rehabilitation, liquidation, or conservation, as applicable, the ceding insurer, or its representative, may seek and, if determined appropriate by the court in which the proceedings are pending, may obtain an order requiring that the assuming insurer post security for all outstanding ceded liabilities.\n(g) Nothing in this subdivision limits or in any way alters the capacity of parties to a reinsurance agreement to agree on requirements for security or other terms in the reinsurance agreement, except as expressly prohibited by applicable law or rule.\n(h) Credit may be taken under this subdivision only for reinsurance agreements entered into, amended, or renewed on or after January 1, 2022, and only with respect to losses incurred and reserves reported on or after the later of: (1) the date on which the assuming insurer has met all eligibility requirements pursuant to this subdivision; and (2) the effective date of the new reinsurance agreement, amendment, or renewal. This paragraph does not alter or impair a ceding insurer's right to take credit for reinsurance, to the extent that credit is not available under this subdivision, as long as the reinsurance qualifies for credit under any other applicable provision of law. Nothing in this subdivision shall authorize an assuming insurer to withdraw or reduce the security provided under any reinsurance agreement, except as permitted by the terms of the agreement. Nothing in this subdivision shall limit, or in any way alter, the capacity of parties to any reinsurance agreement to renegotiate the agreement.\n(a) If the assuming insurer is not licensed, certified, or accredited to transact insurance or reinsurance in this state, the credit authorized under subdivisions 4 to 9 shall not be allowed unless the assuming insurer agrees in the reinsurance agreements:\n(1) that in the event of the failure of the assuming insurer to perform its obligations under the terms of the reinsurance agreement, the assuming insurer shall submit to the jurisdiction of any court of competent jurisdiction in any state of the United States, comply with all requirements necessary to give the court jurisdiction, and abide by the final decision of the court or of any appellate court in the event of an appeal;\n(2) to designate the commissioner or a designated attorney as its true and lawful attorney upon whom may be served any lawful process in any action, suit, or proceeding instituted by or on behalf of the ceding insurer; and\n(3) that the credit risk for an intermediary is carried by the assuming insurer.\n(b) Paragraph (a) is not intended to conflict with or override the obligation of the parties to a reinsurance agreement to arbitrate their disputes, if an obligation to do so is created in the agreement.\n(c) Credit will not be granted, nor an asset or a reduction from liability allowed, to a ceding insurer for reinsurance effected with assuming insurers meeting the requirements of subdivision 2, 3, 4, 5, 6, 7, or 10, unless the reinsurance contract provides that in the event of the insolvency of the ceding insurer, the reinsurance will be payable under the contract without diminution because of that insolvency.\nPayments by the reinsurer must be made directly to its receiver or successor, except where the contract of insurance or reinsurance specifically provides for another payee for the reinsurance in the event of insolvency of the ceding insurer according to the applicable requirements of statutes, rules, or orders of the domiciliary state of the ceding insurer.\n(a) A ceding insurer shall take steps to manage its reinsurance recoverables proportionate to its own book of business. A domestic ceding insurer shall notify the commissioner within 30 days after reinsurance recoverables from a single assuming insurer, or group of affiliated assuming insurers, exceeds 50 percent of the domestic ceding insurer's last reported surplus to policyholders, or after it is determined that reinsurance recoverables from a single assuming insurer, or group of affiliated assuming insurers, is likely to exceed this limit. The notification must demonstrate that the exposure is safely managed by the domestic ceding insurer.\n(b) A ceding insurer shall take steps to diversify its reinsurance program. A domestic ceding insurer shall notify the commissioner within 30 days after ceding to any single assuming insurer, or group of affiliated assuming insurers, more than 20 percent of the ceding insurer's gross written premium in the prior calendar year, or after it has determined that the reinsurance ceded to any single assuming insurer, or group of affiliated assuming insurers, is likely to exceed this limit. The notification must demonstrate that the exposure is safely managed by the domestic ceding insurer.\n(a) If an accredited or certified reinsurer ceases to meet the requirements for accreditation or certification, the commissioner may suspend or revoke the reinsurer's accreditation or certification.\n(b) The commissioner must give the reinsurer notice and opportunity for hearing. The suspension or revocation may not take effect until after the commissioner's order on hearing, unless:\n(1) the reinsurer waives its right to a hearing;\n(2) the commissioner's order is based on regulatory action by the reinsurer's domiciliary jurisdiction or the voluntary surrender or termination of the reinsurer's eligibility to transact insurance or reinsurance business in its domiciliary jurisdiction or in the primary certifying state of the reinsurer under subdivision 10, paragraph (p); or\n(3) the commissioner finds that an emergency requires immediate action and a court of competent jurisdiction has not stayed the commissioner's action.\n(c) While a reinsurer's accreditation or certification is suspended, no reinsurance contract issued or renewed after the effective date of the suspension qualifies for credit, except to the extent that the reinsurer's obligations under the contract are secured in accordance with section 60A.093. If a reinsurer's accreditation or certification is revoked, no credit for reinsurance may be granted after the effective date of the revocation, except to the extent that the reinsurer's obligations under the contract are secured in accordance with subdivision 10, paragraphs (j) to (o), or section 60A.093.",
	"repealed": false
}