{
	"id": "325D.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.33",
	"title": "325D.33 SALES AT LESS THAN COST; PENALTY.",
	"text": "It shall be unlawful for any wholesaler or retailer to offer to sell, or sell, at wholesale or retail, cigarettes at less than cost to such wholesaler or retailer, as the case may be, as defined in sections 325D.30 to 325D.42 for the purpose or with the effect of injuring a competitor or destroying competition, or for a retailer to induce or to attempt to induce a wholesaler to violate the provisions of the Minnesota Unfair Cigarette Sales Act. Any wholesaler or retailer who violates the provisions of this section shall be guilty of a misdemeanor.\nEvidence of advertisement, offering to sell, or sale of cigarettes by any wholesaler or retailer at less than cost as defined by sections 325D.30 to 325D.42 shall be prima facie evidence of a violation of sections 325D.30 to 325D.42 in civil cases.\n\"Commissioner\" means the commissioner of commerce or the commissioner's designated representative.\nIt is unlawful for a wholesaler to offer a rebate in price, to give a rebate in price, to offer a concession of any kind, or to give a concession of any kind in connection with the sale of cigarettes. For purposes of this chapter, the term \"discount\" is included in the definition of a rebate. For purposes of this subdivision, the term \"wholesaler\" does not include a manufacturer or manufacturer's representative.\nEvery person who sells cigarettes to persons other than the ultimate consumer shall prepare for each sale itemized invoices showing the seller's name and address, the purchaser's name and address, the date of sale, and all prices and shall keep legible copies of them for one year from the date of sale.\n[Repealed, 1Sp2001 c 5 art 20 s 24]\nIf the commissioner determines that a distributor is violating any provision of this chapter, the commissioner must give the distributor a written warning explaining the violation and an explanation of what must be done to comply with this chapter. Within ten days of issuance of the warning, the distributor must notify the commissioner that the distributor has complied with the commissioner's recommendation or request that the commissioner set the issue for a hearing pursuant to chapter 14. If a hearing is requested, the hearing shall be scheduled within 20 days of the request and the recommendation of the administrative law judge shall be issued within five working days of the close of the hearing. The commissioner's final determination shall be issued within five working days of the receipt of the administrative law judge's recommendation. If the commissioner's final determination is adverse to the distributor and the distributor does not comply within ten days of receipt of the commissioner's final determination, the commissioner may order the distributor to immediately cease the stamping of cigarettes. As soon as practicable after the order, the commissioner must remove the meter and any unapplied cigarette stamps from the premises of the distributor.\nIf within ten days of issuance of the written warning the distributor has not complied with the commissioner's recommendation or requested a hearing, the commissioner may order the distributor to immediately cease the stamping of cigarettes and remove the meter and unapplied stamps from the distributor's premises.\n[Repealed, 1993 c 375 art 17 s 27]\n(a) A retailer who sells cigarettes for less than a legal retail price may be assessed a penalty in the full amount of three times the difference between the actual selling price and a legal price under sections 325D.30 to 325D.42. This penalty may be collected by the commissioner under the authorities given the commissioner of revenue in chapter 270C, and the penalty shall bear interest at the rate prescribed by section 270C.40, subdivision 5.\n(b) A wholesaler who sells cigarettes for less than a legal price may be assessed a penalty in the full amount of three times the difference between the actual selling price and the legal price under sections 325D.30 to 325D.42. This penalty may be collected by the commissioner under the authorities given the commissioner of revenue in chapter 270C, and the penalty shall bear interest at the rate prescribed by section 270C.40, subdivision 5.\n(c) A retailer who engages in a plan, scheme, or device with a wholesaler to purchase cigarettes at a price which the retailer knows to be less than a legal price may be assessed a penalty in the full amount of three times the difference between the actual purchase price and the legal price under sections 325D.30 to 325D.42. A retailer that coerces or requires a wholesaler to sell cigarettes at a price which the retailer knows to be less than a legal price may be assessed a penalty in the full amount of three times the difference between the actual purchase price and the legal price. These penalties may be collected by the commissioner under the authorities given the commissioner of revenue in chapter 270C, and the penalties shall bear interest at the rate prescribed by section 270C.40, subdivision 5.\nFor purposes of this subdivision, a retailer is presumed to know that a purchase price is less than a legal price if any of the following have been done:\n(1) the commissioner has published the legal price in the Minnesota State Register;\n(2) the commissioner has provided written notice to the retailer of the legal price;\n(3) the commissioner has provided written notice to the retailer that the retailer is purchasing cigarettes for less than a legal price;\n(4) the commissioner has issued a written order to the retailer to cease and desist from purchases of cigarettes for less than a legal price; or\n(5) there is evidence that the retailer has knowledge of, or has participated in, efforts to disguise or misrepresent the actual purchase price as equal to or more than a legal price, when it is actually less than a legal price.\nIn any proceeding arising under this subdivision, the commissioner shall have the burden of providing by a reasonable preponderance of the evidence that the facts necessary to establish the presumption set forth in this section exist, or that the retailer had knowledge that a purchase price was less than the legal price.\n(d) The commissioner may not assess penalties against any wholesaler, retailer, or combination of wholesaler and retailer, which are greater than three times the difference between the actual price and the legal price under sections 325D.30 to 325D.42.",
	"repealed": false
}