{
	"id": "507.328",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.328",
	"title": "507.328 MORTGAGES AND DEEDS OF TRUST OF PIPELINE COMPANIES; FILING AND RECORDING.",
	"text": "A mortgage or deed of trust to secure a debt executed by a pipeline company engaged in the business of transporting oil, gas, petroleum products, or other commodities that may be transported by pipeline, other than a \"public utility\" as defined in Minnesota Statutes 1982, section 300.111, covering the whole or any part of its easements or other less than fee simple interests in real estate used in the transportation or distribution of oil, gas, petroleum products, or other commodities that may be transported by pipeline, and also covering the fixtures of the pipeline company which are annexed to the pipeline must be filed in the Office of the Secretary of State along with or as a part of the financing statement covering the fixtures. The filing of the mortgage or deed of trust shall have the same effect, and shall be notice of the rights and interests of the mortgagee or trustee in the easements and other less than fee simple interests in real estate to the same extent as if the mortgage or deed of trust were duly recorded in the office of the county recorder, or duly registered in the office of the registrar of titles of the county or counties in which the real estate is situated. The mortgages or deeds of trust may by their terms include after-acquired property, real and personal, and shall be as valid and effectual for that purpose as if the after-acquired property were owned by, and in possession of, the company giving the mortgage and deed of trust at the time of the execution. Notwithstanding the Uniform Commercial Code the filing and recording of the mortgage and deed of trust in the office of the secretary of state shall be notice of the rights of all parties in the real and personal property and fixtures covered by the filing and will so remain until satisfied or discharged without further affidavit, continuation statement, or proceeding.\nFor the purposes of this section, any mortgage or deed of trust filed under this section shall be deemed to contain a sufficient description to give notice of the rights and interest of the mortgagee or trustee in the easements and other less than fee simple interests in the real estate used for the transmission of oil, gas, petroleum products, or other commodities which may be transported by pipeline if the mortgage and deed of trust states that the security includes rights-of-way, transmission systems, or lines of the pipeline company, or all property owned by the pipeline company.\nThis section shall not apply to any real estate owned by a pipeline company in fee simple.",
	"repealed": false
}