{
	"id": "103E.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.091",
	"title": "103E.091 APPEALS.",
	"text": "A party may appeal to the district court from a recorded order of a drainage authority made in a drainage proceeding that determines:\n(1) the amount of benefits;\n(2) the amount of damages;\n(3) fees or expenses allowed; or\n(4) whether the environmental, land use, and multipurpose water management requirements and criteria of section 103E.015, subdivision 1, are met.\n(a) A person who appeals the amount of benefits or damages may include benefits and damages affecting property not owned by the appellant. Notice of the appeal must be served to the auditor and to the owner or occupant of property included in the appeal or to the attorney representing the property owner in the proceedings.\n(b) The appellant must file a notice of appeal with the auditor within 30 days after the order to be appealed is filed. The notice must state the particular benefits or damages appealed and the basis for the appeal. Within 30 days after the notice is filed, the auditor must file the original notice with the court administrator of the district court.\nAn appeal related to the allowance of fees or expenses may be to the district court of any county where the affected property is located. The appeal must be made within 30 days after the order allowing or disallowing the claim and is governed as applicable by the provisions of subdivision 4.\n(a) The issues in the appeal are entitled to a trial by a jury in the district court of the county where the drainage proceeding was pending.\n(b) At the request of the appellant, the trial must be held at the district court of the county where the affected property is located. The court administrator of the district court where the appeal is first filed shall make, certify, and file with the court administrator of the district court of the county where the trial is transferred, a transcript of the papers and documents on file in the court administrator's office in the proceedings related to the matters of the appeal. After the final determination of the appeal, the court administrator of the district court that tried the appeal shall certify and return the verdict to the district court of the county where the drainage proceedings were filed.\n(c) The appeal shall take precedence over all other civil court matters. If there is more than one appeal to be tried in one county, the court may, on its own motion or the motion of an interested party, consolidate two or more appeals and try them together, but the rights of the appellants must be determined separately. If the appellant does not prevail, the cost of the trial must be paid by the appellant.\n(d) The court administrator of the district court where the appeal is filed shall file a certified copy of the final determination of the appeal with the auditor of the affected counties.\nFor all appeals, the amount awarded by the jury as a determination of the issue appealed shall replace the amount that was appealed.",
	"repealed": false
}