{
	"id": "245G.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.031",
	"title": "245G.031 ALTERNATIVE LICENSING INSPECTIONS.",
	"text": "(a) A license holder who holds a qualifying accreditation may request approval for an alternative licensing inspection by the commissioner when the standards of the accrediting body are determined by the commissioner to be the same as or similar to the standards set forth in this chapter. Programs licensed according to section 245G.19 to serve clients with children and opioid treatment programs licensed according to section 245G.22 are not eligible for an alternative licensing inspection.\n(b) A license holder may request an alternative licensing inspection after the license holder has had at least one inspection by the commissioner that included a review of all applicable requirements in this chapter after issuance of the initial license.\n(c) To be eligible for an alternative licensing inspection, the license holder must be in substantial and consistent compliance at the time of the request. For purposes of this section, \"substantial and consistent compliance\" means:\n(1) the license holder has not had a license made conditional, suspended, or revoked within the last five years;\n(2) there have been no substantiated allegations of maltreatment for which the facility was determined responsible within the past five years; and\n(3) the license holder has corrected all violations and submitted required documentation as specified in the correction orders issued within the past two years.\n(a) The commissioner must accept a qualifying accreditation from an accrediting body listed in paragraph (c) after determining, in consultation with the accrediting body and license holders, which of the accrediting body's standards are the same as or similar to the licensing requirements in this chapter. In determining whether standards of an accrediting body are the same as or similar to licensing requirements under this chapter, the commissioner shall give due consideration to the existence of a standard that aligns in whole or in part to a licensing standard.\n(b) Upon request by a license holder, the commissioner may allow the accrediting body to monitor for compliance with licensing requirements under this chapter that are determined to be neither the same as nor similar to those of the accrediting body.\n(c) For purposes of this section, \"accrediting body\" means The Joint Commission.\n(d) Qualifying accreditation only applies to the license holder's licensed programs that are included in the accrediting body's survey during each survey period.\n(a) A license holder may request an alternative licensing inspection on the forms and in the manner prescribed by the commissioner. When submitting the request, the license holder must submit all documentation issued by the accrediting body verifying that the license holder has obtained and maintained the qualifying accreditation and has complied with recommendations or requirements from the accrediting body during the period of accreditation. Prior to approving an alternative licensing inspection under this section, the commissioner must have reviewed and approved the license holder's policies and procedures required to demonstrate compliance with all applicable requirements in this chapter.\n(b) The commissioner must notify the license holder in writing within 90 days whether the request for an alternative licensing inspection status has been approved.\n(a) A license holder approved for alternative licensing inspection under this section is required to maintain compliance with all licensing standards according to this chapter.\n(b) After approval, the license holder must submit to the commissioner changes to policies required as a result of legislative changes to this chapter.\n(c) The commissioner may conduct licensing inspections of requirements that are not already covered by the accrediting body, as determined under subdivision 2, paragraphs (a) and (b), including applicable requirements in chapters 245A and 245C, and Minnesota Rules, chapter 9544.\n(d) The commissioner may conduct routine licensing inspections every five years of all applicable requirements in this chapter, chapters 245A and 245C, and Minnesota Rules, chapter 9544.\n(e) Within ten days of final approval of a corrective action plan by the accrediting body, if any, or if no corrections, upon receipt of the final report by the accrediting body, the license holder must mail or email to the commissioner the complete contents of all survey results and corrective responses.\n(f) If the accrediting body determines the scope of noncompliance of a standard with a pattern or widespread moderate likelihood to harm a client or any high likelihood to harm a client, the commissioner may conduct an inspection.\n(g) If the accrediting body does not subject a licensed location to a survey by the accrediting body, the license holder must inform the commissioner and the commissioner may conduct an inspection of that location.\n(h) Upon receipt of a complaint or report regarding the services of a license holder approved for alternative licensing inspection under this section, the commissioner may investigate the complaint or report and may take any action as provided under section 245A.06 or 245A.07.\n(i) The license holder must notify the commissioner in a timely manner if the license holder no longer holds a qualifying accreditation from an accrediting body.\nNothing in this section changes the commissioner's responsibilities to investigate alleged or suspected maltreatment of a minor under chapter 260E or a vulnerable adult under section 626.557.\nThe commissioner may terminate the approval of an alternative licensing inspection if after approval:\n(1) the commissioner determines that the license holder has not maintained the qualifying accreditation;\n(2) the license holder fails to provide the commissioner with documentation that demonstrates the license holder has complied with accreditation standards;\n(3) the commissioner substantiates maltreatment for which the license holder or facility is determined to be responsible; or\n(4) the license holder is issued an order for conditional license, fine, suspension, or license revocation that has not been reversed upon appeal.\nThe commissioner's decision that the conditions for approval for an alternative licensing inspection have not been met is final and not subject to appeal under the provisions of chapter 14.",
	"repealed": false
}