{
	"id": "354.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.42",
	"title": "354.42 CONTRIBUTIONS BY EMPLOYER AND EMPLOYEE.",
	"text": "[Repealed, 1974 c 289 s 59]\n(a) Within the Teachers Retirement Association and the state treasury is created a special retirement fund, which must include all the assets of the Teachers Retirement Association and all revenue of the association.\n(b) The teachers retirement fund must be credited with all employee and employer contributions, all investment revenue and gains, and all other income authorized by law.\n(c) From the teachers retirement fund is appropriated the payments of annuities and benefits authorized by this chapter and the reasonable and necessary expenses of administering the fund and the association.\n(a) The employee contribution to the fund is the following percentage of the member's salary:\n(b) When an employee contribution rate changes for a fiscal year, the new contribution rate is effective for the entire salary paid for each employer unit with the first payroll cycle reported.\n(c) This contribution must be made by deduction from salary. Where any portion of a member's salary is paid from other than public funds, the member's employee contribution must be based on the entire salary received.\n(a) The regular employer contribution to the fund by Special School District No. 1, Minneapolis, is an amount equal to the applicable following percentage of salary of each coordinated member and the applicable percentage of salary of each basic member specified in paragraph (c).\nThe additional employer contribution to the fund by Special School District No. 1, Minneapolis, is an amount equal to 3.64 percent of the salary of each teacher who is a coordinated member or who is a basic member.\n(b) The regular employer contribution to the fund by Independent School District No. 709, Duluth, is an amount equal to the applicable percentage of salary of each old law or new law coordinated member specified for the coordinated program in paragraph (c).\n(c) The employer contribution to the fund for every other employer is an amount equal to the applicable following percentage of the salary of each coordinated member and the applicable following percentage of the salary of each basic member:\n(d) When an employer contribution rate changes for a fiscal year, the new contribution rate is effective for the entire salary paid for each employer unit with the first payroll cycle reported.\n[Repealed, 1969 c 485 s 40]\nMS 2016 [Repealed, 2018 c 211 art 3 s 4]\nMS 2016 [Repealed, 2018 c 211 art 3 s 4]\nMS 2016 [Repealed, 2018 c 211 art 3 s 4]\nMS 2016 [Repealed, 2018 c 211 art 3 s 4]\n[Repealed, 1997 c 233 art 1 s 50]\n[Repealed, 1974 c 289 s 59]\n(a) Any deductions taken from the salary of an employee for the retirement fund in excess of amounts required must be refunded to the employee upon the discovery of the error and after the verification of the error by the employing unit making the deduction. The corresponding excess employer contribution and excess additional employer contribution amounts attributable to the erroneous salary deduction must be refunded to the employing unit.\n(b) If salary deductions and employer contributions were erroneously transmitted to the retirement fund and should have been transmitted to the plan covered by chapter 352D, 353D, 354B, or 354D, the executive director must transfer these salary deductions and employer contributions to the account of the appropriate person under the applicable plan. The transfer to the applicable defined contribution plan account must include interest at the applicable monthly rate or rates specified in section 356.59, subdivision 4, compounded annually, from the first day of the month following the month in which coverage should have commenced in the defined contribution plan until the end of the month in which the transfer occurs.\n(c) A potential transfer under paragraph (b) that would cause the plan to fail to be a qualified plan under section 401(a) of the Internal Revenue Code, as amended, must not be made by the executive director. Within 30 days after being notified by the Teachers Retirement Association of an unmade potential transfer under this paragraph, the employer of the affected person must transmit an amount representing the applicable salary deductions and employer contributions, without interest, to the account of the applicable person under the appropriate plan. The retirement association must provide a credit for the amount of the erroneous salary deductions and employer contributions against future contributions from the employer.\n(d) If a salary payment from which a deduction for the retirement fund was taken has been canceled or the amount of the payment has been returned to the funds of the employing unit making the payment, a refund of the amount deducted, or any portion of it that is required to adjust the salary deductions, must be made to the employing unit.\n(e) Erroneous direct payments of member-paid contributions or erroneous salary deductions that were not refunded during the regular payroll cycle processing must be refunded to the member, plus interest computed using the rate and method specified in section 354.49, subdivision 2.\n(f) Any refund under this subdivision that would cause the plan to fail to be a qualified plan under section 401(a) of the Internal Revenue Code, as amended, may not be refunded and instead must be credited against future contributions payable by the employer. The employer is responsible for refunding to the applicable employee any amount that was erroneously deducted from the salary of the employee, with interest as specified in paragraph (e).\n(g) If erroneous employee deductions and employer contributions are caused by an error in plan coverage involving the plan and any other plan specified in section 356.637, that section applies.",
	"repealed": false
}