{
	"id": "204C.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.39",
	"title": "204C.39 CORRECTION OF OTHER OBVIOUS ERRORS.",
	"text": "A county canvassing board may determine by majority vote that the election judges have made an obvious error in counting or recording the votes for an office. The county canvassing board shall then promptly notify all candidates for that office of the determination, including a description of the error. The county canvassing board must also instruct the county auditor to apply without unreasonable delay to the district court of the county containing the precinct in which the alleged error was made for an order determining whether or not an obvious error has been made. The auditor shall describe the alleged error in the application and may submit additional evidence as directed by the court. The auditor shall notify the county canvassing board and all candidates for the affected office in the manner directed by the court. If the court finds that the election judges made an obvious error it shall issue an order specifying the error and directing the county canvassing board to inspect the ballots and returns of the precinct in order to correct the error and to proceed further in accordance with this section or otherwise as the court may direct.\nThe county auditor shall schedule a meeting of the county canvassing board at the auditor's office as soon as practicable after the court issues an order under subdivision 1 and shall give sufficient advance notice of the meeting to the affected candidates. The board, in the presence of all the candidates for the office or their representatives shall inspect the ballots and returns, correct any error and proceed further in accordance with the order of the court.\nPreparation of the county canvassing board report with respect to other offices on the ballot shall not be delayed because of an inspection required by this section.\nAfter the canvassing board has inspected the ballots and returns, it shall promptly submit to the county auditor an addendum to its regular report, which addendum shall contain the following information:\n(a) a copy of the order of the court, if any;\n(b) the minutes of the meeting showing the time, date, and place of the meeting, the names of the candidates or their representatives who were present, and the action taken by the board;\n(c) a copy of the meeting notice given to each candidate and proof of service; and\n(d) the names of the candidates for each office for which votes were inspected and the total number of votes received by each candidate for that office in the county and in each precinct.\nThe canvassing board shall declare the results of the election upon completing the inspection for the office in question. The report and declaration shall be filed by the county auditor, who shall mail a certified copy to each candidate for that office. The county auditor shall promptly notify the secretary of state by United States mail and electronic mail of the action of the county canvassing board.",
	"repealed": false
}