{
	"id": "103B.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.102",
	"title": "103B.102 LOCAL WATER MANAGEMENT; ACCOUNTABILITY AND OVERSIGHT.",
	"text": "The legislature finds that a process is needed to monitor the performance and activities of local water management entities. The process should be preemptive so that problems can be identified early and systematically. Underperforming entities should be provided assistance and direction for improving performance in a reasonable time frame.\nFor the purposes of this section, \"local water management entities\" means watershed districts, soil and water conservation districts, metropolitan water management organizations, and counties operating separately or jointly in their role as local water management authorities under chapter 103B, 103C, 103D, or 103G and chapter 114D.\nThe Board of Water and Soil Resources shall evaluate performance, financial, and activity information for each local water management entity. The board shall evaluate the entities' progress in accomplishing their adopted plans on a regular basis as determined by the board based on budget and operations of the local water management entity, but not less than once every ten years. The board shall maintain a summary of local water management entity performance on the board's website. Beginning February 1, 2008, and annually thereafter, the board shall provide an analysis of local water management entity performance to the chairs of the house of representatives and senate committees having jurisdiction over environment and natural resources policy.\n(a) In addition to other authorities, the Board of Water and Soil Resources may, based on its evaluation in subdivision 3, reduce, withhold, or redirect grants and other funding if the local water management entity has not corrected deficiencies as prescribed in a notice from the board within one year from the date of the notice.\n(b) The board may defer a decision on a termination petition filed under section 103B.221, 103C.225, or 103D.271 for up to one year to conduct or update the evaluation under subdivision 3 or to communicate the results of the evaluation to petitioners or to local and state government agencies.",
	"repealed": false
}