{
	"id": "152.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.29",
	"title": "152.29 MANUFACTURER OF MEDICAL CANNABIS DUTIES.",
	"text": "(a) A manufacturer may operate eight distribution facilities, which may include the manufacturer's single location for cultivation, harvesting, manufacturing, packaging, and processing but is not required to include that location. The commissioner shall designate the geographical service areas to be served by each manufacturer based on geographical need throughout the state to improve patient access. A manufacturer shall not have more than two distribution facilities in each geographical service area assigned to the manufacturer by the commissioner. A manufacturer shall operate only one location where all cultivation, harvesting, manufacturing, packaging, and processing of medical cannabis shall be conducted. This location may be one of the manufacturer's distribution facility sites. The additional distribution facilities may dispense medical cannabis and medical cannabis products but may not contain any medical cannabis in a form other than those forms allowed under section 152.22, subdivision 6, and the manufacturer shall not conduct any cultivation, harvesting, manufacturing, packaging, or processing at the other distribution facility sites. Any distribution facility operated by the manufacturer is subject to all of the requirements applying to the manufacturer under sections 152.22 to 152.37, including, but not limited to, security and distribution requirements.\n(b) A manufacturer may acquire hemp grown in this state from a hemp grower, and may acquire hemp products produced by a hemp processor. A manufacturer may manufacture or process hemp and hemp products into an allowable form of medical cannabis under section 152.22, subdivision 6. Hemp and hemp products acquired by a manufacturer under this paragraph are subject to the same quality control program, security and testing requirements, and other requirements that apply to medical cannabis under sections 152.22 to 152.37 and Minnesota Rules, chapter 4770.\n(c) A medical cannabis manufacturer shall contract with a laboratory approved by the commissioner, subject to any additional requirements set by the commissioner, for purposes of testing medical cannabis manufactured or hemp or hemp products acquired by the medical cannabis manufacturer as to content, contamination, and consistency to verify the medical cannabis meets the requirements of section 152.22, subdivision 6. The cost of laboratory testing shall be paid by the manufacturer.\n(d) The operating documents of a manufacturer must include:\n(1) procedures for the oversight of the manufacturer and procedures to ensure accurate record keeping;\n(2) procedures for the implementation of appropriate security measures to deter and prevent the theft of medical cannabis and unauthorized entrance into areas containing medical cannabis; and\n(3) procedures for the delivery and transportation of hemp between hemp growers and manufacturers and for the delivery and transportation of hemp products between hemp processors and manufacturers.\n(e) A manufacturer shall implement security requirements, including requirements for the delivery and transportation of hemp and hemp products, protection of each location by a fully operational security alarm system, facility access controls, perimeter intrusion detection systems, and a personnel identification system.\n(f) A manufacturer shall not share office space with, refer patients to a health care practitioner, or have any financial relationship with a health care practitioner.\n(g) A manufacturer shall not permit any person to consume medical cannabis on the property of the manufacturer.\n(h) A manufacturer is subject to reasonable inspection by the commissioner.\n(i) For purposes of sections 152.22 to 152.37, a medical cannabis manufacturer is not subject to the Board of Pharmacy licensure or regulatory requirements under chapter 151.\n(j) A medical cannabis manufacturer may not employ any person who is under 21 years of age or who has been convicted of a disqualifying felony offense. An employee of a medical cannabis manufacturer must submit a completed criminal history records check consent form, a full set of classifiable fingerprints, and the required fees for submission to the Bureau of Criminal Apprehension before an employee may begin working with the manufacturer. The bureau must conduct a Minnesota criminal history records check and the superintendent is authorized to exchange the fingerprints with the Federal Bureau of Investigation to obtain the applicant's national criminal history record information. The bureau shall return the results of the Minnesota and federal criminal history records checks to the commissioner.\n(k) A manufacturer may not operate in any location, whether for distribution or cultivation, harvesting, manufacturing, packaging, or processing, within 1,000 feet of a public or private school existing before the date of the manufacturer's registration with the commissioner.\n(l) A manufacturer shall comply with reasonable restrictions set by the commissioner relating to signage, marketing, display, and advertising of medical cannabis.\n(m) Before a manufacturer acquires hemp from a hemp grower or hemp products from a hemp processor, the manufacturer must verify that the hemp grower or hemp processor has a valid license issued by the commissioner of agriculture under chapter 18K.\n(n) Until a state-centralized, seed-to-sale system is implemented that can track a specific medical cannabis plant from cultivation through testing and point of sale, the commissioner shall conduct at least one unannounced inspection per year of each manufacturer that includes inspection of:\n(1) business operations;\n(2) physical locations of the manufacturer's manufacturing facility and distribution facilities;\n(3) financial information and inventory documentation, including laboratory testing results; and\n(4) physical and electronic security alarm systems.\n[See Note.]\n(a) A manufacturer of medical cannabis shall provide a reliable and ongoing supply of all medical cannabis needed for the registry program through cultivation by the manufacturer and through the purchase of hemp from hemp growers.\n(b) All cultivation, harvesting, manufacturing, packaging, and processing of medical cannabis must take place in an enclosed, locked facility at a physical address provided to the commissioner during the registration process.\n(c) A manufacturer must process and prepare any medical cannabis plant material or hemp plant material into a form allowable under section 152.22, subdivision 6, prior to distribution of any medical cannabis.\n[See Note.]\n(a) A manufacturer shall require that employees licensed as pharmacists pursuant to chapter 151 be the only employees to give final approval for the distribution of medical cannabis to a patient. A manufacturer may transport medical cannabis or medical cannabis products that have been cultivated, harvested, manufactured, packaged, and processed by that manufacturer to another registered manufacturer for the other manufacturer to distribute.\n(b) A manufacturer may distribute medical cannabis products, whether or not the products have been manufactured by that manufacturer.\n(c) Prior to distribution of any medical cannabis, the manufacturer shall:\n(1) verify that the manufacturer has received the registry verification from the office for that individual patient;\n(2) verify that the person requesting the distribution of medical cannabis is the patient, the patient's registered designated caregiver, or the patient's parent, legal guardian, or spouse listed in the registry verification using the procedures described in section 152.11, subdivision 2d;\n(3) assign a tracking number to any medical cannabis distributed from the manufacturer;\n(4) ensure that any employee of the manufacturer licensed as a pharmacist pursuant to chapter 151 has consulted with the patient to determine the proper dosage for the individual patient after reviewing the ranges of chemical compositions of the medical cannabis and the ranges of proper dosages reported by the office. For purposes of this clause, a consultation may be conducted remotely by secure videoconference, telephone, or other remote means, so long as the employee providing the consultation is able to confirm the identity of the patient and the consultation adheres to patient privacy requirements that apply to health care services delivered through telehealth. A pharmacist consultation under this clause is only required:\n(i) if the patient is purchasing the medical cannabis flower or medical cannabinoid product for the first time;\n(ii) if the patient purchases medical cannabis flower or a medical cannabinoid product that the patient must administer using a different method than the patient's previous method of administration;\n(iii) if the patient purchases medical cannabis flower or a medical cannabinoid product with a cannabinoid concentration of at least double the patient's prior dosage; or\n(iv) upon the request of the patient; and\n(5) properly package medical cannabis in compliance with the United States Poison Prevention Packing Act regarding child-resistant packaging and exemptions for packaging for elderly patients, and label distributed medical cannabis with a list of all active ingredients and individually identifying information, including:\n(i) the patient's name and date of birth;\n(ii) the name and date of birth of the patient's registered designated caregiver or, if listed on the registry verification, the name of the patient's parent or legal guardian, if applicable;\n(iii) the patient's registry identification number;\n(iv) the chemical composition of the medical cannabis; and\n(v) the dosage.\n(d) A manufacturer shall require any employee of the manufacturer who is transporting medical cannabis or medical cannabis products to a distribution facility or to another registered manufacturer to carry identification showing that the person is an employee of the manufacturer.\n(e) A manufacturer shall distribute medical cannabis in dried raw cannabis form only to a patient age 21 or older, or to the registered designated caregiver, parent, legal guardian, or spouse of a patient age 21 or older.\n[See Note.]\n(a) A medical cannabis manufacturer may staff a transport motor vehicle with only one employee if the medical cannabis manufacturer is transporting medical cannabis to either a certified laboratory for the purpose of testing or a facility for the purpose of disposal. If the medical cannabis manufacturer is transporting medical cannabis for any other purpose or destination, the transport motor vehicle must be staffed with a minimum of two employees as required by rules adopted by the commissioner.\n(b) Notwithstanding paragraph (a), a medical cannabis manufacturer that is only transporting hemp for any purpose may staff the transport motor vehicle with only one employee.\n(c) A medical cannabis manufacturer may contract with a third party for armored car services for deliveries of medical cannabis from its production facility to distribution facilities. A medical cannabis manufacturer that contracts for armored car services remains responsible for the transportation manifest and inventory tracking requirements in rules adopted by the commissioner.\n(d) Department of Health staff may transport medical cannabis for the purposes of delivering medical cannabis and other samples to a laboratory for testing under rules adopted by the commissioner and in cases of special investigations when the commissioner has determined there is a potential threat to public health. The transport motor vehicle must be staffed with a minimum of two Department of Health employees. The employees must carry with them their Department of Health identification card and a transport manifest.\n[See Note.]\nA manufacturer may distribute medical cannabis to a patient, registered designated caregiver, or parent, legal guardian, or spouse of a patient who is at the distribution facility but remains in a motor vehicle, provided:\n(1) distribution facility staff receive payment and distribute medical cannabis in a designated zone that is as close as feasible to the front door of the distribution facility;\n(2) the manufacturer ensures that the receipt of payment and distribution of medical cannabis are visually recorded by a closed-circuit television surveillance camera at the distribution facility and provides any other necessary security safeguards;\n(3) the manufacturer does not store medical cannabis outside a restricted access area at the distribution facility, and distribution facility staff transport medical cannabis from a restricted access area at the distribution facility to the designated zone for distribution only after confirming that the patient, designated caregiver, or parent, guardian, or spouse has arrived in the designated zone;\n(4) the payment and distribution of medical cannabis take place only after a pharmacist consultation takes place, if required under subdivision 3, paragraph (c), clause (4);\n(5) immediately following distribution of medical cannabis, distribution facility staff enter the transaction in the state medical cannabis registry information technology database; and\n(6) immediately following distribution of medical cannabis, distribution facility staff take the payment received into the distribution facility.\nNotwithstanding Minnesota Rules, part 4770.1200, subpart 2, item C, a manufacturer is not required to grind root balls of medical cannabis plants or incorporate them with a greater quantity of nonconsumable solid waste before transporting root balls to another location for disposal. For purposes of this subdivision, \"root ball\" means a compact mass of roots formed by a plant and any attached growing medium.\n(a) Each manufacturer shall report to the commissioner on a monthly basis the following information on each individual patient for the month prior to the report:\n(1) the amount and dosages of medical cannabis distributed;\n(2) the chemical composition of the medical cannabis; and\n(3) the tracking number assigned to any medical cannabis distributed.\n(b) For transactions involving Tribal medical cannabis program patients, each manufacturer shall report to the commissioner on a weekly basis the following information on each individual Tribal medical cannabis program patient for the week prior to the report:\n(1) the name of the Tribal medical cannabis program in which the Tribal medical cannabis program patient is enrolled;\n(2) the amount and dosages of medical cannabis distributed;\n(3) the chemical composition of the medical cannabis distributed; and\n(4) the tracking number assigned to the medical cannabis distributed.\n[See Note.]\n(a) A manufacturer may distribute medical cannabis in accordance with subdivisions 1 to 4 to a Tribal medical cannabis program patient.\n(b) Prior to distribution, the Tribal medical cannabis program patient must provide to the manufacturer:\n(1) a valid medical cannabis registration verification card or equivalent document issued by a Tribal medical cannabis program that indicates that the Tribal medical cannabis program patient is authorized to use medical cannabis on Indian lands over which the Tribe has jurisdiction; and\n(2) a valid photographic identification card issued by the Tribal medical cannabis program, a valid driver's license, or a valid state identification card.\n(c) A manufacturer shall distribute medical cannabis to a Tribal medical cannabis program patient only in a form allowed under section 152.22, subdivision 6.",
	"repealed": false
}