{
	"id": "617.292",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.292",
	"title": "617.292 DEFINITIONS.",
	"text": "As used in sections 617.291 to 617.297, the terms defined in this section have the meanings given them.\n\"Minor\" means any person under the age of 18 years.\n\"Nudity\" means the showing of the human male or female genitals, pubic area or buttocks with less than a fully opaque covering, or the showing of the female breast with less than a fully opaque covering of any portion thereof below the top of the nipple, or the depiction of covered male genitals in a discernibly turgid state.\n\"Sexual conduct\" means acts of masturbation, homosexuality, sexual intercourse, or physical contact with a person's unclothed genitals, pubic area, buttocks or, if such a person be a female, her breast.\n\"Sexual excitement\" means the condition of human male or female genitals when in a state of sexual stimulation or arousal.\n\"Sadomasochistic abuse\" means flagellation or torture by or upon a person clad in undergarments, a mask or bizarre costume, or the condition of being fettered, bound or otherwise physically restrained on the part of one so clothed.\n\"Harmful to minors\" means that quality of any description or representation, in whatever form, of nudity, sexual conduct, sexual excitement, or sadomasochistic abuse, when it:\n(1) predominantly appeals to the prurient, shameful or morbid interest of minors;\n(2) is patently offensive to prevailing standards in the adult community as a whole with respect to what is suitable material for minors; and\n(3) is utterly without redeeming social importance for minors.\n\"Knowingly\" means having general knowledge of, or reason to know, or a belief or ground for belief which warrants further inspection or inquiry or both:\n(1) the character and content of any material which is reasonably susceptible of examination by the defendant; and\n(2) the age of the minor, provided however that an honest mistake shall constitute an excuse from liability hereunder if the defendant made a reasonable bona fide attempt to ascertain the true age of such minor.",
	"repealed": false
}