{
	"id": "17.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.81",
	"title": "17.81 DEFINITIONS.",
	"text": "For the purposes of sections 17.80 to 17.84, the terms defined in this section have the meanings given them.\n\"Action which adversely affects\" means any of the following actions taken in respect to agricultural land which have or would have the effect of substantially restricting the agricultural use of the land: (1) acquisition for a nonagricultural use except acquisition for any unit of the outdoor recreation system described in section 86A.05, other than a trail described in subdivision 4 of that section; (2) granting of a permit, license, franchise or other official authorization for nonagricultural use; (3) lease of state-owned land for nonagricultural use except for mineral exploration or mining; or (4) granting or loaning of state funds for purposes which are not consistent with agricultural use.\n\"Agricultural land\" means land which is in agricultural use, and which has been identified as agricultural land by a local unit of government pursuant to Minnesota Statutes 2020, sections 366.10 to 366.181, or sections 394.21 to 394.37, 462.351 to 462.364, or 473H.04, or which is composed of predominantly class I, II, III, or IV soils as identified in the land capability classification system of the United States Department of Agriculture Natural Resources Conservation Service and the county soil survey, if completed.\n\"Agricultural use\" means use of land for the production of livestock, dairy animals, dairy products, poultry and poultry products, fur bearing animals, horticultural and nursery stock which is under chapter 18H, fruit of all kinds, vegetables, forage, grains, bees, and apiary products. Wetlands, pasture and woodlands accompanying land in agricultural use shall be considered to be in agricultural use.\n\"Agency\" means a department identified in section 15.01, and any other agency of the state whose actions are by virtue of other law governed by the provisions of sections 17.80 to 17.84.\n[Repealed, 1996 c 310 s 1]",
	"repealed": false
}