{
	"id": "88.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.30",
	"title": "88.30 CLEARING AND IMPROVING LANDS.",
	"text": "Before any improvement authorized by sections 88.28 to 88.46 shall be ordered or caused to be constructed by the county board of any county, there shall first be filed with the auditor of the county a petition signed by two or more parties owning land in the county, which land shall be described in the petition. The petition shall describe each tract of land, of which any portion is to be improved, by 40-acre tracts or by number of lots as designated under government survey; specify the number of acres of each tract that it is proposed to improve, which shall be not less than five, nor more than 20, acres in each 40-acre tract and a proportionate amount in smaller subdivisions; and set forth the nature of the title of the petitioners to each particular tract, in general terms, specifying whether the land is held by the petitioners as owners or under contract, and if the latter, with whom, and the balance remaining unpaid of the purchase price. The lands described in the petition must be situated in the same locality or part of the county, but not more than 40 acres in any quarter-section owned by the same petitioner shall be improved under sections 88.28 to 88.46 except by unanimous consent of the members of the county board. The petition shall further set forth a general description of the proposed improvement. Upon the filing of the petition, duly verified, with the auditor of the county, together with a bond by the petitioners, or by one or more of them, or some one in their behalf, with sufficient security, in a sum of not less than $500, conditioned to hold the county harmless from all expense in the event the improvement petitioned for is not granted, the auditor shall designate the proceeding as \"County Land Improvement No. ................,\" and in all subsequent proceedings in relation thereto the same may be designated and referred to by such title and number.\nAny petition heretofore filed under Laws 1921, chapter 155, and any proceedings taken thereunder, may be continued and completed in conformity with the provisions of sections 88.28 to 88.46, at the discretion of the county board. No lands shall be so improved under sections 88.28 to 88.46 except upon petition of the owner or owners thereof.",
	"repealed": false
}