{
	"id": "136F.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.43",
	"title": "136F.43 EXTENDED LEAVES OF ABSENCE.",
	"text": "As used in this section, \"teacher\" means a person on the instructional or administrative staff of the state colleges and universities who is a member of the Teachers Retirement Association under chapter 354, who is a member of a teachers retirement fund association under chapter 354A, or who is covered by the Unclassified Employees Plan under chapter 352D or Individual Retirement Account Plan under chapter 354B. It shall not include a chancellor, deputy chancellor, or vice-chancellor.\nThe board may grant an extended leave of absence without salary to a full-time teacher who has been employed by the board for at least five years and has at least ten years of allowable service in one or a combination of the retirement plans specified in subdivision 1. The maximum duration of an extended leave of absence pursuant to this section shall be determined by mutual agreement of the board and the teacher at the time the leave is granted and shall be at least three but no more than five years. An extended leave of absence under this section shall be taken by mutual consent of the board and the teacher. No teacher may receive more than one leave of absence under this section.\nA teacher on an extended leave of absence under this section shall have the right to be reinstated to the same position or a similar position within the department or program from which the leave was granted at the beginning of the school year which immediately follows a year of extended leave of absence, unless the teacher is discharged or placed on retrenchment or on layoff or the teacher's contract is terminated while the teacher is on the extended leave. The board shall not be obligated to reinstate a teacher who is on an extended leave of absence under this section unless the teacher advises the board of an intention to return before February 1 in the school year preceding the school year in which the teacher wishes to return.\nA teacher who is reinstated to the same or similar position after an extended leave under this section shall not lose tenure or credit for previous seniority in the employing state college or university. A teacher shall not accrue seniority credit during the time of a leave of absence under this section, except that a teacher at a state college or university may accrue seniority credit during the leave, consistent with the conditions of the collective bargaining agreement.\nThe years spent by a teacher on an extended leave of absence under this section shall not be included in the determination of the teacher's salary upon reinstatement to the same or similar position by the board. The credits earned by a teacher on an extended leave of absence under this section shall not be included in the determination of the teacher's salary upon reinstatement to the same or similar position by the board for a period of time equal to the time of the extended leave of absence.\nThe board may grant a teacher a leave of absence which is not subject to the provisions of this section and either section 354.094 or 354A.091.",
	"repealed": false
}