{
	"id": "124D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.09",
	"title": "124D.09 POSTSECONDARY ENROLLMENT OPTIONS ACT.",
	"text": "This section may be cited the \"Postsecondary Enrollment Options Act.\"\nThe purpose of this section is to promote rigorous academic pursuits and to provide a wider variety of options to high school pupils by encouraging and enabling secondary pupils to enroll full time or part time in nonsectarian courses or programs in eligible postsecondary institutions, as defined in subdivision 3.\nFor purposes of this section, the following terms have the meanings given to them.\n(a) \"Eligible institution\" means a Minnesota public postsecondary institution, a private, nonprofit two-year trade and technical school granting associate degrees, an opportunities industrialization center accredited by an accreditor recognized by the United States Department of Education, or a private, residential, two-year or four-year, liberal arts, degree-granting college or university located in Minnesota. An eligible institution must not require a faith statement from a secondary student seeking to enroll in a postsecondary course under this section during the application process or base any part of the admission decision on a student's race, creed, ethnicity, disability, gender, or sexual orientation or religious beliefs or affiliations.\n(b) \"Course\" means a course or program.\n(c) \"Concurrent enrollment\" means nonsectarian courses in which an eligible pupil under subdivision 5 or 5b enrolls to earn both secondary and postsecondary credits, are taught by a secondary teacher or a postsecondary faculty member, and are offered at a high school for which the district is eligible to receive concurrent enrollment program aid under section 124D.091.\n(a) \"Alternative pupil\" means a 10th, 11th, or 12th grade student, subject to paragraph (b), who is not enrolled in a public school district. Alternative pupil includes students attending nonpublic schools and students who are home schooled. An alternative pupil is considered a pupil for purposes of this section only. An alternative pupil must register with the commissioner of education before participating in the postsecondary enrollment options program. The commissioner must prescribe the form and manner of the registration, in consultation with the Nonpublic Education Council under section 123B.445, and may request any necessary information from the alternative pupil.\n(b) A 10th grade student qualifies as an alternative pupil if the student: (1) is enrolled in a career or technical education course offered by an eligible institution; and (2) received a passing score on the 8th grade Minnesota Comprehensive Assessment or another reading assessment accepted by the enrolling postsecondary institution. A career or technical education course must meet the requirements under subdivision 5a. If an alternative pupil in 10th grade receives a grade of \"C\" or better in the career or technical education course taken under this subdivision, the postsecondary institution must allow the student to take additional postsecondary courses for credit at that institution, not to exceed the limits in subdivision 8.\n(a) Notwithstanding any other law to the contrary, an 11th or 12th grade pupil enrolled in a school or an American Indian-controlled Tribal contract or grant school eligible for aid under section 124D.83, except a foreign exchange pupil enrolled in a district under a cultural exchange program, may apply to an eligible institution, as defined in subdivision 3, to enroll in nonsectarian courses offered by that postsecondary institution.\n(b) If an institution accepts a secondary pupil for enrollment under this section, the institution shall send written notice to the pupil, the pupil's school or school district, and the commissioner. The notice must indicate the course and hours of enrollment of that pupil. The institution must notify the pupil's school as soon as practicable if the pupil withdraws from the enrolled course. The institution must also notify the pupil's school as soon as practicable if the pupil has been absent from a course for ten consecutive days on which classes are held, based upon the postsecondary institution's academic calendar, and the pupil is not receiving instruction in their home or hospital or other facility.\n(c) If the pupil enrolls in a course for postsecondary credit, the institution must notify the pupil about payment in the customary manner used by the institution.\nA 10th, 11th, or 12th grade pupil enrolled in a district or an American Indian-controlled tribal contract or grant school eligible for aid under section 124D.83, except a foreign exchange pupil enrolled in a district under a cultural exchange program, may enroll in a career or technical education course offered by a Minnesota state college or university. A 10th grade pupil applying for enrollment in a career or technical education course under this subdivision must have received a passing score on the 8th grade Minnesota Comprehensive Assessment in reading as a condition of enrollment. A current 10th grade pupil who did not take the 8th grade Minnesota Comprehensive Assessment in reading may substitute another reading assessment accepted by the enrolling postsecondary institution. A secondary pupil may enroll in the pupil's first postsecondary options enrollment course under this subdivision. A student who is refused enrollment by a Minnesota state college or university under this subdivision may apply to an eligible institution offering a career or technical education course. The postsecondary institution must give priority to its students according to subdivision 9. If a secondary student receives a grade of \"C\" or better in the career or technical education course taken under this subdivision, the postsecondary institution must allow the student to take additional postsecondary courses for secondary credit at that institution, not to exceed the limits in subdivision 8. A \"career or technical course\" is a course that is part of a career and technical education program that provides individuals with coherent, rigorous content aligned with academic standards and relevant technical knowledge and skills needed to prepare for further education and careers in current and emerging professions and provide technical skill proficiency, an industry recognized credential, and a certificate, a diploma, or an associate degree.\nNotwithstanding any other law to the contrary, a 9th or 10th grade pupil enrolled in a district or an American Indian-controlled tribal contract or grant school eligible for aid under section 124D.83, except a foreign exchange pupil enrolled in a district under a cultural exchange program, may apply to enroll in nonsectarian courses offered under subdivision 10, if:\n(1) the school district and the eligible postsecondary institution providing the course agree to the student's enrollment; or\n(2) the course is a world language course currently available to 11th and 12th grade students, and consistent with section 120B.022 governing world language standards, certificates, and seals.\nThe school or school district must provide counseling services to pupils and their parents or guardian before the pupils enroll in courses under this section to ensure that the pupils and their parents or guardian are fully aware of the risks and possible consequences of enrolling in postsecondary courses. The school or school district must provide information on the program including who may enroll, what institutions and courses are eligible for participation, the decision-making process for granting academic credits, financial arrangements for tuition, books and materials, eligibility criteria for transportation aid, available support services, the need to arrange an appropriate schedule, consequences of failing or not completing a course in which the pupil enrolls, the effect of enrolling in this program on the pupil's ability to complete the required high school graduation requirements, and the academic and social responsibilities that must be assumed by the pupils and their parents or guardian. The person providing counseling shall encourage pupils and their parents or guardian to also use available counseling services at the postsecondary institutions before the quarter or semester of enrollment to ensure that anticipated plans are appropriate.\nPrior to enrolling in a course, the pupil and the pupil's parents or guardian must sign a form that must be provided by the school or school district and may be obtained from a postsecondary institution stating that they have received the information specified in this subdivision and that they understand the responsibilities that must be assumed in enrolling in this program. The department must, upon request, provide technical assistance to a school or school district in developing appropriate forms and counseling guidelines.\nBy the earlier of (1) three weeks prior to the date by which a student must register for district courses for the following school year, or (2) March 1 of each year, a district must provide up-to-date information on the district's website and in materials that are distributed to parents and students about the program, including information about enrollment requirements and the ability to earn postsecondary credit to all pupils in grades 8, 9, 10, and 11. To assist the district in planning, a pupil must inform the district by October 30 or May 30 of each year of the pupil's intent to enroll in postsecondary courses during the following academic term. A pupil is bound by notifying or not notifying the district by October 30 or May 30.\nA pupil who first enrolls in grade 9 may not enroll in postsecondary courses under this section for secondary credit for more than the equivalent of four academic years. A pupil who first enrolls in grade 10 may not enroll in postsecondary courses under this section for secondary credit for more than the equivalent of three academic years. A pupil who first enrolls in grade 11 may not enroll in postsecondary courses under this section for secondary credit for more than the equivalent of two academic years. A pupil who first enrolls in grade 12 may not enroll in postsecondary courses under this section for secondary credit for more than the equivalent of one academic year. If a pupil in grade 9, 10, 11, or 12 first enrolls in a postsecondary course for secondary credit during the school year, the time of participation shall be reduced proportionately. If a pupil is in a learning year or other year-round program and begins each grade in the summer session, summer sessions shall not be counted against the time of participation. If a school district determines a pupil is not on track to graduate, the limit on participation does not apply to that pupil. A pupil who has graduated from high school cannot participate in a program under this section. A pupil who has completed course requirements for graduation but who has not received a diploma may participate in the program under this section.\n(a) A postsecondary institution must give priority to its postsecondary students when enrolling pupils in grades 10, 11, and 12 in its courses. A postsecondary institution may provide information about its programs to a secondary school or to a pupil or parent and it may advertise or otherwise recruit or solicit a secondary pupil to enroll in its programs on educational and programmatic grounds only except, notwithstanding other law to the contrary, and for the 2014-2015 through 2019-2020 school years only, an eligible postsecondary institution may advertise or otherwise recruit or solicit a secondary pupil residing in a school district with 700 students or more in grades 10, 11, and 12, to enroll in its programs on educational, programmatic, or financial grounds.\n(b) An institution must not enroll secondary pupils, for postsecondary enrollment options purposes, in remedial, developmental, or other courses that are not college level except when a student eligible to participate and enrolled in the graduation incentives program under section 124D.68 enrolls full time in a middle or early college program. A middle or early college program must be specifically designed to allow the student to earn dual high school and college credit with a well-defined pathway to allow the student to earn a postsecondary degree or credential. In this case, the student must receive developmental college credit and not college credit for completing remedial or developmental courses.\n(c) Once a pupil has been enrolled in any postsecondary course under this section, the pupil must not be displaced by another student.\n(d) If a postsecondary institution enrolls a secondary school pupil in a course under this section, the postsecondary institution also must enroll in the same course an otherwise enrolled and qualified postsecondary student who qualifies as a veteran under section 197.447, and demonstrates to the postsecondary institution's satisfaction that the institution's established enrollment timelines were not practicable for that student.\n(e) A postsecondary institution must allow secondary pupils to enroll in online courses under this section consistent with the institution's policy regarding postsecondary pupil enrollment in online courses.\n(a) An eligible pupil, according to subdivision 5, may enroll in a nonsectarian course taught by a secondary teacher or a postsecondary faculty member and offered at a secondary school, or another location, according to an agreement between a public school board and the governing body of an eligible public postsecondary system or an eligible private postsecondary institution, as defined in subdivision 3. All provisions of this section apply to a pupil, public school board, district, and the governing body of a postsecondary institution, except as otherwise provided. A secondary school and a postsecondary institution that enrolls eligible pupils in courses according to agreements must annually report to the commissioner the participation rates of pupils enrolled in courses according to agreements, including the number of pupils enrolled and the number of courses taken for postsecondary or dual credit.\n(b) To encourage students, especially American Indian students and students of color, to consider teaching as a profession, participating schools, school districts, and postsecondary institutions are encouraged to develop and offer an \"Introduction to Teaching\" or \"Introduction to Education\" course under this subdivision. For the purpose of applying for grants under this paragraph, \"eligible institution\" includes schools and districts that partner with an accredited college or university in addition to postsecondary institutions identified in subdivision 3, paragraph (a). Grant recipients under this paragraph must annually report to the commissioner in a form and manner determined by the commissioner on the participation rates of students in courses under this paragraph, including the number of students who apply for admission to colleges or universities with teacher preparation programs and the number of students of color and American Indian students who earned postsecondary credit. Grant recipients must also describe recruiting efforts intended to ensure that the percentage of participating students who are of color or American Indian meets or exceeds the overall percentage of students of color or American Indian students in the school.\nThe Office of Higher Education and the Department of Education shall collaborate in order to provide annual statewide evaluative information on concurrent enrollment programs to the legislature. The commissioners of the Office of Higher Education and the Department of Education, in consultation with stakeholders, including students and parents, must determine what student demographics and outcomes data are appropriate to include in the evaluation, and will use systems available to the office and department to minimize the reporting burden on postsecondary institutions. The commissioners must report by December 1, 2021, and each year thereafter, to the committees of the legislature with jurisdiction over early education through grade 12 and Minnesota State Colleges and Universities.\n(a) A postsecondary institution offering courses taught by the secondary teacher according to subdivision 10 must establish an advisory board. The purpose of the advisory board is to engage stakeholders in concurrent enrollment decisions. The duties of the board must include the following:\n(1) providing strategic advice and input relating to concurrent enrollment issues;\n(2) recommend and review proposals for concurrent enrollment course offerings;\n(3) serve as a coordinating entity between secondary education and postsecondary institutions; and\n(4) increase the understanding and collaboration among concurrent enrollment partners, stakeholders, the legislature, and the public.\n(b) The advisory board at each institution must consist of 16 members in addition to a concurrent enrollment faculty coordinator who shall serve as the chair and convene the meetings. A postsecondary institution may elect to have an advisory board of less than 16 members if the institution determines that the extent of its concurrent program warrants a smaller board. Except for the original members, advisory board members must serve three-year staggered terms. Advisory board members, appointed by the postsecondary institution, must be balanced based on geography and school size, and include, if practical, representatives from the following:\n(1) postsecondary faculty members;\n(2) school superintendents;\n(3) secondary and postsecondary students;\n(4) high school principals;\n(5) concurrent enrollment teachers;\n(6) high school counselors;\n(7) charter school administrators;\n(8) school board members;\n(9) secondary academic administrators;\n(10) parents; and\n(11) other local organizations.\n(c) Members of the board serve without compensation.\n(d) The board shall report to the postsecondary institution periodically as requested by the postsecondary institution to provide advice and proposals described in paragraph (a).\n(e) The postsecondary institution shall provide administrative services and meeting space for the board to do its work.\n(f) A board established under this section expires when the postsecondary institution no longer offers concurrent enrollment course offerings.\n(g) The postsecondary institution shall appoint the first members to the advisory board by October 31, 2015, or by October 15 following the year it establishes a concurrent enrollment program. The postsecondary institution shall designate the terms of the first members so that an approximately equal number serve terms of two, three, and four years.\nEnrolling in a course under this section shall not, by itself, prohibit a pupil from participating in activities sponsored by the pupil's high school.\n(a) A school district must allow a student enrolled in a course under this section to remain at the school site during regular school hours.\n(b) A school district must adopt a policy that provides a student enrolled in a course under this section with reasonable access during regular school hours to a computer and other technology resources that the student needs to complete coursework for a postsecondary enrollment course.\n(a) A pupil must not audit a course under this section.\n(b) A district must grant academic credit to a pupil enrolled in a course for secondary credit if the pupil successfully completes the course. Seven quarter or four semester college credits equal at least one full year of high school credit. Fewer college credits may be prorated. A district must also grant academic credit to a pupil enrolled in a course for postsecondary credit if secondary credit is requested by a pupil. If no comparable course is offered by the district, the district must, as soon as possible, notify the commissioner, who must determine the number of credits that must be granted to a pupil who successfully completes a course. If a comparable course is offered by the district, the school board must grant a comparable number of credits to the pupil. If there is a dispute between the district and the pupil regarding the number of credits granted for a particular course, the pupil may appeal the board's decision to the commissioner. The commissioner's decision regarding the number of credits is final.\n(c) A school board must adopt a policy regarding weighted grade point averages for any high school or dual enrollment course. A school board must adopt an identical policy regarding weighted grade point averages for credits earned via postsecondary coursework as it gives to credits earned via concurrent enrollment coursework. The policy must state whether the district offers weighted grades. A school board must annually publish on its website a list of courses for which a student may earn a weighted grade.\n(d) The secondary credits granted to a pupil must be counted toward the graduation requirements and subject area requirements of the district. Evidence of successful completion of each course and secondary credits granted must be included in the pupil's secondary school record. A pupil must provide the school with a copy of the pupil's grades in each course taken for secondary credit under this section, including interim or nonfinal grades earned during the academic term. Upon the request of a pupil, the pupil's secondary school record must also include evidence of successful completion and credits granted for a course taken for postsecondary credit. In either case, the record must indicate that the credits were earned at a postsecondary institution.\n(e) If a pupil enrolls in a postsecondary institution after leaving secondary school, the postsecondary institution must award postsecondary credit for any course successfully completed for secondary credit at that institution. Other postsecondary institutions may award, after a pupil leaves secondary school, postsecondary credit for any courses successfully completed under this section. An institution may not charge a pupil for the award of credit.\n(f) The Board of Trustees of the Minnesota State Colleges and Universities and the Board of Regents of the University of Minnesota must, and private nonprofit and proprietary postsecondary institutions should, award postsecondary credit for any successfully completed courses in a program certified by the National Alliance of Concurrent Enrollment Partnerships offered according to an agreement under subdivision 10. Consistent with section 135A.101, subdivision 3, all MnSCU institutions must give full credit to a secondary pupil who completes for postsecondary credit a postsecondary course or program that is part or all of a goal area or a transfer curriculum at a MnSCU institution when the pupil enrolls in a MnSCU institution after leaving secondary school. Once one MnSCU institution certifies as completed a secondary student's postsecondary course or program that is part or all of a goal area or a transfer curriculum, every MnSCU institution must consider the student's course or program for that goal area or the transfer curriculum as completed.\nFor a pupil enrolled in a course under this section, the department must make payments according to this subdivision for courses that were taken for secondary credit.\nThe department must not make payments to a school district or postsecondary institution for a course taken for postsecondary credit only. The department must not make payments to a postsecondary institution for a course from which a student officially withdraws during the first ten business days of the postsecondary institution's quarter or semester or who has been absent from the postsecondary institution for the first ten business days of the postsecondary institution's quarter or semester and is not receiving instruction in the home or hospital.\nA postsecondary institution shall receive the following:\n(1) for an institution granting quarter credit, the reimbursement per credit hour shall be an amount equal to 88 percent of the product of the formula allowance minus $425, multiplied by 1.2, and divided by 45; or\n(2) for an institution granting semester credit, the reimbursement per credit hour shall be an amount equal to 88 percent of the product of the general revenue formula allowance minus $425, multiplied by 1.2, and divided by 30.\nThe department must pay to each postsecondary institution 100 percent of the amount in clause (1) or (2) within 45 days of receiving initial enrollment information each quarter or semester. If changes in enrollment occur during a quarter or semester, the change shall be reported by the postsecondary institution at the time the enrollment information for the succeeding quarter or semester is submitted. At any time the department notifies a postsecondary institution that an overpayment has been made, the institution shall promptly remit the amount due.\nA pupil enrolled in a postsecondary course for secondary credit is not eligible for any state student financial aid under chapter 136A for that course.\n[Repealed, 1Sp2003 c 9 art 9 s 10]\n(a) The agreement between a board and the governing body of a public postsecondary system or private postsecondary institution shall set forth the payment amounts and arrangements, if any, from the board to the postsecondary institution. No payments shall be made by the department according to subdivision 13. For the purpose of computing state aids for a district, a pupil enrolled according to subdivision 10 shall be counted in the average daily membership of the district as though the pupil were enrolled in a secondary course that is not offered in connection with an agreement. Nothing in this subdivision shall be construed to prohibit a public postsecondary system or private postsecondary institution from receiving additional state funding that may be available under any other law.\n(b) If a course is provided under subdivision 10, offered at a secondary school, and taught by a secondary teacher, the postsecondary system or institution must not require a payment from the school board that exceeds the cost to the postsecondary institution that is directly attributable to providing that course.\nFor an alternative pupil enrolled in a course or program under this section, the Department of Education shall make payments to the eligible institution according to subdivision 13. The department shall not make any payments to a school district for alternative pupils.\nA nonpublic secondary institution must proportionately adjust its tuition to accurately reflect the time an alternative pupil spends in a postsecondary enrollment course or program.\nA postsecondary institution that receives reimbursement for a pupil under subdivision 13 may not charge that pupil for fees, textbooks, materials, support services as defined in section 135A.16, or other necessary costs of the course or program in which the pupil is enrolled if the charge would be prohibited under section 123B.37, except for equipment purchased by the pupil that becomes the property of the pupil. An institution may require the pupil to pay for fees, textbooks, and materials for a course taken for postsecondary credit.\nAll textbooks and equipment provided to a pupil, and paid for under subdivision 13, are the property of the pupil's postsecondary institution. Each pupil is required to return all textbooks and equipment to the postsecondary institution after the course has ended.\nThe postsecondary institution must inform the pupil of the support services available at that institution. If the student has an individualized education program that provides general education support and accommodations, the postsecondary institution must provide the support services as described in the student's IEP and the postsecondary institution and the district shall negotiate an agreement on the rate to be charged for the services. Nothing in this section shall prevent the student from enrolling while the agreement is being developed. If the parties cannot agree on the services, on application of either party, the commissioner shall resolve the dispute in the same manner the commissioner fixes tuition rates under section 125A.11. The commissioner's decision is binding on both parties.\n(a) A parent or guardian of a pupil enrolled in a course for secondary credit may apply to the pupil's district of residence for reimbursement for transporting the pupil between the secondary school in which the pupil is enrolled or the pupil's home and the postsecondary institution that the pupil attends. The state shall provide state aid to a district in an amount sufficient to reimburse the parent or guardian for the necessary transportation costs when the family's or guardian's income is at or below the poverty level, as determined by the federal government. The reimbursement shall be the pupil's actual cost of transportation or 15 cents per mile traveled, whichever is less. Reimbursement may not be paid for more than 250 miles per week. However, if the nearest postsecondary institution is more than 25 miles from the pupil's resident secondary school, the weekly reimbursement may not exceed the reimbursement rate per mile times the actual distance between the secondary school or the pupil's home and the nearest postsecondary institution times ten. The state must pay aid to the district according to this subdivision.\n(b) A parent or guardian of an alternative pupil enrolled in a course for secondary credit may apply to the pupil's postsecondary institution for reimbursement for transporting the pupil between the secondary school in which the pupil is enrolled or the pupil's home and the postsecondary institution in an amount sufficient to reimburse the parent or guardian for the necessary transportation costs when the family's or guardian's income is at or below the poverty level, as determined by the federal government. The amount of the reimbursement shall be determined as in paragraph (a). The state must pay aid to the postsecondary institution according to this subdivision.\n[Repealed, 2012 c 239 art 1 s 34]\nThe provisions of subdivisions 13, 19, and 22 shall not apply for any postsecondary courses in which a pupil is enrolled in addition to being enrolled full time in that pupil's district or for any postsecondary course in which a pupil is enrolled for postsecondary credit. The pupil is enrolled full time if the pupil attends credit-bearing classes in the high school or high school program for all of the available hours of instruction.\nA pupil who is enrolled in a secondary school that is located 40 miles or more from the nearest eligible institution may request that the resident district offer at least one accelerated or advanced academic course within the resident district in which the pupil may enroll for postsecondary credit. A pupil may enroll in a course offered under this subdivision for either secondary or postsecondary credit according to subdivision 12.\nA district must offer an accelerated or advanced academic course for postsecondary credit if one or more pupils requests such a course under this subdivision. The district may decide which course to offer, how to offer the course, and whether to offer one or more courses. The district must offer at least one such course in the next academic period and must continue to offer at least one accelerated or advanced academic course for postsecondary credit in later academic periods.\nA pupil enrolled in a secondary school that is located less than 40 miles from the nearest eligible institution may enroll in a postsecondary course provided at the secondary school.",
	"repealed": false
}