{
	"id": "15B.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.24",
	"title": "15B.24 CAPITOL AREA TAX-FORFEITED LANDS.",
	"text": "This section governs the treatment of tax-forfeited lands in the Capitol Area. Section 383A.17 relating to Ramsey County also may apply.\nWhen the state gains custody of a tax-forfeited parcel in the Capitol Area, the state's fee ownership of the parcel held in trust for the state's taxing subdivisions must be recorded in the county recorder's office.\nThen, the Ramsey County Board must submit to the CAAPB the property description of the parcel with a list of the structures on the parcel.\n(a) Within 90 calendar days after receiving the county board's submission, the CAAPB may either:\n(1) direct the commissioner of revenue to release the tax-forfeited parcel from the trust for the taxing subdivisions of the state, thus vesting unencumbered title to the property in the name of the state; or\n(2) authorize the parcel to be disposed of according to chapter 282, but only if the parcel is then used in accordance with some or all of the standards, policies, and guidelines of the comprehensive plan.\n(b) If the CAAPB fails to act on the parcel within the 90 days, the parcel's disposition is governed by chapter 282.\nA conveyance under subdivision 4, paragraph (a), clauses (1) and (2), is subject to the restrictive easements that the CAAPB determines to be necessary to implement the comprehensive plan.\n(a) Until the parcel is released from the trust and during the 90-day period referred to in subdivision 4, the county board has the authority to maintain the parcel to minimize risk to persons and to contiguous property.\n(b) If the parcel is released from the trust and conveyed unencumbered to the state, the commissioner of administration must maintain the parcel.\n(a) When the board directs the commissioner of revenue to release a parcel under subdivision 4, paragraph (a), clause (1):\n(1) the commissioner of revenue must release the parcel from the trust in favor of the taxing jurisdiction of the state; and\n(2) on executing the release, the commissioner of revenue must certify the release to the county auditor.\n(b) The attorney general must prescribe the forms of the release and the certificate described in paragraph (a).",
	"repealed": false
}