{
	"id": "52.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.09",
	"title": "52.09 DIRECTORS; POWERS AND DUTIES.",
	"text": "At their first meeting, and annually thereafter at the first meeting following the annual meeting of members, the directors shall elect from their own number a president, vice president, and from their own number or otherwise a treasurer, and secretary, of whom the last two named may be the same individual, and the directors may engage such other employees as may be necessary to properly conduct the business of the credit union.\nThe directors shall manage the affairs of the credit union and shall:\n(1) act on applications for membership. This power may be delegated to a membership chair who serves at the pleasure of the board of directors and is subject to its rules. An application must contain a certification signed by the membership chair or a member of the board showing the basis of membership;\n(2) determine interest rates on loans and on deposits. The interest period on deposits may be on a daily, monthly, quarterly, semiannual, or annual basis, and may be paid on all deposits whether or not the deposits have been withdrawn during the interest period. Interest may be computed on a daily basis;\n(3) fix the amount of the surety bond required of all officers and employees handling money;\n(4) declare dividends and transmit to the members recommended amendments to the bylaws;\n(5) fill vacancies in the board and in the credit committee until successors are chosen and qualify at the next annual meeting;\n(6) limit the number of shares and deposits which may be owned by a member, not to exceed ten percent of the outstanding shares and deposits, or $2,000, whichever is larger, and the maximum individual loan which can be made with and without security, including liability indirectly as a comaker, guarantor, or endorser to ten percent of outstanding shares and deposits. The ten percent share and deposit limitation is not applicable to the Minnesota corporate credit union, or to credit unions insured by the National Credit Union Administration;\n(7) have charge of investments including loans to members. If a credit committee is established pursuant to section 52.08 or clause (13), then the credit committee shall have charge of loans to members;\n(8) fix the salaries of the treasurer and other employees, which must be on a fixed monthly or annual basis, in dollars (not percentage);\n(9) designate the depository institution in which the funds of the credit union will be deposited;\n(10) authorize the officers of the credit union to borrow money from any source, as provided in section 52.15;\n(11) with the permission of the commissioner of commerce, suspend any member of the credit committee or supervisory committee if it deems this action necessary to the proper conduct of the credit union, and call the members together to act on the suspension within a reasonable time after the suspension. The members at the meeting may, by majority vote of those present, sustain the suspension and remove the committee members permanently or may reinstate the committee members;\n(12) provide financial assistance to the supervisory committee in carrying out its audit responsibilities;\n(13) if the bylaws so provide and no credit committee has been elected pursuant to section 52.08, appoint a credit manager or a credit committee of not less than three members; and\n(14) to establish different classes of shares.\nThe duties of the officers shall be as determined in the bylaws, except that the treasurer may be the general manager. No member of the board, the supervisory committee or an elected credit committee shall receive a salary as such, but may be reimbursed for necessary expenses incurred while serving in such capacity and may be compensated for time actually spent in official duties at an hourly rate as determined by the annual meeting of members. Provision of reasonable health, accident, and similar insurance protection shall not be considered compensation, and is subject to approval by the membership.\nNotwithstanding the other provisions of this chapter, the bylaws may provide that the position of president and vice-president of the directors as set forth in this chapter be designated chair of the board and vice-chair, and if so designated, the position of manager or general manager as set forth in this chapter may be designated president, and one or more vice-presidents may be appointed. If the position of manager or general manager is designated president pursuant to this section, the treasurer may be the president. A change of titles pursuant to this section does not change the powers and duties of the position.\nA director's personal liability to the credit union or its members for monetary damages for breach of fiduciary duty as a director may be eliminated or limited in the bylaws. The bylaws shall not eliminate or limit liability of a director:\n(1) for breach of the director's duty of loyalty to the credit union or its members;\n(2) for acts or omissions not in good faith or that involve intentional misconduct or a knowing violation of law;\n(3) for a transaction from which the director derived an improper personal benefit; or\n(4) for an act or omission occurring prior to the date when the provision in the bylaws eliminating or limiting liability becomes effective.",
	"repealed": false
}