{
	"id": "142D.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.21",
	"title": "142D.21 GREAT START COMPENSATION SUPPORT PAYMENTS.",
	"text": "The commissioner of children, youth, and families shall establish and administer the great start compensation support payment program to provide eligible child care and early learning programs with payments to improve access to early care and learning in Minnesota and to strengthen the ability of programs to recruit and retain early educators.\n(a) The following programs are eligible to receive payments under this section:\n(1) family and group family child care homes licensed under Minnesota Rules, chapter 9502;\n(2) child care centers licensed under Minnesota Rules, chapter 9503;\n(3) certified license-exempt child care centers under chapter 142C;\n(4) Tribally licensed child care programs; and\n(5) other programs as determined by the commissioner.\n(b) To be eligible, programs must not be:\n(1) the subject of a finding of fraud for which the program or individual is currently serving a penalty or exclusion;\n(2) the subject of suspended, denied, or terminated payments to a provider under section 142E.17, subdivision 9, paragraph (d), clauses (1) and (2); 142E.51, subdivision 7, paragraph (c), clause (4); or 256.98, subdivision 1, regardless of whether the action is under appeal;\n(3) prohibited from receiving public funds under section 142A.12, regardless of whether the action is under appeal; or\n(4) under license revocation, suspension, temporary immediate suspension, or decertification, regardless of whether the action is under appeal.\n(a) As a condition of payment under this section, a program must:\n(1) complete an application developed by the commissioner for each payment period for which the program applies for funding;\n(2) submit data on child enrollment and attendance to the commissioner in the form and manner specified by the commissioner; and\n(3) attest and agree in writing that the program was open and operating and served a minimum number of children, as determined by the commissioner, during the funding period, with the exceptions of:\n(i) service disruptions that are necessary to protect the safety and health of children and child care programs based on public health guidance issued by the Centers for Disease Control and Prevention, the commissioner of health, the commissioner of children, youth, and families, or a local public health agency; and\n(ii) planned temporary closures for provider vacation and holidays during each payment period. The commissioner must establish the maximum allowed duration for vacations and holidays.\n(b) A program must expend money received under this section no later than six months after the date the payment was received.\n(c) A program that receives a payment under this section must comply with all requirements listed in the application. The commissioner must establish methods to determine that the application requirements have been met.\n(a) A program that receives a payment under this section must keep accurate and legible records of the following:\n(1) use of money;\n(2) staff employment, compensation, and benefits, which must include time sheets or other records of daily hours worked; documentation of compensation and benefits; documentation of written changes to employees' rate or rates of pay and basis thereof as a result of payments received under this section, as required under section 181.032, paragraphs (d) to (f); and any other records required to be maintained under section 177.30; and\n(3) attendance. Daily attendance records must be completed every day and must include the date, the first and last name of each child in attendance, and the time each child is dropped off at and picked up from the program. To the extent possible, the person dropping off or picking up the child must enter the times.\n(b) The requirement to document compensation and benefits under paragraph (a), clause (2), applies to family and group family child care homes only if a payment received under this section is used for employee compensation or benefits.\n(c) Records identified in paragraph (a) must be retained at the site where services are delivered for six years after the date of receipt of payment and must be made immediately available to the commissioner upon request. Any records not provided to the commissioner at the date and time of request are deemed inadmissible if offered as evidence by a program in any proceeding to contest an overpayment or disqualification of the program.\nA program that receives a payment under this section that fails to meet the requirements of this section is subject to discontinuation of future installment payments, recovery of overpayments, and actions under sections 142E.50 to 142E.58. Except when based on a finding of fraud, actions to establish an overpayment must be made within six years of receipt of the payments. Once an overpayment is established, collection may continue until money has been repaid in full. The appeal process under section 142E.18 applies to actions taken for failure to meet the requirements of this section.\n(a) The commissioner shall provide payments under this section to all eligible programs on a noncompetitive basis. The payment amounts shall be based on the number of full-time equivalent staff who regularly care for children in the program, including any employees, sole proprietors, or independent contractors.\n(b) For purposes of this section, \"one full-time equivalent\" is defined as an individual caring for children 32 hours per week. An individual can count as more or less than one full-time equivalent staff, but as no more than two full-time equivalent staff.\n(c) The commissioner must establish an amount to award per full-time equivalent individual who regularly cares for children in the program.\n(d) Payments must be increased by ten percent for programs receiving child care assistance payments under section 142E.08 or 142E.17 or early learning scholarships under section 142D.25, or for programs located in a child care access equity area. The commissioner must develop a method for establishing child care access equity areas. For purposes of this section, \"child care access equity area\" means an area with low access to child care, high poverty rates, high unemployment rates, low homeownership rates, and low median household incomes.\n(e) The commissioner shall establish the form, frequency, and manner for making payments under this section.\n(a) Child care centers licensed under Minnesota Rules, chapter 9503, certified license-exempt child care centers under chapter 142C, and Tribally licensed child care centers must use money received under this section to pay for increases in compensation, benefits, premium pay, or additional federal taxes assessed on the compensation of employees as a result of paying increased compensation or premium pay to all paid employees or independent contractors regularly caring for children.\n(b) Family and group family child care homes licensed under Minnesota Rules, chapter 9502, and Tribally licensed family child care homes must use money received under this section for one or more of the following purposes:\n(1) paying personnel costs, such as payroll, salaries, or similar compensation; employee benefits; premium pay; or financial incentives for recruitment and retention for an employee, a sole proprietor, or an independent contractor;\n(2) paying rent, including rent under a lease agreement, or making payments on any mortgage obligation, utilities, facility maintenance or improvements, property taxes, or insurance;\n(3) purchasing or updating equipment, supplies, goods, or services;\n(4) providing mental health supports for children; or\n(5) purchasing training or other professional development.\n(a) Legal nonlicensed child care providers, as defined in section 142E.01, subdivision 19, are eligible to apply for a payment of up to $500 for costs incurred before the first month when payments from the child care assistance program are issued.\n(b) A payment received under this subdivision must be used for one or more of the following activities:\n(1) purchasing or updating equipment, supplies, goods, or services; or\n(2) purchasing training or other professional development.\n(c) The commissioner shall determine the form and manner of the application for a payment under this subdivision.\nBy January 1 each year, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over child care and early learning the number of payments provided to programs and related outcomes since the last report. This subdivision expires January 31, 2033.\nMoney appropriated under this section is available until expended.",
	"repealed": false
}