{
	"id": "43A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.37",
	"title": "43A.37 PAYROLLS.",
	"text": "The appointing authority shall ensure that all employees have been appointed as required by law, rules, or administrative procedures and that the salary or compensation is within the compensation plan fixed by law. The appointing authority shall ensure that all employees are performing service as required by law. This provision does not apply to positions defined in section 43A.08, subdivision 1, clauses (8), (9), (10), and (12). Employees to whom this subdivision does not apply may be paid on the state's payroll system, and the appointing authority or fiscal officer submitting their payroll register is responsible for the accuracy and legality of the payments.\nSalary or compensation claims presented against existing appropriations, which have been deemed in violation of the provisions of this subdivision, may be certified for payment if, upon investigation, the commissioner determines the personal services for which payment is claimed actually have been rendered in good faith without collusion and without intent to defraud.\nAny sum intentionally paid contrary to the provisions of this section may be recovered from any employee making the appointments in contravention of the provisions of law or the rules, or from any employee signing or countersigning or authorizing the signing or countersigning of any warrant for the payment of the sum, or from the sureties on the official bond of any employee, in an action maintained by the commissioner in the district court of any county within the state. All money recovered in any action brought under this section when collected shall be paid into the state treasury.\nAny person appointed contrary to the provisions of this chapter and the rules, whose payroll or account is refused certification, shall have an action against the employee employing or appointing or attempting to appoint the person for the amount due by reason of the employment or purported employment and the costs of the action. No employee, during the time of official service, or thereafter, shall be reimbursed by the state for any sum recovered in any court action under subdivision 2.",
	"repealed": false
}