{
	"id": "16A.661",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.661",
	"title": "16A.661 GENERAL OBLIGATION SPECIAL TAX BONDS.",
	"text": "When authorized by law enacted in accordance with the constitution, article XI, sections 5 and 7, the commissioner may by order sell and issue general obligation special tax bonds of the state evidencing public debt incurred for any purpose stated in the law. The bonds are payable primarily from the proceeds of special taxes appropriated to special tax bond debt service accounts established in subdivision 3 and other money on hand in that fund from time to time; however, the bonds are general obligations of the state, and the full faith and credit of the state are pledged for their payment.\nThe bonds must be issued and sold in accordance with section 16A.641, except that the maturities of the bonds and the interest rates applicable to the bonds must be fixed so that the principal and interest coming due in the 1987-1989 biennium on all bonds outstanding at any time does not exceed $46,750,000. Sections 16A.672 and 16A.675 apply to the bonds.\n(a) There is established within the state bond fund a separate and special account designated as a general obligation special tax bond debt service account. There must be credited to this debt service account in each fiscal year from the tobacco tax revenue fund established in section 297F.10 an amount sufficient to increase the balance on hand in the debt service account on each December 1 to an amount equal to the full amount of principal and interest to come due on all outstanding bonds whose debt service is payable primarily from proceeds of the tax to and including the second following July 1. The money on hand in the debt service account must be used solely for the payment of the principal of, and interest on, the bonds, and is appropriated for this purpose. This appropriation does not cancel as long as any of the bonds remain outstanding.\n(b) There is established within the state bond fund a separate and special account designated as a general obligation special tax bond debt service account. There must be credited to this debt service account in each fiscal year from the sports and health club sales tax revenue fund established in section 297A.94 an amount sufficient to increase the balance on hand in the debt service account on each December 1 to an amount equal to the full amount of principal and interest to come due on all outstanding bonds whose debt service is payable primarily from proceeds of the tax to and including the second following July 1. The money on hand in the debt service account must be used solely for the payment of the principal of, and interest on, the bonds, and is appropriated for this purpose. This appropriation does not cancel as long as any of the bonds remain outstanding.\nThere is annually appropriated to the general obligation special tax bond debt service accounts from the general fund the amount that, added to the amount in the general obligation special tax bond debt service accounts on December 1 each year, after giving effect to subdivision 3, is equal to the full amount of principal and interest to come due on all bonds to and including July 1 in the second ensuing year.\nUnder the constitution, article XI, section 7, the state auditor must levy each year on all taxable property within the state a tax sufficient, with the amount then on hand in the general obligation special tax bond debt service accounts, to pay all principal and interest on the bonds due and to become due to and including July 1 in the second ensuing year. The tax is not subject to limit as to rate or amount. However, the amount of money appropriated from other sources as provided in subdivisions 3 and 4, and actually received and on hand before the levy in any year, reduces the amount of the tax otherwise required to be levied. The proceeds of the tax must be credited to the appropriate general obligation special tax bond debt service account.\n[Repealed, 1990 c 610 art 1 s 59]\nThe proceeds of the bonds must be deposited and spent as provided in this subdivision and are appropriated for those purposes. Any accrued interest and any premium received on the sale of the bonds, and any amount of bond proceeds determined by the commissioner to be needed to pay interest payable on the bonds up to 18 months following their issuance, must be credited to the appropriate general obligation special tax bond debt service account. Except as otherwise required by law, the balance of the bond proceeds shall be credited to the bond proceeds fund and spent for the purposes specified in the law authorizing the issuance of the bonds. So much of the proceeds as is necessary must be used to pay costs incurred in issuing and selling the bonds.",
	"repealed": false
}