{
	"id": "72A.204",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.204",
	"title": "72A.204 PROHIBITED USES OF SENIOR-SPECIFIC CERTIFICATIONS AND PROFESSIONAL DESIGNATIONS.",
	"text": "The purpose of this section is to set forth standards to protect consumers from misleading and fraudulent marketing practices with respect to the use of senior-specific certifications and professional designations in:\n(1) the solicitation, sale, or purchase of a life insurance or annuity product; or\n(2) the provision of advice in connection with the solicitation, sale, or purchase of a life insurance or annuity product.\nFor purposes of this section, \"insurance producer\" means a person required to be licensed under the laws of this state to sell, solicit, or negotiate insurance, including annuities.\n(a) It is an unfair and deceptive act or practice in the business of insurance for an insurance producer to use a senior-specific certification or professional designation that indicates or implies in such a way as to mislead a client or prospective client that the insurance producer has special certification or training in advising or servicing seniors in connection with the solicitation, sale, or purchase of a life insurance or annuity product or in the provision of advice as to the value of or the advisability of purchasing or selling a life insurance or annuity product, either directly or indirectly, including the provision of advice through publications or writings or by issuing or promulgating analyses or reports related to a life insurance or annuity product.\n(b) The prohibited use of senior-specific certifications or professional designations includes, but is not limited to, the following:\n(1) use of a certification or professional designation by an insurance producer who has not actually earned or is otherwise ineligible to use such certification or designation;\n(2) use of a nonexistent or self-conferred certification or professional designation;\n(3) use of a certification or professional designation that indicates or implies a level of occupational qualifications obtained through education, training, or experience that the insurance producer using the certification or designation does not have; and\n(4) use of a certification or professional designation that was obtained from a certifying or designating organization that:\n(i) is primarily engaged in the business of instruction in sales or marketing;\n(ii) does not have reasonable standards or procedures for ensuring the competency of its certificants or designees;\n(iii) does not have reasonable standards or procedures for monitoring and disciplining its certificants or designees for improper or unethical conduct; or\n(iv) does not have reasonable continuing education requirements for its certificants or designees in order to maintain the certificate or designation.\n(c) There is a rebuttable presumption that a certifying or designating organization is not disqualified solely for the purposes of paragraph (b), clause (4), when the certification or designation issued from the organization does not primarily apply to sales or marketing and when the organization or the certification or designation in question has been accredited by:\n(1) the American National Standards Institute (ANSI);\n(2) the National Commission for Certifying Agencies; or\n(3) any organization that is on the United States Department of Education list entitled \"Accrediting Agencies Recognized for Title IV Purposes.\"\n(d) In determining whether a combination of words or an acronym standing for a combination of words constitutes a certification or professional designation indicating or implying that a person has special certification or training in advising or servicing seniors, factors to be considered must include:\n(1) use of one or more words such as \"senior,\" \"retirement,\" \"elder,\" or like words combined with one or more words such as \"certified,\" \"registered,\" \"chartered,\" \"adviser,\" \"specialist,\" \"consultant,\" \"planner,\" or like words, in the name of the certification or professional designation; and\n(2) the manner in which those words are combined.\n(e) For purposes of this section, a job title within an organization that is licensed or registered by a state or federal financial services regulatory agency is not a certification or professional designation, unless it is used in a manner that would confuse or mislead a reasonable consumer, when the job title:\n(1) indicates seniority or standing within the organization; or\n(2) specifies an individual's area of specialization within the organization.\n(f) For purposes of paragraph (e), \"financial services regulatory agency\" includes, but is not limited to, an agency that regulates insurers, insurance producers, broker-dealers, investment advisers, or investment companies as defined under the Investment Company Act of 1940.",
	"repealed": false
}