{
	"id": "518A.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.84",
	"title": "518A.84 CHILD SUPPORT INCENTIVES.",
	"text": "[Repealed, 1993 c 340 s 60; 1Sp1993 c 6 s 35]\n[Repealed, 1993 c 340 s 60; 1Sp1993 c 6 s 35]\n[Repealed, 1993 c 340 s 60; 1Sp1993 c 6 s 35]\n[Repealed, 1993 c 340 s 60; 1Sp1993 c 6 s 35]\n[Repealed, 1Sp2011 c 9 art 1 s 35]\n[Repealed, 1Sp2011 c 9 art 1 s 35]\n[Repealed, 1Sp2011 c 9 art 1 s 35]\n[Repealed, 2010 c 200 art 1 s 21]\n[Repealed, 1997 c 203 art 6 s 93]\n[Repealed, 1Sp2011 c 9 art 1 s 35]\n(a) The commissioner of children, youth, and families shall distribute to the counties the earned federal child support incentive payments using the methodology specified in Title IV-D of the Social Security Act and applicable federal regulations for earning federal incentives by the states except for the paternity portion of the incentive. The commissioner shall distribute the federal paternity incentive earned using the IV-D paternity establishment percentage. The commissioner shall follow the federal transition plans in distributing the incentives to the counties. The commissioner shall distribute to the county child support agency estimated federal incentive payments within 60 days after the end of each calendar quarter. The commissioner shall issue actual federal incentive payments to the county agency within 60 days of receiving the final federal incentive grant award from the federal agency.\n(b) The county child support agency shall reinvest incentive funds disbursed under this section in the county child support enforcement program. These funds may not be used by a county to reduce funding of the child support enforcement program by the amount of the incentive earned below the base amount allowed under the applicable federal regulations. The county agency shall maintain a record of incentives earned and expended according to a procedure approved by the commissioner. The county agency shall repay any incentive erroneously issued.",
	"repealed": false
}