{
	"id": "15.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.99",
	"title": "15.99 TIME DEADLINE FOR AGENCY ACTION.",
	"text": "(a) For purposes of this section, the following terms shall have the meanings given.\n(b) \"Agency\" means a department, agency, board, commission, or other group in the executive branch of state government; a statutory or home rule charter city, county, town, or school district; any metropolitan agency or regional entity; and any other political subdivision of the state.\n(c) \"Request\" means a written application related to zoning, septic systems, watershed district review, soil and water conservation district review, or the expansion of the metropolitan urban service area, for a permit, license, or other governmental approval of an action. A request must be submitted in writing to the agency on an application form provided by the agency, if one exists. The agency may reject as incomplete a request not on a form of the agency if the request does not include information required by the agency. A request not on a form of the agency must clearly identify on the first page the specific permit, license, or other governmental approval being sought. No request shall be deemed made if not in compliance with this paragraph.\n(d) \"Applicant\" means a person submitting a request under this section. An applicant may designate a person to act on the applicant's behalf regarding a request under this section and any action taken by or notice given to the applicant's designee related to the request shall be deemed taken by or given to the applicant.\n(a) Except as otherwise provided in this section, section 462.358, subdivision 3b, or 473.175, or chapter 505, and notwithstanding any other law to the contrary, an agency must approve or deny within 60 days a written request relating to zoning, septic systems, watershed district review, soil and water conservation district review, or expansion of the metropolitan urban service area for a permit, license, or other governmental approval of an action. Failure of an agency to deny a request within 60 days is approval of the request. If an agency denies the request, it must state in writing the reasons for the denial at the time that it denies the request.\n(b) When a vote on a resolution or properly made motion to approve a request fails for any reason, the failure shall constitute a denial of the request provided that those voting against the motion state on the record the reasons why they oppose the request. A denial of a request because of a failure to approve a resolution or motion does not preclude an immediate submission of a same or similar request.\n(c) Except as provided in paragraph (b), if an agency, other than a multimember governing body, denies the request, it must state in writing the reasons for the denial at the time that it denies the request. If a multimember governing body denies a request, it must state the reasons for denial on the record and provide the applicant in writing a statement of the reasons for the denial. If the written statement is not adopted at the same time as the denial, it must be adopted at the next meeting following the denial of the request but before the expiration of the time allowed for making a decision under this section. The written statement must be consistent with the reasons stated in the record at the time of the denial. The written statement must be provided to the applicant upon adoption.\n(a) The time limit in subdivision 2 begins upon the agency's receipt of a written request containing all information required by law or by a previously adopted rule, ordinance, or policy of the agency, including the applicable application fee. If an agency receives a written request that does not contain all required information, the 60-day limit starts over only if the agency sends written notice within 15 business days of receipt of the request telling the requester what information is missing.\n(b) If a request relating to zoning, septic systems, watershed district review, soil and water conservation district review, or expansion of the metropolitan urban service area requires the approval of more than one state agency in the executive branch, the 60-day period in subdivision 2 begins to run for all executive branch agencies on the day a request containing all required information is received by one state agency. The agency receiving the request must forward copies to other state agencies whose approval is required.\n(c) An agency response, including an approval with conditions, meets the 60-day time limit if the agency can document that the response was sent within 60 days of receipt of the written request. Failure to satisfy the conditions, if any, may be a basis to revoke or rescind the approval by the agency and will not give rise to a claim that the 60-day limit was not met.\n(d) The time limit in subdivision 2 is extended if a state statute, federal law, or court order requires a process to occur before the agency acts on the request, and the time periods prescribed in the state statute, federal law, or court order make it impossible to act on the request within 60 days. In cases described in this paragraph, the deadline is extended to 60 days after completion of the last process required in the applicable statute, law, or order. Final approval of an agency receiving a request is not considered a process for purposes of this paragraph.\n(e) The time limit in subdivision 2 is extended if: (1) a request submitted to a state agency requires prior approval of a federal agency; or (2) an application submitted to a city, county, town, school district, metropolitan or regional entity, or other political subdivision requires prior approval of a state or federal agency. In cases described in this paragraph, the deadline for agency action is extended to 60 days after the required prior approval is granted.\n(f) An agency may extend the time limit in subdivision 2 before the end of the initial 60-day period by providing written notice of the extension to the applicant. The notification must state the reasons for the extension and its anticipated length, which may not exceed 60 days unless approved by the applicant.\n(g) An applicant may by written notice to the agency request an extension of the time limit under this section.",
	"repealed": false
}