{
	"id": "84.0265",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.0265",
	"title": "84.0265 ENVIRONMENTAL REVIEW AND PERMITTING; COORDINATED PROJECT PLANS.",
	"text": "In this section, the following terms have the meanings given:\n(1) \"commissioner\" means the commissioner of natural resources;\n(2) \"coordinated project plan\" or \"plan\" means a plan to ensure that any required environmental review and associated required state agency actions are completed efficiently by coordinating and establishing deadlines for all necessary state agency actions;\n(3) \"eligible project\" means a project that requires the commissioner to prepare an environmental assessment worksheet or an environmental impact statement under chapter 116D and associated permits, unless the project is sponsored by the Department of Natural Resources; and\n(4) \"state agency\" means the department or any other office, board, commission, authority, department, or other agency of the executive branch of state government.\nIt is the goal of the state to maximize the coordination, effectiveness, transparency, and accountability of environmental review, associated environmental permitting, and other regulatory actions for facilities in Minnesota.\nTo the extent practicable, the commissioner must establish and provide an expeditious process for a person that requests to confer with the department and other state agencies about an eligible project. The department must provide information about any identified challenging issues regarding the potential environmental impacts related to an eligible project, including any issues that could substantially delay a state agency from completing agency decisions; and issues that must be addressed before an environmental assessment worksheet, environmental impact statement, final scoping decision, permit action, or other required action by a state agency can be started.\n(a) A person who submits an application for an eligible project to the commissioner may request that the commissioner prepare a coordinated project plan to complete any required environmental review and associated agency actions for the eligible project.\n(b) Within 60 days of receiving a request under paragraph (a), the commissioner must prepare a coordinated project plan in consultation with the requestor and other state agencies identified under paragraph (c). If an eligible project requires or otherwise includes the preparation of an environmental impact statement, the commissioner is required to prepare a coordinated project plan that first covers the period through a final scoping decision. Within 60 days of completion of the final scoping decision, the commissioner must update the coordinated project plan to include the remainder of the environmental review process as well as applicable state permits and other state regulatory decisions. The coordinated project plan is subject to modification in accordance with subdivision 7.\n(c) Any state agency that must make permitting or other regulatory decisions over the eligible project must participate in developing a coordinated project plan.\n(d) If an eligible project requires environmental review and the Department of Natural Resources is the responsible governmental unit, then the Department of Natural Resources is the lead agency responsible for preparation of a coordinated project plan under this section. If an eligible project requires environmental review and the Pollution Control Agency is the responsible governmental unit, then the Pollution Control Agency is the lead agency responsible for preparation of a coordinated project under section 116.035.\n(a) A coordinated project plan must include:\n(1) a list of all state agencies known to have environmental review, permitting, or other regulatory authority over the eligible project and an explanation of each agency's specific role and responsibilities for actions under the coordinated project plan;\n(2) a schedule for any formal public meetings; and\n(3) a comprehensive schedule of deadlines by which all environmental reviews, permits, and other state agency actions must be completed. The deadlines established under this clause must include intermediate and final completion deadlines for actions by each state agency and must be consistent with subdivision 6, subject to modification in accordance with subdivision 7.\n(b) The commissioner must update a coordinated project plan quarterly.\n(a) Deadlines established in a coordinated project plan must comply with this subdivision, unless an alternative time period is agreed upon by the commissioner and proposer.\n(b) When an environmental assessment worksheet is prepared for an eligible project for which an environmental impact statement is not mandatory under Minnesota Rules, chapter 4410, the decision on the need for an environmental impact statement must be made as expeditiously as possible but no later than 18 months after the environmental assessment worksheet is deemed complete by the commissioner.\n(c) When an environmental impact statement is prepared for an eligible project, the decision on the adequacy of the final environmental impact statement must be made as expeditiously as possible but no later than four years after the data submitted for the environmental assessment worksheet is deemed complete.\n(d) If the commissioner includes plan deadlines that are inconsistent with paragraphs (b) and (c), then within 30 days of finalizing the plan, the commissioner must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over natural resources policy to explain how deadlines were established and why the deadlines under paragraphs (b) and (c) are not attainable.\n(a) A state agency that participates in the commissioner's development coordinated project plan must comply with deadlines established in the plan. If a participating state agency fails to meet a deadline established in the coordinated project plan or anticipates failing to meet a deadline, the state agency must immediately notify the commissioner to explain the reason for the failure or anticipated failure and to propose a date for a modified deadline.\n(b) The commissioner may modify a deadline established in the coordinated project plan if the project proposer fails to meet a deadline established in the coordinated project plan or provides inadequate information to meet that deadline, or if:\n(1) the commissioner provides the person that requested the plan with a written justification for the modification; and\n(2) the commissioner and the state agency, after consultation with the person that requested the plan, mutually agree on a different deadline.\n(c) If the combined modifications to one or more deadlines established in a coordinated project plan extend the initially anticipated final decision date for an eligible project application by more than 20 percent, the commissioner must report to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over natural resources policy within 30 days to explain the reason the modifications are necessary. The commissioner must also notify the chairs and ranking minority members within 30 days of any subsequent extensions to the final decision date. The notification must include the reason for the extension and the history of any prior extensions. For purposes of calculating the percentage of time that modifications have extended the anticipated final decision date, modifications made necessary by reasons wholly outside the control of state agencies must not be considered.\nAs part of the annual permitting efficiency report required under section 84.027, the commissioner must report on progress toward required actions described in this section.\nNothing in this section is to be construed to require an act that conflicts with applicable state or federal law. Nothing in this section affects the specific statutory obligations of a state agency to comply with criteria or standards of environmental quality, water resource management, pollutant management, environmental justice, and public health.",
	"repealed": false
}