{
	"id": "62L.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.20",
	"title": "62L.20 TRANSFER OF RISK.",
	"text": "A health carrier participating in the association may transfer up to 90 percent of the risk above a reinsurance threshold of $5,000 of eligible charges resulting from issuance of a health benefit plan to an eligible employee or dependent of a small employer group whose risk has been prospectively ceded to the association. If the eligible charges exceed $55,000, a health carrier participating in the association may transfer 100 percent of the risk each policy year not to exceed 12 months.\nSatisfaction of the reinsurance threshold must be determined by the board of directors based on discounted eligible charges. The board may establish an audit process to assure consistency in the submission of charge calculations by health carriers to the association. The association shall determine the amount to be paid to the health carrier for claims submitted based on discounted eligible charges. The board may also establish upper limits on the amount paid by the association based on a usual and customary determination. The board shall establish in the plan of operation a procedure for determining the discounted eligible charge.\nThe board shall establish a standardized conversion table for determining equivalent charges for health carriers that use alternative provider reimbursement methods. If a health carrier establishes to the board that the health carrier's conversion factor is equivalent to the association's standardized conversion table, the association shall accept the health carrier's conversion factor.\nThe board shall establish criteria for changing the threshold amount or retention percentage. The board shall review the criteria on an annual basis. The board shall provide the members with an opportunity to comment on the criteria at the time of the annual review.\nA participating health carrier must notify the association, within 90 days of receipt of proof of loss, of satisfaction of a reinsurance threshold. After satisfaction of the reinsurance threshold, a health carrier continues to be liable to its providers, eligible employees, and dependents for payment of claims in accordance with the health carrier's health benefit plan. Health carriers shall not pend or delay payment of otherwise valid claims due to the transfer of risk to the association.\nThe board shall, on a biennial basis, prepare and submit a report to the commissioner of commerce on the effect of the reinsurance association on the small employer market. The first study must be presented to the commissioner no later than January 1, 1995, and must specifically address whether there has been disruption in the small employer market due to unnecessary churning of groups for the purpose of obtaining reinsurance and whether it is appropriate for health carriers to transfer the risk of their existing small group business to the reinsurance association. After two years of operation, the board shall study both the effect of ceding both individuals and entire small groups of seven or fewer eligible employees to the reinsurance association and the composition of the board and determine whether the initial appointments reflect the types of health carriers participating in the reinsurance association and whether the voting power of members of the association should be weighted and recommend any necessary changes.",
	"repealed": false
}