{
	"id": "518A.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.66",
	"title": "518A.66 OCCUPATIONAL LICENSE SUSPENSION.",
	"text": "(a) Upon motion of an obligee, if the court finds that the obligor is or may be licensed by a licensing board listed in section 214.01 or other state, county, or municipal agency or board that issues an occupational license and the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority, the court shall direct the licensing board or other licensing agency to suspend the license under section 214.101. The court's order must be stayed for 90 days in order to allow the obligor to execute a written payment agreement pursuant to section 518A.69. The payment agreement must be approved by either the court or the public authority responsible for child support enforcement. If the obligor has not executed or is not in compliance with a written payment agreement pursuant to section 518A.69 after the 90 days expires, the court's order becomes effective. If the obligor is a licensed attorney, the court shall report the matter to the Lawyers Professional Responsibility Board for appropriate action in accordance with the Rules of Professional Conduct. The remedy under this section is in addition to any other enforcement remedy available to the court.\n(b) If a public authority responsible for child support enforcement finds that the obligor is or may be licensed by a licensing board listed in section 214.01 or other state, county, or municipal agency or board that issues an occupational license and the obligor is in arrears in court-ordered child support or maintenance payments or both in an amount equal to or greater than three times the obligor's total monthly support and maintenance payments and is not in compliance with a written payment agreement pursuant to section 518A.69 that is approved by the court, a child support magistrate, or the public authority, the court or the public authority shall direct the licensing board or other licensing agency to suspend the license under section 214.101. If the obligor is a licensed attorney, the public authority may report the matter to the Lawyers Professional Responsibility Board for appropriate action in accordance with the Rules of Professional Conduct. The remedy under this section is in addition to any other enforcement remedy available to the public authority.\n(c) At least 90 days before notifying a licensing authority or the Lawyers Professional Responsibility Board under paragraph (b), the public authority shall mail a written notice to the license holder addressed to the license holder's last known address that the public authority intends to seek license suspension under this section and that the license holder must request a hearing within 30 days in order to contest the suspension. If the license holder makes a written request for a hearing within 30 days of the date of the notice, a court hearing or a hearing under section 484.702 must be held. Notwithstanding any law to the contrary, the license holder must be served with 14 days' notice in writing specifying the time and place of the hearing and the allegations against the license holder. The notice may be served personally or by mail. If the public authority does not receive a request for a hearing within 30 days of the date of the notice, and the obligor does not execute a written payment agreement pursuant to section 518A.69 that is approved by the public authority within 90 days of the date of the notice, the public authority shall direct the licensing board or other licensing agency to suspend the obligor's license under paragraph (b), or shall report the matter to the Lawyers Professional Responsibility Board.\n(d) The public authority or the court shall notify the Lawyers Professional Responsibility Board for appropriate action in accordance with the Rules of Professional Responsibility Conduct or order the licensing board or licensing agency to suspend the license if the judge finds that:\n(1) the person is licensed by a licensing board or other state agency that issues an occupational license;\n(2) the person has not made full payment of arrearages found to be due by the public authority; and\n(3) the person has not executed or is not in compliance with a payment plan approved by the court, a child support magistrate, or the public authority.\n(e) Within 15 days of the date on which the obligor either makes full payment of arrearages found to be due by the court or public authority or executes and initiates good faith compliance with a written payment plan approved by the court, a child support magistrate, or the public authority, the court, a child support magistrate, or the public authority responsible for child support enforcement shall notify the licensing board or licensing agency or the Lawyers Professional Responsibility Board that the obligor is no longer ineligible for license issuance, reinstatement, or renewal under this section.\n(f) In addition to the criteria established under this section for the suspension of an obligor's occupational license, a court, a child support magistrate, or the public authority may direct the licensing board or other licensing agency to suspend the license of a party who has failed, after receiving notice, to comply with a subpoena relating to a paternity or child support proceeding. Notice to an obligor of intent to suspend must be served by first class mail at the obligor's last known address. The notice must inform the obligor of the right to request a hearing. If the obligor makes a written request within ten days of the date of the hearing, a hearing must be held. At the hearing, the only issues to be considered are mistake of fact and whether the obligor received the subpoena.\n(g) The license of an obligor who fails to remain in compliance with an approved written payment agreement may be suspended. Prior to suspending a license for noncompliance with an approved written payment agreement, the public authority must mail to the obligor's last known address a written notice that (1) the public authority intends to seek suspension of the obligor's occupational license under this paragraph, and (2) the obligor must request a hearing, within 30 days of the date of the notice, to contest the suspension. If, within 30 days of the date of the notice, the public authority does not receive a written request for a hearing and the obligor does not comply with an approved written payment agreement, the public authority must direct the licensing board or other licensing agency to suspend the obligor's license under paragraph (b), and, if the obligor is a licensed attorney, must report the matter to the Lawyers Professional Responsibility Board. If the obligor makes a written request for a hearing within 30 days of the date of the notice, a court hearing must be held. Notwithstanding any law to the contrary, the obligor must be served with 14 days' notice in writing specifying the time and place of the hearing and the allegations against the obligor. The notice may be served personally or by mail to the obligor's last known address. If the obligor appears at the hearing and the court determines that the obligor has failed to comply with an approved written payment agreement, the court or public authority must notify the occupational licensing board or other licensing agency to suspend the obligor's license under paragraph (b) and, if the obligor is a licensed attorney, must report the matter to the Lawyers Professional Responsibility Board. If the obligor fails to appear at the hearing, the court or public authority must notify the occupational licensing board or other licensing agency to suspend the obligor's license under paragraph (b), and if the obligor is a licensed attorney, must report the matter to the Lawyers Professional Responsibility Board.",
	"repealed": false
}