{
	"id": "162.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.13",
	"title": "162.13 FORMULA FOR APPORTIONMENT TO CITIES.",
	"text": "After deducting for administrative costs and for the disaster fund and research account as heretofore provided, the remainder of the total sum provided for in section 162.12, subdivision 1, shall be identified as the apportionment sum, and shall be apportioned by the commissioner to the cities having a population of 5,000 or more, in accordance with the following formula:\n(1) An amount equal to 50 percent of such apportionment sum shall be apportioned among the cities having a population of 5,000 or more so that each such city shall receive of such amount the percentage that its money needs bears to the total money needs of all such cities.\n(2) An amount equal to 50 percent of such apportionment sum shall be apportioned among the cities having a population of 5,000 or more so that each such city shall receive of such amount the percentage that its population bears to the total population of all such cities. For purposes of this subdivision, the population of a city is the greater of 5,000 or the number calculated under section 162.09, subdivision 4, paragraph (a), (b), (c), (d), or (e).\nFor the purpose of this section, money needs of each city having a population of 5,000 or more are defined as the estimated cost of constructing and maintaining over a period of 25 years the municipal state-aid street system located and established by such city. Right-of-way costs and drainage shall be included in money needs. Lighting costs and other costs incidental to construction and maintenance, or a specified portion of those costs, as set forth in the commissioner's rules, may be included in determining money needs. To avoid variances in costs due to differences in construction and maintenance policy, construction and maintenance costs shall be estimated on the basis of the engineering standards developed cooperatively by the commissioner and the engineers, or a committee thereof, of the cities.\nOn or before September 1 of each year, the engineer of each city having a population of 5,000 or more shall update the city's data and forward to the commissioner all information relating to the money needs of the city that the commissioner deems necessary in order to apportion the municipal state-aid street fund in accordance with the apportionment formula under this section. Upon receipt of the information, the commissioner shall appoint a board of city engineers. The board shall be composed of the following:\n(1) two city engineers from the metropolitan district;\n(2) one city engineer from each nonmetropolitan district; and\n(3) one city engineer from each city of the first class.\nThe board shall investigate and review the information submitted by each city. On or before November 1 of each year, the board shall submit its findings and recommendations in writing as to each city's money needs to the commissioner on a form prepared by the commissioner. Final determination of the money needs of each city shall be made by the commissioner. In the event that any city shall fail to submit the required information, the commissioner shall estimate the money needs of the city. The estimate shall be used in solving the apportionment formula. The commissioner may withhold payment of the amount apportioned to the city until the information is submitted.",
	"repealed": false
}