{
	"id": "256B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.02",
	"title": "256B.02 DEFINITIONS.",
	"text": "[Repealed, 1987 c 363 s 14]\n[Repealed, 1987 c 363 s 14]\n[Repealed, 1987 c 363 s 14]\n\"Medical institution\" means any licensed medical facility that receives a license from the Minnesota Health Department or Department of Human Services or appropriate licensing authority of this state, any other state, or a Canadian province.\n\"State agency\" means the commissioner of human services.\n\"County agency\" means a local social service agency operating under and pursuant to the provisions of chapter 393.\n(a) \"Vendor of medical care\" means any person or persons furnishing, within the scope of the vendor's respective license, any or all of the following goods or services: medical, surgical, hospital, ambulatory surgical center services, optical, visual, dental and nursing services; drugs and medical supplies; appliances; laboratory, diagnostic, and therapeutic services; nursing home and convalescent care; screening and health assessment services provided by public health nurses as defined in section 145A.02, subdivision 18; health care services provided at the residence of the patient if the services are performed by a public health nurse and the nurse indicates in a statement submitted under oath that the services were actually provided; and such other services or supplies provided or prescribed by persons authorized by state law to give such services and supplies. The term includes, but is not limited to, directors and officers of corporations or members of partnerships who, either individually or jointly with another or others, have the legal control, supervision, or responsibility of submitting claims for reimbursement to the medical assistance program. The term only includes directors and officers of corporations who personally receive a portion of the distributed assets upon liquidation or dissolution, and their liability is limited to the portion of the claim that bears the same proportion to the total claim as their share of the distributed assets bears to the total distributed assets.\n(b) \"Vendor of medical care\" also includes any person who is credentialed as a health professional under standards set by the governing body of a federally recognized Indian tribe authorized under an agreement with the federal government according to United States Code, title 25, section 450f, to provide health services to its members, and who through a tribal facility provides covered services to American Indian people within a contract health service delivery area of a Minnesota reservation, as defined under Code of Federal Regulations, title 42, section 36.22.\n(c) A federally recognized Indian tribe that intends to implement standards for credentialing health professionals must submit the standards to the commissioner of human services, along with evidence of meeting, exceeding, or being exempt from corresponding state standards. The commissioner shall maintain a copy of the standards and supporting evidence, and shall use those standards to enroll tribal-approved health professionals as medical assistance providers. For purposes of this section, \"Indian\" and \"Indian tribe\" mean persons or entities that meet the definition in United States Code, title 25, section 450b.\n\"Medical assistance\" or \"medical care\" means payment of part or all of the cost of the care and services identified in section 256B.0625, for eligible individuals whose income and resources are insufficient to meet all of this cost.\n[Renumbered 256B.0625, subdivision 1]\n[Renumbered 256B.0625, subd 2]\n[Renumbered 256B.0625, subd 3]\n[Renumbered 256B.0625, subd 4]\n[Renumbered 256B.0625, subd 5]\n[Renumbered 256B.0625, subd 6]\n[Renumbered 256B.0625, subd 7]\n[Renumbered 256B.0625, subd 8]\n[Renumbered 256B.0625, subd 9]\n[Renumbered 256B.0625, subd 10]\n[Renumbered 256B.0625, subd 11]\n[Renumbered 256B.0625, subd 12]\n[Renumbered 256B.0625, subd 13]\n[Renumbered 256B.0625, subd 14]\n[Renumbered 256B.0625, subd 15]\n[Renumbered 256B.0625, subd 16]\n[Renumbered 256B.0625, subd 17]\n[Renumbered 256B.0625, subd 18]\n[Renumbered 256B.0625, subd 19]\n[Renumbered 256B.0625, subd 20]\n[Renumbered 256B.0625, subd 21]\n[Renumbered 256B.0625, subd 22]\n[Renumbered 256B.0625, subd 23]\n[Renumbered 256B.0625, subd 24]\n[Renumbered 256B.0625, subd 25]\n\"Private health care coverage\" means any plan regulated by chapter 62A, 62C, or 64B. Private health care coverage also includes any self-insured plan providing health care benefits, pharmacy benefit manager, service benefit plan, managed care organization, and other parties that are by contract legally responsible for payment of a claim for a health care item or service for an individual receiving medical benefits under this chapter or chapter 256L.\n\"Automobile accident coverage\" means any plan, or that portion of a plan, regulated under chapter 65B, which provides benefits for medical expenses incurred in an automobile accident.\n\"Related condition\" means a condition:\n(1) that is found to be closely related to a developmental disability, including but not limited to cerebral palsy, epilepsy, autism, fetal alcohol spectrum disorder, and Prader-Willi syndrome; and\n(2) that meets all of the following criteria:\n(i) is severe and chronic;\n(ii) results in impairment of general intellectual functioning or adaptive behavior similar to that of persons with developmental disabilities;\n(iii) requires treatment or services similar to those required for persons with developmental disabilities;\n(iv) is manifested before the person reaches 22 years of age;\n(v) is likely to continue indefinitely;\n(vi) results in substantial functional limitations in three or more of the following areas of major life activity:\n(A) self-care;\n(B) understanding and use of language;\n(C) learning;\n(D) mobility;\n(E) self-direction; or\n(F) capacity for independent living; and\n(vii) is not attributable to mental illness as defined in section 245.462, subdivision 20, or an emotional disturbance as defined in section 245.4871, subdivision 15. For purposes of this item, notwithstanding section 245.462, subdivision 20, or 245.4871, subdivision 15, \"mental illness\" does not include autism or other pervasive developmental disorders.\n\"Third-party payer\" means a person, entity, or agency or government program that has a probable obligation to pay all or part of the costs of a medical assistance recipient's health services. Third-party payer includes an entity under contract with the recipient to cover all or part of the recipient's medical costs.\n\"Prepaid health plan\" means a vendor who receives a capitation payment and assumes financial risk for the provision of medical assistance services under a contract with the commissioner.\n\"Group health plan\" means any plan of, or contributed to by, an employer, including a self-insured plan, to provide health care directly or otherwise to the employer's employees, former employees, or the families of the employees or former employees, and includes continuation coverage pursuant to title XXII of the Public Health Service Act, section 4980B of the Internal Revenue Code of 1986, or title VI of the Employee Retirement Income Security Act of 1974.\n\"Cost-effective\" means that the amount paid by the state for premiums, coinsurance, deductibles, other cost-sharing obligations under a health insurance plan, and other administrative costs is likely to be less than the amount paid for an equivalent set of services paid by medical assistance.\n\"Termination\" or \"terminate\" for a provider means a state Medicaid program, state children's health insurance program, or Medicare program has taken an action to revoke the provider's billing privileges, the provider has exhausted all appeal rights or the timeline for appeal has expired, there is no expectation by the provider, Medicaid program, state children's health insurance program, or Medicare program that the revocation is temporary, the provider will be required to reenroll to reinstate billing privileges, and the termination occurred for cause, including fraud, integrity, or quality.\n\"Affordable Care Act\" means the federal Patient Protection and Affordable Care Act, Public Law 111-148, as amended, including the federal Health Care and Education Reconciliation Act of 2010, Public Law 111-152, and any amendments to, and any federal guidance or regulations issued under, these acts.\n\"Caretaker relative\" means a relative, by blood, adoption, or marriage, of a child under age 19 with whom the child is living and who assumes primary responsibility for the child's care.\n\"Insurance affordability program\" means one of the following programs:\n(1) medical assistance under this chapter;\n(2) a program that provides advance payments of the premium tax credits established under section 36B of the Internal Revenue Code or cost-sharing reductions established under section 1402 of the Affordable Care Act;\n(3) MinnesotaCare as defined in chapter 256L; and\n(4) a Basic Health Plan as defined in section 1331 of the Affordable Care Act.",
	"repealed": false
}