{
	"id": "383D.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/383D.23",
	"title": "383D.23 JURISDICTION: POSITIONS OF LISTED APPOINTERS; EXCLUSIONS.",
	"text": "(a) Except for the positions excluded under subdivisions 2 and 3, the jurisdiction of a department created pursuant to section 383D.21 shall include every county public employment position for which the appointing authority is:\n(1) the county board;\n(2) the local social services agency;\n(3) the county human services board;\n(4) an elected county official;\n(5) an appointed county department head; or\n(6) a commission or board appointed by the county board.\n(b) All positions within the jurisdiction of the department are classified.\nThe following are excluded from the jurisdiction of the department and are unclassified:\n(1) positions filled by election;\n(2) positions for which a county or district court judge is the appointing authority;\n(3) positions designated by the county board or by law as department heads and filled by the county board;\n(4) positions designated by the county board or by law as department heads and filled by a board or commission appointed by the county board;\n(5) one chief or principal assistant designated by each department head;\n(6) one personal secretary designated by each elected department; and\n(7) assistant county attorneys, student law clerks, or special investigators in the employ of the county attorney.\n(a) At the option of the county board, the following may be excluded from the jurisdiction of the department:\n(1) any positions subject to merit systems established or authorized pursuant to sections 12.22, subdivision 3, 256.012, and 387.31 to 387.45 or federal law;\n(2) positions designated as temporary or seasonal;\n(3) special deputies and volunteers serving without pay;\n(4) students in training; and\n(5) positions that meet the following criteria:\n(i) exclusion is consistent with other law relating specifically to that department;\n(ii) the position is that of a supervisor or department assistant who would report directly to the department head or the chief deputy or principal assistant of the department head and be a part of the department head's management team; and\n(iii) the duties of the position involve significant discretion and substantial involvement in the development, interpretation, and implementation of department policy.\n(b) The employee relations director shall certify whether the designation is consistent with the standards and criteria in this section. The county board may appeal certification decisions to the personnel board of appeals.\nAn appointing authority may appoint an employee to the unclassified service in accordance with this subdivision. Positions in the unclassified service are not required to be filled by competitive examination but shall be subject to an open application and screening process. An employee in the unclassified service is entitled to all fringe and compensation benefits afforded to similarly situated employees in the classified service such as, but not limited to, vacation leaves, holiday leave, health care insurance, and other benefits as determined by the county board.\nAn appointing authority may employ on a temporary basis juveniles who have been ordered by the juvenile court to make monetary restitution or pay a fine as a condition of probation without complying with this section.",
	"repealed": false
}