{
	"id": "124D.4536",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.4536",
	"title": "124D.4536 CAREER AND TECHNICAL EDUCATION CONSORTIUM GRANTS.",
	"text": "\"Career and technical education (CTE) consortium\" means a voluntary collaboration of the Minnesota Service Cooperatives and other regional public and private partners, including school districts, intermediate school districts, vocational cooperatives, and higher education institutions, that work together to provide career and technical education opportunities for students.\n(a) A CTE consortium must:\n(1) develop career pathways for students;\n(2) develop new career and technical programs that focus on the industry sectors that fuel the regional economy;\n(3) facilitate the development of highly trained and knowledgeable students who are equipped with technical and workplace skills needed by regional employers;\n(4) improve access to career and technical education programs for students by developing public and private partnerships with labor, business, and industry leaders and by increasing coordination of high school and postsecondary program options;\n(5) increase family and student awareness of the availability and benefit of career and technical education courses and training opportunities; and\n(6) provide industry-level equipment and technologies supporting skill development as identified by CTE consortia partners.\n(b) In addition to the requirements in paragraph (a), a CTE consortium may:\n(1) address the teacher shortage crisis in career and technical education through incentive funding and training programs;\n(2) provide professional development for training teachers in curriculum and skill development in focus areas identified by CTE consortia partners; and\n(3) provide transportation reimbursement grants to provide equitable opportunities throughout the region for students to participate in career and technical education.\nThe Minnesota Service Cooperatives must establish a career and technical education advisory committee to provide advice on the administration of a CTE consortium.\nA CTE consortium may receive other sources of funds to supplement state funding. All funds received must be administered by the Minnesota Service Cooperatives.\nBy January 15 of each year, a CTE consortium receiving funding under this section must submit an annual report on the progress of its activities to the commissioner of education and the chairs and ranking minority members of the legislative committees with jurisdiction over secondary and postsecondary education. The annual report must contain a financial report for the preceding fiscal year.\nThe Minnesota Service Cooperatives serves as the fiscal host for grants awarded under this section. The Minnesota Service Cooperatives may consult with the commissioner to award grants to any CTE consortium that qualifies under this section.",
	"repealed": false
}