{
	"id": "120B.306#stat.120B.306.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.306#stat.120B.306.1",
	"title": "120B.306 DISTRICT ASSESSMENT REQUIREMENTS.",
	"text": "(a) For students in grades 1 through 6, the cumulative total amount of time spent taking locally adopted districtwide or schoolwide assessments must not exceed ten hours per school year. For students in grades 7 through 12, the cumulative total amount of time spent taking locally adopted districtwide or schoolwide assessments must not exceed 11 hours per school year. For purposes of this paragraph, international baccalaureate and advanced placement exams are not considered locally adopted assessments.\n(b) A district or charter school is exempt from the requirements of paragraph (a), if the district or charter school, in consultation with the exclusive representative of the teachers or other teachers if there is no exclusive representative of the teachers, decides to exceed a time limit in paragraph (a) and includes the information in the report required under section 120B.11, subdivision 5.\n(c) A district or charter school must publish on its website a comprehensive calendar of standardized tests to be administered in the district or charter school during that school year. The calendar must provide the rationale for administering each assessment and indicate whether the assessment is a local option or required by state or federal law. The calendar must be published at least one week prior to any eligible assessments being administered but no later than October 1.\n(a) A school district that does not have an agreement between the school board and the exclusive representative of the teachers about selecting assessments must establish a district assessment committee to advise the school board on administering standardized assessments to students in addition to the assessments required under sections 120B.30 and 120B.302 and applicable federal law unless paragraph (b) applies. The committee must include an equal number of teachers and administrators and at least one parent of a student in the district and may include at least one representative from each school site in the district.\n(b) A school district may seek this assessment advice from the district advisory committee under section 120B.11, subdivision 3, instead of establishing a committee under this section.",
	"repealed": false
}