{
	"id": "3.885",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.885",
	"title": "3.885 LEGISLATIVE COMMISSION ON PLANNING AND FISCAL POLICY.",
	"text": "The Legislative Commission on Planning and Fiscal Policy consists of nine members of the senate appointed by the Subcommittee on Committees of the Committee on Rules and Administration and nine members of the house of representatives appointed by the speaker. Vacancies on the commission are filled in the same manner as original appointments. The commission shall elect a chair and a vice-chair from among its members. The chair alternates between a member of the senate and a member of the house of representatives in January of each odd-numbered year.\n[Repealed, 1995 c 248 art 2 s 8]\nMembers of the commission are compensated as provided by section 3.101.\n[Repealed, 1995 c 248 art 2 s 8]\nAll departments, agencies, and education institutions of the executive and judicial branches must comply with a request of the commission for information, data, estimates, and statistics on the funding revenue operations, and other affairs of the department, agency, or education institution. The commissioner of management and budget and the commissioner of revenue shall provide the commission with full and free access to information, data, estimates, and statistics in the possession of the Management and Budget and Revenue Departments on the state budget, revenue, expenditures, and tax expenditures.\n(a) The commission shall:\n(1) provide the legislature with research and analysis of current and projected state revenue, state expenditures, and state tax expenditures;\n(2) provide the legislature with a report analyzing the governor's proposed levels of revenue and expenditures for biennial budgets submitted under section 16A.11 as well as other supplemental budget submittals to the legislature by the governor;\n(3) provide an analysis of the impact of the governor's proposed revenue and expenditure plans for the next biennium;\n(4) conduct research on matters of economic and fiscal policy and report to the legislature on the result of the research;\n(5) provide economic reports and studies on the state of the state's economy, including trends and forecasts for consideration by the legislature;\n(6) conduct budget and tax studies and provide general fiscal and budgetary information;\n(7) review and make recommendations on the operation of state programs in order to appraise the implementation of state laws regarding the expenditure of funds and to recommend means of improving their efficiency;\n(8) recommend to the legislature changes in the mix of revenue sources for programs, in the percentage of state expenditures devoted to major programs, and in the role of the legislature in overseeing state government expenditures and revenue projections;\n(9) make a continuing study and investigation of the building needs of the government of the state of Minnesota, including, but not limited to the following: the current and future requirements of new buildings, the maintenance of existing buildings, rehabilitating and remodeling of old buildings, the planning for administrative offices, and the exploring of methods of financing building and related costs; and\n(10) conduct a continuing study of state-local finance, analyzing and making recommendations to the legislature on issues including levels of state support for political subdivisions, basic levels of local need, balances of local revenues and options, relationship of local taxes to individuals' ability to pay, and financial reporting by political subdivisions. In conducting this study, the commission shall consult with the governor, the staff of executive branch agencies, and the governor's Advisory Commission on State-Local Relations.\n(b) In performing its duties under paragraph (a), the commission shall consider, among other things:\n(1) the relative dependence on state tax revenues, federal funds, and user fees to support state-funded programs, and whether the existing mix of revenue sources is appropriate, given the purposes of the programs;\n(2) the relative percentages of state expenditures that are devoted to major programs such as education, assistance to local government, aid to individuals, state agencies and institutions, and debt service; and\n(3) the role of the legislature in overseeing state government expenditures, including legislative appropriation of money from the general fund, legislative appropriation of money from funds other than the general fund, state agency receipt of money into revolving and other dedicated funds and expenditure of money from these funds, and state agency expenditure of federal funds.\n(c) The commission's recommendations must consider the long-term needs of the state. The recommendations must not duplicate work done by standing committees of the senate and house of representatives.\nThe commission shall report to the legislature on its activities and recommendations by January 15 of each odd-numbered year.\nThe commission shall provide the public with printed and electronic copies of reports and information for the legislature. Copies must be provided at the actual cost of furnishing each copy.\n[Repealed, 1995 c 248 art 2 s 8]\n[Repealed, 1995 c 248 art 2 s 8]\n[Repealed, 1995 c 248 art 2 s 8]\n[Repealed, 1990 c 604 art 10 s 32]\n[Repealed, 2013 c 142 art 3 s 37]\n(a) By September 1 of each odd-numbered year, the commission shall compile a list of executive branch advisory groups created in statute. The commission may develop a schedule for review of advisory groups, or may select particular groups for review. By December 31 of each odd-numbered year, the commission may make recommendations on the continuing need for certain advisory groups, and on any changes in laws governing a group that are needed to improve the group's efficiency and effectiveness.\n(b) In conducting reviews of executive branch advisory groups, the commission shall consider:\n(1) the mission of each group, and the extent to which the mission has been satisfied;\n(2) the extent to which each advisory group is effective in allowing persons interested in the program or activity for which the group provides advice to have input into the operations of the state agency implementing the program or activity;\n(3) the extent to which the existence of the advisory group provides state agencies with an efficient and effective means of obtaining expert advice and opinions;\n(4) whether there are more efficient and effective methods of accomplishing the mission of the advisory group; and\n(5) whether the work of the advisory group overlaps or duplicates the work of other groups.",
	"repealed": false
}