{
	"id": "299C.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.68",
	"title": "299C.68 BACKGROUND CHECK ON RESIDENTIAL BUILDING MANAGER.",
	"text": "Before hiring a manager, an owner shall request the superintendent to conduct a background check under this section. An owner may employ a manager after requesting a background check under this section before receipt of the background check report, provided that the owner complies with section 299C.69. An owner may request a background check for a currently employed manager under this section. By July 1, 1996, an owner shall request the superintendent to conduct a background check under this section for managers hired before July 1, 1995, who are currently employed.\nThe superintendent shall develop procedures to enable an owner to request a background check to determine whether a manager is the subject of a reported conviction for a background check crime. The superintendent shall perform the background check by retrieving and reviewing data on background check crimes. The superintendent shall notify the owner in writing of the results of the background check. If the manager has resided in Minnesota for less than ten years or upon request of the owner, the superintendent shall also either: (1) conduct a search of the national criminal records repository, including the criminal justice data communications network; or (2) conduct a search of the criminal justice data communications network records in the state or states where the manager has resided for the preceding ten years. The superintendent is authorized to exchange fingerprints with the Federal Bureau of Investigation for purposes of the criminal history check. The superintendent shall recover the cost of a background check through a fee charged to the owner.\n(a) The superintendent shall develop a standardized form to be used for requesting a background check, which must include:\n(1) a notification to the manager that the owner will request the superintendent to perform a background check under this section;\n(2) a notification to the manager of the manager's rights under subdivision 4; and\n(3) a signed consent by the manager to conduct the background check.\n(b) If the manager has resided in Minnesota for less than ten years, or if the owner is requesting a search of the national criminal records repository, the form must be accompanied by the fingerprints of the manager on whom the background check is to be performed.\n(a) The owner shall notify the manager of the manager's rights under paragraph (b).\n(b) A manager who is the subject of a background check request has the following rights:\n(1) the right to be informed that the owner will request a background check on the manager to determine whether the manager has been convicted of a crime specified in section 299C.67, subdivision 2;\n(2) the right to be informed by the owner of the superintendent's response to the background check and to obtain from the owner a copy of the background check report;\n(3) the right to obtain from the superintendent any record that forms the basis for the report;\n(4) the right to challenge the accuracy and completeness of information contained in the report or record under section 13.04, subdivision 4; and\n(5) the right to be informed by the owner if the manager's application to be employed by the owner or to continue as an employee has been denied because of the result of the background check.\nThe superintendent shall respond in writing to a background check request within a reasonable time not to exceed ten working days after receiving the signed form under subdivision 3. The superintendent's response from the search of the Minnesota computerized criminal history system must clearly indicate whether the manager has ever been convicted of a background check crime and, if so, a description of the crime, date and jurisdiction of the conviction, and date of discharge of sentence. If a search is being done of the national criminal records repository, the superintendent shall determine eligibility based upon national records received. The superintendent shall reply to the owner in writing indicating whether the manager is or is not eligible for employment.\n(a) An owner may satisfy the requirements of this section: (1) by obtaining a copy of a completed background check that was required to be performed by the Department of Human Services as provided for under section 144.057 and chapter 245C, and then placing the copy on file with the owner; (2) in the case of a background check performed on a manager for one residential setting when multiple residential settings are operated by one owner, by placing the results in a central location; or (3) by obtaining a background check from a private business or a local law enforcement agency rather than the superintendent if the scope of the background check provided by the private business or local law enforcement agency is at least as broad as that of a background check performed by the superintendent and the response to the background check request occurs within a reasonable time not to exceed ten working days after receiving the signed form described in subdivision 3. Local law enforcement agencies may access the criminal justice data network to perform the background check.\n(b) A private business or local law enforcement agency providing a background check under this section must use a notification form similar to the form described in subdivision 3, except that the notification form must indicate that the background check will be performed by the private business or local law enforcement agency using records of the superintendent and other data sources.",
	"repealed": false
}