{
	"id": "18C.401",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.401",
	"title": "18C.401 GENERAL LICENSING AND REGISTRATION CONDITIONS.",
	"text": "The commissioner may require a person applying for a license or registration to manufacture or distribute a product for use in this state to submit authentic experimental evidence or university research data to substantiate the claims made for the product. The commissioner may rely on experimental data, evaluations, or advice furnished by experts at the University of Minnesota as evidence to substantiate claims and may accept or reject additional sources of evidence in evaluating a fertilizer, soil amendment, or plant amendment. The experimental evidence must relate to conditions in this state for which the product is intended. The commissioner may also require evidence of value when used as directed or recommended.\nIf the commissioner determines that the evidence submitted does not substantiate the product's usefulness in this state, the commissioner may require the applicant to submit samples, conduct tests, or submit additional information, including conditions affecting performance, to evaluate the product's performance and usefulness.\nThe commissioner may refuse to license a person or register a specialty fertilizer, soil amendment, or plant amendment if:\n(1) the application for license or registration is not complete;\n(2) the commissioner determines that the fertilizer, soil amendment, plant amendment, or other additive with substantially the same contents will not or is not likely to produce the results or effects claimed if used as directed;\n(3) the commissioner determines that the fertilizer, soil amendment, plant amendment, or other additive with substantially the same contents is not useful in this state; or\n(4) the facility does not properly safeguard for bulk storage.\n(a) After reviewing an application accompanied by the application fee, the commissioner may issue a conditional license or registration:\n(1) to prevent unreasonable adverse effects on the environment; or\n(2) if the commissioner determines that the applicant needs the license or registration to accumulate information necessary to substantiate claims; or\n(3) to correct minor label violations.\n(b) The commissioner may prescribe terms, conditions, and a limited period of time for the conditional license or registration.\n(c) The commissioner may revoke or modify a conditional license or registration if the commissioner finds that the terms or conditions are being violated or are inadequate to avoid unreasonable adverse effects on the environment.\n(d) The commissioner may deny issuance of a conditional license or registration if the commissioner determines that issuance of a license or registration is not warranted or that the use to be made of the product under the proposed terms and conditions may cause unreasonable adverse effects on the environment.\nThe commissioner may not license or register for sale or use in Minnesota any fertilizer containing more than 500 parts per million by weight of arsenic.",
	"repealed": false
}