{
	"id": "203B.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.081",
	"title": "203B.081 LOCATIONS AND METHODS FOR ABSENTEE VOTING IN PERSON.",
	"text": "An eligible voter may vote by absentee ballot in the office of the county auditor and at any other polling place designated by the county auditor during the 46 days before the election, except as provided in this section.\n[See Note.]\nAn eligible voter may vote using early voting during the 18 days before a federal, state, or county election, and during the 18 days before a municipal election if authorized under section 203B.05, in the office of the county auditor and at any other polling place designated by the county auditor. In elections in which early voting is provided, the alternative voting procedure authorized by subdivision 3 must not be provided.\n[See Note.]\nMS 2022 [Repealed, 2023 c 62 art 4 s 138]\n(a) In elections not eligible to use early voting under subdivision 1a, the county auditor may make available a ballot counter and ballot box for use by the voters during the 18 days before the election. If a ballot counter and ballot box is provided, a voter must be given the option either (1) to vote using the process provided in section 203B.08, subdivision 1, or (2) to vote in the manner provided in this subdivision.\n(b) If a voter chooses to vote in the manner provided in this subdivision, the voter must state the voter's name, address, and date of birth to the county auditor or municipal clerk. The voter shall sign a voter's certificate, which must include the voter's name, identification number, and the certification required by section 201.071, subdivision 1. The signature of an individual on the voter's certificate and the issuance of a ballot to the individual is evidence of the intent of the individual to vote at that election.\n(c) After signing the voter's certificate, the voter shall be issued a ballot and immediately retire to a voting station or other designated location in the polling place to mark the ballot. The ballot must not be taken from the polling place. If the voter spoils the ballot, the voter may return it to the election official in exchange for a new ballot. After completing the ballot, the voter shall deposit the ballot into the ballot box.\n(d) The election official must immediately record that the voter has voted in the manner provided in section 203B.121, subdivision 3.\n(e) The election duties required by this subdivision must be performed by an election judge, the county auditor, municipal clerk, or a deputy of the auditor or clerk.\n[See Note.]\n(a) A county auditor or municipal clerk authorized under section 203B.05 to administer voting before election day may designate additional polling places with days and hours that differ from those required by section 203B.085. A designation authorized by this subdivision must be made at least 47 days before the election. The county auditor or municipal clerk must provide notice to the secretary of state at the time that the designations are made.\n(b) At the request of a federally recognized Indian Tribe with a reservation in the county, the county auditor must establish an additional polling place for at least one day on the Indian reservation on a site agreed upon by the Tribe and the county auditor that is accessible to the county auditor by a public road.\n(c) At the request of a postsecondary institution or the student government organization of a postsecondary institution in the county or municipality, the county auditor or a municipal clerk authorized to administer absentee voting under section 203B.05 must establish an additional temporary polling place for the state general election or the odd-year city general election for at least one day at a location agreed upon by the institution and the county auditor or municipal clerk that:\n(1) is accessible to the public;\n(2) satisfies the requirements of state and federal law; and\n(3) is on the institution's campus or is within one-half mile of the institution's campus and is reasonably accessible to the institution's students.\nA request must be made no later than May 31 before an election and the request is valid only for that election. This paragraph only applies to a postsecondary institution that provides on-campus student housing to 100 or more students. Nothing in this paragraph prevents the county auditor or municipal clerk from engaging in a dialogue with the entity that made the request regarding potential alternative locations for a temporary polling place that does not meet the requirements of clause (3). An entity that made a request for a temporary polling place may withdraw its request by notifying the county auditor or municipal clerk.\nVoters casting absentee ballots in person for a town election held in March may do so during the 30 days before the election.\nThe county auditor must make polling place designations at least 14 weeks before the election and must provide the notice to the secretary of state at the time the designations are made.\nThe county auditor must prepare a notice to the voters of the days, times, and locations for voting before election day as authorized by this section. This notice must be posted on the secretary of state's website, the county's website, and the website for each municipality in which a voting location under this section is located at least 14 days before the first day of the absentee voting period. If a county or municipality does not have a website, the county auditor or municipal clerk must publish the notice at least once in the jurisdiction's official newspaper at least seven days and not more than 14 days before the first day of the absentee voting period.\nThe county auditor must provide each polling place with at least one voting booth; a ballot box; an electronic ballot counter, unless it has not adopted use of one; and at least one electronic ballot marker for individuals with disabilities pursuant to section 206.57, subdivision 5.",
	"repealed": false
}