{
	"id": "16B.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.56",
	"title": "16B.56 COMMUTER VANS; USE BY STATE EMPLOYEES AND SPOUSES AND OTHERS.",
	"text": "(a) Establishment. To conserve energy and alleviate traffic congestion around state offices, the commissioner shall, in cooperation with the commissioner of transportation, the State Energy Office in the Department of Commerce, and interested nonprofit agencies, establish and operate an employee transportation program using commuter vans with a capacity of not less than seven nor more than 16 passengers. Commuter vans may be used by state employees and others to travel between their homes and their work locations. However, only state employee drivers may use the van for personal purposes after working hours, not including partisan political activity. The commissioner shall acquire or lease commuter vans, or otherwise contract for the provision of commuter vans, and shall make the vans available for the use of state employees and others in accordance with standards and procedures adopted by the commissioner. The commissioner shall promote the maximum participation of state employees and others in the use of the vans.\n(b) Administrative policies. The commissioner shall adopt standards and procedures under this section without regard to chapter 14. The commissioner shall provide for the recovery by the state of vehicle acquisition, lease, operation, and insurance costs through efficient and convenient assignment of vans, and for the billing of costs and collection of fees. A state employee using a van for personal use shall pay, pursuant to the standards and procedures adopted by the commissioner, for operating and routine maintenance costs incurred as a result of the personal use. Fees collected under this subdivision shall be deposited in the accounts from which the costs of operating, maintaining, and leasing or amortization for the specific vehicle are paid.\nState employees and their spouses and other people are eligible for the employee transportation program established by this section, if the driver and substitute driver of every vanpool are state employees and if state employees constitute a majority of the members of every vanpool. Available space in vanpools must, whenever possible, be filled by state employees.\nUse of the vans pursuant to this section is limited to areas not having adequate public transportation between the residences of state employees and others and their places of employment.\n[Repealed, 1994 c 634 art 1 s 26]\nNotwithstanding section 15.31 or any other law to the contrary, the commissioner may purchase, pursuant to this chapter, collision insurance coverage for the commuter vans. Notwithstanding sections 16B.54, subdivision 2, and 168.012, the vans may not be marked. The vans may not be equipped with tax-exempt motor vehicle number plates.\n[Repealed, 1984 c 408 s 4]",
	"repealed": false
}