{
	"id": "168A.1412",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.1412",
	"title": "168A.1412 MANUFACTURED HOME AFFIXED TO REAL PROPERTY.",
	"text": "A manufactured home may be made an improvement to real property, and no longer titled as personal property, pursuant to this section. A manufactured home constitutes an improvement to real property when:\n(1) the manufactured home is to be affixed or is affixed, as defined in section 273.125, subdivision 8, paragraph (b), to the real property;\n(2) the certificate of title is surrendered and canceled pursuant to subdivision 2, or the manufacturer's certificate or statement of origin is canceled pursuant to subdivision 3; and\n(3) an affidavit of affixation pursuant to subdivision 5 is recorded with the county recorder or registrar of titles, as applicable.\n(a) The owner of the manufactured home may surrender the manufacturer's certificate of title to the commissioner for cancellation. Upon receipt of the certificate of title, the commissioner must issue notice of cancellation to the owner of the manufactured home. In the event the certificate of title is lost, stolen, mutilated, destroyed, or becomes illegible, the owner may submit a written request for cancellation of the title which includes the serial number of the manufactured home and states that the certificate of title is lost, stolen, mutilated, destroyed, or has become illegible. Upon receipt of the request and verification of ownership in Driver and Vehicle Services Division records, the commissioner must issue notice of cancellation to the owner of the manufactured home and must not require the owner to deliver the certificate of title or obtain a duplicate certificate of title. After canceling a certificate of title, the commissioner must not allow transfer of the title to the manufactured home as personal property. The commissioner must not require the owner of the manufactured home to deliver the affidavit of affixation described in subdivision 5 in order for the commissioner to issue notice of cancellation.\n(b) The commissioner must not cancel a certificate of title if, under this chapter, a security interest has been perfected on the manufactured home. If a security interest has been perfected, the commissioner must notify the owner of the manufactured home that each secured party must release or satisfy the security interest prior to cancellation of the certificate of title by the commissioner. Affixing the manufactured home to real property or recording an affidavit of affixation without cancellation of the certificate of title does not extinguish an otherwise valid security interest in or tax lien on the manufactured home.\nThe owner of the manufactured home may surrender the manufacturer's certificate of origin to the commissioner for cancellation. Upon delivery of the original certificate of origin, the commissioner must issue notice of cancellation to the owner of the manufactured home. The commissioner must not issue a certificate of title for a manufactured home if the manufacturer's certificate of origin is or has been canceled under this subdivision, except as provided in section 168A.142. The commissioner must not require the owner of the manufactured home to deliver the affidavit of affixation described in subdivision 5 in order for the commissioner to cancel the certificate of origin.\nThe commissioner is not liable for any errors, omissions, misstatements, or other deficiencies or inaccuracies in documents presented to the commissioner under this section if the documents presented appear to satisfy the requirements of this section. The commissioner has no obligation to investigate the accuracy of statements contained in the documents to verify that the manufactured home has been affixed to the real property.\nAn affidavit of affixation must be in substantially the following form and must contain the following information and attachments described in the form. The county recorder or registrar of titles, as applicable, must accept any such affidavit. The county recorder or registrar of titles, as applicable, must provide a copy of the recorded affidavit of affixation to the county auditor of the county for the real property described therein or otherwise inform the county auditor that the home is to be taxed as an improvement to the real property to which it is affixed:\nMANUFACTURED HOME AFFIDAVIT OF AFFIXATION\nPURSUANT TO MINNESOTA STATUTES, SECTION 168A.1412\n............................................... (\"Affiant\"), being first duly sworn, on oath states, or affirms under penalties of perjury that:\n1. I am an owner of the manufactured home (\"Manufactured Home\") described as follows:\n2. The Manufactured Home is ..... or will be ..... (check one) affixed, in accordance with Minnesota Statutes, section 273.125, subdivision 8, to real property in ........................................ County, Minnesota, with the street address of:\n3. A copy of the notice of cancellation issued from the Minnesota Department of Public Safety Driver and Vehicle Services pursuant to Minnesota Statutes, section 168A.1412, subdivision 2 or 3, is attached.\n4. The owner(s) of the Manufactured Home is/are the owner(s) of the Land.\n5. The Affiant makes this affidavit to demonstrate that the Manufactured Home is an improvement to real property, no longer titled as personal property, and free of any personal property security interest.\nSigned and sworn to (or affirmed) before me this ....... day of ......., .......\nNotary Stamp or Seal\nWhen a perfected security interest exists, or will exist, on the manufactured home at the time the manufactured home is affixed to real property, and the owner has not satisfied the requirements of subdivision 1, the owner of the manufactured home, or its secured party, may record a notice with the county recorder, or with the registrar of titles, if the land is registered, stating that the manufactured home located on the property is encumbered by a perfected security interest and is not an improvement to real property. The notice must state the name and address of the secured party as set forth on the certificate of title, the legal description of the real property, and the name and address of the record fee owner of the real property on which the manufactured home is affixed. When the security interest is released or satisfied, the secured party must attach a copy of the release or satisfaction to a notice executed by the secured party containing the county recorder or registrar of titles document number of the notice of security interest. The notice of release or satisfaction must be recorded with the county recorder, or registrar of titles, if the land is registered. Neither the notice described in this subdivision nor the security interest on the certificate of title is deemed to be an encumbrance on the real property. The notices provided for in this subdivision need not be acknowledged.",
	"repealed": false
}