{
	"id": "515B.2-121",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-121",
	"title": "515B.2-121 MASTER ASSOCIATIONS.",
	"text": "(a) A master association formed after June 1, 1994, shall be organized as a Minnesota profit, nonprofit or cooperative corporation. A master association shall be incorporated prior to the delegation to it of any powers under this chapter.\n(b) The members of the master association shall be any combination of (i) unit owners, (ii) associations, (iii) master associations, or (iv) owners of real estate or property owners' associations not subject to this chapter but only in combination with at least one other category of member. An association or its members may be members of an entity created before June 1, 1994, which performs functions similar to those performed by a master association regardless of whether the entity is subject to this chapter.\n(c) A master association shall be governed by a master board. Except as expressly prohibited by the master declaration, the master association's articles of incorporation or bylaws, or other provisions of this chapter, the master board may act in all instances on behalf of the master association. The directors of a master association shall be elected or, if a nonprofit corporation, elected or appointed, in a manner consistent with the requirements of the statute under which the master association is formed and of the master association's articles of incorporation and bylaws, and subject to the following:\n(1) The master declaration may provide for a period of master developer control of the master association during which a master developer or a person designated by the master developer may appoint and remove the officers and directors of the master association. The period of master developer control begins on the date of the recording of the master declaration and terminates upon the earliest of the following events:\n(i) the voluntary surrender of the right to appoint directors;\n(ii) the date ten years after the date the master declaration is recorded, unless extended by an amendment to the master declaration approved in writing by the master developer, and by 67 percent of the votes of members other than the master developer;\n(iii) the termination date, if any, in the master declaration; or\n(iv) the date when at least 75 percent of the total units and other parcels of real estate referred to in subsection (e)(1)(vii) have been conveyed to persons other than a master developer, master association, declarant, or association.\n(2) Upon the termination of the period of master developer control, the master board shall cause a meeting of the members of the master association to be called and held within 60 days after said termination, at which time the directors shall be elected by all members, including the master developer if a member. If the master board fails or refuses to call a meeting of the unit owners required to be called by this subsection, then the members other than the master developer and its affiliates, if they are members, may cause the meeting to be called pursuant to the applicable provisions of the statute under which the master association was created. If the master developer or its affiliates are members, they shall be deemed to be present at the meeting for purposes of establishing a quorum regardless of their failure to attend the meeting. The master board shall thereafter be subject to the following:\n(i) unless otherwise approved by a vote of members other than the master developer or an affiliate of the master developer, a majority of the directors shall be members, or a natural person designated by a member that is not a natural person, other than the master developer or an affiliate of the master developer;\n(ii) subject to the requirements of subsection (c)(2)(i), the articles of incorporation or bylaws may authorize the master developer or a person designated by the master developer to appoint one director, who need not be a member. The articles of incorporation or bylaws shall not be amended to change or terminate the authorization to appoint one director without the written consent of the master developer or other person possessing the power to appoint; and\n(iii) subject to the requirements of subsection (c)(2)(i), the articles of incorporation or bylaws may authorize special classes of directors and director voting rights, as follows: (A) classes of directors, (B) the appointment or election of directors in certain classes by certain classes of members, or (C) class voting by classes of directors on issues affecting only a certain class or classes of members, units, or other parcels of real estate, or to otherwise protect the legitimate interests of such class or classes. No person may utilize such special classes or class voting for the purpose of evading any limitation imposed by this chapter on master developers or declarants.\n(d) Subject to subsection (c)(1), the officers of a master association shall be elected, appointed, or designated in a manner consistent with the statute under which the master association is formed and consistent with the master association articles of incorporation and bylaws.\n(e) The creation and authority of a master association shall be governed by the following requirements:\n(1) A master declaration shall be recorded in connection with the creation of a master association. The master declaration shall be executed by the owners of the real estate subjected to the master declaration and by the master developer if not an owner. The master declaration shall contain, at a minimum:\n(i) the name of the master association;\n(ii) a legally sufficient description of the real estate which is subject to the master declaration, identifying any interest in the real estate which will be owned by the master association, and a legally sufficient description of any other real estate which may be subjected to the master declaration pursuant to subsection (f);\n(iii) a statement as to whether the real estate subject to, and which may be subjected to, the master declaration collectively is or collectively will be a separate common interest community;\n(iv) a description of the members of the master association;\n(v) a description of the master association's powers. To the extent described in the master declaration, a master association has the powers with respect to the master association's members and the property subject to the master declaration that section 515B.3-102 grants to an association with respect to the association's members and the property subject to the declaration. A master association also has the powers delegated to it by an association pursuant to subsection (e)(2) or by a property owners' association not subject to the chapter; provided (A) that the master declaration identifies the powers and authorizes the delegation either expressly or by a grant of authority to the master board of the association or property owners' association and (B) that the master association board has not refused the delegation pursuant to subsection (e)(4). The provisions of the declarations of the common interest communities, or the provisions of recorded instruments governing other property subject to the master declaration, that delegate powers to the master association shall be consistent with the provisions of the master declaration that govern the delegation of the powers;\n(vi) a description of the formulas governing the allocation of assessments and member voting rights, including any special classes or class voting referred to in subsection (c);\n(vii) a statement, based upon the master developer's good faith estimate, of the total number of units and other parcels of real estate intended for ownership by persons other than a master developer, master association, declarant, or association that are (A) subject to the master declaration as initially recorded and (B) intended to be created by the addition of real estate or by the subdivision of units or other parcels of real estate; and\n(viii) the requirements for amendment of the master declaration, other than an amendment under subsection (f).\n(2) The declaration of a common interest community located on property subject to a master declaration may:\n(i) delegate any of the powers described in section 515B.3-102 to the master association; provided, that a delegation of the powers described in section 515B.3-102(a)(2) is effective only if expressly stated in the declaration; and\n(ii) authorize the board to delegate any of the powers described in section 515B.3-102, except for the powers described in section 515B.3-102(a)(2), to the master association.\n(3) With respect to any other property subject to a master association, there need not be an instrument other than the master declaration recorded against the property to empower the master association to exercise powers with respect to the property.\n(4) If a declaration or other recorded instrument authorizes the master board or the board of a property owners' association to delegate powers to a master association, the master board may refuse any delegation of powers that does not comply with (i) this chapter, (ii) the declaration or other recorded instrument, or (iii) the organizational documents of the master association.\n(5) The failure of a declaration, a master board, or an owner of property subject to a master association to properly delegate some or all of the powers to the master association does not affect the authority of the master association to exercise those and other powers with respect to other common interest communities or owners of properties that are subject to the master association.\n(6) Any interest in the real estate subject to a master declaration that subsection (e)(1)(ii) or (f) indicates will be owned by the master association shall be conveyed to the master association immediately after the recording of the master declaration or amendment to the master declaration, as applicable.\n(f) If the master declaration so provides, other real estate may be subjected to the master declaration. The other real estate shall be subjected to the master declaration by an amendment executed (i) by the master developer and (ii) by the owner of the other real estate. The amendment shall identify any ownership interest in the other real estate that will be owned by the master association.\n(g) Sections 515B.3-103(a), (b), and (g), 515B.3-108, 515B.3-109, 515B.3-110, and 515B.3-112 shall apply in the conduct of the affairs of a master association. But the rights of voting, notice, and other rights enumerated in those sections apply to persons who elect or appoint the directors of a master board, whether or not those persons are otherwise unit owners within the meaning of this chapter.\n(h) If so provided in the master declaration, a master association may levy assessments for common expenses of the master association against its members and the property subject to the master declaration, and have and foreclose liens securing the assessments. The assessment liens shall have the same priority against secured parties, shall include the same fees and charges, and may be foreclosed in the same manner, as assessment liens under section 515B.3-116. The master association's lien shall have priority as against the lien of an association or property owners' association subject to the master association, regardless of when the lien arose or was perfected.\n(1) Master association common expenses shall be allocated among the members of the master association in a fair and equitable manner. If the members include associations or property owners' associations, then the master assessments may be allocated among and levied against the associations or property owners' associations, or allocated among and levied against the units or other parcels of real estate owned by the members of the association or property owners' association. If so provided in the master declaration, master assessments levied against a member association or property owners' association are allocated among and levied against the units or other parcels of real estate owned by the members of the association or property owners' association. If applicable and appropriate, the formulas and principles described in section 515B.2-108, subsections (b), (c), (d), and (e), shall be used in making the allocations. The assessment formulas and procedures described in the declarations of any common interest communities or any instruments governing other real estate subject to the master association shall not conflict with the formulas and procedures described in the master declaration.\n(2) Subject to subsection (i), the master declaration may exempt from liability for all or a portion of master association assessments any person authorized by subsection (c)(1) to appoint the members of the master board, or any other person, and exempt any unit or other parcel of real estate owned by the person from a lien for such assessments, until the building containing the unit, or located within the boundaries of the unit or other parcel of real estate, is substantially completed. Substantial completion shall be evidenced by a certificate of occupancy in a jurisdiction that issues that certificate.\n(i) A master association shall not be used, directly or indirectly, to avoid or nullify any warranties or other obligations for which a declarant of a common interest community subject to the master association is responsible, or to otherwise avoid the requirements of this chapter.",
	"repealed": false
}