{
	"id": "144.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.55",
	"title": "144.55 LICENSES; ISSUANCE, SUSPENSION AND REVOCATION.",
	"text": "(a) The state commissioner of health is hereby authorized to issue licenses to operate hospitals, sanitariums, outpatient surgical centers, or other institutions for the hospitalization or care of human beings, which are found to comply with the provisions of sections 144.50 to 144.56 and any reasonable rules promulgated by the commissioner. The commissioner shall not require an outpatient surgical center licensed as part of a hospital to obtain a separate outpatient surgical center license. All decisions of the commissioner thereunder may be reviewed in the district court in the county in which the institution is located or contemplated.\n(b) The commissioner may issue a conditional license to operate an outpatient surgical center if:\n(1) the applicant is seeking a license to operate an outpatient surgical center that will share a facility with an existing licensed outpatient surgical center that is also federally certified under Medicare as an ambulatory surgical center; and\n(2) the outpatient surgical center otherwise meets the requirements for licensure under this subdivision.\nA conditional license issued under this paragraph is valid for 120 days and may be renewed once for an additional 120 days. The commissioner shall convert a valid conditional license to a nonconditional license if the licensee can demonstrate to the commissioner that the conditionally licensed outpatient surgical center is federally certified under Medicare as an ambulatory surgical center.\nThe annual license fee for outpatient surgical centers is $1,512.\nAs a condition of licensure, outpatient surgical centers must provide nursing care consistent with nationally accepted nursing clinical standards for perioperative nursing, including, but not limited to Association of Operating Room Nurses and American Nurses Association standards, which are generally accepted in the professional nursing community.\n(a) For the purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Outpatient surgical center\" or \"center\" means a facility organized for the specific purpose of providing elective outpatient surgery for preexamined, prediagnosed, low-risk patients. An outpatient surgical center is not organized to provide regular emergency medical services and does not include a physician's, advanced practice registered nurse's, physician assistant's, or dentist's office or clinic for the practice of medicine, the practice of dentistry, or the delivery of primary care.\n(c) \"Approved accrediting organization\" means any organization recognized as an accreditation organization by the Centers for Medicare and Medicaid Services.\n(a) Notwithstanding the provisions of section 144.56, for the purpose of hospital licensure, the commissioner of health shall use as minimum standards the hospital certification regulations promulgated pursuant to title XVIII of the Social Security Act, United States Code, title 42, section 1395, et seq. The commissioner may use as minimum standards changes in the federal hospital certification regulations promulgated after May 7, 1981, if the commissioner finds that such changes are reasonably necessary to protect public health and safety.\n(b) Hospitals must meet the applicable provisions of the 2022 edition of the Facility Guidelines Institute Guidelines for Design and Construction of Hospitals. This minimum design standard must be met for all new licenses, new construction, change of use, or change of occupancy for which plan review packages are received on or after January 1, 2024. For the purposes of this subdivision, \"Facility Guidelines Institute Guidelines for Design and Construction of Hospitals \" does not include any appendices to the guidelines.\n(c) The commissioner shall review each new edition of the guidelines to determine if they will be updated. If the commissioner decides to update the edition of the guidelines specified in paragraph (b) for purposes of this subdivision, the commissioner must notify the chairs and ranking minority members of the legislative committees with jurisdiction over health care and public safety of the planned update by January 15 of the year in which the new edition will become effective. Following notice from the commissioner, the new edition shall become effective for hospitals beginning August 1 of that year, unless otherwise provided in law. The commissioner shall, by publication in the State Register, specify a date by which hospitals must comply with the updated edition. The date by which hospitals must comply shall not be sooner than 12 months after publication of the commissioner's notice in the State Register and applies only to plan review submissions received on or after that date.\n(d) Hospitals shall be in compliance with all applicable state and local governing laws, regulations, standards, ordinances, and codes for fire safety, building, and zoning requirements. The commissioner shall develop guidance to outline how the commissioner will resolve conflicts between the guidelines and other applicable state and local governing laws, regulations, standards, ordinances, and codes for fire safety, building, and zoning. Guidance must be made publicly available at the time a new edition of the guidelines becomes effective and shall be periodically updated.\n(e) Each hospital and outpatient surgical center shall establish policies and procedures to prevent the transmission of human immunodeficiency virus and hepatitis B virus to patients and within the health care setting. The policies and procedures shall be developed in conformance with the most recent recommendations issued by the United States Department of Health and Human Services, Public Health Service, Centers for Disease Control. The commissioner of health shall evaluate a hospital's compliance with the policies and procedures according to subdivision 4.\n(f) An outpatient surgical center must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in CDC's Morbidity and Mortality Weekly Report (MMWR). This program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, and volunteers. The Department of Health shall provide technical assistance regarding implementation of the guidelines.\n(g) Written compliance with this subdivision must be maintained by the outpatient surgical center.\nAdmissions to outpatient surgical centers are limited to procedures that utilize general anesthesia or conscious sedation and that do not require overnight inpatient care.\nAn outpatient surgical center must be a freestanding facility unless:\n(1) the outpatient surgical center is licensed as part of a hospital;\n(2) the licensed outpatient surgical center is federally certified under Medicare as an ambulatory surgical center and shares a facility only with other licensed outpatient surgical centers federally certified under Medicare as ambulatory surgical centers; or\n(3) the outpatient surgical center is conditionally licensed under subdivision 1, paragraph (b), and shares a facility only with other licensed outpatient surgical centers federally certified under Medicare as ambulatory surgical centers.\nAny hospital surveyed and accredited under the standards of the hospital accreditation program of an approved accrediting organization that submits to the commissioner within a reasonable time copies of (a) its currently valid accreditation certificate and accreditation letter, together with accompanying recommendations and comments and (b) any further recommendations, progress reports and correspondence directly related to the accreditation is presumed to comply with application requirements of subdivision 1 and the standards requirements of subdivision 3 and no further routine inspections or accreditation information shall be required by the commissioner to determine compliance. Notwithstanding the provisions of sections 144.54 and 144.653, subdivisions 2 and 4, hospitals shall be inspected only as provided in this section. The provisions of section 144.653 relating to the assessment and collection of fines shall not apply to any hospital. The commissioner of health shall annually conduct, with notice, validation inspections of a selected sample of the number of hospitals accredited by an approved accrediting organization, not to exceed ten percent of accredited hospitals, for the purpose of determining compliance with the provisions of subdivision 3. If a validation survey discloses a failure to comply with subdivision 3, the provisions of section 144.653 relating to correction orders, reinspections, and notices of noncompliance shall apply. The commissioner shall also conduct any inspection necessary to determine whether hospital construction, addition, or remodeling projects comply with standards for construction promulgated in rules pursuant to subdivision 3. The commissioner may also conduct inspections to determine whether a hospital or hospital corporate system continues to satisfy the conditions on which a hospital construction moratorium exception was granted under section 144.551, subdivision 1a. Pursuant to section 144.653, the commissioner shall inspect any hospital that does not have a currently valid hospital accreditation certificate from an approved accrediting organization. Nothing in this subdivision shall be construed to limit the investigative powers of the Office of Health Facility Complaints as established in sections 144A.51 to 144A.54.\nPrior to conducting routine inspections of hospitals and outpatient surgical centers, a state agency shall notify the commissioner of its intention to inspect. The commissioner shall then determine whether the inspection is necessary in light of any previous inspections conducted by the commissioner, any other state agency, or an approved accrediting organization. The commissioner shall notify the agency of the determination and may authorize the agency to conduct the inspection. No state agency may routinely inspect any hospital without the authorization of the commissioner. The commissioner shall coordinate, insofar as is possible, routine inspections conducted by state agencies, so as to minimize the number of inspections to which hospitals are subject.\n(a) The commissioner may refuse to grant or renew, or may suspend or revoke, a license on any of the following grounds:\n(1) violation of any of the provisions of sections 144.50 to 144.56 or the rules or standards issued pursuant thereto, or Minnesota Rules, chapters 4650 and 4675;\n(2) permitting, aiding, or abetting the commission of any illegal act in the institution;\n(3) conduct or practices detrimental to the welfare of the patient; or\n(4) obtaining or attempting to obtain a license by fraud or misrepresentation; or\n(5) with respect to hospitals and outpatient surgical centers, if the commissioner determines that there is a pattern of conduct that one or more physicians, advanced practice registered nurses, or physician assistants who have a \"financial or economic interest,\" as defined in section 144.6521, subdivision 3, in the hospital or outpatient surgical center, have not provided the notice and disclosure of the financial or economic interest required by section 144.6521.\n(b) The commissioner shall not renew a license for a boarding care bed in a resident room with more than four beds.\n(c) The commissioner shall not renew licenses for hospital beds issued to a hospital or hospital corporate system pursuant to a hospital construction moratorium exception under section 144.551, subdivision 1a, if the commissioner determines the hospital or hospital corporate system is not satisfying the conditions on which the exception was granted.\nPrior to any suspension, revocation or refusal to renew a license, the licensee shall be entitled to notice and a hearing as provided by sections 14.57 to 14.69. At each hearing, the commissioner shall have the burden of establishing that a violation described in subdivision 6 has occurred.\nIf a license is revoked, suspended, or not renewed, a new application for license may be considered by the commissioner if the conditions upon which revocation, suspension, or refusal to renew was based have been corrected and evidence of this fact has been satisfactorily furnished. A new license may then be granted after proper inspection has been made and all provisions of sections 144.50 to 144.56 and any rules promulgated thereunder, or Minnesota Rules, chapters 4650 and 4675, have been complied with and recommendation has been made by the inspector as an agent of the commissioner.\nThe commissioner may promulgate rules necessary to implement the provisions of this section, except that the standards described in subdivision 3 shall constitute the sole minimum quality standards for licensure of hospitals.\nAll licenses expire on the dates specified on the licenses unless suspended or revoked.\nMS 2018 [Repealed, 2019 c 22 s 6]\nSubdivisions 3, 4, and 5 do not apply to state hospitals and other facilities operated under the direction of the Direct Care and Treatment executive board.",
	"repealed": false
}