{
	"id": "16A.122",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.122",
	"title": "16A.122 WORK FORCE PLANNING AND REPORTING.",
	"text": "Within any limits imposed by law, state agencies may establish full-time, part-time, or seasonal positions as necessary to carry out assigned responsibilities and missions except that actual levels of employment are limited by availability of appropriated funding for salaries and benefits.\nUnless otherwise provided by law or section 16B.98, subdivision 14, an agency must not use grant or flow-through funds for salaries or other operating purposes.\nThe commissioner shall prepare quarterly work force reports as required for accurate reporting of state employment levels, whether for internal analysis or for nationwide comparisons of public employment levels. The reports shall express total employment in terms of full-time equivalent positions; shall indicate changes from previous reporting periods; and shall take into account all positions, including full-time, part-time, temporary, and other employees. In this subdivision, a full-time equivalent position means 2,080 working hours per year; except that the number of work hours may vary, depending upon the exact number of working days in any given year. Independent contractors are not to be included within the definition of a full-time equivalent position.\nFor purposes of budgetary reporting, position counts must be expressed as full-time equivalents as stipulated in subdivision 3. Estimated positions must be based on actual funding in the year indicated. The biennial budget document submitted to the legislature by the governor shall indicate full-time equivalent base level positions, the number of projected positions, and the number of positions for each of the two years before the base year. The governor's budget recommendations shall clearly specify any proposed changes in full-time equivalent positions. All fiscal notes and any other budgetary items submitted to the legislature shall specify relevant changes, both in full-time equivalent positions and accompanying changes in salary dollars.",
	"repealed": false
}