{
	"id": "524.5-313",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-313",
	"title": "524.5-313 POWERS AND DUTIES OF GUARDIAN.",
	"text": "(a) A guardian shall be subject to the control and direction of the court at all times and in all things.\n(b) The court shall grant to a guardian only those powers necessary to provide for the demonstrated needs of the person subject to guardianship.\n(c) The court may appoint a guardian if it determines that all the powers and duties listed in this section are needed to provide for the needs of the incapacitated person. The court may also appoint a guardian if it determines that a guardian is needed to provide for the needs of the incapacitated person through the exercise of some, but not all, of the powers and duties listed in this section. The duties and powers of a guardian or those which the court may grant to a guardian include, but are not limited to:\n(1) the power to have custody of the person subject to guardianship and the power to establish a place of abode within or outside the state, except as otherwise provided in this clause. The person subject to guardianship or any interested person may petition the court to prevent or to initiate a change in abode. A person subject to guardianship may not be admitted to a regional treatment center by the guardian except:\n(i) after a hearing under chapter 253B;\n(ii) for outpatient services; or\n(iii) for the purpose of receiving temporary care for a specific period of time not to exceed 90 days in any calendar year;\n(2) the duty to provide for the care, comfort, and maintenance needs of the person subject to guardianship, including food, clothing, shelter, health care, social and recreational requirements, and, whenever appropriate, training, education, and habilitation or rehabilitation. The guardian has no duty to pay for these requirements out of personal funds. Whenever possible and appropriate, the guardian should meet these requirements through governmental benefits or services to which the person subject to guardianship is entitled, rather than from the estate of the person subject to guardianship;\n(3) the duty to take reasonable care of the clothing, furniture, vehicles, and other personal effects of the person subject to guardianship, and, if other property requires protection, the power to seek appointment of a conservator of the estate. The guardian must give notice by mail to interested persons prior to the disposition of the clothing, furniture, vehicles, or other personal effects of the person subject to guardianship. The notice must inform the person of the right to object to the disposition of the property within ten days of the date of mailing and to petition the court for a review of the guardian's proposed actions. Notice of the objection must be served by mail or personal service on the guardian and the person subject to guardianship unless the person subject to guardianship is the objector. The guardian served with notice of an objection to the disposition of the property may not dispose of the property unless the court approves the disposition after a hearing;\n(4)(i) the power to give any necessary consent to enable the person subject to guardianship to receive necessary medical or other professional care, counsel, treatment, or service, except that no guardian may give consent for psychosurgery, electroshock, sterilization, or experimental treatment of any kind unless the procedure is first approved by order of the court as provided in this clause. The guardian shall not consent to any medical care for the person subject to guardianship which violates the known conscientious, religious, or moral belief of the person subject to guardianship;\n(ii) a guardian who believes a procedure described in item (i) requiring prior court approval to be necessary for the proper care of the person subject to guardianship, shall petition the court for an order and, in the case of a public guardianship under chapter 252A, obtain the written recommendation of the commissioner of human services. The court shall fix the time and place for the hearing and shall give notice to the person subject to guardianship in such manner as specified in section 524.5-308 and to interested persons. The court shall appoint an attorney to represent the person subject to guardianship who is not represented by counsel, provided that such appointment shall expire upon the expiration of the appeal time for the order issued by the court under this section or the order dismissing a petition, or upon such other time or event as the court may direct. In every case the court shall determine if the procedure is in the best interest of the person subject to guardianship. In making its determination, the court shall consider a written medical report which specifically considers the medical risks of the procedure, whether alternative, less restrictive methods of treatment could be used to protect the best interest of the person subject to guardianship, and any recommendation of the commissioner of human services for a public person subject to guardianship. The standard of proof is that of clear and convincing evidence;\n(iii) in the case of a petition for sterilization of a person with developmental disabilities subject to guardianship, the court shall appoint a licensed physician, a psychologist who is qualified in the diagnosis and treatment of developmental disability, and a social worker who is familiar with the social history and adjustment of the person subject to guardianship or the case manager for the person subject to guardianship to examine or evaluate the person subject to guardianship and to provide written reports to the court. The reports shall indicate why sterilization is being proposed, whether sterilization is necessary and is the least intrusive method for alleviating the problem presented, and whether it is in the best interest of the person subject to guardianship. The medical report shall specifically consider the medical risks of sterilization, the consequences of not performing the sterilization, and whether alternative methods of contraception could be used to protect the best interest of the person subject to guardianship;\n(iv) any person subject to guardianship whose right to consent to a sterilization has not been restricted under this section or section 252A.101 may be sterilized only if the person subject to guardianship consents in writing or there is a sworn acknowledgment by an interested person of a nonwritten consent by the person subject to guardianship. The consent must certify that the person subject to guardianship has received a full explanation from a physician or registered nurse of the nature and irreversible consequences of the sterilization;\n(v) a guardian or the public guardian's designee who acts within the scope of authority conferred by letters of guardianship under section 252A.101, subdivision 7, and according to the standards established in this chapter or in chapter 252A shall not be civilly or criminally liable for the provision of any necessary medical care, including, but not limited to, the administration of psychotropic medication or the implementation of aversive and deprivation procedures to which the guardian or the public guardian's designee has consented;\n(5) in the event there is no duly appointed conservator of the estate of the person subject to guardianship, the guardian shall have the power to approve or withhold approval of any contract, except for necessities, which the person subject to guardianship may make or wish to make;\n(6) the duty and power to exercise supervisory authority over the person subject to guardianship in a manner which limits civil rights and restricts personal freedom only to the extent necessary to provide needed care and services. A guardian may not restrict the ability of the person subject to guardianship to communicate, visit, or interact with others, including receiving visitors or making or receiving telephone calls, personal mail, or electronic communications including through social media, or participating in social activities, unless the guardian has good cause to believe restriction is necessary because interaction with the person poses a risk of significant physical, psychological, or financial harm to the person subject to guardianship, and there is no other means to avoid such significant harm. In all cases, the guardian shall provide written notice of the restrictions imposed to the court, to the person subject to guardianship, and to the person subject to restrictions. The person subject to guardianship or the person subject to restrictions may petition the court to remove or modify the restrictions;\n(7) if there is no acting conservator of the estate for the person subject to guardianship, the guardian has the power to apply on behalf of the person subject to guardianship for any assistance, services, or benefits available to the person subject to guardianship through any unit of government;\n(8) unless otherwise ordered by the court, the person subject to guardianship retains the right to vote;\n(9) the power to establish an ABLE account for a person subject to guardianship or conservatorship. By this provision a guardian only has the authority to establish an ABLE account, but may not administer the ABLE account in the guardian's capacity as guardian. The guardian may appoint or name a person to exercise signature authority over an ABLE account, including the individual selected by the eligible individual or the eligible individual's agent under a power of attorney; conservator; spouse; parent; sibling; grandparent; or representative payee, whether an individual or organization, appointed by the SSA, in that order; and\n(10) if there is no conservator appointed for the person subject to guardianship, the guardian has the duty and power to institute suit on behalf of the person subject to guardianship and represent the person subject to guardianship in expungement proceedings, harassment proceedings, and all civil court proceedings, including but not limited to restraining orders, orders for protection, name changes, conciliation court, housing court, family court, probate court, and juvenile court, provided that a guardian may not settle or compromise any claim or debt owed to the estate without court approval.",
	"repealed": false
}