{
	"id": "239.751",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.751",
	"title": "239.751 PETROLEUM DISPENSER, PRICE, LABEL, AND SIGN.",
	"text": "A retail petroleum dispenser that automatically computes the total price of each sale must have a unit price indicator on the face of the computer mechanism that clearly displays the price per gallon or price per liter, including all taxes. The unit price indicator must not be covered or obscured in any manner.\nA retail petroleum dispenser that does not automatically compute the total price of each sale must have a sign stating the price per gallon or price per liter, including all taxes. The sign must be white with black letters and figures. The letters and figures must be at least one inch high. The sign must be clearly and conspicuously posted on all dispenser faces, as close as possible to the total quantity indicator. Examples of acceptable unit price signs include: \"$1.20/gallon,\" or \"$0.32/liter.\"\nA sign or device designed to advertise the price of gasoline or diesel fuel, that is posted within view of any public highway, road, or street, or on or near premises where gasoline is sold at retail, must meet the following requirements:\n(a) The price per gallon, or price per liter, including all taxes and fees to be collected in connection with the sale, must be clearly stated in figures of uniform size and prominence.\n(b) If the advertised price per gallon, or price per liter, is subject to any conditions or restrictions, the conditions or restrictions must be clearly posted on the sign. For example, if a customer must pay cash to obtain the advertised price, the sign must clearly state \"cash,\" \"cash price,\" or \"cash discount price.\"\nThe term \"premium\" may be used only to advertise, or to identify a dispenser used to dispense, gasoline with an octane rating of 91 or greater.\nFor the purposes of this section, the term \"diesel fuel\" may be used to advertise or identify a dispenser used to dispense any fuel approved by the United States Environmental Protection Agency for use in a compression-ignition engine.\nA person shall post signs on the dispensers, on the dispenser island, or on the canopy over the dispensers, that clearly state the conditions for obtaining the price offered on the dispensers, if the person:\n(1) sells or offers to sell gasoline or diesel fuel at retail;\n(2) has more than one dispenser for a specific grade of product; and\n(3) sets different dispensers to compute a total sale at different prices for the same product.\nFor example, signs must be posted to direct customers to separate dispensers for full service or self-service prices.\nWhen a dispenser, sign, display, or label does not comply with the requirements in this section, the director shall reject the noncomplying dispenser or other equipment and employ any or all of the following actions to prohibit use of the noncomplying dispenser or other equipment:\n(1) reject and mark as rejected the pumps, meters, or other dispensers that do not comply, or are used in conjunction with advertising signs or price displays that do not comply;\n(2) issue a written warning to the owner, operator, manager, or attendant of the business or property where the dispenser or sign is located;\n(3) issue a citation to the owner, operator, manager, or attendant of the business or property where a dispenser or sign is located;\n(4) request that a city or county attorney draft a misdemeanor complaint.\n(a) A person must be in close attendance to the dispenser nozzle while fuel is being dispensed into a motor vehicle. No civil or criminal penalties apply to violations of this subdivision.\n(b) A person who sells petroleum product at retail to the public for use in motor vehicles as defined in section 296A.01, subdivision 21:\n(1) shall post signs in the locations described in subdivision 5 that state: \"A person fueling a motor vehicle must be in close attendance to the dispenser nozzle during the fueling process.\"; and\n(2) may discontinue fuel services to a person who violates paragraph (a).\nA person responsible for the product must meet all of the requirements in this section. When a dispenser or other equipment is rejected for failure to comply with this section, a person responsible for the product is required to correct the dispenser, price display violation, or price advertising violation.\nIf a number is used to advertise or identify a grade of gasoline, that number can only be less than or equal to the octane of the gasoline being advertised or identified.\n(a) Petroleum product dispensed from a single storage tank or from multiple storage tanks that are joined in such a manner that the product is commingled while still in the tanks must have an identical base price at each retail dispenser from which it is offered for sale. This requirement does not preclude the application of discounts for cash, self-service, customer loyalty programs, or other discount programs on any basis except octane to the base price at each dispenser.\n(b) For the purpose of this subdivision, \"base price\" means the highest unit price of a petroleum product dispensed from a single storage tank or from multiple storage tanks that are joined in such a manner that the product is commingled while still in the tanks, including taxes and fees, and before the application of discounts, including, but not limited to, discounts for cash, self-service, customer loyalty programs, and coupons.",
	"repealed": false
}