{
	"id": "48A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.01",
	"title": "48A.01 ORGANIZATION OF A STATE TRUST COMPANY.",
	"text": "(a) Subject to the other provisions of this chapter, three or more persons may organize and charter a state trust company for purposes of transacting business as a trust company in conformity with the applicable laws.\n(b) A state trust company may be organized under section 47.12. If the trust company does not exercise banking powers, it may exercise the powers of a Minnesota business corporation reasonably necessary or helpful to enable exercise of its specific powers under this chapter.\n(c) A state trust company may be organized as a limited liability company if it does not exercise banking powers.\n(d) The articles of incorporation or articles of organization of the company must be signed and acknowledged by each organizer and must contain:\n(1) the name of the state trust company;\n(2) the period of its duration, which may be perpetual;\n(3) the powers of the state trust company, which may be stated as:\n(i) all powers granted to a state trust company in this state; or\n(ii) a list of the specific powers that the state trust company chooses and is authorized to exercise;\n(4) the aggregate number of shares or membership interests that the state trust company will be authorized to issue, the number of classes of shares or membership interests, which may be one or more, the number of shares or membership interests of each class if more than one class, and a statement of the par value of the shares of each class or that the shares or membership interests are to be without par value;\n(5) if the shares or membership interests are to be divided into classes, the designation of each class and statement of the preferences, limitations, and relative rights of the shares or membership interests of each class, which in the case of a limited trust association may be more fully set forth in the statement of membership interest;\n(6) a provision limiting or denying to participants the preemptive right to acquire additional or treasury membership interests or shares of the state trust company;\n(7) a provision granting the right of members or shareholders to cumulative voting in the election of directors or managers;\n(8) the aggregate amount of consideration to be received for all shares or membership interests initially issued by the state trust company, and a statement that all authorized contributions or shares have been subscribed and that all subscriptions received provide for the consideration to be fully paid in cash before the charter is issued;\n(9) a provision consistent with law that the organizers elect to set forth in the articles of incorporation or articles of organization for the regulation of the internal affairs of the state trust company or that is otherwise required by this chapter to be set forth in the articles;\n(10) the street address of the state trust company's principal office; and\n(11) the number of directors or governors constituting the initial board, which must not be fewer than five or more than 25, and a statement that management is vested in a board.\nA majority of the directors or governors of a trust company must be residents of this state. Each must take and subscribe an oath to diligently and honestly perform the official duties of a director or manager and not knowingly violate, or permit to be violated, any provision of law relating to trust companies. The taking of this oath must be noted on the minutes of the records of the corporation and filed with the commissioner. Failure of a person selected as director to qualify creates a vacancy in the board. All vacancies in the board must be filled by the qualified members. However, not more than one-third of the membership of the board may be so filled in any one year.",
	"repealed": false
}