{
	"id": "13.851",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.851",
	"title": "13.851 CORRECTIONS AND DETENTION DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify corrections and detention data as other than public, place restrictions on access to government data, or involve data sharing.\nBlood test results obtained under sections 241.33 to 241.342 are classified under section 241.339.\nAccess to sex offender treatment information prepared by sex offender treatment facilities by the commissioner of corrections is governed by section 241.67, subdivision 9.\n(a) Use of information. Data provided under section 243.166, subdivision 7, are classified under that section.\n(b) Availability of information. Requests to treat offender information as private is governed by section 243.166, subdivision 7a.\nData provided to the county attorney under section 244.05, subdivision 7, are governed by that section.\nCertain data classified under chapter 13 are made accessible to the end-of-confinement review committee in state correctional facilities under section 244.052.\nRelease of information about predatory offenders to certain persons under the community notification provisions of section 244.052 is governed by section 244.053, subdivision 2.\nRelease of information about persons convicted of an offense which requires registration as a predatory offender under section 243.166 and who are released on probation is governed by section 244.10, subdivision 8.\nData relating to the preparation of a petition to commit an individual as a sexual psychopathic personality or sexually dangerous person is governed by chapter 253D.\nThe use of felony offender data made available to the secretary of state is governed by section 201.145.\nAccess to conditional release data is governed by section 241.065.\nThe treatment of data collected by a sheriff or local corrections agency related to individuals who may have a mental illness is governed by section 641.15, subdivision 3a.\nData collected and maintained by the commissioner of corrections regarding jailhouse witnesses are governed by section 634.045.\nData accessed by the Office for Missing and Murdered Indigenous Relatives is governed by section 299A.85, subdivision 8.",
	"repealed": false
}